{
    "AppID": 536050,
    "Name": "994 W 24th",
    "Release date": "Apr 11, 2017",
    "About the game": "Recommend as a title to watch with great potential by UploadVR -htc-vive-releases-week-040917/ 994 just wants to have some fun. We built 994 as a place to come and play and experiment with VR play. 994 offers a variety of single player and multi-player games within her environment. 3-Defender A VR take on a classic arcade game Escape Shed Try to escape through the shed's back door by solving logic riddles Play alone or with a friend Feel smart and use power tools Foamy Ball Launcher Chase each other around and knock each other out with our permanence based launchers and ammo. Set up a shoot range and try to know things down. Charger Find Single Player- Try to find the phone charger as many times as you can before times runs out. Multi-Player Pick a team Find the phone charger and hang on to it for a minute Item is dropped when player is hit with launcher ball First team to hold it for a total of a minute gets warm fuzzy feel SlapHole Slap dat ball and get it in da hole Play by yourself or with a random stranger Coin Find Use creative means to reach all the coins hidden through out the level Climbing Try to reach a variety of locations with out climbing mechanic Interactive Environments Explore the different interactive elements, find them all More to Come Updated frequently with some exciting additions to come. This is just the beginning!!! We will be continually adding content including new games, areas to explore, and objects to find. Our current plan is to alternate bi weekly between game play additions and 'this should make things not break so often' additions. As this is Early Access we are positive there will be things to fix and tighten as we march towards final release like Frodo to Mordor. We are excited about community comments regarding the game and additions y'all would like to see. Do you's guys want custom avatars? Would you pay for them? Maybe best community suggestion gets a free avatar of their choice? As stated earlier, we aren't focused on AAA presentation because we would rather play a sloppy ball of fun than a highly polished easily palatable turd. Not that there is anything wrong with Assassin's Creed, we even liked Unity! So you can buy now at a cheap rate and come along for the ride or you can sit back, buy it later, and said you owned it all along...hipster. ;)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/536050/header.jpg?t=1493357613",
    "Price": 4.99,
    "Developers": "Fat Finger Foundry",
    "Publishers": "Fat Finger Foundry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/536050/ss_579bf3721f1e98ce5f35cecbc561520a0eac99ae.1920x1080.jpg?t=1493357613,https://cdn.akamai.steamstatic.com/steam/apps/536050/ss_c82087a8e684924039a05039b91683937fb97e6d.1920x1080.jpg?t=1493357613,https://cdn.akamai.steamstatic.com/steam/apps/536050/ss_f9cc855499ed514d4a242191059c3c6517fb710c.1920x1080.jpg?t=1493357613,https://cdn.akamai.steamstatic.com/steam/apps/536050/ss_838406d406007d71666eff10cf8b6c7419365700.1920x1080.jpg?t=1493357613,https://cdn.akamai.steamstatic.com/steam/apps/536050/ss_0bcc12ae9a5982265a34ada0179c803a4d9dcba6.1920x1080.jpg?t=1493357613",
    "Slug": "994-w-24th",
    "Meta Title": "994 W 24th: Apr 11, 2017, Fat Finger Foundry and Full Ove...",
    "Meta Description": "Looking for information on 994 W 24th? Check out the release date (Apr 11, 2017), developer insights from Fat Finger Foundry, and a complete game summary.",
    "Alt Text Image": "Official header image for 994 W 24th game - Steam 536050",
    "Canonical URL": "https://gusku.site/game/994-w-24th",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"994 W 24th\", \"description\": \"Looking for information on 994 W 24th? Check out the release date (Apr 11, 2017), developer insights from Fat Finger Foundry, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fat Finger Foundry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fat Finger Foundry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/536050/header.jpg?t=1493357613\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}