{
    "AppID": 1230140,
    "Name": "ATRI -My Dear Moments-",
    "Release date": "Jun 18, 2020",
    "About the game": "INTRODUCTION A new visual novel game co-produced by 'The Fruit of Grisaia' creators Frontwing and Makura, written by 'If My Heart Had Wings''s Asuta Konno. STORY In the near future, a sudden and unexplained sea rise has left much of human civilization underwater. Ikaruga Natsuki, a boy who lost his mother and his leg in an accident some years earlier, returns disillusioned from a harsh life in the big city to find his old countryside home half-swallowed by the sea. Left without a family, all he has to his name is the ship and submarine left to him by his oceanologist grandmother, and her debts. His only hope to restore the dreams for the future that he has lost is to take up an opportunity presented to him by the suspicious debt collector Catherine. They set sail to search the sunken ruins of his grandmother's laboratory in order to find a treasure rumor says she left there. But what they find is not riches or jewels; it is a strange girl lying asleep in a coffin at the bottom of the sea. Atri. Atri is a robot, but her appearance and her wealth of emotions would fool anyone into think she's a living, breathing human being. In gratitude for being salvaged, she makes a declaration to Natsuki. 'I want to fulfill my master's final order. Until I do, I'll be your leg!' In a little town slowly being enveloped by the ocean, an unforgettable summer is about to begin for this boy and this mysterious robot girl... CHARACTER Ikaruga Natsuki 'What's the point in going to school? It just makes you dumber.' 17 years old (High school, 2nd year) A former student of The Academy, an advanced school in the big city for only the brightest of students. After being forced out, he finds himself living back in the tiny coastal town his grandmother called home. Having lost his mother and his leg at a young age in an accident, he finds himself stricken with terror when forced into dark, silent spaces. In order to obtain the money for an advanced cybernetic leg, he buys into a plan to salvage a hidden treasure from his grandmother's sunken storehouse. Atri 'I'll be your leg, Natsuki-san!' ? years old A robot girl salvaged from the bottom of the ocean by Natsuki. Despite being a robot, her appearance and her ability to express emotion makes her near-indistinguishable from a normal human being. It seems like she served as Natsuki's grandmother's assistant in the past, but she has almost no memory of the time before her long sleep beneath the sea. She asks Natsuki for help restoring her lost memories, such that she can fulfill her former master's last order. Extremely curious and eager to learn, she prides herself on being 'high-performance.' Kamishiro Minamo 'I've come to take you to school, Natsu-kun.' 16 years old (High school, 1st year) A childhood friend of Natsuki, who he met when he came to stay with his grandmother after the accident. A cheerful girl who has never been out of the countryside. Honest to a fault, she's the kind of person who could never do a bad thing willingly. She often finds herself looking after Natsuki. Nojima Ryuuji 'Dude, why don't we start up a salvage business?' 18 years old (High school, 3rd year) A strong and hardy local boy. He's the type who prefers to solve problems with brawn over brains. The son of a local construction firm, the family workshop has unfortunately long been swallowed by the waves. Though he helps out with the work his family still performs, he longs for independence. Straight-talking and reliable, the children of the town view him as their leader. Catherine 'We really have struck the jackpot! This thing will sell for a pretty penny. ♪' ? years old A mysterious, self-proclaimed 'debt collector' who presents Natsuki with a plan to pay off his debts by salvaging his grandmother's sunken treasures. Natsuki has no idea who she is, but he suspects 'Catherine' is not her real name. Seems like a beautiful, enigmatic woman... Until she opens her mouth. Nanami Ririka 'Ah, I bet you're in love with her, aren't you!? She's real pretty, after all.' 10 years old (Elementary school, 5th year) A little orphan girl who lives at the school. Lively and tomboyish, she goes about everything at full speed. A little sister figure to Minamo who causes her all kinds of problems. Her first impressions of Natsuki are less postive, however; she calls him the 'Hitman' because of how scary she finds him. STAFF Concept and Script : Asuta Konno (Frontwing) Art and Character Design : Yusano / Moto4 Music : Fuminori Matsumoto Art Direction : SCA-ji Animation : Yow Background Art : y.ish Development : Frontwing / Makura Production : ANIPLEX.EXE CAST Atri : Hikaru Akao Kamishiro Minamo : Minami Takahashi Nojima Ryuuji : Yoshimasa Hosoya Catherine : Yoko Hikasa Nanami Ririka : Anzu Haruno",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1230140/header.jpg?t=1602740963",
    "Price": 20.99,
    "Developers": "Frontwing,枕",
    "Publishers": "ANIPLEX.EXE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_f9b78a7bbb22cf933a73877b58149aa61f2b1a48.1920x1080.jpg?t=1602740963,https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_47e1f809fa56ab6d48de3c66e3147585b4ee30a2.1920x1080.jpg?t=1602740963,https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_b1398d1db33b83830d9055d5df79f120bad9110d.1920x1080.jpg?t=1602740963,https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_15b6e7f77df0c250efc751769c6ced3c47119a4d.1920x1080.jpg?t=1602740963,https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_858def6c3ca14df78c350d4265fc92dd2111122c.1920x1080.jpg?t=1602740963,https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_2602274780cd3cee2e2a6995300cd720e7a77627.1920x1080.jpg?t=1602740963,https://cdn.akamai.steamstatic.com/steam/apps/1230140/ss_bdbf991588b1589c9efadf9351fc36521ca80e0b.1920x1080.jpg?t=1602740963",
    "Slug": "atri-my-dear-moments",
    "Meta Title": "ATRI -My Dear Moments-: Jun 18, 2020, Frontwing,枕 and Ful...",
    "Meta Description": "Looking for information on ATRI -My Dear Moments-? Check out the release date (Jun 18, 2020), developer insights from Frontwing,枕, and a complete game s...",
    "Alt Text Image": "Official header image for ATRI -My Dear Moments- game - Steam 1230140",
    "Canonical URL": "https://gusku.site/game/atri-my-dear-moments",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ATRI -My Dear Moments-\", \"description\": \"Looking for information on ATRI -My Dear Moments-? Check out the release date (Jun 18, 2020), developer insights from Frontwing,\\u6795, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frontwing,\\u6795\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ANIPLEX.EXE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1230140/header.jpg?t=1602740963\", \"offers\": {\"@type\": \"Offer\", \"price\": 20.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}