{
    "AppID": 1427540,
    "Name": "Attack from Planet Smiley",
    "Release date": "Nov 1, 2020",
    "About the game": "Attack from Planet Smiley is a retro arcade game where the aim of the game is to survive. Survive a horde of angry smiley faces invading your world. The only way to stop them? You. You are equipped with the latest technology and weaponry there is such as lasers, nukes, and even larger lasers, so when you die, it's all over. Tag along with a couple friends in the 2-3 Player modes while listening to a mix of three retro-space songs that will get you fired up and ready to burst some happy faces. But, if even one smiley face touches any of you or gets to your side of the battlefield, it's game over - even one smiley face will wipe out the entire planet. Also, after a while a gigantic boss Smiley will trot along, and even another if you take your time, so don't try use any small pebbles against these guys - they'll take a massive beating and come out smiling, cough cough unless you use some of those bigger things, ah yes, nukes. Oh, and they have a gun to shoot you back too, don't worry though, you can blow up those bullets as well! Overall, have fun, and don't get too happy shooting up all 'em smiley faces, ironic right? Soon enough, they'll overrun you, leaving you only with the honest score you worked so hard to achieve - and the scores come in different colours too! (Hint: you'll get pink if you do really well. Like reeaally well). Even though much of it may be up to chance, you'll be sure to get a good enough score eventually after you get addicted to the game. Good luck! There may also be a few bugs and missing info like the number of smileys that you've killed... those are being worked on at the moment and I would appreciate if you would give any feedback on anything that goes wrong on your game. (ALSO NOTE: Holding down too many keys at once, especially for co-op, will cause some keys to not work at the same time e.g. up, shoot and left at the same time. This is due to the typical lack of threading involved in Gamemaker 8.1 and I am working on adding threading through inserting code into the game in the near future).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1427540/header.jpg?t=1604273166",
    "Price": 3.99,
    "Developers": "William Good",
    "Publishers": "William Good",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1427540/ss_2224df17bfe46c1f93a51ec9b3a0f8463a81acdb.1920x1080.jpg?t=1604273166,https://cdn.akamai.steamstatic.com/steam/apps/1427540/ss_246b1e0489463f51899e879ecc24eb7d3534108f.1920x1080.jpg?t=1604273166,https://cdn.akamai.steamstatic.com/steam/apps/1427540/ss_897b2c1a39b86181320ff74680e2c1439a3762eb.1920x1080.jpg?t=1604273166,https://cdn.akamai.steamstatic.com/steam/apps/1427540/ss_21b34862c387556a6abdcc8b48f701d74062d1d0.1920x1080.jpg?t=1604273166,https://cdn.akamai.steamstatic.com/steam/apps/1427540/ss_7925d098a872dab3d821cb13de5f13d80132bb2a.1920x1080.jpg?t=1604273166",
    "Slug": "attack-from-planet-smiley",
    "Meta Title": "Attack from Planet Smiley: Nov 1, 2020, William Good and ...",
    "Meta Description": "Looking for information on Attack from Planet Smiley? Check out the release date (Nov 1, 2020), developer insights from William Good, and a complete gam...",
    "Alt Text Image": "Official header image for Attack from Planet Smiley game - Steam 1427540",
    "Canonical URL": "https://gusku.site/game/attack-from-planet-smiley",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Attack from Planet Smiley\", \"description\": \"Looking for information on Attack from Planet Smiley? Check out the release date (Nov 1, 2020), developer insights from William Good, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"William Good\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"William Good\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1427540/header.jpg?t=1604273166\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}