{
    "AppID": 914750,
    "Name": "Bee Simulator",
    "Release date": "Nov 17, 2020",
    "About the game": "When the first rays of sunlight rise above the horizon, the beehive slowly wakes up. Hierarchy and diligence are vital for the wellbeing of the whole swarm. So you check your wings, measure the antennae degree of deviation, take orders from the Queen, and bee-gin your first independent mission. And that's just the beginning of your adventures. Suddenly, you learn that people want to cut down the tree that holds your hive. Now your fate – and the fate of your whole family – lies in your small, agile legs and fast wings! Take part in a race and show your sisters who has the fastest wings in the swarm! The world of bees is not as carefree as one may think. Wasps and some of the less friendly people will take any chance to ruin your plans. Don't hesitate to use your sting to save your swarm from enemies. You are the master of air acrobatics. Your sisters are eager to mirror your smooth dance moves. So perform your famous waggle dance and show them the way back to the hive. Explore the park thoroughly – visit even the deepest corners to look for rare plants and special flowers in order to collect the best pollen. • A unique chance to see the macro scale world from the micro perspective of a honeybee; • A realistic representation of a place inspired by Central Park; • Three diverse modes enriched with educational elements: - One-player story mode presents you with a family of bees. Will you save the hive from the threat of human beings? - Exploration mode allows you to freely discover a world inspired by Central Park in New York - Split-screen mode can be either used for cooperation or competition. It includes an additional maps that make the game even more fascinating.* • A possibility to interact with the surroundings: people, animals, plants, and other insects; • Lack of violence – it's a perfect choice for parents seeking a game to safely play with their children; • Relaxing music composed by Mikołaj Stroiński, who was responsible for the soundtrack of such games as The Witcher 3 and The Vanishing of Ethan Carter. *Please note a controller is required for local multiplayer",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/914750/header.jpg?t=1621585923",
    "Price": 19.99,
    "Developers": "VARSAV Game Studios",
    "Publishers": "Nacon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/914750/ss_4d5b856bbe27e4f0a54cfa0dedf32f965cc5f993.1920x1080.jpg?t=1621585923,https://cdn.akamai.steamstatic.com/steam/apps/914750/ss_598185d73fdb841b3708fbf4ba9327a01228d209.1920x1080.jpg?t=1621585923,https://cdn.akamai.steamstatic.com/steam/apps/914750/ss_59f7a2ed6b4471da4b2e2c945f9fb694d56597f5.1920x1080.jpg?t=1621585923,https://cdn.akamai.steamstatic.com/steam/apps/914750/ss_13797eaddc95437dcd2a4a2775b335a71675ee3a.1920x1080.jpg?t=1621585923,https://cdn.akamai.steamstatic.com/steam/apps/914750/ss_4174dbbb2f73806f2401a359ec982f13e2047903.1920x1080.jpg?t=1621585923",
    "Slug": "bee-simulator",
    "Meta Title": "Bee Simulator: Nov 17, 2020, VARSAV Game Studios and Full...",
    "Meta Description": "Looking for information on Bee Simulator? Check out the release date (Nov 17, 2020), developer insights from VARSAV Game Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Bee Simulator game - Steam 914750",
    "Canonical URL": "https://gusku.site/game/bee-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bee Simulator\", \"description\": \"Looking for information on Bee Simulator? Check out the release date (Nov 17, 2020), developer insights from VARSAV Game Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"VARSAV Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nacon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/914750/header.jpg?t=1621585923\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}