{
    "AppID": 957280,
    "Name": "COUCH VERSUS",
    "Release date": "Jan 23, 2019",
    "About the game": "COUCH VERSUS is a unique 2 players asymmetric versus game where players can be both the HERO and MONSTERS competing for victory. Before the start of the match, the HERO player closes his/her eyes while the MONSTERS player devises a plan by hiding 4 portals on the map and choosing 4 monsters to spawn during the match. When the match starts the HERO player opens his/her eyes and the MONSTERS player can use the shoulder-buttons to open and close the portals and the face buttons to spawn the monster assigned to the specific button in real-time. (the number of monsters on screen at the same time is limited) The HERO player can jump around and shoot the monsters trying to figure out an opening in the MONSTERS plan. The game really shines when both players know how the other thinks. MODES 1-Versus Mode: Control either the HERO or MONSTERS competing in a best of 3, 5 or 7 rounds. (Two-Players) 2-Arcade Mode: An hour-long campaign consisting of a series of levels showcasing the MONSTERS abilities and their combination strategies. (Single-Player) 3-Endless Mode: Survive endless waves of monsters with a constant increase in the speed of the game. (Single-Player) !!TWO CONTROLLERS ARE REQUIRED TO PLAY 2PLAYERS MODES!! THE MONSTERS: Just walks forward. Basic, cheap and useful. More complex and more expensive version of its red brother. Turns toward the HERO if it sensed him behind it. Hard to use but can be very effective. It walks slowly and can duck under small shots. Forces the HERO to charge which hinders the HERO's mobility. Can sneak up on the HERO in the middle of the chaos. Eats any shots in front of it. Can be used to protect the MONSTERS behind it, to force the HERO to change position and to corner him in tight spaces. Moves toward the HERO from any angle, it can even go through walls. Useful in adding pressure on the HERO and sneaking up on him. Flies in a straight line. Effective in securing escape routes for the HERO. Can be commanded to get planted on the ground. once planted it cannot be shot or removed until it rots. while planted it shoots pollen grains when the HERO come close to it. Crawls along walls. can be commanded to fall downward. Very fast but gets destroyed quickly. leaves a trail of lava behind it. The lava quenches when shot. Can be commanded to sit and form an energy cage. The cage acts as a wall blocking both the HERO and MONSTERS. Useful in shaping the level to your liking. the cage is destroyed after a couple of shots and reappears after a few seconds. USE YOUR IMAGINATION AND SYNCHRONIZE THE MONSTERS ABILITIES TO DEVISE PLANS OF YOUR OWN!! CONTROLS:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/957280/header.jpg?t=1548265239",
    "Price": 2.99,
    "Developers": "Mubarak AlKhuzaee",
    "Publishers": "Mubarak AlKhuzaee",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_4f16d9d7199d747ec2bd7748ba6a07634ba70cf7.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_00200a7d8c5fba9d7ec19ea9ee604b6965f7d1a4.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_93bf1c16c849e761a849b1a2d5e883e7b1d21e49.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_b00124313455c4ff4ac6709099cc17ac338599cf.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_991138899608aa3b7b0e2e3ec5707dbf793d6e50.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_5ef910f6cfb23aba01cc22d07134449f98753a95.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_4d83ea586bf160957094e7561faad027ee00775d.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_69eaf3a376cc012f6815a57cbaafe95bf59f8f21.1920x1080.jpg?t=1548265239,https://cdn.akamai.steamstatic.com/steam/apps/957280/ss_4818305fcabdd8c5101c0c2cba5bd70bde0ebc81.1920x1080.jpg?t=1548265239",
    "Slug": "couch-versus",
    "Meta Title": "COUCH VERSUS: Jan 23, 2019, Mubarak AlKhuzaee and Full Ov...",
    "Meta Description": "Looking for information on COUCH VERSUS? Check out the release date (Jan 23, 2019), developer insights from Mubarak AlKhuzaee, and a complete game summary.",
    "Alt Text Image": "Official header image for COUCH VERSUS game - Steam 957280",
    "Canonical URL": "https://gusku.site/game/couch-versus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"COUCH VERSUS\", \"description\": \"Looking for information on COUCH VERSUS? Check out the release date (Jan 23, 2019), developer insights from Mubarak AlKhuzaee, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mubarak AlKhuzaee\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mubarak AlKhuzaee\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/957280/header.jpg?t=1548265239\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}