{
    "AppID": 1359740,
    "Name": "CyberLink PowerDirector 19 Ultimate",
    "Release date": "Dec 23, 2020",
    "About the game": "Powerful Tools, Infinite Possibilities, Inspiration Included Unleash your creativity with the high-end performance and precision of PowerDirector 19. Harness the power of professional editing tools with an intuitive user interface, take advantage of a massive stock library, and bring your video ideas to life with monthly design packs. Mask Designer Create hyper-realistic image composites or expressive surrealist shots with our new advanced mask tools. Cut and combine images from different clips with unparalleled precision. Dynamic Keyframe Controls We’ve enhanced keyframing to provide more control over anchor points enabling dynamic motion as well as a new hold interpolation mode to apply your effects where you want them when you want them. Customizable Motion Graphic Titles Introduce every scene with an epic title. Use one of our stunning, ready-to-use motion graphic titles and customize the text and shape color to match your style. Sketch Animation Overlays Create the perfect tutorial video with animated sketch templates. Customize the size and color to match your style. Refine and Match Colors, Fast Set the tone. Keep color consistent across clips with one click or manually adjust the hue, saturation and brightness to match your look. Add Customized Shape Objects Insert customizable vector shapes with auto-fit text and precise keyframe controls. Choose from a wide range of text bubbles and callouts. Dynamic Title Reveals Get complete control over title animations and appearance with advanced tools to mask and reveal titles. Green Screen Editing Perform Hollywood-style green screen editing thanks to an improved chroma key engine and multi-key color sampling. Intuitive Motion Tracking Ensure 100% object tracking accuracy in your video clips with frame-by-frame motion tracking for both shapes and titles. Title Templates Enhance your projects with a large collection of cinematic titles. Transitions Turn your videos into spectacular productions using glitch effects, distortions and more. Color Grading Presets Achieve a precise style or mood throughout your production using LUTs. Music &amp; Sound Effects Create immersive videos with background music and sound effects. Fast, by Design Don’t waste time waiting for your software to respond! Experience a superior editing performance with Intel 10th gen CPU optimization. Professional Grade Support Import and edit video shot on professional-grade cameras and in HEVC &amp; VP9 10bit HDR10 &amp; HLG, ProRes 10bit 4:2:2, XAVC 8bit 4:2:0 and MXF AVC 8bit 4:2:0 video compatibility. As well as support for AAC 5.1ch sound output.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1359740/header.jpg?t=1642597154",
    "Price": 99.99,
    "Developers": "CyberLink",
    "Publishers": "Deep Silver,CyberLink",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1359740/ss_9d08186b53360b23af4a0dab79d28ef3ce264a4e.1920x1080.jpg?t=1642597154,https://cdn.akamai.steamstatic.com/steam/apps/1359740/ss_86a34c73a608349d58004bd6bdab4847a791675f.1920x1080.jpg?t=1642597154,https://cdn.akamai.steamstatic.com/steam/apps/1359740/ss_d9c469567796f3af3eae13ee8c10e29082112fa0.1920x1080.jpg?t=1642597154,https://cdn.akamai.steamstatic.com/steam/apps/1359740/ss_afb654d5f4c3e1ebeebc8dd1cc8fc2e7592c17f6.1920x1080.jpg?t=1642597154,https://cdn.akamai.steamstatic.com/steam/apps/1359740/ss_8060469fdbde522ff1ecc9e7b4fe36bcdffde481.1920x1080.jpg?t=1642597154,https://cdn.akamai.steamstatic.com/steam/apps/1359740/ss_78613f9da0c62978556e41a22c576b55006f43d0.1920x1080.jpg?t=1642597154",
    "Slug": "cyberlink-powerdirector-19-ultimate",
    "Meta Title": "CyberLink PowerDirector 19 Ultimate: Dec 23, 2020, CyberL...",
    "Meta Description": "Looking for information on CyberLink PowerDirector 19 Ultimate? Check out the release date (Dec 23, 2020), developer insights from CyberLink, and a comp...",
    "Alt Text Image": "Official header image for CyberLink PowerDirector 19 Ultimate game - Steam 1359740",
    "Canonical URL": "https://gusku.site/game/cyberlink-powerdirector-19-ultimate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink PowerDirector 19 Ultimate\", \"description\": \"Looking for information on CyberLink PowerDirector 19 Ultimate? Check out the release date (Dec 23, 2020), developer insights from CyberLink, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep Silver,CyberLink\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1359740/header.jpg?t=1642597154\", \"offers\": {\"@type\": \"Offer\", \"price\": 99.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}