{
    "AppID": 589410,
    "Name": "Dammerlicht",
    "Release date": "Feb 16, 2017",
    "About the game": "Summary Dämmerlicht is a game based around the many worlds theory, where the actions of the player create alternate universes and allow you to experience each potential path the game world could take. About Dämmerlicht is mostly an adventure game. The most important aspect of this game is that it is based on the many worlds theory (an explanation of this theory follows). The game is level based, meaning that you don't run around a big open world. Instead you have a level select screen that represents the map of the game world, and the various worlds that your choices create. Each level takes place in a selected area (Your house, the village, a forest...) and possesses many possible outcomes that are unlocked by doing different actions. Short example: You could join the king, unlocking a level which is the universe where our hero joins the king. Then you could attempt this level again but instead kill the king, unlocking a new level which is a completely different universe than the previous one since in this universe, the king is dead. Not every single action in the game has a different outcome. but the player has the option to attempt to unlock every possible outcome of this world. Each path will be different and in each one of those, the player will experience different things: pure combat, love story, research, treason, or even all at once! Things to expect from the game: Between 1 to 4 hours of gameplay(depending on how long it takes the player to find each endings) 19 playable levels that unlocks a total of 25 endings (some similar other completely different) Diversified dialogues through a nice dialogue system Interesting, simple combat system, and different enemy types. No procedural generation--every single thing in the game is carefully placed A story-rich game Things you won't get in this game: This is by no mean a roguelike or an rpg No procedural generation No crafting No dungeon ... Story Dämmerlicht takes place in a medieval fantasy inspired universe where strangely everything is named after some sort of a tableware. The Kingdom of the Small Cup is the smallest kingdom to be known in the Table World. Even if the Small Cup is lacking the military force of the Butcher's Knife Kingdom, or the economic power of the Silverware Kingdom, it lives fairly in peace providing well being to all its inhabitants. Following strange phenomenon and a spontaneous event, the Table World saw itself changed. This event started to cause frenzy among the inhabitants of this world, as well as increase the relentless behavior of monsters who in the past weren't aggressive unless provoked. Consecutively, the tension started to rise all around the Table World. Kingdoms started to suspect each other, while others tried to solve this problem together. The royalty aren't the only affected, however, as some people see their family and friends fall into insanity and begin doubt the rulers above them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/589410/header.jpg?t=1487649893",
    "Price": 0.99,
    "Developers": "Royal Tea Time Studio",
    "Publishers": "Royal Tea Time Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_b1026227c082e1c6f77b931ce88a9535205c8bc2.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_b45ddc1f40144754f6ab773505064d2f93fe24f9.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_48ad38e6042c8d52d692bbc989a944141cb7f99d.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_8e71fb2fb2fcf41ca3a806546e05266576f42ec1.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_0815153fcbbd84f921e985675edbd92585ad368a.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_4259a494e8a61f861e4a86bd211a66e9cf35fe81.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_41dfd8a001fc3fa94ad798481223af6780d21619.1920x1080.jpg?t=1487649893,https://cdn.akamai.steamstatic.com/steam/apps/589410/ss_1c333a3a8eb1ea1be51615c75a7d30d2aeedab6b.1920x1080.jpg?t=1487649893",
    "Slug": "dammerlicht",
    "Meta Title": "Dammerlicht: Feb 16, 2017, Royal Tea Time Studio and Full...",
    "Meta Description": "Looking for information on Dammerlicht? Check out the release date (Feb 16, 2017), developer insights from Royal Tea Time Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Dammerlicht game - Steam 589410",
    "Canonical URL": "https://gusku.site/game/dammerlicht",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dammerlicht\", \"description\": \"Looking for information on Dammerlicht? Check out the release date (Feb 16, 2017), developer insights from Royal Tea Time Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 16, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Royal Tea Time Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Royal Tea Time Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/589410/header.jpg?t=1487649893\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}