{
    "AppID": 573120,
    "Name": "Dead In Vinland",
    "Release date": "Apr 12, 2018",
    "About the game": "DEAD IN VINLAND is a survival/management game, mixed with RPG and adventure elements, about a Viking family trying their best to survive on a mysterious island. Exiled on a faraway and unknown land, lead Eirik and his family on their quest to survive . Manage their physical and mental health, explore the island , organize your camp and deal with other human beings. Some will help you, and some will be less... friendly. Unveil the esoteric mysteries of Vinland . They could save your life… or lead you to your demise. KEY FEATURES Deep survival management simulation : find and gather resources, secure a supply of food, take care of the mental and physical health of your characters, fight diseases and wounds, ration your water supplies, endure the elements (storm, drought, rain…). Challenging : the game is turn-based so you have time to take the best decisions, but the challenge is high! You’ll have to adapt to the crisis the game throws at you, with your own reasoning. 3 modes of difficulty : if you just want to enjoy the story, we added an easy mode and, for the crazy lunatics, we added both an extreme difficulty and iron man mode, that even the developers of the game can’t beat! Build your camp : expand your shelter with 18 activity stations, each one with its own mechanics. Craft more than 130 upgrades and dozens of items to give you precious bonuses. Choose well, you won’t be able to craft everything. Manage a community : 14 playable characters, each one with their own strengths, flaws and stories. Influence how their relationships evolve with meaningful dialog choices, achieve one of the 7 possible romances or kick annoying characters from your camp and recruit new ones. And some surprises! Explore the island : 150 areas to discover with hundreds of objects to interact with. Unveil the many secrets of the island and its beautiful, hand-painted landscapes. Don’t just survive, settle : you can hunt, harvest, fish… but you can also grow a garden and breed sheep! Advanced camp stations with special mechanics. Live your own adventure : complete 70 non-linear quests to reach the end of the game. Depending on your choices, learn about what happened to your characters after the end. Animosity and tribute system : be “welcomed” by the infamous tyrant Björn Headcleaver and his merry band of robbers. Bend the knee and pay him weekly tributes, or rebel… and face the consequences. Full RPG system : 5 health states to care for, 20 skills to develop, more than 600 character traits, 100 items to collect, 30 diseases and 20 wounds to die from… Customize your characters: choose from 5 randomly generated special traits every time they level up. Turn-based tactical combat : quick and deadly 3 vs 3 battles against Björn’s minions. 5 unique playable character classes, each with its own set of fighting skills, and 5 passive classes. HUGE content : more than 150 000 words - twice the size of the first Harry Potter book - telling a mature yet humorous story.             DEAD IN VINLAND is the second installment in the “Dead In…” universe, after DEAD IN BERMUDA. The two games are standalones, but you’ll learn a bit more about the secrets behind these strange islands and the general background in each game of the series.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/573120/header.jpg?t=1656515898",
    "Price": 19.99,
    "Developers": "Ishtar Games",
    "Publishers": "Dear Villagers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_dd5057e3b9d887d5596ea641310e4362a60a9dd9.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_8b54bded6973426e53ceb8c049b52cad5eb278bc.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_b82cccb7698cd6e5b77638358f4875c58e13d426.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_c357c21a03293bf74b2d576cd1a567bc332abefe.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_963c91958d6970924feacee50a065c4ce8b23af8.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_cfaf4b4ed40291e2c86f316941bd61059ca20994.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_271eaf794ee99324573efc0006e12a58171f17d3.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_feedb895601cca461f65c17f94aaefcf2e90f153.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_f6d9b631b9dc178c07d5532e68a5286ccbf16a9b.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_78982755275bd6e25fc7a030c3e136b4cc6616f9.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_088d25f7d6d30fd4062f2f24124b38dc2d5c0b52.1920x1080.jpg?t=1656515898,https://cdn.akamai.steamstatic.com/steam/apps/573120/ss_94b6f4b2ff24265335d0a99bcf247d372516264c.1920x1080.jpg?t=1656515898",
    "Slug": "dead-in-vinland",
    "Meta Title": "Dead In Vinland: Apr 12, 2018, Ishtar Games and Full Over...",
    "Meta Description": "Looking for information on Dead In Vinland? Check out the release date (Apr 12, 2018), developer insights from Ishtar Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Dead In Vinland game - Steam 573120",
    "Canonical URL": "https://gusku.site/game/dead-in-vinland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dead In Vinland\", \"description\": \"Looking for information on Dead In Vinland? Check out the release date (Apr 12, 2018), developer insights from Ishtar Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ishtar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dear Villagers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/573120/header.jpg?t=1656515898\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}