{
    "AppID": 759570,
    "Name": "Decay of Logos",
    "Release date": "Aug 30, 2019",
    "About the game": "Embark on a journey of revenge and betrayal set in motion by the destruction of our young adventurer's village at the hands of Crimson Knights. Find solace in your mystical elk companion as you battle the unforgiving foes that roam this once peaceful realm. Venture into ancient ruins and dungeons in search of their rewards in a quest to find the truth behind the attack of Ada’s home. Take heed - there’s a dark and treacherous force at work in this world that corrupts even its inhabitants. Third-person action/adventure RPG with an emphasis on player exploration and minimal hand-holding. Challenging combat with high risk-reward battle system; various short and long-range weapons featuring different move sets, combos, and ancient magic. Elk companion system; strengthen your bond with the mystical elk as you solve environmental puzzles and unravel sinister mysteries. Deep lore and intricate voice-acted narrative that will leave you guessing until the end of your journey through the far-reaching ancestral high-fantasy world of Decay of Logos. Her village destroyed, she traveled North with her elk companion hoping to find any clues about those who wronged her. You’ll start in the outskirts of the Laetus Grove, only to find that all is not what it seems - strange hostile dwellers with wooden bodies and vacant eyes now patrol this land... Lock-on to enemies for a more tactical approach; parry, dodge and counter-attack while always keeping your stamina in check as you deliver deadly blows and combos. Prepare your battles ahead by using the elk's secondary inventory to store a variety of short and long range-weapons, defense gear, and potions. Set in a far-reaching and interconnected semi-open world, you’ll explore a divided kingdom once ruled by a warring King. Tragedy struck when his beloved Queen died during childbirth - the royal family was irreversibly broken and the King’s sons drifted apart, each claiming a piece of the realm. Make your way through the lush woodland, the great Howling Rift, degraded swamps, ancestral grounds and many other unique locations. You’ll travel alone with your companion, facing off the likes of giants and many other mystical foes while clearing the path by solving ancestral environmental puzzles. With a will of its own, and more than a mount, you must strengthen your bond by petting and feeding the elk before you can ride it. Ada will come across several charismatic NPC's along the way; fully voice acted, they're a good source of lore, guidance and items. Decay of Logos invites player exploration with minimal hand-holding by using a minimalistic interface while relying on environmental cues and dialogue for guidance. Ada even displays all gear and items on her while animations reflect her physical state. Leveling is fully automated and based on your play style, Ada gains stats when you kill an enemy, activate a mechanism or even when finding a secret chest.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/759570/header.jpg?t=1587728173",
    "Price": 4.99,
    "Developers": "Amplify Creations",
    "Publishers": "Rising Star Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_51d7a60e822d1e4d1f30d0630be0554f6e5b5678.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_42bdb1f255560281d48ec18bbc34eec05f70d1d8.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_77828f2527b5150f2f1b9a22ffc9afd16e57e6c2.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_db7159d80e427dd38a71a304b0f6136cf76b147c.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_1757dcac46db6be54baca9e2ad7312b44b753a70.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_fc9a819702083cdb19cc99e00b1a09c4d496a96c.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_d8554ed3ff78c5a03547cfa152885e701b81c619.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_f2594f3c9e511e191cd0afce4f203626fc3983e8.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_a922315469606b34b264cc95cab873d2db4690c3.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_58fe770b314e32a1f64e9ea21b26ecddd5a30b8e.1920x1080.jpg?t=1587728173,https://cdn.akamai.steamstatic.com/steam/apps/759570/ss_76f730ae371270068ff6f14dea4224bdc9ce7412.1920x1080.jpg?t=1587728173",
    "Slug": "decay-of-logos",
    "Meta Title": "Decay of Logos: Aug 30, 2019, Amplify Creations and Full ...",
    "Meta Description": "Looking for information on Decay of Logos? Check out the release date (Aug 30, 2019), developer insights from Amplify Creations, and a complete game sum...",
    "Alt Text Image": "Official header image for Decay of Logos game - Steam 759570",
    "Canonical URL": "https://gusku.site/game/decay-of-logos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Decay of Logos\", \"description\": \"Looking for information on Decay of Logos? Check out the release date (Aug 30, 2019), developer insights from Amplify Creations, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Amplify Creations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rising Star Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/759570/header.jpg?t=1587728173\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}