{
    "AppID": 1704630,
    "Name": "Dogfight: 80 Years of Aerial Warfare",
    "Release date": "Jan 21, 2022",
    "About the game": "Falkland Islands, June 1982. Even in Summer there is a chill to the crisp morning air as the British Task Force launches its fighters. The Argentine air force responds, and soon the air is filled with …. Spitfires and Mirages? Welcome to Dogfight, the flight combat simulator that lets you create fascinating what-if scenarios. First published in 1993 by Microprose, Dogfight: 80 Years of Aerial Warfare was described by PC Zone Magazine as “a gift for the imagination” that “concentrates on the most important section of a flight sim, the dogfight.” Dogfight provides three game modes that focus on pure air combat simulation. Duel mode puts you into the cockpit in a one-one one battle right out of the gate. In Mission mode you select from one of six theaters of war, then choose to patrol, attack a target, support other aircraft in an attack, or defend your territory. For more modern missions you also get to select which armaments to carry into battle. What If mode you allows you to mix and match any of the 12 aircraft with any of the missions. What to test your skills in a Spitfire against a Mirage of Syria? Have at it. Dogfight is a classic PC flight combat simulator that provides countless hours of gameplay. 12 legendary fighter aircraft spanning 80 years of warfare Authentic cockpits with fully functioning instruments Third-person and first person view with realistic all-around cockpit vision Three game modes: Duel, Mission and What If Six accurately mapped historical scenarios Strategic mission planning, including resource allocation, support, patrol and defence operations Detailed manual Aircraft include the Sopwith Camel, Fokker DRT, MkII Supermarine Spitfire, Messerschmitt Bf109E, North American F-86E, McDonnell Douglas F-4f Phantom II, British Aerospace Sea Harrier FRS: 1, Dassault Breguet Mirage IIIE, General Dynamics F-16A Flying Falcon, MiG 23 “Flogger 8”, and Mikoyen-Gurevich MiG-15. Scenarios include WWI over Northern France, WW2 over Channel and English coast, North Korea between the Kimpo airfield and Yalu river, Vietnam over Hanoi and Haiphong, the Falkland Islands over Port Stanley, and the Six Day War over the Bekaa Valley and the Golan Heights. The term dogfight has been applied to combat for centuries, but it wasn’t until WWI when the term was applied to aerial combat. A famous usage, and perhaps the first time the term was used to describe aerial combat, was in a London Times article describing the death of Captain Baron von Richtofen … the Red Baron. Oddly enough, the famous pilot was killed during a dogfight not by another airman, but by ground fire.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1704630/header.jpg?t=1643669284",
    "Price": 6.99,
    "Developers": "Microprose",
    "Publishers": "Atari",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1704630/ss_e1dd11f4c24eb323f249dd6a3961816000bb3b02.1920x1080.jpg?t=1643669284,https://cdn.akamai.steamstatic.com/steam/apps/1704630/ss_37bc52f895c7b6a70b26d6e1b93b13ba028761c2.1920x1080.jpg?t=1643669284,https://cdn.akamai.steamstatic.com/steam/apps/1704630/ss_1c65ed9424da5e2fe04221ae40be8057518b302e.1920x1080.jpg?t=1643669284,https://cdn.akamai.steamstatic.com/steam/apps/1704630/ss_8d04ad22aefe8c12059da94de5f00e34e5384cc5.1920x1080.jpg?t=1643669284,https://cdn.akamai.steamstatic.com/steam/apps/1704630/ss_96a3dbad4b2a8c3bee79541ba6bf34a91676f4ae.1920x1080.jpg?t=1643669284,https://cdn.akamai.steamstatic.com/steam/apps/1704630/ss_7dc72996e7b9582f9161e5e20d84985457f42eee.1920x1080.jpg?t=1643669284",
    "Slug": "dogfight-80-years-of-aerial-warfare",
    "Meta Title": "Dogfight: 80 Years of Aerial Warfare: Jan 21, 2022, Micro...",
    "Meta Description": "Looking for information on Dogfight: 80 Years of Aerial Warfare? Check out the release date (Jan 21, 2022), developer insights from Microprose, and a co...",
    "Alt Text Image": "Official header image for Dogfight: 80 Years of Aerial Warfare game - Steam 1704630",
    "Canonical URL": "https://gusku.site/game/dogfight-80-years-of-aerial-warfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dogfight: 80 Years of Aerial Warfare\", \"description\": \"Looking for information on Dogfight: 80 Years of Aerial Warfare? Check out the release date (Jan 21, 2022), developer insights from Microprose, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Microprose\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atari\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1704630/header.jpg?t=1643669284\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}