{
    "AppID": 977650,
    "Name": "DwarfHeim",
    "Release date": "Sep 27, 2021",
    "About the game": "DwarfHeim is the next generation of co-op RTS games. DwarfHeim innovates strategy games with thrilling co-op and team gameplay mechanics, where each class depends on one-another to succeed. Choose between playing as a Miner, a Warrior or a Builder and work together to gather resources, expand your city and defeat the constant threat of troll attack. Ultimately, you’ll need to crush the rival clan before they come for you! The Next Generation of Co-op RTS – DwarfHeim innovates the RTS genre with thrilling asymmetric gameplay mechanics, where each class depends on one-another to succeed. Single and Multiplayer - DwarfHeim boasts multiple game modes, team up with two other players in one of Dwarfheim’s multiple game modes or, take on the challenges Agartha holds in single-player. Choose Your Class – Builder, Miner Or Warrior! Devise your strategies and choose which units, buildings and technology best serves you and your clan. Each class must cooperate to withstand the harsh environment or destroy the opposing team’s Town Hall. Select your Thane - Play as 6 different heroes, all with their unique skills and abilities to further your clans reach. Lay of the Land(s) – Each map in DwarfHeim is a battle on two fronts; The Builder expands your settlement Overworld, the Miner digs for resources in the Underworld, the Warrior protects and attacks on both sides. DwarfHeim's Mighty Thanes Each class has two powerful heroes to choose from, each with their own specialties and unique abilities. Every Thane has undergone rigorous training, they’re great assets to be utilised for comebacks when a game isn’t going your way! They can even assist other classes with their tasks. Online Co-op RTS Play DwarfHeim with your friends, either in Conquest mode where your team plays against another team (not for the faint at heart), Survival (VS Environment), or Skirmish (VS AI). All players and classes share the common goal of growing their Dwarven Clan. Develop and expand your settlement together by gathering, sharing and spending resources. Research DwarfHeim’s technologies for all 3 classes, granting buffs, new units and defences (we recommend trying the hearty ales) Choose Your Class DwarfHeim has 3 unique classes to choose from. Builder: The Builder Class and their units support the team by healing units, building defenses and houses, creating farms, and concocting soothing brews. Miner: Focus on gathering and refining resources, building machinery and traps, and blowing up defenses and buildings. Warrior: Train your army and defend the town. Slay creatures to get gold and equip your army with legendary weapons to destroy the enemy team. Do you prefer to battle it out as a grizzled Warrior, or are you better suited to creating complex underground structures for gathering resources? DwarfHeim's Game Modes There are multiple game types for the player who likes to play with friends, or go solo. Single Player Modes: Survival - A gruelling and fast-paced challenge mode. Test your strategies and strength with the various difficulty settings. Challenge yourself and try to outlive the onslaught of troll waves that come your way in the Survival mode. Skirmish - Put your strategies to the test in this Single-Player mode. Pit your Dwarves against an AI-controlled rival clan in a series of maps and destroy the other Dwarven settlement before they come for you! This Single-Player mode can be played Solo (1 Human VS AI Team) or with a friendly AI (1 Human &amp; friendly AI VS enemy AI). Sandbox - A more relaxed game mode for the player who likes to take their time. Expand your settlement across the map. Build your own experience, and create your perfect settlement in the Sandbox mode. Learn more about our game modes in our community post . Multiplayer &amp; Co-op Modes: Conquest - A competitive 3V3 game where opposing teams race for supremecy. Choose a class, join up with two other players and work together to tear through the enemy team’s defenses and destroy their Town Hall. Survival -This challenging game mode is also available in online Co-op with two other players. More hands makes easier work, but can you work together in order to survive long enough?.. A great way for players to learn each others' strengths and weaknesses before taking on teams in Conquest. Skirmish - Form your Dwarven clan with two others and take on an AI-controlled rival clan in a series of maps each with a different set of challenges. Test your multiplayer mettle with friends and prove how mighty you truly are! Sandbox - This creative game mode is available in online co-op with two other players. Take your time and work together to expand your settlement both in the Underworld and overground. Original art and soundtrack We believe in good old fashioned, home-made produce. At Pineleaf everything from the code, to the art and the audio is made in-house to ensure that the game lives up to our expectations and yours.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/977650/header.jpg?t=1651569651",
    "Price": 24.99,
    "Developers": "Pineleaf Studio",
    "Publishers": "Merge Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_0d207b45d0fe37e7585756e67b2a03c76f558621.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_bd9195dd74582d171d57c3b9220a201956bc9617.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_b854cf55c336c5c46fb640081de82c9ae4afb1d6.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_44a4f2f06e2e5432d91f79a6312b1cc87dc03191.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_c68ddb82d1b535fd56216dc2a469d9b3b78237ba.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_6e0634a1b811633929af9311a5ed03100bd04da1.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_d3926b07a66f37f6e51639a7cc13a97272198fd0.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_aa4217244346df541e9908a1d342b209dfe017f7.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_6a923bd0581c152d88dfa846cedc0121b3341985.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_254c782994a1cb46f89c1dfd74aeb7027baa40d4.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_663896bfab0f8f42a25cc8bb0988dd97f9e5d828.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_0819ef754e51f93750c6255f94b74234b175a7c2.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_d91f4f73f5d964ebdccaa3efb3b019ed3e47431e.1920x1080.jpg?t=1651569651,https://cdn.akamai.steamstatic.com/steam/apps/977650/ss_58633d1fc8da6267d072625f933320d311ff94ba.1920x1080.jpg?t=1651569651",
    "Slug": "dwarfheim",
    "Meta Title": "DwarfHeim: Sep 27, 2021, Pineleaf Studio and Full Overview",
    "Meta Description": "Looking for information on DwarfHeim? Check out the release date (Sep 27, 2021), developer insights from Pineleaf Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for DwarfHeim game - Steam 977650",
    "Canonical URL": "https://gusku.site/game/dwarfheim",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DwarfHeim\", \"description\": \"Looking for information on DwarfHeim? Check out the release date (Sep 27, 2021), developer insights from Pineleaf Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pineleaf Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Merge Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/977650/header.jpg?t=1651569651\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}