{
    "AppID": 587000,
    "Name": "First Strike: Classic",
    "Release date": "May 30, 2017",
    "About the game": "Millions of commanders already played First Strike all over the world. Now it is back as First Strike: Classic: The complete rebuild of the iconic strategy game about blowing up the world in the nuclear armageddon. This remaster is more stable, more cunning in its enemies and the best First Strike we ever made. First Strike is a fast paced real time strategy game which makes dropping the big one as easy as ABC. But be sure to take the right measures to guarantee your people’s safety. Pick one of the big nuclear players – from known superpowers like the USA to an upstart hellraiser like North Korea – and plan your strategy wisely: Expand to other countries, build bombs or debuild in order to restructure your arsenal. Or use research to gain access to new nuclear technology, better recon intel, automated self-defense-sequences and many more. Whether you’re a bloodthirsty warmonger or a tree-hugging hippie – it’s time to put your cards on the table. First Strike shows you how little it takes to heat things up. You control the destiny of the precious and vulnerable rock floating through space, the rock we call mothership Earth.   So, will you be the one remaining when the whole world blows to smithereens?  Millions of commanders are already playing First Strike all over the world. Now, with First Strike: Final Hour, the acclaimed strategy title finally arrives on PC with all-new features and a beautiful HD rework!  Twelve Playable Nuclear superpowers - You decide which real world superpower you play, from the USA to Russia, China or North Korea Devastating Superweapons - Build twelve technologically advanced rockets, from Tridents to the TSAR, unique to each Alliance Build Rockets and Missiles, conquer territories and research new devastating nuclear technologies. Control the world - shoot and defend against nuclear rockets on a 3D globe. Exclusive new Non-Attack-Pact system - Search for Pact partners and team up against enemies High resolution texture rework - Brand new reworks including night lights, bump maps, HD options and star constellations just for PC Fast paced strategy gameplay - Each round of first strike takes between half and hour and an hour to complete. First Strike was finalist and winner of numerous game awards worldwide, including *Winner 'Most Innovative Game' - BAE Awards* *Winner 'Game of the Year' - BOSA Awards* *Winner 'Newcomer of the Year' - SwissICT Awards* *Winner 'Best Mobile Game' - Indie Prize Amsterdam* *Finalist “Best Strategy Game” - BAE Awards* *Finalist 'Best Hardcore Game' - Game Connection USA Awards* *Finalist 'Most Innovative Game' - Game Connection USA Awards* *Finalist 'Best Upcoming Game' - IMGA Awards* *Finalist 'Most Meaningful Play' - IMGA Awards* *Finalist 'Best International Game' - Ludicious Game Festival* *Finalist 'Best Swiss Game' - SGDA Awards* *Finalist “Master of the Year” - BOSA Awards*",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/587000/header.jpg?t=1615819400",
    "Price": 11.99,
    "Developers": "Blindflug Studios AG",
    "Publishers": "Blindflug Studios AG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/587000/ss_f0af9224412b5f2fe6dbb925d875411a3aa713f5.1920x1080.jpg?t=1615819400,https://cdn.akamai.steamstatic.com/steam/apps/587000/ss_7f7850035e7483ce1bf56da85b5c1626117e98b4.1920x1080.jpg?t=1615819400,https://cdn.akamai.steamstatic.com/steam/apps/587000/ss_b377bdf04512ee3099c01ce42ad452d43cde1c2a.1920x1080.jpg?t=1615819400,https://cdn.akamai.steamstatic.com/steam/apps/587000/ss_6d95b6190af9e255c00dcb7d9be39979dfbddc02.1920x1080.jpg?t=1615819400,https://cdn.akamai.steamstatic.com/steam/apps/587000/ss_0167d428a50dc0e5714c7d1491ead02f220589e0.1920x1080.jpg?t=1615819400",
    "Slug": "first-strike-classic",
    "Meta Title": "First Strike: Classic: May 30, 2017, Blindflug Studios AG...",
    "Meta Description": "Looking for information on First Strike: Classic? Check out the release date (May 30, 2017), developer insights from Blindflug Studios AG, and a complet...",
    "Alt Text Image": "Official header image for First Strike: Classic game - Steam 587000",
    "Canonical URL": "https://gusku.site/game/first-strike-classic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"First Strike: Classic\", \"description\": \"Looking for information on First Strike: Classic? Check out the release date (May 30, 2017), developer insights from Blindflug Studios AG, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blindflug Studios AG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blindflug Studios AG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/587000/header.jpg?t=1615819400\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}