{
    "AppID": 401710,
    "Name": "Flinthook",
    "Release date": "Apr 18, 2017",
    "About the game": "Flinthook is a fast action-platformer with “roguelike” elements. Become space’s greatest pirate with your hookshot, pistol and slowmo powers! Live the life of space captain Flinthook! Armed with your mighty hookshot , your uncanny slow-motion powers and your trusty blasma pistol , plunder and fight your way through an infinite variety of randomly-assembled spaceships for treasure, loot and fame! Hunt down your pirate rivals and collect wondrous relics to become the greatest pirate of the Universe, in this fast action platformer with “roguelike” elements! Zip around with your mighty hookshot! Aim freely and toss your giant anchor at golden rings to propel yourself around the levels at high speeds, giving you the agility and swiftness needed to dodge hazards and enemy bullets. Shoot in 360’ through your Blasma Pistol! Take down all sorts of enemies with fresh hot bullets! Look really cool with slow-motion powers! Slow down time to adjust your aim or pull off a tight stunt - do it often, it recharges real quickly and it makes you at least 200% cooler. Blast through randomly-assembled pirate spaceships! Each level is special, as ships are procedurally built from hundreds of hand-crafted rooms, modified by various variants, filled with extraordinary treasure and populated by random waves of enemies. Hunt down the pirate lords of the Cluster Clan! Feed your compass creature to pinpoint the bosses’ location, then take them down and bring your bounty home. Your rivals are no space chumps, make sure you’re ready for the challenge! Collect rare relics and powerful perk cards! All the treasure you loot builds up your legend - unlock new equippable perks as you level up, buy permanent upgrades in the Black Market, and hoard collectible relics and lore pages! Uncover some mysterious secrets?! I don’t know, are there secrets in this game? O_O DELUXE Already a big fan? Get the Deluxe Edition for some extra loot! Includes: the Game itself, Soundtrack, the Artbook and a Wallpaper set! Here's all the bonus content offered in Flinthook's Deluxe edition: 100+ pages Artbook featuring: Character design! See the artistic process that led to the creation of enemies, shopkeepers, and Flinthook itself! Concept art! Learn how we came up with the game's setting, the architecture and layout of the spaceships through sketches and color research. Illustrations! Look at the different steps from sketch to print for a bunch of colorful illustrations! And more! Storyboard thumbnails, logo design, sketches and more! Original Soundtrack by Patrice Bourgeault! 23 tracks of epic pirate-inspired, dance-inspiring chiptune masterpieces! Play the soundtrack in the Steam Music Player or access the MP3 files directly! 4K Wallpaper collection 16 wallpapers featuring Flinthook, anchor patterns, the Devil, Sirens, space and other illustrations! (All Deluxe edition content will be downloaded to Steam/steamapps/common/Flinthook/Deluxe)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/401710/header.jpg?t=1624487756",
    "Price": 14.99,
    "Developers": "Tribute Games Inc.",
    "Publishers": "Tribute Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_b9a04ee0f02d6279b953240dd2d74590928aca5d.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_2b6ce984cedc3b988b882bcd2b132880659f0edb.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_d429bfc0c1aad668cacbd378eafe9f94f3a9049e.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_fcb46fda5bdb4372f3ada199e08b0ec7ed78490f.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_4bdd3331dcef5629cfcb759d43f11a5f3f3a3be4.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_55dce8f5d2857187af19a6cd6d3edaf93457ccdd.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_843bdd7e0af569976db0c817bb8bdf355882496a.1920x1080.jpg?t=1624487756,https://cdn.akamai.steamstatic.com/steam/apps/401710/ss_4290f845f64425840abbbec02284f28b3760a729.1920x1080.jpg?t=1624487756",
    "Slug": "flinthook",
    "Meta Title": "Flinthook: Apr 18, 2017, Tribute Games Inc. and Full Over...",
    "Meta Description": "Looking for information on Flinthook? Check out the release date (Apr 18, 2017), developer insights from Tribute Games Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Flinthook game - Steam 401710",
    "Canonical URL": "https://gusku.site/game/flinthook",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flinthook\", \"description\": \"Looking for information on Flinthook? Check out the release date (Apr 18, 2017), developer insights from Tribute Games Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tribute Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tribute Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/401710/header.jpg?t=1624487756\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}