{
    "AppID": 1263850,
    "Name": "Football Manager 2021",
    "Release date": "Nov 24, 2020",
    "About the game": "The manager is the beating heart of every football club. In Football Manager 2021 , dynamic, true-to-life management experiences and next-level detail renews that focus on you, the manager, equipping you with all the tools you need to achieve elite status. With more than 50 nations and 2,500 clubs at every level of the football pyramid to choose from, the possibilities are endless. It’s over to you, boss. Choose your colours and the challenge that best suits your ambitions and then work with your club’s hierarchy to ensure you meet theirs… or face the consequences. Join forces with your backroom staff to assess the strength and depth of your playing squad before dipping into the transfer market. There’s likely to be a starlet in your Academy knocking on the door of the first team… Craft tactical strategies, formations and styles of play for every occasion to maximise your club’s chances of winning football matches and getting those three points. Immerse yourself in the spectacle of match day and revel in the glory of management as your planning pays off on the pitch. Interaction Communicating with your players and the media has never been more purposeful or realistic. Gestures enable you to express every emotion, while Quick Chats improve those short, informal conversations which are part of day-to-day life as a manager. In FM21, others will feel the impact of your words and know the sort of manager you are. Matchday Every fixture now feels like a true spectacle with our best-looking match engine ever. You’ll receive better analysis and advice in the pre-match build-up and those data improvements combine with our remodelled match UI to bring you closer to the action than ever before. FM21 also boasts a raft of AI improvements across every area of the pitch. The rate of decision-making has increased and there’s more nuance to the decisions that players make, allowing them to be more reactive and make faster decisions. This improved decision-making process has enabled better defensive and goalkeeper intelligence, enhanced central play and more variety in the final third. Additionally, you’ll also get more reaction and data post-match, including our brand new SIxG system, which will let you know well or badly your team performed relative to the chances they created. Analysis and Stats Our extensive data improvements go beyond Matchdays, giving you all the tools to level up your pre-match preparations. Managers benefit from a vastly increased amount of data reporting and visualisation this year, including monthly reports from the new Performance Analyst that mirrors the data real managers receive. New graphs and data maps provide clearer insight into their team’s strengths and opposition weaknesses, while there’s a wealth of new stats that will give you full statistical overview of the entire pitch. Recruitment New staff roles, meetings and interactions freshen up one of the game’s most popular areas. Recruitment meetings now ensure that you and your scouting team are on the same page, both for your next moves and the club’s longer-term strategy in the transfer market. Moreover, you’ll now be able to approach agents directly about a player's interest in joining your club. End of Season Re-live your campaigns and revel in your success like never before. A new season review presentation picks out your best moments on and off the pitch, while showpiece victories feel much sweeter with improved title presentations and masses of media attention. This is a game that rewards planning and knowledge but there’s no pre-defined ending or script to follow, simply endless opportunities. Every club has a story to tell and it’s up to you to write it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1263850/header.jpg?t=1649698124",
    "Price": 0.0,
    "Developers": "Sports Interactive",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_fd42ad95cb1a3e7d9e48ef393362147210020ba7.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_435711f30c32974d611c7015aaa04b5888ae1a83.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_e21cf048fc8760c634f4bca91870ef2590485ace.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_0e08de5f60e5a2465c896015368b66ac69056d30.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_631773adf9861490d7bf00164775d9ce62d2e4bf.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_6bd99934c734b3021b1d4ce837229a05151c5a72.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_acf44b07f87de85d71b387d7382befa23cf9b746.1920x1080.jpg?t=1649698124,https://cdn.akamai.steamstatic.com/steam/apps/1263850/ss_6c4363ceb1ef2db319355784318bb75a3fe5cdd2.1920x1080.jpg?t=1649698124",
    "Slug": "football-manager-2021",
    "Meta Title": "Football Manager 2021: Nov 24, 2020, Sports Interactive a...",
    "Meta Description": "Looking for information on Football Manager 2021? Check out the release date (Nov 24, 2020), developer insights from Sports Interactive, and a complete ...",
    "Alt Text Image": "Official header image for Football Manager 2021 game - Steam 1263850",
    "Canonical URL": "https://gusku.site/game/football-manager-2021",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Football Manager 2021\", \"description\": \"Looking for information on Football Manager 2021? Check out the release date (Nov 24, 2020), developer insights from Sports Interactive, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sports Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1263850/header.jpg?t=1649698124\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}