{
    "AppID": 1609580,
    "Name": "Fragments Of A Mind",
    "Release date": "Mar 25, 2022",
    "About the game": "Story After an unexpected turn of events in a secluded mountain cabin, Cassandra finds herself trapped in her own twisted dreams. To escape she must explore these nightmares and uncover their meaning through her own lost memories. As she travels deeper into the world of dreams it soon becomes clear that nothing is like it seemed at first glance. Help her see through all the lies and reveal the dark secret hidden deep in her mind that threatens to destroy her. Gameplay Defeat powerful foes in epic battles. Think outside the box to find and exploit their weakness! Each fight will be different and will test your knowledge of its mechanics to the limit. Fast reflexes and good strategy will be of utmost importance especially on hard difficulty, but fights will be much more forgiving on easier ones. Evade traps and run from enemies. Use your skills to tear down barriers, break out of snares and survive deadly spells. Every chapter consists of many sections filled with dangerous obstacles - in order to get through you will have to plan your path and skill usage so that you don't end up trapped or cornered with no way out. In most cases you won't be able to kill your foes directly however that doesn't mean you cannot leverage the environment to help you out! And if you make a mistake and die, don't worry, there are many checkpoints along the way! You will also encounter many puzzles that will stand in your way. Solve witty riddles, find the right combination of runes or test your reflexes by quickly pushing buttons to clear obstacles so you can pass an otherwise dangerous section of a level! Mystery Search for memory fragments hidden all over the world and use them to piece together the true story of Cassandra. Some will be easy to find, while others might be hidden further from the main path, guarded by enemies or even hidden behind secret doors! How many of Cassandra's memories you manage to recover is important for the outcome of her journey, so make sure you find them all! Challenge Complete each chapter without dying or in a time limit to earn special badges and achievements. Higher difficulties award better badges and more prestigious achievements! Pick the right perks to make your task easier - there are several that will make obtaining these special badges much easier. Each chapter also features a different set of enemies and traps so tailoring your build to the challenges before you will help you a long way! Furthermore, perks found in later chapters are kept so that you can replay older chapters with a more powerful build. Features A thrilling story full of twists and turns that will take a couple of hours to complete Many unique environments including a decaying marsh, colorful Japanese gardens and dark catacombs Several useful skills to help you on your journey, each with its own advantages and drawbacks A tiered perk system to further alter the way you play Made for both casual and more experienced gamers - choose a difficulty that suits you and enjoy the game to the fullest",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1609580/header.jpg?t=1650303068",
    "Price": 11.99,
    "Developers": "LoneWolf",
    "Publishers": "LoneWolf",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_ded3d3b80039ba6d001a0577b2ddb0518bedd6ab.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_df85ae769a7409dba41b726c73ed68cec08decb5.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_f67423e20e2d82eb78814b8a96686c9fb9728a1c.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_214260b47adc60078cd6b9e8879dac2070f2daf7.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_07473fe852ccb393d8a64e882d61bf74fc68d65b.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_4eb910a75198b5ee95a62c66ff5bccece9d888ec.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_e6c1cf6e83e88e137003c4c25486ab7db8edb498.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_2f1334abc2849a94429fef9bdd33c1794587d2ff.1920x1080.jpg?t=1650303068,https://cdn.akamai.steamstatic.com/steam/apps/1609580/ss_9b4f2ee2c18d22964d1228b86c8bdf45a69e491b.1920x1080.jpg?t=1650303068",
    "Slug": "fragments-of-a-mind",
    "Meta Title": "Fragments Of A Mind: Mar 25, 2022, LoneWolf and Full Over...",
    "Meta Description": "Looking for information on Fragments Of A Mind? Check out the release date (Mar 25, 2022), developer insights from LoneWolf, and a complete game summary.",
    "Alt Text Image": "Official header image for Fragments Of A Mind game - Steam 1609580",
    "Canonical URL": "https://gusku.site/game/fragments-of-a-mind",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fragments Of A Mind\", \"description\": \"Looking for information on Fragments Of A Mind? Check out the release date (Mar 25, 2022), developer insights from LoneWolf, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LoneWolf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LoneWolf\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1609580/header.jpg?t=1650303068\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}