{
    "AppID": 678520,
    "Name": "Gal*Gun VR",
    "Release date": "Aug 9, 2017",
    "About the game": "Live the dream of being surrounded by hordes of cute girls who are madly in love you in virtual reality! In Gal*Gun VR, you play as a young man who suddenly became the most popular guy around, and you must fend off a rush of girls with your trusty Pheromone Shot by giving them euphoria! The Gal*Gun series comes to VR! This is exactly the kind of game that VR was designed for! In Gal*Gun, virtual reality truly *is* better than reality! Experience the joy of being surrounded by beautiful girls, only this time, you can enjoy this world from every angle! Aim for girls' weak spots to give them euphoria! You have goals to achieve, so you can't just end up with the first girl who leaps into your arms, right? This is where your trusty Pheromone Shot comes into play! Use this shot to give incoming girls euphoria, and protect yourself from their confessions of love as you make your way through the stages. Different girls have different weak spots-- shoot these spots and you'll get an 'Ecstasy Shot,' instantly giving the girl euphoria and increasing your score. Use the new 'Demon Sweeper' to bust some demons! The demons from Gal*Gun Double Peace are back in full force, and causing trouble wherever they go! Fortunately, you now have a new tool to help you defeat them: the Demon Sweeper! Shoot demons that are possessing girls to knock them off, then suck 'em up with your Demon Sweeper! Look deep into girls' eyes to make them 'Lovestruck'! If you get up close and personal with the girls and look deep into their eyes, a special gauge on your sight will start to fill up. As the gauge fills up, the girls become 'Lovestruck.' While they are 'Lovestruck', shooting them anywhere will count as an 'Ecstacy Shot', and any other girls standing near the Lovestruck girl will get caught up in the effect and receive euphoria. Invite girls over to your house! After a long day of fending off totally lovestruck girls and demon busting at the academy, it's time for some one-on-one time with a girl you like! Invite them over to your pad to interact with them and learn more about them, such as what kind of panties they wear! Capture your finest moments on film! Press and hold the grip button to equip your camera, then press the trigger button while your camera is equipped to take a picture. If you manage to snap a photo of a girl's panties, you'll unlock a special achievement! Every single girl's panties has its own achievement, so get those cameras ready and see if you can collect them all!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/678520/header.jpg?t=1617094415",
    "Price": 29.99,
    "Developers": "INTI CREATES CO., LTD.",
    "Publishers": "INTI CREATES CO., LTD.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/678520/ss_df434343e1791236c07d319a11fba8dd6a08a252.1920x1080.jpg?t=1617094415,https://cdn.akamai.steamstatic.com/steam/apps/678520/ss_0f78a77595912fd2ae78768e28720b5ce641bf05.1920x1080.jpg?t=1617094415,https://cdn.akamai.steamstatic.com/steam/apps/678520/ss_acb3fe262d23c2b9ebf00884a7b5d6b505e3400a.1920x1080.jpg?t=1617094415,https://cdn.akamai.steamstatic.com/steam/apps/678520/ss_490b40263b6c99c371c96770ed4525578e4bd4e8.1920x1080.jpg?t=1617094415,https://cdn.akamai.steamstatic.com/steam/apps/678520/ss_e700ebf504df384299f18cbf0b2e71d94b0042f4.1920x1080.jpg?t=1617094415",
    "Slug": "gal-gun-vr",
    "Meta Title": "Gal*Gun VR: Aug 9, 2017, INTI CREATES CO., LTD. and Full ...",
    "Meta Description": "Looking for information on Gal*Gun VR? Check out the release date (Aug 9, 2017), developer insights from INTI CREATES CO., LTD., and a complete game sum...",
    "Alt Text Image": "Official header image for Gal*Gun VR game - Steam 678520",
    "Canonical URL": "https://gusku.site/game/gal-gun-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gal*Gun VR\", \"description\": \"Looking for information on Gal*Gun VR? Check out the release date (Aug 9, 2017), developer insights from INTI CREATES CO., LTD., and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"INTI CREATES CO., LTD.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"INTI CREATES CO., LTD.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/678520/header.jpg?t=1617094415\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}