{
    "AppID": 1003370,
    "Name": "Graywalkers: Purgatory",
    "Release date": "Jan 15, 2020",
    "About the game": "Graywalkers: Purgatory is a stylish turn-based strategy RPG set in a supernatural post-apocalyptic world where Heaven and Hell had merged with Earth caused by a event called the Rupture. Inspired by a combination of gameplay from XCom, Jagged Alliance and Fallout, the game generates a unique but familiar experience for the turn-based tactics player. You play the prophesied leader of The 36 Righteous Ones who are now called Graywalkers. You and the other Graywalkers walk the path between Heaven and Hell and Darkness and Light, each one destined to protect humanity in their own unique way. Your goal is to search for the 35 other Graywalkers and recruit them in your cause to unite Purgatory and lead the fight the reclaim the world from the supernatural invaders that have conquered the rest of the world. GAMEPLAY The game currently has 2 modes of gameplay active: Preludes and Mission are the current Modes available. A campaign mode will be following as well. Mission Mode - You choose missions to go on and these leads to other missions. Some of the missions are stand-alone while the others are mini-campaigns wherein each successful mission will lead to another until the story is resolved. Preludes - Preludes are like short stories except you play through them as the character highlighted for the specific prelude story. These are stories about the different Graywalkers before they begin their part in the single player campaign. KEY FEATURES: Real Time Exploration - When traveling on maps, the movement is real time. Only when combat ensues will it shift to turn-based gameplay Action Unit Based Turn-Based Combat - play in classic tactical combat where you do actions based on your available Action Units Recruitable Heroes - find, convince and recruit your heroes from at least 40+ available playable characters, each with their own style, personality, motivation, relationships and history. Unique RPG System - the game utilizes a unique and original table-top RPG game system that will be coming out soon. Continuous Addition of Missions - initially, you will get to do at least 7 mission and more will be added monthly until we reach a minimum of 50+ missions 7 Races - There are 7 available character races to experience in the game: Humans, Dhampir, Wolfkin, Nephilim, Cambion, Faechilde and the Hunterborne. 10 Character Paths - There are 10 playable character paths available:Agent, Armsman, Arcanist, Diviner,Martialist, Scout, Soldier, Slayer, Survivor, and Tech 100+ Abilities - Choose from over 100+ different abilities that from different categories: Physical, Mental, Social, Racial, Combat and Supernatural. These abilities give you both passive and active advantages Hundreds of Items - Discover hundreds of items in the game from Weapons, Armor,Ammo, Consumable Items, Accessories and other types of loot. Dozens of Threats - Encounter dozens of threats from bandits to mercs, to beasts and monsters, andto all manner of supernatural creatures like Angels, Demons,Vampires, Werewolves, Undead, Spirits and many others. Explore Purgatory - Explore the dangerous island continent of Purgatory. Travel through scorching deserts, dangerous wastelands, overrun forests, historical city ruins, dark caverns and even into supernatural realms",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1003370/header.jpg?t=1600686429",
    "Price": 24.99,
    "Developers": "Dreamlords Digital Inc.",
    "Publishers": "Dreamlords Digital Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_927628217ea6c28285c290ac0a164ba48abb53ac.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_088800ab3c850a1e68ed0adecc3a6ecdac623c1e.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_863b7046c6ac74383c2a919736d95c110134163b.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_82166490aefa5f8f0e680acf363f0198bc233d03.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_08f22521d89817077dc06c300346b340623d6e15.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_8457e60cacd83002dea0dc0112bda2be2181affd.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_9be762d864f753cc8069abc631ce97dce3bd68a0.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_49c350b9a796a075dfd847c00d589f3c7e1370ba.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_40260c47f043a77391888a8347d1ab665d58e237.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_4aae130bd69af2f993b135d0668c8d3f7f08c09b.1920x1080.jpg?t=1600686429,https://cdn.akamai.steamstatic.com/steam/apps/1003370/ss_0dfb90db1e68833d556911ba61444a0f250b911a.1920x1080.jpg?t=1600686429",
    "Slug": "graywalkers-purgatory",
    "Meta Title": "Graywalkers: Purgatory: Jan 15, 2020, Dreamlords Digital ...",
    "Meta Description": "Looking for information on Graywalkers: Purgatory? Check out the release date (Jan 15, 2020), developer insights from Dreamlords Digital Inc., and a com...",
    "Alt Text Image": "Official header image for Graywalkers: Purgatory game - Steam 1003370",
    "Canonical URL": "https://gusku.site/game/graywalkers-purgatory",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Graywalkers: Purgatory\", \"description\": \"Looking for information on Graywalkers: Purgatory? Check out the release date (Jan 15, 2020), developer insights from Dreamlords Digital Inc., and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dreamlords Digital Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dreamlords Digital Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1003370/header.jpg?t=1600686429\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}