{
    "AppID": 1071760,
    "Name": "Idunn Guardians",
    "Release date": "Aug 22, 2019",
    "About the game": "[World] The oil prices around the globe have skyrocketed to the point where people are forced to pay whatever price the seller sets. The world has also been seeing more riots than ever due to food shortage problems. Endless wars over borders wrought chaos on Earth. IDUNN Co. , a global high-tech corporation, promoted a power generation project in which small planets would supply energy for the world. The company then planned to create , a facility similar to Noah’s Ark where everything that humans need to live—water, food, energy, etc. —will be supplied from the small planets for self-sufficiency. This plan saw gigantic investments from various countries such as the United States and China. After fierce competition, the first group of residents was selected. Through IDUNN Bay, IDUNN Co. seemed to be searching for Planet Goldilocks,a planet that could support life, and planning relocation to another galaxy. In reality, however, the company was planning to build a military hub on another planet to conquer and colonize other planets. Odin, the head of IDUNN Co.’s research center and source of the latest cutting-edge technology, found 5 small planets in the Bairan Galaxy that could supply 5 different energy sources—earth, water, wind, fire, and nuclear fusion. And so, he successfully developed a new system for IDUNN Bay to use these forms of energy. It was an energy revolution, and the first time that energy was supplied from outer space. The Bairan Galaxy, however, was the main playground of the “Undying,” space pirates that invade and plunder small planets and attack and pillage probes passing by. To the Undying, the Earthlings had come out of nowhere and just started harvesting energy. “Beast,” commander of the Undying, believed that the Earthlings posed an obstacle to the Undying, and so he declared war on IDUNN Bay. To prepare for the upcoming war, Beast helped some of his most trusted men from Planet Nass, a jail for nefarious criminals. Knowing that they were at a disadvantage in this war against the Undying, IDUNN Bay posted billboards throughout Bairan Galaxy to recruit mercenaries. An exorbitant reward was offered for the head of Beast, the greatest threat of the Bairan Galaxy. The war between IDUNN Co. and the Undying has begun, and you’ve just signed up to fight for IDUNN Co. as a mercenary. Are you ready to take care of Beast and win the reward? [Game Content] Now a member of the IDUNN Guardians as a mercenary, you’ll be given missions to go to various planets that are being exploited by the Undying and eliminate them, one planet at a time. However, your work doesn’t end there. You must collect the important energy elements from those planets. Once you collect the elements, you will obtain a new weapon and move on to the next planet. [How to Play] IDUNN GUARDIANS is a single action RPG that can enjoy light and fast play. An AI killer swinging a sword like it’s a ladle, a robot wizard who gathers and uses energy from collected souls, and a human-alien hybrid gunman You’ll choose one of these 3 characters to play the game. Game play is quite simple. Upon receiving quests from Odin, the head of IDUNN GUARDIANS, go to different planets via Gate Way and wipe out all of the enemies there. You’ll encounter a wide variety of monsters. Eliminate the enemies of planet and collect the main elements of the planet! You can get different elements for each planet. Element is a very important resource in the universe. if you sell it to a merchant, you can get a big reward. There are many NPCs living on each planet. If you’re curious about the sub-stories, find them and start a conversation with the NPCs on the planets. You just might be interested in what they have to say. Clearing the quest for a planet will provide new equipment for the next planet. Meet weapons that get stronger as you move around the planet! In Idunn Bay, there is an Infinity Training Room. Talk to the NPC at the entrancd to the Training Room to receive the quest at each stage. The Infinity Training Room consists of seven stages and can challenge enemies of different races. As the step goes up, the difficulty increases. if you're going to challenge yourself to a higher level, you nees to grow accordingly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1071760/header.jpg?t=1568711504",
    "Price": 0.99,
    "Developers": "Widebrain Inc.",
    "Publishers": "Widebrain Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1071760/ss_5cd1331502693bbaccb043cc0c63db878f73917e.1920x1080.jpg?t=1568711504,https://cdn.akamai.steamstatic.com/steam/apps/1071760/ss_da2863c6278bdda96507700918d9df3cc618787b.1920x1080.jpg?t=1568711504,https://cdn.akamai.steamstatic.com/steam/apps/1071760/ss_ed60914069d30a6fe6a5825fcae9fdb36da06b52.1920x1080.jpg?t=1568711504,https://cdn.akamai.steamstatic.com/steam/apps/1071760/ss_b88cf9202bbf540facd4c5c6fd1c1f41cd696836.1920x1080.jpg?t=1568711504,https://cdn.akamai.steamstatic.com/steam/apps/1071760/ss_69e92da80cfe532717656164ff17f02d08fc6a0e.1920x1080.jpg?t=1568711504,https://cdn.akamai.steamstatic.com/steam/apps/1071760/ss_9dd07086eed97037799f41c0757f5b9c2aa9f18d.1920x1080.jpg?t=1568711504",
    "Slug": "idunn-guardians",
    "Meta Title": "Idunn Guardians: Aug 22, 2019, Widebrain Inc. and Full Ov...",
    "Meta Description": "Looking for information on Idunn Guardians? Check out the release date (Aug 22, 2019), developer insights from Widebrain Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Idunn Guardians game - Steam 1071760",
    "Canonical URL": "https://gusku.site/game/idunn-guardians",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Idunn Guardians\", \"description\": \"Looking for information on Idunn Guardians? Check out the release date (Aug 22, 2019), developer insights from Widebrain Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Widebrain Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Widebrain Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1071760/header.jpg?t=1568711504\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}