{
    "AppID": 1665080,
    "Name": "JUMANJI: The Curse Returns",
    "Release date": "Sep 1, 2021",
    "About the game": "Jumanji has awoken and jungle drums are calling! This mysterious board game contains a magical jungle that’s ready to invade your world! With every turn you and up to 3 teammates risk allowing more creatures and plants to escape. To banish the jungle wildlife for good one of you must reach the center of the board, and it will take all four of you to get them there! Based on the game from the 1995 film, JUMANJI: The Curse Returns fuses the board game with deck building real-time strategy for a unique, co-op multiplayer experience. FEATURES: A NEW update brings deck building features, making the game different every time you play A 4 player co-op adventure Join friends and family in Online Multiplayer Mode - be part of an AI team in Single Player - set off on your journey with 1 or 2 friends plus AI characters Explore the Season Pass and play Jumanji in the Winter Resort, unlocking a handcrafted map, exclusive characters, tokens sculpted from precious materials and a new danger Awaken Jumanji Hold your breath as words take shape in the green crystal center of the board. Every riddle is a clue and if you solve it fast enough you’ll know what’s coming next! You may be playing Jumanji, but this mysterious board game is also playing with you! Face the Jungle Work together or lose the town! From giant mosquitos to elephants, monstrous monsoons to raging stampedes, keep your cool in the unnatural tropical heat. Coordinate and help each other to stay in the game as twisting vines seek to disable your teammates. *NEW* Build Your Deck Earn gold coins during every encounter and spend them on new cards for your deck. You’ll get better, stronger and faster as Jumanji increases the pressure. Make your choices and meet the jungle head on. Defend Brantford It won’t take long for Jumanji to break out of the Parrish Mansion and invade the town. Face the jungle from the Shoe Factory to the Riverbank. If you lose a location, it’s lost forever. And if you lose three, Jumanji will win! Every victory counts! Enhance Your Skills Not every turn leads to an encounter. Collect gems to enhance your abilities. Talk to your team and make sure everyone’s equipped with different skills, because you never know what’s around the corner! Share the magic and watch your team improve! Reach the Center of the Board Survive Jumanji and save the town! As soon as one of you makes it to the center of the board, the Jumanji jungle will be sucked back into the game. Watch as vines retreat, creatures disappear, and the game leaves the world exactly as it was!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1665080/header.jpg?t=1654535551",
    "Price": 9.99,
    "Developers": "Marmalade Game Studio Ltd",
    "Publishers": "Marmalade Game Studio Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_70440da1ae101051715c6e5be8c5df75ae450e64.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_73bdecedd95ea2cd153de2b284674a2b197b5853.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_0392bb1e74f6705baf5c3b6de49fc1bcb0ffa070.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_993763b27efbc0836ecf251107f221b6877c45c7.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_4a7a487e8d095aa30adc05d07c34c100716f77f2.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_2dd3bc35b5260508158f9bb991863b2e281dabcd.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_57b21b7d0c939e06f9f649adc75aeaa4f879aa8e.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_32fb5706e25d76ee00d28ba42d4433d4c764ff18.1920x1080.jpg?t=1654535551,https://cdn.akamai.steamstatic.com/steam/apps/1665080/ss_57837ef310208c7217819852812548f4de0b066c.1920x1080.jpg?t=1654535551",
    "Slug": "jumanji-the-curse-returns",
    "Meta Title": "JUMANJI: The Curse Returns: Sep 1, 2021, Marmalade Game S...",
    "Meta Description": "Looking for information on JUMANJI: The Curse Returns? Check out the release date (Sep 1, 2021), developer insights from Marmalade Game Studio Ltd, and ...",
    "Alt Text Image": "Official header image for JUMANJI: The Curse Returns game - Steam 1665080",
    "Canonical URL": "https://gusku.site/game/jumanji-the-curse-returns",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"JUMANJI: The Curse Returns\", \"description\": \"Looking for information on JUMANJI: The Curse Returns? Check out the release date (Sep 1, 2021), developer insights from Marmalade Game Studio Ltd, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marmalade Game Studio Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Marmalade Game Studio Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1665080/header.jpg?t=1654535551\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}