{
    "AppID": 1791700,
    "Name": "Kingdoms Conquer / 攻城天下",
    "Release date": "Nov 16, 2021",
    "About the game": "This is a Massive National Battles Card Strategy Game whose main features are real-time battle, construct the capital, and the experience of accomplishment by boosting the country and defeating countless enemies. National war is coming! Troops muster！ Focusing on real-time strategy national war battles, the complete map is divided into states and counties, which truly restores the war scenes of kingdoms fighting for supremacy and Winner takes all. To win the national war, the commanders need to spy on the enemy's military intelligence, cultivate capable warriors, reasonably match the lineup, make prudent plans that can wipe out the enemy troops when attacking, and also can defend the cities and important strongholds while under attack. On the battlefield, soldiers must keep advancing while comrades are falling down, the speed of the siege is accelerated, the war pace is breathtaking. The victor can claim the crown and numerous reputation; defeater will face countless damage and difficulties to rise again. Blood spilled, only for the honor of the battle, for the unification of the world! Fair Ladies in Distress, Waiting for You to Rescue In a world of chaos and gun-smoke, countless fair ladies are lost and in desperation; commoners have no one to rely on, and the country is in decline and forced to be displaced, now is the time to step up. Unlock the harem line, you can choose the dedicated and committed route, or you can play polygamous and have a huge harem. But there are so many beauties, some are cold and noble, some are charming and enchanting, some are lovely and vulnerable. ...... you will need to use different methods to win their affection. Write a chapter of beautiful romance in war years together, deepen the relationship, and there are more affairs waiting for you to discover. Strategic Warrior Profession Restraint There are five types of warriors in this game: Spear-wielder(restricts the Rider), Shield-holder(restricts the Spear-wielder), Rider(restricts the Shield-holder), Archer and Advisor can restrict each other and it adopts the Star chart skills: the Polis, the Alkaid, Dubhe and Polaris, which can divide the unique attribute skills of each warrior, such as Burning, Stunning, freezing and imprison. In this way, you can match different lineups, depending only on how you choose your warriors. After you have recruited and raised your troops, you will be able to bring out the strongest battle power and train your own bold army. Diplomatic Siege and Domestic Reign This game adopts realistic maps and uses county sections to show the land of cities and counties. Every time you conquered a city, you will not only be able to 'scavenge' tons of gold, food, and military supplies, but also be able to increase your rank and titles. The domestic affairs of the country and the state are a good example of the emperor's ruling strategy. If go with the conservative governance, you can resist foreign invasion, be self-sufficient and your people live and work in peace and contentment; If go with aggressive expansion, you can continue to conquer the surrounding cities, expand your territory, force messengers to pay tribute, and prosper the whole country. Whether to go with conservative or aggressive strategy, it depends entirely on your philosophy of governance!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1791700/header.jpg?t=1656518947",
    "Price": 0.0,
    "Developers": "攻城天下",
    "Publishers": "攻城天下",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_d766f56024678ed8b834d62c36d7b50688ccc3ea.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_5defa4d2b3589b98d6e5f4b733b0441fddf97212.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_08e7d50c536df064af49ac1deda1380fca9e9b31.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_b8e6d738d7f6bc58b3f1ce4a369c9787dd67e58b.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_e0899e45c1dbdff83a6a227a13a9d0c7c74cb122.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_726b697f0517ffa96701cfbb7e68106e909c1461.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_b01a45ac104177607b5f11559e101f3d78cbe278.1920x1080.jpg?t=1656518947,https://cdn.akamai.steamstatic.com/steam/apps/1791700/ss_ed6a16833a38c52201182e3df53d759021718abf.1920x1080.jpg?t=1656518947",
    "Slug": "kingdoms-conquer",
    "Meta Title": "Kingdoms Conquer / 攻城天下: Nov 16, 2021, 攻城天下 and Full Over...",
    "Meta Description": "Looking for information on Kingdoms Conquer / 攻城天下? Check out the release date (Nov 16, 2021), developer insights from 攻城天下, and a complete game summary.",
    "Alt Text Image": "Official header image for Kingdoms Conquer / 攻城天下 game - Steam 1791700",
    "Canonical URL": "https://gusku.site/game/kingdoms-conquer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingdoms Conquer / \\u653b\\u57ce\\u5929\\u4e0b\", \"description\": \"Looking for information on Kingdoms Conquer / \\u653b\\u57ce\\u5929\\u4e0b? Check out the release date (Nov 16, 2021), developer insights from \\u653b\\u57ce\\u5929\\u4e0b, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u653b\\u57ce\\u5929\\u4e0b\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u653b\\u57ce\\u5929\\u4e0b\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1791700/header.jpg?t=1656518947\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}