{
    "AppID": 1940370,
    "Name": "Lonely Knight",
    "Release date": "Apr 6, 2022",
    "About the game": "Lonely Knight is an action-adventure game set in medieval and ancient times. You are playing as a hero whose name is Tristan. Tristan's former friend Garreth, seized his wife so he could return to the army. After capturing Nyneve, Tristan felt betrayed and decided to go on an unexpected journey through dangerous lands. World of betrayal Experience the action in a whole new light with Tristan's combat skills, and punish those who betrayed you. Be prepared to face deadly mythical monsters while avoiding perilous traps. Enter the chaos of war as a bold Knight and Interact with many unique and imaginative creatures and enemies. Forged in the flames of battles Battle across the dangerous lands against dragons, Skeletons, Demons, Ghosts, and a corrupted army in your quest for vengeance. Vanquish your foes using the game’s deep and intuitive combat system that is easy to learn. Fantastic graphics bring this mythical world to life. The defeat was merely delayed Arm yourself with brutal melee weapons, and jump into the Medieval world. Explore the world and defeat all of those who stand in your way. With the help of the God Zeus, show no mercy. Take to the field of battle and experience the brutality of medieval combat in a third-person perspective with hundreds of on-screen units, each with their own detailed AI. Key Features: Experience a lawless land Live an epic adventure through stunning landscapes. Dispense your own justice With a sword on your back, become a ruthless Knight. Epic Universe Unlike anything the player has seen before, take a look at a unique style. Freedom Explore the vast world and face various challenges – go solo and complete quests. Fantasy Explore lands inspired by medieval time including frosted mountaintops, deep forests, swamps, ruins, and caves, evacuated cities, deserts, and many more. Discover ancient secrets, seek forgotten treasures, and face mythical creatures inspired by medieval tales! Be part of an exciting story",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1940370/header.jpg?t=1649232092",
    "Price": 4.19,
    "Developers": "The NR",
    "Publishers": "NR Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1940370/ss_fa6989666ddfa811d9b573524b6d294f96c65111.1920x1080.jpg?t=1649232092,https://cdn.akamai.steamstatic.com/steam/apps/1940370/ss_79db1c018a7b239a4ac05f90def074472f9da4dc.1920x1080.jpg?t=1649232092,https://cdn.akamai.steamstatic.com/steam/apps/1940370/ss_6b26f5dddf086f0c92f9e0d681334bd38c3ceb40.1920x1080.jpg?t=1649232092,https://cdn.akamai.steamstatic.com/steam/apps/1940370/ss_48018245172eec15a0a5f55dce6fc347a18e9e66.1920x1080.jpg?t=1649232092,https://cdn.akamai.steamstatic.com/steam/apps/1940370/ss_d70cba74f3a9097ee9e5be14279a0b2cbcd36a06.1920x1080.jpg?t=1649232092,https://cdn.akamai.steamstatic.com/steam/apps/1940370/ss_89a9395a27b54ec133c3a3faf58ebea96bdf76b3.1920x1080.jpg?t=1649232092",
    "Slug": "lonely-knight",
    "Meta Title": "Lonely Knight: Apr 6, 2022, The NR and Full Overview",
    "Meta Description": "Looking for information on Lonely Knight? Check out the release date (Apr 6, 2022), developer insights from The NR, and a complete game summary.",
    "Alt Text Image": "Official header image for Lonely Knight game - Steam 1940370",
    "Canonical URL": "https://gusku.site/game/lonely-knight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lonely Knight\", \"description\": \"Looking for information on Lonely Knight? Check out the release date (Apr 6, 2022), developer insights from The NR, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"The NR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NR Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1940370/header.jpg?t=1649232092\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}