{
    "AppID": 1623660,
    "Name": "MIR4",
    "Release date": "Aug 25, 2021",
    "About the game": "Venture into the open world of MIR and start your adventure. You can play it your way. Enjoy the peaceful life of hunting, gathering, and crafting or join a powerful clan to participate in large scale PVP with other allies and enemies. Capture the Hidden Valley and collect taxes on profits from the territory, set a bounty on a foe and get assistance from allies to hunt down your enemy, join a 50 player raid and get some rare loot, declare war on enemy clans, participate in castle sieges, there are so much content that all contribute to your character’s growth in the world of MIR. Whatever you choose, your story will be legendary. Character Classes Choose from the 4 classes to fit your gameplay style. Whoever you choose, a legend will rise. Warrior pulverizes enemies with a heavy great sword. Sorcerer wields magic with the power of the elements. Taoist supports party members with divine recovery spells. Lancer is a specialist that can attack and defend simultaneously using a long spear. Graphics and Movement With stunning graphics powered by the Unreal Engine 4 and the added elegance of fluid combat motions of Asian martial arts makes it a truly magnificent experience. Free Loot System MIR4 has created an unprecedented Free-for-all loot system where anyone has the right to claim the loot, even players that didn’t participate in the takedown of the monster. This applies only to special loot in the treasure chest and players have 30 seconds to protect the loot while others have 30 seconds to fight for right to claim the loot. It is not just looting by luck. Strategies and alliances will play a big role in claiming special loots. Life Skills If you are tired of hunting mobs or competitive PVP, try less aggressive style of character growth with gathering, mining, or crafting. In MIR4, there are many paths to growth and ultimately whatever you do your time and effort will not go to waste. Capture the Hidden Valley Hidden Valley is the core of MIR4’s economy. By capturing and holding the Hidden Valley during the weekly event, rulers of the Hidden Valley can gain great rewards of Darksteel or collect taxes from all income from the territory. Hidden Valley Capture is a massive scale PVP where clan teamwork and strategy is the key to winning. What will be your strategy? Total monopoly by annihilating all others or mutual gain through alliances, make your choice. Castle Siege Conquest The castle siege in MIR4 is the ultimate massive scale group PVP. The winning clan becomes the overruling clan of the MIR world. Ruling clan of the castle siege can enjoy the glory of the throne and the economic benefits until they are overthrown. Partake in the greatest war of clans for your clan’s honor and legacy. Cross Platform MIR4 is a true cross-platform MMORPG that you can play with your friends from your PC and/or mobile devices.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1623660/header.jpg?t=1646904582",
    "Price": 0.0,
    "Developers": "Wemade Next",
    "Publishers": "Wemade",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1623660/ss_636477400c411bbf6b5981a5ac4321f7f1befe42.1920x1080.jpg?t=1646904582,https://cdn.akamai.steamstatic.com/steam/apps/1623660/ss_8d4b8285eee44b2ac257960940ea6824faccb378.1920x1080.jpg?t=1646904582,https://cdn.akamai.steamstatic.com/steam/apps/1623660/ss_235ad104e85dea002d8d2bac9637dc228f6a8d01.1920x1080.jpg?t=1646904582,https://cdn.akamai.steamstatic.com/steam/apps/1623660/ss_919acd38fa8ae1cf11a6278206f209c95ab71536.1920x1080.jpg?t=1646904582,https://cdn.akamai.steamstatic.com/steam/apps/1623660/ss_18cb5e0f3b511c6aeb75c806b6488fac5c781c8c.1920x1080.jpg?t=1646904582",
    "Slug": "mir4",
    "Meta Title": "MIR4: Aug 25, 2021, Wemade Next and Full Overview",
    "Meta Description": "Looking for information on MIR4? Check out the release date (Aug 25, 2021), developer insights from Wemade Next, and a complete game summary.",
    "Alt Text Image": "Official header image for MIR4 game - Steam 1623660",
    "Canonical URL": "https://gusku.site/game/mir4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MIR4\", \"description\": \"Looking for information on MIR4? Check out the release date (Aug 25, 2021), developer insights from Wemade Next, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wemade Next\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wemade\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1623660/header.jpg?t=1646904582\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}