{
    "AppID": 638070,
    "Name": "Murderous Pursuits",
    "Release date": "Apr 26, 2018",
    "About the game": "Murderous Pursuits is a kill-or-be-killed stealth-em-up multiplayer game for 1-8 players. Smartly stalk your target – the Victorian’s call that Quarry - and wait for just the right moment to pounce on your prey. But be careful not to give yourself away to the other players hunting you! Act like an unassuming passenger to avoid revealing yourself, locate high-scoring weapons, and stalk and kill your targets in a manner that befits your station as a 'right dodgy villain'. The Best – And Smartest - Killer Wins Gain the highest number of points by the end of the round to win. Optimize your points by finding higher value weapons and keeping your exposure low, all while scoring glorious kills. Be too careful and you’ll fall behind. Be too bold and other hunters will take advantage. Employ a variety of abilities, including disguise, flash, and counter, to outmanoeuvre your adversaries and carry out your diabolical plan. Track and Avoid Use the Quarry Tracker to locate your target. Keep an eye on the Hunter Indicator to avoid getting killed. But beware as your Quarry may be watching too. Keep your cool and use the busy passenger environments to your advantage by hiding in plain sight. Forget to blend in and you’ll raise your exposure, revealing yourself to your Quarry, and your Hunter. Watch Out For The Guards Guards are on board to keep the passengers safe. Beware: they are on the lookout for killers. Anyone caught in the act will be stalled and left open to attack from other hunters. Take your pick from a line-up of sixteen nefarious killers – each as deadly as the next. From the cold and calculating Duchess to the wise-guy Dodger, it is your choice of which version of evil you feel will serve you best. Prove Yourself Climb the ranks to become number 1 in the world for most number of kills... or most number of pies eaten! Key Features: Play solo or online with up to 8 players, featuring support for custom game options and wickedly intelligent bots. Identify your quarry, plan their extravagant murder and set it into motion, all before another player wises up and does the same to you! New challenges approach! Contest in 3 different game modes Hunt, Free-For-All and Elimination and battle to come out on top Hunt in seven sumptuous locations aboard the HMCS Britannic - a state-of-the-art, colonial time ship. Blend in with the festivities in the richly decorated Music Hall or wait in the dark corners of the Engine House to pounce on your prey Customise your killer and assassinate in style. Pick your preferred archetype and skin, then blend in with the crowd to avoid detection Master the use of eight abilities – only two of which can be chosen each match, so choose wisely Be one step ahead of your victims and choose between X different perks to tweak your play style, or experiment with a new one Earn favour to win - Simple killing won’t cut it. Be discreet, commandeer a high-value weapon, strike quickly and dance over your Quarry’s lifeless body to earn Mr. X’s ultimate The party is on! You can party with up to seven friends (enemies or frenemies – who are we to judge) and join games together Prove yourself – skill-based matchmaking will ensure you face appropriate opponents, so no slacking!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/638070/header.jpg?t=1594630262",
    "Price": 9.99,
    "Developers": "Blazing Griffin",
    "Publishers": "Blazing Griffin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_f22939747f76026e956e7ab3acf4216e671c3850.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_c9dad806984faa240ea3de5481a8d80c12f22b87.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_b683436083444f0832cd5035f5ac0018916dd109.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_823c756b48628d7d52617b354d5da0c7b7f781ac.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_be78a05624fdb907e6465ec26b5a4c8b6c5e0d3d.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_add7bf60d3a5042517d869f077880d3aaa569725.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_cbe7a8da55aa0c0f818b8acd8ac14bc5a34de0b6.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_74e28953839f813432e077fd641357c7b47f56fc.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_37325f87a8d4fd467192cfd817f2b242c0fa6e31.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_c601d971ca7c0317c0da06526ccabe0cee58da57.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_4cfde4ee5c45d0e1ae1e17b13d243ec6e099072a.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_166ef349c7b2bf74e104236e08993c94d9593ab5.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_7511e9c5d6ce9425c2389f423a106edf9819f146.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_8e0de2b340baa9780e76f18a59baf890d6ec2915.1920x1080.jpg?t=1594630262,https://cdn.akamai.steamstatic.com/steam/apps/638070/ss_8e0de2b340baa9780e76f18a59baf890d6ec2915.1920x1080.jpg?t=1594630262",
    "Slug": "murderous-pursuits",
    "Meta Title": "Murderous Pursuits: Apr 26, 2018, Blazing Griffin and Ful...",
    "Meta Description": "Looking for information on Murderous Pursuits? Check out the release date (Apr 26, 2018), developer insights from Blazing Griffin, and a complete game s...",
    "Alt Text Image": "Official header image for Murderous Pursuits game - Steam 638070",
    "Canonical URL": "https://gusku.site/game/murderous-pursuits",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Murderous Pursuits\", \"description\": \"Looking for information on Murderous Pursuits? Check out the release date (Apr 26, 2018), developer insights from Blazing Griffin, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blazing Griffin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blazing Griffin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/638070/header.jpg?t=1594630262\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}