{
    "AppID": 611960,
    "Name": "Pilam Sky",
    "Release date": "Feb 22, 2018",
    "About the game": "Selection of the pilot and general information about the player's base The game takes place on the continent, inhabited by 3 nations: the Chuns, Hussians and Burmese. They differ in the unique design of the balloon and special attack. After selecting one of the pilots, the player moves to the base, decorated in the form of an airship with rooms. At the start only three rooms are open, as the campaign progresses, their number grows to thirteen. Seven of them can be pumped to level 10. The player can distribute the money earned in battles for the development of rooms as he wishes.  The global map and the essence of the strategic part of the game After getting acquainted with the base, the player gets invitation to the planning room with a global map, which lists available missions with timers and the current levels of pirate strength in the kingdoms. Kingdoms are expose to repeated attacks by pirates. To win, you need to find the base of the pirates and destroy it. (This can be done with the help of reconnaissance or defensive towers on the ground.) If the power of pirates in any of the kingdoms reaches the limit - the player loses the campaign. Battle victories can slow the pace of pirates, but the only way to reduce the power of pirates in the kingdom - to build a defensive tower. However, to build a tower in one place means to miss an attack in another. Therefore, it is important that the player has the right to choose the order of missions. Battle with pirates and the arsenal of the player Selecting on the global map the region attacked by pirates, the player goes into battle, where he moves in the real time move by his balloon and tries to destroy all the opponents, simultaneously collecting the coins scattered in level. Arsenal: - Spears, mounted on the left and right sides of the wicker basket, are used for horizontal near attacks. - The anchor suspended under the basket is used for vertical near attack. - The guns are used for remote attacks and are divided into carters, small and large-caliber guns. The player can install one gun on the left and right side. - Special attack is a reset of the object (for each people - its own) down. He falls, incidentally destroying all the enemies, but hitting them is more difficult than standard attacks. - Bonuses - auxiliary tools to facilitate the fight. Players acquire them in a special room on an airship. Activated instantly and - depending on the type - restore the ''life'' of the balloon, conduct an attack on all visible enemies, temporarily turn on the ''God mode'', etc. In case of victory, the player receives coins - a fee and collected at a level - that he uses to improve rooms, replenish ammunition and bonuses for further battles. Non-standard missions In addition to standard fights, the player is expected to have two more types of missions: Construction of the tower: destroy enemies, and also build a tower - we deliver the block after block and install them to the right places. 'Tyr', that is a fight with pirates in the region in which a defensive tower has already been built: we shoot off opponents from the turret cannon, so that none of them reaches the ground. Victory Conditions By improving the intelligence room to level 10 or building 6 towers, the player opens access to the final mission. On the basis of pirates the ''boss'' is waiting for him, overcoming which the player completes the campaign victory. (We remind you that if the power of pirates in any of the kingdoms reaches the limit - the player loses the campaign.) The approximate duration of the campaign is 3-5 hours.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/611960/header.jpg?t=1519494986",
    "Price": 3.99,
    "Developers": "BeagleGames",
    "Publishers": "BeagleGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_2463e8043a899176baedaa56ebc8a3f42c38e78c.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_6ae953c241f1d0c67f90d144c147f5e1b5150924.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_0aaeb55ad8244d358195a6ac306be33456e29550.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_7a7c8ad73c318582e5d1da15873d0314e525121d.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_3dc5faef7ae31313a3985c009c8a37f175b406c8.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_538accef8a12d22fb8e099c01046ac36700b004d.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_3fb8d313847168239dd0717d5bd167b22fb7f45d.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_54dff0315a27779814a62a4704d792279b27f64c.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_c6976bb67da9aaaaf08ee0c0439cc5cc6d18e38f.1920x1080.jpg?t=1519494986,https://cdn.akamai.steamstatic.com/steam/apps/611960/ss_69267f1fc31b44dde08b86b07113b29c1608c09a.1920x1080.jpg?t=1519494986",
    "Slug": "pilam-sky",
    "Meta Title": "Pilam Sky: Feb 22, 2018, BeagleGames and Full Overview",
    "Meta Description": "Looking for information on Pilam Sky? Check out the release date (Feb 22, 2018), developer insights from BeagleGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Pilam Sky game - Steam 611960",
    "Canonical URL": "https://gusku.site/game/pilam-sky",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pilam Sky\", \"description\": \"Looking for information on Pilam Sky? Check out the release date (Feb 22, 2018), developer insights from BeagleGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"BeagleGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BeagleGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/611960/header.jpg?t=1519494986\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}