{
    "AppID": 1997300,
    "Name": "Pretty Girls Escape",
    "Release date": "Jun 2, 2022",
    "About the game": "A puzzle game from the 'Pretty Girls 'series that requires you to play carefully and thoughtfully. Try to eliminate blocks of the same color and lead the character block(s) to the exit! Beat the stages to complete the Pretty Girls' costumes! ◆ Game content 'Pretty Girls Escape' is a puzzle game in which the player must guide the character block(s) to the exit. Players move the character block(s) by erasing blocks of the same color or sliding the stage blocks left and right. The stage is cleared when the character block(s) is led to the exit. Depending on the stage, various gimmicks appear to block the way of the character block(s). Aim for a high score by erasing many blocks at once with the fewest number of moves. ◆ Two game modes to choose from! ・ Stage mode 　Stage Mode is a mode in which 6 stages are prepared for each character. 　The difficulty level increases with each stage. 　You can earn points by accomplishing missions set in each stage. 　Use the points you earn to get new costumes from the exchange! ・ Challenge mode 　This is a highly challenging mode that requires you to play carefully and thoughtfully, one step at a time. 　There are 20 stages in total, and the difficulty level increases with each stage. 　Aim for the complete conquest of all the levels! ◆'KAWAII' girls await you! A total of 8 characters will appear in the game! New costumes can be changed in the dressing room. All characters are voiced in Japanese. ◆The Dressing Room has been powered up! The Dressing Room, a familiar feature in the Pretty Girls series, has been further expanded. In the diorama mode, you can place multiple characters at the same time and customize each character's placement, facial expression, and costume. The 'Pretty Girls Escape' also adds a decoration feature that allows you to add message stamps to the room. ◆Character introductions KANON Kanon is an innocent and positive-thinking girl with a calm and gentle demeanor. She is a hardworking person who focuses on her goals. YUKI Yuki is energetic, lively, and easy to get along with. She is active and has a good sense of humor, but at the same time, is a troublemaker. RIN Serious, cool and dignified. Once she makes up her mind, she will not it. SAYA She is a talented young lady who also has swordsmanship skills. She cares for others, even though sometimes she is harsh with her words. AOBA Aoba is shy but is a caring young lady. She has outstanding physical abilities and is good at anything that involves the use of her body. HARUKA Mild-mannered, family-oriented, and a good cook. She has a lonely side. CELEST Celeste is a goddess of war who protects people from evil and misfortune. She trains herself daily and takes pride in her power. NATE The goddess of love who lives in the heavenly realm. She is a very high-ranking being with immense power. * All characters in this game are officially licensed. * All characters in this game are over 18 years old.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1997300/header.jpg?t=1657609741",
    "Price": 4.99,
    "Developers": "Zoo Corporation",
    "Publishers": "Zoo Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1997300/ss_d61d7da43114e57aa34f37547938e17620d9b3f7.1920x1080.jpg?t=1657609741,https://cdn.akamai.steamstatic.com/steam/apps/1997300/ss_7a6cab4e2cf47fd2d2cb7bdcc44498da591498d7.1920x1080.jpg?t=1657609741,https://cdn.akamai.steamstatic.com/steam/apps/1997300/ss_4fb1b35efcd9b5ad207748ee0662e1674386fe71.1920x1080.jpg?t=1657609741,https://cdn.akamai.steamstatic.com/steam/apps/1997300/ss_12885ff52c319bc6993e4af31a043e5037fe82f0.1920x1080.jpg?t=1657609741,https://cdn.akamai.steamstatic.com/steam/apps/1997300/ss_0840b06ed39e9a89552bc8217437e0b8fbe461a6.1920x1080.jpg?t=1657609741",
    "Slug": "pretty-girls-escape",
    "Meta Title": "Pretty Girls Escape: Jun 2, 2022, Zoo Corporation and Ful...",
    "Meta Description": "Looking for information on Pretty Girls Escape? Check out the release date (Jun 2, 2022), developer insights from Zoo Corporation, and a complete game s...",
    "Alt Text Image": "Official header image for Pretty Girls Escape game - Steam 1997300",
    "Canonical URL": "https://gusku.site/game/pretty-girls-escape",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pretty Girls Escape\", \"description\": \"Looking for information on Pretty Girls Escape? Check out the release date (Jun 2, 2022), developer insights from Zoo Corporation, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1997300/header.jpg?t=1657609741\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}