{
    "AppID": 895870,
    "Name": "Project Wingman",
    "Release date": "Dec 1, 2020",
    "About the game": "Project Wingman is a combat flight action game with an emphasis on polished and refined gameplay, true-to-its-roots inspirations, and an engaging single player experience. Perfect for those who aren't looking for a simulator experience, with the ease of pick up and play, all the way to those who want a fast-paced challenging flight action game. Dogfight, strike, and fly through combat zones based off an alternate history of Earth. Either over the cold waters of the Bering Strait, attacking tanks in the brutal environments of Yellowstone magma fields, or diving through the Redwoods to strike targets of opportunity in the Pacific Northwest, across the oceans, above the scarred lands of the world, this war will take you from exotic battlefield to exotic battlefield, all while going up against odds way above your pay grade. Pure Combat Flight Action Exotic weaponries such as railguns and geothermal-powered armaments will be ready to pluck you out of the sky if you're careless. Whether you are an attack aircraft pilot, skimming the ground with a gatling gun and rocket launchers attached to your wing, or an interceptor with long range, almost sniper-like missiles at your disposal, it will be up to you to prove yourself as an Ace pilot. Conquest Mode In Conquest Mode, fight in an uphill battle against various bosses and ace squadrons in a territory capture game, drawing elements from roguelikes and RPGs. Players will have to earn enough money to not only purchase new aircraft, but build a mercenary army of their own in order to take on waves of increasingly difficult opposition as they struggle to take on a myriad of changing missions. Virtual Reality Virtual Reality headsets will work in-game to put the player in the cockpit of aerial warfare, immersing themselves in head-swiveling combat. Combine this with full compatibility with HOTAS peripherals and custom axis curves, and you will be able to experience the game however you want, using any DirectInput supported peripheral you like. Key Features: Fly in varied and exciting scenarios and locations unlike you've ever seen before Engaging single player campaign Over 20 different aircraft and over 40 unique weapons at your disposal Fight different kinds of adversaries such as giant mechanized fortresses and railgun cannons Test your skills in Conquest mode and fight against hordes of adversaries Want a different Conquest experience? - Adjust it with modifiers to your liking Beautiful 3D Volumetric clouds rendered with TrueSKY Fully rebindable controls and HOTAS compatibility with DirectInput support VR Support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/895870/header.jpg?t=1625008344",
    "Price": 24.99,
    "Developers": "Sector D2",
    "Publishers": "Sector D2,Humble Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_a198aed40e8109bc44144a7aa693fc167d2b7487.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_0c3c1e3d9f6365b4545920512feb7113110caeef.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_2cc7e34fa8efc4bb4d4a5a385ac8d69c37941335.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_23a41b7a931ebcc2e3c916ddf3fe69adc854cac9.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_ebd838c749ed57f300a7524a2de04a00621b3d21.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_fae98b7552ad0b4639dd2ab92ec82bba4bb038db.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_91053990a907458c1801345f464dedff52e56121.1920x1080.jpg?t=1625008344,https://cdn.akamai.steamstatic.com/steam/apps/895870/ss_c8ad80c90e1c1c3cb7ac43e36dab2cf08e40d1ca.1920x1080.jpg?t=1625008344",
    "Slug": "project-wingman",
    "Meta Title": "Project Wingman: Dec 1, 2020, Sector D2 and Full Overview",
    "Meta Description": "Looking for information on Project Wingman? Check out the release date (Dec 1, 2020), developer insights from Sector D2, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Wingman game - Steam 895870",
    "Canonical URL": "https://gusku.site/game/project-wingman",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Wingman\", \"description\": \"Looking for information on Project Wingman? Check out the release date (Dec 1, 2020), developer insights from Sector D2, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sector D2\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sector D2,Humble Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/895870/header.jpg?t=1625008344\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}