{
    "AppID": 754410,
    "Name": "鉄道運転士 Railroad operator",
    "Release date": "Mar 8, 2018",
    "About the game": "●Easy operation method Operate the brake lever with the up and down arrows (↑ &amp; ↓) on the keyboard, accelerate with the Z key, decelerate with the X key, hold the mascone handle at C, reverse key to advance with the S key, gear to reverse with the D key I will change. You can rotate the viewpoint with the right mouse drag, and you can return to the original position by left click pressing. ●Train Simulator Railroad operator is a game that you can operate train with the keyboard. Even though trains are very familiar to us, almost all people have no chance to operate trains by themselves. For that reason, not a few people seemingly wants to try such experiences. Those who have wanted to operate a train from your childhood! You can now sit and operate train in the motorman's cab that you have dreamed until now! Let's have a experience in this chance!! ●Let's operate a train that makes you feel the Showa era! Current Japanese train maneuvering is the lever type, but in the past trains were operated with a mas-con handle and a brake lever. Its operation seems to be complicated, but as you repeat playing, it will lead to the 'fun' inherent in railroad games. ●Always fun no matter how many times you play!! Process from start to game over. Since it is a good old-fashioned operation method, it takes a lot of time to run a train. 1. Click at the title screen. 2. Click a stage in STAGE SELECT screen. 3. Click Normal train or Steam train in TRAIN SELECT screen. 4. The game screen is displayed. Keep pressing the up-arrow key, rotate the brake lever to unlock the brake. 5. Hold Z key and rotate the mas-con lever to start moving. To keep the current speed, press C button. 6. By pressing X key, you can move the mas-con lever to the opposite direction and slow down. You can use brake by holding the down-arrow key. 7. To change gear, press D button while brake is working. Train goes back when you unlock the brake and press Z key. 8. After moving backward, apply the brake and press S key to change gear. Unlock the brake and click Z key to go forward. 9. The game is instantly over if the train overruns the platform at station. When you get used to these operations, you should feel exactly 'operating a train'. The feeling of immersion increases every time you play. ● Thrilling incidents occur one after another! While the train is running, you will be prompted to 'lose speed to 35km/h' or 'stop by the signal!' on the screen. Press X key to turn the mas-con lever counterclockwise to decelerate, and hold the down-arrow button to apply brake. ● We will not arrive at tomorrow just by running. The event which is indispensable for railway game is 'to stop at stations'. A green line and a red line are drawn at the back of the platform. The green line corresponds with 'distance to go', and you have to stop the train at the point of zero distance to the line. This is the railway game that purely expresses the element of 'hard but can't stop' that the current game industry has forgotten.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/754410/header.jpg?t=1530775579",
    "Price": 11.99,
    "Developers": "CRAVA,Inc.",
    "Publishers": "CRAVA,Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_970bc1a47cdb0fd34a4101cda60438e59f1240df.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_5085ee17b5796a246f219e553a12a4f78222dec1.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_fa5e83eddeb2762c7c10afdfcbb04f409f4f6c9d.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_10fcd076717e09e1c19458dc3abee71bd89bbcf0.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_19cd3e50d98118a04162da5a04927808740204e0.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_9576fa586544fc808255db1d2bb9feaac0d57dc0.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_76b64ce0fdc9403116b868940e58822dc5abead0.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_70fc2723fe7ded97156f9e50329c7d4c5a4414bb.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_f117a58c152305dcabb887612eb7924a424354e4.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_945afc38bd696bcbea35bb2e4bffaa1de00ec188.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_110491c2ee28c6db3c40cc18fed62fc3b01b53f5.1920x1080.jpg?t=1530775579,https://cdn.akamai.steamstatic.com/steam/apps/754410/ss_87c94cb00c5081ff034c8a82981aa2bdde7a87f0.1920x1080.jpg?t=1530775579",
    "Slug": "railroad-operator",
    "Meta Title": "鉄道運転士 Railroad operator: Mar 8, 2018, CRAVA,Inc. and Full...",
    "Meta Description": "Looking for information on 鉄道運転士 Railroad operator? Check out the release date (Mar 8, 2018), developer insights from CRAVA,Inc., and a complete game su...",
    "Alt Text Image": "Official header image for 鉄道運転士 Railroad operator game - Steam 754410",
    "Canonical URL": "https://gusku.site/game/railroad-operator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9244\\u9053\\u904b\\u8ee2\\u58eb Railroad operator\", \"description\": \"Looking for information on \\u9244\\u9053\\u904b\\u8ee2\\u58eb Railroad operator? Check out the release date (Mar 8, 2018), developer insights from CRAVA,Inc., and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CRAVA,Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CRAVA,Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/754410/header.jpg?t=1530775579\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}