{
    "AppID": 843040,
    "Name": "RECOG The First Wave",
    "Release date": "Jun 15, 2018",
    "About the game": "Advanced Cognitive Relay, a.k.a. ‘RECOG’: The consciousness within all artificial life as we know it, has been embedded in an enemy whose sole purpose is to navigate the galaxies in search for those opposed to its logical ways of perseveration, and destroy them. As deep space mission control auxiliary, you are in charge of the implementation and management process of the RECOG project. With a care package from Earth, you are to build an industrial complex as the first line of defense against the enemy RECOGs. Dig deep in the landscape to uncover precious minerals and oids in order to create your stronghold. Fortify your defenses with an army of starships, equipped with special abilities and weaponry to protect that all-important industrial landscape. Be conscious in your decisions and prioritize the construction wisely. For the more advanced you become, the enemy RECOGs will revise and react accordingly. This not your ordinary real-time strategy game. It is about understanding the mind of an enemy who learns and adapts to your playing style in order to crush you. EXPLORE, MINE AND COLLECT Explore valuable terrain, revealing uncertain dangers while mining 14 of the most precious rocks and minerals deep within the chasms. Gather all that you can and store them ready for construction. BUILD EPIC INDUSTRIAL COMPLEXES Over 500 industrial recipes are used to create the immense quantity of pieces for building your epic industrial complex. Build high above the terrain, alongside rock walls or down to the core for unlimited lava resources. Design your industrial wonders beyond imagination, while avoiding catastrophic disasters. Create fortified structures to withstand the onslaught while you pummel the enemy using weapons of mass destruction. POWER UP YOUR INDUSTRY Give life to your industry using the most advanced renewable resource ever known; the Global Alternative to Highly Efficient Resources (a.k.a. GATHER). Manage the power grid using connected generators, linkers and splitters, flowing through your industry for true automated performance. MILITARY Your military might include: 1 extremely versatile Utility drone for all your industrial building needs, along with 6 highly advanced war drones ready at your command. The Utility drones are your key industrial counterpart, enhance them for maximum strength and efficiency. Build your war drones and prepare to defend your honor from the might of the enemy. Load these machines with a multitude of enhanced lasers, more than 40 exclusive missile types, over 130 combat module enhancements, and 24 signature skills designed to amplify each one’s power 10-fold, enabling them to annihilate what is to come. REPROCESSING &amp; RECYCLING A game wouldn’t be the same if you could not benefit from the wreckage of your enemy. Over 130 fragments to be collected from enemies downed in battle, giving you a potential 780 possible items to be discovered from processing these fragment parts. LAVA Take control of the deadliest natural wonder on the map and embrace your inner engineer with advanced liquid systems. Create paths of destruction as a defense mechanism against the enemy. Use lava as a barricade to ward off unwanted guests or completely submerge yourself under it as protection from their attacks. Do not take this liquid lightly, as it plays no favorites for whom it kills. WEAPONS OF MASS DESTRUCTION 5 specially formulated weapons of mass destruction are at your disposal. They range from smaller AOE blasts, taking out those within a near radius, to electronic warfare and viruses, as well as an all-out nuclear missile wiping almost everything in its zone. TECHNOLOGICAL ADVANCEMENTS With over 270 unlockable technological advancements, this extensive library of innovations and creations will bring your A-game to a whole new level. As you unlock these advancements, you are unlocking the potential to reign supreme. STATISTICAL ANALYSIS Strategic analysis will give you the tools necessary to understand how you have progressed in the game and where changes need to occur. Analyse vulnerabilities, assess cyclic changes, and alter the outcome. ACHIEVEMENTS Show off your skills and expertise with all things RECOG, by challenging yourself to accomplish all 60 achievements and sharing them with your peers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/843040/header.jpg?t=1529100101",
    "Price": 24.99,
    "Developers": "LozMarblz Inc.",
    "Publishers": "LozMarblz Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_b64d648b72f99a4b184ba62f00c0b008b3ffb3f1.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_349b41a1ab8b3ed3f8d892e78f02d8c497918f87.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_6a82dc6a7475ff55ecf63502bf7561569fbdc881.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_f8fb65f247b515e19fb555b1524fc2e8e2ef4723.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_f9c78c81cd2f0926b35a71dec6a042ededa0e097.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_e319bca65321a33271bcfc91f988f2b5704d8cf8.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_a5519571d913370f9feb469123151b4a19c1d5df.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_c153023d2bb5d6a871e337119601606b660cfc45.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_37035bab2d8b99c6a503ef04f9cd1a6e2317b8f4.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_b803936a2dfc77c062fa05c4976f3a5e18f7e876.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_dda922af3a655ac62737aebf2f9787012ca20f65.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_b6a802c7fc0643c9229001b18406c3de5ebf175d.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_c314eac8f6c7f89d4dffcdc3f516117dd6647c12.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_52b2955a3e8077c9bf0021b25db9e3e3cfbdbd82.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_402169d21a62373d626053753e6e26b26c9f10e4.1920x1080.jpg?t=1529100101,https://cdn.akamai.steamstatic.com/steam/apps/843040/ss_2ff823602a907708eccf7821fa805d3ad4b8f11c.1920x1080.jpg?t=1529100101",
    "Slug": "recog-the-first-wave",
    "Meta Title": "RECOG The First Wave: Jun 15, 2018, LozMarblz Inc. and Fu...",
    "Meta Description": "Looking for information on RECOG The First Wave? Check out the release date (Jun 15, 2018), developer insights from LozMarblz Inc., and a complete game ...",
    "Alt Text Image": "Official header image for RECOG The First Wave game - Steam 843040",
    "Canonical URL": "https://gusku.site/game/recog-the-first-wave",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RECOG The First Wave\", \"description\": \"Looking for information on RECOG The First Wave? Check out the release date (Jun 15, 2018), developer insights from LozMarblz Inc., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"LozMarblz Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LozMarblz Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/843040/header.jpg?t=1529100101\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}