{
    "AppID": 270450,
    "Name": "Robot Roller-Derby Disco Dodgeball",
    "Release date": "Feb 19, 2015",
    "About the game": "Disco Dodgeball combines the one-hit-kill projectile combat of classic dodgeball with flowing skateboard-style movement and neon-drenched dance club arenas to create a unique, exhilarating, and incredibly fun FPS sports experience. Dodge, deflect and catch enemy fire as you perform ridiculous aerial stunt shots with your mustachio'd unicycle robot. Play a wide variety of classic, expert, and custom game modes in offline singleplayer, local multiplayer, or online multilpayer matches. Includes: 21 different multiplayer modes &amp; solo/co-op challenges to test your skills and teamwork - like Hoops, Grand Prix racing, and of course classic Elimination. Deep game mode customization with in-game rule editor allows you to mutate &amp; remix gameplay with near-limitless possibilities Offline singleplayer challenges, bot matches, and randomized Arcade mode where you battle waves of bots &amp; bosses using clever combinations of superpowered perks Online multiplayer servers provided at no extra cost. Easily create your own public or unlisted online rooms without any server knowledge required. No online queues - jump into a match and start playing within seconds of game launch Split-screen Local Multiplayer PvP and co-op challenges with up to 4 players Cosmetic hats, robot bodies, heads, wheels, decals, sunglasses, moustaches, and ball FX that can be crafted or earned from random in-game drops Powerups like Jetpacks, Huge Dodgeballs, Laser Balls, and Boomerang Balls. Pick them up randomly or enable as permanent arena modifiers. Co-op challenges that let you team up with friends, equip scenario-specific powerups, destroy bots and aim for leaderboard high scores. Random loot drops that you can craft into rare cosmetic items, trade with other players, or sell on the Steam Marketplace. LAN support Steam Workshop support to submit your own cosmetic items for inclusion in the game Capture and share your best shots as replay GIFs An amazing electronic music soundtrack and playback of audio files from your own computer. Arena lights pulse dynamically to the beat of the music. A monster truck announcer AlienFX-equipped computers glow and pulse to match the arena lights Persistent stats and achievements Still being regularly updated with new content and features based on community suggestions! PHOTOSENSITIVITY WARNING: This game contains lots of flashing lights. You can enable photosensitive mode in options / video. This will disable lasers, bright explosions and other lights that pulse to the beat of the music.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/270450/header.jpg?t=1580175857",
    "Price": 9.99,
    "Developers": "Erik Asmussen",
    "Publishers": "82 Apps",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_4f3cfb5a79694940e7ce3bddd86f163ca46c435e.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_27c55dafccd8e7d94653b74d835da32468cb63ba.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_5fd3218a0b70e6c96db5ce1511daf7a220d7371a.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_32a57a9e1663bb5adb42a160d5543946df11850a.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_905f5b85696d99257cd4e281d48a9420218a21ae.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_e63479c8b0b9dd9e19451667fabb9cee45b643ff.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_a531890ce2ad152d92e0e3028fe0d3b9103d3287.1920x1080.jpg?t=1580175857,https://cdn.akamai.steamstatic.com/steam/apps/270450/ss_c7eea9fa84ec74c541010def4f130d0dcc96cf52.1920x1080.jpg?t=1580175857",
    "Slug": "robot-roller-derby-disco-dodgeball",
    "Meta Title": "Robot Roller-Derby Disco Dodgeball: Feb 19, 2015, Erik As...",
    "Meta Description": "Looking for information on Robot Roller-Derby Disco Dodgeball? Check out the release date (Feb 19, 2015), developer insights from Erik Asmussen, and a c...",
    "Alt Text Image": "Official header image for Robot Roller-Derby Disco Dodgeball game - Steam 270450",
    "Canonical URL": "https://gusku.site/game/robot-roller-derby-disco-dodgeball",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Robot Roller-Derby Disco Dodgeball\", \"description\": \"Looking for information on Robot Roller-Derby Disco Dodgeball? Check out the release date (Feb 19, 2015), developer insights from Erik Asmussen, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 19, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Erik Asmussen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"82 Apps\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/270450/header.jpg?t=1580175857\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}