{
    "AppID": 1630630,
    "Name": "Run, Kitty! - A Furry Gay Visual Novel",
    "Release date": "Nov 12, 2021",
    "About the game": "Powerful males will take over the world. In the good sense of those words. We produce sexual Visual Novels in the bara and furry genres. In our games, you will find romance, tenderness, love and big furry males who give unforgettable moments of fun – we hope so. The opportunity to develop romantic relationships with big males is a trademark of our games. What could be better than strong warm cuddles of these gorgeous males – who will never make you feel lonely. Trust us, you will see their strength and assertiveness in all its glory. If you’ve never paid attention to furry bodybuilders, try it out! The romantic scenes involving your beloved character will make you melt with joy. We happily invite you to try these males not only by touching them but also by tasting them. There’s enough love for everyone! Don't overdo it though… Once upon a cat named Simon who decided to skip classes at the university to walk through the forest – alone with nature. Before he knew it, he got lost in the deep forest – chased by an unknown predator. Will he be able to get out of the forest by his own means? - A Romantic story rooted in the deep forest – Who will be your savior and future lover? - Three distinct endings: Normal, Good, and Happy – Finish them all three and unlock the bonus scenes! - Homosexual content – Enhance your time with your favorite muscular male! The game includes: - Approximately two hours of game content - A world composed of five unique locations - Up to six artworks including two artworks of sexual nature - The ability to form a relationship with the huge dog We are a united team with a passion for muscular furry boys. It is this passion that gave birth to 'Run, Kitty!'. Despite the available resources, our determination has allowed us to overcome the difficult moments during the development and make 'Run, Kitty!' a reality. We sincerely hope you enjoy our work. We wish to thank the character from the banner and the team’s mascot Stefan, the Samoyed. He is a massive and very powerful dog who helps us in development – looking after our comfort and sanity. This is only the beginning; we have great plans for the future development of the team, including the production of new games! If you like our projects and handsome dogs, support us by following us on social media. Stay tuned! Stefan has prepared some entertainment for you :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1630630/header.jpg?t=1637221897",
    "Price": 4.99,
    "Developers": "Strong & Furry",
    "Publishers": "Strong & Furry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1630630/ss_a953ab7963c892a354bfd3056062659bbacdb6c3.1920x1080.jpg?t=1637221897,https://cdn.akamai.steamstatic.com/steam/apps/1630630/ss_183c7ed8dff2ca10f98a265572e81510ee707c24.1920x1080.jpg?t=1637221897,https://cdn.akamai.steamstatic.com/steam/apps/1630630/ss_524ddbd19ddac440389e3a039f68076d525751c0.1920x1080.jpg?t=1637221897,https://cdn.akamai.steamstatic.com/steam/apps/1630630/ss_a6bfc705962b10be24ed6ddb75ccbbb4f6480c71.1920x1080.jpg?t=1637221897,https://cdn.akamai.steamstatic.com/steam/apps/1630630/ss_a6ece54b618bab09493c0e5be0c6acbaf4542330.1920x1080.jpg?t=1637221897,https://cdn.akamai.steamstatic.com/steam/apps/1630630/ss_b1b162ba359ea4b8d070c71a35c114b14c297203.1920x1080.jpg?t=1637221897",
    "Slug": "run-kitty-a-furry-gay-visual-novel",
    "Meta Title": "Run, Kitty! - A Furry Gay Visual Novel: Nov 12, 2021, Str...",
    "Meta Description": "Looking for information on Run, Kitty! - A Furry Gay Visual Novel? Check out the release date (Nov 12, 2021), developer insights from Strong & Furry, an...",
    "Alt Text Image": "Official header image for Run, Kitty! - A Furry Gay Visual Novel game - Steam 1630630",
    "Canonical URL": "https://gusku.site/game/run-kitty-a-furry-gay-visual-novel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Run, Kitty! - A Furry Gay Visual Novel\", \"description\": \"Looking for information on Run, Kitty! - A Furry Gay Visual Novel? Check out the release date (Nov 12, 2021), developer insights from Strong & Furry, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strong & Furry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strong & Furry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1630630/header.jpg?t=1637221897\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}