{
    "AppID": 826040,
    "Name": "Sacred Stones",
    "Release date": "Jul 23, 2018",
    "About the game": "It was finally released after a long development. Looking for a hardcore platforming game with an emphasis on boss gameplay? Then Sacred Stones is the perfect retro-platforming indie-game for you! Sacred Stones brings a unique blend of retro-2D boss based gameplay. Explore the pixelized world, gathering items and weapons to help guide you to victory! Created by Sungjun Jo (NoxBix), Sacred Stones’s retro-feel comes from its appearance, its soundtrack (created by “.P”), and its gameplay; Sacred Stones is retro to the core. The sensitive input controls complement the linear &amp; challenging gameplay. You will find yourself jumping &amp; shooting and running &amp; fighting your way to the end of the game as you learn uncover new weapons &amp; areas across the map! Be careful of the hardcore nature of Sacred Stones! In danger of falling, getting killed or becoming victim to your own error, players will face many challenges in their quest to beat the game. Transport back to the 80s &amp; 90s with the retro control scheme and sensitivity of Sacred Stones! Fast input feedback and quick gameplay are essential to mastering the game. Use the AZ &amp; X keys for jumping, attacking, switching weapons and much more. Utilize the directional arrows as they are meant to be used: movement! Find and use 4 different weapons to defeat the bosses and gain victory in Sacred Stones! Face 20 different and unique bosses as you travel around the world. Each boss brings a new challenge and requires strategies catered to each to achieve victory. Don’t stop with what you see on the surface of Sacred Stones! As you navigate around the gameworld try and locate hidden missions to experience more of the amazing retro gameplay! Hello, I'm NOXBIX's game director and developer Sungjun Jo. Sacred Stones is a game I have been developing since I was a high school student. I started with a high goal from the beginning, but I think I made it as I intended without compromising myself. It was a lot of work to make new things out of everything I developed. There were a lot of accidents during development, but I am very happy and proud to release this. I hope you like it. If you give us a lack of points or feedback while you play, we will actively try to develop it into a better game. Thank you. I have been impressed with Cave Story during my junior high school days and have developed the dream of game developers. Can I make a game like this? I used to ask myself the question of the rough and delicate Cave Story graphics. That's why you may feel the same atmosphere in my game. If you compare Sacred Stones with the Cave Story, it's a small game, but I think it's my first step. In the future, I will make a more unique and fun game with my own color. Thank you for your support until then. by Sungjun Jo (NOXBIX)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/826040/header.jpg?t=1614737110",
    "Price": 9.99,
    "Developers": "CFK Co., Ltd.",
    "Publishers": "CFK Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_e98353b746364fd867c3041dd9bbac775c4c9355.1920x1080.jpg?t=1614737110,https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_ef7c0edd35f347de3b04976998f0a3f7ab9dd3ef.1920x1080.jpg?t=1614737110,https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_f0adb5f5fbb4242d75e9dee929f72aaff62ac5e2.1920x1080.jpg?t=1614737110,https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_5495c4ae348915dc142445f33b799e5b9613df4a.1920x1080.jpg?t=1614737110,https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_cd45753386c5f8a3deec0a5c1715f26a8109610c.1920x1080.jpg?t=1614737110,https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_49b8ca223dadea326e3fddda951b4a430d42dd53.1920x1080.jpg?t=1614737110,https://cdn.akamai.steamstatic.com/steam/apps/826040/ss_6c1e8343baa304ebeb6798726b80f227f71b07d8.1920x1080.jpg?t=1614737110",
    "Slug": "sacred-stones",
    "Meta Title": "Sacred Stones: Jul 23, 2018, CFK Co., Ltd. and Full Overview",
    "Meta Description": "Looking for information on Sacred Stones? Check out the release date (Jul 23, 2018), developer insights from CFK Co., Ltd., and a complete game summary.",
    "Alt Text Image": "Official header image for Sacred Stones game - Steam 826040",
    "Canonical URL": "https://gusku.site/game/sacred-stones",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sacred Stones\", \"description\": \"Looking for information on Sacred Stones? Check out the release date (Jul 23, 2018), developer insights from CFK Co., Ltd., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CFK Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CFK Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/826040/header.jpg?t=1614737110\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}