{
    "AppID": 946460,
    "Name": "Seven days with the Ghost",
    "Release date": "Oct 12, 2018",
    "About the game": "An occult yuri game created by members of 2ch, Seven days with the Ghost takes place at the girls-only Keisei Academy, in the modern era where magic exists alongside science. Ayako is told that the Occult Research Club will be closed down if more members don’t join, so she does whatever she can to attract interest in order to save her club. To do so, she attempts to explore the legendary “Seven Wonders of the Academy.” However, each wonder she seeks out only results in failure. Finally, she tries the only thing that’s left, the Seventh Wonder: “Get kicked by a horse and die,” which turns out to be more than outrageous– She accidentally digs her own grave out of curiosity, and finds something strange. These are the strange, fun, and— precious seven days of Ayako and her friends. With only seven days left for her investigation of the Seventh Wonder, Ayako happens upon her friend Anna and another girl, Komaki, making love in Anna’s room. Ayako seemingly had no intention to peep but in the process of doing so she comes across the ghost. Ayako screams in surprise and is subdued by Anna who discovers her peeping. Unable to explain herself, Komaki is convinced that Ayako is some sort of pervert and Anna dismisses the idea that a ghost appeared only because they were having sex. Dejected, Ayako returns to her room where Miyabi, the ghost, appears before her again. She finds out that Miyabi in fact is a fan of peeping on girls making love. With no way of writing a report on a ghost that is not only, not haunted by the past or a grudge, and instead simply has a unique past time, Ayako tries to find a way to convince Anna and Komaki that the ghost is real. The plan is basically to convince Anna and Komaki to get it on in order to lure the ghost out. What Ayako doesn’t realize is that seeing Anna making love to another girl is also causing her to question her own emotions and desires as well. These are the odd, fun, and precious seven days of Ayako and her friends. Full Japanese voice acting, including the main character Uncensored H-scenes Music composed by wata of game developer LizArts Captivating single route storytelling with two endings Beautiful artwork by 400",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/946460/header.jpg?t=1580430641",
    "Price": 9.99,
    "Developers": "Lilies Project",
    "Publishers": "Denpasoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/946460/ss_e2e8bfdf0a1cf5855b02e610c3d7169c61dcbd9c.1920x1080.jpg?t=1580430641,https://cdn.akamai.steamstatic.com/steam/apps/946460/ss_d79ec22b6a988367cf7fb94ee6ad2c88c0e3185b.1920x1080.jpg?t=1580430641,https://cdn.akamai.steamstatic.com/steam/apps/946460/ss_3dd76b336b2d99aae9333854825e2ff62418dccc.1920x1080.jpg?t=1580430641,https://cdn.akamai.steamstatic.com/steam/apps/946460/ss_b63f88906142b539e0346d3059e7fb78ebb7d49a.1920x1080.jpg?t=1580430641,https://cdn.akamai.steamstatic.com/steam/apps/946460/ss_6147f18f7f6f174df29f76088e3ee605354e62ec.1920x1080.jpg?t=1580430641",
    "Slug": "seven-days-with-the-ghost",
    "Meta Title": "Seven days with the Ghost: Oct 12, 2018, Lilies Project a...",
    "Meta Description": "Looking for information on Seven days with the Ghost? Check out the release date (Oct 12, 2018), developer insights from Lilies Project, and a complete ...",
    "Alt Text Image": "Official header image for Seven days with the Ghost game - Steam 946460",
    "Canonical URL": "https://gusku.site/game/seven-days-with-the-ghost",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Seven days with the Ghost\", \"description\": \"Looking for information on Seven days with the Ghost? Check out the release date (Oct 12, 2018), developer insights from Lilies Project, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lilies Project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denpasoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/946460/header.jpg?t=1580430641\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}