{
    "AppID": 685050,
    "Name": "Spartan",
    "Release date": "Oct 2, 2017",
    "About the game": "Huge update for 2019! Now Spartan is a lot easier and more balanced gameplay wise, making it an ideal platformer for the whole family that still enjoys a challenge ! If you are upgrading from an older version of the game and you are facing key binding issues please delete the file 'input.ini located at: Local disc&gt;Users&gt;Your computer Name&gt;AppData&gt;Local&gt;Spartan&gt;Saved&gt;Config&gt;WindowsNoEditor (please note that you must first enable the 'view hidden folders' from windows settings in order to see the AppData Folder) King Leo kicks platforming back to the arcades! Spartan is an old-school platformer for hardcore gamers, powered by UE4. STORY: Sparta, 500 BC. The city-state's weapons, armor and gold have mysteriously vanished. Magical portals begin to appear throughout ancient Greece. As a king and the world's most fearsome warrior, Leonidas sets out to discover who is behind the threat, and recover everything that was stolen. You, are King Leo. And your aim is to make whoever is responsible and whatever stands in your way, rue the day they crossed your path. Block, stomp, run, jump, fall, climb, cling, push, spring &amp; slice your way to victory. Outsmart intelligent enemies, tread carefully through obstacles and use your wits to defeat bosses in epic battles. THIS.. IS.. Spartan! FEATURES: Non-linear Levels No matter which path you choose, you can always return to any point. Feeling greedy and want to go back and collect all of the coins? No problem! There is no area you cannot return to. But remember to plot your routes and keep track of where you've been, because without retrieving all of the artifacts or chests you won't be able to activate the magical escape portal. Not happy with your score? You can replay any level, any time, once it’s been unlocked. Immerse yourself Memorable atmospheric soundtrack with ethnic overtones. Crisp and detailed handcrafted art. Hyper-smooth 2D physics based mesh animations. Fun, intelligent and reactive enemies. A huge variety of traps and obstacles. Pixel-perfect controls When the margin for error is small, responsive controls are a sheer delight. You command, and King Leo executes with lightning speed. You say 'Jump!', and he says 'How high?'. If your reflexes are fast enough, his reflexes will be fast enough. Every step counts and every move is in your hands. Clocking in at a stable 60fps even with most Medium Spec hardware, 'Spartan' leaves gamers no excuse to not succeed. 20+ Hours of Gameplay More, if you want to unlock the entire gallery and learn some ancient Greek words! With 4 distinct worlds and 24 challenging levels, you'll find yourself proclaiming: 'Tough, but fair!'. Failing is a thing of the past when there is virtually no loading time between losses. Couple that with plenty of checkpoints, and you're ensured a smooth gaming experience. If, for whatever reason, you find the game too difficult, you can double your health. This is aptly called “Wimp Mode“! SPARTAN: Are you up to the challenge?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/685050/header.jpg?t=1546562395",
    "Price": 0.99,
    "Developers": "Sinister Cyclops Game Studio",
    "Publishers": "Sinister Cyclops Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_c3226c81e730919091b98a188dacff491db614d5.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_ffb6e8ff27284b9f4aa9a1a434cb4454c27822ca.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_848033618d3b9747c8a7624938ea53ac35ced28c.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_30a631c0935699489948c9cdd623690fa98141fe.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_0386ece4271a0f485935060231f8b96a8e2b82a5.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_44e6cba5e2150353b7168e14af42af7bbfb1379a.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_ab9ee9959dacf02156222af0c0fda270bf4e61b6.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_9fe386c297bd53149312dee96096eb21c7a317a6.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_21b27f39888199def29652c46a59853e99400bcc.1920x1080.jpg?t=1546562395,https://cdn.akamai.steamstatic.com/steam/apps/685050/ss_3d22ded9714f66d88a254af751115bf4e1f2b23e.1920x1080.jpg?t=1546562395",
    "Slug": "spartan",
    "Meta Title": "Spartan: Oct 2, 2017, Sinister Cyclops Game Studio and Fu...",
    "Meta Description": "Looking for information on Spartan? Check out the release date (Oct 2, 2017), developer insights from Sinister Cyclops Game Studio, and a complete game ...",
    "Alt Text Image": "Official header image for Spartan game - Steam 685050",
    "Canonical URL": "https://gusku.site/game/spartan",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spartan\", \"description\": \"Looking for information on Spartan? Check out the release date (Oct 2, 2017), developer insights from Sinister Cyclops Game Studio, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sinister Cyclops Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sinister Cyclops Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/685050/header.jpg?t=1546562395\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}