{
    "AppID": 991810,
    "Name": "Strategic Mind: The Pacific",
    "Release date": "Oct 25, 2019",
    "About the game": "Strategic Mind: The Pacific is a turn-based strategy set in the WW2 period depicting the war between the USA and the Empire of Japan waged in the Pacific Ocean with mindblowing historical accuracy and attention to detail. It offers an immersive experience of commanding both sides of the conflict, allowing you to gain a unique understanding of the situation through the eyes of both sides' top commanders, resulting in enjoyable and insightful gameplay. Build up, train, and equip your troops with the newest weaponry available to maximize their efficiency and set sail for victory. The core element of the game is large scale naval battles with numerous carrier ships bringing so much more aircraft into the battle for seizing control over the ocean. Upon overtaking the sea you will have to set foot on hostile land through a series of costly landing operations. You will have to make your naval, aerial, and amphibious forces act as one flawless mechanism - a task only a truly strategic mind can achieve. Key features: Play both sides of the conflict to gain a unique insight into the epochal events of the War in the Pacific: the United States of America defending both its global power and its ideals; and the Empire of Japan fighting for the right to take the future of our world into its hands. You can decide which ships, submarines, and aircraft will constitute the bulk of your force. Manage your fleet between missions with all models becoming available at the historically accurate moments. Unique system of attachments allows customizing your units with additional equipment to increase their efficiency and weave them perfectly into the strategy of your own division. Oversee your units becoming more experienced combatants throughout the campaign and choose which skills they should focus on to better suit your strategy. Detailed system of naval battles allows you to damage various ship systems, such as all sorts of armament, hull, engine, flight deck, etc. For instance, damaging enemy ship`s engine will reduce its speed and thus all of its defenses making it easy prey for the rest of your flotilla. Choose which of the commander skills will better suit your strategy and employ them at the right moments to turn the tide of battle. Modern graphics combined with historically accurate models of all units make the playing experience much more immersive than ever before. Employ the heroes forged by the furnace of war for the most difficult tasks to ensure the success of the operation. Witness the events unfold through the plot-driven cutscenes. Intricate combat mechanics allow you to show the full extent of your tactical and strategic superiority. No “premade DLC nonsense” and long-term support. You gain access to the two full campaigns when you buy the game with all the features. We are likely to make some additional content in the future, but we offer you the full game you can play without worrying about the need to buy any crucial DLCs. The game will be supported long-term in any case.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/991810/header.jpg?t=1658132760",
    "Price": 29.99,
    "Developers": "Starni Games",
    "Publishers": "Starni Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_47f0cb6eaad2d7805ffa3a705cb079e1b1bb96c3.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_924a3b51b082b46b7b1bd0b4e515f7e5edd935f5.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_65cba39993cc19567869fa74e13d1922eb5d2cee.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_118b7061460b3c5f382dd030f66d15cf8451cc62.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_76231762da77e4c899d75e4fa3639881954d07e1.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_2000a734f5b31925ac62d812ac5ba3418723cb05.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_f4c53ae292a0d841a94867d62db47ac82c0b0d34.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_a44e5b94fa5c39324b3232f68e30be5657068cd3.1920x1080.jpg?t=1658132760,https://cdn.akamai.steamstatic.com/steam/apps/991810/ss_acda886a9c011f49351e9ae85f075ff930c359dc.1920x1080.jpg?t=1658132760",
    "Slug": "strategic-mind-the-pacific",
    "Meta Title": "Strategic Mind: The Pacific: Oct 25, 2019, Starni Games a...",
    "Meta Description": "Looking for information on Strategic Mind: The Pacific? Check out the release date (Oct 25, 2019), developer insights from Starni Games, and a complete ...",
    "Alt Text Image": "Official header image for Strategic Mind: The Pacific game - Steam 991810",
    "Canonical URL": "https://gusku.site/game/strategic-mind-the-pacific",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strategic Mind: The Pacific\", \"description\": \"Looking for information on Strategic Mind: The Pacific? Check out the release date (Oct 25, 2019), developer insights from Starni Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Starni Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Starni Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/991810/header.jpg?t=1658132760\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}