{
    "AppID": 515980,
    "Name": "The Horus Heresy: Battle of Tallarn - Iron Edition",
    "Release date": "Feb 8, 2017",
    "About the game": "HexWar Games has partnered with Games Workshop® to bring you The Horus Heresy: Battle of Tallarn™. Get ready to fight the largest tank battle in Imperial history with more tanks and more destruction than ever! After the virus bombing by the traitorous Iron Warriors rendered the surface of Tallarn deadly to biological life, the besieged forces call upon legions of tanks - from the Leman Russ to the almighty Baneblade to bring war to their enemy. The battles begin after the devastating blow that turned the planet into an apocalyptic wasteland, amid the grim conditions the survivors faced in the aftermath. The Horus Heresy: Battle of Tallarn is a turn-based strategy game that recreates one of the most important events in Imperial history. Command a vast array of tanks, Dreadnoughts, Knights and Titans across the toxic landscape. Play as desperate Solar Auxilia units fighting squadrons of Iron Warrior Predators for control of vast underground bunkers. All campaigns can be played as both Loyalist and Traitor. 6 Mission Apocalypse Campaign In the wake of the death and destruction wrought upon Tallarn by the virus bombing, the Iron Warriors descended. As their patrols scoured the ruined planet's surface, they encountered unexpected resistance from the Imperial survivors. Protected from Tallarn's toxified atmosphere in their underground shelters, the loyalists launched a spirited campaign of hit-and-run attacks on the Iron Warriors. 6 Mission Resurrection Campaign As the Imperium learned of the Iron Warriors' treachery and the fate of the survivors of Tallarn, their relief troops and armour arrived in force, only to be matched by those of the enemy. The Iron Warriors ground their way to Sapphire City, beneath which lay a subterranean network of tunnels and shelters which had served as a bulwark in the Imperial defence line. 6 Mission Revenge Campaign Despite determined efforts, the Imperium were unable to shift the Iron Warriors from The Sightless Warren. Meanwhile fighting on the surface ground to a stalemate as heavy armoured units reinforced both sides. In a bid to sway the battle, The Iron Warriors' Macro-Transport “The Eagle's Talon” was brought into orbit around Tallarn, threateningly positioned to bring a new wave of troops to fight for the traitors. 66 different units accurately recreated 54 different weapons Three campaigns, each of six linked missions Four battle packs, each with six standalone missions An eight mission tutorial campaign Play all missions, other than the Tutorial, as either Imperial or Traitor forces Tailor your army with custom force selection Fight on the devastated surface of Tallarn or for control of the vast underground bunker system 8 unique unit types Aircraft Flyers Infantry Tanks Walkers Super Heavy Walkers Super Heavy Tanks Titans Future updates will add more missions and many more units",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/515980/header.jpg?t=1580974690",
    "Price": 0.0,
    "Developers": "HexWar Games",
    "Publishers": "HexWar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_df3cbb3a3d1dae03922a40ec89340a4d805f75c5.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_50e8e464af8076219a4ca99460c45c546b8caa0e.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_eb3db7f91b195a177428f3e73f759e4ee395b0c3.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_6a70c85afd7ca2d18857ae97f761d89b3fb4635e.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_6847d96ed156bcc4070ce54479d9b4162b17c559.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_6b5ce92a292df32814b250598c2507aa6dfc1ebc.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_f78fa66113fc32e797e73cec3fbd80b82c54ba11.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_f4a0609e4e9ec8217d891cdaf70360f69f751981.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_b841564fc1043bba288aeda6c222b34e3b71e4ce.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_256dbf33ddc8aa88b4ad9bbb6d626451626dc753.1920x1080.jpg?t=1580974690,https://cdn.akamai.steamstatic.com/steam/apps/515980/ss_bd99a7edb19d0994f7dee5c13b34c0ab2c3c8001.1920x1080.jpg?t=1580974690",
    "Slug": "the-horus-heresy-battle-of-tallarn-iron-edition",
    "Meta Title": "The Horus Heresy: Battle of Tallarn - Iron Edition: Feb 8...",
    "Meta Description": "Looking for information on The Horus Heresy: Battle of Tallarn - Iron Edition? Check out the release date (Feb 8, 2017), developer insights from HexWar ...",
    "Alt Text Image": "Official header image for The Horus Heresy: Battle of Tallarn - Iron Edition game - Steam 515980",
    "Canonical URL": "https://gusku.site/game/the-horus-heresy-battle-of-tallarn-iron-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Horus Heresy: Battle of Tallarn - Iron Edition\", \"description\": \"Looking for information on The Horus Heresy: Battle of Tallarn - Iron Edition? Check out the release date (Feb 8, 2017), developer insights from HexWar ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"HexWar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HexWar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/515980/header.jpg?t=1580974690\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}