{
    "AppID": 1977440,
    "Name": "Thieves' Paradise",
    "Release date": "May 21, 2022",
    "About the game": "ABOUT THE GAME: 'Thieves’ Paradise' is a stealth-action heist game with a narrative-driven aspect. Players choose one of three storylines to participate in, stealing target items throughout an over-the-top shopping complex called Shopper's Paradise, at the behest of their chosen character or characters. Performance and player choices during the heists will alter NPC dialogue, and dialogue options can equally affect the heists. WELCOME TO SHOPPER'S PARADISE! In 'Thieves' Paradise', players will take control of the Thief, a poorly disguised man who has but one goal: break into Shopper's Paradise and steal what he needs. Shopper's Paradise is an elaborate mall-like shopping center filled with many different stores and 3 distinctly themed areas, each with their own lovable mascot! - Come listen to the gnarly tunes of Kevin the Lobster over in the Miami Vice area! - Let your kids come check out Sunset Sam the Gila Monster's play-pen and train ride over in the toy store by the Wild West area! - While the kids are gone, come relax near Tanuki Jones' Zen Garden in the Tokyo streets area! Each shop is designed from the ground up and filled with original props to create a world worth exploring for the player. Many shops will contain gadgets and tools for the player to use during their heists, which can be used as distractions or ways to trip pursuers. A STORY-DRIVEN NARRATIVE FILLED WITH MEMORABLE CHARACTERS! The narrative in 'Thieves' Paradise' is presented in a visual novel style. where the player will speak to one of three characters depending on the story they are presently on. The player's choices in the story matter, as it gives them a voice and can lead to different story paths depending on how the player chooses their dialogue. The player will explore three different stories, each filled with 3 different heists, as they learn more about the characters they interact with and just what kind of thief they really are. Each story focuses on a single main character besides the Thief, each with their own motives for requesting the Thief's talents. The narrative doesn't just stop after the cutscene ends! In addition to the visual novel segments 'Thieves' Paradise', the gameplay sections contain Radio Messages, which feature a character speaking directly to the Thief during their heists. The dialogue can range from help/advice as it serves as a tutorial for newer players, or it can just funny dialogue to endear some characters to the player and give the feeling that you have someone watching over your heists. YOUR HEISTS, YOUR RULES! The Thief will enter the Shopper's Paradise with a single goal: steal what they need. And it is up to the player to decide just how to go about accomplishing this. The player can choose to stealthily move through the level without getting caught by any of the guards or security cams, or they can go sprint through the level tripping up every guard they come across as they grab what they need and run out before they can get caught. Through reading the visual novel sections, the player will have an understanding of the main item they need to steal, as well as some side objectives that may appear. What the player decides to steal on some levels may actually affect the story based on their efforts! Each story contains multiple different endings the player can achieve through their choices both in narrative and in heists. CREDITS: Producer: Kevin Davis Creative Director: Temprian Zaliasukas Design: William Beatty, Emily Woods, Alec Nicholson, Matthew DeMeo Art: Charles Price, Kyle Remy, Steven Chikuji, Jacob Young Code: Patrick Wilshere, Shaquille Griffin, Nicholas Martin, Joseph Demeritt An original soundtrack by: Gin Zaliasukas &amp; Logan Labanna",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1977440/header.jpg?t=1653169500",
    "Price": 0.0,
    "Developers": "Felony Fellas",
    "Publishers": "Felony Fellas",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_bc70112fad122ade9b971990c165a8f7c2bc9b46.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_fd39dd3b27141218fbc386718d75d4e4130b0eb1.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_c7ee7ea2632fb271ed3c579b841f2b0b19565ec9.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_dba32694e3b2d51f53751fe66a0b463425a026d7.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_3c7119ab2332c9b1ad38cdff59d28053d29c17f0.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_a4097cd2e6d3a427bfa3a84dba6bfcf4df641937.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_138abb807acd212162ddf89a8062b175014aeb57.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_e0705354c71988ac903a03d2f1e45b21e081864d.1920x1080.jpg?t=1653169500,https://cdn.akamai.steamstatic.com/steam/apps/1977440/ss_8558edf116b48f9796af84bf37ec86f3ca6547ce.1920x1080.jpg?t=1653169500",
    "Slug": "thieves-paradise",
    "Meta Title": "Thieves' Paradise: May 21, 2022, Felony Fellas and Full O...",
    "Meta Description": "Looking for information on Thieves' Paradise? Check out the release date (May 21, 2022), developer insights from Felony Fellas, and a complete game summ...",
    "Alt Text Image": "Official header image for Thieves' Paradise game - Steam 1977440",
    "Canonical URL": "https://gusku.site/game/thieves-paradise",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Thieves' Paradise\", \"description\": \"Looking for information on Thieves' Paradise? Check out the release date (May 21, 2022), developer insights from Felony Fellas, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Felony Fellas\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Felony Fellas\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1977440/header.jpg?t=1653169500\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}