{
    "AppID": 973760,
    "Name": "Thronebreaker: The Witcher Tales",
    "Release date": "Nov 9, 2018",
    "About the game": "The Witcher World is Back! 'A spectacularly crafted RPG' - 5/5 - GamesRadar+ 'One of the best-written RPGs in years' - 9.4/10 - IGN 'Superb ' - 9/10 - GameSpot Thronebreaker is a single player role-playing game set in the world of The Witcher that combines narrative-driven exploration with unique puzzles and card battle mechanics. Crafted by the developers responsible for some of the most iconic moments in The Witcher 3: Wild Hunt, the game spins a truly regal tale of Meve, a war-veteran and queen of two Northern Realms — Lyria and Rivia. Facing an imminent Nilfgaardian invasion, Meve is forced to once again enter the warpath and set out on a dark journey of destruction and revenge. KEY FEATURES AN ALL NEW EPIC TALE Experience an all-new 30-hour Witcher world tale with 20 possible world end-states. Embark on a grand adventure full of thought-provoking quests. Influence the state of the world around you by making difficult choices and face their consequences. Meet a cast of rich, multidimensional characters — some of them will join you on your quest, others you’ll have to face on the battlefield. TRAVEL TO NEVER-BEFORE-SEEN KINGDOMS Explore new and mysterious regions of the monster-infested world of The Witcher. Traverse vast lands and unique locations, all with their distinct theme — from vibrant countrysides and war-torn landscapes, to grand castles and snow-capped mountains. Save villages from hordes of monsters, look for treasures hidden among ancient ruins, scour the land for resources, and more — the world of Thronebreaker is teeming with things to do. PREPARE FOR WAR Develop and customize your very own battle camp. Train and recruit units, unlock new skills and work on your tactics. Manage resources you find and trade them with local merchants. Learn more about your companions and increase their strength in battle. LEAD YOUR ARMY IN EPIC BATTLES Build an army from characters you meet and interact with during your journey. Fight in epic story battles and solve unique puzzles and challenges. Use unique skills and abilities of your army and lead it to victory. Thronebreaker: The Witcher Tales comes with these bonus items: Official Thronebreaker Soundtrack Digital version of GWENT: Art of The Witcher Card Game artbook from Dark Horse Concept art, including the map of Lyria The Witcher graphic novel 'Fox Children' by Dark Horse Steam copy of The Witcher: Enhanced Edition Director’s Cut",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/973760/header.jpg?t=1651150810",
    "Price": 19.99,
    "Developers": "CD PROJEKT RED",
    "Publishers": "CD PROJEKT RED",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/973760/ss_55a85f7cae6d47b0ec1919199a9e414388061b84.1920x1080.jpg?t=1651150810,https://cdn.akamai.steamstatic.com/steam/apps/973760/ss_a1990d51e2d251bb91d83d27df96e04f635528d4.1920x1080.jpg?t=1651150810,https://cdn.akamai.steamstatic.com/steam/apps/973760/ss_4680bc9ec2acc851140a073c06749aa7e3d64329.1920x1080.jpg?t=1651150810,https://cdn.akamai.steamstatic.com/steam/apps/973760/ss_564696b758aeca2fd0f30d986a87e84ccfd33354.1920x1080.jpg?t=1651150810,https://cdn.akamai.steamstatic.com/steam/apps/973760/ss_07dbc1a983d6508278b1f43a8a07a8833a9202a3.1920x1080.jpg?t=1651150810",
    "Slug": "thronebreaker-the-witcher-tales",
    "Meta Title": "Thronebreaker: The Witcher Tales: Nov 9, 2018, CD PROJEKT...",
    "Meta Description": "Looking for information on Thronebreaker: The Witcher Tales? Check out the release date (Nov 9, 2018), developer insights from CD PROJEKT RED, and a com...",
    "Alt Text Image": "Official header image for Thronebreaker: The Witcher Tales game - Steam 973760",
    "Canonical URL": "https://gusku.site/game/thronebreaker-the-witcher-tales",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Thronebreaker: The Witcher Tales\", \"description\": \"Looking for information on Thronebreaker: The Witcher Tales? Check out the release date (Nov 9, 2018), developer insights from CD PROJEKT RED, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CD PROJEKT RED\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CD PROJEKT RED\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/973760/header.jpg?t=1651150810\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}