{
    "AppID": 1701640,
    "Name": "Trashyard",
    "Release date": "Aug 8, 2021",
    "About the game": "Trashyard is a multiplayer multiplayer third person shooter. Online game Trashyard is a popular game where all kinds of fierce PvP battles are constantly being conducted on 8 different maps. Each player fights for himself. It is enough to choose a suitable hero who will have certain original abilities. It does not do without superpower, the character has unique abilities. As for the graphics, here it is at a fairly high level. Without fail, it is recommended to implement such an equally important action as replenishing your own super-abilities. For any given character, in reality, they are unique. Online game 'Trashyard': features, graphics and advantages of the game! A multiplayer shooter with unique abilities of heroes and superpowers, you can choose any of the following characters: Bot. Performs incredible super jumps. Cowardly Joe. There is a deceleration ability. Clara. She has effective explosive cartridges in battle. Anime Girl. It can freeze. Knight. He is characterized by the presence of the most real super-armor. Fembot. The character has super speed. The game also provides a real opportunity to choose the rest of the equally interesting characters. It is enough to choose a suitable option, and you can safely start PvP combat. Here, each player fights, as they say, for himself. You just need to pick a character with the most suitable original abilities. The game 'Trashyard' is made in several genres. In addition to the above-mentioned option, it should also include such as action, as well as arcade. It was created by a world famous developer, and is recommended for use on the PC platform. The main style is the real fantasy. Why do many users choose this particular game? Initially, it is worth noting here the fact that the game is really hugely popular. All this applies not only to children and adolescents, but also to ordinary adult players. The main advantage lies in the presence of the possibility of independent choice of who a person wants to become. For example, a player can become a knight or a Russian bot, or an ordinary policeman. Everything directly depends on his personal wishes, as well as on what kind of original abilities he wants to have. Mandatory during the game, it is recommended to collect the loot itself. Here we are talking about armor, first aid kits, and, of course, about the usual extra lives. In any situation, it is necessary to understand that only the player who is left on the map with only one single player can win here. Accordingly, the character who runs out of lives will lose. Would you like to have a great time of your own? Then you should definitely explore such an online game as 'Trashyard'!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1701640/header.jpg?t=1654492710",
    "Price": 10.99,
    "Developers": "Soer Game",
    "Publishers": "galesoozka",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_d144adb34eef57dc22a06df850e655fa94aa40bc.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_fcfda60086905ada60052a29f34501dddbc2c7b7.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_f006e02a9d8f2a03dcc50625f72bd07698b0bb07.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_6b5d9d766bc9c69346e59bd66a8c93d292a1efa7.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_55da10d819bcf1f8499b22b6e0604279d18f455f.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_5f12b93d8098643cefc17a64e74e07224a0bbbd3.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_93dc99aa90fe4719af0189312aff01162bbeda63.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_e1bb220907b2bd04662e80f2691e2b9616af247c.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_b6ab612bcb10a1ab59c76f6bfe005dae46086098.1920x1080.jpg?t=1654492710,https://cdn.akamai.steamstatic.com/steam/apps/1701640/ss_fbfcaab186d1ddd2f6f38f79fc7bd0c59e6a7028.1920x1080.jpg?t=1654492710",
    "Slug": "trashyard",
    "Meta Title": "Trashyard: Aug 8, 2021, Soer Game and Full Overview",
    "Meta Description": "Looking for information on Trashyard? Check out the release date (Aug 8, 2021), developer insights from Soer Game, and a complete game summary.",
    "Alt Text Image": "Official header image for Trashyard game - Steam 1701640",
    "Canonical URL": "https://gusku.site/game/trashyard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trashyard\", \"description\": \"Looking for information on Trashyard? Check out the release date (Aug 8, 2021), developer insights from Soer Game, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Soer Game\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"galesoozka\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1701640/header.jpg?t=1654492710\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}