{
    "AppID": 499620,
    "Name": "Ultimate Booster Experience",
    "Release date": "Jul 14, 2016",
    "About the game": "Take a ride on a huge 200m (600ft) swing with breathtaking views of a high-detailed city or try other height challenges. Big open city and various extreme adventures will take you on new fantastic height. Giant Swing — That's gonna be a crazy ride with lots of twists, speedups and unexpected ending. Ride till the end or eject yourself at any time! If you are going to try it on your feet (we know you will) — it's better to have someone around you for more safety. Bungee Jump — First VR Rope jump. As simple as that. Rocket Mode — Grab your own Shuttle-Rocket and spend your time in our Open City location! Air Balloon — Have a chill ride over modern megapolis. If it looks boring for you — just pull that lever and see what will happen! Canyon Ride — Another swing ride location with stunning canyon atmosphere and a new ending. Eagle Flight — Mighty bold eagle will take you to a journey through the vast canyon. Atmosphere — Just standing on the balcony you can spend your time listening to city sounds, watching birds flying around and big city living it's life or feel magnificent canyon atmosphere. Soundtrack — Awesome soundtrack is provided by Totemlost. Feel their energy while having fun. Party Starter — Show this game to your friends and family to spend fun time together. It's ultimate party starter and reactions you'll see are priceless! New launch screen will allow you to control the ride from your PC. Free updates — We are going to add minor and large features so you can try this experience again and again for more fun! See Updates section below for more info! «The city looks good, cars look good… Everything looks so good! Really high-quality job and no lag at all» — VRViking «Wow, check out the city! I love it! That feels greate! Awesome!» — GameHard 4.0 «This is probably one of the craziest rides released on the Oculus Rift. Virtual reality roller coasters are nothing compared to this!» — Omar Sebali This game supports Vive controllers (showed in game), but you also can use your keyboard, X-Box 360 controller or Oculus remote. Calibration: R\\Enter or B button Start game: Space or A button Back to roof (full restart): M or Start Exit: Esc or Back Big Vive version update in January: New height challenges: rocket and bungee mode. Remastered graphics and updated sound and lights system. Now you can eject yourself from the seat and go to free fall (just press Trigger or Space again). Added menu and fast launch buttons to mirror screen — now you can easily control the game while your friends are playing. Air Balloon Experience with a surprise. Roadmap for next Updates: Add some city sports challenges, like street basketball to spend your time. New extreme rides. Make a better city scene with realistic cars. Make new screens for Steam Store page. Oh, I cry every time I visit it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/499620/header.jpg?t=1628880667",
    "Price": 4.99,
    "Developers": "GexagonVR",
    "Publishers": "GexagonVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_475a6b28c95c43020fcf771c0ef51a30a067a392.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_fca7b8e240ce6df9fd39e3f0ca93ce98bb45a451.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_d4f2aa8308cccb30bc976b65790d7dbf821ed92b.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_2801be351ef425260eba04686188cfa16d5e5f21.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_62abc056cff58279a8a59970853a6902ff45533e.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_df14235525885cb27775c54cd8595811bdbfc49d.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_c72f513190894c688e7c681a2c2cfecc4164a691.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_a3db031a371098c4d77fc74f0a90567fa7c66656.1920x1080.jpg?t=1628880667,https://cdn.akamai.steamstatic.com/steam/apps/499620/ss_977650791caefdc38465f99794a48ee9726c47db.1920x1080.jpg?t=1628880667",
    "Slug": "ultimate-booster-experience",
    "Meta Title": "Ultimate Booster Experience: Jul 14, 2016, GexagonVR and ...",
    "Meta Description": "Looking for information on Ultimate Booster Experience? Check out the release date (Jul 14, 2016), developer insights from GexagonVR, and a complete gam...",
    "Alt Text Image": "Official header image for Ultimate Booster Experience game - Steam 499620",
    "Canonical URL": "https://gusku.site/game/ultimate-booster-experience",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ultimate Booster Experience\", \"description\": \"Looking for information on Ultimate Booster Experience? Check out the release date (Jul 14, 2016), developer insights from GexagonVR, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"GexagonVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GexagonVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/499620/header.jpg?t=1628880667\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}