{
    "AppID": 1661930,
    "Name": "Y: The Game",
    "Release date": "Dec 27, 2021",
    "About the game": "This is a passion project I have been working on in multiple platforms and languages for years. Aside from using a library called Raylib, I wrote everything from scratch in C++ for fun. Even features like the GUI and file browser are made from scratch. I have had enough fun with the project in it's current version that I decided to release it to Steam. If you enjoy the game, let me know! You are a Y running and jumping through levels trying to capture F's while avoiding E's and spikes. There is a timer in the top right for speed running as well as a demo system to record and share playthroughs. Share your runs on the official Discord Server! There are multiple level packs for Y: The Game that vary in length and difficulty, with each of them being a category for speedrunning on their own. The Classic level pack includes all of the levels from the early alpha proof of concept builds, which were made really early on in the game’s development and are very simple, only including platforms, enemies, and objectives. While old and simplistic, it has a competitive speedrunning audience so far and has had a lot of people playing over and over again to get their fastest runs. The Normal level pack includes everything Y: The Game has to offer on release. Featuring easier yet more complex levels than classic mode, it is very fun to play and has a lot of room for speedrunning. The Torture level pack has one purpose: short yet incredibly difficult levels. The beta testers took multiple hours to beat one level in torture mode after mastering the rest of the game, and it was a true event for the entire team when they beat it. Torture mode is for people who feel they have mastered the physics of Y: The Game and truly want a barely possible challenged. There is also a fully featured level editor I have spent way too much time making, so you and all of your friends can make and share levels to your heart’s content. Every tool I used to make the levels in game are available in the level editor, and as people suggest more features, they will be added in. If you want a specific type of enemy, item, platform, or any other feature, make sure you suggest it in the official discord server!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1661930/header.jpg?t=1641009716",
    "Price": 0.0,
    "Developers": "Christopher",
    "Publishers": "Chris's Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1661930/ss_4535598ed525a0d8934262bf70b097e8a091a479.1920x1080.jpg?t=1641009716,https://cdn.akamai.steamstatic.com/steam/apps/1661930/ss_9067d7fed5d3db39874e8d81afb31c905bacdd5a.1920x1080.jpg?t=1641009716,https://cdn.akamai.steamstatic.com/steam/apps/1661930/ss_e2bd95cbeaaffbb34e6f308dbaec7f0d1473db06.1920x1080.jpg?t=1641009716,https://cdn.akamai.steamstatic.com/steam/apps/1661930/ss_cf09c36b00daac5f43659bff606ef4afe6ee6118.1920x1080.jpg?t=1641009716,https://cdn.akamai.steamstatic.com/steam/apps/1661930/ss_2f59e726bd89155589a2f99c902cc5d9cffddbb1.1920x1080.jpg?t=1641009716",
    "Slug": "y-the-game",
    "Meta Title": "Y: The Game: Dec 27, 2021, Christopher and Full Overview",
    "Meta Description": "Looking for information on Y: The Game? Check out the release date (Dec 27, 2021), developer insights from Christopher, and a complete game summary.",
    "Alt Text Image": "Official header image for Y: The Game game - Steam 1661930",
    "Canonical URL": "https://gusku.site/game/y-the-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Y: The Game\", \"description\": \"Looking for information on Y: The Game? Check out the release date (Dec 27, 2021), developer insights from Christopher, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Christopher\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chris's Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1661930/header.jpg?t=1641009716\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}