{
    "AppID": 383020,
    "Name": "a Family of Grave Diggers",
    "Release date": "Jan 8, 2016",
    "About the game": "A Family of Grave diggers is a modernized, fully graphic, moddable and innovative Rogue-like for Windows. Mindoki rejuvenates the rogue-like genre with easy to use gameplay, permanent upgrades and Schrödinger map generation in this fully moddable, action paced, semi turn based game, a Family of Grave Diggers! Never get frustrated again in this revival of the classic rogue like genre, come have fun in a never ending story of fighting, upgrading and discovering! Fight your way down dungeons, battle the ancient malevolent doom, free the village of the wizard, secure the alchemist in the forbidden forest, survive the dangers that gets thicker and thicker as further you go... Unlock shopkeepers, new dungeons and even add your own content to this fully moddable modern Rogue-like! Come be part of the family, the family of Grave Diggers! • Key Features • 3D graphics with a modern, easy to use, user interface • Semi turnbased gameplay for quick acting and long tactical pauses at will • Schrödinger map generation, which is the brainchild of Mindoki Games, for more fun! No more one entry and one exit in small map-rooms leading one to another, no, this map grows in an organic fashion, creating a multitude of branches as you are exploring! • Permanent dungeons and quests like the Wizards tower or a tower defence quest. • Lots of fun for countless hours! • Upgrade your village shops with new items to beat the hardest dungeons! • Highly moddable, just dive in and design your own items and adventures (and much much more!) About the developer Hi, I'm Ludvig Larsson, a Swede in France and creator of Mindoki games. I have always been attracted to the video game universe and quickly I understood that gaming wasn't the only thing I liked so I started my career as a game developer and game designer in Paris. After ten years programming and designing video games (Quest for alliance, Ghost force, Speed Addict underground, Bubble Soccer, plus another 15-20) I decided to go indie so I worked in the classic industry daytime and in the rest of the time on my games: Mindoki (which is now my company name but was a fully working 3D MMORPG), Metamorphes.com (a turnbased web-MMO), a lot of prototypes..., and finally, a Family of Grave Diggers. As the game came along nicely, I decided to go full time indie (since April 2015) and it works really well! • Release dates Barring disasters, the full release is planned for Q1 2016 • Contact information Ludvig Larsson aka Valmond Main web page: / Mail: team@mindoki.com Blog: / Twitter: Steam:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/383020/header.jpg?t=1452290668",
    "Price": 9.99,
    "Developers": "Ludvig Larsson",
    "Publishers": "Mindoki Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/383020/ss_ed463b38245e338e1ffad2ed123aa38b4fc9a09a.1920x1080.jpg?t=1452290668,https://cdn.akamai.steamstatic.com/steam/apps/383020/ss_713dea567e37744abe08324c67f387a8bd7590d8.1920x1080.jpg?t=1452290668,https://cdn.akamai.steamstatic.com/steam/apps/383020/ss_73b339262e3b4a8dcd4e04885a79c4b3e953a002.1920x1080.jpg?t=1452290668,https://cdn.akamai.steamstatic.com/steam/apps/383020/ss_6877e030d4f27e3efacb65c6de21064568d920d2.1920x1080.jpg?t=1452290668,https://cdn.akamai.steamstatic.com/steam/apps/383020/ss_ee2d8744f0d7c77559d150234dd838d2153e7645.1920x1080.jpg?t=1452290668,https://cdn.akamai.steamstatic.com/steam/apps/383020/ss_f6edf5936bc89ab2407ba67bf4dc944edcc06a6f.1920x1080.jpg?t=1452290668",
    "Slug": "a-family-of-grave-diggers",
    "Meta Title": "a Family of Grave Diggers: Jan 8, 2016, Ludvig Larsson an...",
    "Meta Description": "Looking for information on a Family of Grave Diggers? Check out the release date (Jan 8, 2016), developer insights from Ludvig Larsson, and a complete g...",
    "Alt Text Image": "Official header image for a Family of Grave Diggers game - Steam 383020",
    "Canonical URL": "https://gusku.site/game/a-family-of-grave-diggers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"a Family of Grave Diggers\", \"description\": \"Looking for information on a Family of Grave Diggers? Check out the release date (Jan 8, 2016), developer insights from Ludvig Larsson, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 8, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ludvig Larsson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mindoki Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/383020/header.jpg?t=1452290668\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}