{
    "AppID": 279480,
    "Name": "Abalone",
    "Release date": "Apr 23, 2014",
    "About the game": "Discover our new version with brand new graphics inspired by the latest edition of the famous strategy game. Abalone has been one of the best games around for nearly 30 years, known for its hexagonal board and black and white marbles. The goal of this abstract board game is simple: push your opponent’s marbles off the board! But beware, it’s not easy to master, so keep your wits about you and rise to the challenge! HAVE A PLAN OF ATTACK... Create a plan of attack to push your opponent’s marbles off the board. On every turn, you can move one space in any direction with 1, 2, or 3 lined-up marbles. When you’re in a Sumito position (that is, when your marbles both outnumber and are in contact with your opponent’s) you can push their marbles out! For example, you need three black marbles to push one or two white marbles. There’s no use in rushing; it’s better to take your time and think of every possibility since one hasty move can put you in a bad position and let victory slip through your fingers. ...AND HAVE A STRONG DEFENSE. If you want to win, the key is not to attack, but rather to take specific positions with certain combinations of moves. Just like in chess and checkers, you can try to create traps by sacrificing marbles or strategic positions to block your opponent. The most dangerous contact points are at the edges of the board, where a bad move means losing a marble or the whole game! Sometimes, it’s better to be patient if you want to win! DON’T CONFUSE FORESIGHT AND HASTE The keys to victory are looking ahead and analyzing your opponent’s play. Although the game is easy to learn, it requires strategy and thought. To hone your strategic thinking, the game offers several modes that let you review your games play by play. For example, Challenge Mode helps you become a true Abalone master, one move at a time. The challenges get harder as you advance. For example, at first you must push out a single marble only to win a challenge, then two, and the master will get progressively tougher. PLAY ALONE OR WITH FRIENDS Play alone against the computer with Challenge Mode and Free Play Mode, or play against your friends. With Pass &amp; Play Mode, you can duel on the same device! Tired of playing your friends? Face the best players in the world with Online Mode by logging in to your Asmodee account! Features: Solo: - 3 levels of difficulty against the AI (Easy, Medium, Hard) - A solo campaign with unique challenges - A game mode that lets you create your own game, your own rules, and place the first marbles Multiplayer: - Pass &amp; Play Mode - Online Mode Available in English, French, German, Spanish, Italian, Portuguese, and Dutch.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/279480/header.jpg?t=1592227803",
    "Price": 6.99,
    "Developers": NaN,
    "Publishers": "Games-Up",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/279480/ss_b0fa610f3abd027406c06930b50d8c9250c31997.1920x1080.jpg?t=1592227803,https://cdn.akamai.steamstatic.com/steam/apps/279480/ss_1ad4fcdfcd64e0a4fe6576e6758592c534547585.1920x1080.jpg?t=1592227803,https://cdn.akamai.steamstatic.com/steam/apps/279480/ss_3fdeb6ddf6a6474ab7d566d5c59bbd1a3595915c.1920x1080.jpg?t=1592227803,https://cdn.akamai.steamstatic.com/steam/apps/279480/ss_995aa9b5fea418bf76069e1822b37947c9a14191.1920x1080.jpg?t=1592227803,https://cdn.akamai.steamstatic.com/steam/apps/279480/ss_b9a6a7622352b89dd085c5448f0cc219eb99e519.1920x1080.jpg?t=1592227803",
    "Slug": "abalone",
    "Meta Title": "Abalone: Apr 23, 2014, nan and Full Overview",
    "Meta Description": "Looking for information on Abalone? Check out the release date (Apr 23, 2014), developer insights from nan, and a complete game summary.",
    "Alt Text Image": "Official header image for Abalone game - Steam 279480",
    "Canonical URL": "https://gusku.site/game/abalone",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Abalone\", \"description\": \"Looking for information on Abalone? Check out the release date (Apr 23, 2014), developer insights from nan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": NaN}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Games-Up\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/279480/header.jpg?t=1592227803\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}