{
    "AppID": 1236180,
    "Name": "Balkadia",
    "Release date": "Apr 28, 2022",
    "About the game": "Balkadia features classic platforming, dismemberment combat and giant bosses with multiple forms. This is not a metroidvania, it is a 'classicvania' inspired by Super Castlevania IV. In Balkadia your only weapon is the whip. It cuts through enemies like butter, uses them as throwable objects, can act as a shield and can shoot projectiles. Balkadia doesn’t have bottomless pits or one-hit death spikes, but will still test your platforming skills. Fluid jump controls, crouch movement and sprinting mechanics will help you overcome the challenge. In Balkadia you will stumble across many Slavic symbols and face off against famous monsters from Slavic mythology, including Leshy and Baba Yaga. An evil cult has kidnapped your son and intends to use him as a sacrifice to summon the most powerful Slavic creature in the world. You can speedrun the game in about 90 minutes, but it’s highly unlikely on your first play. There are 15 stages, each different in theme and design, and upgrades can be unlocked to help you with the finale. They can also be used to blast through previous stages for a bit fun, so there is replay value as well. Balkadia can work with any controller recognized by your operating system, but the keyboard is required during the initial configuration, hence why it states 'partial support' on the page. The menu contains a traditional configuration screen where individual inputs can be changed. Direct input is also supported. Every graphical asset in Balkadia is made with 4K in mind and is then scaled down for lower resolutions. The game also supports aspect ratios up to 32:9, so your ultrawide monitor will always be filled up. If you’re a retro gamer with a 5:4 monitor or an old-school 4:3 tube TV, you’ll be pleased to know that Balkadia is not locked to widescreen. At a really low retro resolution like 640x480, Balkadia will play mostly fine even on a single core CPU with 2GB of ram, but a dual-core is recommended to achieve stable 60fps ( Intel Core 2 Duo/AMD Athlon 64 X2 ). No, Balkadia has V-Sync permanently enabled and runs at the refresh rate of your operating system. If you have a 144hz display, but the game is playing at 60fps, you will need to exit Balkadia, change to 144hz in your OS settings and relaunch the game. Balkadia’s demo includes the first 3 stages. It’s best to just play it and see if you’re having fun. However, as the sole developer of the game, I can share some details so you can make an informed decision. Balkadia is an ambitious passion project, but not perfect. The gameplay is mainly inspired by “Super Castlevania IV”, the only Castlevania with 8-directional whipping. My goal was to bring this mechanic back and expand upon it. I am confident to say that this goal has been achieved. If you are a fan of SCV4, then Balkadia is for you. However, during testing, it has become clear that players unfamiliar with SCV4 have a hard time with the 8 directional whip - an essential part of 'supervania'. Balkadia is not as difficult as retro games of old, but still presents a challenge. If you take advantage of its controls, Balkadia becomes easier than SCV4. If you are uncertain, definitely try out the demo first, and bear in mind that if you don’t use the 8-directional whip, you won't fare well. In fact, this can make Balkadia feel more difficult than one of the hardest Vania games – CV3. Hopefully this helps you make an informed decision.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1236180/header.jpg?t=1651509418",
    "Price": 11.99,
    "Developers": "Tsar Republic Games",
    "Publishers": "Tsar Republic Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_dd33c463c8c64275cf8374913540f27d8c0801b7.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_f099e2c59d6258b8ffd661903aa2a1631e0682c2.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_3a5666042eac46b6f62b7942af9a87a69bc1d3de.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_c449f6c6bcd0aaf0ce9eb97f856031ffd7f175ed.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_0be06ed33bbb47f934aef36716415e8efdf504c8.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_0fd4d62c22de7071831156b7b1506fc9c9cd9332.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_90b2cd8f9dd17a6098bd3cd4edeccbfe60122c27.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_71f1a530d75399d385ae55efa5278c3fb5634f6d.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_08b15557d8c9b05fccac5f4def6ff7460e90a360.1920x1080.jpg?t=1651509418,https://cdn.akamai.steamstatic.com/steam/apps/1236180/ss_c55bc2a5a1231279b45d1de8c65f9a9d8344c008.1920x1080.jpg?t=1651509418",
    "Slug": "balkadia",
    "Meta Title": "Balkadia: Apr 28, 2022, Tsar Republic Games and Full Over...",
    "Meta Description": "Looking for information on Balkadia? Check out the release date (Apr 28, 2022), developer insights from Tsar Republic Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Balkadia game - Steam 1236180",
    "Canonical URL": "https://gusku.site/game/balkadia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Balkadia\", \"description\": \"Looking for information on Balkadia? Check out the release date (Apr 28, 2022), developer insights from Tsar Republic Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tsar Republic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tsar Republic Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1236180/header.jpg?t=1651509418\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}