{
    "AppID": 365560,
    "Name": "Battle of the Bulge",
    "Release date": "Sep 17, 2015",
    "About the game": "Set during what the historian Antony Beevor called 'Hitler's Last Gamble', Battle of the Bulge provides an immersive experience on a tactical/operational level, putting the player in command of the Allies or the German forces fighting each other in several scenarios in one of the most brutal and wild environments of Western Europe: the snow-covered forest of the Ardennes! Command infantry, mechanized and armoured units in hard fights through the various phases of the offensive, taking into account the nature of the terrain and its effects on the assailants and defenders. You don't only have to face a direct military confrontation, you have to learn how to manage your supply routes, being careful not to rely on easy solutions! A quick breakthrough into enemy lines could lead your units being isolated with a high risk of being outflanked by enemy counterattacks! Time will be another factor not to underestimate. In Battle of the Bulge, scenarios have a time limit with several 'semi-historical' events affecting your conduct of operations in different ways. Take control of iconic elite units on both sides, such as the 101 Airborne Division or the Kampf Gruppe Peiper, and replace the losses on the hottest spots of the frontline! Challenge Bradley, Dietrich, von Rundstedt and other historical commanders with an ad hoc re-written AI -each with different play styles to choose! Alternatively try to outsmart your friends - whatever their favourite gaming platform - in simple multiplayer encounters or test your skills with the new Tournament feature, providing infinite replay value to the game! New Features from the 2015 version New multiplayer system (Slitherine's PBEM) supporting: cross-platform (PC/IOS/Mac), paired matches, private matches and tournaments Re-written AI for both sides (Allies and Axis). Added a Language selector and a Master volume buttons in settings 4k resolution support A PC-like save feature, with slots and auto-save per turn Extensive historical photos and commentary. Features Play against AI opponents with unique personalities Fast turns, deep strategy Play scenarios like the quick, tense, fight in the opening days to a campaign covering the entire battle as either the Axis or the Allies Learn with the tutorial and quick start guide, or visit our online strategy forums to learn from other players Full rules, charts, tables and other information included for advanced players Extensive historical photos and commentary Localized for Spanish and Japanese First in a series of WWII titles by legendary designers including: John Butterfield, Ted Raicer, and Mark Herman",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/365560/header.jpg?t=1564045227",
    "Price": 9.99,
    "Developers": "Shenandoah Studio",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_f72ccb053a5010bf5c495721ba2255242ace6f64.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_51a35448b1e885130a61a2f0d6f76f529a32ee98.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_3ff5f0118a6bceaeee1f9e30e27330bc878fc2be.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_7960be6a3bd779ba3ecd247c4f3b3a839ca022ad.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_973e095f7cb3afc29ad8f6816082d42cea521196.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_8baf688d8dc5c9814288cc8fce1e035d7c617ac5.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_ae43d3db31e33585a7488c45df8909ff25bec07e.1920x1080.jpg?t=1564045227,https://cdn.akamai.steamstatic.com/steam/apps/365560/ss_75a66b506dac1e1ed0974d78743760cc59b39279.1920x1080.jpg?t=1564045227",
    "Slug": "battle-of-the-bulge",
    "Meta Title": "Battle of the Bulge: Sep 17, 2015, Shenandoah Studio and ...",
    "Meta Description": "Looking for information on Battle of the Bulge? Check out the release date (Sep 17, 2015), developer insights from Shenandoah Studio, and a complete gam...",
    "Alt Text Image": "Official header image for Battle of the Bulge game - Steam 365560",
    "Canonical URL": "https://gusku.site/game/battle-of-the-bulge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battle of the Bulge\", \"description\": \"Looking for information on Battle of the Bulge? Check out the release date (Sep 17, 2015), developer insights from Shenandoah Studio, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shenandoah Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/365560/header.jpg?t=1564045227\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}