{
    "AppID": 380920,
    "Name": "Boss 101",
    "Release date": "Nov 2, 2017",
    "About the game": "Boss 101 starts with your brother's request for an action packed birthday. Unfortunately he's in the hospital so it's up to you to bring him an unforgettable home movie. From there you're off across the globe and galaxy looking to save the day and bring back awesome movie footage to your brother. As you travel you will be returning to your command center for rest, weapon upgrades, and research. Heck, you can even play arcade games and fly a kite if you like! During your journey you will battle bosses you created with the Make-A-Boss generator. You engage in combat, chase and missions to recue baby robo-AI's from the clutches of the biggest baddie of all, the dreaded Boss 101. Game rounds reward the player with cash for upgrades, guns and hats, all of which help you fight tougher bosses. That's not all because Max and STEVE aren't above commenting or outright sarcasm on their opponent's abilities. You will fight robot of all sorts - animals, samurai, aliens and DINOSAURS! You heard right! Major Features: Intergalactic Adventure across multiple worlds - In the main story mode you travel across the globe and into space as you battle your way to the final encounter with Boss 101. Make Own Bosses, design YOUR battle - You, the player, get to roll your own boss to fight. Tougher bosses pay more bounty! Cash and Upgrades - Beating levels and bosses earns you cash for one of five major upgrades in the game. Including the amazing Super Missile! Guns, buffs and more - back in your Command Center you purchase from an array of weapons, buy equipment to augment your character for battle and even dress yourself up. Customize your player with Hats - the player can outfit their character with nearly 300 hats, each of which grants one or more special powers like earning extra money per shot, doing more damage, health boost, damage reduction and resistance. Yes, some hats just make you look cool. Pet Friends - Enjoy the company of your pet friends. These are your buddies who come to stay with you. As you play you can even get more exotic pets from all over the known universe. Multiple weapons during the rounds - rocket launchers, laser rifles, lightning guns and the dreaded fist cannon are a few of the weapons you will use. Choose your challenge - we offer three modes of Difficulty - Easy, Normal and Ultra - pick Ultra for the maximum test of your skills Story and Dialog - each level features dialog between Max, STEVE and the boss of the level. Additionally, there are in game reactions to the combat as it evolves. If someone is throwing a train car – STEVE and Max are probably going to say something. Subsequent returns to your command center also feature dialog and story to help you understand what’s been happening. Custom Soundtrack - each level and game screen has music to help drive home the awesome adventure the player is on. Arcade Games - you got your own machine to play games in the Command Center - so play 'em. Maybe you will get something for your efforts. Kite Flying - everyone needs a break - take one and chill on a hill with Max and STEVE. Gameplay Modes: Story - Base game with progression through 31 levels/rounds Save the Robos - We also have missions where you will be taking Baby Robo’s safely into space. Warp Chase - Follow the boss as he warps from level to level. While flying through innerspace you will have to knock him out of the warp tunnel before you can resume the fight. Endless Boss Mode - this is you with one life seeing how far you can get against an endless array of bosses. Keep going against random bosses until you die. Quest and Recover subgames - these are modes that will reward players for things like (but not limited to) completing rounds using certain weapons, rescuing allies, beating a round in under a certain time, knocking out specific enemies, protecting friends and more! Classic Mode - the classic Boss 101 variation with powerups just like an old school arcade game. This is as a sub variation of the Endless boss or any of the other gameplay modes. Iron Bot Mode - you have one hit point and that's it. This is as a sub variation of the Endless boss or any of the other gameplay modes. Bringing You our Best Boss 101 is a project that took three people nearly three and a half years to create. We self funded and worked on it full time to bring you the best game we could with as few restrictions as possible. We appreciate all your support during this period. We set out to bring you our best and want you to feel GREAT about purchasing Boss 101. Ideally you get a ton of enjoyment with the base game and perhaps enjoy the arcade games too! We packed it as full as we could so look around and see what you can find! Languages We've been asked about the release of Boss 101 in different languages and the short answer is yes, we would love to release it in as many languages as requested. We're a small team so for the main release we are targeting English. From there we will be looking to translate to the most requested languages. If you're interested in helping us or just want to put in a request for a specific language please contact us directly via our website your request or info. Mac and Linux We are concentrating on the PC version for ship but we will look into Linux and Mac after our initial release. Like languages, we want to bring this to as many platforms as we can! Suggestions and Comments These are always welcome and we will do what we can to answer each one directly. Check out the forums here, the comment section or mail us directly! We would love to hear from you. (see below) Questions are welcome in the comments section or contact us directly. Thank you again for checking out our page!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/380920/header.jpg?t=1522299681",
    "Price": 14.99,
    "Developers": "Donley Time Foundation",
    "Publishers": "Donley Time Foundation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_e514c88902799703cee1b4ed0a301b91b3f14c47.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_3ff5e77942b220d49524c86c20230d71f199819d.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_f9ce0e80b340fcac65bf297f0e2a9536c5260a32.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_30c98fb98ba4ddea1f36d0bbb180ae763c9531e5.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_8d103e13310c7f87a70ae6b5fcfe2f96e7db51f6.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_69d71a271936d77a9d6fcdfbb435db8b4e5033fe.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_785b512f35ad6f226c8de84b45cb15fe03529322.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_900608a5d0acb6e598beb6c75d4d289e65ff680e.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_bbc915f965328cd23dd882e6409874abca54796a.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_df8be138418b5d525b5227edcc39c4ef1259e322.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_7d5044b557fc7415abfd7f2e5c5898d981e0f567.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_7b689c193f824e4038459f1d9613003b5312739e.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_3243406f5f43ab8fe80f084536afa485d7bd0538.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_fe34fe5a5b3a993bc75f604e01bc28197c23c583.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_5a9fdc4bd15466a057474a606071343c60c0b4ce.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_46edcfac9bbff41b727b5c435cc7df2305f3bd7c.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_af9b586f5aefe1c08f8711af5a0445f4744a8213.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_ff614522dfb6009637075ea4b0f061db285ea800.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_74d6a19d889d99bf45eecc4bcfdcb0239814e56c.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_6b72098929b21ee67f053f57420fed3951d5da19.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_950ee98f05d4afe768f8761b3bb99408e0161896.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_6b445fbefe7348bee70be2aeaead0ec5823b7ceb.1920x1080.jpg?t=1522299681,https://cdn.akamai.steamstatic.com/steam/apps/380920/ss_785c417d606c57f61076f66f3614a75fedc7cd89.1920x1080.jpg?t=1522299681",
    "Slug": "boss-101",
    "Meta Title": "Boss 101: Nov 2, 2017, Donley Time Foundation and Full Ov...",
    "Meta Description": "Looking for information on Boss 101? Check out the release date (Nov 2, 2017), developer insights from Donley Time Foundation, and a complete game summary.",
    "Alt Text Image": "Official header image for Boss 101 game - Steam 380920",
    "Canonical URL": "https://gusku.site/game/boss-101",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Boss 101\", \"description\": \"Looking for information on Boss 101? Check out the release date (Nov 2, 2017), developer insights from Donley Time Foundation, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Donley Time Foundation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Donley Time Foundation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/380920/header.jpg?t=1522299681\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}