{
    "AppID": 1213150,
    "Name": "Break",
    "Release date": "Jan 19, 2022",
    "About the game": "I made this as a tribute to my childhood, to all those classic FPS games that I grew up playing like Doom and Quake. I wanted to bring back the feeling of playing those games that I had when I was a kid. I'm just one guy and I'm a programmer not an artist, so I had to rely a lot on open source graphics and sound. But I think if you look past that, you'll find a pretty cool little game. Break is a classic fast paced retro FPS with a custom 2.5D style engine similar to Doom or the Build Engine. It has about 24 non-secret levels, 7 weapons, and a built in editor. The editor is pretty cool, I spent a lot of time refining it. It has a custom scripting language which is intentionally similar to ZDoom's scripting language (and Megazeux's scripting language) to make the transition from ZDoom to Break easy for existing users of ZDoom and GZDoom. I designed Break so that people could build their own cool stuff with it. Everything was designed around simplicity and ease of use with a focus on making custom content easily. Break follows a minimalistic philosophy compared to something like ZDoom. I tried to keep everything minimalistic so that it would be as easy as possible to make custom content for. I included a lot of quality of life features for creating custom content like easy importing and exporting of maps, incredibly simple file formats, insanely easy texture importing, a what you see is what you get style editor, and so on. Break also has a unique layers system that allows for a kind of 2.75D level design. It has some support for slopes, fences/middles, and lighting, but I tried to keep everything as simple and minimalistic as possible to make all this stuff super easy to use. Whenever I played Doom as a kid, I always wanted a built in editor that was fun and easy to use instead of complex and difficult like most level editors were back then. In Break, I tried to create the kind of editor that I always wanted as a kid. I didn't want to just throw together another Doom clone. If you really care about those old games, you don't want just another clone. I think you want something lovingly handcrafted. That's why I built a totally custom engine from scratch. This is a game for people who like handcrafted products. I think there is something beautiful in the imperfections that handcrafting something introduces. Maybe handcrafted products are more human that way. This is a game for people who dream about going back to the glory days of Doom and Quake, for people who miss the good old days, for people who want to try to resurrect the past, at least a little. I hope you'll give it a try. It may be a little rough around the edges, but it's a good game, and if you love classic FPS games, then I think you'll like Break too.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1213150/header.jpg?t=1642653133",
    "Price": 4.99,
    "Developers": "Arcade Artistry",
    "Publishers": "Arcade Artistry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_68740647740f724f67618d82c50a9bca05986f05.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_533c29669d403281868255b1e83438fc3e54af9b.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_110b86b91bdf80d6197591802617a381c58757eb.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_8145791a3dcf517413f43c93552b35e148b537cf.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_9c8b1661a1373ad06f6c2fa0670d3a4c4e9825c6.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_bbb7f3758000b4c1dad9c49b56cbe2495edb9d17.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_6d56e9c7956f7bd805f9c91363013b0423f121a9.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_0e164bfc270fff3aed97e439c887b7ef4e0cdac0.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_445bc82e35a597a02ec6f8d0bcef31b9d256275a.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_329cc23baadba2ea735d6ba4e39218ccc21dde93.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_9645cf014f472b7f3840246769aaf577a8f9e10e.1920x1080.jpg?t=1642653133,https://cdn.akamai.steamstatic.com/steam/apps/1213150/ss_357a7ea6d4f18ae743836c6e01c37207718b8f2f.1920x1080.jpg?t=1642653133",
    "Slug": "break",
    "Meta Title": "Break: Jan 19, 2022, Arcade Artistry and Full Overview",
    "Meta Description": "Looking for information on Break? Check out the release date (Jan 19, 2022), developer insights from Arcade Artistry, and a complete game summary.",
    "Alt Text Image": "Official header image for Break game - Steam 1213150",
    "Canonical URL": "https://gusku.site/game/break",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Break\", \"description\": \"Looking for information on Break? Check out the release date (Jan 19, 2022), developer insights from Arcade Artistry, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Arcade Artistry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Arcade Artistry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1213150/header.jpg?t=1642653133\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}