{
    "AppID": 209170,
    "Name": "Call of Duty®: Ghosts",
    "Release date": "Mar 25, 2014",
    "About the game": "Outnumbered and outgunned, but not outmatched. Call of Duty®: Ghosts is an extraordinary step forward for one of the largest entertainment franchises of all-time. This new chapter in the Call of Duty® franchise features a new dynamic where players are on the side of a crippled nation fighting not for freedom, or liberty, but simply to survive. Fueling this all new Call of Duty experience, the franchise's new next-gen engine delivers stunning levels of immersion and performance, all while maintaining the speed and fluidity of 60 frames-per-second across all platforms. Single Player Campaign Ten years after a devastating mass event, America’s borders and the balance of global power have changed forever. As what's left of the nation's Special Operations forces, a mysterious group known only as 'Ghosts' leads the fight back against a newly emerged, technologically-superior global power. A New Call of Duty Universe: For the first time in franchise history, players will take on the underdog role with Call of Duty: Ghosts; outnumbered and outgunned, players must fight to reclaim a fallen nation in an intensely personal narrative. Gamers will get to know an entirely new cast of characters and visit locales in a changed world unlike anything seen in Call of Duty® before. Multiplayer In Call of Duty: Ghosts you don't just create a class, you create a soldier, a first for the franchise. In the new Create-A-Soldier system, players can change the physical appearance of their soldier by choosing the head, body type, head-gear and equipment, and for the first time in a Call of Duty® game, the player can also choose their gender. With 20,000 possible combinations, this is the most flexible and comprehensive character customization in Call of Duty history. New dynamic maps are the evolution of multiplayer. They include interactive elements and player triggered events that make the environment evolve as each match goes on. The entire landscape can shift and force players to change tactics and strategies. Call of Duty: Ghosts introduces new tactical player movements. The new contextual lean system now allows players to lean around obstacles without adding button combinations or fully leaving cover. The new mantling system allows fluid movement over objects, while maintaining momentum. The knee slide allows for a natural transition from sprinting crouching to prone. Call of Duty: Ghosts delivers over 20 NEW Kill Streaks such as Juggernaut Maniac, the Helo Scout, the Vulture and the ODIN Strike. Players can even bring in guard dog Riley, from the single-player campaign, to protect and also to attack enemies. There are also over 30 NEW weapons, including an entirely new weapon class: Marksman Rifles. Squads Build your team and take up to 6 of them into battle in the all new Squads mode. This mode takes the best parts of the multiplayer experience and allows you to play either solo or cooperatively with the custom soldiers created and leveled up in multiplayer. The load-out choices you make for your Squad members will directly change the AI behavior of your squad-mates. Give your soldier a sniper rifle and he'll behave like a sniper, and an SMG guy will be more run and gun.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/209160/header.jpg?t=1654830036",
    "Price": 59.99,
    "Developers": "Infinity Ward",
    "Publishers": "Activision",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/209160/ss_40eccd8d9da36152496ed7cb625f1b3cde3848ac.1920x1080.jpg?t=1654830036,https://cdn.akamai.steamstatic.com/steam/apps/209160/ss_4034e8573255a5cca333b42bb78aea9ec05118dc.1920x1080.jpg?t=1654830036,https://cdn.akamai.steamstatic.com/steam/apps/209160/ss_007e6bb9311b3ebfc9441a6965699abc1f66971c.1920x1080.jpg?t=1654830036,https://cdn.akamai.steamstatic.com/steam/apps/209160/ss_f62dec40365369a31ecf04691fcabec9fed042bd.1920x1080.jpg?t=1654830036,https://cdn.akamai.steamstatic.com/steam/apps/209160/ss_ada57e47a9fc25445a201ee189c3b44017224b42.1920x1080.jpg?t=1654830036,https://cdn.akamai.steamstatic.com/steam/apps/209160/ss_d0960fe4c60e578c033d8f5c23636e8808a04c0c.1920x1080.jpg?t=1654830036",
    "Slug": "call-of-duty-ghosts",
    "Meta Title": "Call of Duty®: Ghosts: Mar 25, 2014, Infinity Ward and Fu...",
    "Meta Description": "Looking for information on Call of Duty®: Ghosts? Check out the release date (Mar 25, 2014), developer insights from Infinity Ward, and a complete game ...",
    "Alt Text Image": "Official header image for Call of Duty®: Ghosts game - Steam 209170",
    "Canonical URL": "https://gusku.site/game/call-of-duty-ghosts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Call of Duty\\u00ae: Ghosts\", \"description\": \"Looking for information on Call of Duty\\u00ae: Ghosts? Check out the release date (Mar 25, 2014), developer insights from Infinity Ward, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Infinity Ward\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Activision\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/209160/header.jpg?t=1654830036\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}