{
    "AppID": 547970,
    "Name": "Celestial Breach",
    "Release date": "Oct 13, 2017",
    "About the game": "Celestial Breach is a Short Solo/Online Coop arcade flight game in a Sci-Fi setting, Focused on Cooperation versus NPC. It contains a lots of the old school arcade flight sim components, while being refreshing by focusing on cooperation and adding more exotic weapons, abilities, and GamePlay mechanics. The Game is set in an 'arcade' type game mode, where you restart from the first level each time. With enough GamePlay diversity to make every game session different and interesting. Short Gameplay Summary: At the start of the game each player choose an airplane class and a secondary weapon in the lobby. Then They have 3-4 Objectives to complete in order to progress to the next level Only two levels . During Combat they can upgrade their aircraft and choose new exotic abilities/weapons from an in game upgrade menu. When all the missions are completed they can eventually progress to the next level together. If all the players die at the same time, the Game is over and must be restarted from the first Level Current State of the features in the game: Multiplayer: Host and connect via a Server List, no need for port forwarding or firewall rules, possibility to join and invite via Steam friends, and to limit to LAN or friends only. Airplane classes: Four Classes of Aircraft With each their own flight characteristics and unique secondary weapons. Secondary weapons: 11 Unique weapons, Ranging from Railgun to cluster missiles. Upgrade Menu: Base Stats upgrades + Secondary weapons upgrades done (armor, speed, shield, locking speed, range, ...). Special Abilities: 5 done, Speed boost, teleportation, flare charge, distract charge, healing beam. Enemies: 7 enemies type, From the small fighter aircraft to the Ground missile launcher. Objectives: Currently two objective types: 'destroy all targets', 'protect allied targets', with variation such as Big space ship boss and altitude restrictions. Levels: Only two for now, a 'Winter' Level, and a 'Canyon' Level. The Canyon level has altitude restrictions, to challenge players to fly into the canyons :) Controller Support: Full controller support You can do everything with a standard controller. 'Flight Stick' support is planned after the early access launch. Emphasis on TeamPlay and Cooperation The gameplay has great emphasis on teamplay and Cooperation with your friends, by using some special mechanics: When someone kills an enemy, everyone gets the reward (credits to use upgrades on your ship). All Players Sees everyone's health and shield status at all time, if someone is dead, everyone see it's remaining respawn time. The Game is lost When everyone is respawning at the same time. At each death the respawn time increase a little bit. the respawn time is the same/shared with all players. The countermeasures of your ship can deflect any missile, so you can protect a friend by dropping flares near him. Two new abilities have been added recently, that allows you to heal your teammates and to drop flares on them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/547970/header.jpg?t=1507903608",
    "Price": 9.99,
    "Developers": "Dark Nebulae",
    "Publishers": "Dark Nebulae",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_13920acb10f2f835c5d2668ac92657223a32362e.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_7f84ab76b07e2fb993788af9178b487de546d8de.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_2a5d515927ce46b85ee554c16ff52657279832ea.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_6dbf12ccb04c941578e78be11735e518bd86fa38.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_1f3c556af76e56b7579dcac3b2009bacb09bd794.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_e7fd5d3b50656ddf2a32836e45b9726e2cd7d570.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_7773b6543f1b19b3678f4b12fef48cf02ae23e37.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_c71c98e2c518736e94e037a447dee59cf7c96356.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_8724aef1bef3f2ebc5aafae91a0047841bd0c5dc.1920x1080.jpg?t=1507903608,https://cdn.akamai.steamstatic.com/steam/apps/547970/ss_df7b9a88739fbfde93a633fc87e80aebd16d4530.1920x1080.jpg?t=1507903608",
    "Slug": "celestial-breach",
    "Meta Title": "Celestial Breach: Oct 13, 2017, Dark Nebulae and Full Ove...",
    "Meta Description": "Looking for information on Celestial Breach? Check out the release date (Oct 13, 2017), developer insights from Dark Nebulae, and a complete game summary.",
    "Alt Text Image": "Official header image for Celestial Breach game - Steam 547970",
    "Canonical URL": "https://gusku.site/game/celestial-breach",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Celestial Breach\", \"description\": \"Looking for information on Celestial Breach? Check out the release date (Oct 13, 2017), developer insights from Dark Nebulae, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dark Nebulae\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dark Nebulae\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/547970/header.jpg?t=1507903608\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}