{
    "AppID": 1278360,
    "Name": "Clam Man 2: Open Mic",
    "Release date": "Jun 19, 2020",
    "About the game": "CLAM MAN 2: OPEN MIC is the prologue to the upcoming Clam Man 2, a stand-up comedy RPG adventure, and the first day in a week of jokes, quests, and saying a lot of really odd things. It's a combatless, narrative RPG that takes you on an unlikely quest in a very unlikely world. Play as the titular Clam Man and uncover a secret lurking in the basement of Snacky Bay Prime Mayonnaise that will change the course of your life! Do quests, get jokes, and do stand-up! If any of that sounds remotely interesting, give the game a shot! It's free! You've got nothing to lose! Still not convinced? Alright, let me share some of the other things you can do in this game; Faint in an attempt to get out of public speaking Lie to a child Talk to a prehistoric beast Cause an earthquake Do standup THE GAME JUDGES WHO YOU ARE Four different stats dictate your abilities; Aquadynamics - your ability to perform physical comedy, mime, act out scenarios or just remain deadpan! Improv - the ability to think on the spot, be strange and absurd, or come up with new takes or ideas! Detection - your ability to perceive the world and use logic to deduce it! The key ingredient in observation comedy! Self-Awareness - how much of an absolute mess you are! Taking a page from games like Fallout: New Vegas and 'dumb' playthroughs, high Self-Awareness could turn you into an empathic, nervous wreck, while Low Self-Awareness will let you be mean to children, slap people, and blurt out the most unbelievable b******t you could think of. Yay for self-deprecating comedy! TONS OF DIALOGUE If you're averse to lots of reading, this might get tricky - Clam Man 2 has a LOT of branching dialogue, offering tons of replayability! Dialogues also feature tons of static skill checks that only unlock with the right stats; if a conversation only has a couple of available response options, chances are that other outcomes and absurdities hide behind a different character build! GATHER MATERIALS In order to do stand-up, you need jokes! In Clam Man 2, quests are character-based with choices to be made and errands to be run, and finishing a quest rewards you with material you can use in your shows! Every quest has multiple endings, and depending on your choices, the resulting joke loot will change, and it's impossible to see even half of all the jokes in a single playthrough! (Completionists beware - it could take around six fully optimized runs to see everything in the game!) GET ON STAGE Each joke you receive from quests will measure your abilities, with classic RPG dice rolls. High stats and the right joke makes all the difference! Succeeding will give you multiple options of where you want to take the joke, and even failing will allow you to choose your destiny in a spiraling maelstrom of stuttering, awkwardness, and pure bad taste. Will you land every joke, or will you bomb your way through your shows? NO FIGHTING Clam Man 2 is a narrative RPG, with zero combat! (Apart from a part where you can slap a guy in the face.) Furthermore, bombing jokes doesn't lead to a game over - instead, it leads to changes in how characters perceive you, with larger ramifications on the story in the full game! Oh, and you'll also be embarrassing yourself on stage. YOU ONLY GET A TASTE Clam Man 2: Open Mic is the entire first day of the full game currently in development, but even so has tons of quests, characters, and dialogue to see! The full game is currently in development, and the response to this will determine the direction, changes, and style of the final game! Every single Steam review will be read to gather feedback! WHO IS RESPONSIBLE FOR THIS Clam Man 2 is being developed by a solo developer who previously wrote and designed Clam Man, a point'n'click adventure game! You can follow the development on twitter!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1278360/header.jpg?t=1621272846",
    "Price": 0.0,
    "Developers": "marafrass",
    "Publishers": "Team Clam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1278360/ss_bae8e1a2b0f269ee0de2e5b6c554dd2134f826f2.1920x1080.jpg?t=1621272846,https://cdn.akamai.steamstatic.com/steam/apps/1278360/ss_3bc569dd31eaabbf48a105bae230229f84f98a26.1920x1080.jpg?t=1621272846,https://cdn.akamai.steamstatic.com/steam/apps/1278360/ss_b5d981606a2c647b794c0d2e1016cc8916764496.1920x1080.jpg?t=1621272846,https://cdn.akamai.steamstatic.com/steam/apps/1278360/ss_d449f6620b23dae65a704dd3243d737c444ed841.1920x1080.jpg?t=1621272846,https://cdn.akamai.steamstatic.com/steam/apps/1278360/ss_81d46addf7e5032d17612238664484e27fa974c7.1920x1080.jpg?t=1621272846,https://cdn.akamai.steamstatic.com/steam/apps/1278360/ss_a8b62511bea736aafe026ad9e5a9e0f28536c760.1920x1080.jpg?t=1621272846",
    "Slug": "clam-man-2-open-mic",
    "Meta Title": "Clam Man 2: Open Mic: Jun 19, 2020, marafrass and Full Ov...",
    "Meta Description": "Looking for information on Clam Man 2: Open Mic? Check out the release date (Jun 19, 2020), developer insights from marafrass, and a complete game summary.",
    "Alt Text Image": "Official header image for Clam Man 2: Open Mic game - Steam 1278360",
    "Canonical URL": "https://gusku.site/game/clam-man-2-open-mic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Clam Man 2: Open Mic\", \"description\": \"Looking for information on Clam Man 2: Open Mic? Check out the release date (Jun 19, 2020), developer insights from marafrass, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 19, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"marafrass\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team Clam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1278360/header.jpg?t=1621272846\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}