{
    "AppID": 628550,
    "Name": "Crypt Stalker",
    "Release date": "Oct 30, 2020",
    "About the game": "Crypt Stalker is full of those nail biting, heart pounding, stress inducing gaming moments when no one knew what an analogue stick was and you couldn't recover health by hiding behind a wall. (Instead it was done by eating chicken found in a brick wall!) If you wish to relive those golden moments in video gaming then this game might be for you. Time travel might not currently exist but this game will hopefully bring you back in time to where somehow birds do massive damage. Your task is to fight through nine action packed stages, filled to the brim with demons that you'll need to slay with your trusty cyber whip, (or blast them with your side arm, your choice.) However it doesn't stop there, within these worlds there lies dangers that you'll need to navigate past, from raising hot magma to walls crushing down on you. And after you've managed to survive to the very end, defeat the evil demon overlord, you'll have to do it all again but in glorious monochromatic handheld mode. (This mode contains four all new levels to really test your skills) Also included is a few extras such as challenges, a boss rush and that otherworldly 'sound test' mode that you only ever see in vintage retro games. 13 massive levels to conquer, each with it's own dangerous traps to dodge! Huge end level bosses to completely destroy with your demon slaying whip! Including both console and handheld versions of the game. Boss rush and extra challenges. Actual 8-bit graphics that follow strict limitations from that era. (Even included is fake flickering for that extra nostalgia hit!) Listen along to a chiptune soundtrack while banishing those demons back to where they came from! Extras and Steam Achievements to, umm unlock! Written in Engrish for that extra layer of authenticity Every ninetieth solar eclipses is the time where the demons open up the portal to our world. Every time the portal is at a different crypt. This time it's located in the desert, inside the pyramids of the damned. Trained stalkers take on the task of defeating the said demons before they unleash hell on the Earth. Today's task has fell upon Gladys, one of the descendents of the, Crypt Stalkers...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/628550/header.jpg?t=1604352047",
    "Price": 2.99,
    "Developers": "Sinclair Strange",
    "Publishers": "Sinclair Strange",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/628550/ss_203e069231c6988dfc57c3bba29027ca0752d0e0.1920x1080.jpg?t=1604352047,https://cdn.akamai.steamstatic.com/steam/apps/628550/ss_02301304539fd01004080f81eafa9a7957d600e4.1920x1080.jpg?t=1604352047,https://cdn.akamai.steamstatic.com/steam/apps/628550/ss_bd562b0592e7be2fd71c739f9ebe1b2159fdaccf.1920x1080.jpg?t=1604352047,https://cdn.akamai.steamstatic.com/steam/apps/628550/ss_2e6520e27f55000e480c4da28cccf4eba438510b.1920x1080.jpg?t=1604352047,https://cdn.akamai.steamstatic.com/steam/apps/628550/ss_d163d23f0d5f96b63c3351a9245edae15f17aac6.1920x1080.jpg?t=1604352047,https://cdn.akamai.steamstatic.com/steam/apps/628550/ss_b483d3f73bfe9becc850e9a7632b3e93d62079db.1920x1080.jpg?t=1604352047",
    "Slug": "crypt-stalker",
    "Meta Title": "Crypt Stalker: Oct 30, 2020, Sinclair Strange and Full Ov...",
    "Meta Description": "Looking for information on Crypt Stalker? Check out the release date (Oct 30, 2020), developer insights from Sinclair Strange, and a complete game summary.",
    "Alt Text Image": "Official header image for Crypt Stalker game - Steam 628550",
    "Canonical URL": "https://gusku.site/game/crypt-stalker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crypt Stalker\", \"description\": \"Looking for information on Crypt Stalker? Check out the release date (Oct 30, 2020), developer insights from Sinclair Strange, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sinclair Strange\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sinclair Strange\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/628550/header.jpg?t=1604352047\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}