{
    "AppID": 1361680,
    "Name": "cyberpunkdreams",
    "Release date": "May 14, 2021",
    "About the game": "The city is spread before you, horizon to horizon, a vast sore squatting on the world. 24 million people, most of it lawless slum and favela. The last outpost of civilisation on the edge of the badlands. One of the most relevant, cosmopolitan cities in the world. Is it any wonder you ended up here? cyberpunkdreams is an evolving text-based role-playing adventure with countless opportunities, and endless chances for destruction. Take on the role of a lone wanderer sent to the gates of 2090s Cincinnati. The dirt and grit from the badlands coats your clothes - with your memories torn from you, all you have is a weapon across your back and a mission to complete. Enter a living, growing world, with over 2 million words of content, new stories and other content each month, plus regular limited time events. You’ll always find new surprises waiting for you in Cinci's dark and dirty alleys. Who will you become in this cesspool of a city? Will you play the games and climb to the top, or be forgotten amongst the march of time and tyranny? Every action counts cyberpunkdreams is designed to be played in short bursts over the long term. You've got a limited number of Action Points to use every real life day, and any number of ways you can use them. Draw from your decks and risk reward or injury. Stick to safer places to rest, recuperate and work on your skills, or work with your inventory to prepare for the next hustle. Events can unfold over days, weeks or even months. You can also store Action Points for later use, using breathers , or hit the binge button for extended play sessions. The Action Point system establishes pacing in an uncompromising setting where any mistake could cost your life, as well as enabling the development team to keep creating stories every month, maintaining the game as free-to-play and always giving you more to discover. So ease yourself in for one long, wild ride. cyberpunkdreams is a living game that will be updated with new content for years to come. Simple, uncompromising cyberpunk narrative Enter a future grounded in reality: a world distorted by corporations and dominated by poverty. This is down to the bone cyberpunk, as raw as it gets. Experience just a turn of a corner away from our own, whether you're a genre expert or getting into cyberpunk for the first time. Learn who you are through your actions &amp; choices Your abilities are intrinsically tied to your successes and failures. There are a multitude of ways to solve each problem you’ll encounter -- what you choose impacts not only your chances of making it out alive, but also how your character grows and experiences the world. Choices have consequences, and the city remembers Your choices aren’t detached from the lives of the people around you. Richly detailed NPCs will evolve on their own, remember and react to the alliances you announce, the mercy you give and the morals you stand by. If you’re looking for a true lesson of consequence, you’ve come to the right city. Embrace yourself, flaws and all cyberpunkdreams offers highly customisable character creation that continues throughout your entire time in Cincinnati. Become who you want to be. Occupy your skin in any way you choose. Gender, sexuality, cybernetics, mutations, clothing and equipment all combine to create a fluid system with any number of possibilities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1361680/header.jpg?t=1654731301",
    "Price": 0.0,
    "Developers": "Late Night Games",
    "Publishers": "Late Night Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_98c13c5539d023216d8c836c6d3ef532471923ac.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_ec7a90edab053669238aebb27258263439da22a1.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_380851a5688e770c5355d941cb51057ad496dd2e.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_a19b44535beac1841fa87e27be82fbb18392aeca.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_d28e4b5a825e62ab37d8b7a8e58fa07c6edb635e.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_7d78b839abc4a3843f0cfafcc14695e30e1351e8.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_b323ded6a4abc95aef099a44982408e04fb918d4.1920x1080.jpg?t=1654731301,https://cdn.akamai.steamstatic.com/steam/apps/1361680/ss_394a3966b11703bd3d32f4f8a90f894bc85cacd3.1920x1080.jpg?t=1654731301",
    "Slug": "cyberpunkdreams",
    "Meta Title": "cyberpunkdreams: May 14, 2021, Late Night Games and Full ...",
    "Meta Description": "Looking for information on cyberpunkdreams? Check out the release date (May 14, 2021), developer insights from Late Night Games, and a complete game sum...",
    "Alt Text Image": "Official header image for cyberpunkdreams game - Steam 1361680",
    "Canonical URL": "https://gusku.site/game/cyberpunkdreams",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"cyberpunkdreams\", \"description\": \"Looking for information on cyberpunkdreams? Check out the release date (May 14, 2021), developer insights from Late Night Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Late Night Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Late Night Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1361680/header.jpg?t=1654731301\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}