{
    "AppID": 845510,
    "Name": "DiyMachinery （自定义机械）",
    "Release date": "May 16, 2018",
    "About the game": "DiyMachinery It's a physical game, 22 basic parts build machines complete over, over, hanging, climbing, bridging... Such as obstacles. There is no hierarchy, so long as your computer is good, you can build big, interesting machines. This game requires a lot of logical thinking, observation, manipulation, and spatial imagination. If you like research and thinking, don't miss it. This game is a skill and requires a high IQ to play. builds basic operations: Click the blue box, click on the component interface you want to build components, click on the components, press Q, W, E, A, S, D and other keyboard keys to rotate. The Z key removes the selected component. Ctrl+c copies the selected components, then selects the blue box Ctrl+v to paste. Click a blue square, click on the other block, and then press the X key to weld two blue squares. If the steering wheel is welded, the component will disconnect (also press the lower right corner of the game button). adds an operating group: Method 1: hold the Ctrl key for multiple selection, then click Add group button, the lower left corner of the game interface will appear, the K1 and K2 buttons in the list are the function of the control component, such as the hydraulic top bar: press the K1 top, then stop by K1, the K2, and then stop by a K2, basically all the operable components are this Class operation. Method 2: click the controller button in the upper right corner, enter the controller interface, drag the icon to organize the operation group, then select the line to operate, and then press the K1 K2 big button in the lower right corner to control the selected line. (this method does not conflict with the first method, that is to say, you set the first method will not affect the second method, and vice versa). wheel: The system automatically opens the turning functions of the front wheels. You can also click the wheel to open the wheel control interface to control the turn, turn, and turn off the power. car head: You can control the suspension force of the wheel and the number of turning wheels by clicking the front end and opening the control interface. slide The slide is the long one. When you build it, you can adjust the length by clicking the slide rail. summary: This game can exercise your brain, saying it is easy and easy to say, it's complicated to say that the component is also the two or three methods of operation, see what you build and match. If you can completely pass it, you are more cattle than my author, and the technology that finally needs the bridge is different from the technology of the high iron bridge. You can be an engineer, too.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/845510/header.jpg?t=1529585153",
    "Price": 0.99,
    "Developers": "me",
    "Publishers": "me",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/845510/ss_4a1ce829ebfea5b00d3dc69f818b0dd67120e4bc.1920x1080.jpg?t=1529585153,https://cdn.akamai.steamstatic.com/steam/apps/845510/ss_e391ddd86108b8473d82a4a41eafc2f7109833aa.1920x1080.jpg?t=1529585153,https://cdn.akamai.steamstatic.com/steam/apps/845510/ss_b7fbf7c8e5f7e244c2fa8cab21685355b8646dca.1920x1080.jpg?t=1529585153,https://cdn.akamai.steamstatic.com/steam/apps/845510/ss_b11dc4429215a6cac95e4b41021fc777e727f676.1920x1080.jpg?t=1529585153,https://cdn.akamai.steamstatic.com/steam/apps/845510/ss_7284fe0dcaf6d693a85507cdc0afbf291727c25b.1920x1080.jpg?t=1529585153",
    "Slug": "diymachinery",
    "Meta Title": "DiyMachinery （自定义机械）: May 16, 2018, me and Full Overview",
    "Meta Description": "Looking for information on DiyMachinery （自定义机械）? Check out the release date (May 16, 2018), developer insights from me, and a complete game summary.",
    "Alt Text Image": "Official header image for DiyMachinery （自定义机械） game - Steam 845510",
    "Canonical URL": "https://gusku.site/game/diymachinery",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DiyMachinery \\uff08\\u81ea\\u5b9a\\u4e49\\u673a\\u68b0\\uff09\", \"description\": \"Looking for information on DiyMachinery \\uff08\\u81ea\\u5b9a\\u4e49\\u673a\\u68b0\\uff09? Check out the release date (May 16, 2018), developer insights from me, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"me\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"me\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/845510/header.jpg?t=1529585153\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}