{
    "AppID": 892380,
    "Name": "Dr Greenstuff",
    "Release date": "Oct 31, 2018",
    "About the game": "Discover the life of Dr. Greenstuff, one of the greatest scientist specializing in drugs. In this game you will be taken to grow all the plants called 'prohibited' such as cannabis, coka etc ... In order to set up your business. * Sandbox * Open world * Realistic plants. * Grow your plants where you want . * Move and store your items as you wish. * Decorate and arrange your own laboratory or apartment. * Decode the recipes. * Perform various quests. * Improve your crops with fertilizers made by you. * Perform quests for different NPCs. * Sell, process or even cook your products. * Many plants available (cannabis, coca, nettle, cacti and more ...). * Realistic laboratory for the manufacture of meth. * French youtubers lend their voices to the characters. * Stay discreet and avoid the police. * Unique and original experience. * Become the neighborhood boss Dr. Greenstuff: Man, white, 45 years old, of French origin. Internationally renowned thanks to his discoveries on the active principles of certain drugs and the creation of drugs derived from his research. After obtaining the highest honors, he is spotted by the cartel that kidnaps him. Seven years of disappearance followed during which the doc worked for the cartel. Meanwhile, investigations are being conducted and it is quickly realized that the doc had some accounts hidden in tax havens. Public opinion turns around and blames the doc for diverting money ... Searches are quickly stopped and rumors even speak of a phony kidnapping. It is only during a seizure of drugs by the Ukrainian police that we find the doc, alone in a big meth Labs. His trial took place and no name could be put on this alleged abductor, the years having passed, his lab was bought and another teacher was recruited. He has no support from public opinion or his profession. He receives a fine of € 250,000 and electronic surveillance with house arrest for 18 years . WITH YOUR PURCHASE,YOU WILL HAVE ACCESS TO THESE 4 CHAPTERS (Prologue 1.2.3 and Second life Chapter) AND ALL FUTUR UPDATE. The game takes place in 4 parts: Prologue 1 : Humanity manufactures herbal medicines since long time and in our time some secret Labs develop new drugs to save life. You work in a hospital in this secret laboratory in order to create medicines. Develop your laboratory as you wish and grow your first plants. Watering them,watch them grow and cut them to make your first crops. Once the bottom gathers, buy and use various instrument in order to extract the active ingredients and create new drugs. Prologue 2 : After obtaining great rewards through these discoveries, the Doctor's life changes when two men appear in his laboratory and kidnap him. In this episode, you will have to put your knowledge in the service of a cartel to make cocaine. Prologue 3 : In a secret cartel lab, you must create the best 'Meth'. Decrypt the recipe, mix the ingredients and make sure to reach the profit target. The Second Life : In the final version, you will play the doctor 2 weeks after his trial. He is back in France. To serve his sentence, he must have found a small job to be able to live and pay his fine... in this final version, all the prologue plants are present and others will be added . In this level you will have to link relations with the dealer of the neighborhoods in order to work with them and make evolve your business.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/892380/header.jpg?t=1541692787",
    "Price": 12.99,
    "Developers": "Black Diskette",
    "Publishers": "Black Diskette Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_23afdf01defcee94647a23b8b1f049d8b6f25986.1920x1080.jpg?t=1541692787,https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_03bd1e427d885aa21b676cbba2a644b55a84232d.1920x1080.jpg?t=1541692787,https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_3fc09b8ef3d961d4fe1746b54739cc6c91d3c926.1920x1080.jpg?t=1541692787,https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_cd2a1c2336f43c94e56c197fc547fd8a2dc2cca9.1920x1080.jpg?t=1541692787,https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_32fd706c504b3a9d71f449f7cc187d8c4c33c01d.1920x1080.jpg?t=1541692787,https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_cc3f8eebce8efcaa01453158b35d23e7d553360b.1920x1080.jpg?t=1541692787,https://cdn.akamai.steamstatic.com/steam/apps/892380/ss_6ecf254057143cc097e47628d557e80a47e2fd47.1920x1080.jpg?t=1541692787",
    "Slug": "dr-greenstuff",
    "Meta Title": "Dr Greenstuff: Oct 31, 2018, Black Diskette and Full Over...",
    "Meta Description": "Looking for information on Dr Greenstuff? Check out the release date (Oct 31, 2018), developer insights from Black Diskette, and a complete game summary.",
    "Alt Text Image": "Official header image for Dr Greenstuff game - Steam 892380",
    "Canonical URL": "https://gusku.site/game/dr-greenstuff",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dr Greenstuff\", \"description\": \"Looking for information on Dr Greenstuff? Check out the release date (Oct 31, 2018), developer insights from Black Diskette, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Black Diskette\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Black Diskette Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/892380/header.jpg?t=1541692787\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}