{
    "AppID": 1564840,
    "Name": "Dreams Of Adventure",
    "Release date": "Oct 7, 2021",
    "About the game": "Dreams Of Adventure brings you in a world of medival fantasy where you chose how to play and impact the world around you. Will you help a person in need? Want them to pay you for help? Perhaps... you end their life and take the bellongings...? The choice is yours! Map is 150x120 squares big (The finished map will be 500x500 or even 2x(500x500) Quests 103(currently) Party member - 2 (Currently. More members will be added in future as I work) nteractive spells - (Casting spells require to be pressed in a sequence in set amount of time to work with 100% chance of it hitting) Day/Night Cycle - Unlike most of RPGMaker games, day/night here determinate if you can enter a house freely or have to pick a lock (during the night. Some events and quests will trigger at night and quest givers/quest objective will only spawn at night (e.g.: Kill 10 owls (not an actual quest in game but for sake of reference) Statuses - Hunger, Thirst and Sleep (If Hunger and thirst hits 0 your character dies. As sleep goes down, so do your stats but it's not fatal) Prison System - Pay or Wait World Locations 29(260+ inside locations (including houses) Blackjack mini-game (for those who like to gamble and have fun on the side) 1500+ Interact-ables (bookshelf's, drawers, closets, boxes, etc) Lockpicking 800+ items, weapons and gear combined Smelting, Weaponsmith and Armorsmith Alchemy Tailoring Leatherworking Scribe and Inscription Survival Woodcrafting Processing Jewellcrafting Cooking In-game Achievements (STEAM coming soon) Lots of random world events that trigger randomly or depending on your choices you've made along the way Fog of War - Rooms with doors are dark until you enter it. They go back to dark when you leave the room. Different Endings Purchasable houses - A place to call your own. Fishing- Now you can fish and gather resources for cooking and possibly earn a nice penny Steal- You can steal items, money or gear from certain enemies during battle Flavorful sounds for drink, eat, sleep, armor and weapon equip. Spell Cool Downs 12 Kingdoms (not done yet) Item weight- Now items will have weight making player chose what to carry on him Bank/Storage- Players can store stuff and gold in banks for a small fee just like real life! Difficulty System - Now you can chose how you want to play the game. From Easy to Torment the enemies will have stats to make you walk pass them like a breeze or crush your very soul. 8 Classes: 1. Sellsword - An ex-soldier class that uses all kind of weapons and gear to rip and tear enemies on the battlefield. 2. Cultist - A harbinger of the dark forces. Uses various spells to afflict enemies HP and abilities. Can use blood sacrifices (kill friendly party members) to do massive damage and afflictions. 3. Paladin - Warrior of Light that strikes his foes with righteous fury. Users both abilities and spells to change the tide of battle. 4. Ranger - Utilities the nature and the environment to strike fear in enemies, unseen. Various traps and few spells that are learned from the time spent with elves. 5. Bandit - Always scheming, uses agility to strike their enemies. A bandit don't shy away form using less savory means to kill their target. 6. Cleric - Going down path of the Lord, you shy away from violence, but use your abilities to help those in need, while accidents do happen... It's a battle after all. 7. Sorcerer - Going to the school of Magic, you learn various school of spells to damage your foes from afar. 8. Commoner - A common peasant. (Not done yet)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1564840/header.jpg?t=1656972468",
    "Price": 0.0,
    "Developers": "Farting Rainbow Production",
    "Publishers": "Farting Rainbow Production",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_f82eddbb4f37b4858a7555785928401c7d22da6f.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_15c63d92af0731d45b1617014fcb7f302909ee19.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_990b4e47a7655f23b922a2427939d0cfd2798a24.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_1f97b8a9136d3fa6a79d3900e37d18cdb29ad833.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_684b49467697f70c4d9fc21a434aa4c4cb3cd372.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_8cd5f553e963c3ee4bd99807c7a735542b4d5366.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_dbf6a2b7a240856ad1bdc0ba63f9eaf3000495b0.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_611715e2003b77ebdbe339c51a56257ce41fd9bc.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_52c286ac15cf53483889700b2cc1dfeb5474e7e1.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_f8bf3ad34f816f15de50abb69cfacfe644989e69.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_f298d46e99f87b4cbfb99742fa7ed12e34ac972d.1920x1080.jpg?t=1656972468,https://cdn.akamai.steamstatic.com/steam/apps/1564840/ss_41d8b573495b48b5f91c8f3a6395c9536879dcab.1920x1080.jpg?t=1656972468",
    "Slug": "dreams-of-adventure",
    "Meta Title": "Dreams Of Adventure: Oct 7, 2021, Farting Rainbow Product...",
    "Meta Description": "Looking for information on Dreams Of Adventure? Check out the release date (Oct 7, 2021), developer insights from Farting Rainbow Production, and a comp...",
    "Alt Text Image": "Official header image for Dreams Of Adventure game - Steam 1564840",
    "Canonical URL": "https://gusku.site/game/dreams-of-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dreams Of Adventure\", \"description\": \"Looking for information on Dreams Of Adventure? Check out the release date (Oct 7, 2021), developer insights from Farting Rainbow Production, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Farting Rainbow Production\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Farting Rainbow Production\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1564840/header.jpg?t=1656972468\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}