{
    "AppID": 700560,
    "Name": "Druid's Tale: Crystal Cave",
    "Release date": "Oct 13, 2017",
    "About the game": "Become an unconventional Druid that protects the land from the forces of darkness. Use true power of VR devices or just play with your mouse and keyboard. Innovations and news The game emphasizes the use of new solutions, to show players something they know in a completely different way. Do not be fooled by your habits and open your mind to new experiences. Exploration Explore the atmospheric world of underground caves filled with magical crystals. Discover hidden passages and secret locations filled with unique ingredients. Collect herbs and mushrooms in an environment that lives on its own life. The flora of the land grows on the basis of how it is cared for. Each biom has its own ecosystem. Be careful not to lead to the extinction of rare herbs by interfering with the land. Crafting Create potions throwing various ingredients into the cauldron. Discover new recipes, refine their composition, and save them on scrolls. You can create both potions, drugs or even alcohol. Many of them have unique effects and can influence how we see the environment. Research Perform research and analysis of the newly found ingredients, objects or remains of enemies, discover their properties and characteristics using specialized tools. Trade and Neutral Fractions Trade with neutral factions to help them with their needs. Get access to the objects that don't exist in your land and maintain a relationship. The faction interacts with each other and can interfere in your land by building structures or devastating it. Fight Protect the world against the forces of darkness. Black spirits will haunt the land coming from its dimension. Some of them will want to take control of a fragment of your world materializing in the form of evil totems. Do not be fooled by the inconsistency of this opponent, he will slowly suck life energy out of the land and gain unique abilities that he will use to defend. Travel to the dimension of darkness, dark place from where ghosts are attacking your world, to obtain a rare ingredients and steal their treasures. Missions Try out 3 completely unique mission systems where everyone will find the most suitable job for him. You care for self-development? You will use the Terms Want to help others? You will use Trade Treaties Looking for a bigger target? Try Divine Missions! Meditation In free moments, meditate, cut off from the world around you, moving into your own mind, where you can catch your own thoughts or face your conscience. It is a unique system in which you will be able to create the way your character perceives the world. VR The game was designed to take advantage of the potential dormant in virtual reality and enhance the experience associated with it. It is based on building a deep immersion for which standard solutions and interface have been abandoned. Many aspects will benefit from the perception of the depth, the sense of spatial orientation, and the way in which the mind reacts to certain specific stimuli. However, even if you don't have VR Set, you can still play using standard PC Configuration (Monitor, Keyboard and Mouse) Full support for Leap Motion controller! Game is using the full potential of Leap Motion. Have you ever wanted to catch sword with your own hands or cast lightning from fingertips? This game will give you opportunity to do that, and much more! Due to ongoing VR testing, virtual reality and Leap Motion support in the current version of the game is disabled. It will be available as soon as possible in future updates.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/700560/header.jpg?t=1507907745",
    "Price": 14.99,
    "Developers": "Xenturion",
    "Publishers": "Xenturion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_9142be5913bdc36b811271a51c4c3ef642e5c8b2.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_ba47364d6ec491dff8e68d5a6c8e85facd96ead0.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_df053dd1d65944784f14b55d38199813dbbec76c.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_2256b693dc75040ae888ba2303f2d5490794a15d.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_b7c30f97bfebca3c6cf2a7130080c457fe570c9b.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_1ac47a0f84d0ed215ad4bbad4c42aa1b935f6d1e.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_3ddc176a2a295e4623edc163b22aae658b55b1bb.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_d15934b673bd448674d1740c2466af5a097c9fa7.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_59daad0357a73d3ef7d29407c053e003fb61a79a.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_66fe26bfd0a8cb966a429ca04f6f8ac69f626259.1920x1080.jpg?t=1507907745,https://cdn.akamai.steamstatic.com/steam/apps/700560/ss_bc5020cae98316b488d2c6c8dfd74f4424febd36.1920x1080.jpg?t=1507907745",
    "Slug": "druid-s-tale-crystal-cave",
    "Meta Title": "Druid's Tale: Crystal Cave: Oct 13, 2017, Xenturion and F...",
    "Meta Description": "Looking for information on Druid's Tale: Crystal Cave? Check out the release date (Oct 13, 2017), developer insights from Xenturion, and a complete game...",
    "Alt Text Image": "Official header image for Druid's Tale: Crystal Cave game - Steam 700560",
    "Canonical URL": "https://gusku.site/game/druid-s-tale-crystal-cave",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Druid's Tale: Crystal Cave\", \"description\": \"Looking for information on Druid's Tale: Crystal Cave? Check out the release date (Oct 13, 2017), developer insights from Xenturion, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Xenturion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Xenturion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/700560/header.jpg?t=1507907745\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}