{
    "AppID": 1277320,
    "Name": "FirstQueen1 NEXT",
    "Release date": "Jun 3, 2020",
    "About the game": "This is a remake of a popular game that was released more than 30 years ago and has been updated and improved. This game is based on the game first released in 1988 on the PC called 'First Queen'. (Later, it was also released on home console machines) The game screen has been made larger, battles allowing using a 2nd battalion of troops, and the overall game play has been upgraded to improve playability! The First Queen Born in Ornic. The Queen was full of ambition to control the world and began marching south. However, countries that faced her were not unified and fell before her army marching towards Ornic. With the fall of his country, Count Richmont begins a counterattack with Crucible soldiers. Original Game System Your subordinates will usually attack and retreat according to orders, but they will do so based on their individual personalities. There are also characters and items that were not in the original, such as nurses who are dedicated to treat the wounded without any regard to danger and also soldiers who are able to fully use special items. The tribes that make up the nation may become enemies or allies as the game progresses. Defeating an enemy leader can turn the concerning enemy troops into allies. Players can take control of a character and move them out of dire situations. In other words, basically, you are their 'guardian'. If the characters are in a battle they can win, you can leave them alone. When fighting against a stronger foe, use of items and other abilities might be required. A weak character will quickly retreat when their 'LIFE' decreases. If they leave the battle and stay away from enemies, they can quickly recover to fight again. This has resulted in a system where 'even strong soldiers will be in danger if surrounded'. It is a system for heroes to fight in groups instead of facing battles alone. In the same manner as a typical simulation game, many units are spread throughout the country. Over time, some enemy units will march towards your castle. You also need a strategy on where to stop powerful units.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1277320/header.jpg?t=1591223381",
    "Price": 11.99,
    "Developers": "Kure Software Koubou Co.,Ltd.",
    "Publishers": "Kure Software Koubou Co.,Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1277320/ss_05905437345a29a04958c6391617567f6ca8d5ac.1920x1080.jpg?t=1591223381,https://cdn.akamai.steamstatic.com/steam/apps/1277320/ss_9558ca3519319e63ba2ee5684556dfa6301c2df2.1920x1080.jpg?t=1591223381,https://cdn.akamai.steamstatic.com/steam/apps/1277320/ss_35de42b89aade0613705acc8a6082040495cd57d.1920x1080.jpg?t=1591223381,https://cdn.akamai.steamstatic.com/steam/apps/1277320/ss_e75f2662f935ca8f934e809672ca6fb8311ad47d.1920x1080.jpg?t=1591223381,https://cdn.akamai.steamstatic.com/steam/apps/1277320/ss_85d50c874ed70fbe9bd78df70c361c8d98a11b62.1920x1080.jpg?t=1591223381",
    "Slug": "firstqueen1-next",
    "Meta Title": "FirstQueen1 NEXT: Jun 3, 2020, Kure Software Koubou Co.,L...",
    "Meta Description": "Looking for information on FirstQueen1 NEXT? Check out the release date (Jun 3, 2020), developer insights from Kure Software Koubou Co.,Ltd., and a comp...",
    "Alt Text Image": "Official header image for FirstQueen1 NEXT game - Steam 1277320",
    "Canonical URL": "https://gusku.site/game/firstqueen1-next",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FirstQueen1 NEXT\", \"description\": \"Looking for information on FirstQueen1 NEXT? Check out the release date (Jun 3, 2020), developer insights from Kure Software Koubou Co.,Ltd., and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kure Software Koubou Co.,Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kure Software Koubou Co.,Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1277320/header.jpg?t=1591223381\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}