{
    "AppID": 763270,
    "Name": "Fritz Chess 16 Steam Edition",
    "Release date": "Apr 3, 2018",
    "About the game": "When is chess the most enjoyable? When you win! When Fritz entered his first tournaments some 25 years ago, humans still had a real chance of taking the engine down. Only a few years down the line, Fritz was already beating grandmasters left, right and center, but ever since his 4:2 victory over Kramnik in 2006, Fritz has been considered unbeatable. Who would want to play against him? In the case of Fritz 16, however, playing against an engine is now once again the very definition of fun! A host of features, including 'Assisted Analysis', which gives you discreet visual hints as you move, and emoticons, which show Fritz’s mood, are there to help you. Even with little knowledge of chess, you can enjoy many an exciting game, and more importantly, victory, against Fritz. If things don’t work out, Fritz 16 shows you the combinations you might have missed directly after the game with the handy “Tactical Analysis” function, or you can dive right into 'Easy Play' calculation training to hone your skills. Fritz doesn’t come up short when it comes to playing strength either: the new multiprocessor engine was developed by star programmer Vas Rajlich ('Rybka') and is up there with the global elite. No other chess program offers you more, with the online manual alone spanning a whopping 457 pages! But you won’t need it - Fritz 16 is intuitive and easy to use, and whether you want to play against the engine, analyze or enjoy some online blitz, Fritz 16 will open just the functions you need at the click of a mouse. 'Easy Play': Play, Train, Win! It is indeed as simple as it sounds. You now only need one click to start a new game and you can immediately play out any position against Fritz 16. Even more important: earlier versions of Fritz offered various sparring functions (Handicap, Friend, etc.) to emulate “normal” human play. In Fritz 16 all these playing modes are combined in one function: 'Easy Play'. Just choose a level from Beginner – Occasional Player – Club Player – Strong Club Player – Master – Grandmaster and the program acts accordingly. Fritz 16 plays according to the chosen level but intentionally commits hidden errors, tactical errors in particular! So, don’t shy away from lively attacking games! You will definitely crush the program occasionally! Funny: during the game Fritz 16 shows your ELO-performance but also uses FritzEmoticons to show how he feels! But of course Fritz 16 is not always easy to beat. Here a new training function comes into play which you should try if you are not certain about your move: hold the piece you want to move a bit longer with the mouse. This activates the new function 'Assisted Analysis“, and shows you how good each possible move of this piece is. This tactical safety net increases your playing strength! New training methods to calculate: improve core competence! 'Calculating variations correctly is the core component of playing strength', as ChessBase head programmer Matthias Wüllenweber put it with nice distinction. If you play regularly you know how true this is! Fritz 16 offers you the opportunity to test your calculating skills during your games. The focus is on calculating and visualising positions correctly. Fritz helps to check whether the moves are legal and tactically correct which helps to calculate meaningful variations. The highlight: a right click with the mouse always allows you to compare the real and the visualised position. Additional improvements in Fritz 16: optional action sounds in blitz games give advice about mistakes by you or your opponent – kibitzing live-games with asymmetrical multiboard – 3D-multiboard – a program that helps to enter games when the scoresheets are unreadable – New set of pieces in 2D, and much more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/763270/header.jpg?t=1523613545",
    "Price": 39.99,
    "Developers": "ChessBase GmbH",
    "Publishers": "ChessBase GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/763270/ss_3810b7f598374343d95bf24cd46b62f55b6c2d77.1920x1080.jpg?t=1523613545,https://cdn.akamai.steamstatic.com/steam/apps/763270/ss_8b15ebbc4c40941ae82aa12d88e71ef7788a8926.1920x1080.jpg?t=1523613545,https://cdn.akamai.steamstatic.com/steam/apps/763270/ss_a0974b6cae810d866c8d268bdd43ce8c29e0df6b.1920x1080.jpg?t=1523613545,https://cdn.akamai.steamstatic.com/steam/apps/763270/ss_11bf41cb50388dfdb0540a2d9bdd67598d9660f3.1920x1080.jpg?t=1523613545,https://cdn.akamai.steamstatic.com/steam/apps/763270/ss_f48c5496f2a6c56a8ac05f3f31cea7d16ef049db.1920x1080.jpg?t=1523613545,https://cdn.akamai.steamstatic.com/steam/apps/763270/ss_87ac81adc7ebcc793efe734f5ac7f0ebf147dcc4.1920x1080.jpg?t=1523613545",
    "Slug": "fritz-chess-16-steam-edition",
    "Meta Title": "Fritz Chess 16 Steam Edition: Apr 3, 2018, ChessBase GmbH...",
    "Meta Description": "Looking for information on Fritz Chess 16 Steam Edition? Check out the release date (Apr 3, 2018), developer insights from ChessBase GmbH, and a complet...",
    "Alt Text Image": "Official header image for Fritz Chess 16 Steam Edition game - Steam 763270",
    "Canonical URL": "https://gusku.site/game/fritz-chess-16-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fritz Chess 16 Steam Edition\", \"description\": \"Looking for information on Fritz Chess 16 Steam Edition? Check out the release date (Apr 3, 2018), developer insights from ChessBase GmbH, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ChessBase GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ChessBase GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/763270/header.jpg?t=1523613545\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}