{
    "AppID": 509530,
    "Name": "Gods and Nemesis: of Ghosts from Dragons",
    "Release date": "Apr 1, 2017",
    "About the game": "Bizarre lands! Fantasy! Chaos! You start off with the main chapter centered on the bizarre alien land as described in the book Gods and Nemesis: Leviathan Seed. Additional chapters will be added allowing you to advance your character. As the chapters are added for you to explore, Gods and Nemesis: of Ghosts from Dragons will unravel into a multiplayer open sandbox RPG. One thing you will notice upfront is every asset is crafted from scratch. Future chapters will include a survival-based world that will invite you and your friends to adventure the main storyline, find side quests, unravel secrets, or create and play your own epic quests within a truly alien environment. Once you get used to the asymmetrical world with its fresh layout within the first chapters, future chapters will be released that includes giving an open-world experience. Are you an explorer or dungeon crawler? Are you a survivalist or crafter? Maybe you want to begin creating your own quests as a modder-- the future chapters will give you incredible options. Features of this first chapter • 1st chapter will be approximately one hour of average play • Engaging storyline • Intro to the alien world with in-game tutorials • Several Side quests and Easter Eggs The 1st chapter will be scheduled on the release date for free. Additional chapters will be added over time based on overall support. Several chapters are already mapped out and will be available soon along with expanded content including the open-world experiences. Although these systems work, the project will require additional developers to create a steady stream of content. In order to stand by my promise of releasing this game, I will release the 1st chapter which will have a great deal of content in itself. I believe that this will inspire the needed support for the planned Gods and Nemesis universe. Keep in mind that there is a unique burden of describing a truly alien world because there is little to relate with -- it must be played for someone to understand its potential and appeal and this is why the first chapters are deeply story-driven.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/509530/header.jpg?t=1642465936",
    "Price": 0.0,
    "Developers": "Chad Meffert",
    "Publishers": "Chad Meffert",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/509530/ss_2596bd49b84b5a1d0b7dff5f62231b73ed48fe25.1920x1080.jpg?t=1642465936,https://cdn.akamai.steamstatic.com/steam/apps/509530/ss_fc11d337da56ff5ab7a253c9f7960e076ce08605.1920x1080.jpg?t=1642465936,https://cdn.akamai.steamstatic.com/steam/apps/509530/ss_684d8291a537559937bdea7cfb4007aec3595496.1920x1080.jpg?t=1642465936,https://cdn.akamai.steamstatic.com/steam/apps/509530/ss_8beced01f5090a0a91c8612380438ed64f29cdc2.1920x1080.jpg?t=1642465936,https://cdn.akamai.steamstatic.com/steam/apps/509530/ss_c7f60ac34f1eedb239ebb591da3f53ab4c14342e.1920x1080.jpg?t=1642465936,https://cdn.akamai.steamstatic.com/steam/apps/509530/ss_f770ac02ec03f2fb18891bd772498cbe080ec8e1.1920x1080.jpg?t=1642465936",
    "Slug": "gods-and-nemesis-of-ghosts-from-dragons",
    "Meta Title": "Gods and Nemesis: of Ghosts from Dragons: Apr 1, 2017, Ch...",
    "Meta Description": "Looking for information on Gods and Nemesis: of Ghosts from Dragons? Check out the release date (Apr 1, 2017), developer insights from Chad Meffert, and...",
    "Alt Text Image": "Official header image for Gods and Nemesis: of Ghosts from Dragons game - Steam 509530",
    "Canonical URL": "https://gusku.site/game/gods-and-nemesis-of-ghosts-from-dragons",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gods and Nemesis: of Ghosts from Dragons\", \"description\": \"Looking for information on Gods and Nemesis: of Ghosts from Dragons? Check out the release date (Apr 1, 2017), developer insights from Chad Meffert, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chad Meffert\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chad Meffert\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/509530/header.jpg?t=1642465936\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}