{
    "AppID": 436150,
    "Name": "Governor of Poker 3",
    "Release date": "Feb 19, 2016",
    "About the game": "Play poker online in this awesome Texas Holdem Poker casino and be a star in this fun, multiplayer social poker game with progression! Texas Holdem Poker is a popular card game and Governor of Poker has a huge variety of poker games to choose from that let you compete with friends, challenge new poker players and much more! If you like missions and daily challenges to win spectacular rewards with lots of amazing hats, you will love this addicting game! Becoming a poker pro is an exciting journey; you will start as a cowboy poker rookie and work all the way up to become a high roller to play with millions of chips. The ultimate goal is to become a VIP poker star, winning high stakes Western games in Las Vegas! Enjoy Texas Holdem in: Cash games, tournaments, Spin &amp; Play, Sit &amp; Go, Royal Poker, Party Poker, friends games, Heads-up, online Blackjack 21, PVP and Wild West saloon tourneys! GOVERNOR OF POKER 3 (GOP 3) FEATURES: ● BIG FREE WELCOME PACKAGE: $30,000 FREE poker chips, gold and avatar hat! ● 7 DIFFERENT POKER FORMATS: Cash games, Sit &amp; Go tournaments, Spin &amp; Play, Heads Up Challenge, Push or Fold with Royal Poker, No-limit and Pot Limit. ● POKER TEAMS: TEAM UP AND PLAY FOR THE REWARDS Make friends and compete against other teams and check out the all-new challenges! ● PARTY POKER: PLAY WITH FRIENDS FOR FUN Invite friends and have a blast! ● ENJOY TEXAS: WESTERN GAMES OF THE WILD WEST Travel through Texas by winning poker tournaments, beat friends at Texas Holdem poker, cash games and poker tournaments. The further you travel the higher the stakes! ● BLACKJACK 21: Play Blackjack with many different betting amounts. ● FREE CHIPS: Loads of free chips options every few hours! ● MISSIONS: Complete them all in every area and claim great rewards! ● WIN RINGS, BADGES &amp; ACHIEVEMENTS: Distinguish yourself by winning rings, badges and trophies with your poker skills! ● PLAY ALWAYS AND EVERYWHERE: Play poker on your mobile device and continue to play on your tablet, web, laptop and desktop. ● BONUS FOR CONNECTING WITH FACEBOOK: Earn extra chips and play poker with friends! ● CHAT: Talk with other hold em players through chat and animated emoticons. Use them to bluff or taunt and try to take down the pot! ● CERTIFIED RNG With GOP3 you can learn how to play hold em poker, raise the stakes and win more. Grab a deck of cards, memorize the poker hand ranking chart and know what the best starting hands in poker are. Even use the cheat sheet to increase your chances to win a fortune in chips. Be the shark at the table, ready to dominate the fish. Read your opponents' poker face and use your best poker strategy to outplay everyone. Know when to hold ’em, fold ’em, check and raise. ARE YOU READY TO GO ALL-IN? Dominate the online (PvP) Poker Tournament World Leaderboard, rule the Black Jack tables and win big time with free daily spins in the bonus slot machine. A huge jackpot awaits you in our social casino card games. Start betting now and may lady luck be on your side! Note: We love a fair game! We use industry standard RNG methods and never manipulate cards or favor certain players. This poker game is intended for an adult audience. (e.g Intended for use by those 18 or older) The games do not offer “real money gambling” or an opportunity to win real money or prizes (e.g the game is for entertainment purposes only). Practice or success at social casino poker gaming does not imply future success at “real money poker”. Gender is requested to let players select if they want to play with a male or a female presenting character.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/436150/header.jpg?t=1657108843",
    "Price": 0.0,
    "Developers": "Azerion,YoudaGames",
    "Publishers": "Azerion,Youda Games Holding B.V.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_06c38984f3d43ed1e0d2d8be6bcfb3f22ac1a0f5.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_c016d844883a1c3185442bd8bd57fd17e97d458f.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_f2dcefb5b6d00a76f47c8ea87272b1e1f8fe8de3.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_3197dac1000ab0c3924522519d83e3ffe8b2ea9d.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_696a688c8d196a38a76ee68e8f8e2e7e08a7ebcf.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_0baf8c97ea0dde3a89dc82b8266606ffacc198fc.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_ff6df66ed60743afd0380a5e637aca3ac62fd3c7.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_7e0f69fb5df57b89af31ab97933b7ccf194fca8a.1920x1080.jpg?t=1657108843,https://cdn.akamai.steamstatic.com/steam/apps/436150/ss_a1adb7da4e77b14cd07c43aded2d1424e529dbb3.1920x1080.jpg?t=1657108843",
    "Slug": "governor-of-poker-3",
    "Meta Title": "Governor of Poker 3: Feb 19, 2016, Azerion,YoudaGames and...",
    "Meta Description": "Looking for information on Governor of Poker 3? Check out the release date (Feb 19, 2016), developer insights from Azerion,YoudaGames, and a complete ga...",
    "Alt Text Image": "Official header image for Governor of Poker 3 game - Steam 436150",
    "Canonical URL": "https://gusku.site/game/governor-of-poker-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Governor of Poker 3\", \"description\": \"Looking for information on Governor of Poker 3? Check out the release date (Feb 19, 2016), developer insights from Azerion,YoudaGames, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Azerion,YoudaGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Azerion,Youda Games Holding B.V.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/436150/header.jpg?t=1657108843\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}