{
    "AppID": 421660,
    "Name": "Harmonia",
    "Release date": "Sep 22, 2016",
    "About the game": "Love is the one thing that will never hurt anyone. ＜STORY＞ This is a story of the distant future. An immense war left the world broken and torn. Ashes covered the sky, the land was stripped of vegetation, and water dried up. As a result, the human population drastically decreased. The remaining humans huddled together to survive. During this time, an emotions-capable robot known as a Phiroid woke up in a decayed factory. Prior to the war, science created these human-like robots capable of feeling emotion. As new partners for the humans, the Phiroids promised better lives for all of humanity. However, upon waking, this Phiroid soon realized that its emotions were not functioning. Its right hand lacked artificial skin and the mechanical parts showed how its production likely went unfinished. This young male Phiroid had an innate desire to be with humans. And so it began a journey to obtain its lost emotions, and wandered across this devastated world. One day, the Phiroid was discovered by a young girl. Thinking he was a human, she began to look after him. She brought him to a small, but pleasant town. While living with the young girl, the Phiroid slowly learned about emotions. What is Kinetic Novel? A new form of entertainment for the sole purpose of storytelling -- not a novel, not an anime, not a game -- Kinetic Novel. Made with the goal of providing the reader with an unprecedented sense of presence and empathy for the characters through the use of a high-quality scenario, graphics, music, and other production values. ＜CHARACTER＞ “The Emotionless Mechanical Boy” Rei This young boy awoke to find himself in the remains of what seemed to be a factory. His right hand lacks artificial skin as he had been abandoned mid-production. A glove always covers the exposed machinery. He wandered the ravaged landscape, following an innate desire to be with another human. Until one day, he was found by a young girl named Shiona. Shiona gave him the name Rei. “The Girl who Sings her Feelings” Shiona （CV：Kaori Mizuhashi） Shiona is the young girl who discovered Rei. She lives in a church located in one of the makeshift towns of this devastated world. Next to nothing can erase the smile from her face, and she is often found consoling others. She frequently refers to the feelings and emotions of people in terms of shapes and colors, which can be difficult to understand. She loves to sing and often performs in the church or the town square. “The Blue Little Lady from the Library” Tipi （CV：Misaki Kuno） This young girl lives in the town's library. For some reason, she is often found crying. In age of digital books, this strange place for storing physical copies still exists. Shiona calls her the “blue girl”. Although the townsfolk know about her, few venture anywhere near. ＜STAFF＞ Character Design &amp; Original Art : Itaru Hinoue. Scenario : Tsuzuru Nakamura / Kai Music : Shinji Orito / Ryo Mizutsuki Theme Music : “Todoketai Melody” Lyrics : Kai Composition : Shinji Orito Arrangement : Yuichiro Tsukagoshi (NanosizeMir) Vocals : Ayaka Kitazawa Insert Song : “Towa no Hoshi e” Lyrics : Kai Composition : Tomohiro Takeshita Arrangement : Meeon Vocals : Haruka Shimotsuki",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/421660/header.jpg?t=1649926904",
    "Price": 9.99,
    "Developers": "VisualArts/Key",
    "Publishers": "VisualArts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/421660/ss_74056217b08f0f94a08acb99df0468e0c7b39c49.1920x1080.jpg?t=1649926904,https://cdn.akamai.steamstatic.com/steam/apps/421660/ss_79953fc6f68b3a44dcffc035a2a6dbb952a53707.1920x1080.jpg?t=1649926904,https://cdn.akamai.steamstatic.com/steam/apps/421660/ss_ce2e2aba6a3b6b03b12246b64d867e893770d76d.1920x1080.jpg?t=1649926904,https://cdn.akamai.steamstatic.com/steam/apps/421660/ss_199712c4b792018d0fc9e9b5ffe46e93e33f68f5.1920x1080.jpg?t=1649926904,https://cdn.akamai.steamstatic.com/steam/apps/421660/ss_2fe4b894454ed760bb9dcba1bcb19aef72c7289e.1920x1080.jpg?t=1649926904,https://cdn.akamai.steamstatic.com/steam/apps/421660/ss_1c4f508d1563f1afd3027cba7cc9335b517dabad.1920x1080.jpg?t=1649926904",
    "Slug": "harmonia",
    "Meta Title": "Harmonia: Sep 22, 2016, VisualArts/Key and Full Overview",
    "Meta Description": "Looking for information on Harmonia? Check out the release date (Sep 22, 2016), developer insights from VisualArts/Key, and a complete game summary.",
    "Alt Text Image": "Official header image for Harmonia game - Steam 421660",
    "Canonical URL": "https://gusku.site/game/harmonia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Harmonia\", \"description\": \"Looking for information on Harmonia? Check out the release date (Sep 22, 2016), developer insights from VisualArts/Key, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"VisualArts/Key\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VisualArts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/421660/header.jpg?t=1649926904\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}