{
    "AppID": 1218550,
    "Name": "Hassle 1977",
    "Release date": "Nov 3, 2020",
    "About the game": "Break into the Baltic City and join the resistance force Free Breath! Show and prove your skills in PvP shootouts, PvE missions, online drift and street races among other players-rebels and earn respect among them! RETROWAVE AND CYBERPUNK 1977 year... Thanks to Intellectual Immensity Corp. (IIC) The future on earth came earlier than anticipated. New technologies are used everywhere, both in industry and in everyday life. In order to use all technologies, citizens need to undergo mandatory identification, i.e. implementation of the controller chip in brains. There are those people who do not accept these obligations. They call themselves the resistance force Free Breath. Rebels unite in all cities, gangs are forming to defend their freedom and prevent IIC from taking over the human mind! Some cities have been quarantined! Why? DIFFERENT GAMEMODES AND MISSIONS This world is not about one game mode! It consists of many different ones. Switch between them at any time! Exclusion zone SIBIRSK-5 - elimination battle, only best will win! Team Deathmatches for respect points Hustle Bustle… is it Battle Royale? Better ^_^ You need to fetch as much data as possible from servers and send this data faster than others. Only one wins! Street racing Drift racing Other exciting missions with game characters! And many more are on the way CUSTOMIZATION AND DETAILS Pick up your set: character outfit, vehicle, gun, armor perk and weapon perk! Character can use flashlight, can talk and eat! Cars must be refueled, repaired and painted! Guns and perks stats can be improved! Perks are all about flamethrower, protective bubble, invisible etc. Raise the character level and earn skill points! UNBELIEVABLE CONTROLS Characters can jump high and climb on the roofs of buildings or strafe forward using space shift. Cars can use headlights, turn on/off engine, use horn, alarm lights and sirens, change the radio, use NOS. There is detail HUD that shows speed, RPM and more! FREEROAM FOR FUN A whole unusual retrowave, soviet cyberpunk city to explore: shops with foods, equipment and cars, cinemas, gas stations, garages, cafes, charging stations, trampolines to go crazy with friends, medical and police stations, citizens on streets and much more! LEADERBOARDS Main Leaderboard – all about respect! Also each gamemode has its own leaderboard – become best at all of them or just at one gamemode! Weekly or All Time! TASTY FEATURES Crazy FXs Realistic car physics Realistic physics of world, including ragdoll and destructible objects 4 radio stations with exclusive soundtracks for the game Dynamic day/night and weather change system A unique universe at the junction of the past and the future Gamepad support Full cross-platform game! PCs, consoles and mobiles on same server, cloud save data between platforms! P.S. What will two gamers make if give them a great desire to create their own game? :3",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1218550/header.jpg?t=1608783440",
    "Price": 12.99,
    "Developers": "Limkernel Gamedev Gang",
    "Publishers": "Limkernel Gamedev Gang",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_d35a8c916ef96cd4f80f5d9692543d5645ae40cd.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_0c6e2a15816db451ec7b4d1e876488e15a08f243.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_8a27e24b0b86e9f3f3da34cc9e32e533627c1ae6.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_da9df797875f61dddac8b38eb3658436224b3109.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_8b50758666fb4c3182ed0d95e780781212bb4c66.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_a3782cbda9aca887d149f01d5e5f1a5ef552c60f.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_b51f279904bfecb9e1a44cb517fcb85f5e9a8efa.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_59b07fadb798ebbb58f3b9ecf0ecc333b7080a67.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_555a40302f64a8b23c30720b9aeb015c49c3e674.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_9683d8cfdb16b1d3057ac20355a1e51b4fe12cbd.1920x1080.jpg?t=1608783440,https://cdn.akamai.steamstatic.com/steam/apps/1218550/ss_7121241b86aad0f0b90b576e8fbfe67f9a740187.1920x1080.jpg?t=1608783440",
    "Slug": "hassle-1977",
    "Meta Title": "Hassle 1977: Nov 3, 2020, Limkernel Gamedev Gang and Full...",
    "Meta Description": "Looking for information on Hassle 1977? Check out the release date (Nov 3, 2020), developer insights from Limkernel Gamedev Gang, and a complete game su...",
    "Alt Text Image": "Official header image for Hassle 1977 game - Steam 1218550",
    "Canonical URL": "https://gusku.site/game/hassle-1977",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hassle 1977\", \"description\": \"Looking for information on Hassle 1977? Check out the release date (Nov 3, 2020), developer insights from Limkernel Gamedev Gang, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Limkernel Gamedev Gang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Limkernel Gamedev Gang\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1218550/header.jpg?t=1608783440\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}