{
    "AppID": 1012790,
    "Name": "Into the Radius VR",
    "Release date": "Jul 20, 2020",
    "About the game": "MAIN FEATURES Dozens of hours of slow-paced suspenseful survival. Diverse locations - natural, industrial and urban, with vast exploration potential. Requires tactical thinking, spatial and situational awareness - anything can decide the mission outcome: time of day, topography, enemy variety, weapon. Realistic handling of diverse classic and modern weapons with effect on gameplay. Unforgiving dystopian environment of the Pechorsk Anomaly Zone. Dangerous anomalies, moody atmosphere, and urban exploration. EXPLORE THE RADIUS There are miles and miles of forests, swamps, and crumbling industrial ruins for you to freely explore. But be careful: the Radius is filled with deadly anomalies dealing damage to anyone foolish or daring enough to get close. The place is swarming with hostile creatures - Fragments, Mimics, and more are roaming around 24/7 and will take every chance to let you know you are not welcome. Navigate with your realistic map, plan your route, climb over obstacles, scout out shelters, uncover loot caches, and try not to get killed. At least not too often. COLLECT AND FIRE REALISTIC GUNS Featuring a stunning variety of classic and modern firearms like the AKM Kalashnikov, PM Pistolet Makarova, SKS Carbine, M9 Beretta, PPSh, FN SCAR, and many more with matching ammo. Realistic interaction, manual magazine loading with different ammo types, and weapon attachments. Take care of your weapons – if they take damage or their condition deteriorates, they will begin to jam. Be sure to switch off the safety before you start firing! Realistic bullet physics causes ricochets, and bullets can penetrate different kinds of materials. Your only means of survival is to sneak around with your detector, hunt for artifacts, and complete the missions assigned via the vintage UNPSC desktop at the base. Stealth, silence, and planning are your trusty friends in the Radius Zone. Understand how to navigate the terrain, move slowly, take cover, crouch, sneak, and beware of the threats around you! Pack the right gear for your journey and plan ahead not to let your stamina and ammo run low. Use the realistic day and night cycle to your advantage - scavenge for loot and scout during the day, sneak around ­­­­­­­­and evade your enemies under cover of night. STORY In 1987, the 'Pechorsk Event' changed everything for the quiet Soviet mining town, leaving it devastated and unlivable, with dark ash floating in the air and a menacing red orb in the sky. By 2002, the United Nations Pechorsk Special Committee (UNPSC) still administered the exclusion zone around the Pechorsk Radius, and no one was allowed to enter aside from the UNPSC officials. You find yourself in the middle of the blighted zone cut from the outside world. Abandoned, but not completely desolate. Your guns and your wits are all you have left. Fight the deadly enemies, dodge dangerous anomalies, and collect wondrous artifacts on your way to the center of the Radius to find your way out. Regular updates and awesome community All Radius Explorers are welcome!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1012790/header.jpg?t=1658243429",
    "Price": 29.99,
    "Developers": "CM Games",
    "Publishers": "CM Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_db1c62f25abedb0307df05dd90e330c9c068d26d.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_6b7ded40c638333e5007b866dbccfa317a28c597.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_2023ca091eff69f21df79b5d157e058f5b59a77c.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_bcdff6ba001904ec316d5eae10dcaaff543b3b10.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_bbee660d2b13c19277aab75737b4c2bf5ab52c51.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_b75a317f2df254dc559f05cab07939039ec85df9.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_1383b29a081ecf351585026a9230aec2e263cafb.1920x1080.jpg?t=1658243429,https://cdn.akamai.steamstatic.com/steam/apps/1012790/ss_d749f745e9b78d62a1c95da804328033851df39e.1920x1080.jpg?t=1658243429",
    "Slug": "into-the-radius-vr",
    "Meta Title": "Into the Radius VR: Jul 20, 2020, CM Games and Full Overview",
    "Meta Description": "Looking for information on Into the Radius VR? Check out the release date (Jul 20, 2020), developer insights from CM Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Into the Radius VR game - Steam 1012790",
    "Canonical URL": "https://gusku.site/game/into-the-radius-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Into the Radius VR\", \"description\": \"Looking for information on Into the Radius VR? Check out the release date (Jul 20, 2020), developer insights from CM Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"CM Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CM Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1012790/header.jpg?t=1658243429\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}