{
    "AppID": 1814930,
    "Name": "Kurokami-sama's Feast",
    "Release date": "Jan 21, 2022",
    "About the game": "Story Domaru is a young manga artist just trying to survive after his work was discontinued. He joins a group dedicated to learning about spirits, yokai and the occult in order to find new material for his next story. But, there is one urban legend that especially catches his eye – the tale of Kurokami-sama. Domaru's curiosity takes hold, but he quickly learns there's wisdom to the phrase 'be careful what you wish for' when his investigation leads him to the real Kurokami-sama. She spares his life on one condition – he must hunt down the other yokai, slay them, and bring them back to her. But Kurokami-sama is as capricious as they come, and she won't hesitate to send Domaru to an early grave if he makes even a single mistake. Subject to the whims of a powerful yet beautiful creature, what will Domaru do? Serve her eternally, or fight for his freedom? Gameplay Kurokami-sama is a powerful being, shrouded in mystery, who has cursed you with the duty to hunt the otherworldly monsters that lurk in the dark corners of Tokyo. On your journey, you will meet a wide variety of supernatural entities from creatures of urban legends to beasts of ancient folklore. During your hunt for these monsters you'll have access to a parameter called 'spiritual energy' which can be used to read minds or launch devastating attacks. The player will have to decide when to strategically use this limited ability to overcome the obstacles and battles that you may face. Complete your tasks and you'll be rewarded, but Kurokami-sama can be as cruel as she is beautiful. It would be unwise to get on her bad side. Kurokami-sama's Feast is an adventure visual novel with mystery and danger around every corner. Players will explore the streets of Japan in search of clues to find the monsters that live among us. The cast of characters are brought to life with stunning artwork accompanied by a heart-pumping original musical score; with a memorable story by writer Takahiro, known for his work on Akame ga Kill, Majikoi, and Release the Spyce. The player's choices have real consequences that affect the outcome of the story. Will you find the monsters and please Kurokami-sama, or disobey her will and face her wrath? With multiple endings to experience, you'll want to replay the game to unlock them all.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1814930/header.jpg?t=1643354264",
    "Price": 12.99,
    "Developers": "みなとカーニバルWorld",
    "Publishers": "JAST USA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1814930/ss_448120049c4710f12a2f6d9341e7130cc97c60cb.1920x1080.jpg?t=1643354264,https://cdn.akamai.steamstatic.com/steam/apps/1814930/ss_d5817c1e6c5ea108cc238d3fdde0b58a76b37203.1920x1080.jpg?t=1643354264,https://cdn.akamai.steamstatic.com/steam/apps/1814930/ss_af2ee438444c76276614eb1fb6d23932a79d9ad8.1920x1080.jpg?t=1643354264,https://cdn.akamai.steamstatic.com/steam/apps/1814930/ss_a8e5ce0e084e888474fe4cd5c767614ae6cec7e6.1920x1080.jpg?t=1643354264,https://cdn.akamai.steamstatic.com/steam/apps/1814930/ss_e77f09de58824216e77f7937932ed39b39528df9.1920x1080.jpg?t=1643354264,https://cdn.akamai.steamstatic.com/steam/apps/1814930/ss_e1955d420abe856b9933a3a170cf8f1bbbfc2ac3.1920x1080.jpg?t=1643354264",
    "Slug": "kurokami-sama-s-feast",
    "Meta Title": "Kurokami-sama's Feast: Jan 21, 2022, みなとカーニバルWorld and Fu...",
    "Meta Description": "Looking for information on Kurokami-sama's Feast? Check out the release date (Jan 21, 2022), developer insights from みなとカーニバルWorld, and a complete game ...",
    "Alt Text Image": "Official header image for Kurokami-sama's Feast game - Steam 1814930",
    "Canonical URL": "https://gusku.site/game/kurokami-sama-s-feast",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kurokami-sama's Feast\", \"description\": \"Looking for information on Kurokami-sama's Feast? Check out the release date (Jan 21, 2022), developer insights from \\u307f\\u306a\\u3068\\u30ab\\u30fc\\u30cb\\u30d0\\u30ebWorld, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u307f\\u306a\\u3068\\u30ab\\u30fc\\u30cb\\u30d0\\u30ebWorld\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JAST USA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1814930/header.jpg?t=1643354264\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}