{
    "AppID": 1371270,
    "Name": "LA ULTIMA COMIDA",
    "Release date": "Sep 13, 2020",
    "About the game": "Our protagonist returns to his town the same day that a very important local holiday is celebrated, when he is about to arrive there is a strange and completely abandoned police blockade, he goes down to check what is happening and he is enveloped by a group of very aggressive people being able to flee until entering the nearest compound in search of refuge. HISTORY: #La ULTIMA COMIDA.- At a culinary festival in a small town, someone has mistaken a very powerful and evil ancient spell for a food recipe, whose spell seems to rip out the souls of certain people turning them into real zombies. The Player must survive this nightmare and escape to safety. MISSION 1 - The Factory: Your mission in that factory will be to eliminate all the Zombies while the factory security guard who is the only survivor, prepare everything you need to leave that factory in search of a safer place, as you increase the number of zombies They will be stronger and faster, but don't worry, your new friend will lend you his weapons so that you can face those hordes of zombies. MISSION 2 - The village: Your mission in that town will be to find refuge and defend it from all the Zombies that try to destroy it, and you will also have to gather clues to find out what happened. Although the zombies are increasingly abundant and strong, you should not worry, in this town you will find an armory and artifacts that will greatly increase your chances of surviving from this nightmare. GAME MODE: You have at your disposal 6 firearms, 1 melee weapon, 4 objects that you can place on the stage, on the first map you have a mix of gameplay between waves of enemies, defend objectives and solve puzzles with the final Boss in the final horde. The set contains: - First person gameplay - 6 Weapons (2 pistols, 1 SMG, 1 Automatic rifle, 2 Shotgun) - 1 Laser Gun - Flashlight on long guns - Claymore Trap - Barbed Wire Trap - Wooden barricade - Decoy music box - Incinerator - Automatic turret - Zombies - Bosses",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1371270/header.jpg?t=1640717524",
    "Price": 3.99,
    "Developers": "Troyar",
    "Publishers": "Troyar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1371270/ss_4517e4b3b59f54d5690159db0268e6c7888cc185.1920x1080.jpg?t=1640717524,https://cdn.akamai.steamstatic.com/steam/apps/1371270/ss_1bc33d07abd6a4b749ee100c6eccae77175e25a0.1920x1080.jpg?t=1640717524,https://cdn.akamai.steamstatic.com/steam/apps/1371270/ss_8b91a1edd89cac5315484888670884a7f5c8fcab.1920x1080.jpg?t=1640717524,https://cdn.akamai.steamstatic.com/steam/apps/1371270/ss_558c01db65801a360e620c0dd81618edccb6305c.1920x1080.jpg?t=1640717524,https://cdn.akamai.steamstatic.com/steam/apps/1371270/ss_1ab4abfb49fc5b5b755b4a6ed7ce1c39a2b9f8c7.1920x1080.jpg?t=1640717524",
    "Slug": "la-ultima-comida",
    "Meta Title": "LA ULTIMA COMIDA: Sep 13, 2020, Troyar and Full Overview",
    "Meta Description": "Looking for information on LA ULTIMA COMIDA? Check out the release date (Sep 13, 2020), developer insights from Troyar, and a complete game summary.",
    "Alt Text Image": "Official header image for LA ULTIMA COMIDA game - Steam 1371270",
    "Canonical URL": "https://gusku.site/game/la-ultima-comida",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LA ULTIMA COMIDA\", \"description\": \"Looking for information on LA ULTIMA COMIDA? Check out the release date (Sep 13, 2020), developer insights from Troyar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Troyar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Troyar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1371270/header.jpg?t=1640717524\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}