{
    "AppID": 1617160,
    "Name": "Mad Wild Fairy Tale",
    "Release date": "Oct 24, 2021",
    "About the game": "Take control of the undead king. Manage your legacy domain and protect it from mortal trespassers. Mad Wild Fairy Tale is an Action RPG Strategy with hardcore survival and PvP-Invasion mechanics. The game is set in a beautiful dark fantasy world. This game was created by hardcore gamer for people who love unordinary games like The Horde, Dungeon Keeper and Mighty Quest For The Epic Loot with many Action-RPG elements. Action RPG mechanics - The Undead King has 3 active talent trees, changing your main combat skills. - Each second level you can allocate a passive skill. Passive skills affect your domain, units and hired heroes. - Each second level you can also allocate a passive PvP skills. Passive skills affect your 9 PvP abilities. When you attack someone else's domain, you get a PvP-panel with skills. - Loot-System is not limited to equipment and resources. As you kill monsters, you will receive items that allow you to better protect your character and to kill stronger foes. You can also find quests, tower plans, trap scrolls and various potions. Helmet, armor, weapons, shields, back, boots, gloves and pants - change the appearance. - Your units and hired heroes also have passive and wave skills. Units gain experience, can be promoted and have an unlimited level limit. Strategy mechanics: - You can manage, destroy, level up almost everything what you see. - The strategic aspect in the game is no less important than the Action RPG element, over time your character will not be able to keep fighting on all fronts, so it is very important to plan every peace of your domain. - You can summon traps, buildings, walls, floors, pillars, fences, barricades, towers and many other useful objects. - The game is full of hidden mechanics. Everything around you has some meaning or set of rules. - Use trees as a 'wiki'. - Learning by doing. Survival and hardcore mechanics: - If you or your forest heart dies, you will start from the beginning. Your character reaches immortality only after level 10 and instead loses experience. - Game is very difficult. - Various mechanics of how to play and win and let the other player lose! (see next paragraph.) Enemy Domain Attack (Asynchronous multiplayer) system: - You can attack enemy domain. - You can attack your own domain (try defence and skills). - PvP attack is asynchronous, when the destruction of the enemy's forest or its individual parts, your opponent does not lose anything. If your character is killed in someone else's domain, he is revived again in your forest. PvP-Invasion (Asynchronous multiplayer) system: - Your mushrooms are linked to other players domain, so you can send various trespassers to enemy lands. There are many ways to send a squad or group of trespassers to any Steam player. - There is also a new feature for streamers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1617160/header.jpg?t=1641834980",
    "Price": 19.99,
    "Developers": "Morozov Sergey",
    "Publishers": "Morozov Sergey",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1617160/ss_1b66aa0046888cb07771166546e6b45d6a645fa2.1920x1080.jpg?t=1641834980,https://cdn.akamai.steamstatic.com/steam/apps/1617160/ss_715d7d25b928e9fd36ee14a61bbe693a3cee2772.1920x1080.jpg?t=1641834980,https://cdn.akamai.steamstatic.com/steam/apps/1617160/ss_b7702e7d52cee1cd5ed055286d4dd2835e148d2b.1920x1080.jpg?t=1641834980,https://cdn.akamai.steamstatic.com/steam/apps/1617160/ss_35a4d56e0b6b42f8bbe69f93a8cbf0cc26cb905b.1920x1080.jpg?t=1641834980,https://cdn.akamai.steamstatic.com/steam/apps/1617160/ss_38767d3a6e0404e66073bb162e7b4ddbd6eb55b6.1920x1080.jpg?t=1641834980,https://cdn.akamai.steamstatic.com/steam/apps/1617160/ss_27b379080697986406ade6ace2b869d7aac3b02b.1920x1080.jpg?t=1641834980",
    "Slug": "mad-wild-fairy-tale",
    "Meta Title": "Mad Wild Fairy Tale: Oct 24, 2021, Morozov Sergey and Ful...",
    "Meta Description": "Looking for information on Mad Wild Fairy Tale? Check out the release date (Oct 24, 2021), developer insights from Morozov Sergey, and a complete game s...",
    "Alt Text Image": "Official header image for Mad Wild Fairy Tale game - Steam 1617160",
    "Canonical URL": "https://gusku.site/game/mad-wild-fairy-tale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mad Wild Fairy Tale\", \"description\": \"Looking for information on Mad Wild Fairy Tale? Check out the release date (Oct 24, 2021), developer insights from Morozov Sergey, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Morozov Sergey\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Morozov Sergey\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1617160/header.jpg?t=1641834980\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}