{
    "AppID": 1238000,
    "Name": "Mass Effect™: Andromeda Deluxe Edition",
    "Release date": "Jun 11, 2020",
    "About the game": "Mass Effect™: Andromeda takes players to the Andromeda galaxy, far beyond the Milky Way. There, you'll lead the fight for a new home in hostile territory as the Pathfinder - a leader of military-trained explorers. This is the story of humanity’s next chapter, and your choices throughout the game will ultimately determine humanity's survival. Play as the Pathfinder - a leader of a squad of military-trained explorers - with deep progression and customization systems. This is the story of humanity’s next chapter, and your choices throughout the game will ultimately determine our survival in the Andromeda Galaxy. As you unfold the mysteries of the Andromeda Galaxy and the hope for humanity lies on your shoulders – You must ask yourself… How far will you go? Key Features: Return to the Mass Effect universe. Lead the first humans in Andromeda on a desperate search for our new home. In this new chapter of Mass Effect, meet and recruit all-new, interesting characters caught up in an epic space saga filled with mystery and galactic conflict. Fight for survival. Battle with your Pathfinder team against terrifying enemies and creatures. New additions like destructible environments, boosted jumps for added verticality, and all-new weapons and Biotics make combat more thrilling than ever. Build your hero. Create a formidable hero with amazing weapons, powers and tech. A much more flexible skill and weapon progression tree means you can replicate your play style to make you unstoppable against new, powerful alien enemies. Explore a new galaxy. Chart your own course in a dangerous new region. Unravel the mysteries of the Andromeda galaxy as you discover rich, alien worlds in the search for humanity’s new home. The Deluxe Edition contains: Deep Space Explorer Armour. Looking for armour that can stand up to anything a brand new galaxy can dish out? With the Deluxe Edition, you'll get to gear up with Deep Space Explorer Armour. Nomad Skin (3). Make sure your Nomad really stands out while you're exploring mysterious new planets with this unique skin. Multiplayer Booster Pack. Jump-start your multiplayer co-op play with a booster pack. Includes five 50% XP Boosters (entitled instantly, limit 1 per match). Pathfinder Casual Outfit (2). Nobody wants to wear their uniform 24/7. Whether you're relaxing aboard the Tempest or exploring a friendly space dock, this casual outfit will help you look your best. Scavenger Armour. Stand out from the crowd, even when you're planetside on a deadly new world. Pathfinder Elite Weapon Set (4). Ditch the standard gear and go Elite. Battle your way through Andromeda with this unique set of weapons. Pet Pyjak. Everyone’s favourite space monkey is back and can join you aboard the Tempest. Digital Soundtrack. Kick back and enjoy the incredible music of Mass Effect anywhere you go with this digital download. Multiplayer Deluxe Launch Pack. Get a head start on Day 1 co-op play with the Multiplayer Launch Pack, which includes items to kick start your progress (entitled instantly). Asari Adept Multiplayer Recruit Pack. Lightly armored, with a focus on biotics as the primary form of attack and defense, Asari specialize in crowd control and damage. Turian Soldier Multiplayer Recruit Pack. The Turian soldier is a tough and versatile powerhouse. The soldiers’ primary tools are their weapons, but a Turian may utilize advanced armor technology to gain an edge in the fight. Multiplayer Deluxe Launch Pack. Get a head start on Day 1 co-op play with the Multiplayer Launch Pack, which includes items to kick start your progress (entitled instantly).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1238000/header.jpg?t=1614943532",
    "Price": 29.99,
    "Developers": "BioWare",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1238000/ss_3bebdd5c7575faf743e28ecbf51d73cbcea491a3.1920x1080.jpg?t=1614943532,https://cdn.akamai.steamstatic.com/steam/apps/1238000/ss_7cf27c2a247bb46834764760b7e4a30afa785ba9.1920x1080.jpg?t=1614943532,https://cdn.akamai.steamstatic.com/steam/apps/1238000/ss_016aed121b497aa916a69b6e33d15ab8371c4283.1920x1080.jpg?t=1614943532,https://cdn.akamai.steamstatic.com/steam/apps/1238000/ss_fcc2e4827d905d971e2d1a5e0e23dc0be050cc7f.1920x1080.jpg?t=1614943532,https://cdn.akamai.steamstatic.com/steam/apps/1238000/ss_e52cf8501ae5f6fed1a45d81e000877a4f5b6aff.1920x1080.jpg?t=1614943532",
    "Slug": "mass-effect-andromeda-deluxe-edition",
    "Meta Title": "Mass Effect™: Andromeda Deluxe Edition: Jun 11, 2020, Bio...",
    "Meta Description": "Looking for information on Mass Effect™: Andromeda Deluxe Edition? Check out the release date (Jun 11, 2020), developer insights from BioWare, and a com...",
    "Alt Text Image": "Official header image for Mass Effect™: Andromeda Deluxe Edition game - Steam 1238000",
    "Canonical URL": "https://gusku.site/game/mass-effect-andromeda-deluxe-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mass Effect\\u2122: Andromeda Deluxe Edition\", \"description\": \"Looking for information on Mass Effect\\u2122: Andromeda Deluxe Edition? Check out the release date (Jun 11, 2020), developer insights from BioWare, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"BioWare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1238000/header.jpg?t=1614943532\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}