{
    "AppID": 1708460,
    "Name": "Obsideo",
    "Release date": "Aug 27, 2021",
    "About the game": "Obsideo is a 1-4 player online co-op psychological horror, where you and your team of priests explore different locations experiencing paranormal events in an attempt to figure out what ghost they're dealing with and exorcise it from the property. You will use your ghost hunting equipment, along with a 'Ghostpedia' to try and locate where the ghost is, and the type of ghost you're dealing with. Obsideo focuses more on paying attention to context clues and what the ghost looks like, and how it interacts with the environment, as opposed to finding specific item clues and basing everything off that, this allows for a lot more replayability and keeps each playthrough unique. I also wanted everything to revolve around exorcisms, therefor every item that the ghost interacts with (Spirit box, EMF, Geiger Counter), all changes how you approach an exorcism. There are currently over 55 ghost interactions in the game, these range anywhere from a subtle move of a plate, or disembodied breathing, through to the ghost completely smashing walls, or making it rain blood. You need to pay close attention to what the ghost is doing, as it tells you exactly what ghost you're dealing with. Terrifyingly Realistic Ghost AI: Not only can they always hear you, but the ghosts will use their own knowledge of the house against you and attempt to cut you off or trap you in dead zones with nowhere to hide or escape. Unique Ghosts: Over 15 different ghosts planned for you to try and exorcise, all with different traits, personalities, and abilities. Equipment: Use popular ghost hunting equipment, such as EMF Readers, Thermometers, and RemPods to make contact with the ghost, and find out how to exorcise it from the house. Immersive Experience: All our houses are modeled to scale off real-world houses, along with having life-like graphics, Obsideo also features realistic ambient sounds that will completely immerse you within its world. Intent Recognition: Talk to the ghosts with your real voice through your microphone and they will completely understand almost everything you say, along with deciding exactly how they want to reply to that.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1708460/header.jpg?t=1645232698",
    "Price": 11.99,
    "Developers": "Kyle's Garage",
    "Publishers": "Kyle's Garage",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_c67cca3316a15b22b1a310185c43a27060b8be96.1920x1080.jpg?t=1645232698,https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_843778be24405ab2038edaf725966a152ef5586c.1920x1080.jpg?t=1645232698,https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_49fee2effb248d38a72191b343a36577bf71fa49.1920x1080.jpg?t=1645232698,https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_59f176d28d4724e13d5be3999edfde570dc34db9.1920x1080.jpg?t=1645232698,https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_c2eddc1b00fbb7eab47fba50f0ca567bad5a8e4d.1920x1080.jpg?t=1645232698,https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_bcff19f2ef7afcfe6c674885644e2bab37189061.1920x1080.jpg?t=1645232698,https://cdn.akamai.steamstatic.com/steam/apps/1708460/ss_5b9cc8b5493222b0263e49f6b5b737f7a5ac11c3.1920x1080.jpg?t=1645232698",
    "Slug": "obsideo",
    "Meta Title": "Obsideo: Aug 27, 2021, Kyle's Garage and Full Overview",
    "Meta Description": "Looking for information on Obsideo? Check out the release date (Aug 27, 2021), developer insights from Kyle's Garage, and a complete game summary.",
    "Alt Text Image": "Official header image for Obsideo game - Steam 1708460",
    "Canonical URL": "https://gusku.site/game/obsideo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Obsideo\", \"description\": \"Looking for information on Obsideo? Check out the release date (Aug 27, 2021), developer insights from Kyle's Garage, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kyle's Garage\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kyle's Garage\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1708460/header.jpg?t=1645232698\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}