{
    "AppID": 348280,
    "Name": "ORBIT",
    "Release date": "Sep 30, 2015",
    "About the game": "*Warning: ORBIT is a local multiplayer only game. No single player or online is available. Anyway it's a totally nuts game, grab some friends and try it!* BOOOOM, SPACEWRECK! Maneuver your ship between planets at breakneck speeds and take gravity into account as you crush your competitors with an epic spaceship arsenal. Use special abilities like shields and teleportation to defeat your enemies, and level up between fights as the madness intensifies in this twin-stick multiplayer space brawler! Duke it out in a big selection of game modes, and discover a tech-tree with countless options and different paths. Engage in fierce and swift-flowing combats, or design your own battles with the custom game mode, in which you can choose and set up the victory conditions, orbitals on your map and the length of the matches. Want more? Try the random map generator! Features Crazy local multiplayer for 2-4 players couch-powered madness 9 game modes: Capture, Kill, Survive, Mayhem and MORE! Randomly generated maps for a fresh experience every game Design and create your own modes and battles with Forge Level-up system with spaceship upgrades and paths for total customization Super hot particle infused graphics Thrilling soundtrack by Wierz Bare-knuckled orbital amusement Game modes Tournament Modes: Destroy: Crush the enemy with brutal force in this straight up brawl. First to wreck 10 kills wins! Annihilate: Carefully outmaneuver your competitors in this insanely nerve-wracking climb to the top! You must be the last wartorn survivor to win. Conquer: In conquer you must elegantly keep track of all elements of the map, and use gravity to your advantage. Capture zones of extreme gravity to win! Survive: Face your rivals... and an insane amount of asteroids. The longest surviving spaceship wins! Mayhem Modes: Knifeparty: Every spaceship is equipped with an epic space-warping katana. Teleport over the enemy to split his spaceship in two! Tennis: In tennis the spaceships all have huge shields capable of ricocheting even the fastest rockets! Squash: When playing the squash mode all rockets bounce off the walls. Madness ensues! Rocketfest: Upon impact, all rockets duplicate to achieve exponential fun and destruction! Homing: Do you think you can avoid the rockets? Now they home in on the enemy... and you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/348280/header.jpg?t=1447368636",
    "Price": 6.99,
    "Developers": "4Bit Games",
    "Publishers": "4Bit Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/348280/ss_7bd9b6e7c21923c134dec85052da569cb9ed4879.1920x1080.jpg?t=1447368636,https://cdn.akamai.steamstatic.com/steam/apps/348280/ss_31eb78284f89da75a394fb89381e47b67ea6551a.1920x1080.jpg?t=1447368636,https://cdn.akamai.steamstatic.com/steam/apps/348280/ss_ad129cd388a9f1986c83db125bc3938e20f2b7aa.1920x1080.jpg?t=1447368636,https://cdn.akamai.steamstatic.com/steam/apps/348280/ss_f0c293470523ae57f7f2c2bd9d46c93664af8170.1920x1080.jpg?t=1447368636,https://cdn.akamai.steamstatic.com/steam/apps/348280/ss_2dc4d59eaeceddb9fd965944abf8dda87835f55e.1920x1080.jpg?t=1447368636,https://cdn.akamai.steamstatic.com/steam/apps/348280/ss_4294bb76604bcf293b3308144791294e728b60fb.1920x1080.jpg?t=1447368636",
    "Slug": "orbit",
    "Meta Title": "ORBIT: Sep 30, 2015, 4Bit Games and Full Overview",
    "Meta Description": "Looking for information on ORBIT? Check out the release date (Sep 30, 2015), developer insights from 4Bit Games, and a complete game summary.",
    "Alt Text Image": "Official header image for ORBIT game - Steam 348280",
    "Canonical URL": "https://gusku.site/game/orbit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ORBIT\", \"description\": \"Looking for information on ORBIT? Check out the release date (Sep 30, 2015), developer insights from 4Bit Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"4Bit Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"4Bit Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/348280/header.jpg?t=1447368636\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}