{
    "AppID": 1602930,
    "Name": "Pedro's Adventures in Spanish [Learn Spanish]",
    "Release date": "Jul 29, 2021",
    "About the game": "So you've learned some basic Spanish? And you're ready to be immersed in a Spanish speaking world of adventure? Then take control of Pedro as he travels across the kingdom, solving puzzles, making friends and defeating monsters. His journey to save the princess mirrors your journey into learning Spanish! Pedro's Adventures in Spanish is designed to be entirely in Spanish with no in-game translations and will be useful regardless of your native language. All interface, dialogue and narration is in simple Spanish accompanied by carefully designed images and animations to help you understand the game play and objectives. This is not a classroom, there are no quizzes or word matching exercises. The purpose of this game is to provide a fun but challenging environment for you to practice and learn through immersion. Just how we learn our native languages! FEATURES Dozens of unique characters fully voice acted by native Spanish speakers Auto-saved progress and no death mechanic encourages experimentation without risk Over 4000 lines of in-game Spanish dialogue Approximately 10-20 hours of game play (depending on experience level) FREQUENTLY ASKED QUESTIONS 'Is this game for beginners?' No... *unless* you're very serious about learning Spanish through immersion, enjoy a challenge, and are willing to learn as you go. This game is particularly useful for people who have a very basic level of Spanish and want to put what they're learning into practice while improving their vocabulary. You'll get the best results if you spend a few weeks or months learning the basics before starting this game. 'How is this different to just playing any regular game in Spanish?' Games with language simple enough for beginners typically don't require much language comprehension to play. (Eg: most action platformers.) And narrative driven games have a lot of dialogue which is too advanced for learners. It's also rare to find those games with full audio dialogue transcribed into other languages. Pedro's Adventures uses simple language designed for beginners and accompanied by helpful imagery. That said, we would recommend that you try playing some of your favorite RPGs in Spanish. If you are able to understand all your objectives then congratulations! Your Spanish is already quite excellent. 'Everything is in Spanish without translation? Won't I feel overwhelmed?' Sometimes, yes! But don't be discouraged, you can absolutely complete this game even if you don't understand every word that's being said. If you can persevere you'll find that you're still able to understand your objectives and how to achieve them. New language learners often find themselves quite overwhelmed when first attempting to interact in the language they’re studying. This is a natural part of the process. Just watch for keywords and context, and don't be afraid to experiment! 'Will this be useful if I want to learn Spanish from Spain (Castilian)?' In short, yes. Especially if you are a beginner. The script and voice performances were done by Latin American Spanish speakers but most of the common verbs and nouns are the same in both variations of the language. Even though some of the words in the game might be less commonly used in Spain, Spaniards and Latinos are typically able to understand each other perfectly. 'Will you be releasing this game in other languages as well?' If there is sufficient support for Pedro's Adventures then we intend to release it for other languages starting with the romance languages (French, Italian, Portuguese etc) and then eventually in Asian languages (Japanese, Mandarin Chinese, Korean etc). 'Will it be available on other platforms? (macOS, Android, consoles etc)' Initially it will only be available for Windows PC, but if there is sufficient demand for it then down the track we'd love to port the game to macOS, Linux, consoles and mobile devices. A WORD FROM THE CREATORS Pedro's Adventures in Spanish is one of many resources you should use when learning a language and is particularly useful for learning common nouns, verbs and pronunciation. We recommend playing it in conjunction with resources that focus on teaching the nuances of grammar and verb conjugation. ROCKET BOY GAMES is an independent games studio with the objective of providing fun alternatives to your language learning experience. This is our first commercial release and with enough support we hope to create a variety of language learning games for Spanish along with other languages. We hope you will be part of that journey. Buena suerte. Chaz and Andrea Rocket Boy Games",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1602930/header.jpg?t=1641696083",
    "Price": 19.99,
    "Developers": "Rocket Boy Games",
    "Publishers": "Rocket Boy Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_20ae4858f6d54d24eb8a040019a178ace17c0bbb.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_de9e8d61f9bfecd5e92f43c0d3bdfe19ea270e83.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_57ad7f79c33bdaa7e837e8ba086dd0c9cb284334.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_e3f19d54c9edeed7b2708b9dd04b7e56a2e01678.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_87060d01027c3bb9d2dd24c619e5a2ecfe696797.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_fd88b83c111b9ec82cf3ed6780bbf0fec6cc761f.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_b7145923af38def2b431e9bc026221ff1ee1f526.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_7e86830282bcadbdbbca9ba0793a7f8da073d2e8.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_0d8afb3477f150c5fe1898d4994c98652b3c398f.1920x1080.jpg?t=1641696083,https://cdn.akamai.steamstatic.com/steam/apps/1602930/ss_a12d0d498f906eababa72d68e9459e1364542426.1920x1080.jpg?t=1641696083",
    "Slug": "pedro-s-adventures-in-spanish-learn-spanish",
    "Meta Title": "Pedro's Adventures in Spanish [Learn Spanish]: Jul 29, 20...",
    "Meta Description": "Looking for information on Pedro's Adventures in Spanish [Learn Spanish]? Check out the release date (Jul 29, 2021), developer insights from Rocket Boy ...",
    "Alt Text Image": "Official header image for Pedro's Adventures in Spanish [Learn Spanish] game - Steam 1602930",
    "Canonical URL": "https://gusku.site/game/pedro-s-adventures-in-spanish-learn-spanish",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pedro's Adventures in Spanish [Learn Spanish]\", \"description\": \"Looking for information on Pedro's Adventures in Spanish [Learn Spanish]? Check out the release date (Jul 29, 2021), developer insights from Rocket Boy ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rocket Boy Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rocket Boy Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1602930/header.jpg?t=1641696083\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}