{
    "AppID": 1512860,
    "Name": "Pixelot",
    "Release date": "Mar 31, 2021",
    "About the game": "Defeat monsters, collect heroes, and solve puzzles in Pixelot, the single player turn based RPG that combines the combat of classic role playing games, the team building of monster collecting games, and the dungeons of adventure games. - The turn based combat system in Pixelot is very familiar with most players, but adds features such as combo skills, damage over time effects, stat upgrades, and a cooldown system for your most powerful skills. - Pixelot has a very easy to understand gearing and upgrading system that allows players to customize their characters and what items they want to invest in. Because of the number of playable classes available in the game, players each have their own unique team and experience in Pixelot. - The game also features dungeons with sliding ice puzzles, mine cart riddles, and more. - Pixelot is designed to be a game that is really easy to pick up and play whenever and where ever with features like auto save, party healing after each fight, and a quest log to remind you where you left off. Pixelot is truly a love letter to classic rpgs, and the greatness that was the 90's and 2000's eras. The story in Pixelot follows your custom character that is pulled into this world by the mysterious figure Astrum. After years of peace since the dark lord was sealed away by the 6 elemental crystals, his touch on the world is growing stronger each day. The player must venture out into this unknown world, making many allies, protecting villages from wolves and monsters, overthrowing corrupt leaders, and passing many trials of strength, patience and virtue. Build your army Make the story your own by Creating a custom character from 6 classes 30+ unique recruitable characters and classes Promote your characters to new classes at level 60 Save the world Collect the 6 elemental crystals 15 dungeons to explore 500+ items, 250+ maps, and 200+ chests to collect Continue the journey Infinite tower dungeon with 50 unique floors 14 Boss challenge mode Collect all 6 legendary weapons Post-game labyrinth dungeon Music is developed by Kairi Sawler, Aaron Krogh, Nashlaga, Karstenholymoly, and Stefan Kartenberg. Please check the wiki to learn more about them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1512860/header.jpg?t=1643228042",
    "Price": 5.99,
    "Developers": "Kyle Berger",
    "Publishers": "Kyle Berger",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_31eb90517fa50cba97bca4a679ca760ed2f4b48f.1920x1080.jpg?t=1643228042,https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_ab0b371b90b7b9d11c9d28c0c8bc4cf69aa096de.1920x1080.jpg?t=1643228042,https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_ef84597c9c9ae63a3e55f68775aa6b72aa5c009b.1920x1080.jpg?t=1643228042,https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_6269a92ae1ef702de4516f0e742c35389598f0e3.1920x1080.jpg?t=1643228042,https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_cb950afe1dcc203b1ebe2699a1f93f589dc5e379.1920x1080.jpg?t=1643228042,https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_918c62786bf9611b3186c81dfa2e1c4fe821500c.1920x1080.jpg?t=1643228042,https://cdn.akamai.steamstatic.com/steam/apps/1512860/ss_9fce71e02f6c3a0647aab414eafba267e24a822b.1920x1080.jpg?t=1643228042",
    "Slug": "pixelot",
    "Meta Title": "Pixelot: Mar 31, 2021, Kyle Berger and Full Overview",
    "Meta Description": "Looking for information on Pixelot? Check out the release date (Mar 31, 2021), developer insights from Kyle Berger, and a complete game summary.",
    "Alt Text Image": "Official header image for Pixelot game - Steam 1512860",
    "Canonical URL": "https://gusku.site/game/pixelot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pixelot\", \"description\": \"Looking for information on Pixelot? Check out the release date (Mar 31, 2021), developer insights from Kyle Berger, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kyle Berger\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kyle Berger\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1512860/header.jpg?t=1643228042\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}