{
    "AppID": 1124180,
    "Name": "Rail Route",
    "Release date": "Jun 23, 2021",
    "About the game": "Enter the world of rail networks and become the dispatcher of your dreams! Rail Route is a management and tycoon game based on railroad dispatching, offering relaxed, easy to understand (but hard to master) gameplay. Create the route of your dreams in a world where you set the pace, and embark on an ever-expanding railway extravaganza. That’s not all, though - Rail Route offers three, unique game modes : so no matter what you’re looking for, we’ve got it! Rush Hour Looking for something a bit more intense? Rush Hour is our ultra-streamlined wave-based game mode, designed for exactly that. Dispatch your way through wave-after-wave of trains, each one increasing in difficulty. Utilise a limited number of items as best you can - and make sure you don’t take too long! Timetable Mode Looking for a challenge, or something a bit more linear? Scored maps are puzzle levels with a pre-set train schedule and track layout. You have one goal, and one goal only: get your trains to their destinations on time! Dynamic scoring system Hand-made timetables – including both famous, and innovatively imagined, junctions and layouts Ensure that your trains arrive, and are dispatched, on time Go ahead and compete for the high score! Endless Maps Endless Mode is Rail Route’s primary game mode. Expand your rail technology, unlock new trains (and types!), discover new stations (and lucrative contracts), and see how big your network can grow! Accept multitudes of commercial contracts, and choose the type of traffic you want to see on your routes Schedule your trains and make sure that they stick to their timetables Expand your rail network and build new, innovative components and buildings Earn rewards – money &amp; experience points Unlock upgrades – improve your technology and dispatch interface Automate – build sensors, automatic routers and mechanize your network More than a thousand maps on the Workshop Have your own grand plans for a scored map? Looking to subject the community to your own wild machinations? You can! Rail Route comes with a built-in level editor - you’ve got access to the same tools we do! Recreate your favorite junction, build your hometown from scratch or design a rail network of your own. It's up to you! Also, don't forget to share your creation through the Steam Workshop! We hold frequent competitions! More to come Is that all? Of course not! There are a ton of other ideas we've been throwing around for updates later in Rail Route’s life. Most of our ideas come from the community, so feel free to pop into our Discord server if you've got any suggestions! (We’re friendly, we promise!) As always, happy dispatching!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1124180/header.jpg?t=1658151737",
    "Price": 19.99,
    "Developers": "Bitrich.info",
    "Publishers": "Bitrich.info",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_461ded0441715d11287f51021496e719d04c404a.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_07edf003b4bfa613712f3242147ba3fa7d239d49.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_717ae5034500e3704db74cf7cf3c99b190232b83.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_5dd10073cd3035c4892071d9709e3b6ff0ed261c.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_56a7e1c10515aa250c1a9b54325e70071fbe1870.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_8fd4c4c1c5d194e0d777707789301788826f6817.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_a0b76b357de6374829864a6ba05f8ee0ca8289ee.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_d130ab1a59c0e1821913ee0178bdef6bb2a2318d.1920x1080.jpg?t=1658151737,https://cdn.akamai.steamstatic.com/steam/apps/1124180/ss_b1c42557eeab142130e2485188af67bf77cb53ea.1920x1080.jpg?t=1658151737",
    "Slug": "rail-route",
    "Meta Title": "Rail Route: Jun 23, 2021, Bitrich.info and Full Overview",
    "Meta Description": "Looking for information on Rail Route? Check out the release date (Jun 23, 2021), developer insights from Bitrich.info, and a complete game summary.",
    "Alt Text Image": "Official header image for Rail Route game - Steam 1124180",
    "Canonical URL": "https://gusku.site/game/rail-route",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rail Route\", \"description\": \"Looking for information on Rail Route? Check out the release date (Jun 23, 2021), developer insights from Bitrich.info, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bitrich.info\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bitrich.info\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1124180/header.jpg?t=1658151737\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}