{
    "AppID": 352290,
    "Name": "Rapture Session & Pro",
    "Release date": "Apr 28, 2015",
    "About the game": "Rapture Session Rapture Session offers a sleek, simple interface powered by the premium sounds of Rapture Pro, expandable with our ever-growing list of sound packs. Rapture Session is bundled with Cakewalk's SONAR Digital Audio Workstation. This synth comes stock with nearly 4GB of sounds from pro sound designers, 11 Instrument categories, and an Instrument Page suited for live performance. Rapture Session is compatible with any VST-compatible DAW including SONAR, Music Creator, Cubase, FL Studio, Studio One, and more. Key Features of Rapture Session: Library of handpicked sounds from Rapture Pro Simple, streamlined interface optimized for users of all skill levels 2-click MIDI Mapping for quick controller assignments Excels in live and studio applications Powerful Instrument Window with MIDI-assignable Macro Knobs, X-Y Pads, and Vector Mixer for excellent tone shaping control Supports Windows Universal DAW compatibility with VST, and AAX versions Access quality sounds instantly with sort and search browser functionality Compatible with all Dimension Pro, Rapture, and Cakewalk Sound Center libraries and expansions Upgradable to Rapture Pro for the ultimate synth experience Rapture Pro Rapture Pro is the first performance synth to combine oscillator and sample-based synthesis in an intuitive design for musicians of any skill level. Simply load a sound and go! Rapture Pro’s innovative Perform mode connects the studio and stage with exceptional control for real-time expressiveness and a sound library that spans all genres of music. Whether you want a classic piano sound for a smooth jazz ballad, searing rock guitars, breathtaking atmospheres, or cutting-edge, step-sequenced patterns for EDM, you’ll find them all in the massive library of instruments, textures, and soundscapes. But, Rapture Pro is far from the usual “set-and-forget” instrument. The new Edit mode gives you infinite tweakability by overlaying Rapture’s signature mixing and modulation options for every program. Harness the power of sophisticated synthesis and create sounds that you'll need to hear to believe. Key Features of Rapture Pro: Transform, perform, produce, bend, and twist with new sounds, more FX, and more control Find and prioritize sounds faster with databased browsing Performance Mode gives unprecedented freedom to interact with sounds on stage or in the studio Vector Mixer controls all 6 element volumes simultaneously for creative, real-time mixing Edit and create sounds easily with the clean, expansive, color-coded user interface 6-element architecture is ideal for MIDI guitar Effortless parameter mapping with the new Mod Matrix Each element of Rapture Pro has 7 Step Generators, 7 LFOs, and 7 Envelope Generators 13 crushing distortion FX for massive pads and lead presets 21 sweeping filters for building bass drops and surgical mixing 31 soaring insert FX for each individual element Freely layer synths and samples 2-click MIDI Mapping for quick controller assignments Mix your instrument’s elements with the Mixer Page’s faders, pan, and sends Individual element tone-shaping with a more visual EQ Supports Mac OS X Audio Units, Windows 7/8 VST3 Nearly 10GB of sounds from professional sound designers Ability to load individual microtuning files per element Multitimbral mode allows you to play each element individually Rapture Session and Rapture Pro are supported in the following Windows DAW Software: SONAR Music Creator Cubase Protools FL Studio Studio One Additional VST/AAX Compatible Hosts",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/352290/header.jpg?t=1511579371",
    "Price": 0.0,
    "Developers": "Cakewalk",
    "Publishers": "Cakewalk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_f9987e3a6ec49cd91b05490dc87f4eab63c09520.1920x1080.jpg?t=1511579371,https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_247716f51ea350e8506fe24ad71753f2f9a5f21b.1920x1080.jpg?t=1511579371,https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_c7271bc3f23e8df15ecaa3c51915c51944e1b784.1920x1080.jpg?t=1511579371,https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_a67e910f6c173aa45217cbf6883ab97cefd1da1a.1920x1080.jpg?t=1511579371,https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_9696555537a7c353e769a73bee640ef2028ca63c.1920x1080.jpg?t=1511579371,https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_08e177afef8324ba1d22fdb40dc7289885b7d95c.1920x1080.jpg?t=1511579371,https://cdn.akamai.steamstatic.com/steam/apps/352290/ss_5afbc7df550683f083cd939a3f9ff84cf6a810ae.1920x1080.jpg?t=1511579371",
    "Slug": "rapture-session-pro",
    "Meta Title": "Rapture Session & Pro: Apr 28, 2015, Cakewalk and Full Ov...",
    "Meta Description": "Looking for information on Rapture Session & Pro? Check out the release date (Apr 28, 2015), developer insights from Cakewalk, and a complete game summary.",
    "Alt Text Image": "Official header image for Rapture Session & Pro game - Steam 352290",
    "Canonical URL": "https://gusku.site/game/rapture-session-pro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rapture Session & Pro\", \"description\": \"Looking for information on Rapture Session & Pro? Check out the release date (Apr 28, 2015), developer insights from Cakewalk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/352290/header.jpg?t=1511579371\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}