{
    "AppID": 1007740,
    "Name": "Refight:The Last Warship",
    "Release date": "Mar 14, 2019",
    "About the game": "Refight: The Last Warship is a 3D tactical warship arena TPS developed and published by Wuxi Brahma. A huge sandbox powered by UE4 provides players with a realistic warship battleground. In the game, players drive their favorite warship search resources, strengthen the armed forces. They need to fight the enemy's sudden attack and defeat the opponent to survive to win the final victory. Giant sandbox and free exploration Free exploration in a vast area of up to 5200 square kilometers, avoid the dangerous waters shuttle between the islands and collect ammunition and materials to strengthen the warships. At any time the emergence of enemy warships foreshadowed the arrival of the crisis and the fierce artillery battle test the captain's technology and strategy. Desperate survival and winner is the king Warship survival 30 players drive warship in the magnificent sea field competition and in the despair of the final victory of the captain to become the champion. Nemesis circled Danger is everywhere in the game, not only the enemy warships looming, the storm circle gradually compressed the living space, but also the bombing circle erosion of safe sea. The players’ survival is greatly threatened. Special warship and competing in the sea Prince The attributes are balanced, the firepower is excellent, the maneuvering performance is good, the High rate of fire gun can fight continuously. It is capable of fighting in battle and is the backbone of the fleet. Chancellor It has the strongest armor, the heaviest artillery, the furthest range and a round of fire can seriously damage the enemy warship. It can be both front-line combat and rear support. Yugumo It has the strongest mobility, the furthest reconnaissance distance and grab the resources advantage significantly. If properly operated, it can successfully evade long-range artillery fire and can instantly sink enemy with stealthy torpedoes. Armored construction and inner core. Addition armor Each part of the warship has different armor values. Acceding to the difference in incident angle, the corresponding equivalent thickness can be generated to judge the breakdown or bounce. Additional armor absorbs some damage when it is broken, and also reduces the time it takes for the warship to catch fire. Inner core Warship structure restores the truth. Hit the core area will causes a lot of damage. Destruction of the magazine will result in a martyr burst. Resource contention and tactical battle Weapon and equipment The game has a wide variety of props, all types of warships have their own warship guns, sub-guns, torpedo launchers. They are providing a completely different firepower configuration. These weapons and equipment could boost the warship's powerful engines, provide armor for warship defense and fire protection. They can repair damage tubes of warship failure and upgrade the vessel for continuous operation. Special props Mines lurking at sea can cause warships to flood and catch fire. Not only can they carry out tactical support for bombing, but they can also search for enemy warships on a large scale. They show the intricacies of the sea war. Tactical and artillery Torpedoes can be used as conventional weapons, as well as tactical weapons to block the channel. When the warship is far away from the enemy, it needs to calculate the course and speed of the enemy for artillery bombardment. At this point, the difference in artillery directly affects the outcome of the battle. Ballistic camo shows individuality Cool ballistic Long-range artillery drags the gorgeous trajectory and making the relentless shelling a bright flower. Players can enjoy the joy of soaring in the sea from a ballistic perspective. Individual camo Sea camo makes it hard for the player to see the warship blend with the environment. Flowing camo can show the player’s personality significantly, but it is also because too bright and easy to be noticed by opponents. There’s always a variety of camo for players in the game. Season challenges and rich gameplay Battle Royale Both single and group can experience the exciting Battle Royale mode. In the sea where the strong enemy is seriating, the party that can survive will be rewarded handsomely by competing for supplies and fighting out of the siege. Team completion 30 players are made up of 10 teams and randomly assigned to two camps. .The two sides will fight with limited resources until all of them are sunk. Tactics and operational techniques will influence the final victory. Challenge Rewards Each match can gain combat experience to improve the game level. Completing missions and special challenges will earn battle level points and they will be able to exchange for a wealth of battle-level rewards. Players’ performance and results in battle will raise the individual rank to receive special rewards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1007740/header.jpg?t=1623229465",
    "Price": 0.0,
    "Developers": "梵天游戏",
    "Publishers": "梵天游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_e9cb3ece122ce5ef8441243dc76be666a460f399.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_192648bc3a18387d3ec714631a865a91b72b7f78.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_181d54da70fe828d22a7814a0c97bcfcb665cc75.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_56b50ff639b5f39d631df18af45893b0860a2bd7.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_b30f37be3973fd58d2c16b629f0a21c57e70a041.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_d77ad20d54feefc17eb1c79d35155ceb409afbb3.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_9e961cfad30628270a81be6398c8645839983b4c.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_c72738af6d6b76935faab2213c58b8f525a1c8a4.1920x1080.jpg?t=1623229465,https://cdn.akamai.steamstatic.com/steam/apps/1007740/ss_c5174d95b021c1df5caf54e70afbd98cff87ec00.1920x1080.jpg?t=1623229465",
    "Slug": "refight-the-last-warship",
    "Meta Title": "Refight:The Last Warship: Mar 14, 2019, 梵天游戏 and Full Ove...",
    "Meta Description": "Looking for information on Refight:The Last Warship? Check out the release date (Mar 14, 2019), developer insights from 梵天游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for Refight:The Last Warship game - Steam 1007740",
    "Canonical URL": "https://gusku.site/game/refight-the-last-warship",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Refight:The Last Warship\", \"description\": \"Looking for information on Refight:The Last Warship? Check out the release date (Mar 14, 2019), developer insights from \\u68b5\\u5929\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u68b5\\u5929\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u68b5\\u5929\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1007740/header.jpg?t=1623229465\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}