{
    "AppID": 1196300,
    "Name": "RTX Sweeper",
    "Release date": "Mar 17, 2022",
    "About the game": "RTX Sweeper RTX Sweeper is a puzzle game build on the core foundations of Minesweeper with the same rule sets as the popular versions of Minesweeper. This includes highlighting adjacent tiles, planting flags and of course a fancy timer. This absolute bomb of a Minesweeper game takes place in stunning environments, yes, even without ray tracing. Ray tracing Ray tracing in a Minesweeper game isn't the only reason why this is Minesweeper on steroids, be prepared to be blown away by even more nifty features that are accessible to everyone! Whether you got a ray tracing capable video card or not. Story mode Each amazing environment has its own little story that is part of the bigger story mode. Solving puzzles helps the environment, whether it brings more animals or a more lively area depends on the area and the puzzle. Through progression you will unlock even more goodies. Boss battle If that wasn't enough then make sure to reach the final stage to attempt the difficult boss battle! Even the boss battle is no more or less than your traditional Minesweeper, however this variation comes with a little twist... can you figure it out? There will be no spoilers here about it though! Hard+ difficulties For the fanatics out there, yes there are massive grids with difficulties considered to be hard/very hard. You might want to make use of the camera controls to zoom in and move through the grid at the larger puzzles. Easy difficulties Not everyone is experienced though, so there are plenty of puzzles that can be considered as easy/medium as well so that you can learn the mechanics of minesweeper at your own pace. Of course it is absolutely possible to unlock every single environment through easy puzzles, whether you will be able to solve the boss grid... well I will leave that one up to you. Getting started After having downloaded the game make sure to check out the official guide if you are unsure about how Minesweeper game work! Speedruns Through Steam RTX Sweeper has both leader boards and achievements. However if you want to set some official world records, or you just want to see your official standing compared to others, you can submit your runs on . Will you be dominating the leaderboards? Future Over time a lot more features will be added in order to give RTX Sweeper that juicy extra we all desire, so make sure to pay attention to the update logs!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1196300/header.jpg?t=1654623022",
    "Price": 0.0,
    "Developers": "RaafOritme",
    "Publishers": "RaafOritme",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1196300/ss_b1105ad057c11276ab0cfbc378f3812d09e31ad6.1920x1080.jpg?t=1654623022,https://cdn.akamai.steamstatic.com/steam/apps/1196300/ss_532492196235ec6cb20548688275b09558650652.1920x1080.jpg?t=1654623022,https://cdn.akamai.steamstatic.com/steam/apps/1196300/ss_a21a45a388e82573530a05e5b886cd50cf95e601.1920x1080.jpg?t=1654623022,https://cdn.akamai.steamstatic.com/steam/apps/1196300/ss_7dfdedef02d987b9f14f60668eed941fef3a40f9.1920x1080.jpg?t=1654623022,https://cdn.akamai.steamstatic.com/steam/apps/1196300/ss_9a6c0e410418935b4ca570060541968b5ebcc579.1920x1080.jpg?t=1654623022,https://cdn.akamai.steamstatic.com/steam/apps/1196300/ss_9dc8c61c20638d41b4f1e8cd62ce6012f93a1537.1920x1080.jpg?t=1654623022",
    "Slug": "rtx-sweeper",
    "Meta Title": "RTX Sweeper: Mar 17, 2022, RaafOritme and Full Overview",
    "Meta Description": "Looking for information on RTX Sweeper? Check out the release date (Mar 17, 2022), developer insights from RaafOritme, and a complete game summary.",
    "Alt Text Image": "Official header image for RTX Sweeper game - Steam 1196300",
    "Canonical URL": "https://gusku.site/game/rtx-sweeper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RTX Sweeper\", \"description\": \"Looking for information on RTX Sweeper? Check out the release date (Mar 17, 2022), developer insights from RaafOritme, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"RaafOritme\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RaafOritme\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1196300/header.jpg?t=1654623022\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}