{
    "AppID": 1813540,
    "Name": "Save拯救",
    "Release date": "Dec 7, 2021",
    "About the game": "The game is introduced Save is a science and future sandbox game created by a domestic independent producer using Unreal Engine. In the style of Mars Fantasy, the game is based on top secret exploration, beautiful Settings and smooth combat. The protagonist of the game is the heroic Cerf and his female comrade-in-arms, they were selected as members of the advance team, in the frontier battle area of Mars fantasy adventure. Special instructions Save is available as an advance version, and if you want the official version, please purchase the official version. Considering the convenience of mobile phone, adhere to the use of PC and mobile platform both issued The game is set The first Earth Defense prologue In the year 3000, the earth's energy resources are becoming increasingly scarce, while the need for human exploration of the universe and the future is becoming more and more urgent. The Cosmic hostile Information Observatory on Earth found messages sent back from the depths of space. Suddenly the earth faced the test of life and death. Driven by long-term cooperation and communication, as well as a variety of common threats to humanity such as viruses, the five great powers of earth and other nations have formed deeper alliances. Thanks to a new alliance, a consortium of scientists from various countries, pooling their brains and talents, soon developed a new weapon ------ laser stick. The weapon records using one's own computer waves and paranormal consciousness, powered by a combination of signals and energy. This weapon is powerful, but requires more power. A single charge of a laser rod uses as much energy as New York City. So it can't be used in mass production. A total of 1,000 units were made in the first batch to equip 1,000 first-generation expedition heroes selected from six billion people. Our protagonist is No. 7, born Cerf, last name unknown. Chapter 1 The Martian Crisis The game features Save is 'exploring top secret', science and future, realistic character style × sandbox game Have a pleasing scene, handy combat system, heroic protagonist, achieve five types of soldiers, respectively is white common, green rare, blue rare, purple epic, golden legend and large general BOSS and duchess and prince Hero 7 needs top secrets about the fate of Earth at the Mars Temple The top secret text is as follows: From the Supreme Council of the Galactic Federation to the Earth Federation: As we have detected your strong military potential, we would like to invite elite members of the Galactic advance team to participate in the qualifying race. Both sides are engaged in a real-life battle using holographic simulators to select the best metroids to go to the border to fight the infinite Empire of the extragalactic system. The Galactic Alliance and the Unlimited Empire have been engaged in a tug of war for 3000 years, and our side is locked in a tired and pointless war of attrition. Through this competition earth will have the opportunity to become one of the core members of the Galactic Federation, not only to obtain all the energy of the solar system, but also from many galaxies, please try your best, this article will not be officially announced until the end of the competition. The third era of the cosmic calendar Ephemeris in 3000 The game problem 'Save' advance edition questions: Occasionally the system is abnormal, according to the feedback is that the enemy speed is very fast temporarily, both sides have no attack cooling interval, the enemy has penetration phenomenon Minimum GTX 945M, pay attention to the Settings The main reason is that the enemy AI path finding system has a BUG in the first scene. The enemy is stupid in the first level More content is planned for next year, with more content referencing fortnite elements, especially the use of Unreal as a phone",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1813540/header.jpg?t=1638864210",
    "Price": 14.99,
    "Developers": "天外来客",
    "Publishers": "天外来客",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1813540/ss_7e7145f65007b79219e798c2c8b7c01773bd90f4.1920x1080.jpg?t=1638864210,https://cdn.akamai.steamstatic.com/steam/apps/1813540/ss_e8472dcd19629bb45c1a37d7b222f231fe7845f4.1920x1080.jpg?t=1638864210,https://cdn.akamai.steamstatic.com/steam/apps/1813540/ss_1c346a43ea806b07aade36391bb1c785b81e5927.1920x1080.jpg?t=1638864210,https://cdn.akamai.steamstatic.com/steam/apps/1813540/ss_9adcd737de5b75ca82a8127b82c9559224172474.1920x1080.jpg?t=1638864210,https://cdn.akamai.steamstatic.com/steam/apps/1813540/ss_b643dcc096d026aaf037c265c1b87153a47af5cf.1920x1080.jpg?t=1638864210",
    "Slug": "save",
    "Meta Title": "Save拯救: Dec 7, 2021, 天外来客 and Full Overview",
    "Meta Description": "Looking for information on Save拯救? Check out the release date (Dec 7, 2021), developer insights from 天外来客, and a complete game summary.",
    "Alt Text Image": "Official header image for Save拯救 game - Steam 1813540",
    "Canonical URL": "https://gusku.site/game/save",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Save\\u62ef\\u6551\", \"description\": \"Looking for information on Save\\u62ef\\u6551? Check out the release date (Dec 7, 2021), developer insights from \\u5929\\u5916\\u6765\\u5ba2, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5929\\u5916\\u6765\\u5ba2\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u5929\\u5916\\u6765\\u5ba2\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1813540/header.jpg?t=1638864210\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}