{
    "AppID": 464950,
    "Name": "Sumer",
    "Release date": "Feb 15, 2017",
    "About the game": "Sumer is a unique blend of modern board game design and exciting real-time action, set against the beautiful backdrop of a mysterious ancient civilization. To claim the throne, four nobles of the ziggurat must compete for Inanna’s favor. She is not easily pleased, but what god is? To prove your worth you must perform sacrifices according to Inanna’s sacred rituals. Place your workers in workshops to gain resources and goats. Offer up the resources to Inanna and use the goats to trade for new workshops and abilities. Only the swiftest and cleverest noble will become the ruler of Sumer. A Worker Placement Video Game! Sumer takes the board game mechanic of worker placement to a new level. Each day, you and your competitors will awaken at dawn to begin your worship. Run and jump around the ziggurat to place your workers so they'll collect resources. You only have 2 workers, so you better figure out your strategy, move fast, and claim workshops before your friends beat you to it! Real-time Dynamic Auctions! Whoever is willing to sacrifice the most goats gets Inanna's blessing! The auction is simple — just move left or right to change your bid in real time. Each auction is a mind game of bluffing and bravado, and you never know an item’s real price until time is up! Trick your opponents into overpaying for their bids while you snag good bargains for your own! Key Features 1-4 players - Play local with up to 4 players. Master playing solo or try to beat up to three of your friends. Devious AI - A variety of personalities and skill levels makes the game a challenge for any player. Comfortable game length - With a game experience of 20 to 30 minutes, Sumer plays in a fraction of the time of a comparable strategy board game. Infinitely replayable - Randomized setup and a huge variety of different auction items make each playthrough a unique strategic experience. Nuanced strategies - There is no single key to winning. Being quick on your feet and making smart long-term investments are both crucial to victory. Sumerian culture - We’ve worked with professional historians to bring you the ancient civilization that invented writing, beer, and board games. Customizable gameplay - Play the way you want by turning on variants like Big Head mode and Hidden Auction Items. Your controls - The game can be played with controllers, mouse and keyboard, all at the same time!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/464950/header.jpg?t=1489421865",
    "Price": 14.99,
    "Developers": "Studio Wumpus",
    "Publishers": "Studio Wumpus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_f622b4d01c608b9be04df99770cffb52ba37d848.1920x1080.jpg?t=1489421865,https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_e45988885bd01d70948ac9113b418e5848ea854b.1920x1080.jpg?t=1489421865,https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_e85fb8332c6a3479947262a493c2eca60b60d2b2.1920x1080.jpg?t=1489421865,https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_85acee14df1a6788dfad3c30593760f0d8a86b74.1920x1080.jpg?t=1489421865,https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_3315a0f2128462081aceecc9e2da4d1a390424d7.1920x1080.jpg?t=1489421865,https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_e2e3c5a3e57532f6160c195b6e3cc7fb21eaeee9.1920x1080.jpg?t=1489421865,https://cdn.akamai.steamstatic.com/steam/apps/464950/ss_3e985efaf7508a65db7de0b4b817310423d7e8cd.1920x1080.jpg?t=1489421865",
    "Slug": "sumer",
    "Meta Title": "Sumer: Feb 15, 2017, Studio Wumpus and Full Overview",
    "Meta Description": "Looking for information on Sumer? Check out the release date (Feb 15, 2017), developer insights from Studio Wumpus, and a complete game summary.",
    "Alt Text Image": "Official header image for Sumer game - Steam 464950",
    "Canonical URL": "https://gusku.site/game/sumer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sumer\", \"description\": \"Looking for information on Sumer? Check out the release date (Feb 15, 2017), developer insights from Studio Wumpus, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Wumpus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Wumpus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/464950/header.jpg?t=1489421865\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}