{
    "AppID": 1611350,
    "Name": "晴天咖啡館 Sunny Cafe",
    "Release date": "Dec 8, 2021",
    "About the game": "That rainy season was crossing between you and me, It was you who let the dark clouds that entangle me dissipate and turn into a sunny day. So, this cafe is named after your favourite sunny day, It is called 'Sunny Café'. 'Ding.' In a summer afternoon, the thunder showers fell mercilessly, and the bells in the cafe suddenly rang. The boy suddenly regained his senses, only then did he discover the soaked girl standing at the door... It was the girl who made him linger. Accidental encounters, acquaintances, acquaintances finally lead to parting── The composition of life is the constant experience of these cycles, and the he has always been disapproving of it. After meeting her, the he began to fear parting. When faced with the confusion at the crossroads of life, how should they choose? Incorporate Taiwan’s local culture and customs in the story, The protagonists are all set in college, hoping to bring players a beautiful and ideal world. Remember the first taste of love? The uncertain and sweet throbbing? 'Sunny Café' is a love text adventure game that combines Taiwanese coffee knowledge as the theme to evoke your initial touch. With the jazz-style soundtrack, real field background, localized overdub and script, the game also integrates Taiwan's local customs, an AVG game that can be easily playing with has been presented. This game plans three open endings, In each finale, several different endings will be subdivided according to the degree of favorability. In the game, an implementation system related to coffee knowledge has been specially developed. Guide players step by step to understand the wave of the third wave of specialty coffee and how a cup of aromatic coffee is made. ☀What is unique about the sunny cafe? ⟡Different from other AVG 'Sunny Café' is a love story based in a cafe. Through the game, players can learn the correct concept of coffee culture. The story will focus on Taiwan's unique coffee culture and the sweet love memories from college. ⟡Different ways to play Several engaging mini-games were involved in the game. For example, players can learn how to make a coffee by selecting beans ➪ grinding beans ➪ choosing a filter cup ➪ to brew coffee. ⟡Interesting background objects Random small objects will appear in the game's background, click on those small objects, and see the little knowledge about coffee! The Game Nobility, an independent game R&amp;D team in Taiwan, has created a new text adventure game, 'Sunny Café', which aims to be released this summer. The game revolves around cafe-centric protagonists. In addition to the young love story, the R&amp;D team also hopes to promote the coffee culture through knowledge in the game. The entire game is more than 4 hours with 130,000 words of content. 'Who said that black coffee must be bitter?' Black coffee shows the original flavour of coffee beans, some refreshing, some sweet and greasy. 'Sunny Café' is nothing more than a game that integrates love elements and allows players to learn coffee knowledge from the game. This game also introduces a small coffee brewing game, allowing players to grind coffee beans, brew coffee, etc., in the game. Many coffee-related objects have also been attached to the background, allowing players to learn new knowledge while playing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1611350/header.jpg?t=1657179495",
    "Price": 12.99,
    "Developers": "GameNobility 遊戲貴族",
    "Publishers": "Interwise Multimedia Corp.英特衛多媒體股份有限公司,BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_65457d1915bb5953c11053bc8359169d4f59e005.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_1c15d864294efb8d0a87d9c770edda57cdef4cec.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_d9d1f656b9723bac9de97ce3b4fdfcc188f28d05.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_d4b6b66f6a98d8693b0d657224a63ef9a05f9e69.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_9e41efc8fa78770a479074c402acb10b1ef3c3c7.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_a4eeda3745d8fccb296db2a2f3c96076088833af.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_649d02cfd0e3633beb8582f0a7a2655ff44e38a3.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_a1fe7dc4f8cfcb5bf487ffce64362c5e5af0fdb3.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_f63a83ff1c23227d40091cccbc3f5ccdcabd7047.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_0dcdd3fcd3d349e7efb82b8e73e75ee0f6991edc.1920x1080.jpg?t=1657179495,https://cdn.akamai.steamstatic.com/steam/apps/1611350/ss_ef0ae96745121b445c61d9ef891c4fe54551d0b9.1920x1080.jpg?t=1657179495",
    "Slug": "sunny-cafe",
    "Meta Title": "晴天咖啡館 Sunny Cafe: Dec 8, 2021, GameNobility 遊戲貴族 and Full...",
    "Meta Description": "Looking for information on 晴天咖啡館 Sunny Cafe? Check out the release date (Dec 8, 2021), developer insights from GameNobility 遊戲貴族, and a complete game su...",
    "Alt Text Image": "Official header image for 晴天咖啡館 Sunny Cafe game - Steam 1611350",
    "Canonical URL": "https://gusku.site/game/sunny-cafe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6674\\u5929\\u5496\\u5561\\u9928 Sunny Cafe\", \"description\": \"Looking for information on \\u6674\\u5929\\u5496\\u5561\\u9928 Sunny Cafe? Check out the release date (Dec 8, 2021), developer insights from GameNobility \\u904a\\u6232\\u8cb4\\u65cf, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"GameNobility \\u904a\\u6232\\u8cb4\\u65cf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Interwise Multimedia Corp.\\u82f1\\u7279\\u885b\\u591a\\u5a92\\u9ad4\\u80a1\\u4efd\\u6709\\u9650\\u516c\\u53f8,BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1611350/header.jpg?t=1657179495\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}