{
    "AppID": 1080330,
    "Name": "Super Mega Space Blaster Special",
    "Release date": "Jun 17, 2019",
    "About the game": "A quick word from the developer: Super Mega Space Blaster Special was created by one person, half of Bare Knuckle Development, Ste Wilson. As the game is made by a solo developer don't expect triple A standards, mind-blowing graphics or a massive in depth story. What you can expect is a fun, challenging retro space shooter with solid core-gameplay, couch co-op and leaderboards for less than the price of cup of coffee. If you have any questions, problems, or feedback about the game just give us a shout. We’d love to hear what you think of the game and will do our best to respond as quickly as possible, providing support if necessary. Also let us know if you had fun playing the game because that really does make our day! A modern take on the retro arcade shoot 'em up (shmup). Super Mega Space Blaster Special is an addictive, fast-paced space shooter with bullet hell elements. Blast your way through 3 modes; managing fuel and ammo to get to the big-boss in 'Survival Mode', protecting your mothership from damage in 'Protect Mother Mode', and blasting your friends into space dust in the local competitive multiplayer 'To The Death Mode'. Play with a friend in local coop and work together to take out the aliens. Collect coins to unlock more space blasters and get higher scores. Use each space blaster's strengths to your advantage from turrets that allow twin stick control, to fast manoeuvrable ships that can outrun your foes. Arm yourself to the teeth with awesome power-ups like big-bombs, homing missiles and lasers. Destroy the alien boss and continue the endless gameplay to rack up a massive score and become the ultimate space blaster pilot and top the leaderboards. Fast-paced addictive shmup gameplay with bullet hell elements. 3 play modes give varied gameplay and replay-ability. From the struggle for fuel and ammo in 'Survival Mode' (coop or single player), to the battle to keep your mother-ship in one piece in 'Protect Mother' (coop or single player), to the frantic race to wipe out your opponent in the local multiplayer mode - 'To The Death' (2 player only). Play alone in single player or with a friend in local coop or local competitive multiplayer. Collect coins to unlock all 10 space blasters (ships) each with their own percs. From fast ships for darting around to slower ships that allow precision aiming. Some space blasters have turrets turning the game into a twin-stick shooter. Loads of awesome power-up weapons to help you take down your enemies including lasers, homing missiles, and multi-shot. Collectables to aid you in your mission. Big-bombs wipe-out nearby enemies, shields help you survive longer, and magnets drag fuel and ammo towards you. Endless high-score chasing gameplay with over 15 enemies and a boss for those who can score high enough (gameplay continues after the boss). Full joypad (controller) support including button images for Xbox controllers, PlayStation 4 (DualShock 4) controllers, and Nintendo Switch Pro controllers. Keyboard remapper with 2 bindings per action and restore default keyboard bindings button for easy reset. Over 20 in-game challenges to help you gain coins and develop your space blaster piloting skills. More than 20 Steam achievements. Simple hand-drawn art-style allows you to easily pick out the foes amongst the asteroids. Inspired by both games of yesteryear like Asteroids, Super Fantasy Zone, and Galaga, and modern games like Bit Blaster XL and Super Stardust HD. Compete to be the greatest space blaster pilot in the Steam Leaderboards. Cross platform 'Steam Cloud' support. Play along to the pumping 80s inspired synth-pop original soundtrack by Electric Fan Death. Soundtrack and cover included as free DLC. The year is 2051, the Earth is in ruin; a barely inhabitable polluted mess of smog and tar. A huge unmanned spaceship, launched by mankind years earlier as a last ditch attempt to survive, has found a possible inhabitable planet and is under attack from its residents. That's where you come in pilot! From earth you must remotely control one of the giant ship's space blasters and annihilate the alien threat so that humanity can continue. The survival of human kind is in your hands pilot. Don't let us down! We are a small video game development studio of two people based in Manchester, United Kingdom. Whilst working on a bigger game (The Flawless: Art's Tale) for console and PC we took a month long break to make this game. When designing Super Mega Space Blaster Special we wanted to make a game that had that fun retro feeling of playing couch coop and competitive games with your mates or trying to get your name in an arcade game's leaderboard. We also wanted to make sure the game offered great value for money and was fun to play, giving that urge for 'just one more go' . Now you can be the judge of this, leave a Steam review and let us know what you think. We are open to feedback and want to improve the game in any way we can. If you have any issues with the game please feel free to let us know and we'll do our best to solve the problem. We hope you enjoy the game, Happy blasting!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1080330/header.jpg?t=1584707083",
    "Price": 0.99,
    "Developers": "Bare Knuckle Development",
    "Publishers": "Bare Knuckle Development",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_5d176deda7fcf27defd9f184468e6e9c267423f2.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_2485992a590b6aa9129385258b3ffd9a1b0f4979.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_b04a245719b1dc1992d6c064a02e2bfac3678116.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_cf4fc236798637c916f8a5f5aaf3ac44ba04175a.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_0aa821c951cc39bcff0e207fd6f0e4d7ab015fe0.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_43afe09f86b6540fc5b5602e24ecfdf6f77c113b.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_aa48fa848f551167140e23f59a8f5b22b9c39f16.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_db8ab356df88440ddb6deb4f734c9e218cc55afd.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_6fa7339b007313aa9b4430110ba550d6032339ed.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_5c80f13660d45557f7dfcfb4acfe50cee95e5c17.1920x1080.jpg?t=1584707083,https://cdn.akamai.steamstatic.com/steam/apps/1080330/ss_62007c1b0a9ecbab1370115e6f265ebeb6130243.1920x1080.jpg?t=1584707083",
    "Slug": "super-mega-space-blaster-special",
    "Meta Title": "Super Mega Space Blaster Special: Jun 17, 2019, Bare Knuc...",
    "Meta Description": "Looking for information on Super Mega Space Blaster Special? Check out the release date (Jun 17, 2019), developer insights from Bare Knuckle Development...",
    "Alt Text Image": "Official header image for Super Mega Space Blaster Special game - Steam 1080330",
    "Canonical URL": "https://gusku.site/game/super-mega-space-blaster-special",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Super Mega Space Blaster Special\", \"description\": \"Looking for information on Super Mega Space Blaster Special? Check out the release date (Jun 17, 2019), developer insights from Bare Knuckle Development...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bare Knuckle Development\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bare Knuckle Development\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1080330/header.jpg?t=1584707083\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}