{
    "AppID": 803830,
    "Name": "The Snowboard Game",
    "Release date": "Apr 24, 2018",
    "About the game": "The Snowboard Game is a realistic skill based snowboard game with natural physics set in multiple immersive mountain locations and snow parks. You can do many things in the game, ranging from performing epic stunts in the backcountry or just hanging around in the park with your buddies! Create your own snowboard career in story mode where you meet other enthusiasts and pro boarders that will challenge you to learn new tricks, or get down the mountain in a new way. Complete missions and compete in online events or player created challenges to earn money, fans and equipment. Hangout There is an online hangout mode where you can shred with your friends. You can still do your own challenges and missions separately and see what your friends are up to. Tours The tour multiplayer is asynchronous so everybody competes against each other in the tour events. They are divided by leagues and divisions and the leaderboards reset every day. Every time you place top three it will save your ghost to everybody playing the event. Everybody starts in the 'Amateur League' which will not get you any prizes, so you will have to play the story missions to rank up in the divisions. If you find a spot you like, you can create a session to build jumps and place props to create a video to upload to your fictional video channel. A challenge is time or score based challenge and can be found by anybody. Creating challenges can earn you money, while playing challenges only earns you fans. Mountains Right now there are five fictional handcrafted mountains in three different mountain areas. Each mountain has a few story missions that will progress the story and unlock new locations, a few online events and usercreated challenges. The focus of development has been to create natural and immersive physics while still being fun with tight and responsive controls. KEEP IN MIND, THE CONTROLS ARE HARD TO LEARN. ONCE LEARNED, IT BECOMES EASIER TO PULL OFF TRICKS",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/803830/header.jpg?t=1640123836",
    "Price": 14.99,
    "Developers": "Let it roll AB",
    "Publishers": "Let it roll AB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/803830/ss_60060a536f287625458c5779eb45c08ab857c647.1920x1080.jpg?t=1640123836,https://cdn.akamai.steamstatic.com/steam/apps/803830/ss_0cde616030c543139bd208e4ae869ea173b3f586.1920x1080.jpg?t=1640123836,https://cdn.akamai.steamstatic.com/steam/apps/803830/ss_c8cb95d169618c20ef712194eadd4db7a6ba6227.1920x1080.jpg?t=1640123836,https://cdn.akamai.steamstatic.com/steam/apps/803830/ss_2eb3229dfc9dd7176c9ab74419ac6ce1dc168a11.1920x1080.jpg?t=1640123836,https://cdn.akamai.steamstatic.com/steam/apps/803830/ss_e77b0eb3d7232bed190e152d2846c4913c999187.1920x1080.jpg?t=1640123836",
    "Slug": "the-snowboard-game",
    "Meta Title": "The Snowboard Game: Apr 24, 2018, Let it roll AB and Full...",
    "Meta Description": "Looking for information on The Snowboard Game? Check out the release date (Apr 24, 2018), developer insights from Let it roll AB, and a complete game su...",
    "Alt Text Image": "Official header image for The Snowboard Game game - Steam 803830",
    "Canonical URL": "https://gusku.site/game/the-snowboard-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Snowboard Game\", \"description\": \"Looking for information on The Snowboard Game? Check out the release date (Apr 24, 2018), developer insights from Let it roll AB, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Let it roll AB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Let it roll AB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/803830/header.jpg?t=1640123836\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}