{
    "AppID": 1272160,
    "Name": "The Life and Suffering of Sir Brante",
    "Release date": "Mar 4, 2021",
    "About the game": "The Life and Suffering of Sir Brante is a narrative-driven RPG that comes to life on the pages of the protagonist's journal. Set in a ruthless world where any form of dissent is mercilessly crushed, the story follows a man who has dared to challenge the existing order. Set out on a lifelong journey and become an individual able to carve out their own destiny... But remember that freedom never comes cheap. Life in the Great Arknian Empire is harsh and its hardest Lot is yours by the circumstance of birth. You are a commoner, holding no rights and no title. To seize your fate and become the rightful heir to the legacy of the Brante family you will have to come to grips with ossified tradition and prejudice. Embarking on a life-long journey from one's birth until true death, you will have to endure great upheavals, face adversity, and make many difficult choices. Every decision will affect not only the protagonist, his family, and loved ones, but may even topple the foundation of the Empire itself. Key features At the turn of time Every imperial citizen's life is predetermined by their estate. The deities known as the Twin Gods have bestowed this truth to the world, dividing mortals into Lots. The nobles lead and rule over others, while the clergy guides people on the one true path, and the lowborn suffer, toiling away for the glory of the Empire. You may accept your fate without question, but it is also in your power to change the cosmic order that governs all. Your choice is not an illusion Divided into chapters, the game keeps track of the player's deeds, the skills they acquired, as well as other overlapping circumstances that shape a unique plotline for each playthrough. Every decision has its consequences and you will be held accountable throughout the entire journey. To protect your family and loved ones, to impose the rule of the Emperor and make a fortune, or to try and change the world as you see fit... Make your choice, but beware of the follies of pride and ambition. Fight for your life One man is anything but omnipotent in this realm yet under your guidance, Sir Brante may become a person who can endure every trial fate throws at him and rewrite the very laws that govern his world! Develop and train your character, leveling up such traits as determination, sensitivity, and endurance. All of the hero's skills, starting with those acquired in infancy, will affect his personality, worldview, and relationships, ultimately unlocking new talents and possible storylines. Find your own path The first complete walkthrough can take you upwards of 15 hours! Numerous branching paths that affect the unfolding story will make every playthrough a unique experience: become a noble judge, learn the ways of the inquisition, plot a revolution as a member of a secret society, or embrace an entirely different purpose. Be brave and fate itself shall bend to your will! There and hereafter Resurrection system allows the character to keep his experience upon death, letting the player reevaluate past steps and make adjustments to their strategy going forward. Take control not only of your life but also your demise, then put everything at stake in this cycle of death and rebirth!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1272160/header.jpg?t=1651785086",
    "Price": 19.99,
    "Developers": "Sever",
    "Publishers": "101XP",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_a0a0829bf7f8419493b66c0cba1ee2b1dd5cb423.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_97767c44124cf339dc9e58be927d7a96c6211550.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_e45e1d84aa7d1250d76bce991cbed7fc87ba3cff.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_181c95f51da4d4ec9eccb48aac8acc4c9298cda9.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_75231dc61287abf6206a6b3f6d56aabf3dc751bc.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_ba565a249a047e90591628cc36d7f3e3fa501937.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_a26e895b3bc718fc75fec74df83132366ad39c0b.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_4612c9e9c5edfc6df949b2ff928531f0eadde766.1920x1080.jpg?t=1651785086,https://cdn.akamai.steamstatic.com/steam/apps/1272160/ss_661764b79f8f78c44a4432c9abf4732e7b1cd4d6.1920x1080.jpg?t=1651785086",
    "Slug": "the-life-and-suffering-of-sir-brante",
    "Meta Title": "The Life and Suffering of Sir Brante: Mar 4, 2021, Sever ...",
    "Meta Description": "Looking for information on The Life and Suffering of Sir Brante? Check out the release date (Mar 4, 2021), developer insights from Sever, and a complete...",
    "Alt Text Image": "Official header image for The Life and Suffering of Sir Brante game - Steam 1272160",
    "Canonical URL": "https://gusku.site/game/the-life-and-suffering-of-sir-brante",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Life and Suffering of Sir Brante\", \"description\": \"Looking for information on The Life and Suffering of Sir Brante? Check out the release date (Mar 4, 2021), developer insights from Sever, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sever\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"101XP\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1272160/header.jpg?t=1651785086\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}