{
    "AppID": 1342070,
    "Name": "The Triumphant Return of Diabolos",
    "Release date": "Jun 10, 2022",
    "About the game": "During the rise of the Demon Lord, humanity put aside its differences and came together to save the world. After the war, humans began persecuting all demons, even those who didn’t align themselves with the Demon Lord. They were effectively forced to go into hiding. 18 years later, a young man named Rein trained alongside his childhood friend, Ciel. They aimed to become imperial knights for their homeland, the aggressively expansionist Cedis Empire. After venturing into a cave, a mysterious figure spirits Rein away and tells him, “We have been looking for you, Demon Lord Diabolos.” Enjoy a complex turn-based combat system with Active Time Battle (ATB). Once your ATB bar is ready, make your choices carefully. Spells are powerful, but require longer casting times, while skills can be unleashed immediately. Also, be wary of the enemy's affinities! Every one of them has elemental weaknesses and resistances that you can use to your advantage. Journey around the world to secure your newfound position! Grow strong enough to face the challenges ahead! Meet colorful characters and convince them to join your ranks to form a powerful party capable of taking on any foe! Invest points in each party member's unique skill trees to unlock powerful moves and stat increases. Customize your fighters in any way you want! A nimble archer, an unmovable tank, a powerful mage… There are loads of possibilities! Buy and craft dozens of weapons, armor, and accessories to change the element of your attacks and directly influence your stats. Mix and match your gear strategically to gain an edge in every area. A Complex Battle System Using a party of four characters, take advantage of dozens of skills to exploit enemy weaknesses and assure victory. The ATB bar charges faster for nimble characters, which makes it perfect to paralyze slower swordsmen and mages before they can attack. An Entire World to Explore Sometimes, the long way around is the only path you can take. Embark on a journey that will take you around the world, see various locales, and meet many friends and foes alike. Sprawling Skill Trees Each character has multiple skill trees unique to them, which allows you to focus on any build you wish to try. Would she better serve you as a fast thief who never gets hit? Or maybe she'd be a better support mage that heals the rest of the party? Don't worry about your choices too much, though. Ample respec items will swiftly fix any mistake. Gear Crafting System You can buy gear from shops, sure, but why spend money when you can get better custom weapons and armor? Bring monster parts dropped by enemies after battles to a synthesis shop and let artisans meld them together to create powerful items... provided you've found the recipe beforehand!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1342070/header.jpg?t=1657294723",
    "Price": 19.99,
    "Developers": "Bud of Lupine",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1342070/ss_a7de45d00f5aa76ffda73c6a1f58613a73b051cb.1920x1080.jpg?t=1657294723,https://cdn.akamai.steamstatic.com/steam/apps/1342070/ss_fc4e104e985387b6cee03ec496456837eaba78c8.1920x1080.jpg?t=1657294723,https://cdn.akamai.steamstatic.com/steam/apps/1342070/ss_7638d707c4ecf16f5c279e7bef5b5245ed2cce14.1920x1080.jpg?t=1657294723,https://cdn.akamai.steamstatic.com/steam/apps/1342070/ss_c299babd3ce8741c0e6d2a07010ebf722fe87e43.1920x1080.jpg?t=1657294723,https://cdn.akamai.steamstatic.com/steam/apps/1342070/ss_644812dd3397ae6c259f17776fdb69f799e01773.1920x1080.jpg?t=1657294723",
    "Slug": "the-triumphant-return-of-diabolos",
    "Meta Title": "The Triumphant Return of Diabolos: Jun 10, 2022, Bud of L...",
    "Meta Description": "Looking for information on The Triumphant Return of Diabolos? Check out the release date (Jun 10, 2022), developer insights from Bud of Lupine, and a co...",
    "Alt Text Image": "Official header image for The Triumphant Return of Diabolos game - Steam 1342070",
    "Canonical URL": "https://gusku.site/game/the-triumphant-return-of-diabolos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Triumphant Return of Diabolos\", \"description\": \"Looking for information on The Triumphant Return of Diabolos? Check out the release date (Jun 10, 2022), developer insights from Bud of Lupine, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bud of Lupine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1342070/header.jpg?t=1657294723\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}