{
    "AppID": 222615,
    "Name": "Train Simulator: West Somerset Railway Route Add-On",
    "Release date": "Nov 14, 2013",
    "About the game": "The longest heritage railway in the UK comes to life in the beautiful West Somerset Railway route add-on for Train Simulator, available now. The origins of what is now one of the favourite preserved railways for enthusiasts began back in the mid-1800s, when a number of proposals were submitted for railway schemes in west Somerset; however, none of these schemes were pursued and it was another ten years before proposals for a railway in the county were submitted again. Led by Isambard Kingdom Brunel, a former engineer of the neighbouring Bristol and Exeter Railway (B&amp;ER), a scheme to build the West Somerset Railway was submitted. Opening on 31 March 1862 for passenger services, the line become an important route for holidaymakers heading to the seaside, as well as carrying coal and iron-ore from the mines and ports of Somerset. Passing loops and extended platforms were added over the years to manage the increasing number of passengers and freight operations, and the line was converted from broad gauge to standard gauge in 1882. However, despite a Butlins holiday camp opening at Minehead in 1962, the line was recommended for closure in the 1962 Reshaping of British Railways report, and the last passenger service ran on 2 January 1971. Just a month after closure, a working party was tasked with reopening the line as a privately owned railway, such was its importance to the tourism industry. With support from Somerset County Council and the Minehead Railway Preservation Society, the line reopened as a heritage railway on 28 March 1976 between Minehead and Blue Anchor, and to Bishops Lydeard three years later. At 20 miles, the line is the longest standard gauge heritage railway in the UK, running through some of Somerset’s most picturesque landscapes. The line is also popular with enthusiasts and rail fans due to its resident roster of GWR and S&amp;DJR locomotives, and regular visiting locomotives on rail tours or for galas. Starting out on the sea front at Minehead, the line heads south east along the coast to Dunster and Watchet, before heading inland to Williton where the oldest signal box on the line stands. Climbing out of Williton along the side of the Quantock Hills – where passengers are afforded stunning views across the Somerset countryside – the line reaches its summit at Crowcombe Heathfield before descending down the steep 1 in 81 decline to Bishops Lydeard. Included with the route are three of the railway’s most popular locomotives - Class 7F ‘No. 88’ in Somerset &amp; Dorset Joint Railway livery, GWR Hall Class ‘Raveningham Hall’ and BR Green Class 33 ‘D6575’. Accompanying these locomotives are appropriate BR Mk1 coaching stock and GWR/BR freight wagons. Scenarios Nine scenarios for the route: WSR Simple Controls WSR: Driving a Steam Locomotive WSR Driving a Diesel Locomotive West Somerset Railway Santa Special Fall by the Wayside A Summer Spin Watchet for the Storm The Quantock Belle Special More scenarios are available on Steam Workshop online and in-game. Train Simulator’s Steam Workshop scenarios are free and easy to download, adding many more hours of exciting gameplay. With scenarios being added daily, why don’t you check it out now! Click here for Steam Workshop scenarios. Key Features 20 mile preserved West Somerset Railway from Minehead to Bishops Lydeard Class 7F ‘No. 88’ in Somerset &amp; Dorset Joint Railway livery GWR Hall Class ‘Raveningham Hall’ BR Green Class 33 ‘D6575’ BR Mk1 chocolate and cream coaching stock GWR/BR freight wagons Scenarios for the route Quick Drive compatible Download size: 1,100mb",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/222615/header.jpg?t=1447359138",
    "Price": 19.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games - Trains",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_a00dd3b5e7907374d41fbdce3cfe3f3f404e4c86.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_d7c58e0dfbbda4f2033e4f3e8bd25536bfe9cf05.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_9c3f6e79d3f0b4dcd32ab13872304b27b36fcd5b.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_7b092590b1a836e97631ce47d5e7dfeda8c82448.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_7553f66739ae0cec68a063ea1bd182a4759c619e.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_d3827d7ad264e95a0b2cfa19050e95da45b53311.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_3a67e80989c7f67e921e9502cdc9baaa443cbe5e.1920x1080.jpg?t=1447359138,https://cdn.akamai.steamstatic.com/steam/apps/222615/ss_812c3a3ecad3e86d726d9d73774362591a1c6ce3.1920x1080.jpg?t=1447359138",
    "Slug": "train-simulator-west-somerset-railway-route-add-on",
    "Meta Title": "Train Simulator: West Somerset Railway Route Add-On: Nov ...",
    "Meta Description": "Looking for information on Train Simulator: West Somerset Railway Route Add-On? Check out the release date (Nov 14, 2013), developer insights from Dovet...",
    "Alt Text Image": "Official header image for Train Simulator: West Somerset Railway Route Add-On game - Steam 222615",
    "Canonical URL": "https://gusku.site/game/train-simulator-west-somerset-railway-route-add-on",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Train Simulator: West Somerset Railway Route Add-On\", \"description\": \"Looking for information on Train Simulator: West Somerset Railway Route Add-On? Check out the release date (Nov 14, 2013), developer insights from Dovet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games - Trains\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/222615/header.jpg?t=1447359138\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}