{
    "AppID": 716560,
    "Name": "Trancelation",
    "Release date": "Mar 12, 2019",
    "About the game": "Trancelation is a neon arcade game filled with linguistics and electronic music. It’s about translating sets of words in a futuristic world of fractals and vibrant sounds. You control The Spark and your main objective is to navigate through an ever-changing environment full of enemies and obstacles. Watch out – they’ll strip you of your life and put end to your journey in an instant! Use buffs, such as bombs, shields or extra life, and collect points for every correct word association! STATE OF THE ARCADE A classic arcade video game that will definitely test your agility and dashing skills. Navigating 'The Spark' can be a real challenge when you’re unsure of a word’s meaning or when your enemies are closing in and there are walls in your way. You only have a limited number of lives, so be extra careful and think twice before taking a risk! And if you don't want to learn languages, no problem! Trancelation features an Arcade Mode where you don’t pair any words. Only pure agile skills count! LEARN NEW LANGUAGE SKILLS Trancelation is designed to boost your memory skills and help you to memorize words. Word repetition isn’t just some boring chore that requires a lot of motivation any more – it's an enjoyable experience, so you want to play it every day just for fun! Trancelation features fast-paced gameplay and an engaging atmosphere that puts our brains into high gear and eventually boosts our language skills. It also teaches you to recall translations quickly – a crucial skill in real-world language usage. CREATE &amp; SHARE VOCABULARY LISTS Learn any language you like! Trancelation allows you to easily import your own vocabulary lists, even those from the most popular language learning apps. You’re also free to share them with the community and use lists other people have created! As the community grows, you’ll have access to more difficult and complex sets and the gameplay will become much more demanding. MAIN FEATURES • A one of a kind mix of classic arcade game and language learning platform • Fast-paced, engaging gameplay set in a neon, fractal world • Word association challenges to boost your linguistic skills • Challenges designed to help you recall foreign words immediately • A soundtrack that mixes the best of the electronic and trance genres • An energetic atmosphere drowned in neon esthetics • The possibility to create your own vocabulary lists and share them with others – infinite amounts of new content!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/716560/header.jpg?t=1642006552",
    "Price": 1.99,
    "Developers": "MythicOwl",
    "Publishers": "MythicOwl",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_d197bdeb614ec7157e183a1171b13e32714f5244.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_d0deabf1902978599b66447ba707a5b9a586c95b.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_eed41828d368030ab8674edd2e37224b4bedab5a.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_a804f58eb02fd1ad37e39078b975b0d6cd1054a2.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_41236f5218172d39dade69d13fece86f8784afb8.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_52af0071e7c4ed986ab0760e7fb702400e7145e0.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_d258a33dce618c661e96ca26e0cb023755716a2a.1920x1080.jpg?t=1642006552,https://cdn.akamai.steamstatic.com/steam/apps/716560/ss_998f1d9eb35c4e67fbc7a869244d3f0020623b7c.1920x1080.jpg?t=1642006552",
    "Slug": "trancelation",
    "Meta Title": "Trancelation: Mar 12, 2019, MythicOwl and Full Overview",
    "Meta Description": "Looking for information on Trancelation? Check out the release date (Mar 12, 2019), developer insights from MythicOwl, and a complete game summary.",
    "Alt Text Image": "Official header image for Trancelation game - Steam 716560",
    "Canonical URL": "https://gusku.site/game/trancelation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trancelation\", \"description\": \"Looking for information on Trancelation? Check out the release date (Mar 12, 2019), developer insights from MythicOwl, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"MythicOwl\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MythicOwl\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/716560/header.jpg?t=1642006552\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}