{
    "AppID": 1987550,
    "Name": "Via Mortis",
    "Release date": "May 19, 2022",
    "About the game": "You are a soldier, drafted into the United Nation’s Anti-Demon Defensive initiative ( ADDI ). Tasked with capturing and hunting demons from a mysterious new world. This new world is highly dangerous and hostile, the demon like creatures within are planning a massive attack on the Earth and the mission is clear: save humanity at all costs . To do this, you need to kill the Demon Kings this this action packed, demon collecting, first person dungeon crawler. You won’t start with much, but the ADDI has provided some shielding technology: &gt;Learn how to counter and reflect enemy attacks But that isn’t enough, using shields alone would only allow you to survive. A soldier needs to capture and tame his own demons to thrive. Monstrum-Captio Cards can be bought for capturing demons. &gt;Use Monstrum-Captio Cards in battle to capture enemy demons. &gt;Put them in your party and train them to become stronger. &gt;Sell them for some quick cash based on their EXP amount. &gt;Purchase new and stronger demons from the ADDI Learning to talk to friendly demons can allow for some new knowledge on how to fight and of the world itself. &gt;Accept loads of side quests from friendly demons for new skills. This new world has lots of areas to explore and to get lost in. We have some reports of what is inside: &gt;Lots of treasure to uncover and relics for the ADDI to analyze. &gt;Demon strongholds with lots of demons guarding them. Our scanners are very shoddy, we require you to enter to learn more about them and to discover more. Now, back to your main objective: You must kill the demon kings. &gt;Demon Kings are the massive bosses controlling the demons. We believe the demons worship them like Gods. &gt;Become stronger to face them on and to liberate Demon kind from their hold. The assassination of the Demon Kings is at DX Priority. Do whatever you need to do to kill them. I have gotten some special in-depth info about your journey: &gt;8 dungeons in total. &gt;NG+ Special boss rush with new bosses to test your skill against. &gt;4 main endings with one bad ending and one true ending. &gt;Average 8-10 hours of play time for each ending Soldier, I hate to say it, but you aren’t the first person to enter the other world with this information. You are just another soldier we have sent into the other world. If you can learn how to use the provided shields, capture and train demons, and learn more and more power: then you might be able to do what we are asking. Our expectations are high, but that is because humanity is on the line here. My scanning of you has made it seem that you might be strong enough to survive… Interesting… You might be the one we were looking for…..",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1987550/header.jpg?t=1656035064",
    "Price": 14.99,
    "Developers": "Michael Richard Lannon",
    "Publishers": "Michael Richard Lannon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1987550/ss_9426ecc1b59232f69f80f878f8e759988d3f74cb.1920x1080.jpg?t=1656035064,https://cdn.akamai.steamstatic.com/steam/apps/1987550/ss_b9408e97c199fd64ca5ffcb7fadf0943f79dd84f.1920x1080.jpg?t=1656035064,https://cdn.akamai.steamstatic.com/steam/apps/1987550/ss_c0316e9550fa4e1485106bb5930aadfd2fe49ce4.1920x1080.jpg?t=1656035064,https://cdn.akamai.steamstatic.com/steam/apps/1987550/ss_6ab13b7cfdbd679c17b85f107c77bd48cd9016e3.1920x1080.jpg?t=1656035064,https://cdn.akamai.steamstatic.com/steam/apps/1987550/ss_cef06cda8bd500db35013eaf5c21c5ad0576d4e1.1920x1080.jpg?t=1656035064",
    "Slug": "via-mortis",
    "Meta Title": "Via Mortis: May 19, 2022, Michael Richard Lannon and Full...",
    "Meta Description": "Looking for information on Via Mortis? Check out the release date (May 19, 2022), developer insights from Michael Richard Lannon, and a complete game su...",
    "Alt Text Image": "Official header image for Via Mortis game - Steam 1987550",
    "Canonical URL": "https://gusku.site/game/via-mortis",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Via Mortis\", \"description\": \"Looking for information on Via Mortis? Check out the release date (May 19, 2022), developer insights from Michael Richard Lannon, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Michael Richard Lannon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Michael Richard Lannon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1987550/header.jpg?t=1656035064\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}