{
    "AppID": 747210,
    "Name": "Voyage Senki VR 海洋传说 VR",
    "Release date": "Apr 15, 2018",
    "About the game": "Notice about Server Closing Temporaily Dear Users: Thanks for your support of VR game. We will close our service temporaily as we are rewrite our basic server program， so that we can update our game content and experience. The plan will take about 6 months, and during the time, our users can't login game. We will open our game when we finish the updating program. Sorry about the inconvenience for all of our users, and many thanks for your understanding. Voyage Senki VR developing team. Voyage Senki is one VR online game. The game choose sailing and sea warfare as the theme. Players in game will build the battle ships, recruit sailors and explore the unknown world to set up a new country of their own. The present version includes three contents: SLG model with the island raid, PVP model for 3 vs 3 team players, and story model demo. PVE Island raid Player can send fleet, hero, and troops to raid the target island. Goal: to destroy the base of privates or other players. You need to steer your battle ship and head the troops to attack the defence and base, try to destroy as many target as possible to get more loot or rewards in game PVP：Sea warfare for team battle (3 vs 3) Player can choose different types of battle ship to join the team battle. You will match with other two players in one team and battle with the opponent team. Destroy the ships and defence tower of the opponent will get score and resources as reward. Different ship types need to match proper skills to get the maximum of capacity. And you can make a various formation of team fleet with your teammates. Story Model Player in story model will follow the story of treasure hunting including searching maps, complete missions and defeat the monsters or privates in game to get loot and rewards. Features 1， HD graphics With Unreal 4 engine, the graphics in game has perfect HD quality for VR. In story model you may feel like a in a movie and you are the leading actor/actress in it. 2, Weather system Weather system has been set in game. Drizzling rain, snowfall, beautiful dawn and lovely sunset viewing, all make the VR world to be like a real one. 3, Free movement in game The ships can be controlled by the controllers, and player don’t need move body in large scale. Seating or standing and with your controllers, you can steer the ship in the game world everywhere. 4, OB(observer) model for game live streaming. We provide OB model for streamers who like to stream our VR game. OB model can provide more broad views for visitor, the streamer need not to have a VR set at first. With the OB model, streamer can change cameras and show the battle in all directional. Pls noticed: OB model need streamer to send an application to official to get it. We will send details requirement of applicant, and how to apply it soon.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/747210/header.jpg?t=1579068355",
    "Price": 0.0,
    "Developers": "Shanghai Superpoint Technology Co.,Ltd.",
    "Publishers": "Shandong Qianbei Technology Co. Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_113e57cbc8c1ec110c0ddcec6aa3fcfdb5519372.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_fe2c6c9c0ae680cd2cc0caa57e01411c3d8e8bac.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_5c2c642bce683a1ca82b18595835e8ea98f86cdd.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_0e82e313a9ad19dcaeb0576dc5daf3071c366749.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_1802e56203709564dd2fbf25cd698c88e20070e5.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_113e57cbc8c1ec110c0ddcec6aa3fcfdb5519372.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_fe2c6c9c0ae680cd2cc0caa57e01411c3d8e8bac.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_5c2c642bce683a1ca82b18595835e8ea98f86cdd.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_0e82e313a9ad19dcaeb0576dc5daf3071c366749.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_1802e56203709564dd2fbf25cd698c88e20070e5.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_60ded6b4a3452d73c8d45aba3302f363aec27539.1920x1080.jpg?t=1579068355,https://cdn.akamai.steamstatic.com/steam/apps/747210/ss_827abd1cc0afc8ab6ec36c0bdfaf10b0b7da2933.1920x1080.jpg?t=1579068355",
    "Slug": "voyage-senki-vr-vr",
    "Meta Title": "Voyage Senki VR 海洋传说 VR: Apr 15, 2018, Shanghai Superpoin...",
    "Meta Description": "Looking for information on Voyage Senki VR 海洋传说 VR? Check out the release date (Apr 15, 2018), developer insights from Shanghai Superpoint Technology Co...",
    "Alt Text Image": "Official header image for Voyage Senki VR 海洋传说 VR game - Steam 747210",
    "Canonical URL": "https://gusku.site/game/voyage-senki-vr-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voyage Senki VR \\u6d77\\u6d0b\\u4f20\\u8bf4 VR\", \"description\": \"Looking for information on Voyage Senki VR \\u6d77\\u6d0b\\u4f20\\u8bf4 VR? Check out the release date (Apr 15, 2018), developer insights from Shanghai Superpoint Technology Co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shanghai Superpoint Technology Co.,Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shandong Qianbei Technology Co. Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/747210/header.jpg?t=1579068355\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}