{
    "AppID": 607050,
    "Name": "Wargroove",
    "Release date": "Feb 1, 2019",
    "About the game": "Command an army, customize battlefields, and challenge your friends, in this richly detailed return to retro turn-based combat! When war breaks out in the Kingdom of Cherrystone, the young Queen Mercia must flee her home. Pursued by her foes, the only way to save her kingdom is to travel to new lands in search of allies. But who will she meet along the way, and what sinister challenges will she face? Choose Your Commander! A vibrant cast of 12+ characters! - Commanders are at the heart of Wargroove - each with their own distinct personalities and motivations. Four warring factions! - Take up arms with the Cherrystone Kingdom, Heavensong Empire, Felheim Legion, and Floran Tribes. Campaign Mode! - Follow the story of a fresh-faced and inexperienced young Queen on a quest against unworldly forces. Told through animated pixel art cut-scenes and dynamic battles. Get into the groove! Unique ultimate moves! - Commanders can use a special move called a ‘Groove’, activated only when their Groove meter is filled to 100%. Dynamic Gameplay! - Every Groove is unique to each Commander and changes up the battlefield in an entirely different way. Create your own adventure! Craft custom maps, cutscenes and campaigns! - Make the game your own using in-game editors. Advanced editing tools! - The possibilities are endless; from creating your own story-driven missions with sub-quests, plot twists, ambushes, and hidden secrets, to easily changing the rules of the game without any mods or external tools. Share your creations online! - Share your own maps and campaigns or download content built by other players! Online Play! Send your units to victory in both local and online multiplayer skirmish battles, with competitive and co-op play, as well as complete rule customisation. Arcade Mode! Learn more about each character you encounter through a trial of boisterous bouts in Arcade mode, where you’ll fight 5 different opponents in quick succession. Puzzle Mode! Outwit the enemy in Puzzle mode, using all of the strategic skills in your arsenal. Take on a series of tricky challenges where the goal is to win in just ONE turn. Secrets and Unlockables! Earn stars to unlock special content. You might even stumble across some hidden game features - old school style!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/607050/header.jpg?t=1629126232",
    "Price": 19.99,
    "Developers": "Chucklefish",
    "Publishers": "Chucklefish",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_e457861ccc57d21b4ce6ee7a116bcfdab9b23cb9.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_1c6b19b677aa872e6f3a7c4451076d630ca273d8.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_6603b30a3e75cfe75c36d750fba8cb90a816f167.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_71e3e8395adecd013280c37e24d33197c3cb2223.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_5a57b71d37437430616be79e5b27a68c8ba8ea73.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_9f08dad8eb43f8b88ee53a0d5a7dd9f79dd845ba.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_3a0a64614a4d0b38c50da6d2e9a609df459d41fd.1920x1080.jpg?t=1629126232,https://cdn.akamai.steamstatic.com/steam/apps/607050/ss_9aab4c27a3b560ed27f398f6be1c1fcfe7dc89db.1920x1080.jpg?t=1629126232",
    "Slug": "wargroove",
    "Meta Title": "Wargroove: Feb 1, 2019, Chucklefish and Full Overview",
    "Meta Description": "Looking for information on Wargroove? Check out the release date (Feb 1, 2019), developer insights from Chucklefish, and a complete game summary.",
    "Alt Text Image": "Official header image for Wargroove game - Steam 607050",
    "Canonical URL": "https://gusku.site/game/wargroove",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wargroove\", \"description\": \"Looking for information on Wargroove? Check out the release date (Feb 1, 2019), developer insights from Chucklefish, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chucklefish\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chucklefish\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/607050/header.jpg?t=1629126232\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}