{
    "AppID": 1420770,
    "Name": "Winter Resort Simulator 2",
    "Release date": "Nov 26, 2020",
    "About the game": "is a realistic and authentic simulation of a ski resort with all its exciting technical facilities and vehicles. Experience the various everyday life of the ski resort manager! Prepare the steepest slopes with originally licensed snowcats and operate various types of ropeways. Earn money and invest in new facilities to make your own ski resort the very best! Thanks to the new multiplayer mode, you can finally grab your friends and enjoy the game together! Split the work and operate cable cars, prepare slopes and handle snow cannons. Or just join your friends’ vehicles on the passenger seat and throw a snowball! Invite your friends to your map and operate the resort together in the multiplayer. Customize your character and vehicles to fit them better in your overall ski resort theme! To top it all off, the overall performance of the game has been improved. The enhanced, more realistic snow system and improved vehicle controls make the game experience even more exciting than before. Multiplayer mode enjoy with friends and manage the daily challenges of the ski resort life! Improved snow system with high resolution and more realistic snow behaviour Increased overall performance Detailed ropeways and vehicles, officially licensed by real-world manufacturers Comprehensive Modding support Dynamic environment system with changing weather Operate various different ropeway types and master the challenges of ropeway operators. Learn more about the technical background of ropeways and take a closer look at the highly complex and detailed representation of technical processes of the cable cars. Interactive tutorials explain the handling and the processes in detail step by step. All ropeways have been created with the official license of . Realistic recreation of different ropeways Officially licensed by 4 different D-Line chairlifts and gondolas Tricable gondola installation with CWA Atria gondola Authentic Connect ropeway control system Highly accurate and step by step interactive tutorials for ropeway operation Build your own ropeway in the world editor mode! More ropeways available via modding or DLCs! You can use different types of vehicles for your daily tasks in the ski resort. Snowcats, Snowmobiles and SUVs are waiting for you. Prepare the slopes with one of three snowcats. Enjoy riding a snowmobile and transport goods with the pickup. When the weather is not playing along, make use of the TR-10 snow cannon and produce fresh snow for your ski guests! All vehicles are designed with special attention to detail and provide an insight into the complex technology behind. Invite your friends to join you and either grab your own vehicle or take a seat next to you on the co-driver seat! Officially licensed by and 100 600 “Level Red” in winch and solo version Snowmobile TR-10 snow cannon Pickup More vehicles available via modding or DLCs! A detailed economy system is waiting to be harnessed by you. Pay attention to factors such as prices and happiness to increase your visibility and popularity. Ski guests are eager to ride down the slopes and want to relax in one of your mountain restaurants. Explore the village of and all its details alone or together with your friends in multiplayer mode. Enjoy the scenic view from the mountains at the very top or the take a closer look at the detailed village down in the valley. Dynamic weather changes keep you on your toes and complete the gaming experience! Detailed economic system Ski guests visiting your resort Dynamic weather system with day/night cycle Interactive gameplay tutorials Scenic mountain landscapes and detailed scenery You want to build your own resort? No problem! includes a powerful in-game world editor, which allows you to modify the world any time in-game. Build additional ropeways, design your own slopes or create your completely own ski resort! You still want more? Check out the Steam Workshop and download new ropeways, missions, vehicles and whole ski resorts created by other players! The comprehensive modding support provides you with almost no limits for new content and features. And the best of it: All of the mod content can be used both in singleplayer or multiplayer – so create the ski resort of your dreams and enjoy it together with your friends! In-game world editor included for real time map modification Comprehensive modding support for ropeways, vehicles and missions Download and share mods via the Steam Workshop Maps and mod support also in multiplayer!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1420770/header.jpg?t=1656600224",
    "Price": 24.99,
    "Developers": "HR Innoways",
    "Publishers": "Aerosoft GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_ef512d0d2d54f5835a82c35a60c76f9538ab633e.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_5169c7b83b8c2d3fb9c856aa059ad3a73635ad1a.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_2dbec060b0bd96579dc53722490acb8e565059ff.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_c00dbfd1575d6cf14e7d19701ca424238fcd2dc8.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_57d19364e3ed730807b36896ee2c63e2a12675a3.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_6fe2841e4f6c8c706c17ea02662377b041743636.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_1df8917454b8db54685e1119486f9d554961a9dd.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_8bee894f09b48bf7dd6630f2f9a5e07492555ebb.1920x1080.jpg?t=1656600224,https://cdn.akamai.steamstatic.com/steam/apps/1420770/ss_ca485d5164a763e40dbe511ba494b48c53909f2c.1920x1080.jpg?t=1656600224",
    "Slug": "winter-resort-simulator-2",
    "Meta Title": "Winter Resort Simulator 2: Nov 26, 2020, HR Innoways and ...",
    "Meta Description": "Looking for information on Winter Resort Simulator 2? Check out the release date (Nov 26, 2020), developer insights from HR Innoways, and a complete gam...",
    "Alt Text Image": "Official header image for Winter Resort Simulator 2 game - Steam 1420770",
    "Canonical URL": "https://gusku.site/game/winter-resort-simulator-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Winter Resort Simulator 2\", \"description\": \"Looking for information on Winter Resort Simulator 2? Check out the release date (Nov 26, 2020), developer insights from HR Innoways, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"HR Innoways\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aerosoft GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1420770/header.jpg?t=1656600224\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}