{
    "AppID": 1441430,
    "Name": "Wordeous",
    "Release date": "Dec 29, 2020",
    "About the game": "About Wordeous! Can you play a game with thousands of people? With Wordeous you can! Wordeous allows you to play with your friends or audience. If you are a streamer on Twitch you can play Wordeous with your audience. Thousands of people race to guess the 'Wordeous' and win! Wordeous is a fun game that will increase interactivity of streamers with audience. If you're ready for a fierce competition with random game cards in different categories and challenges, let the game begin! Wordeous is a card game in which you try to explain the 'Word of Wordeous' to your audience without saying the banned words. Wordeous uses Twitch Chat integration which allows you to receive your audience's answers simultaneously. After you login to your account, you are all set to start a new game with many different categories and hundreds of words! Wordeous is a multiplayer, co-op game that requires a Twitch account . The player explains the “Wordeous” and your friends and/or audience try to guess the Wordeous by writing their guesses to your Twitch channel’s chat. You can moderate your own match or you can play with your moderator. If you like to play with your moderators, they need to buy a copy of the Wordeous too, however the others who tries to guess 'do not' need to buy a copy! You don’t need to be a streamer to play the game, every Twitch account has a chat panel which can be used to play Wordeous! The scoreboard system allows you to see your most successful viewer of the last game or all games. You and your viewers gather points according to both your and your viewers performance. Wordeous allows you to have a highly interactive and fun time with your audience. I am not a streamer can I play Wordeous? Of course you can! Wordeous uses Twitch Chat at the moment. You don't need to be a streamer (broadcaster) to use Twitch chat! You only need a Twitch account to play Wordeous. After you login to your Twitch account, when you click on your avatar you will see channel button. In the channel page, there is a chat UI. You only need to write down this channel's name to Wordeous when creating a game. After the game starts, send your Twitch channel's link to your friends so your friends can type in their answers to that channel's chat. Wordeous will have log those answers for your match. Wordeous will have a team mode in the near future. In the team mode you will be available to play with your friends without Twitch Chat, and you will have opportunity to play against your friends. The team mode is now being tested, and not available at the moment , however, when it is ready it will be included with the base game. Wordeous Bundles Triple Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Basics Pack I: 500 words in “BASICS” category - Games Pack I: 500 words in “GAMES” category - Movies Pack I: 500 words in “MOVIE” category Game &amp; Movie Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Games Pack I: 500 words in “GAMES” category - Movies Pack I: 500 words in “MOVIE” category Basic &amp; Game Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Basics Pack I: 500 words in “BASICS” category - Games Pack I: 500 words in “GAME” category Basic &amp; Movie Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Basics Pack I: 500 words in “BASICS” category - Movies Pack I: 500 words in “MOVIE” category Game Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Games Pack I: 500 words in “GAME” category Movie Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Movies Pack I: 500 words in “MOVIES” category Basic Bundle Includes - Wordeous The Game: 200 words in “BASICS” category - Basics Pack I: 500 words in “BASICS” category",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1441430/header.jpg?t=1657588949",
    "Price": 4.99,
    "Developers": "Equitatus Studio,Junla Games",
    "Publishers": "Junla Games,Equitatus Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1441430/ss_7786141b7e7d76c53ac66aa9c5932a4f06ba0534.1920x1080.jpg?t=1657588949,https://cdn.akamai.steamstatic.com/steam/apps/1441430/ss_6471a540ccb7a45a9849326bb70aee606400aae2.1920x1080.jpg?t=1657588949,https://cdn.akamai.steamstatic.com/steam/apps/1441430/ss_7d1fa78da8adac725c3f9d252379e496cf82da01.1920x1080.jpg?t=1657588949,https://cdn.akamai.steamstatic.com/steam/apps/1441430/ss_9686bedaa45f543a4b21df3bf464a6cda46f8473.1920x1080.jpg?t=1657588949,https://cdn.akamai.steamstatic.com/steam/apps/1441430/ss_a78b02bf537d14f79e6cdee1e7a4f586c4b12a0b.1920x1080.jpg?t=1657588949,https://cdn.akamai.steamstatic.com/steam/apps/1441430/ss_51b38daea9184a17ce0c0593ab035e0a36e3cf55.1920x1080.jpg?t=1657588949",
    "Slug": "wordeous",
    "Meta Title": "Wordeous: Dec 29, 2020, Equitatus Studio,Junla Games and ...",
    "Meta Description": "Looking for information on Wordeous? Check out the release date (Dec 29, 2020), developer insights from Equitatus Studio,Junla Games, and a complete gam...",
    "Alt Text Image": "Official header image for Wordeous game - Steam 1441430",
    "Canonical URL": "https://gusku.site/game/wordeous",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wordeous\", \"description\": \"Looking for information on Wordeous? Check out the release date (Dec 29, 2020), developer insights from Equitatus Studio,Junla Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Equitatus Studio,Junla Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Junla Games,Equitatus Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1441430/header.jpg?t=1657588949\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}