{
    "AppID": 1414840,
    "Name": "Zombie Rush - Heroes",
    "Release date": "Sep 18, 2020",
    "About the game": "Zombie virus makes people to be zombie all over the world and They are coming to the last survival place. Build your station and train your army to stop the incoming zombies!. Build a base and train your army to stop the incoming zombies! This game is a build type of defense game. It is to acquire resources to produce various upgrades and even stronger units by building walls and training troops to kill invading zombies. Eight heroes have finally appeared! They have unique abilities! Protect your base from the zombies by level-up with equipped items. The more you kill the zombies, the stronger zombies will come over. This means you can acquire more resource over there. Let's go to the endless world of zombies! Buildings: 1. Command Center - When destroyed as the last survival station, the game is over. Basically It takes 10 the number of population 2. Wall -The wall keeps you safe from the zombies 3. Supply Depot - It increases the capacity of the population 4. Academy - You can produce both ghosts and marauder. 5. Engineering bay - This is the building for upgrading offence and defense of Bionic unit 6. Factory - This building is needed when producing Tank and Goliath 7. Biotechnology - it will be strong warrior after gene variation 8. Starport - This building is needed when producing drone and battleship 9. Nuclear laboratory - If you can produce the nuclear, you are allowed to upgrade Military: 1. Marine - The most cost-effectiveness unit and basic attract unit 2. Marauder - The most strongest unit in Infantry with powerful stamina 3. Ghost - Long distant infantry unit with supporting fire from backside 4. Viking - It's an warrior which has strong body through gene variation 5. Reaper - It's an warrior which has strong body through gene variation 6. Turret - No impact on the number of population as defense tower 7. Goliath - Fire 2 shots of laser to strong defense facility 8. Tank - This is key unit for flame in land war and kill all of target zombie surrounding by 9. Drone - No possible to attack zombie because it is an unit floating in the air. It fires strong laser 10. Battle Cruiser - As the best level unit, fire improved 16 lasers and kill all zombie 11. Interceptor - The interceptor are produced in the Battle Cruiser, scramble and flying to attack the targets. 12. Golem - An ancient warrior with a huge body hits the targets with a stone fist without mercy. 13. Magic Tower - It gives a huge damage to the target. Hero with Special Skill: 1. Kara - It Increases the damage of all heroes by 25% 2. Ruin - It stuns the target and nearby enemies with 50% chance for 1 second, and increases attack speed by 50% 3. Sofia - It increases attack power by 3 times 4. Oscar - It reduces damage taken to all heroes by 50% 5. Kail - It recovers 50% Life and counterattack after evading attack with 30% chance 6. Luke - It Increases damage taken by nearby enemies by 50% 7. Marcla - It Increases attack speed by 3 times 8. Zeus - It damages to nearby enemies",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1414840/header.jpg?t=1600412753",
    "Price": 3.99,
    "Developers": "MoonlightGames",
    "Publishers": "MoonlightGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_99f170467a82f3cfed4e2860e8abf92c4293c508.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_9acc9c42710890f51c9a6d7ee7603517b5b0eaf0.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_efe82b2df79834157907870d9ad563fb8998f3ec.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_b13ef88872dba33e45db2066d4934165aba4827b.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_06201f7daaacf49d7494188b5ac241516b95d95c.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_b035cec9a959c4bb1ce38832826cebd7b2044004.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_05ada8cf77c354fb10c209a2753678c7208c40a1.1920x1080.jpg?t=1600412753,https://cdn.akamai.steamstatic.com/steam/apps/1414840/ss_4a95bbe59f07f57ad42de0bc8d24a6adf607caf5.1920x1080.jpg?t=1600412753",
    "Slug": "zombie-rush-heroes",
    "Meta Title": "Zombie Rush - Heroes: Sep 18, 2020, MoonlightGames and Fu...",
    "Meta Description": "Looking for information on Zombie Rush - Heroes? Check out the release date (Sep 18, 2020), developer insights from MoonlightGames, and a complete game ...",
    "Alt Text Image": "Official header image for Zombie Rush - Heroes game - Steam 1414840",
    "Canonical URL": "https://gusku.site/game/zombie-rush-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie Rush - Heroes\", \"description\": \"Looking for information on Zombie Rush - Heroes? Check out the release date (Sep 18, 2020), developer insights from MoonlightGames, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"MoonlightGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MoonlightGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1414840/header.jpg?t=1600412753\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}