{
    "AppID": 1723560,
    "Name": "Ballads of Hongye",
    "Release date": "Nov 14, 2022",
    "About the game": "'Ballads of Hongye' is a city building game that combines innovative gameplay with construction strategy to showcase the art of ancient eastern architecture. Hongye has been long ignored by the Emperor and you have been tasked to revive it! Securing profit and stable growth is key to reviving Hongye. Every choice you make will contribute to your destiny as well as the land you rule. A small, split-second decision may result in a completely unanticipated event. You have to tend to council's requests, manage your advisers, lead your people and continuously nurture and utilize your lands to prosper while fight against the natural and urban disasters. Take advantage of industrial chains, use your advisers, decide on your investments and build your way to victory. Keep your people happy, your treasury full and your cities secure, because evaluation council will surely grade you for everything you do! But as you develop Hongye, you may notice there is a force working against you and everything is not what it seems to be. You may take a deep dive into the conspiracy and find the truth, for yourself and your people. What will you sacrifice to revive Hongye? Will you be a fearsome leader or respected through love and admiration? The choice and the stage is yours! Earning the right to rule is hard. From valleys and mountains to the desert, different lands demand different approaches. Attributes of the land impacts production, security and commerce provides a unique playing field and experience for each challenge. Cleverly designed challenges around the unique aspects of the land also greatly differ from each other. For example, some lands are abundant in minerals, but soil is barren, limiting food production. Some lands are receiving refugees while others are the frontline of the war. Prepare your resources and gold, and take the challenge on! Only constants in Hongye are you and the land itself. Production yields are different for each season, so when choosing a building plan which determines your agricultural and industrial outputs during the challenges, you should plan ahead. Hone your advisers to provide additional plans for you and, if you can successfully face the challenge, you get to keep some of your blueprints to use them at other sites in Hongye. Four seasons bring different environmental conditions, changes the landscape and potentially can cause natural disasters. Pests, droughts, famines, fires, floods, anything can wipe out your hard work unless you take precautions. Hone your security infrastructure and fight back against disasters. Be the shield your people need you to be and avoid catastrophe. Management and leadership skills. Managing a big land is not an easy task if you are alone. Recruit advisers, help them hone their skills, and attend to their needs. In return, they will help you with management, planning, and expenses. Be aware though, since other counties are also desperate for good advisers, therefore they may try to poach your advisers from you by offering a higher salary or other promises. Retain your roster by openly negotiating for it, making deals or winning salary-bidding competitions. Plan your progress with Talent tree and unlock new talents as you develop yourself as the Magistrate. Talents will assist you with disaster and adviser management and ensure the stable development of the towns. Unlock markets, workshops, banks and other special buildings to ensure Hongye's revival. The building of the world's unparalleled Wonders not only represents the highest level of architectural skills, but also is the best proof of your city's prosperity. As the town grows, so will the story behind it; Why was Hongye chosen? Who created the successive accidents? And who keeps blocking your plans for urban restoration?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1723560/header.jpg?t=1668502919",
    "Price": 8.49,
    "Developers": "Amazing Seasun",
    "Publishers": "Amazing Seasun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_39a68e7389c73722b94855464c5764b35d789907.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_417ba048cf3897ac59442ed619e985141324239d.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_e0448dab0710e62703294a62cdfd812f4f86ded9.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_75195238d6161ad54cfa4553a9117cb2d7ef8adb.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_8c8cd9a6cd7012081f1cf73725d4d27169334f86.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_7582234eaa318b18b12e3772a0bbda9c578d6928.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_441a8f485c7c1aa20f60f88a9414e8910aca75fd.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_0b84713419c7cd2d3210a1b8275eb3a092ed94b8.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_5ea179895648798a16f116f10d83472e9546592c.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_338818cad7fcbe682e8521ead4473ced5ba386fe.1920x1080.jpg?t=1668502919,https://cdn.akamai.steamstatic.com/steam/apps/1723560/ss_ee2dae57592f8d75c5efdbc843200be8c5c4f063.1920x1080.jpg?t=1668502919",
    "Slug": "ballads-of-hongye",
    "Meta Title": "Ballads of Hongye: Nov 14, 2022, Amazing Seasun and Full ...",
    "Meta Description": "Looking for information on Ballads of Hongye? Check out the release date (Nov 14, 2022), developer insights from Amazing Seasun, and a complete game sum...",
    "Alt Text Image": "Official header image for Ballads of Hongye game - Steam 1723560",
    "Canonical URL": "https://gusku.site/game/ballads-of-hongye",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ballads of Hongye\", \"description\": \"Looking for information on Ballads of Hongye? Check out the release date (Nov 14, 2022), developer insights from Amazing Seasun, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Amazing Seasun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Amazing Seasun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1723560/header.jpg?t=1668502919\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}