{
    "AppID": 2199830,
    "Name": "Bavovna included!",
    "Release date": "Nov 19, 2022",
    "About the game": "[[b]Bavovna included! - a satirical, casual indie game in the Shoot 'em up genre with pixel graphics about Russian troops in Ukraine. [/b] Destroy various hordes of enemies with your highmars in different locations and defeat their bosses! Do not forget about upgrades, they will help you win! Historical timeline and background of the game On February 24, 2022, a full-scale war began in our country - Ukraine. russia began massive missile attacks on our cities, targeting military facilities, russian precision has already destroyed thousands of civilian homes across the country. Ukraine's partner countries, such as the USA, Germany, France, etc., predicted that Ukraine would last no more than a few days... At the time of this writing, the war has been going on for nine months. Millions of people, one way or another, faced the consequences of schizophrenia and inferiority complexes of the russian military-political leadership (aka vladimir vladimirovich putin). Tens of thousands of people have already died, including children, pregnant women, and the elderly. In the city of Mariupol alone (still occupied at the time of writing), the number of victims of russian aggression and torture is more than 20,000 people! (this is unofficial data, real numbers may be much higher) The developers of the game in no way minimize the importance of war, tragedy and pain that we ourselves and our brothers and sisters have faced. The purpose of the game is to highlight for our foreign friends the real 'greatness and might' of the russian army. But one information field will not help our Heroes. So we decided that in addition, we will send 30% of the profit of the game to our dear volunteers: 'Return alive' and 'Serhiy Prytula Foundation'. In addition, you can make a donation to the official funds for the needs of the armed forces of Ukraine by yourself. What's in the game now? Please see the related item in the early access section. The game may contain bugs. Let us know if you find a bug. What are we planning to add? More characters! More levels, locations! More improvements! New mechanics and spontaneous events! Endless game mode! How fast do we plan to develop the game? At the moment, we are just beginners in game development, so we don't have much experience in updating something. However, we plan to seriously work on this project until we decide for ourselves that the game has taken on the form in which it was conceived. We are developing, working on the game and striving to earn your trust and love with our approach to details and quality. Support us and together we will be able to prove that Ukrainian gamedev is really unique and advanced!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2199830/header.jpg?t=1668869405",
    "Price": 5.66,
    "Developers": "Ironbellys Crew",
    "Publishers": "Ironbellys Crew",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2199830/ss_fb22ad50b468533d7c73d71af447b6ac42fb9372.1920x1080.jpg?t=1668869405,https://cdn.akamai.steamstatic.com/steam/apps/2199830/ss_35fe90266ed0eef6cc57825a72a47a0a4f82aa02.1920x1080.jpg?t=1668869405,https://cdn.akamai.steamstatic.com/steam/apps/2199830/ss_b4361b1642f66a93cdb0656a3dedf2d87a3ba7ec.1920x1080.jpg?t=1668869405,https://cdn.akamai.steamstatic.com/steam/apps/2199830/ss_4be04e4c147cd157569c5a7ee86bc50fed5e9886.1920x1080.jpg?t=1668869405,https://cdn.akamai.steamstatic.com/steam/apps/2199830/ss_a5a234aa2fe218319088d0f613a42d57cb154bd3.1920x1080.jpg?t=1668869405,https://cdn.akamai.steamstatic.com/steam/apps/2199830/ss_9bd50c7cfdb9326a6ed0d3e2aa0e3ba19115fe45.1920x1080.jpg?t=1668869405",
    "Slug": "bavovna-included",
    "Meta Title": "Bavovna included!: Nov 19, 2022, Ironbellys Crew and Full...",
    "Meta Description": "Looking for information on Bavovna included!? Check out the release date (Nov 19, 2022), developer insights from Ironbellys Crew, and a complete game su...",
    "Alt Text Image": "Official header image for Bavovna included! game - Steam 2199830",
    "Canonical URL": "https://gusku.site/game/bavovna-included",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bavovna included!\", \"description\": \"Looking for information on Bavovna included!? Check out the release date (Nov 19, 2022), developer insights from Ironbellys Crew, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ironbellys Crew\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ironbellys Crew\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2199830/header.jpg?t=1668869405\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.66, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}