{
    "AppID": 1836390,
    "Name": "BLANK SPACE",
    "Release date": "Dec 2, 2022",
    "About the game": "Combat in zero gravity In BLANK SPACE, you infiltrate an automatically generated enemy spaceship and fight in zero gravity. The internal structure of the spaceship varies. Each room has its own gimmick, floating debris, and destructible walls. The armory, conference room, cafeteria and even restrooms can be used as a stage for battle as you destroy the enemy's living quarters. Fight alongside your friends, who can sometimes do more than you can. Various game rules A small spaceship is not a safe vehicle in the harsh universe. You'll have to fight back against enemy battleships without fear. Attack the transporters without mercy. Do everything you can to survive. Don't hesitate to uncover the graves of the dead from destroyed spaceships to obtain new weapons, or to eliminate annoying bounty hunters by trickery. Customizable equipments There are over 20 different types of guns and sub-weapons available. Find the most powerful weapons in the universe and creatively build your battles. Collect limited resources to increase the auto-healing shield of your armored spacesuit, increase the power of your jetpack, and enhance the performance of your weapons. Story It's been more than half a century since the golden age passed in the space country of Remilia. The ever-worsening security of the nation has been protected by the underworld of Don Alessio Rocco and his family, the Rocco Family. However, with the demise of the family, the distorted equilibrium is broken. The Skulls, a gang that has suddenly appeared in space, is a group of low-life misfits led by Frank, a man who once betrayed the Rocco Family and crossed seven universes. After sinking the Rocco family's base space battleship, Frank seems to be planning to take over the country's criminal underworld. Lino Rocco, the son of Don Alessio, who just barely escaped the collapse of Rocco, has two choices. He can live out his life in humiliation in the next universe, or he can take revenge on Frank and his 'Skulls', who are now in league with the Police Department. Regain the honor of the Rocco family. In the decadent world of BLANK SPACE, you'll battle enemy mobsters, corrupt police organizations and politicians, dirty bounty hunters, lazy mercenaries, crazy drones, and unknown new weapons. You can't escape this fate. Because you are the Don Lino Rocco, the king of the underworld and the true heir to the Rocco family, the mafia that rules this universe. The time period is limited. In Remilia, the notorious Anti-Mafia Bill has already been passed. Before this law goes into effect, the universe must know that the Rocco family is back. Look at the tactical map on the spaceship and figure out a way to collect enough money before the deadline. It doesn't matter how dirty you get. Whoever wins is right.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1836390/header.jpg?t=1670049965",
    "Price": 11.24,
    "Developers": "Michigames",
    "Publishers": "Michigames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_34d821ccd4d4827aab4f1e78d9f8c62cd7dd0634.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_27b21d27cbac6ca4d724049ba220d4d07fccec9a.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_fb20a67caeaed0429f1f9577a75140da22df8d97.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_d86f926e8f4a172fa08caf15ca0812c94c5fe225.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_0200ddac7dd0c4bfa4958894b5de37213ebc8872.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_ea182789744dc634fabd1bdf148f7055ed245591.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_ecf38dfbdb92b9d7dd1d679d9cabc315b84ce859.1920x1080.jpg?t=1670049965,https://cdn.akamai.steamstatic.com/steam/apps/1836390/ss_3ca91d82fa90e936a5eb028b42aea3d9337a3d37.1920x1080.jpg?t=1670049965",
    "Slug": "blank-space",
    "Meta Title": "BLANK SPACE: Dec 2, 2022, Michigames and Full Overview",
    "Meta Description": "Looking for information on BLANK SPACE? Check out the release date (Dec 2, 2022), developer insights from Michigames, and a complete game summary.",
    "Alt Text Image": "Official header image for BLANK SPACE game - Steam 1836390",
    "Canonical URL": "https://gusku.site/game/blank-space",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BLANK SPACE\", \"description\": \"Looking for information on BLANK SPACE? Check out the release date (Dec 2, 2022), developer insights from Michigames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Michigames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Michigames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1836390/header.jpg?t=1670049965\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}