{
    "AppID": 1732920,
    "Name": "Bulanci",
    "Release date": "Nov 14, 2022",
    "About the game": "Bulanci is an action multiplayer and easy-to-play party game where you take pillow fights with your frenemies to the next level. Make your sleepless nights memorable by being fluffy and deadly! Control the characters of fighting pillows called Bulanci. They are cute, chubby, seemingly clumsy things, but they behave and look like tough warriors, and when combined with weapons, they deliberately take the term 'pillow fight' to a comical extreme. Pillow fights are in again Fight as individuals or in teams and try to collect as many points as possible for eliminating opponents Each level offers different mechanics requiring you to adapt your combat tactics Wreak havoc upon the battlefield with seven deadly weapons in four different modes: Deathmatch, Conquest, Capture the Flag, and Campaign (coming with the full release) Have a pillow talk with up to 8 players on a single device (up to 4 players on a single keyboard), with more players joining over the network or with computer-controlled opponents Cause severe concushion to other pillows in a special Battle Royale mode with up to 32 players Shoot other pillows under the cover of darkness, on a hot summer day or while your feathers are soaked in rain Bulanci are more than fea(the)rless shooting Customize your character – choose color, appearance, pattern, and small accessories such as helmet, sunglasses, or headphones Play soccer and other minigames during ceasefire Get comfortable with a cup of your favorite drink and read pillow’s poetry Reveal more about the soft Bulanci nation in the history book Based on the original game Bulánci (Combat Pillows), released in 2001, which has gained a strong community of players in some countries We will win, we’ll get the award, Let’s have a drink, enjoy the ride. Peacock feathers as a reward If you’re fighting on our side! Lock &amp; Loaded Deathmatch - players can either play on their own or split into two teams. The eliminated pillow soldier does not stop playing, the player who got hit simply respawns on the battlefield in a short while. The game can be limited by time or the number of lives each player has. At the end of the game, statistics are evaluated – who was the best in the fight, how many points each player scored and some exceptional moments of the fight are shown. Conquest - purely a team game mode. Teams of players try to eliminate their opponents from the game within a specified time. The eliminated pillow becomes a captive of the opposing team. Their teammates can free them during the game. The winning team is the one that captures all the opponents or enters the enemy base. Capture the Flag - players on both teams try to capture the opponent's flag and bring it back to their base. The first team to succeed wins. Campaign (not included in Early Access) - story mode will take players through some memorable moments of Bulanci’s history. Each mission has different specifics, different goals, and unique feeling, different from the classic gameplay. As soon as you close your eyes It's time to sleep when darkness falls, Enjoy your dreams during the night. Yet you want more, the game still calls, But that is simply not right. Your bedroom drowns in complete silence, The calm being deceptively nice. You hear the screams, you feel the violence, As soon as you close your eyes. If you get up, there is no end, no reward, either, no glory. Better stay off, don’t fight, my friend, Wait for another story. Life is not easy, life is no fun, Bulánci will tuck you in bed. But before that, they’ll grab a gun And make sure that you're dead.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1732920/header.jpg?t=1668510963",
    "Price": 12.79,
    "Developers": "SleepTeam",
    "Publishers": "SleepTeam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_1f79c020a42ea1ea254f440c30d55ca10d990f8a.1920x1080.jpg?t=1668510963,https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_4162b1dc32501363408f7d61fe2c4c4e19b19466.1920x1080.jpg?t=1668510963,https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_ba98df1578392cd6fafc3322859a68b073223dbc.1920x1080.jpg?t=1668510963,https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_6c833872f5055aaf323d3c8f67ccdfcc8c277ea8.1920x1080.jpg?t=1668510963,https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_f080b72ab83cdb3203edda646ec9bc98a50c0709.1920x1080.jpg?t=1668510963,https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_068b5f1adad07a242e9745a3f608c523da25e41b.1920x1080.jpg?t=1668510963,https://cdn.akamai.steamstatic.com/steam/apps/1732920/ss_a5f1cc67e9afb8dc07f1b619ccbe634d6aad60f9.1920x1080.jpg?t=1668510963",
    "Slug": "bulanci",
    "Meta Title": "Bulanci: Nov 14, 2022, SleepTeam and Full Overview",
    "Meta Description": "Looking for information on Bulanci? Check out the release date (Nov 14, 2022), developer insights from SleepTeam, and a complete game summary.",
    "Alt Text Image": "Official header image for Bulanci game - Steam 1732920",
    "Canonical URL": "https://gusku.site/game/bulanci",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bulanci\", \"description\": \"Looking for information on Bulanci? Check out the release date (Nov 14, 2022), developer insights from SleepTeam, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SleepTeam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SleepTeam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1732920/header.jpg?t=1668510963\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}