{
    "AppID": 1076120,
    "Name": "Dwarven Skykeep",
    "Release date": "Dec 1, 2022",
    "About the game": "Learn how to use your deck of tool, spell, and weapon cards to construct an enchanted castle. Then build workbenches, forges, alchemy laboratories, and castle defenses. Order around your fellowship of dwarves to prevent fires, floods, and lightning strikes. Protect the tower from enemies and envious wizards seeking to destroy your legacy. Adapt to the unique landscape, fight off enemy spawns, and earn a fresh pack of cards each time you play. Dwarven Skykeep's main story takes players through a magical world full of incredible moments, hilarious characters with side quests to offer, and plenty of opportunities to specialize your fancy new equipment. Meet the great wizard Dr. Sevendar Kness, a master in card magic The sorcerer arrives in Dwarven City with a mission. Find out the exact details of this mysterious mission by helping Dr. Kness do what he does best: build the coolest towers using different types of cards. Choose them wisely before each level. Build, upgrade and defend your towers with the help of dwarves and gnomes Your small but bold helpers can build, repair and upgrade rooms, craft tools, extinguish fires, and even fight enemies. Just provide them with constant access to beer, and they'll do anything you command! Explore five distinct worlds, each with unique mechanics On your way to a mission, you will face difficult and sometimes insane challenges. Heat up your tower in the Winter World, drive a train in a desert, keep your tower flying with 'Levitron,' and attempt to return the eaten sun while making your way through the Shadow World. You will encounter tons of obstacles in every level, but nothing is impossible - especially on the fifth try. Meet tons of interesting and charismatic characters, monsters and bosses The talented goblin inventor Ghyrka Yo wants to destroy your tower. The bad-tempered Snow Queen freezes everything onsight. Cunning thieves strive to steal your cards. Then there's Gypsy Witch Irinia, Sevendar's old friend... and plenty of other personalities in store. Uncover references to cult films, novels, and even other games Dwarven Skykeep ain't just about Lord of the Rings and Harry Potter. There are plenty of other interesting tributes hidden throughout the game. Meet Genkins the Paladin (he loves his chicken!), help a predestined hero Lightstar find Excalibur, and, somewhere in the desert, discover a big worm named Shah-e-khulud...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1076120/header.jpg?t=1670011715",
    "Price": 14.44,
    "Developers": "Hack The Publisher",
    "Publishers": "Ravenage Games,East2West Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_8af61c3462899db2a3d308a14b94a71cf5b0745d.1920x1080.jpg?t=1670011715,https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_d61ec1983d56fd33b3a9803bfcbb83b9953b0e20.1920x1080.jpg?t=1670011715,https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_37c09f3d4d55d9077cc6bc0c8c2652dcc75a846e.1920x1080.jpg?t=1670011715,https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_a7bbca05bcb808186105b03d413686630476f526.1920x1080.jpg?t=1670011715,https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_e7543ea8218a7440d00e54e308347054b53f2dda.1920x1080.jpg?t=1670011715,https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_ef99343ba9f51483a418e48ef2012dfb01271039.1920x1080.jpg?t=1670011715,https://cdn.akamai.steamstatic.com/steam/apps/1076120/ss_096c1db96e8411dfb9c54b538ae0bb2a2622981b.1920x1080.jpg?t=1670011715",
    "Slug": "dwarven-skykeep",
    "Meta Title": "Dwarven Skykeep: Dec 1, 2022, Hack The Publisher and Full...",
    "Meta Description": "Looking for information on Dwarven Skykeep? Check out the release date (Dec 1, 2022), developer insights from Hack The Publisher, and a complete game su...",
    "Alt Text Image": "Official header image for Dwarven Skykeep game - Steam 1076120",
    "Canonical URL": "https://gusku.site/game/dwarven-skykeep",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dwarven Skykeep\", \"description\": \"Looking for information on Dwarven Skykeep? Check out the release date (Dec 1, 2022), developer insights from Hack The Publisher, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hack The Publisher\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ravenage Games,East2West Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1076120/header.jpg?t=1670011715\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.44, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}