{
    "AppID": 1969260,
    "Name": "Ewephoria",
    "Release date": "Dec 1, 2022",
    "About the game": "It is the year 2022 and the sheep have escaped from their pens. This is the worst calamity to happen in that year, though the humans appear to be too preoccupied to realise this. Your mission, should you choose to accept it, is to go out there and find and herd all sheep. Yours, Sheepdog High command Ewephoria is an arcade style game where you're a group of sheepdogs trying to herd sheep to safety. Designed to work best with a group of friends crowded around the screen you each use the interactive controllers on your phones to move your sheepdogs around the map, chasing the sheep and saving the day! On your sheepherding travels, you'll encounter various other animals, from angry cows which trample sheepdogs underfoot to hungry wolves which are on the hunt for some nice tasty sheep. Most of the levels are designed to be cooperative, so work together with your fellow sheepdogs to herd the sheep in the fastest time possible... whilst keeping the sneaky wolves away of course! If you're feeling competitive though, challenge each other to set high scores on your personal leaderboards, or play the head-to-head levels to see which is the best team of sheepdogs on the farm! Ewephoria also has three special game modes where your sheepdogs can 'relax' by competing in flying fighter jets, sailing ships and playing cards against each other... The controller system runs entirely through a webpage on your phone, so you just need to scan the in-game QR code and you're good to go! Features Use your smartphone as the controller As a sheepdog herd the sheep into their pen Avoid cows looking to trample you Prevent wolves from eating the sheep Over 20 hand crafted levels Millions of procedurally generated levels Both cooperative and competitive levels Designed for multiplayer, but most levels are also playable single player if you want to refine your sheepherding skills! 3 Special Game Modes Age Of Sail Game Mode Fighter Jet Arena Game Mode In the time between missions you can play the card game known as Karma, Palace, Shed and Poohead An unlimited number of players, limited only by the size of your living room! Note: iOS mobile devices are not fully supported.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1969260/header.jpg?t=1669928130",
    "Price": 3.99,
    "Developers": "ROGR Games",
    "Publishers": "ROGR Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1969260/ss_25b755edd13b38bd63e9c159ecbaaf51d53bfbac.1920x1080.jpg?t=1669928130,https://cdn.akamai.steamstatic.com/steam/apps/1969260/ss_54cbb54056a48bcb9eb2e48692c47200ca2f2e00.1920x1080.jpg?t=1669928130,https://cdn.akamai.steamstatic.com/steam/apps/1969260/ss_88e800244e51e23fbd9345170ee7ea46d274a1da.1920x1080.jpg?t=1669928130,https://cdn.akamai.steamstatic.com/steam/apps/1969260/ss_07d3c2daf27edaf026fb56bbb3681fd77d15bfd2.1920x1080.jpg?t=1669928130,https://cdn.akamai.steamstatic.com/steam/apps/1969260/ss_c36a5a7c1f9b4efb16ddf12a8ca1b1b202344e67.1920x1080.jpg?t=1669928130,https://cdn.akamai.steamstatic.com/steam/apps/1969260/ss_d413b2f1de14650c209e85c128fc4feeddbf9e3e.1920x1080.jpg?t=1669928130",
    "Slug": "ewephoria",
    "Meta Title": "Ewephoria: Dec 1, 2022, ROGR Games and Full Overview",
    "Meta Description": "Looking for information on Ewephoria? Check out the release date (Dec 1, 2022), developer insights from ROGR Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Ewephoria game - Steam 1969260",
    "Canonical URL": "https://gusku.site/game/ewephoria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ewephoria\", \"description\": \"Looking for information on Ewephoria? Check out the release date (Dec 1, 2022), developer insights from ROGR Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ROGR Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ROGR Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1969260/header.jpg?t=1669928130\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}