{
    "AppID": 1961250,
    "Name": "Extinction Eclipse",
    "Release date": "Nov 17, 2022",
    "About the game": "Extinction Eclipse is a space action strategy game, where you are in command of the human forces in their effort to find the necessary resources to build a fleet. You start with only a couple of miner ships and a probe, and your mission is to find and conquer asteroid fields that can be mined, in order to extract their precious metals and water. You will build your fleet gradually, and before each mission, you can choose which ships to use. After you build your ships, any of them that manage to survive during the mission will become part of the available fleet. You will also accumulate unused metal and water to trade for upgrades and power ups in the store. These upgrades will make you faster and stronger , increasing your chances of succeeding. But be careful, the aliens will not sit back and relax while you expand. They will attack your bases by surprise, so be prepared to defend them constantly! Story There is a point in space between the Sun and Earth, known as the Lagrange L1, that is gravitationally stable. Anything you place in there, will stay there. This is the spot our scientists observed when temperatures on Earth started to drop inexplicably after a reduced input of sunlight. What they found was disturbing. A grid of gigantic hexagon-shaped objects was being build on Lagrange L1 by an unknown alien intelligence. They were hostile to the space probes we sent to explore. Humanity has only one path: build a fleet of combat spaceships, destroy the grid, and the aliens building it! The Story Mode is divided into campaigns with several missions each. Completing a campaign will unlock others so you can play in a non-linear way. You decide the path to victory. The Skirmish Mode allows you to configure the match: map size, goal, initial fleet and upgrades, etc. The world will then be procedurally generated, offering a unique experience everytime! Key Features Resource mining and management: Use miner ships to mine water and metal asteroids. Miners will bring the resources to the closest Space Station or resource deposits. Use them to build your ships, bases and for upgrades. Base Building: Expand your territory by building space stations, communication satellites, research centers and resource deposits. Defend your base: strategically place defense towers around your bases and precious resources. They will activate automatically and attack enemies that get too close. Resupply mission: if you are running low on ships and resources, you will have access to a procedurally generated mission with asteroids and just a few enemies. Upgrade store: trade accumulated metals and water for upgrades for your fleet. Your ships can be faster, stronger and sturdier! We put great effort into adapting the controllers so you can enjoy this RTS experience using a controller. Make sure to complete the short tutorial, it will explain the mechanics, user interface and controls.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1961250/header.jpg?t=1669008062",
    "Price": 11.99,
    "Developers": "TuanisApps",
    "Publishers": "TuanisApps",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_eef97122b57068245a239748e3c01257490a63a9.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_6acc451ca2869453aa67268720121b1c540a2d20.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_12589fdadf85a8beec478a6637918d0bb974bafb.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_9f8c0e27ea94729865a3d18ba48363a66dde3ef4.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_8ef50905462ee27fbf527c74a177954ca30c7e82.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_60fdf699c88dd756e51c4d373f2cb4e6cae97fbe.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_94f4c668730dcbecaf92755eea024c9dcbadbfd9.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_9a27cbe3ac3e933b5fbdd15d624ed445a1724a8e.1920x1080.jpg?t=1669008062,https://cdn.akamai.steamstatic.com/steam/apps/1961250/ss_a141226de588118065010c36c94b9e956a518a94.1920x1080.jpg?t=1669008062",
    "Slug": "extinction-eclipse",
    "Meta Title": "Extinction Eclipse: Nov 17, 2022, TuanisApps and Full Ove...",
    "Meta Description": "Looking for information on Extinction Eclipse? Check out the release date (Nov 17, 2022), developer insights from TuanisApps, and a complete game summary.",
    "Alt Text Image": "Official header image for Extinction Eclipse game - Steam 1961250",
    "Canonical URL": "https://gusku.site/game/extinction-eclipse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Extinction Eclipse\", \"description\": \"Looking for information on Extinction Eclipse? Check out the release date (Nov 17, 2022), developer insights from TuanisApps, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"TuanisApps\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TuanisApps\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1961250/header.jpg?t=1669008062\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}