{
    "AppID": 2207160,
    "Name": "Fallen Stars",
    "Release date": "Nov 25, 2022",
    "About the game": "Gameplay This game is a puzzle-based VR space themed game. Player need to complete several puzzles in order to progress throughout the game. Several cutscenes are available between scenes. Player need to complete the puzzles accordingly since all the puzzles are gated among each other. In-game voice line will guide player to progress. In-game tutorial is also available for player to practice moving in a Zero-gravity environment using VR. Description Fallen Stars is a immersive First Person VR game that tells the story of a team of astronaut crew performing several duties on the space station. The story started by the user, Thomas Jackson, an astronaut from the present, searching the net for an article about the astronauts during a space mission in January 1975. But some white light flashed through and Thomas fainted. He woke up to be an astronaut from the past, Thomas William at the I.C.E.S 1 (International Centre Energy Space Station). Upon entering the station, Thomas William performed several duties including adjusting the radio frequency, fixing the power supplies and restore the wire connections. After that, three cosmonauts return to their spacecraft and re-enter earth. During their return to earth, unexpected things happen to them. This game challenges player to finish all the puzzles as soon as possible. Features Zero Gravity Movement which provide a very unique way to move in VR Immersive Space Station Environment in VR Easy to understand puzzles for player to play Tutorial option for those who want to experience Zero Gravity Movement before entering the main game Storytelling Cutscenes Voice acting between characters Immersive In-Game Music Fallen Stars is a game developed by FlyStar. We are a team of university students participating a program called 'DICE' which challenges teams to develop a full-functioning VR Application in 3 months period. We do not have any background in game development and due to time constraints, several bugs are expected and the game is not fully optimized. However, we do appreciate all the supports! :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2207160/header.jpg?t=1669367307",
    "Price": 0.0,
    "Developers": "FlyStar",
    "Publishers": "FlyStar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2207160/ss_64e31e970af389dee5bbf2f05903c76efd8d98e3.1920x1080.jpg?t=1669367307,https://cdn.akamai.steamstatic.com/steam/apps/2207160/ss_f4e6b3b45edefa5e9e1f9c585264a0d2fa25bb46.1920x1080.jpg?t=1669367307,https://cdn.akamai.steamstatic.com/steam/apps/2207160/ss_d1a41a0531a095c82b4f946492254248b025d0ad.1920x1080.jpg?t=1669367307,https://cdn.akamai.steamstatic.com/steam/apps/2207160/ss_0de410e559191228b4f7370f0397f3e29399facc.1920x1080.jpg?t=1669367307,https://cdn.akamai.steamstatic.com/steam/apps/2207160/ss_d283963ef1837c3312dfe4b670cf926cea25d5fa.1920x1080.jpg?t=1669367307",
    "Slug": "fallen-stars",
    "Meta Title": "Fallen Stars: Nov 25, 2022, FlyStar and Full Overview",
    "Meta Description": "Looking for information on Fallen Stars? Check out the release date (Nov 25, 2022), developer insights from FlyStar, and a complete game summary.",
    "Alt Text Image": "Official header image for Fallen Stars game - Steam 2207160",
    "Canonical URL": "https://gusku.site/game/fallen-stars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fallen Stars\", \"description\": \"Looking for information on Fallen Stars? Check out the release date (Nov 25, 2022), developer insights from FlyStar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FlyStar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FlyStar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2207160/header.jpg?t=1669367307\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}