{
    "AppID": 1717990,
    "Name": "Fangs",
    "Release date": "Nov 30, 2022",
    "About the game": "The Fangs have stood at the center of culture and conflict since their eruption thousands of years ago. With the power to imbue living beings with great power, the (enchanted) elemental crystals they spread across the land have become the world’s most sought after resource. Now, after the Great Calamity, the Fangs' magic grows unstable and the Fractured Realms teeters on the brink of a new age of arcane upheaval. Who will forge their legend in this new era of conflict and who will be forgotten? It is yet to be decided. In Fangs, we want to make sure everyone finds a home with one of our heroes. We will create heroes with diverse backgrounds and styles, so that folks can relate with any one of our heroes. We hope that each hero inspires players to push the boundaries of their plays, and find new answers to challenges every single round. With our diverse hero roster comes an even more in depth customization system. With the ability to change augments each round, you as a player can change your playstyle to match any team comp challenge. Need a bit more healing on your team? No problem, there’s an augment for that! Want to feel like an invincible god? Yea, you guessed it, we got an augment for that too. We know the pain of overly long, drawn out matches, so we want our players to be able to go straight to the action. Matching the fast paced combat gameplay with the adaptability of augments makes it so you get to the action faster. Being able to change on the fly, and quickly assess situations are paramount for being great at Fangs. Fangs is a game based on strategic teamwork that allows for group recognition. We want you to always feel a part of a community full of respect and camaraderie, both in game and outside it. As there are multiple win conditions, you must work as a team to win the match. Fangs invites both new players and genre veterans, as it’s easy to learn and hard to master. We aim to lower the MOBA entry barriers so everyone has the opportunity to showcase their skill and shine. We will be updating and balancing the game every 2 weeks, to make sure Fangs always feels fresh.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1717990/header.jpg?t=1670041984",
    "Price": 0.0,
    "Developers": "Hidden Leaf Games",
    "Publishers": "Hidden Leaf Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_d4ffaae094557a8b545ee140feb47d925bd76406.1920x1080.jpg?t=1670041984,https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_69cac2a5be449d69cab4d24bca4f0e745f19cc70.1920x1080.jpg?t=1670041984,https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_053c271f5bcec8c6d9bffc68d10bfc9970471976.1920x1080.jpg?t=1670041984,https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_48e9cf2ad65d94770abfb8cedcab77bab01b0b15.1920x1080.jpg?t=1670041984,https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_1f17d7f24c65592db5dc14147db0dbfb1b889d6c.1920x1080.jpg?t=1670041984,https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_5fdd4a9dbcd625e156e3f4b0ada893a4bf0ad120.1920x1080.jpg?t=1670041984,https://cdn.akamai.steamstatic.com/steam/apps/1717990/ss_44bb948d898ea9cc1b3ecd7d994ad116ca84a5b6.1920x1080.jpg?t=1670041984",
    "Slug": "fangs",
    "Meta Title": "Fangs: Nov 30, 2022, Hidden Leaf Games and Full Overview",
    "Meta Description": "Looking for information on Fangs? Check out the release date (Nov 30, 2022), developer insights from Hidden Leaf Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Fangs game - Steam 1717990",
    "Canonical URL": "https://gusku.site/game/fangs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fangs\", \"description\": \"Looking for information on Fangs? Check out the release date (Nov 30, 2022), developer insights from Hidden Leaf Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hidden Leaf Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hidden Leaf Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1717990/header.jpg?t=1670041984\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}