{
    "AppID": 715400,
    "Name": "Frozen Flame",
    "Release date": "Nov 17, 2022",
    "About the game": "Frozen Flame is a Survival RPG set in the vast world of Arсana, an ancient land once governed by the Dragons. Addled by the curse, it now beckons for souls capable of harnessing the powers of the primeval magic. Those who seek to govern over these lands will have to amass power and allies to bring the fight to the Ice Citadel, home of the Faceless that spreads rot over the realm. Tailored for those who love to explore, Frozen Flame offers so much more than just an open world full of beautiful vistas and ancient ruins riddled with monsters. With a fully-developed progression system, it’s up to you to choose your own path and endure the harsh world full of mystery, threatening enemies, and gigantic creatures guarding the secrets of this world. Recruit allies, build your keep, gear up with dozens of craftable options and get exploring in search of ancient artifacts left by the ancients. No journey is like any other in this realm: bound by magic, the shape of the world is unique for every playthrough, with islands, floating in the air, changing the layout in an unpredictable way. Spread the wings given to you by the power of Frozen Flame and explore the ever-changing landscape in search of ancient treasure. Shape the Destiny of the World Looming over the horizon, with its massive silhouette dominating the landscape, stands the Ice Citadel. It now captured by the Faceless – a being of immense power, blighting the lands of Arсana. His power grows ever stronger, sending waves of destruction across the lands which will freeze the world in eternal ice if it is not stopped. Rediscover the Knowledge of the Ancients Your ancestors were once beings of great power, who shaped these lands with unbending wills of iron and the skills of great masters. Gather their knowledge, absorb their essence to obtain their powers and choose your own path in this fully-developed RPG world. Reimagined survival experience Build a fortress capable of protecting your party and the possessions you’ve amassed along the way. While keeping the destructive powers of eternal winter at bay, it provides you with much-needed means of production to overcome the harsh conditions of the cursed lands and rest when the breath of ancient Dragons brings the destructive powers of winter to your doorstep.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/715400/header.jpg?t=1668846086",
    "Price": 25.49,
    "Developers": "Dreamside Interactive",
    "Publishers": "Ravenage Games,2P Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_af23a9c56af5670ffce15c72eab18370d38091d1.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_9604a8962d4da6c5714c7ff6cf5a6af4c6a13b08.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_51e97ef2e783c636ecf0529369b1c58e6b9bca0c.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_a7348d43e819c19cb8ebfa197ae784d7e288e520.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_a84f30792c12f222054cf77c9c8c9925cc59ab7d.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_2cde2900204f5a4998d609adb8278f7a4da6286a.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_d5073f223dd04d5ea13137e3d0c329e23e389977.1920x1080.jpg?t=1668846086,https://cdn.akamai.steamstatic.com/steam/apps/715400/ss_e5834be9f153b2585932a7b87783e32542673ee7.1920x1080.jpg?t=1668846086",
    "Slug": "frozen-flame",
    "Meta Title": "Frozen Flame: Nov 17, 2022, Dreamside Interactive and Ful...",
    "Meta Description": "Looking for information on Frozen Flame? Check out the release date (Nov 17, 2022), developer insights from Dreamside Interactive, and a complete game s...",
    "Alt Text Image": "Official header image for Frozen Flame game - Steam 715400",
    "Canonical URL": "https://gusku.site/game/frozen-flame",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frozen Flame\", \"description\": \"Looking for information on Frozen Flame? Check out the release date (Nov 17, 2022), developer insights from Dreamside Interactive, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dreamside Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ravenage Games,2P Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/715400/header.jpg?t=1668846086\", \"offers\": {\"@type\": \"Offer\", \"price\": 25.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}