{
    "AppID": 2202270,
    "Name": "Hunting Life VR: Dove Season",
    "Release date": "Nov 22, 2022",
    "About the game": "NOTE : This game requires a Meta / Oculus VR headset and controllers (Rift S or Quest 2 with Link). Bag your limit in a one-of-a-kind VR experience! From one of the designers of the best-selling Deer Hunter and Bird Hunter series of the past comes a thrilling new hunting game, designed and developed from the beginning to be played in VR! The Hunt Deep in the immersion of virtual reality, keep your eyes peeled for doves and your shotgun at the ready. But be sure that your target is a dove and not a crow or songbird or you’ll have to pay a fine for breaking the game laws! Earn money for each dove that you bag and spend your earnings to buy new guns or “power ups” for a day (such as highlighting downed birds to make them easier to see). Choose your shotgun from a wide assortment of pump-action, semi-auto, side-by-side and over-under (in 12ga, 20ga, and .410). Bag rare banded birds and see the location where they were banded and the age of the bird on special certificates in your farmhouse. Can you collect all of the 40+ band locations? Other, even more rare, birds await you in the field as well! Your Hunting Land Explore as you hunt your own private 550 acre hunting land. This area is dove heaven, containing sunflower fields, hay fields, wooded thickets and stock tanks. You hunt with a full 24 hour day-night cycle, so you can use your headlamp to get to your hunting spot before sunrise or find that bird that you downed just before shooting hours closed at sunset. The realistic dove AI means that you are much more likely to find doves feeding in the early morning and evening, roosting through the midday, and sipping water and picking up some gravel in late mornings and early afternoons. Doves can follow different patterns on different days, meaning that spot where you bagged your limit on a previous day may not be nearly as busy the next time you hunt. It is important to know where, and when, feeding and watering areas are…and where the birds roost, as you may kick some birds out of their roost by walking through! Hunt Your Way Hunting Life VR: Dove Season allows you customize your hunting experience to be what you want it to be. Do you want a realistic hunting experience with just a few doves that can spot you if you’re not in cover? Go for it! Or maybe you prefer tons of doves with no non-game birds? We’ve got you covered! Want to forget about game laws and just go out and have fun bagging birds with no limits? You can do that too! Action Challenge When you’ve gotten comfortable with hunting doves in Dove Season, be sure to try out the Action Challenge where you are set in the path of a never-ending flock of doves and you must down as many as you can before time runs out! Special silver and gold doves are worth more points and they add to your time. Stringing hits together will increase your score multiplier. Action Challenge takes it all: speed, accuracy, target recognition! Hunting Life VR lets you enjoy the outdoors your way! Achievements Try to obtain 15 different Steam Achievements, including: Peas in a Pod - Down two doves that hit the ground within 3 yards of each other. Double Trouble - Down two doves within 2 seconds. Not a Lost Cause - Bag 100 doves in a row without losing a single bird. Achievements are displayed in-game (per save) in the 'farm house'. Some special achievements unlock shotgun skins that can only be obtained through earning the achievement! Lama glama Game Company We are an indie game company and we have roots in the game industry, specifically with hunting games. Lama glama founder, Tom Shiflet, served as producer / game designer on the best selling hunting games from Sunstorm Interactive, including the Deer Hunter , Bird Hunter and Rocky Mountain Trophy Hunter series. Hunting Life VR is returning to our roots as game developers…and combining our passions: enjoying the outdoors and video games! We hope that Dove Season is just the first of many seasons that we can bring to you in Hunting Life VR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2202270/header.jpg?t=1669118054",
    "Price": 14.99,
    "Developers": "Lama glama Game Company",
    "Publishers": "Lama glama Game Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2202270/ss_de6c5fcdf023142c754298d7941dbad4d82a49cb.1920x1080.jpg?t=1669118054,https://cdn.akamai.steamstatic.com/steam/apps/2202270/ss_1e444a6f0e0aad28241b2ef2b970bdebe1c7e623.1920x1080.jpg?t=1669118054,https://cdn.akamai.steamstatic.com/steam/apps/2202270/ss_f793f065e23ab89829b20f72027d53757a272311.1920x1080.jpg?t=1669118054,https://cdn.akamai.steamstatic.com/steam/apps/2202270/ss_8818c462aa594e81fed971378408ced7b9f356c1.1920x1080.jpg?t=1669118054,https://cdn.akamai.steamstatic.com/steam/apps/2202270/ss_9b65a06b6f0db1a6144a7345078efcd6379654a0.1920x1080.jpg?t=1669118054,https://cdn.akamai.steamstatic.com/steam/apps/2202270/ss_4622da595b8ac00718a9f63cd8a823e52a0baff6.1920x1080.jpg?t=1669118054",
    "Slug": "hunting-life-vr-dove-season",
    "Meta Title": "Hunting Life VR: Dove Season: Nov 22, 2022, Lama glama Ga...",
    "Meta Description": "Looking for information on Hunting Life VR: Dove Season? Check out the release date (Nov 22, 2022), developer insights from Lama glama Game Company, and...",
    "Alt Text Image": "Official header image for Hunting Life VR: Dove Season game - Steam 2202270",
    "Canonical URL": "https://gusku.site/game/hunting-life-vr-dove-season",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hunting Life VR: Dove Season\", \"description\": \"Looking for information on Hunting Life VR: Dove Season? Check out the release date (Nov 22, 2022), developer insights from Lama glama Game Company, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lama glama Game Company\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lama glama Game Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2202270/header.jpg?t=1669118054\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}