{
    "AppID": 2204040,
    "Name": "Inheritance: Ladeina's Path",
    "Release date": "Nov 25, 2022",
    "About the game": "HERE IS INHERITANCE: LADEINA’S PATH ACTION ADVENTURE WITH OUTSTANDING ADULT CONTENT Join the adventure of Astarte, promising warrior, and protector of the power of Ladeina! Customize your character and play with your style! Beat your enemies, find your way, discover your destiny. AN ANCIENT CONTINENT, EZOS Enter Ezos, a grim and divided piece of land with complex dilemmas. You will find beautiful landscapes, interesting places and small villages inbetween this chaos. Astarte will travel to the different locations of Ezos during her journey to find the missing artifacts of Ladeina. You will start the journey at her village and from there, you will decide where the path will take you. The Clan has been blessed by the Goddess, Ladeina, for thousands of generations in order to protect their power. Now with her clan on the verge of extinction, Astarte must take her first steps into an unknown world. THE MYTHOLOGY OF EZOS Every clan has different beliefs but most agree that there was a time when the Gods were walking on the earth! They gave power to humankind and watched as the clans fought each other to capture the power of the others. The Gods decided to separate this power into 2 parts. That is how the powers of Love and War were born. Goddess Ladeina and God Khain were assigned to protect these powers . One day the Gods started to fight each other. This war took a long time and after this fight, the Gods decided to separate into many pieces and create artifacts made of these powers. Those artifacts were then hidden, although a small amount of them had been given to humankind. Nobody knows how to use these artifacts except for the Clan of Immortals. THERE IS NO LIMIT TO OUR IMAGINATION, JOIN NOW! With our “season per season” release approach, we are going to create a dynamic game design. We won’t have a limit. With every new season we offer new lands, new characters, new features. We are making this game with our community in mind! Come and join, give ideas and experience being a real part of the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2204040/header.jpg?t=1669424845",
    "Price": 0.0,
    "Developers": "Kinky Lemur Games",
    "Publishers": "Kinky Lemur Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2204040/ss_81430172bdbe535fc6f016cab169682a12689bf7.1920x1080.jpg?t=1669424845,https://cdn.akamai.steamstatic.com/steam/apps/2204040/ss_aa40e0a4fc1017327d79f6c0a0c70e85a4e376fc.1920x1080.jpg?t=1669424845,https://cdn.akamai.steamstatic.com/steam/apps/2204040/ss_d3115df6723a7b875fbe7d39042f17a924d95c84.1920x1080.jpg?t=1669424845,https://cdn.akamai.steamstatic.com/steam/apps/2204040/ss_c8bf1930bc454321e90b4f37d11e6f6b9e70e2a3.1920x1080.jpg?t=1669424845,https://cdn.akamai.steamstatic.com/steam/apps/2204040/ss_ecd619f5cf47047c7953ea826aaef538e0480e5b.1920x1080.jpg?t=1669424845",
    "Slug": "inheritance-ladeina-s-path",
    "Meta Title": "Inheritance: Ladeina's Path: Nov 25, 2022, Kinky Lemur Ga...",
    "Meta Description": "Looking for information on Inheritance: Ladeina's Path? Check out the release date (Nov 25, 2022), developer insights from Kinky Lemur Games, and a comp...",
    "Alt Text Image": "Official header image for Inheritance: Ladeina's Path game - Steam 2204040",
    "Canonical URL": "https://gusku.site/game/inheritance-ladeina-s-path",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Inheritance: Ladeina's Path\", \"description\": \"Looking for information on Inheritance: Ladeina's Path? Check out the release date (Nov 25, 2022), developer insights from Kinky Lemur Games, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kinky Lemur Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kinky Lemur Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2204040/header.jpg?t=1669424845\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}