{
    "AppID": 2098130,
    "Name": "International Basketball Manager 23",
    "Release date": "Dec 1, 2022",
    "About the game": "Take control of the worlwide basketball with the new International Basketball Manager 23. Put on the basketball manager's suit and try to handle the pressure that the board, the fans and the press will put on you, how will you respond to all the expectations? International Basketball Manager 23 provides all users with multitude of management tools at your fingertips so you can set your own style in managing your team. You will have at your disposal more than 20 leagues from different countries and continents, 700 clubs and up to almost 10,000 players. You can start thinking about hiring a good scouting team. International Basketball Manager 23 is the only simulation videogame on the market with official licenses recognised worldwide, such as Euroleague Basketball - including the Turkish Airlines Euroleague and the 7DAYS EuroCup - and other important licenses such as the ACB, French, Greek, Turkish, FEB (LEB Gold), BNXT League (Belgium and Netherlands), Argentinean and Chilean. IBM 23 FEATURES All competitions, teams and players have been updated for the 22/23 season. The official license for the Betsafe-LKL Lithuanian league has been added. Edit the parameters that most interest you regarding competitions, teams and players with the game’s powerful editor, and share your “mods” with the whole IBM 23 community. Order a specific play for your team during games using the Playbook featuring your signature plays. Sign players in contract year for the following season without paying their teams a transfer fee. Persuade U18 players to sign for your team through carrying out several actions as you discover their potential and real interest in joining your team. Compete with some of the 357 Colleges in the United States College League competition. We’ve added two new international competitions, a third European competition and the first South American competition. We have adjusted the game difficulty systems, adding and optimizing options for all player profiles. Stand-out improvements in the signings and market movement system from the AI, and several aspects of player signings have been adjusted according to the chosen game difficulty. There are also signing periods when it is no longer possible to perform any type of market movement. We’ve added new tactic systems both in offense and defense. AI team trainers can be sacked if they do not meet the club goals. Filters have been added to display players on several screens such as roster, market, search players, to improve comparisons of player attributes and stats. Now a player’s average stats will be saved season on season. You’ll be able to check out the stats for any player in the current and previous seasons. New Draft Forecast screen, where you can check out the youth players with the greatest chances of being picked by a top league team in the United States. Real injured players at the start of the game. OTHERS FEATURES Officially licensed by the Turkish Airlines EuroLeague and 7DAYS EuroCup . Match simulation modes: 2D and result mode with coach intervention. Two game modes: Manager: Choose your favorite team and lead it to glory, without worrying about your reputation as a coach. Career: Receive offers from more modest clubs to achieve your goals and improve your reputation as a coach. Coach intervention mode, in which you can decide if you want to intervene during the key plays during the match in both 2D simulation and result mode. Over 15 characteristics (physical, mental, attack, defense, adaptation and loyalty to the team) in order to define the players. Player progression system. Get an idea of the level that a player can reach and improve his progression during his time as a junior, giving him his first chances in the senior team. Specific training for each player in order to improve their qualities depending on the skills of the technical team, the player’s age and his progression. Sign, loan, transfer and fire players to adapt your squad to your needs. 3D recreation of the team’s arena with multiple details that you can change and expand (stands, lighting, locker rooms, scoreboard, retired jerseys). Modular stand construction for arenas with a capacity of up to 25,000. Extension of the team museum in 3D that allows you to visualize real trophies from all the competitions you have won, as well as the retired jerseys of team legends from each team and of the players who have retired during the game. Historical records and real roles of honor for each competition. Highest scorer in the team’s history, the best rebounder, passer, blocker etc. Will any player in your team be able to break one of these records in a competition? Set up a good scouting system and send them around the world to discover the most promising young players in the sport before anyone else.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2098130/header.jpg?t=1669910157",
    "Price": 24.99,
    "Developers": "UPLAY Basketball",
    "Publishers": "UPLAY Online",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_184e62542b89d771ff4df00f5680b207398247c1.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_a09ca4c8dd69a9fe66ca1dd35c9ccb26e4357496.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_e38544af08cb3f48801d8871be0a19203e35a303.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_8783e0cbae7a9a0fb6c566ca064f27808cf7142d.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_ae6804137f317f81ad60ec1c2c399cad5ede1e09.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_9e97ed59f073d5be791c00ae048f7c5dca6b1c06.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_de2f81cff90e2836b230c87d049f7db1e974269f.1920x1080.jpg?t=1669910157,https://cdn.akamai.steamstatic.com/steam/apps/2098130/ss_7f2daa5c83dac200fe2c8f459240a9fba9d601ce.1920x1080.jpg?t=1669910157",
    "Slug": "international-basketball-manager-23",
    "Meta Title": "International Basketball Manager 23: Dec 1, 2022, UPLAY B...",
    "Meta Description": "Looking for information on International Basketball Manager 23? Check out the release date (Dec 1, 2022), developer insights from UPLAY Basketball, and ...",
    "Alt Text Image": "Official header image for International Basketball Manager 23 game - Steam 2098130",
    "Canonical URL": "https://gusku.site/game/international-basketball-manager-23",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"International Basketball Manager 23\", \"description\": \"Looking for information on International Basketball Manager 23? Check out the release date (Dec 1, 2022), developer insights from UPLAY Basketball, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"UPLAY Basketball\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UPLAY Online\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2098130/header.jpg?t=1669910157\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}