{
    "AppID": 1998250,
    "Name": "Liminus: The Silent Guard",
    "Release date": "Nov 16, 2022",
    "About the game": "In Liminus: The Silent Guard, the player plays as the Shepherd: an eternal being searching to rescue the lost souls, or sheep, in the land known as the Inbetween. The Shepherd is to guide the sheep to shrines, a safe area for both of them and the place where sheep can continue on their journey in the afterlife. But beware, dangers lurk in dark places and the sheep can easily go astray. The further away the sheep and the Shepherd are from the shrines, the more danger they are in from wild wolves who prowl the darkness looking for the souls to bring to their dens and the guard wolves who protect the dens from the Shepherds. Liminus is an adventure game with strategy, simple puzzle solving, and collection elements. Strategize yourself because the Shepherd has limited yet replenishable light that powers his abilities. Call out to the darkness to find your sheep and defend against wolves by whacking them with your staff, stunning them with your light, or pushing them away with a castable shield. Every wild wolf killed generates a darker side to the Shepherd, kill enough wolves and you will be able to transform into the Reaper! An ultimate ability where you can move fast, kill wolves quickly, and destroy the otherwise unbeatable guard wolves that protect the dens. As your flock grows as you collect sheep, your light abilities will become stronger. But beware, inexperienced Shepherds will struggle with a large flock in difficult areas and wolves can still pick off your sheep. If a sheep becomes captured the Shepherd has to retrieve it from the dens and guide it to safety in order to progress to the next gated area. No souls are to be left behind. There is a Tutorial available to learn the abilities of the game and two levels to play. The Village includes two gated areas to complete with over 60 sheep to find and many wolves to battle around and The Woods is the other area available for players to play that will challenge them in their puzzle skills due to the higher number of sheep required to complete the level. About this project: This was a capstone project at BYU. Built by students within a year for the purpose of learning how to make games, collaborate as a team, and finish something enough for publication. Because of that, support and continual work on this game is limited to individual team members and their schedules as they move towards graduation. Bugs and issues with the game are welcome to be reported on, but please be aware they are the result of once-inexperienced people learning experience on the job. Regardless, our team is proud of the rich game we made and we welcome any and all interest in it! We hope someday it can continue to grow into something beyond what we made as students.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1998250/header.jpg?t=1668664515",
    "Price": 0.0,
    "Developers": "BYU Animation",
    "Publishers": "Brigham Young University,BYU Animation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1998250/ss_33e0e65fc49e3b39afb35849d028f25cecd60267.1920x1080.jpg?t=1668664515,https://cdn.akamai.steamstatic.com/steam/apps/1998250/ss_af5798e24241bbfd0898dd9f0ebd1a429041b5da.1920x1080.jpg?t=1668664515,https://cdn.akamai.steamstatic.com/steam/apps/1998250/ss_8b6724e303159f1174b32c10f1a91710d0acaf8d.1920x1080.jpg?t=1668664515,https://cdn.akamai.steamstatic.com/steam/apps/1998250/ss_6fe0fb80784d62a7e92bd0ec4bb4f65aa24470d6.1920x1080.jpg?t=1668664515,https://cdn.akamai.steamstatic.com/steam/apps/1998250/ss_6974a2b4feac0e7349a30b5affa75d1002489209.1920x1080.jpg?t=1668664515",
    "Slug": "liminus-the-silent-guard",
    "Meta Title": "Liminus: The Silent Guard: Nov 16, 2022, BYU Animation an...",
    "Meta Description": "Looking for information on Liminus: The Silent Guard? Check out the release date (Nov 16, 2022), developer insights from BYU Animation, and a complete g...",
    "Alt Text Image": "Official header image for Liminus: The Silent Guard game - Steam 1998250",
    "Canonical URL": "https://gusku.site/game/liminus-the-silent-guard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Liminus: The Silent Guard\", \"description\": \"Looking for information on Liminus: The Silent Guard? Check out the release date (Nov 16, 2022), developer insights from BYU Animation, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"BYU Animation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brigham Young University,BYU Animation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1998250/header.jpg?t=1668664515\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}