{
    "AppID": 2088170,
    "Name": "Medal of Guardians",
    "Release date": "Nov 18, 2022",
    "About the game": "For video creators and streamers STP WORKS permits the use of our games for video distribution to YouTube and other sites, and monetization through video distribution platform partner programs. Game Overview In a world where medals have power, players can choose from a variety of jobs, including knight, mage, priest, and archer, to fight monsters and strengthen their characters to their liking. This is an online action shooting game that can be enjoyed alone or with others. Online Multi Play There is auto-matching and friend-matching where you can play only with your friends. With auto-matching, you can enjoy a once-in-a-lifetime experience, with friend-matching, you can have fun with your friends, or of course, you can play solo, so you can enjoy the game in your preferred play style. Job system You can select a job at any time according to the battle situation from a variety of jobs, such as a tank who serves as a shield for fellow soldiers, a healer who is good at providing support, a job specializing in single attacks, a job specializing in ranged attacks, etc. Select the most suitable job for your battle. Medal In this world, power resides in medals, and the power of medals is used to use skills. Medals can be acquired by defeating enemies. Medals are also used to strengthen weapons and armor. Sphere system There are two types of spheres: passive spheres, which enhance status, and active spheres, which enable the use of special skills. Each sphere has a level, and the higher the level, the more effective the sphere. Growth Each job grows six statuses. In addition, weapons and armor can be strengthened to enhance attack and defense. Character build Each of the ten different jobs has different abilities and three unique skills; you can combine the 18 different types of spheres to create a character of your own choice, whether you want to compensate for your weaknesses or enhance your strengths.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2088170/header.jpg?t=1668830292",
    "Price": 3.59,
    "Developers": "STP WORKS",
    "Publishers": "STP WORKS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2088170/ss_1a92c95dc6531b951c26b2a8b109d8c94bf4f7f9.1920x1080.jpg?t=1668830292,https://cdn.akamai.steamstatic.com/steam/apps/2088170/ss_619f3016c22f27150301fbcc513fd01b08ba31ce.1920x1080.jpg?t=1668830292,https://cdn.akamai.steamstatic.com/steam/apps/2088170/ss_48897c19eecb4c7a45704b9cf3260fa42fd5447e.1920x1080.jpg?t=1668830292,https://cdn.akamai.steamstatic.com/steam/apps/2088170/ss_a267f834be2fb42ebc2a6fa035111591aacde9f1.1920x1080.jpg?t=1668830292,https://cdn.akamai.steamstatic.com/steam/apps/2088170/ss_c6913f20344ecec3ab71e8c9369a337cdd410461.1920x1080.jpg?t=1668830292",
    "Slug": "medal-of-guardians",
    "Meta Title": "Medal of Guardians: Nov 18, 2022, STP WORKS and Full Over...",
    "Meta Description": "Looking for information on Medal of Guardians? Check out the release date (Nov 18, 2022), developer insights from STP WORKS, and a complete game summary.",
    "Alt Text Image": "Official header image for Medal of Guardians game - Steam 2088170",
    "Canonical URL": "https://gusku.site/game/medal-of-guardians",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Medal of Guardians\", \"description\": \"Looking for information on Medal of Guardians? Check out the release date (Nov 18, 2022), developer insights from STP WORKS, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"STP WORKS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"STP WORKS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2088170/header.jpg?t=1668830292\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}