{
    "AppID": 1309780,
    "Name": "MODERN NAVAL COMBAT",
    "Release date": "Dec 1, 2022",
    "About the game": "n this work, high-tech confrontation has become the theme of the battle. Whether it is the world hegemony, the United States, the young China, or Russia, which has a huge nuclear arsenal, they all have their own military strengths that they are proud of. In real life, we expect there will never be a war between them. But no one will be curious about what kind of situation these three countries will have when they fight. This game allows you to discover the answer yourself. Features 1. Surface ships In this work, players will be able to operate almost all maritime equipment from the three camps of China, the United States and Russia from the 1960s to the first three decades of the 21st century. They include: Aircraft carriers, cruisers, destroyers, frigates, conventional and nuclear submarines. Each type of ship has its own unique weapons and sensors. 2. Carrier aircraft The aircraft carrier is equipped with main fighters and attack aircraft of various countries including F/A-18, F14, F35, Su-33, and J-15. There are also various types of helicopters, early warning aircraft, anti-submarine aircraft, and electronic warfare aircraft available for players to trend. 3. Unique task system Real battlefield commanders don't have to pay attention to every detail at all times. It is sometimes a good choice to plan their own tasks for the troops in their hands and let them execute them themselves. Units on the field can perform many types of missions, ranging from air patrols to sea attacks; from air early warning to electronic jamming. If you want to win, don't learn from Chiang Kai-shek, the master of micromanagement. 4. Various sensors and unit features This game is different from other RTS games, only the targets detected by the sensor can be found. The game provides a variety of sensors including radar, active/passive sonar, electronic reconnaissance, etc., and their reconnaissance effects are also different. For example, electronic reconnaissance sensors can often only find the general direction of the radar radiation source, and it is difficult to accurately locate it. In order to make these sensors work effectively, the game also introduces unit features including rcs (radar reflection area), noise coefficient, and environmental features such as sea clutter. The above settings can ensure that anyone can easily restore an ocean-going naval battle under the modern technology level. Players can also edit their own scenarios to determine the lineup of the enemy and us on the stage. I want to try the result of the Chinese fleet meeting the US military in the 1990s. ? What will happen if we meet the US military again in 2020? These can all be chosen by the player and explore ways to win. What are you waiting for, the carrier-based aircraft has already ascended to the deck, the fuze insurance has been released, just waiting for you to give orders",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1309780/header.jpg?t=1669964542",
    "Price": 22.49,
    "Developers": "黑丝带制作组",
    "Publishers": "电钮组",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1309780/ss_151a90ed6dca82156333a6e34a3241be1afc9384.1920x1080.jpg?t=1669964542,https://cdn.akamai.steamstatic.com/steam/apps/1309780/ss_2cb93711858b407d38aae5184f24a053a3d7d9b4.1920x1080.jpg?t=1669964542,https://cdn.akamai.steamstatic.com/steam/apps/1309780/ss_3d872e09a2f7c0a464bf4915c9266c9749fa6389.1920x1080.jpg?t=1669964542,https://cdn.akamai.steamstatic.com/steam/apps/1309780/ss_ae592df46be03c4668bfc4e3845d142b076efdea.1920x1080.jpg?t=1669964542,https://cdn.akamai.steamstatic.com/steam/apps/1309780/ss_ec0a8728eeca89acc3eda7df83bd857e5acb34cc.1920x1080.jpg?t=1669964542,https://cdn.akamai.steamstatic.com/steam/apps/1309780/ss_863599b0fff68428a8c9c22a28806e6ff3b4e889.1920x1080.jpg?t=1669964542",
    "Slug": "modern-naval-combat",
    "Meta Title": "MODERN NAVAL COMBAT: Dec 1, 2022, 黑丝带制作组 and Full Overview",
    "Meta Description": "Looking for information on MODERN NAVAL COMBAT? Check out the release date (Dec 1, 2022), developer insights from 黑丝带制作组, and a complete game summary.",
    "Alt Text Image": "Official header image for MODERN NAVAL COMBAT game - Steam 1309780",
    "Canonical URL": "https://gusku.site/game/modern-naval-combat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MODERN NAVAL COMBAT\", \"description\": \"Looking for information on MODERN NAVAL COMBAT? Check out the release date (Dec 1, 2022), developer insights from \\u9ed1\\u4e1d\\u5e26\\u5236\\u4f5c\\u7ec4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u9ed1\\u4e1d\\u5e26\\u5236\\u4f5c\\u7ec4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7535\\u94ae\\u7ec4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1309780/header.jpg?t=1669964542\", \"offers\": {\"@type\": \"Offer\", \"price\": 22.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}