{
    "AppID": 1962430,
    "Name": "Monochrome Mobius: Rights and Wrongs Forgotten",
    "Release date": "Nov 16, 2022",
    "About the game": "A new JRPG from AQUAPLUS, announced in commemoration of 20 years of their hit Utawarerumono franchise. Produced by legendary composer Naoya Shimokawa and penned by Utawarerumono writer Munemitsu Suga, with support from the studio's superb art direction spearheaded by character designer Mi, Monochrome Mobius: Rights and Wrongs Forgotten focuses on the heart of every great RPG: the story. Story In the small province of Ennakamuy, on the frontiers of the great empire of Yamato, there lived a young man with his mother and sister. One day, at the local lord's behest, the young man was investigating a small irregularity when he encountered a girl he’d never met. The words the girl spoke were what shocked him: She told the man that his father was still alive. Seeing a trace of his father in her and resolving to learn the truth, the young man and the girl set out together towards the land of Arva Shulan—a country that doesn’t appear on the map. Faced with trials and perils, the boy chases his father. He meets new friends and comrades who join him on his mission. There will be struggles and victories and failures and partings. The fickle vagaries of fate will place an epoch in the young man’s hands— And one day, this man will be sung of in legends. Characters A young man living in the frontier province of Ennakamuy. Oshtor lives together with his mother Torikori and his younger sister Nekone, and though still young, he possesses discipline and a strong sense of right and wrong. His meeting with the mysterious Shunya gives him questions about his father’s death, and he sets out for an unknown country to find answers. A girl whose path has crossed Oshtor’s by chance or by destiny. Guileless and still with something of a babyface, Shunya's words and actions create more questions than they answer. She informs Oshtor that his father, whom he thought a martyr, still lives, and the pair embark on a journey together. The daughter of Murasame, the ruler of Izumo. As demure and polite as she appears, Munechika shows hints of a warrior spirit. She assists Oshtor and joins him on his mission. A young man who barged in on Oshtor when he was training. Mikazuchi is strong and somewhat brash, but he never bends for anything, and a current of integrity runs through everything he does. A good friend to Oshtor and a good rival too, the two spur each other on through thick and thin.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1962430/header.jpg?t=1668744988",
    "Price": 53.99,
    "Developers": "AQUAPLUS",
    "Publishers": "DMM GAMES,Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1962430/ss_d48e0edb5e80d04012dea79ea28b71ff6e6a8cdd.1920x1080.jpg?t=1668744988,https://cdn.akamai.steamstatic.com/steam/apps/1962430/ss_bb0c41368ad4755b5ed572bc3521285bb1f9c5bb.1920x1080.jpg?t=1668744988,https://cdn.akamai.steamstatic.com/steam/apps/1962430/ss_f6fc7b941798e3fe798ce6c30ee414e28c18301c.1920x1080.jpg?t=1668744988,https://cdn.akamai.steamstatic.com/steam/apps/1962430/ss_4b795f87b74b39bf6fe2d37c991828801b9310b3.1920x1080.jpg?t=1668744988,https://cdn.akamai.steamstatic.com/steam/apps/1962430/ss_2cafd2d429d572a9abe1627a24d12809cb6f3775.1920x1080.jpg?t=1668744988,https://cdn.akamai.steamstatic.com/steam/apps/1962430/ss_510649d388b57ff8faa8cbd3af6bb9c220ae4e65.1920x1080.jpg?t=1668744988",
    "Slug": "monochrome-mobius-rights-and-wrongs-forgotten",
    "Meta Title": "Monochrome Mobius: Rights and Wrongs Forgotten: Nov 16, 2...",
    "Meta Description": "Looking for information on Monochrome Mobius: Rights and Wrongs Forgotten? Check out the release date (Nov 16, 2022), developer insights from AQUAPLUS, ...",
    "Alt Text Image": "Official header image for Monochrome Mobius: Rights and Wrongs Forgotten game - Steam 1962430",
    "Canonical URL": "https://gusku.site/game/monochrome-mobius-rights-and-wrongs-forgotten",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monochrome Mobius: Rights and Wrongs Forgotten\", \"description\": \"Looking for information on Monochrome Mobius: Rights and Wrongs Forgotten? Check out the release date (Nov 16, 2022), developer insights from AQUAPLUS, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"AQUAPLUS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DMM GAMES,Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1962430/header.jpg?t=1668744988\", \"offers\": {\"@type\": \"Offer\", \"price\": 53.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}