{
    "AppID": 1494450,
    "Name": "Oakenfold",
    "Release date": "Nov 17, 2022",
    "About the game": "Clever turn-based roguelike Oakenfold is a clever time-reversible strategy game. Outsmart the Biocides wrecking our planet in this roguelike adventure. Manipulate them, shove them, drown them, crush them, have them attack each other... No matter how you do it, keep your precious cargo safe at all times! It's your last chance to escape our inhospitable planet. Key Features Oakenfold takes a twist on the classic turn-based strategy flow, similar to games such as ' Into the Breach ', the enemy attacks are pre-indicated and you have a set amount of actions to solve the puzzle. In Oakenfold, you don't have to think out the complete solution in advance. You can start trying your solution, and if it doesn't work you can simply reverse time with your magical TimeScrubber™. TimeScrubber™ : a freely usable undo/redo system. try out all the potential solutions to find the best one! Procedurally generated : each play-through will feature different paths, missions, upgrades, and items Permadeath : Adding weight to every decision that you take. Highscores : to satisfy those who like a bit of friendly competition Weekly Escape : a weekly updated playthrough where all players will be offered the same challenges and choices Steam Achievements : 36 collectible achievements with varying difficulties TimeScrubber™ You're in the middle of a difficult attack and you see multiple solutions. Wouldn't it be great if you could try out each one? You can! Oakenfold is forgiving. You can reverse time with your trusty old TimeScrubber™, finding the optimal solution for every situation. Customizable abilities Combine the Conductive upgrade with extra Damage . Or try to go for the Crate Slipping build. Maybe extra Range is what you need? There are many upgrades to try different synergistic combinations with! The story Asha is one of the last humans left on Earth. A young woman on the brink of its extinction, she is the final hope for humanity in a world that treats her like a virus. Asha grows up living in defense. With her father by her side, they survive the apocalypse by trekking through the wastelands of the Himalayan region. Her father teaches her everything he knows about how to survive in this new world. Hunting, scavenging, and fighting her way through each day, all with a kind heart and steely determination. Ever the mentor, her father injects a final hope for humanity in his daughter: his life’s work, the last human settlement, the biodome called Oakenfold. It will launch into the stars with the last remnants of humanity aboard, ready to start anew. Asha, now a young woman, is alone. While they embarked on one of their many journeys to the power plant, her father, and the rest of their collection team, perished in a biocide attack, where he protected Asha from getting stabbed by shielding her with his own body. Though the death of her father is painful, Asha must continue the mission the two of them had set out to complete: to retrieve the last of the fuel-packed crates to power up Oakenfold’s systems. Asha's mindsets You'll be able to play the game with varying mindsets of Asha, each giving her unique starting abilities. Join the Community",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1494450/header.jpg?t=1668697181",
    "Price": 17.99,
    "Developers": "Rutger van Dijk",
    "Publishers": "Studio Taghua",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1494450/ss_1aa08d37ce8216fdbb06e240026eb972ee54967d.1920x1080.jpg?t=1668697181,https://cdn.akamai.steamstatic.com/steam/apps/1494450/ss_6d0b1ceef9f096ba85b89e082280e50fe437a5aa.1920x1080.jpg?t=1668697181,https://cdn.akamai.steamstatic.com/steam/apps/1494450/ss_918771158528dbc42a877a52238ca7069fb5c79e.1920x1080.jpg?t=1668697181,https://cdn.akamai.steamstatic.com/steam/apps/1494450/ss_4e1b7e1a32894f35bdb51e2f9d88d08a7b003c2e.1920x1080.jpg?t=1668697181,https://cdn.akamai.steamstatic.com/steam/apps/1494450/ss_5475a02e9b5b00e2baab67147faf7442ac870d62.1920x1080.jpg?t=1668697181,https://cdn.akamai.steamstatic.com/steam/apps/1494450/ss_02c5f66b0e7deda19feab91d411040be1a7895fa.1920x1080.jpg?t=1668697181",
    "Slug": "oakenfold",
    "Meta Title": "Oakenfold: Nov 17, 2022, Rutger van Dijk and Full Overview",
    "Meta Description": "Looking for information on Oakenfold? Check out the release date (Nov 17, 2022), developer insights from Rutger van Dijk, and a complete game summary.",
    "Alt Text Image": "Official header image for Oakenfold game - Steam 1494450",
    "Canonical URL": "https://gusku.site/game/oakenfold",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Oakenfold\", \"description\": \"Looking for information on Oakenfold? Check out the release date (Nov 17, 2022), developer insights from Rutger van Dijk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rutger van Dijk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Taghua\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1494450/header.jpg?t=1668697181\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}