{
    "AppID": 2196110,
    "Name": "Odin's Tea Party",
    "Release date": "Dec 4, 2022",
    "About the game": "1-800-ValhallaIsCalling will you answer? Can you fight the horde and for how long? Cement your place within Odin's Tea Party to prove you have what it takes to beat the rest! Or at least etch your name in the pantheon of tea bags (personally I like Earl Grey...) This game features: Fast paced melee combat that is responsive and rewards the player from pulling off great feats off strength with killstreak rewards! These include bombs, guns and a massive axe because why wouldn't it? You've proved yourself to be worthy of it! Maybe you can learn how to feign attacks and shield bash a few of the bots. Hey they were made for that specific purpose! I wonder if they are still under warranty? Hope so at least... A true champion knows when to dash out the way (to fight a bigger enemy not run away obviously!) The responsiveness isn't just restricted to your sword it's also programmed straight into your keyboard and mouse. This enables you to really dictate how fights should be won through being cunningly brutal or brutally cunning. Three different swords with their own unique twists with three equally flashy shields that are rewarded to you! (Yes you!) What do they do I hear you scream? They all ooze with ancient power which can be used to scare, intimate and stun your enemies. (They have been programmed very well to respond to human emotions.) You have six different arenas with completely different themes to unlock during your time at Odin's Tea Party. You can compete in a classic gladiatorial arena or maybe you'd like to visit a sunny pirate escape? Perhaps you'd like to be transported to the wild west. The choice is completely up to you once the arena has been unlocked! The arenas can only be unlocked by entering your name into the Endless Brawl where the mightiest of warriors compete. Get fifty kills in each arena to face the champion. There are five champions in total to beat so why don't you pop on down and get the kettle on! It is a tea party at the end of the day. We have the obligatory scoreboards for you to show off your might to friends and foes alike! You know you are already the best but a scoreboard proves that you are at least up there. Okay you are at least in the top 2% but come on you can do better than that! Would a fight be complete without enemies? Well it would be a pretty one sided one if there was nothing to fight so fear not! Each arena has unique enemies to defeat. You want berserkers? We've got that. You want spellcasters? We've got that also. You want a gunslinger? *checks notes* We do indeed have that! Honestly can't believe technology has advanced this far to enabled us to have twenty different grunt enemies and five unique bosses! Perhaps you'd like to be the quickest champion to grace the arena? With boss rush you can fight all the champions in order to get the quickest time! Let's see if you can shave off that extra second for a personal best. There is always more to explore with Odin's Tea Party and hey would you look at that! The kettle has just finished boiling.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2196110/header.jpg?t=1670213000",
    "Price": 8.99,
    "Developers": "Corrafinium Inc",
    "Publishers": "Corrafinium Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_ceea1f6c1068b85cbe28423339ea4d437f649127.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_84d86d583e847d8295e411166f0f81b2d6adea8e.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_ecfe5ac683ea3e208ec65861cdcb1c929657d928.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_359f5bbfd55dfe18880cb042c9679271bd362486.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_f7f9e64335d5de54849b2d220fe086b366f40759.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_f847952fe141f4e57f342dc779ded7c3d460b2d2.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_81c59cb853b058cb428fa06f6486db4d65cb770a.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_7726430599cc3df2e397aeef13a028fab59c4c0b.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_db8e630276dd4396004007aa4ee1464ef5934a94.1920x1080.jpg?t=1670213000,https://cdn.akamai.steamstatic.com/steam/apps/2196110/ss_6431cd59247f1d2696b8b75097eab43ce675933e.1920x1080.jpg?t=1670213000",
    "Slug": "odin-s-tea-party",
    "Meta Title": "Odin's Tea Party: Dec 4, 2022, Corrafinium Inc and Full O...",
    "Meta Description": "Looking for information on Odin's Tea Party? Check out the release date (Dec 4, 2022), developer insights from Corrafinium Inc, and a complete game summ...",
    "Alt Text Image": "Official header image for Odin's Tea Party game - Steam 2196110",
    "Canonical URL": "https://gusku.site/game/odin-s-tea-party",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Odin's Tea Party\", \"description\": \"Looking for information on Odin's Tea Party? Check out the release date (Dec 4, 2022), developer insights from Corrafinium Inc, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Corrafinium Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Corrafinium Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2196110/header.jpg?t=1670213000\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}