{
    "AppID": 844670,
    "Name": "Please Be Happy",
    "Release date": "Nov 21, 2022",
    "About the game": "Please Be Happy is a comfy, slice-of-life visual novel set in a fictional version of Wellington, New Zealand. Born as a fox in the forest of Korea, Miho carries with her the memory of a traveler who showed her kindness and spoke of home. Now more human than fox, Miho has spent a long, long time searching for her person. She arrives by airship to Wellington, one of the jewels of the floating island of New Zealand. Despite her years spent observing humans, she still has a lot to learn about their culture and society. She's made a living so far as a thief, her heightened senses allowing her to easily take advantage of people. She's also seen a lot of the worst of what mankind has to offer. It's only after meeting Juliet, the owner of a small library, and Aspen, an aspiring novelist, that Miho starts to understand what kindness is, and that there's more than just the bad stuff when it comes to people. Miho 's earliest memories are of her time as a fox, and the kind human she met back then. Now more than just a fox, she's spent her life searching for that person. Her journey has brought her to a new life in Wellington, New Zealand. She changes her name every time she goes to a new country. Her previous names include Gumi, Migu, and Mimi. Aspen is a human girl in love with words and stories. A barista at the Bellhouse Café, she dreams of being a popular author someday. She tries to take a little inspiration from every person that she meets. She has an hour long phone call with her mom every weekend. As a vampire, Juliet is one of Wellington's oldest residents. She's made the treasures of her life open to all in the form of a library. Aside from books, she also provides wisdom, kindness, and shelter to those who need it. She dislikes having to resort to echolocation to find her reading glasses. Over 220,000 words Character designs and CG's by Kobuta, with additional art by adirosa 2 different routes with 2 happy endings each Full English voice acting A brand new original soundtrack by Sarah Mancuso",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/844670/header.jpg?t=1669429847",
    "Price": 17.99,
    "Developers": "Studio Élan",
    "Publishers": "Sekai Project,Studio Élan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/844670/ss_35112ae282f89641db643f885be3d8685428e901.1920x1080.jpg?t=1669429847,https://cdn.akamai.steamstatic.com/steam/apps/844670/ss_a1f3871a9f61887d0193c0dcab8371a124aed1f9.1920x1080.jpg?t=1669429847,https://cdn.akamai.steamstatic.com/steam/apps/844670/ss_818a82a76ebdcc196c34dc86cbad0a56e5ad3162.1920x1080.jpg?t=1669429847,https://cdn.akamai.steamstatic.com/steam/apps/844670/ss_03f916530d8a9c205da25c4fddc923e09fc7200e.1920x1080.jpg?t=1669429847,https://cdn.akamai.steamstatic.com/steam/apps/844670/ss_34fb58e329e1372635ba70ea55758f1fa8f95baf.1920x1080.jpg?t=1669429847",
    "Slug": "please-be-happy",
    "Meta Title": "Please Be Happy: Nov 21, 2022, Studio Élan and Full Overview",
    "Meta Description": "Looking for information on Please Be Happy? Check out the release date (Nov 21, 2022), developer insights from Studio Élan, and a complete game summary.",
    "Alt Text Image": "Official header image for Please Be Happy game - Steam 844670",
    "Canonical URL": "https://gusku.site/game/please-be-happy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Please Be Happy\", \"description\": \"Looking for information on Please Be Happy? Check out the release date (Nov 21, 2022), developer insights from Studio \\u00c9lan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio \\u00c9lan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project,Studio \\u00c9lan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/844670/header.jpg?t=1669429847\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}