{
    "AppID": 2210630,
    "Name": "Pretty Girls 2048 Strike",
    "Release date": "Dec 1, 2022",
    "About the game": "◆Game Description: Pretty Girls 2048 Strike is an exciting and unique 2048 number game, where you combine number blocks to form bigger numbers and hit the blocks against your enemies to damage them! ◆Two game modes are available! Stage Mode There are 10 stages for each of the five Demon Tribes. Defeat the Demons while damaging enemy blocks! The difficulty level increases with each additional stage. You can earn points by clearing each stage. Use the points you earn to get new costumes and characters from the point exchange in the dressing room! Endless Mode In this game mode, endless blocks appear and players compete to see how much damage they can inflict on enemy blocks before the blocks can no longer be moved. There are 3 stages: 3x3, 4x4 and 5x5 squares. ◆A total of 10 characters of the Exorcist Swordsmen and the Demon Tribes appear in the game! New costumes can be changed in the dressing room. All characters are voiced in Japanese. ◆Create your own snapshots in the dressing room! In Diorama mode, you can place multiple characters at the same time, change the placement of each character, their expressions and costumes, and save/load the scenes you have created. Stamps, such as hearts, have been added to the stamps to decorate your scenes. Create your ideal scene and make snapshots! ◆Character: Exorcist Swordsman Sara She is one of the most powerful swordsmen in her family, which has been producing swordsmen for generations. She is a serious person, strict with herself, and feared by those around her. She cares for her younger sister, Hotaru, who is not blessed with the talent of a swordsman, and is treated coldly by the rest of the family. Chikage Chikage specializes in a ninja-like fighting style. She has a personality that is both hardworking and confident. She admires her mother, who was an exorcist Swordsman, and dressed as a male in order to pursue her strength and follow the path of swordsman. Hotaru Hotaru is Sarah's younger sister. Although she comes from a prestigious family of exorcist swordsmen, she is not a talented swordsman and is treated coldly, but she is an expert in recovery techniques. She has a quiet and withdrawn personality, and has a strong desire to serve others. She admires her older sister, who loves her and helps her out. Kasumi A veteran exorcist swordsman who can handle extremely difficult missions. She also mentors her younger students. She is calm and collected, and gentle-mannered. She wields her sword with elegance and is admired by all exorcist swordsmen. ◆Character: Demon Tribe Lilim A dream demon. She looks down on humans as food for her energy. She is mischievous and playful, and enjoys bullying humans. She absorbs energy through dreams and hallucinations. Cerberus A demonic beast. She looks down on humans as weak creatures. She believes that power is the symbol of strength. She has a free-spirited and easy-going nature, and is adored by the beast monsters. She is uninhibited and honest to her instincts. Unicorn A sacred beast. She is fastidious and serious. She hates human men and protects women from the filthy ones. She is especially hostile to men, whom she regards as an impure mass. Yamata no Orochi A serpent demon. A graceful and bewitching demon. She is a drinker and glutton. She controls humans and uses them as her puppets, forcing them to pay for her delicious food and wine. Fafnir An evil dragon. She is a powerful and majestic dragon who has a large number of demons as her followers. She treats humans as if they were plants and trees, and has no respect for them. Greedy and ruthless, she wants to take over everything in the world. ※All the characters are used under an official license. ※All the characters in this game are over 18 years old.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2210630/header.jpg?t=1669941637",
    "Price": 5.59,
    "Developers": "Zoo Corporation",
    "Publishers": "Zoo Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_e649c5854cbc0d92bbb304bef6ffdd7bc360114a.1920x1080.jpg?t=1669941637,https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_4aaa49d68ab08433e4d58946ffde9b06ade408e4.1920x1080.jpg?t=1669941637,https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_ca45b4b95de0d532873b488972783df36b6e2071.1920x1080.jpg?t=1669941637,https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_150aa7b50115c2c079ba935a5956bb0c79766038.1920x1080.jpg?t=1669941637,https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_1b754845eb4cc3e5269e266da5aea9badd213699.1920x1080.jpg?t=1669941637,https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_00ed22f96e48f246a6156c73ed80c30d6a0c69bf.1920x1080.jpg?t=1669941637,https://cdn.akamai.steamstatic.com/steam/apps/2210630/ss_11eda84050df6eeb77ca975de123dbbc2252175c.1920x1080.jpg?t=1669941637",
    "Slug": "pretty-girls-2048-strike",
    "Meta Title": "Pretty Girls 2048 Strike: Dec 1, 2022, Zoo Corporation an...",
    "Meta Description": "Looking for information on Pretty Girls 2048 Strike? Check out the release date (Dec 1, 2022), developer insights from Zoo Corporation, and a complete g...",
    "Alt Text Image": "Official header image for Pretty Girls 2048 Strike game - Steam 2210630",
    "Canonical URL": "https://gusku.site/game/pretty-girls-2048-strike",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pretty Girls 2048 Strike\", \"description\": \"Looking for information on Pretty Girls 2048 Strike? Check out the release date (Dec 1, 2022), developer insights from Zoo Corporation, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2210630/header.jpg?t=1669941637\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}