{
    "AppID": 1932730,
    "Name": "推推炸(PushPushBoom)",
    "Release date": "Nov 29, 2022",
    "About the game": "How to move Use the WSAD keyboard to move up, down, left and right. After clicking, the character will move accordingly. When it moves a space, it will stop. If you still click the move key in the corresponding direction, the character will continue to move without stopping. How to defeat monsters Pushing the square stones and fruits in the map is the main attack method. You can also use diaper bombs to kill monsters when you become a baby. Some pitaya fruits in the map also have the effect of bombs, which can also kill monsters. Note that some special monsters cannot be killed by pushing stones and fruits, but diaper bombs are effective. When a player is touched by a monster, the player fails. A level can be revived once through the vitality potion. How to pass Each level has specific requirements. The requirements are displayed in the upper left corner. It is required to display the number of monsters destroyed and the number of fruits destroyed. The current completed number will also be displayed. The shorter the time it takes to complete the task, the higher the clearance evaluation will be. Game fruit props, etc In order for players to pass the level more easily, there are fruit props that can be used in the game. The props are used to slow down monsters, dizziness monsters, or even kill monsters directly. The most important thing is that you will die when being approached by monsters in the game, but you can use resurrection (you need to use 5 points of vitality potion) How to get prop fruit Most of the fruit props are purchased from stores, but when you complete some achievements, you can get rewards from the achievement system, as well as a small amount of fruit props. It also includes vitality potion. How to get gold coins You can get gold coins by killing all kinds of food monsters in the level. Note that the higher the level score, the more gold coins you will get. When a stone crushes more monsters, the points will double. Game content obtained in this version This version can obtain 50 levels of game content. Players can obtain gold coins and buy game props through the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1932730/header.jpg?t=1669785520",
    "Price": 0.0,
    "Developers": "魔力猫",
    "Publishers": "魔力猫",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1932730/ss_bd4dd271fd4ae00811510fe6f3d82df5d3bad02f.1920x1080.jpg?t=1669785520,https://cdn.akamai.steamstatic.com/steam/apps/1932730/ss_0ff58a251bc674e11b309e54e03cf91399b78993.1920x1080.jpg?t=1669785520,https://cdn.akamai.steamstatic.com/steam/apps/1932730/ss_a9cbc091fcc801905fb0223ef72eeaba75dea3aa.1920x1080.jpg?t=1669785520,https://cdn.akamai.steamstatic.com/steam/apps/1932730/ss_e6d7d9c076ca6fc3c0a1db3ca681c98f10d79045.1920x1080.jpg?t=1669785520,https://cdn.akamai.steamstatic.com/steam/apps/1932730/ss_b9e36bf7d308c3ed75763c54eba533dc41663145.1920x1080.jpg?t=1669785520",
    "Slug": "pushpushboom",
    "Meta Title": "推推炸(PushPushBoom): Nov 29, 2022, 魔力猫 and Full Overview",
    "Meta Description": "Looking for information on 推推炸(PushPushBoom)? Check out the release date (Nov 29, 2022), developer insights from 魔力猫, and a complete game summary.",
    "Alt Text Image": "Official header image for 推推炸(PushPushBoom) game - Steam 1932730",
    "Canonical URL": "https://gusku.site/game/pushpushboom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u63a8\\u63a8\\u70b8(PushPushBoom)\", \"description\": \"Looking for information on \\u63a8\\u63a8\\u70b8(PushPushBoom)? Check out the release date (Nov 29, 2022), developer insights from \\u9b54\\u529b\\u732b, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u9b54\\u529b\\u732b\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u9b54\\u529b\\u732b\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1932730/header.jpg?t=1669785520\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}