{
    "AppID": 1730260,
    "Name": "Retro Gadgets",
    "Release date": "Nov 30, 2022",
    "About the game": "You look up from your cosy little workbench. It's dark out, what time is it? It doesn't matter; you've been in the flow and are adding the final touches to your latest retro gadget. Just one more line of code, a spray of paint here, a sticker there – it's done. You power it on... The start-up sound kicks in... the needles on the gauges flutter, and the screen lights up... it's glorious. It's ready to share with the world. Now, all it needs is a name. The Gadget Maker Feel the exhilaration of building your own eye-popping real-working gadgets. Lose yourself as you build, solder, code, customise, and play with electrifying gadgets at your relaxing workbench. Build video game consoles, weather machines, lightboards, radios, drum machines... any gadget you can think of. What will you come up with next? Feel the Power Retro Gadgets gives you the power to invent! Solder circuit boards, add buttons and switches, speakers and lights, connect and code CPUs, audio and video chips, flick the on button and see your gadget come to life. You have the vision, you can build the gadgets! A World of Gadgeteers Check out gadgets made by people all over the world. Download any gadget, play with it, take it apart, see how it works, build your own version. Is the world ready for your awesome gadget? Cosy Workbench Tinker, test and lose track of time at your friendly pixel art workbench. Everything feels tactile and satisfying to use. Open drawers to find what you need. Solder and paint. Print and place stickers with tweezers. Connect parts with magnets. Twist knobs, tap buttons, flick switches. Trust us, you've never played anything like this! Unbeatable Components There is an ever-growing collection of buttons, switches, dials, gauges, lights, LEDs, LCDs, chips, joysticks, speakers, circuit boards, and more. Everything you need to create a lean mean sexy machine. Now, all it needs is a name! Striking Styles Make your gadgets feel truly personal. Connect boards to make new shapes. Spray components with different colours. Design and use stencils to create unique designs. Draw, print, and apply your own stickers. Or upload a logo for that more professional touch! Be a Software Superstar You've built your gadget, now it's time to code! Write and debug your own code in our Lua coding environment, or upload it directly to the CPU. Program games, live weather stations, drum machines, cameras, video players, radios... the possibilities are endless. Gadget Archive We know what it's like - you're busy spray painting your latest masterpiece, when BOOM, inspiration hits and a new idea flashes into your mind. Well, simply store your gadget in the archive drawer, pull out an old gadget to work on and fix, or start a whole new gadget. Make as many as you want! Untether Your Gadget Your gadgets don't have to stay in Retro Gadgets, oh no! With the flick of a switch bring your gadgets to your computer desktop!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1730260/header.jpg?t=1669914871",
    "Price": 19.99,
    "Developers": "Licorice ehf,Studio Evil",
    "Publishers": "Licorice ehf",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_9f8b31ca22ffca787fee979225b2a5fa95d965bc.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_c77a848ec87d25ded7546b472a44d500582b98bd.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_bd7bdb76e8841b257ecb77d0a5149730044b617c.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_ede381695c57da6520124cfe048ba7fbd1204448.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_afbf7516aa098f6c570cbbd265ae6d189f6c1174.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_cfbc04033336ba7d210357457df2a4c56c6f7eb6.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_e09de303ab18adfae6f0a37b2d9435f6a864ac51.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_df41ef9cae1c2d25e2d0adaf573b2f3161515c81.1920x1080.jpg?t=1669914871,https://cdn.akamai.steamstatic.com/steam/apps/1730260/ss_280a84b055a58b8542d42af7e69faca2738ce9e4.1920x1080.jpg?t=1669914871",
    "Slug": "retro-gadgets",
    "Meta Title": "Retro Gadgets: Nov 30, 2022, Licorice ehf,Studio Evil and...",
    "Meta Description": "Looking for information on Retro Gadgets? Check out the release date (Nov 30, 2022), developer insights from Licorice ehf,Studio Evil, and a complete ga...",
    "Alt Text Image": "Official header image for Retro Gadgets game - Steam 1730260",
    "Canonical URL": "https://gusku.site/game/retro-gadgets",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Retro Gadgets\", \"description\": \"Looking for information on Retro Gadgets? Check out the release date (Nov 30, 2022), developer insights from Licorice ehf,Studio Evil, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Licorice ehf,Studio Evil\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Licorice ehf\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1730260/header.jpg?t=1669914871\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}