{
    "AppID": 2128770,
    "Name": "SGS Okinawa",
    "Release date": "Nov 21, 2022",
    "About the game": "SGS Pacific D-Day - Okinawa It is common knowledge that the battles conducted by the Americans in the Pacific islands against the Japanese during World Ward II had been extremely tough and savage. This operational strategy game purpose is to let players discover the last and largest battle of the war, the Battle of Okinawa. Code named Operation Iceberg, it was a major battle of the Pacific War fought on the island of Okinawa by United States Army (USA) and United States Marine Corps (USMC) forces against the Imperial Japanese Army (IJA).The initial invasion of Okinawa on 1 April 1945 was the largest amphibious assault in the Pacific Theater of World War II. The 82-day battle lasted from 1 April until 22 June 1945. After a long campaign of island hopping, the Allies were planning to use Kadena Air Base on the large island of Okinawa as a base for Operation Downfall, the planned invasion of the Japanese home islands, 340 mi (550 km) away. The battle has been referred to as the 'typhoon of steel', and was the bloodiest in the Pacific, with approximately 160,000 military casualties combined: at least 50,000 Allied and 84,166–117,000 Japanese, including drafted Okinawans wearing Japanese uniforms. According to local authorities, at least 149,425 Okinawan people were killed, died by suicide or went missing, roughly half of the estimated pre-war population of about 300,000. CONTENT In this game, both sides are playable, and you have at your disposal different units, from mobile infantry, tanks and planes to static defences like bunkers, trenches, tunnels and mines. Your careful play and balance of units mix, plus clever usage of cards (which you receive every turn to assist your strategy) allow you to reach the victory goals: either capture the island without too many losses (on the US side) or hold it till the end while inflicting large casualties to the attacker (when playing Japanese). In this game you will fight the fiercest battle of the United States Marines Corps and US Army during the Pacific War, Okinawa, allowing you to play both sides: As in the previous battles of the war, the death toll was incredible and the fighting extremely tense, till the end. Can you do better than history and, as the American commander, take your key objectives in the fastest of time and with minimum loss of men? Or, as the Imperial Japanese commander, can you fight those doomed battles at a cost that will be intolerable for the enemy? The battle is at Battalion scale on both sides. The air units are usually equivalent to the usual CV Carrier Air Groups (CAG) (3 squadrons for CVs, one for CVLs). Fixed units such as bunkers, trenches or mines represent a few assets or buildings. Scenarios vary in length, for 20 to 40 turns, each turn representing usually 2 days. The game will offer you various starting options (more troops, more replacements, more air support, different at start positions) that may alter the historical setup and offer vast re-playability potential. Each scenario tells a different story pertaining to the historical battle it covers, but in general players will get the following common points among all scenarios: The Japanese have few mobile troops, armor, artillery and almost no planes, but their fixed defences are well organized and incredibly tough to break, as they account always for the difficult nature of the various island terrains. Their playing cards and events reflect this, plus the fierce nature of their defence. The American forces are well equipped, backed by a strong air force and impressive naval gunfire support, but their timeline and objectives are always very tight to meet and bound to be set off balance by the various traps and plans of the enemy. Those external constraints, but also various other assets, are covered by the diversity of the cards they have in hands. To be clear, as in history, the final outcome is inevitable: US forces will eventually clear the island of Japanese forces. But at what price? This is the challenge faced by the player, to make the fight on Okinawa much less bloody than it was historically. For players who already own the SGS PACIFIC D-DAY game, the similarities are striking, even in this new island battlefield, and they will find entering the game quite easy. However, the game is a stand-alone and does not require ownership of SGS PACIFIC D-DAY to be played. This game is dedicated to all United States Marines past, present and future. Thank you for your service. Estimated Playtime : 20h00+. Favoured Side : none. Hardest to Play : USA.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2128770/header.jpg?t=1669045764",
    "Price": 11.99,
    "Developers": "Strategy Game Studio",
    "Publishers": "Avalon Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_f0f0ebe5252fa295693f7912433ff20d19dbadef.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_b6ab3b0efe81779c712a504d66471c0b77efc3e9.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_4dc19569114dfd54d41d6c9a1459f9e5d1a75953.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_ef773989ef247a1d73427985c1d63c2e5b1f53d1.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_82d921ced2959fcc46765ace13f7d09157d2c004.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_a1126cde5e6994d789558c5623b3f7974b95c683.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_79d42017602e1ca3cb98e3273b2110fd41104248.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_b1d6382c8aa05194bf4888c7f93dcddd3085359e.1920x1080.jpg?t=1669045764,https://cdn.akamai.steamstatic.com/steam/apps/2128770/ss_2449de75699fe2e6d7e4dbf113b6076ff8d2366e.1920x1080.jpg?t=1669045764",
    "Slug": "sgs-okinawa",
    "Meta Title": "SGS Okinawa: Nov 21, 2022, Strategy Game Studio and Full ...",
    "Meta Description": "Looking for information on SGS Okinawa? Check out the release date (Nov 21, 2022), developer insights from Strategy Game Studio, and a complete game sum...",
    "Alt Text Image": "Official header image for SGS Okinawa game - Steam 2128770",
    "Canonical URL": "https://gusku.site/game/sgs-okinawa",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SGS Okinawa\", \"description\": \"Looking for information on SGS Okinawa? Check out the release date (Nov 21, 2022), developer insights from Strategy Game Studio, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strategy Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Avalon Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2128770/header.jpg?t=1669045764\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}