{
    "AppID": 1286580,
    "Name": "Ship of Fools",
    "Release date": "Nov 22, 2022",
    "About the game": "Ship of Fools is a seafaring roguelite co-op game where you play the Fools, the only creatures fool enough to brave the sea. The Great Lighthouse that once protected the Archipelago is broken and a storm of malice and corruption is coming. Together, you and your ship mate will jump aboard The Stormstrider and make your voyage across the sea. Man the cannons, ready your sails and protect your ship from sea monsters over multiple runs. It’s up to you to defend your home from the almighty Aquapocalypse. In a clamshell, Ship of Fools is a game about blasting away your seaborne foes with mighty cannons as you defend your ship. Inspired by modern classic roguelites and built for co-op, you’ll want to bring your first mate on deck and enjoy oarsome combat as you unlock new trinkets and artifacts to help you save the world from catastrophe. Designed for co-op play, frantic combat encounters with the horrifying creatures of the storm will test your teamwork. Work together to defend and repair the ship, combine item effects in powerful combos and make sure you have your shipmate’s back if you don’t want to become fish food. Uncover lost treasures and remote shops on the islands of the Archipelago, but plan your moves carefully! As you chart your way through the sector, the Everlasting Storm shifts and changes, blocking your paths with its fury. You’ll need to adjust your course in reaction to storm movements and decide when you can brave a trip to discover what lurks inside the storm. Man your ship as a solo sailor and fight your way through dangerous waters and keep the glory for yourself, Ship of Fools offers solo play as well as multiplayer. As they sing in old sailor songs: it’s sometimes better to have no crew than a dysfunctional one! With many Fools to play with, unique items to find and unlock, combat encounters to fight in and many islands to visit, each run will bring something new to your voyage. Bolster your strength each time, ready to defeat the monsters of the deep sea. Key Features Frantic nautical combat with another shipmate in co-op or as a solo sailor Colossal leviathans to challenge the hardiest of sailors Chart your route through the maps of the Archipelago and brave the Everlasting Storm Embody one of the unique Fools with special abilities to help you on your journey 100+ trinkets and artifacts to collect and combo for winning strategies Swashbuckling hand-drawn artwork to put the wind in your sails Please note: A controller is required for local multiplayer",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1286580/header.jpg?t=1669137094",
    "Price": 13.49,
    "Developers": "Fika Productions",
    "Publishers": "Team17",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_31c74b60275a8f283e61b065520081debe478e95.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_6e6bfa2693b6ecf93d2656a247b7a34f778809d7.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_142ba65198b8807c3fdfa0f3ca035da836cfdcde.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_65fee3f34d0153c85735b084fb11c1724658dfcc.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_1cc6723682e8092b3637558744aa508ac10a427e.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_ffdd7dab886913bdc60f679cd4a74f9115afe1fc.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_23718395cd621917120fc23ded210a32a874e413.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_042cbba8b817befeabf5597f5c9a5b25aa64a7fc.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_30b3b6965374602ee1e8e6e5fcfb08103d7786d5.1920x1080.jpg?t=1669137094,https://cdn.akamai.steamstatic.com/steam/apps/1286580/ss_b8253d3670e7b8f511d249d6354c65d316785969.1920x1080.jpg?t=1669137094",
    "Slug": "ship-of-fools",
    "Meta Title": "Ship of Fools: Nov 22, 2022, Fika Productions and Full Ov...",
    "Meta Description": "Looking for information on Ship of Fools? Check out the release date (Nov 22, 2022), developer insights from Fika Productions, and a complete game summary.",
    "Alt Text Image": "Official header image for Ship of Fools game - Steam 1286580",
    "Canonical URL": "https://gusku.site/game/ship-of-fools",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ship of Fools\", \"description\": \"Looking for information on Ship of Fools? Check out the release date (Nov 22, 2022), developer insights from Fika Productions, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fika Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team17\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1286580/header.jpg?t=1669137094\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}