{
    "AppID": 1956710,
    "Name": "Shrine of the Spirits",
    "Release date": "Dec 2, 2022",
    "About the game": "The demon army is invading and the Goddess is in danger! At the most critical moment, you lead many heroes, equipped with artifacts, to fight for the Goddess in a dark fantasy world! Together with your friends, fight against the demon army and become a legend of the Pantheon! Game Features ◆Idle Game◆: Casual idle game, entertainment life both. Offline or online hanging, you can automatically get experience, equipment, props and other resources The automatic leveling will make it easier for you to do as you wish, without delaying anything! ◆Many Gameplay◆: More than 20 different difficulties Gameplay, in which you can get precious treasures and a lot of resources Some are suitable for individual exploration; some require guild members to participate together; and some require competition with other players ◆Rich gifts◆: Three rounds of free 10 consecutive draws, you can easily get SS heroes. You can get a lot of diamonds and equipment by breaking through the levels, everything is under control! The rewards for all kinds of tasks are generous, just spend time and you can be rich Gameplay ◆ Guild gameplay◆: Guild Dungeon: Guild members can participate at any time, and they can get rewards as long as they deal damage to the guild BOSS. Kill the BOSS to get more rewards and move on to the next level Guild war: fight for the city with 3 other guilds and receive rewards according to the final ranking Guild Battle: Grab the resource points on the map and get rich rewards after occupying them for a certain period of time Pirate ship exploration: Guild members explore the mysterious map belonging to their own guild together, and various events can be triggered randomly on the map, such as treasure chests, merchants, pirates, etc. ◆Tower of Trials◆: There are a total of 6 types of trial towers, 5 of which can only dispatch heroes with corresponding attributes, and the other is that all heroes with all attributes can be on board Each layer is rewarded with props, and every five layers have additional rich rewards ◆War God Temple◆: There are a total of five halls of wind, fire, water, light and darkness, which are open on a rotating basis from Monday to Friday, with a few fixed ones open from Saturday to Sunday. The materials obtained can be sacrificed to different attributes of the goddess, each attribute hero can obtain the ability effect ◆Hall of Honor◆: God's domain wargame: choose 7 heroes to join the lineup and fight with other players, the more victories the more generous the reward, after 7 consecutive victories the current round of battle is over Time Link: just get on the list to get rewards, but also with other countries players to compete ranking Ladder of the brave: defeat other players to gain points and upgrade the ranking, and finally issue seasonal rewards according to the ranking Battle of Sanctuary: Each player can send three teams to compete with other players around the world, and get rewards according to the ranking of points at the end of each season ◆Relic Palace◆: Endless Expedition: 9 levels in total, defeat the monster guarding the level to get the reward, you can challenge once a day Labyrinth Exploration: In the labyrinth, the hero cannot recover after being injured or killed in battle. You will need to explore the labyrinth grid by grid, which will trigger many unknown events. Ancient Ruins: You need to send different heroes to enter three ancient ruins, and you can exchange the obtained materials for very precious props. ◆Adventure Port◆: Conquer all the cities in each region and get extra rewards when you defeat each city lord and meet the 3-star condition With each region, the number of stars increases, and more prizes are waiting for you to receive ◆Trial Mining Cave◆: The main output place of gold, experience, runes and other resources Each dungeon has 9 levels of difficulty, the higher the difficulty the more rewarding It is a must-play daily game ◆Fury Sea Battle◆: Send the fleet to deliver the cargo, and get the reward after completing the delivery. There are five levels of cargo to choose from, the higher the level the better the reward ◆Bounty system◆: The bounty task is divided into five levels: S, A, B, C, D. The S level task is the most difficult and has the most rewards The mission rewards include diamonds, 3-star-5-star hero fragments, competitive challenge orders, common and advanced contract books, common and advanced treasure exploration coupons, and furious sea battles refresh coupons If you are not satisfied with the quality and rewards of the quests, you can also reset the bounty quests with refresh tickets ◆Arena◆: There are four kinds of competitive play, which can get a lot of diamonds, high-level equipment and all kinds of rare props Game system ◆Maid system◆: Dainty maids that will provide powerful help in battle! You can attack the enemy while appearing as a support unit, and also improve the attributes of all heroes! ◆Sacred system◆: Following the development of the plot, you will get five holy relics The holy relics have the effects of stun, shield, healing, defense, and forbidden healing respectively After choosing one to equip, you will be able to play the effect of the holy object in the battle ◆Hero System◆: There are 6 types of heroes in the game: wind, fire, water, light, dark and soul. Through different combinations, you can form a variety of genre lineups The more heroes you collect, the more rewards you can get because many games require you to prepare more than one team to play. Gods, demons, werewolves, vampires, human heroes, etc. are all present here one by one. ◆Personal territory system◆: You can build several buildings in your personal territory Castle: After building it, you can increase your attributes and unlock higher levels of subspace and watchtower Subspace: You can send heroes to explore to get rewards Watchtower: Arrange heroes to be stationed to defend, and attack and defend through the watchtower during guild wars Money Tree: You can get a lot of rewards by watering it every day to raise its level. Welfare Center: You can receive rewards related to the guild",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1956710/header.jpg?t=1670069868",
    "Price": 0.0,
    "Developers": "Goddess",
    "Publishers": "Goddess",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_64cce3a270ae43befab407a634def4d179161183.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_c70217df6e98507631fbd57c8187a4bffd297ed9.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_44f46b3f2947d9110632f263bf5d2cc07b80c9ed.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_0914af2e14f74c25636dc8489954c2d9c1bf0134.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_386b731bfdf1591aac4373e541f63b886b81386d.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_897adc71021ed246a8704ddd9639e721bbf7be26.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_8c6b0dd57161ec30e35e0d52399486260ae3dbd5.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_8a083ae0ba8507b371bf85af0ed98860dc2d4979.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_91a680b8c9fba67bc35ecb356c3b68846cd24062.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_4ee775210217776a46221b88eedfd8caa6701fa9.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_023b4009e37e1f744501d2f207422ea762abe7b6.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_373763a8fe14ab5a8dd4ffb9f475b8acde9498ee.1920x1080.jpg?t=1670069868,https://cdn.akamai.steamstatic.com/steam/apps/1956710/ss_bc6dd8a65d7b4080a4f2607554cd4b5aaf40dfe7.1920x1080.jpg?t=1670069868",
    "Slug": "shrine-of-the-spirits",
    "Meta Title": "Shrine of the Spirits: Dec 2, 2022, Goddess and Full Over...",
    "Meta Description": "Looking for information on Shrine of the Spirits? Check out the release date (Dec 2, 2022), developer insights from Goddess, and a complete game summary.",
    "Alt Text Image": "Official header image for Shrine of the Spirits game - Steam 1956710",
    "Canonical URL": "https://gusku.site/game/shrine-of-the-spirits",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shrine of the Spirits\", \"description\": \"Looking for information on Shrine of the Spirits? Check out the release date (Dec 2, 2022), developer insights from Goddess, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Goddess\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goddess\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1956710/header.jpg?t=1670069868\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}