{
    "AppID": 2186380,
    "Name": "Teahouse of the Gods",
    "Release date": "Nov 23, 2022",
    "About the game": "Harness the energy of life itself to empower your body, control your environment, even delve deep into the mysteries of the mind! Will you use your newfound powers to maintain the balance of the universe, or will corruption stain your soul? Teahouse of the Gods is a 250,000-word interactive novel by Naca Rat. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. After one night at 'The Teahouse' on Mount Qingcheng in Sichuan, China, you wake with the ability to perceive and manipulate spiritual energy, known as qi. Now, you can see gods and monsters that ordinary people can't, and you can unlock extraordinary powers. On the path of the body, you can run faster, jump higher, and punch harder. On the path of the mind, you can create glamours and illusions that change people's perceptions of reality. And on the path of the environment, you can reach out to the world around you, from blades of grass, to the smallest teacup, to Mount Qingcheng itself. Under the guidance of gods and animal spirits, you can perceive a sickness slowly poisoning the mountain and its inhabitants. When an ancient enemy returns to the mountain with vengeance in mind, will you be ready to join the fight? The mysteries of Mount Qingcheng are beckoning you. Play as male, female, or nonbinary; gay, straight, bi, asexual, or poly. Explore a mountain village in China that's as timeless as myth, yet as modern as a trending hashtag on TikTok. Discover the secrets of your past life. Do they still have the power to shape your destiny? Rekindle an ancient romance, explore the possibilities with a long-lost friend, or charm a local mogul/memelord. Specialize in the body, mind, or environment path as you learn to control spiritual energy, or develop your skills in all three. Befriend a Romanian expat, a musical prodigy, a panda spirit, and a busy mother. Help a local resort owner plan a summer festival. (You're here to learn the hospitality industry, remember?) Eat. Eat vegetarian, kosher, halal, or try everything: gourmet delicacies, spicy local fare, street food, and dishes from around the world…and beyond. Thousands of years later, you're home at last.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2186380/header.jpg?t=1669214191",
    "Price": 4.61,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2186380/ss_5699eb0029038348ac91240f90f4e5bf40e690de.1920x1080.jpg?t=1669214191,https://cdn.akamai.steamstatic.com/steam/apps/2186380/ss_118c27768181bf66fe04776bb59dcfdd7fcb0249.1920x1080.jpg?t=1669214191,https://cdn.akamai.steamstatic.com/steam/apps/2186380/ss_eee7cbfdc59e18868ac34c5a323c106d63778c98.1920x1080.jpg?t=1669214191,https://cdn.akamai.steamstatic.com/steam/apps/2186380/ss_8a9b6411da8daa1e10d49eb13ab682a50edc5332.1920x1080.jpg?t=1669214191,https://cdn.akamai.steamstatic.com/steam/apps/2186380/ss_8204921dbd4ad30781b8ebc500428a6c59fbd2a8.1920x1080.jpg?t=1669214191",
    "Slug": "teahouse-of-the-gods",
    "Meta Title": "Teahouse of the Gods: Nov 23, 2022, Choice of Games and F...",
    "Meta Description": "Looking for information on Teahouse of the Gods? Check out the release date (Nov 23, 2022), developer insights from Choice of Games, and a complete game...",
    "Alt Text Image": "Official header image for Teahouse of the Gods game - Steam 2186380",
    "Canonical URL": "https://gusku.site/game/teahouse-of-the-gods",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Teahouse of the Gods\", \"description\": \"Looking for information on Teahouse of the Gods? Check out the release date (Nov 23, 2022), developer insights from Choice of Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2186380/header.jpg?t=1669214191\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.61, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}