{
    "AppID": 2106810,
    "Name": "The Forest of Drizzling Rain",
    "Release date": "Nov 16, 2022",
    "About the game": "■ABOUT THIS GAME First released on 'Freem!' October 11, 2013, the exploration horror game The Forest of Drizzling Rain is now coming to Steam with a full remake! Playing as Shiori Kanzaki, you will get to enjoy her visit to Azakawa Village, right up until you are plunged into a world of fear. Every aspect of the game, from the story to the visuals, has been updated in this compete remake of the original from nine years ago. 1) More endings to choose from, including bad endings with story lines at every turn, even from very beginning of the game. There are additional late game ending routes and even a special scenario for players who conquer all of the endings. 2) A second chapter has been added in the middle during which you can freely walk around the map of beautiful Azakawa Village. Chat with some of the more colorful villagers, or spend your time fishing in one of the minigames while enjoying this new scenario. Who knows, maybe Shiori's accomplishments during the day will have an effect on her nighttime conversations with Suga. 3) Meet new characters with new story lines. There are many completely new additions to the story that never appeared in the manga or novels! 4) Enjoy the same polished finish and delicate attention to detail found in later titles such as Angels of Death, with newly rewritten conversations and events, and a complete remake of the map. 5) the Taking Spirit is a shocking new scenario which paints a deeper picture of the sad truth that has haunted Azakawa Village for the past several hundred years. And that's not all. This full remake definitely has plenty to offer. Even veterans of the original freeware version are likely to find themselves repeatedly diving in to enjoy the refreshing new gameplay. One unassuming female college student, one tiny village, and one long night filled with incomprehensible fear. Why don't you try exploring Azakawa Village, and perhaps you can expose the hidden truth while you're at it. ■STORY All alone following the death of her parents, Shiori Kanzaki happens to run across an old photograph in their bedroom. In that photograph, which bears the unfamiliar inscription 'Azakawa Village,' is a young Shiori with her parents, along with another man old enough to be her grandfather. Shiori goes looking for that village and pays a visit to the local museum, where she meets Kotaro Suga. Suga, the museum curator, strongly urges her to leave the village immediately. When Shiori continues exploring Azakawa Village, a secret truth gradually comes to light. What will her reaction be once all is fully revealed? ■PROFILE Makoto Sanada Makoto Sanada is a Japanese video game designer. His debut title, The Forest of Drizzling Rain, drew lots of attention when it was first made available on the Internet in October of 2013. And it continued to grow in popularity as translations appeared from volunteers in countries all around the world. His next game, Angels of Death, released in installments by Game Magazine (formerly NicoNico Game Magazine) starting in August of 2015 and continuing until the following February, saw an anime adaptation and went on to become a big hit. Together, both titles have garnered a wide fan base of all ages with their various multimedia releases including novelizations and comic adaptations. Crossing the boundaries between entertainment and literature with their sensitive character portrayals and bold plot lines, Makoto's stories have become hugely popular among fans both young and old. ■Guidelines for distribution of the remake of 'The Forest of Drizzling Rain' Game Magazine actively supports derivative works (manga, illustrations, goods, novels, production and distribution of live-action videos, etc.) related to our works. We hope that the appeal of our works will be conveyed to as many people as possible through the secondary creative activities of our fans. For this reason, no prior confirmation or notification to us is required for non-commercial doujinshi activities (production and distribution of doujinshi, posting on video and illustration websites, etc.). Also, you do not need to contact us to register your derivative works with the Creator Incentive Program (Nico Nico Douga) or use them on a paid channel or an ad-monetized YouTube channel. Individuals and corporations who are considering creating derivative works for commercial purposes that do not fall under the above categories are requested to contact us using the Game Magazine Inquiry Form. Occasionally, people contact us to request official restrictions on certain individuals' derivative works that they do not themselves engage in. While we appreciate such comments, we cannot promise to respond to them, nor can we respond to them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2106810/header.jpg?t=1668684248",
    "Price": 12.79,
    "Developers": "Vaka Game Magazine,Makoto Sanada",
    "Publishers": "Vaka Game Magazine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2106810/ss_f99f7bcb984ec749e909eebf37dd143ef684947d.1920x1080.jpg?t=1668684248,https://cdn.akamai.steamstatic.com/steam/apps/2106810/ss_c2551c09ac0226b7f6af80c4a19bb8811ffc6dda.1920x1080.jpg?t=1668684248,https://cdn.akamai.steamstatic.com/steam/apps/2106810/ss_90876558366c3aa0c3f66711d3e24f5bae77daa8.1920x1080.jpg?t=1668684248,https://cdn.akamai.steamstatic.com/steam/apps/2106810/ss_a5f570d640c0a3e1fc32deff3230466bd4335d30.1920x1080.jpg?t=1668684248,https://cdn.akamai.steamstatic.com/steam/apps/2106810/ss_734635a7cb7c8aaa30b28e06a182c545835ab979.1920x1080.jpg?t=1668684248",
    "Slug": "the-forest-of-drizzling-rain",
    "Meta Title": "The Forest of Drizzling Rain: Nov 16, 2022, Vaka Game Mag...",
    "Meta Description": "Looking for information on The Forest of Drizzling Rain? Check out the release date (Nov 16, 2022), developer insights from Vaka Game Magazine,Makoto Sa...",
    "Alt Text Image": "Official header image for The Forest of Drizzling Rain game - Steam 2106810",
    "Canonical URL": "https://gusku.site/game/the-forest-of-drizzling-rain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Forest of Drizzling Rain\", \"description\": \"Looking for information on The Forest of Drizzling Rain? Check out the release date (Nov 16, 2022), developer insights from Vaka Game Magazine,Makoto Sa...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vaka Game Magazine,Makoto Sanada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vaka Game Magazine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2106810/header.jpg?t=1668684248\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}