{
    "AppID": 2063500,
    "Name": "The Rat Plague",
    "Release date": "Nov 14, 2022",
    "About the game": "'Pestis' is a platform adventure game that combines modern design ideas with the visual effects of the console in the 1990s. The interface mainly simulates the display style of the old CRT TV. While providing a refreshing and striking sense of the arcade version, it also brings some special mechanisms that are not common in old games, such as moonlight, gravity and time. Fight with the enemy around the mechanism, solve environmental puzzles, explore the hidden areas of the map, and excavate the dark secrets buried deep under the surface of the planet. Through carefully designed retro UI, sound effects, scenes, special effects and gameplay, you can harvest a comfortable game experience that only belongs to the millennium! This will be a carnival belonging to vintage lovers. And on the basis of vintage, the game has made a lot of adjustments based on the habits of modern players to ensure that the game is more user-friendly under the premise of restoring the flavor, rather than being as crazy as the early Demon Village and World Tree Maze! Find roads in hand-made compact box levels, pass through ruins, relics, underwater, and even space, fight with scheme, ambushes and dangers along the way, discover treasures and secrets buried in the depths of the planet, and create your own adventures in a tense and exciting process! Add new functions to the mouse's spacesuit! It can not only add bricks and tiles to combat effectiveness, but occasionally greatly change the way of exploration. Whether you like to fly over the enemy's head to pour firepower, like to manipulate the scene to change the situation, or take a detour to avoid fighting, this game will provide a perfect experience. Add new functions to the mouse's spacesuit! It can not only add bricks and tiles to combat effectiveness, but occasionally greatly change the way of exploration. Whether you like to fly over the enemy's head to pour firepower, like to manipulate the scene to change the situation, or take a detour to avoid fighting, this game will provide a perfect experience. The brave adventurer, the spaceship, crashed into a planet that replaced natural life with machinery. The coup, plague, destruction, and all kinds of bad guys took turns to appear with their own purposes. Can rats find the meaning they are pursuing on this turbulent stage? The theme of the game originated from an ancient proposition that has been questioned by countless written works: When everyone denies the meaning of your existence, can you overturn the denial of the outside world? In addition, Camus's literary work Plague also provides some ideas for the arrangement of the script. You can feel similar literary nature in some plots, as well as the unique narrative characteristics of video games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2063500/header.jpg?t=1668413011",
    "Price": 4.49,
    "Developers": "GouHong Studio",
    "Publishers": "BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_3e4cee81f7b5c4ae123fa65f684487cda0239c09.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_3c36bfc6df762f2df027df6e3dd960c785d77b65.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_1a147348acc7f1320f3bbf70cc5ebc4d1b91008c.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_363c821dc95215365f0dded077259b6432aca4f7.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_c58f2114d269e7f32a674f30e1100938c6d71e02.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_6fa647ed3c2cf0f2ddd85f1558f3638b1cb244a0.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_8b448972d9b5fca2ac21cae9ea1eac21abec96b1.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_926164956127f281f1a79817898a724565c68d24.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_fbbae5a78035e160ecbf90984a6efc1e9d5cdc2e.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_d4900c9bfb9d16b7c1c1038ccdc40dc251a9563c.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_39c501e1bbdcd32c284b32decb31fd92ffa956bc.1920x1080.jpg?t=1668413011,https://cdn.akamai.steamstatic.com/steam/apps/2063500/ss_43b6edb916f2d4f0d0543a43e10b870c870b41c8.1920x1080.jpg?t=1668413011",
    "Slug": "the-rat-plague",
    "Meta Title": "The Rat Plague: Nov 14, 2022, GouHong Studio and Full Ove...",
    "Meta Description": "Looking for information on The Rat Plague? Check out the release date (Nov 14, 2022), developer insights from GouHong Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for The Rat Plague game - Steam 2063500",
    "Canonical URL": "https://gusku.site/game/the-rat-plague",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Rat Plague\", \"description\": \"Looking for information on The Rat Plague? Check out the release date (Nov 14, 2022), developer insights from GouHong Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"GouHong Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2063500/header.jpg?t=1668413011\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}