{
    "AppID": 2195530,
    "Name": "Theocracy",
    "Release date": "Nov 24, 2022",
    "About the game": "Explore, conquer, convert and... release the Kraken! Theocracy is a classic 4X, turn-based, single-player, strategy game . As you lead your theocratic empire to world domination, strategic usage of peaceful radiation of divine power, decisive military campaigns and wise invoking of miracles, are all necessary elements of expansion and victory. Might and myth Recruit armies and command them across the world. Explore the terra incognita , peacefully convert pagans and enemy regions by divine power, or conquer them by brute force. Manage and improve your regions, construct fortifications and shrines in strategic locations, discover new knowledge and advance. Oh, and thou shalt enact dogmas and cast miracles! Do rely on miracles Things not going well? Summon monsters and holy men, or thunder-strike an approaching army. Punish sinners by volcanic eruption, or amaze them by solar eclipse. Game too long? Trigger the Apocalypse, now! Or later. Just watch out for those formidable heretics, atheists and aliens! Indie &amp; old-school Truly independent, home-made strategy game for fans of good old PC games. Call it retro, if you will. Designed, developed and crafted completely by one person. This is a game like your grandma used to make 'em: cute 2D graphics and slow-paced gameplay, which exercises your brain rather than your thumbs. Oh mighty and pious leader, lead your faithful people to glory and subdue the foes. Game concept Theocracy is a turn-based strategy game. Players take turns to move their armies, attack the enemies, cast miracles, choose research, decide what to produce in their regions and enact dogmas (commandments). Your goal is to expand your theocracy into a dominant world empire by defeating your opponents. This is achieved by conquest and peaceful conversion of other regions on the map and their incorporation into your own theocracy, and by disruptive divine interventions, which you can trigger - miracles and dogmas. At the beginning of the game, the ancient, undiscovered world is filled with pagan regions. You and your AI opponents - leaders of other theocracies - all start with one region (the Holy Land ), and from there you explore the world, expand your empires and try to defeat each other. Regions can be conquered by armies, or peacefully converted by impact of Power . Power is a special resource, which radiates from your regions, shrines, holy men and miracles, and impacts its wide surroundings. Power is used to convert tiles and other regions, and as it accumulates, it is used to enact dogmas and cast miracles. Important achievements in the game are rewarded by Victory Points . The first player to reach 100 Victory Points wins . Victory Points are awarded for percentage of world population following your religion, for number of other players' Holy Lands which you conquered, for enacting the dogmas, creating holy men, discovering sacred mountains and (should it be necessary) invoking the Apocalypse miracle. This is a humble, indie game, made byte by byte, pixel by pixel, from scratch, without any game engine. The game is done in retro, vintage style, with top-down 2D world based on classical antique maps. The game avoids tiring complexity and micro-management of dozens of features typical for its larger 4X cousins, and focuses on the action - why waste time building roads and farms, when you can just flood the enemy region?!? A game can be won or lost in a single gaming session.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2195530/header.jpg?t=1669345217",
    "Price": 6.99,
    "Developers": "Marcel Strbak",
    "Publishers": "Atlantis Workshop",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_8a4b91a6c1858bf3736145fb8f574fcd60a37613.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_3ce6303ee66485aa65982035dac88ca238bf2bf7.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_db3adfd1e4696cf0eaffed29052bf53598d269fa.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_129e04c8abfe39d1803b91f8dfc04dc7bcc4c550.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_8f8a446d0f672ea365fda9120ef5ccc0f5fabee3.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_0a938dd8e8520b61c708747b1e279d734c0f5007.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_c52aca08f35de62befa5f5cedb1fba89f026728b.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_1fd408928f5ac2a9ffef06f66771cb1d95325044.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_04ce651862a14af5a1bf25e6c30cdfc5cec6eef7.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_9dded2f9ad6991405e1a4973eabd6cac901ec4fa.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_efa9041c89253cb2b2021b9976feb80900450d6a.1920x1080.jpg?t=1669345217,https://cdn.akamai.steamstatic.com/steam/apps/2195530/ss_59dc7a150120359a91b9c2715a35027add62826f.1920x1080.jpg?t=1669345217",
    "Slug": "theocracy",
    "Meta Title": "Theocracy: Nov 24, 2022, Marcel Strbak and Full Overview",
    "Meta Description": "Looking for information on Theocracy? Check out the release date (Nov 24, 2022), developer insights from Marcel Strbak, and a complete game summary.",
    "Alt Text Image": "Official header image for Theocracy game - Steam 2195530",
    "Canonical URL": "https://gusku.site/game/theocracy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Theocracy\", \"description\": \"Looking for information on Theocracy? Check out the release date (Nov 24, 2022), developer insights from Marcel Strbak, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marcel Strbak\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atlantis Workshop\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2195530/header.jpg?t=1669345217\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}