{
    "AppID": 2135920,
    "Name": "Tivick'ing! Chronicles",
    "Release date": "Nov 25, 2022",
    "About the game": "On the continent of Arcadia, the princess of Kent suddenly vanishes without a trace. Kent's army and those of nearby towns and villages all help to look for her, but none could find even a hint of where she had gone. Over the next few months, the princess would strangely begin slipping from the memories of those who knew her. Before long, it was as if nobody could remember she had ever existed at all... Around the same time as the princess' disappearance, mysterious pages filled with great magical energy begin appearing all over the continent. Those who find them are granted power, but nothing but darkness and chaos follows their owners... What are the origins of these strange pages, and could they somehow be linked to the disappearance of the princess? As you travel across Arcadia, you'll meet various characters. Some of them will join your party and grant you access to specific field commands! Learn where and when to use these field commands to solve puzzles and unlock new areas of the map to explore. Each character has a limited set of attacks to choose from during battle. However, you can eventually unlock an alternate set of attacks for each character! You can only bring two allies into battle with you, so pick and choose your combination wisely. You will discover various Gear as you explore, which grant additional stats or attacks when equipped to your weapon. At first your weapon will only be able to fit one Gear, but you can unlock the ability to equip more by collecting Bolts and bringing them to a certain NPC you meet later! Assignments can be changed in the Game Properties dialogue box, which is displayed by pressing the F1 key while the game is running. Below are the default settings*, and the correspondence between buttons and game commands. * Default settings for gamepad may vary depending on the gamepad being used. Make sure to check the Game Properties dialogue box if the assignments do not match your particular gamepad.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2135920/header.jpg?t=1669409416",
    "Price": 3.39,
    "Developers": "NGS Studios",
    "Publishers": "NGS Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2135920/ss_fce8ba4f733a7e607365167b522c3ab25fb89616.1920x1080.jpg?t=1669409416,https://cdn.akamai.steamstatic.com/steam/apps/2135920/ss_9d31667b84d81f98e197077d3bf934625f741b00.1920x1080.jpg?t=1669409416,https://cdn.akamai.steamstatic.com/steam/apps/2135920/ss_bb5eb4fb941e8d336a9d2d2a4f9308ec1e0c9e7e.1920x1080.jpg?t=1669409416,https://cdn.akamai.steamstatic.com/steam/apps/2135920/ss_b69944b48f36baba30eaaa7d7a401e42f6c6ee44.1920x1080.jpg?t=1669409416,https://cdn.akamai.steamstatic.com/steam/apps/2135920/ss_9fc0873ce0a6c8ba283ec69ef949b6ebca91e773.1920x1080.jpg?t=1669409416",
    "Slug": "tivick-ing-chronicles",
    "Meta Title": "Tivick'ing! Chronicles: Nov 25, 2022, NGS Studios and Ful...",
    "Meta Description": "Looking for information on Tivick'ing! Chronicles? Check out the release date (Nov 25, 2022), developer insights from NGS Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Tivick'ing! Chronicles game - Steam 2135920",
    "Canonical URL": "https://gusku.site/game/tivick-ing-chronicles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tivick'ing! Chronicles\", \"description\": \"Looking for information on Tivick'ing! Chronicles? Check out the release date (Nov 25, 2022), developer insights from NGS Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NGS Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NGS Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2135920/header.jpg?t=1669409416\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}