{
    "AppID": 2176070,
    "Name": "Transliminal",
    "Release date": "Nov 15, 2022",
    "About the game": "The year is 1980. After a skydiving accident, you awaken with your cheek pressed against a damp beige carpet. The tacky, off -white wallpaper looks yellow on your video camera's view screen. As the old lights, randomly placed in the drop ceiling above, bathe the place in their sickly glow. The buzzing from the fluorescent lights above seems louder than it should be. And what is that smell? Sounds echo through the endless halls from no clear direction. And it feels as if someone, or something, is watching you. You aren't sure where you ended up. But what's clear is that you will not be safe until you find a way out of this place. GAME PLAY In 'Transliminal' your character finds themselves in an ever shifting maze of rooms and corridors. The player's goal is to explore these strange spaces, while looking for clues and items to progress the adventure. Players will be able to seamlessly traverse between multiple levels with no loading screens. Survive reality bending phenomena and otherworldly entities. Find a way out. Before you go insane, or worse. Play your own unique 'found footage' Backrooms adventure. In 2022 the internet exploded with backrooms inspired video content in the found footage format. This style lends itself well to a first person horror experience. STYLE Transliminal's visual language isn't just a retro VHS recording skin. Players will quickly notice that these visual flourishes are indicators of the game character's physical and mental condition. MINIMAL UI Indicators showing character condition, and the various ways the character can interact with the world are minimal and only appear when relevant. The goal is to disrupt the players immersion as little as possible. The game does feature a menu screen that indicates important information such as stats and inventory. STORY From the opening scene it's clear that the main player character has his own issues to work out. But as you explore the various levels, you may find the threads that weave together several tales that came before you. Reactive World &amp; Character. What sets Transliminal apart is not only how the main character reacts to the game world, but also how the environment reacts to the character and their condition. THE LEVELS The concept of procedural liminal spaces that go on forever is a rich subject matter. And gives the opportunity to explore wildly different environments that don't always follow the rules of physics. Players of Transliminal will traverse many strange structures and vistas over the course of their adventure. What's not immediately apparent is that the levels are also watching you. Reacting and changing depending on your character's condition. While exploring, players will soon find that the environment around them is non-linear and seems to form around them. When tracing back to where they came from, players will find that paths they have traveled are no longer as they were. THE PROTAGONIST Fully voiced protagonist that responds to the world and situations appropriately. He seems to have a dark sense of humor and likes to talk to himself. CHARACTER IMPROVEMENT The character has stats such as Health, Stamina, and Sanity that can be improved through game play. LOOT Containers such as drawers and cabinets can be found and looted to find cassette tapes, flashlight batteries, and more. Find cassettes to uncover clues What dangers await Environmental Hazards The twisting hallways and passages pose their own threats. And as you lose your mind the dangers grow more numerous. But it would also seem that you are not alone here. ENTITIES Something in the shadows Many classic entities of internet lore are brought to life While some previously unknown entities also make their debut. IN CONCLUSION Transliminal features a shifting, reactive level design. An engaging narrative, and plenty of scares. If you are a fan of cerebral horror and an explorer at heart. Then this game is for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2176070/header.jpg?t=1668527118",
    "Price": 14.99,
    "Developers": "Corey Jeffries",
    "Publishers": "Spatial Quotient",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2176070/ss_e9dd0b27c3ebca03520cdb06503935fe0b22e91b.1920x1080.jpg?t=1668527118,https://cdn.akamai.steamstatic.com/steam/apps/2176070/ss_92fe4cd4fb9d729a75ed0691057692ac28b101db.1920x1080.jpg?t=1668527118,https://cdn.akamai.steamstatic.com/steam/apps/2176070/ss_e83bdf6e9c4240e1d1fa213d50dd20833cd0c830.1920x1080.jpg?t=1668527118,https://cdn.akamai.steamstatic.com/steam/apps/2176070/ss_e998e9b4dd90dbd25df35ec69f669e515e40d19b.1920x1080.jpg?t=1668527118,https://cdn.akamai.steamstatic.com/steam/apps/2176070/ss_20c194977bb3c3f90da23c9e98cefe33f086c746.1920x1080.jpg?t=1668527118,https://cdn.akamai.steamstatic.com/steam/apps/2176070/ss_d0918f12031b286ab4096d0491dd608be9f2dc59.1920x1080.jpg?t=1668527118",
    "Slug": "transliminal",
    "Meta Title": "Transliminal: Nov 15, 2022, Corey Jeffries and Full Overview",
    "Meta Description": "Looking for information on Transliminal? Check out the release date (Nov 15, 2022), developer insights from Corey Jeffries, and a complete game summary.",
    "Alt Text Image": "Official header image for Transliminal game - Steam 2176070",
    "Canonical URL": "https://gusku.site/game/transliminal",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Transliminal\", \"description\": \"Looking for information on Transliminal? Check out the release date (Nov 15, 2022), developer insights from Corey Jeffries, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Corey Jeffries\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spatial Quotient\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2176070/header.jpg?t=1668527118\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}