{
    "AppID": 2084050,
    "Name": "Unsolved Case",
    "Release date": "Nov 24, 2022",
    "About the game": "Please note that Unsolved Case is a game for two players only, and both need a copy on their own devices (mobile, tablet, PC, or Mac). Players also need to have a way to communicate with each other. ABOUT UNSOLVED CASE Unsolved Case is the free prequel to the popular cooperative point-and-click puzzle game 'Cryptic Killer' series. Dip your toes in and go back to where it all began as you team up in two as detective duo Old Dog and Ally, up against the Cryptic Killer. For the first time in the series, you'll encounter a labyrinth of puzzles and challenges laid by one of the most devious minds in the world. Solve puzzles, crack codes, and find a way out. Have you got what it takes to crack the Unsolved Case of the Cryptic Killer? Unsolved Case is a free game for two players to complete in 30-60 minutes. In this puzzle game, you'll get a taste of the mystery to come over the 5-part Cryptic Killer series. THE PREQUEL Years ago the twisted Cryptic Killer was put away behind bars at the infamous Anagram Asylum. But today, he's back, and he's taunting the detectives. Did they catch the wrong guy, or are they looking at a copycat killer? A new lead arrives in the form of a mysterious locked box. Delivered direct to their addresses, detectives Ally and Old Dog are once again sent on a chase that'll challenge them unlike any case before. Explore new locations, crack codes, and unravel the mystery. In this prequel, you're invited to step into the detective's shoes and return to where it all began. THE ONLY WAY TO ESCAPE IS TO WORK TOGETHER Two minds are better than one, and the only way you'll be able to crack the Cryptic Killer's codes is by working together. Through separate screens, you and a friend will be given half of a puzzle at each location. Communicate, collaborate, and work together to push your puzzle-solving skills to the limit. 📦 Crack the codes to get into the locked box 🧠 Combine your knowledge to solve challenging puzzles 🧩 Fax each other information across two locations 🎲 Rewire equipment, hack the CCTV, and work together to escape ✏️ Get creative - some puzzles require you to draw on the screen ❄️ Hurry, or you'll lose more than just the case! FEATURES LIST Free Game: Dip your toes in and play detective for the day in this prequel case for detectives Ally and Old Dog, before you try the full series. 30-60 Minutes to Solve: The prequel takes place over one bitesize chunk of fast-paced, puzzle-solving gameplay. Two Player Co-Op: In Unsolved Case, the detectives are separated. You’ll see different items and clues than your partner and will be tested on your communication! Challenging Collaborative Puzzles: Two brains are better than one when it comes to cracking the Cryptic Killer's codes. Explore Illustrated Worlds: Unsolved Case's hand-illustrated environments are inspired by noir novels. Draw on… Everything! You can't solve a case without taking notes. At any time in the game, you can whip out a notebook and pen to make notes and scribble on your environment. MEET THE DETECTIVES MEET DETECTIVE ALLY Name: Allison Abernathy ('Ally' for short) From: Glasgow, Scotland Ally grew up in a police family and was always destined to sign up. A force to be reckoned with, when she puts her mind to something, nothing gets in her way. But that streak of success came to a head when the case of the Cryptic Killer fell across her desk. Partnering with Polish detective, 'Old Dog' Kowalski, at first it seemed like just another day, another case, and another criminal to be caught… But this case would prove to be different. Success would come at a far greater cost, lasting Detective Abernathy for decades to come. With a new lead and a new peril, old wounds are about to be reopened. MEET DETECTIVE OLD DOG Name: Steve 'Old Dog' Kowalski From: Krakow, Poland Old Dog has an age beyond his years, older, wiser, and hardened by life. From an early age, he wanted to work in law enforcement and achieved his dreams as a young officer in the Polish police force. His career followed success after success, that was until he was assigned a curious international case with Scottish detective 'Ally' to track down the Cryptic Killer. With the killer safely behind bars, something didn't quite feel right. That something has been nagging at Old Dog for decades since. Essentially a loner, Old Dog spends his nights listening to Jazz and drinking whisky as he obsesses over the details of the old case. All but keeping him from spiraling is his partner Ally. Will this new break upset the careful balance? ABOUT ELEVEN PUZZLES Five friends from Scotland and Poland, brought together by a love of games and puzzles, decided to create an online escape room that would challenge, excite and entertain. Dozens of puzzles, hundreds of hours, thousands of coffee cups later, Eleven Puzzles was born and the Cryptic Killer series of digital escape rooms was published online. After being played by tens of thousands of escape room enthusiasts worldwide Eleven Puzzles have expanded the team, improved the series, and are bringing their long-awaited, award-winning escape rooms to Steam.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2084050/header.jpg?t=1669413104",
    "Price": 0.0,
    "Developers": "Eleven Puzzles",
    "Publishers": "Eleven Puzzles",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_1f2a55952cf73aa3f7e6676dcc3bc52f17f826b8.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_d4ebea5052baeb5f1efa57b254adf9a2c2b8b02e.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_2e769a723d371e593d6c948491a2c67a73591a96.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_5bd955ea6cdefeafca7f7cc8a2d9cfc905e54ac8.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_d33d32f69589a44fef2d16148d72eef5c040b4e5.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_9ee686bb5f92a7afe7522582d7dc8b0ff99b41e3.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_e8c2768a8c0a51d1767b21982dac737c6e2d0532.1920x1080.jpg?t=1669413104,https://cdn.akamai.steamstatic.com/steam/apps/2084050/ss_4bc885bfd7b8e712b83e2e2e8c87f282f55b5c0b.1920x1080.jpg?t=1669413104",
    "Slug": "unsolved-case",
    "Meta Title": "Unsolved Case: Nov 24, 2022, Eleven Puzzles and Full Over...",
    "Meta Description": "Looking for information on Unsolved Case? Check out the release date (Nov 24, 2022), developer insights from Eleven Puzzles, and a complete game summary.",
    "Alt Text Image": "Official header image for Unsolved Case game - Steam 2084050",
    "Canonical URL": "https://gusku.site/game/unsolved-case",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unsolved Case\", \"description\": \"Looking for information on Unsolved Case? Check out the release date (Nov 24, 2022), developer insights from Eleven Puzzles, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eleven Puzzles\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eleven Puzzles\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2084050/header.jpg?t=1669413104\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}