{
    "AppID": 1936940,
    "Name": "Vayan",
    "Release date": "Nov 30, 2022",
    "About the game": "After decades of peace, Ettlecar, Great Leader of the Yovas, is about to draw his last breath. Shortly before departing for the great beyond, he has appointed the steward who will be ruling over the kingdom until a true heir is chosen. Much to everyone's surprise, the chicken Skalope has been designated for the task, being Ettlecar's most trusted subject. Although Skalope is descended from a long line of chicken athletes, this decision is bringing shame and ridicule to the Yova people. Indeed the Yovas have thus become the first tribe to ever be ruled over by poultry, and this piece of news has sparked the outrage of the Elders resting in the hereafter. Enraged, they initiate an eclipse enabling them to reach the world of the living, and start organising a competition meant to appoint a sovereign who will be worthier of Ettlecar and the Yovas. With the Elders in charge, the tournament is bound to follow the ancient rules. Obviously, as the village warrior, you will enroll and give it a try. But you won't be the only one to do so, and despite your determination to be the best, you will have to face a number of people ( Gods, neighbouring tribes, even Skalope himself) who have an interest in letting the Yovas remain « the chicken's people ». Will you be able to survive long enough, to defeat the evil creatures and escape the traps that you will encounter in the arena, and thus prove that you deserve to be chosen, in order to give the Yovas their pride and dignity back ? ONLINE OR LOCAL MULTIPLAYER In Vayan, between one and 4 players can fight, either locally or on-line, in a dynamic arena which offers a series of random trials. Dodging flames, jumping over spears, fighting demons, the fighters will be tested in the most hostile atmosphere. Don't get to close to the edge of the arena or you may fall and get roasted by lava underneath. But the Elders are lenient and will allow you come back to life again and again to try and gather as many points as possible and win the champions' ranking. SOLO CHALLENGE You can choose to test your « Skills » in arenas purposefully designed for extreme challenges. Try to be the fastest, to collect as many points and combos as possible, and record your score in a ranking shared with the whole community. TWITCH REVOLUTION Be careful, following the appearance of an eclipse, certain damned souls roam the stands and can play tricks on you by taking possession of monsters or putting a spoke in your wheels! Are you a Twitch Streamer ? Vayan was designed from the ground up to work fully with chat interactions. Each arena gives the possibility to interact with the game to help or hurt the players. Do you have a caring community ? Viewers have a scoring system, they progress throughout the game and unlock special skills based on their points. Twitch connection not required, an AI will replace the viewers if they are not present. CHAIN CHALLENGES WITHOUT LOADING Challenges follow each other frantically in a transformable arena in real time. Thanks to our innovative and fun system, no part of Vayan is alike. The arenas follow each other randomly and only leave room for immediate action. Think of only one thing, to survive! BESTIARY In certain challenges, you will be expected to fight hordes of monsters whose only goal is to prevent you from becoming the champion. Face imps, orcs, spiders, carnivorous plants, living-deads, wizards, bewitched spinning-tops, Skalope himself or even dragons. Vayan is no pic-nic in the park ! Each round will lead you to a Boss. You can choose to partner up with opponents or viewers to exterminate that monster and earn the Elders' respect. OBJECTS During the tournament, you will regularly pick up objects that will help you to remain at the top of the ranking. - Long-range weapons(bazookas, crossbows, exploding barrels,...) with which you will turn into a true war machine. - Equipment to enhance your physical abilities ( healing potions, speeding boots, …) - Traps : you don't intend to let your opponents make their way to the top ! EVIL CONTRACTS Sometimes, a salesman will invite you to sign contracts in your own blood : those are extra challenges which will add depth to your gameplay and your strategy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1936940/header.jpg?t=1670157236",
    "Price": 11.99,
    "Developers": "GoFlood Studio,Stilk",
    "Publishers": "Goflood Studio,Stilk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_96b61de8022457c881cf2894375ab3193ba3ba53.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_e8fb0ad635bc3c447d1bed296eac1193d4d451e7.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_18596db00a414f7780ba5f35ef9bd57d4fa29865.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_6dec18d001becee287bd27154de2b6b1fd257749.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_5ee2cb46752a7eae8e6de95533af700b9ae717d8.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_187bd0ab7ceefd77f2e0d012fbda5d0be64d5573.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_acfbee23a2211d5bf793c984ba2eac2d1db5c186.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_93b78e3d655218e44ebe8504ff7154e2a88ec659.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_8ebc1931b68317479800295042decda7ddb2f640.1920x1080.jpg?t=1670157236,https://cdn.akamai.steamstatic.com/steam/apps/1936940/ss_0ef128b44b99a05a50025478f581652c7f391add.1920x1080.jpg?t=1670157236",
    "Slug": "vayan",
    "Meta Title": "Vayan: Nov 30, 2022, GoFlood Studio,Stilk and Full Overview",
    "Meta Description": "Looking for information on Vayan? Check out the release date (Nov 30, 2022), developer insights from GoFlood Studio,Stilk, and a complete game summary.",
    "Alt Text Image": "Official header image for Vayan game - Steam 1936940",
    "Canonical URL": "https://gusku.site/game/vayan",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vayan\", \"description\": \"Looking for information on Vayan? Check out the release date (Nov 30, 2022), developer insights from GoFlood Studio,Stilk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"GoFlood Studio,Stilk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goflood Studio,Stilk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1936940/header.jpg?t=1670157236\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}