{
    "AppID": 2193100,
    "Name": "Videopac Collection 1",
    "Release date": "Nov 24, 2022",
    "About the game": "In the late 1970s the Philips Videopac G7000 video game console brought gaming into the home for millions of households. Known as the Magnavox Odyssey 2 in the US, the Videopac was one of the earliest consoles to use swappable cartridges for its games. Now, relive those days in this remastered emulated collection of 10 fantastic Videopac games. 4 in 1 Row Drop pieces from the top into a grid. First player to place four pieces that connect in a line wins! Play 2-player or against a variety of computer players of varying difficulty. Air-Sea War/Battle Two games in one! In Air-Sea War , duke it out in an exciting duel between a submarine and an aircraft. In Battle , experience 1-on-1 tank warfare on a blasted battlefield. American Football Downs, field goals, quarterback throws, touchdowns - all recreated as faithfully as late-1970s home console technology would allow. Baseball Enter the diamond for a full nine innings, and take home the victory. Play ball! Battlefield Two opposing armies meet in a dense forest. The objective: to capture the enemy general. If you succeed in this task 10 times, the long war will be over. Freedom Fighters Your space-hunter is stationed on a lonely outpost. Your assignment reads: 'Protect our galaxy against the invading enemy. Try and liberate any prisoners the enemy may have taken!' Golf Experience a nice relaxing 9 holes of golf, but be warned: this game requires absolute precision. Killer Bees One of the latest games to be released for the system, take on the role of a swarm of killer bees and destroy the Beelings - invaders from another world. Nightmare Trapped in a haunted house, your only escape is via a hatch in the attic - but barring your path are several ghosts, which you must ultimately outwit in order to survive. Satellite Attack Dodge dangerous asteroids to stay alive. You are armed only with a single laser gun for protection. Watch out - if two asteroids collide they fuse into a more deadly hazard: a magnetic asteroid that will be drawn towards your craft. Be mindful that lethal enemy satellites have also been spotted in the area, that will fire on you without warning. This enhanced collection introduces a number of modern features to these retro classics, including: Saving/loading the game at any point Support for most modern game controllers Full control remapping Image scaling and smoothing options",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2193100/header.jpg?t=1669283719",
    "Price": 4.49,
    "Developers": "Philips P.O.V. Entertainment Group",
    "Publishers": "Pixel Games UK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2193100/ss_0889838e659c777a6b2af87602e0150397d2f061.1920x1080.jpg?t=1669283719,https://cdn.akamai.steamstatic.com/steam/apps/2193100/ss_eb30bba46e3dc80112405213bd45ac30e3f55e0d.1920x1080.jpg?t=1669283719,https://cdn.akamai.steamstatic.com/steam/apps/2193100/ss_ffe71d6c64dfdca795adce5ac3f92418f22680dc.1920x1080.jpg?t=1669283719,https://cdn.akamai.steamstatic.com/steam/apps/2193100/ss_a2a09869397f78f6663b076c2c6490df2ac8c18c.1920x1080.jpg?t=1669283719,https://cdn.akamai.steamstatic.com/steam/apps/2193100/ss_df0f33e3ced5723226c2eab179df9cbdea844e59.1920x1080.jpg?t=1669283719",
    "Slug": "videopac-collection-1",
    "Meta Title": "Videopac Collection 1: Nov 24, 2022, Philips P.O.V. Enter...",
    "Meta Description": "Looking for information on Videopac Collection 1? Check out the release date (Nov 24, 2022), developer insights from Philips P.O.V. Entertainment Group,...",
    "Alt Text Image": "Official header image for Videopac Collection 1 game - Steam 2193100",
    "Canonical URL": "https://gusku.site/game/videopac-collection-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Videopac Collection 1\", \"description\": \"Looking for information on Videopac Collection 1? Check out the release date (Nov 24, 2022), developer insights from Philips P.O.V. Entertainment Group,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Philips P.O.V. Entertainment Group\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Games UK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2193100/header.jpg?t=1669283719\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}