{
    "AppID": 2190500,
    "Name": "VR Painting: Time",
    "Release date": "Nov 8, 2022",
    "About the game": "This is a Virtual Reality experience. It is the first in a series of three 'VR Paintings' painted by me for you to enjoy in full room scale VR with interactive elements and abstract sights to experience. Experiencing this in VR is like being shrunk down and injected inside the fabric of a painting. You no longer look at the painting on the wall but walk through it and explore its hidden corners of wonder! This first VR painting is focused on the theme of 'time' and time in a VR panting can be as amorphous as it is strange. Is time in VR the same as outside VR? Does it stop adhering to our previous understanding of time and require a new approach? These are things to consider as you traverse the VR painting spacetime! When you download this VR experience you will enjoy exploring an abstract VR space with calming sounds and interesting sights! Interactive elements for you to engage with such as physics particles! The intention is that this is a therapeutic experience and that it can be a place to relax, meditate or just explore inside a painting reality! It is the first in a series of three Virtual Reality paintings I have produced for viewers to enjoy in VR exploring the temporal-spatial nature of the VR media within the wider context of contemporary fine art painting. Available to download and experience right now! I hope you enjoy it and I look forward to sharing the next Virtual Reality painting in the series with you soon! This is a room scale experience and includes a teleport system to move your room area around the scene. I chose this as it provides the least chance of causing VR sickness. Please note this is not an app to make your own painting but a pre made painting for you to experience and interact with in VR. 'VR Painting: Time' is a piece of art for you to enjoy! Much like a traditional painting on canvas the only change is that instead of hanging it on your wall you walk through it in VR! Own your very own piece of VR painting art, yours to keep now and forever!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2190500/header.jpg?t=1667926019",
    "Price": 4.99,
    "Developers": "Joshua N Stanton",
    "Publishers": "Joshua N Stanton",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2190500/ss_d517b28c49a31a4673e5940ae19857b269d5cf4d.1920x1080.jpg?t=1667926019,https://cdn.akamai.steamstatic.com/steam/apps/2190500/ss_b6a7acb3513b58b91180af62385765f28405f9c3.1920x1080.jpg?t=1667926019,https://cdn.akamai.steamstatic.com/steam/apps/2190500/ss_43e82777fd27ec76b876c731c63f4a2fd6347289.1920x1080.jpg?t=1667926019,https://cdn.akamai.steamstatic.com/steam/apps/2190500/ss_d4637da68525d5233d5fb6baa0fe7d8ec05f4e00.1920x1080.jpg?t=1667926019,https://cdn.akamai.steamstatic.com/steam/apps/2190500/ss_330edcc60d1de201515a696fcafbaa98285d8e4d.1920x1080.jpg?t=1667926019",
    "Slug": "vr-painting-time",
    "Meta Title": "VR Painting: Time: Nov 8, 2022, Joshua N Stanton and Full...",
    "Meta Description": "Looking for information on VR Painting: Time? Check out the release date (Nov 8, 2022), developer insights from Joshua N Stanton, and a complete game su...",
    "Alt Text Image": "Official header image for VR Painting: Time game - Steam 2190500",
    "Canonical URL": "https://gusku.site/game/vr-painting-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Painting: Time\", \"description\": \"Looking for information on VR Painting: Time? Check out the release date (Nov 8, 2022), developer insights from Joshua N Stanton, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joshua N Stanton\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joshua N Stanton\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2190500/header.jpg?t=1667926019\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}