{
    "AppID": 1876240,
    "Name": "Watashi Suzume",
    "Release date": "Nov 14, 2022",
    "About the game": "Shamrock Creations is proud to present Watashi Suzume. Our little studio's debut project that explores the far reaching impacts that love, friendship, and understanding have on not only our lives, but how we view ourselves and others around us. All wrapped up in a typical anime inspired narrative that we hope everyone who takes the time to play it will enjoy. Story Introducing Ayumi Suzume, a misunderstood high school girl that has been thrown to the side and alienated by her peers for most of her life. Confused, and never understanding why that is, she eventually took her outcast image to heart. Alongside her, her trusty friend Keiko who has been with her since they were little kids. They've always had each other when things got tough. Always taking care of the other when they're not able to do so themselves. Enter the present day... Due to some strange circumstances, Ayumi finds herself in trouble once more. Only this time, she can't rely on her best friend to get her out of it. Instead, she has to rely on the kindness of someone who is a complete stranger to her. Someone with a very special skill that sadly, her best friend since childhood lacks... Together, the two of them must solve the mystery that put Suzume in the position she now finds herself. With her very fate hanging in the balance, will she finally learn to trust those around her? Or, will her initial thoughts prevail? A strange mystery awaits you in the sleepy seaside town of Seishin-Tekina! Features Some backgrounds can be interacted with via a point and click 'Investigation System' that allows players to interact with certain objects during certain points of the story. This allows you to learn more about the plot, characters, and world in a more hand's on approach! Partial voice acting from reputable actors that can be turned on/off depending on your preference! A vast array of playful animations that help breathe life into the game and its world! Three different endings, and two branching paths await depending on your choices! Original art and music created entirely from scratch by a hardworking team of talented artists!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1876240/header.jpg?t=1668431192",
    "Price": 8.99,
    "Developers": "Shamrock Creations LLC.",
    "Publishers": "Shamrock Creations LLC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1876240/ss_ecdaf0073e2e3df2ec2652940cdf701af7269b97.1920x1080.jpg?t=1668431192,https://cdn.akamai.steamstatic.com/steam/apps/1876240/ss_1d1c2edc8d0e4e6f1ff3830146108f39835f9f9d.1920x1080.jpg?t=1668431192,https://cdn.akamai.steamstatic.com/steam/apps/1876240/ss_d10be237a249cf659054224b494a87a01dbb83f9.1920x1080.jpg?t=1668431192,https://cdn.akamai.steamstatic.com/steam/apps/1876240/ss_babb33a975162610d6a0db95aaaee44b819dc533.1920x1080.jpg?t=1668431192,https://cdn.akamai.steamstatic.com/steam/apps/1876240/ss_621c26f2c6c7ec83879deb7a5b785adfc0710f57.1920x1080.jpg?t=1668431192,https://cdn.akamai.steamstatic.com/steam/apps/1876240/ss_570d8821b5269f05c0051f3d7fb31c8e9942bedc.1920x1080.jpg?t=1668431192",
    "Slug": "watashi-suzume",
    "Meta Title": "Watashi Suzume: Nov 14, 2022, Shamrock Creations LLC. and...",
    "Meta Description": "Looking for information on Watashi Suzume? Check out the release date (Nov 14, 2022), developer insights from Shamrock Creations LLC., and a complete ga...",
    "Alt Text Image": "Official header image for Watashi Suzume game - Steam 1876240",
    "Canonical URL": "https://gusku.site/game/watashi-suzume",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Watashi Suzume\", \"description\": \"Looking for information on Watashi Suzume? Check out the release date (Nov 14, 2022), developer insights from Shamrock Creations LLC., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shamrock Creations LLC.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shamrock Creations LLC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1876240/header.jpg?t=1668431192\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}