{
    "AppID": 973230,
    "Name": "We Who Are About To Die",
    "Release date": "Nov 14, 2022",
    "About the game": "IMPORTANT: This game is ACTUALLY different! Get ready to re-learn how to fight. This game features a physics based combat system with directional attacks. It'll take time to master! Don't worry, gladiators exist to be sacrificed. You control your character fully , at all times, based on complex inputs - you will never sit there while an animation plays. This game's combat will take practice: at first you will find it hard to even hit anything properly. To win and master combat you will have to slow down and pay attention, pressing random buttons in a panic will only send your gladiator to an even earlier grave. You will learn how to move, how to use momentum to hit HARD , how to hit targeted weak spots and eventually, you will make up your own moves and fight in your own style. An unforgiving Gladiator Roguelite experience. Take control of a gladiator with a single life , that you lead to an inevitable dea-- I mean, to victory and glory! Fight from the Pits to the Arena into the Stadium, pleasing larger and larger crowds until you finally become a legend of the Grand Stadium. Each run is totally unique! There are many roads to becoming champion. Try different approaches and improvise through the randomisation to survive in the long run. Strategise your way to victory - combat skills alone are not enough! Deal with random events, choose your next matches, please the rich patrons, please the crowds, expand your school, setup your training regime, bribe for information, hire professional help... and much more! Fully modular equipment system! Progress and purchase/loot weapons and armor. Master 8 weapon classes that all play differently. Spend hard earned gold and influence and outfit your character piece-by-piece. Welcome to Terantia: the city of games! Step into over a dozen arenas of different sizes and styles, each with random variations. Fight in group battles or take on tense one-on-one duels that test your skills. How long can you last before your inevitable glorious death? Other features include: Starting backstories with different traits and goals Permanent bonuses for each backstory's victory Dynamic audiences that respond to your actions. Don't just win: entertain! A ranking system with rewards (levelling up) Character skills that grow as you perform the relevant actions And much, much more! Now into the arena, Aspirant! To those who are about to die, I salute you! Jordy",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/973230/header.jpg?t=1668479824",
    "Price": 19.79,
    "Developers": "Jordy Lakiere",
    "Publishers": "Jordy Lakiere",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_3bb1d35e2a364fb5da2dc20f7bda7576c7842911.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_f450baf53fe1f53524923f9825a9c10bad8d9d89.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_6a379b0090a671bd5c3cb98193e362d29da845a0.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_ef8b3786aa8928a716ba6b4d5d2139af3d08f0b3.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_8610bb38aa643ea58dd2db8446893df9dd776058.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_c01b1dc171768c9b83170466c152d1934c5afff3.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_378a3678f7c11557ae22867105e115c75b461e25.1920x1080.jpg?t=1668479824,https://cdn.akamai.steamstatic.com/steam/apps/973230/ss_1317360b58559d31a4846b13f5a381375d6a760b.1920x1080.jpg?t=1668479824",
    "Slug": "we-who-are-about-to-die",
    "Meta Title": "We Who Are About To Die: Nov 14, 2022, Jordy Lakiere and ...",
    "Meta Description": "Looking for information on We Who Are About To Die? Check out the release date (Nov 14, 2022), developer insights from Jordy Lakiere, and a complete gam...",
    "Alt Text Image": "Official header image for We Who Are About To Die game - Steam 973230",
    "Canonical URL": "https://gusku.site/game/we-who-are-about-to-die",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"We Who Are About To Die\", \"description\": \"Looking for information on We Who Are About To Die? Check out the release date (Nov 14, 2022), developer insights from Jordy Lakiere, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jordy Lakiere\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jordy Lakiere\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/973230/header.jpg?t=1668479824\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}