{
    "AppID": 341750,
    "Name": "A.V.",
    "Release date": "Feb 13, 2015",
    "About the game": "A.V. follows the adventure of a sentient music program living in a computer system – a program seeking to learn more about itself and its world. But since our hero was only programmed to understand sound, that’s the only way he can interact with his environment. Each sound you generate can be seen as a pulse of light, and it’s this mechanic that serves as your primary tool for navigating A.V.’s open world. To help you along, a set of musical instrument algorithms allow for different types of interaction with the world, letting you open access to new areas. In the midst of this adventure, though, there’s a catch. The computer you inhabit isn’t all that happy with your newfound sense of self-awareness, and has sent a load of antivirus programs into the system to stop you. Make too much noise, and you’ll draw their attention. Try to stay out of sight well enough to make your escape! A.V.’s presentation is centered around a quirky and engaging sensory experience. The entire world follows a rhythm, and electronic music is coupled with colorful, pulsing lights to place you into a world where sound represents your whole existence. The game’s open-world design encourages you to choose your own path and your own play style – multiple ending sequences await depending on what technique you ultimately choose. So throw on some headphones, join the experience, and dive into the world of A.V. – a world that puts the “rhythm” in “algorithm”. Hmm…that doesn’t really work unless you say it, does it? Key Features: Unique Sensory Experience - 'Sound To Light' mechanics mixed with outlined visual look provides a unique visual and audio experience. - Perfect blend of light and sound. - Winner of RPI GameFest 2014 Best Sensory Experience Award Quirky Yet Riveting Narrative Line Windows, Mac, or Linux Platforms Oculus VR Support Controller Support - Relax on the couch as you explore Large Open Levels to Explore Path Dependent Endings 7 Unique Puzzle Instruments/Tools Steam Cloud Saves &amp; Achievements 8 Types of Anti-Virus drones trying to end your exploration Assemble musical tracks into a master tune",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/341750/header.jpg?t=1581613955",
    "Price": 0.0,
    "Developers": "FirstForever Studios",
    "Publishers": "MAGIC Spell Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/341750/ss_77452fa892c2f56c3080ad8e9e9a0eb3be4173db.1920x1080.jpg?t=1581613955,https://cdn.akamai.steamstatic.com/steam/apps/341750/ss_bbe116efe0d9fe344e2ed33c3e52ccd909ee10ae.1920x1080.jpg?t=1581613955,https://cdn.akamai.steamstatic.com/steam/apps/341750/ss_2879d7f0736b1c542e718cf865fb41df6c04ace8.1920x1080.jpg?t=1581613955,https://cdn.akamai.steamstatic.com/steam/apps/341750/ss_47017b951ccbf80ccf44576c33edb570f1216bb8.1920x1080.jpg?t=1581613955,https://cdn.akamai.steamstatic.com/steam/apps/341750/ss_cc2783ec438dcc847e9d02c93d8c0e530de7e174.1920x1080.jpg?t=1581613955",
    "Slug": "a-v",
    "Meta Title": "A.V.: Feb 13, 2015, FirstForever Studios and Full Overview",
    "Meta Description": "Looking for information on A.V.? Check out the release date (Feb 13, 2015), developer insights from FirstForever Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for A.V. game - Steam 341750",
    "Canonical URL": "https://gusku.site/game/a-v",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A.V.\", \"description\": \"Looking for information on A.V.? Check out the release date (Feb 13, 2015), developer insights from FirstForever Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"FirstForever Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIC Spell Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/341750/header.jpg?t=1581613955\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}