{
    "AppID": 886480,
    "Name": "Audiate",
    "Release date": "Oct 29, 2018",
    "About the game": "Audiate allows you to map any MIDI-capable audio/video production tool to the position, orientation, and buttons on any OpenVR input device. With six assignable inputs per control from position &amp; rotation alone it provides far more control per hand than would be possible with traditional finger-operated faders, knobs, &amp; modwheels. Note : The HMD display is not used, Audiate is intended to be integrated into an existing production tool-chain alongside physical instruments, other control surfaces, &amp; software. It acts as an additional control surface for you to map as you see fit. As with most physical control surfaces it does not output actual musical notes as MIDI or audio streams, instead it focuses on providing hands-on control of live and post-production effects provided by MIDI capable hardware &amp; software. In effect the application operates like a 6-dimensional floating MIDI modwheel. Application Features Map OpenVR input devices to any MIDI software &amp; hardware Load &amp; save patch configurations Pre-configured library patches available in banks Configurable control code number lists Configurable surface size &amp; optional haptics Extremely low CPU/GPU usage, performs no 3D rendering Detailed documentation including tutorials for several popular DAWs Audiate is built on top of VR input hardware as this offers unparalleled accuracy and low-latency tracking on consumer-grade hardware. These requirements are as important to music production as they are to VR. For further details please see the application documentation, this is available in PDF format on the store page. Example Usages Attach a tracker to an arm, leg, foot or head to control a physical instrument or effect while performing Attach a tracker to any instrument, allowing for electric-guitar-like neck shake vibrato effects Recording multiple automation values simultaneously during mastering Control panning for surround-sound media Controlling MIDI-capable stage-lighting Hardware Support Please note that the HMD is not used in this application. Audio production tools generally require significant system resources and are also often vulnerable to undesirable latency issues on busy systems. Audiate is designed to work alongside these tools as an enhancement to an existing tool chain rather than a replacement; as such it tries to keep its own system requirements to an absolute minimum. The following input devices have pre-configured profiles: HTC Vive Controllers HTC Vive Trackers Oculus Rift Support for other devices can be added by editing the application configuration files. Any OpenVR-compatible input device is supported. All tracked controllers provide the following inputs: 3 position analogue axes per controller 3 rotation analogue axes per controller In addition to this, a Vive Controller also provides: 3 button-based analogue axes per controller (trigger &amp; touchpad x/y) 1 digital axis (grip button) Any additional inputs provided by OpenVR devices can be configured to make use of them. Functionality is provided to normalize &amp; smooth values if required. Some trackers also allow for adding custom-built inputs via exposed electrical hookups, advanced users can build and configure entirely custom devices of their own design. The configuration system can also be used to provide inputs bound to button presses. For example a user could set up a series of X, Y, &amp; Z axes that only output when a particular button is held, with the previous value being held until next used. Application Support Audiate can work with any application or hardware that is capable of using MIDI control codes to change parameter values. This includes VST-based musical instruments &amp; effect modules, as well as other usages outside of audio/video production. Hardware modules with MIDI capabilities can be connected in the usual way to the system running Audiate. It is not required that the connected module is capable of customizing it's own mappings, Audiate can be configured to make use of hard-coded ones such as those found in keyboard synths. Support is provided for mapping files (midnam &amp; csv) to aid in the setting up of devices by listing the control name inside Audiate. Value output is typically the absolute value which works in most cases however support is provided for software/hardware that requires relative input, as commonly used by 'infinite knob'-based control surfaces. This mode exists to provide support in DAWs that are known to be difficult in their MIDI connectivity. Full details of the capabilities of this emulation mode are available in the manual.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/886480/header.jpg?t=1583973076",
    "Price": 29.99,
    "Developers": "Fraser K",
    "Publishers": "Fraser K",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/886480/ss_a04c8dddea22f05421b3c08156168b8ec46870f4.1920x1080.jpg?t=1583973076,https://cdn.akamai.steamstatic.com/steam/apps/886480/ss_f226e89f672d0a3653b4a6bcbb5e5391c051c7ad.1920x1080.jpg?t=1583973076,https://cdn.akamai.steamstatic.com/steam/apps/886480/ss_5fe37547b485d9923602d2a2dca2141b51ca6731.1920x1080.jpg?t=1583973076,https://cdn.akamai.steamstatic.com/steam/apps/886480/ss_56fa80adb8b24885d43220986656075a66d10103.1920x1080.jpg?t=1583973076,https://cdn.akamai.steamstatic.com/steam/apps/886480/ss_e746aecf5d3fcbf3d22dbb727cc0c6773b720851.1920x1080.jpg?t=1583973076",
    "Slug": "audiate",
    "Meta Title": "Audiate: Oct 29, 2018, Fraser K and Full Overview",
    "Meta Description": "Looking for information on Audiate? Check out the release date (Oct 29, 2018), developer insights from Fraser K, and a complete game summary.",
    "Alt Text Image": "Official header image for Audiate game - Steam 886480",
    "Canonical URL": "https://gusku.site/game/audiate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Audiate\", \"description\": \"Looking for information on Audiate? Check out the release date (Oct 29, 2018), developer insights from Fraser K, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fraser K\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fraser K\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/886480/header.jpg?t=1583973076\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}