{
    "AppID": 1448230,
    "Name": "Avalom: Ancestral Heroes",
    "Release date": "Sep 13, 2021",
    "About the game": "Thanks to everyone who waited for him and I hope you have a great game! Avalom, even after its release, will go through a process of constant updates based on in-game events to which it will bring new content. As the audience engages, I'll add extra content and of course I'll always be getting better! Developed by a single person and based on an RPG book written by him! Set in a huge open world, Avalom: Ancient Heroes presents a rewarding action combat experience. Players embark on an epic adventure in a rich and alive world with their AI companions. In a world where mortals and gods coexist and live on the same plane of existence! Interpret and be whatever you want in this endless journey where anything can happen! Remember you are free and can live however you want without any linear story to follow, you are the one who tells your own story! * Fascinating narrative driven by your choices - You don't just decide to live freely in the world of Avalom, you make important decisions that change the future. Each choice has its weight, and its actions can lead to several results. Avalom is a highly personalized journey where a false move can lead to a series of events that alter even physical aspects of the world, making you and your allies truly unique. * An Immense World to be Discovered - The world of Avalom has never been so large and so detailed. It is completely open and ready to be explored. Discover the enemy that is ready to act. Reveal hidden caves full of lurking creatures. Avalom is vast and dangerous, but unraveling its secrets can mean the difference between victory and defeat. * Intense and strategic combat - There is no wrong way to play Avalom: Ancestral Heroes, except in which you die. Fortunately, you can build characters with a giant skill tree to build unique characters on. The game has the following features: Creation of Characters with genders, races, paths and professions; A gigantic skill tree on which the player can build different types of characters; Item Creation System based on collecting monster items such as materials, runes and others to create hundreds of special items; Skill system based on dice rolls which requires success in some tasks in the game; Construction of the fort as an operating base for the improvement of allies and others; Multiplayer mode requires you to create an in-game session for others to participate in or simply create a private session for your friends and friends to play together; Reincarnation System (End Game); When the character reaches its peak around 85 points of evolution, it can spend its life and reincarnate again with improvement of all its stats, being able to perform up to 10x this procedure. Difficulty System (End Game); As the character reincarnates the monsters' difficulty system will automatically be assigned, this applies in multiplayer mode to which everyone involved will be linked. Much more information about the game you will only find by playing and discovering unique secrets.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1448230/header.jpg?t=1656015334",
    "Price": 17.99,
    "Developers": "WAGNER ROCHA",
    "Publishers": "INDIE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1448230/ss_469dd024dae487a3b0a1d5ad35bb19484e28b5e8.1920x1080.jpg?t=1656015334,https://cdn.akamai.steamstatic.com/steam/apps/1448230/ss_f44cd077160219d24002b5ecf9b5840cf7c4a179.1920x1080.jpg?t=1656015334,https://cdn.akamai.steamstatic.com/steam/apps/1448230/ss_da6403ffb956793151667f97b6ebf9e1b03ebb25.1920x1080.jpg?t=1656015334,https://cdn.akamai.steamstatic.com/steam/apps/1448230/ss_d810ea5f7f41abcf120fb57da4c5cd782170a988.1920x1080.jpg?t=1656015334,https://cdn.akamai.steamstatic.com/steam/apps/1448230/ss_fa68d2b543a76122829d783db86fd2237728a4e2.1920x1080.jpg?t=1656015334",
    "Slug": "avalom-ancestral-heroes",
    "Meta Title": "Avalom: Ancestral Heroes: Sep 13, 2021, WAGNER ROCHA and ...",
    "Meta Description": "Looking for information on Avalom: Ancestral Heroes? Check out the release date (Sep 13, 2021), developer insights from WAGNER ROCHA, and a complete gam...",
    "Alt Text Image": "Official header image for Avalom: Ancestral Heroes game - Steam 1448230",
    "Canonical URL": "https://gusku.site/game/avalom-ancestral-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Avalom: Ancestral Heroes\", \"description\": \"Looking for information on Avalom: Ancestral Heroes? Check out the release date (Sep 13, 2021), developer insights from WAGNER ROCHA, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"WAGNER ROCHA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"INDIE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1448230/header.jpg?t=1656015334\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}