{
    "AppID": 1232100,
    "Name": "BroodStar",
    "Release date": "Jun 15, 2022",
    "About the game": "BroodStar is a classic arcade shoot’em up with heavy roguelike elements. Careful, though… the vastness of space contains many formidable enemies. If you fall along the way, you have to start over — the only thing you’ll bring with you are the upgrade modules you collected in your past runs, in the form of research points that augment your ship. Will they be enough to get you through hordes of unknown creatures and monstrous bosses, and fulfill your quest of defeating the living planet — the BroodStar? Join us on Discord! Features 12 Procedurally Generated Levels with Random Enemies, Events and Bosses Challenges and Leaderboards 7 Main and 6 Sub Weapon Types 200 Unique Upgrades Research System Seed System Challenging Bosses and Boss Variations Stage Modifiers and Events There are 12 campaign stages, each with its own unique theme and enemy types. Keep an eye out for some secret/optional stages as well! Besides the campaign you can also tackle a few challenge stages with specific setups and separate leaderboards! Stage Modifiers will change the behavior of the enemies and introduce new hazards. Events such as ambushes, mid-stage bosses and more can spawn during each stage, introducing a new objective when triggered and generously rewarding the player when completed. Enemies in BroodStar are a variety of standard SHMUP enemies and some more 'confrontational' ones. There will be quite a few that aren't afraid to get in your face and ruin your day. Enemies that spawn in 'Infected' stages are even tougher than their normal counterparts, so watch out! The Upgrades in BroodStar can vary from simple Stat Upgrades that power up your ship, to more advanced types that can grant you powerful Active Items, Projectile Modifiers or Drone Companions. Most of the Upgrade modules will combine with eachother to create unique combos. There are a ton of combo possibilities so don't be afraid to experiment! The Research System will allow you to further power up your ship before each playthrough. Research points are obtained through picking up Modules of any kind and may be spent on any of the 3 available Research Trees: Offense, Defense and Utility. Each playthrough will have a unique string identifier that determines the generated content. Share this seed with your friends so they can experience the same crazy combos and hardships that you did!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1232100/header.jpg?t=1655301124",
    "Price": 10.99,
    "Developers": "David Schmidthoffer,Mae Livingston",
    "Publishers": "self-published",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1232100/ss_4a76f18025c137fd0567a362f483029f38ba50d2.1920x1080.jpg?t=1655301124,https://cdn.akamai.steamstatic.com/steam/apps/1232100/ss_f818a46a8a66f0721b24034afc7f03c4563c64b9.1920x1080.jpg?t=1655301124,https://cdn.akamai.steamstatic.com/steam/apps/1232100/ss_56b998d784734bab9249c46b667694f871c621c7.1920x1080.jpg?t=1655301124,https://cdn.akamai.steamstatic.com/steam/apps/1232100/ss_4ce5ccf57c56f4dcc3a18bc9c7823e71fde3bdfb.1920x1080.jpg?t=1655301124,https://cdn.akamai.steamstatic.com/steam/apps/1232100/ss_e3b82ffa273b12c60054b55ab12233698abc66cf.1920x1080.jpg?t=1655301124,https://cdn.akamai.steamstatic.com/steam/apps/1232100/ss_b5c8afe67b7672e7daad7c136a5bb3bcfdc879da.1920x1080.jpg?t=1655301124",
    "Slug": "broodstar",
    "Meta Title": "BroodStar: Jun 15, 2022, David Schmidthoffer,Mae Livingst...",
    "Meta Description": "Looking for information on BroodStar? Check out the release date (Jun 15, 2022), developer insights from David Schmidthoffer,Mae Livingston, and a compl...",
    "Alt Text Image": "Official header image for BroodStar game - Steam 1232100",
    "Canonical URL": "https://gusku.site/game/broodstar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BroodStar\", \"description\": \"Looking for information on BroodStar? Check out the release date (Jun 15, 2022), developer insights from David Schmidthoffer,Mae Livingston, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"David Schmidthoffer,Mae Livingston\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"self-published\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1232100/header.jpg?t=1655301124\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}