{
    "AppID": 787740,
    "Name": "Construction Simulator 2 US - Pocket Edition",
    "Release date": "Sep 12, 2018",
    "About the game": "In Construction Simulator 2 US – Pocket Edition , you build your own construction company and take the wheel of 40 original, licensed construction vehicles from the manufacturers Caterpillar, Liebherr, Palfinger, Bell, STILL, ATLAS, Mack Trucks, MEILLER Kipper, and Kenworth. Excavate to your heart's content, control giant cranes, load construction materials, pout concrete, or pave the roads of Westside Plains. Construction Simulator 2 US – Pocket Edition takes you to the USA and offers up road construction and tons of jobs with construction vehicles to match. Expand into new regions, enlarge your fleet, and master more than 60 engaging and challenging construction jobs. THE MOBILE HIT – NOW FOR YOUR PC The mobile hit Construction Simulator 2 is now available for your PC! Use gamepads, controllers, or mouse and keyboard* for the controls, unlock Steam® achievements, and discover the four different districts of Westside Plains in graphics optimized for the PC. EXTENSIVE MOTOR POOL WITH OVER 40 VEHICLES AND MACHINES Original, licensed vehicles and machines from Caterpillar, Liebherr, Palfinger, Bell Equipment, STILL, ATLAS, Mack Trucks, MEILLER Kipper, and Kenworth. Operate CAT's D8T crawler tractor, 430F2 backhoe or 745C dump truck, Palfinger's PK 27002 SH loading crane, Liebherr's 81K tower crane and LTM 1300 mobile crane, ATLAS' L310 wheel loader and Bell Equipment's B45E dump truck, as well as the T880 from Kenworth. MORE THAN 60 DIFFERENT CONSTRUCTION JOBS Explore Westside Plains and master more than 60 engaging and challenging construction jobs, including repairing crumbly roads, rebuilding a railroad bridge, minor gardening work, building new residences and industrial halls, as well as transporting goods and machines, constructing new apartment buildings, mending canals, and much more. YOUR OWN CONSTRUCTION COMPANY Once you have started your own company, you can start exploring new regions in Westside Plains bit by bit, and accept ever-larger and more lucrative construction jobs in the open world of Construction Simulator 2 US – Pocket Edition. INCLUDES ROAD CONSTRUCTION AND RESTORATION For the first time ever in Construction Simulator 2 US – Pocket Edition, you can carry out road construction and repair roads in poor condition. Experience the game from a new angle with purpose-built machines from Caterpillar and enjoy an even more varied day at work on the construction site. *Construction Simulator 2 US – Pocket Edition does not support any joysticks or gaming steering wheels.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/787740/header.jpg?t=1658326443",
    "Price": 11.99,
    "Developers": "weltenbauer. Software Entwicklung GmbH",
    "Publishers": "astragon Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/787740/ss_1ba4516e80340c277adcb7688557d1fdc4fbddcc.1920x1080.jpg?t=1658326443,https://cdn.akamai.steamstatic.com/steam/apps/787740/ss_4e53ac442314582a0a05a3488611d54c235c677a.1920x1080.jpg?t=1658326443,https://cdn.akamai.steamstatic.com/steam/apps/787740/ss_6d515dae3f0f57bb34bd8b1d18a7cff738062d6c.1920x1080.jpg?t=1658326443,https://cdn.akamai.steamstatic.com/steam/apps/787740/ss_754864f23f3496da8dc47436f51e6f50b48aaa76.1920x1080.jpg?t=1658326443,https://cdn.akamai.steamstatic.com/steam/apps/787740/ss_1782b69d498d662d67ac72b439313f5436b666bf.1920x1080.jpg?t=1658326443,https://cdn.akamai.steamstatic.com/steam/apps/787740/ss_4f5c20a5dafade1567968e6008fb418a647926b0.1920x1080.jpg?t=1658326443",
    "Slug": "construction-simulator-2-us-pocket-edition",
    "Meta Title": "Construction Simulator 2 US - Pocket Edition: Sep 12, 201...",
    "Meta Description": "Looking for information on Construction Simulator 2 US - Pocket Edition? Check out the release date (Sep 12, 2018), developer insights from weltenbauer....",
    "Alt Text Image": "Official header image for Construction Simulator 2 US - Pocket Edition game - Steam 787740",
    "Canonical URL": "https://gusku.site/game/construction-simulator-2-us-pocket-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Construction Simulator 2 US - Pocket Edition\", \"description\": \"Looking for information on Construction Simulator 2 US - Pocket Edition? Check out the release date (Sep 12, 2018), developer insights from weltenbauer....\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"weltenbauer. Software Entwicklung GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"astragon Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/787740/header.jpg?t=1658326443\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}