{
    "AppID": 546350,
    "Name": "Craft Keep VR",
    "Release date": "Apr 21, 2017",
    "About the game": "Do you want to craft magnificent blades and brew powerful concoctions for local adventurers? If the answer is yes - and why wouldn't it be? - the position of local trainee Alchemist-blacksmith has just become available, thanks to a staffing grievance from the resident dragon who decided to e͞at̷ o̶u̵r̀ ̧las̕t͟ ̕trainee̸. Please see below for more details on the J̴̨̧͚̳̩̙͉̫̮̲̲̖̖̻̙͚ͅǪ̷͙̦͔̱͡B̵̨̘͕͉̱̻̣̬͔̱̣̰̫͔̀͘ ̶̛͕͉͙͙̦̰̫̬̪̙̭̹̤̖́͟R͡͏͇̜̲̮̫̞̠̘̞̲̻̥̜͎̱̞͚ͅÒ̷̡̲̪̱̬̞̘͓̻͈̹̗͕̼̬͕̣̀͟ͅL̵͖̭͖̦̤͕̠͟ͅE҉̸̛͔̲̥́ As the local blacksmith you'll be trusted by hundreds of adventurers to provide them with powerful and reasonably priced swords. Adventurers will rush to your stall asking you to craft something as simple as an iron PlainGru sword... What, you'd think you'd be ready to craft a frizzy dragonbone JagMar sword? Of course not, you build up to that! The last trainee we took on that attempted to create a frizzy dragonbone JagMar sword now requires a bag to poop in... Yes, to P̨͠͏̵̮̱͇̬͉̯̙͇̦̥̣̻̣͇͞O͍̹͈̲̣͇̕͞͝͝O͏̘̖̗̤̞̺ͅP͏̸̰͈̖̻̣̹̮̲͇̠̭̤!͏͇͕̩̫̱̼̜̯̹̯̲͚̣͈͎̕ͅ The cauldron is a beautiful tool for every alchemist. You can create some pretty potent concoctions with this bad boy. I would know, I spent a good time in my college years creating several cheeky potions as a prank. Good times.... Anyway, With the cauldron you'll need to mix a selection of herbs in order to create useable items like health potions or to charge up enchantment stones. What are enchantment stones? Well, they are stones that have properties to enchant things. It's not rocket science, i mean er witchcraft, well, maybe it is... Anyway! The enchantment stones can be used on swords and daggers to give them brand new properties like fire and ice. Simply etch an engraving on the sword or dagger you wish to enchant (I tend to use a variety of obscenities in various languages) and then rub the enchantment stone across the dagger until it glows. Job done! You'll have a legendary enchanted sword fit for any adventurer. Just be careful where you wave those stones, we will not be responsible for any third degree burns caused by the use of Enchantment stones. More often than not, the local adventurers do not maintain their blades. This leads to an adventurer running to their mommy from even the puniest of beasts with a few dozen bruises. These adventurers need someone to repair their blades so that they may return once more to defeat the foe that made them look foolish and try to claw back any shred of dignity. Repair their blades using the forge, anvil and hammer. Remember, an adventurer with a broken blade is a poor sorry excuse of a man so treat them with kindness and respect... After they leave and pay for your services you have our permission to snigger or chuckle at their shocking negligence of weapon preservation. VIRTUAL REALITY Craft Keep makes use of the Valve HTC Vive’s motion controller capabilities and uses room scale. We’ve been having great fun in the environment and really can’t wait to see players enjoying the game with this tech. Other Titles From Excalibur /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/546350/header.jpg?t=1645008168",
    "Price": 14.99,
    "Developers": "Strange Fire",
    "Publishers": "Excalibur Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_26f44d5b05cb6b6ad2156a85494cc3f2289ce30f.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_54f785012c72ddfb5b2ebf27a591d914db001c8c.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_75853b282d0a535ae3e693bc413e8af6ab88e505.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_371d762ede5561695c0b6161db00415c216145c9.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_f9944bfcd1997d3285dce485b5ad7995b7b0581c.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_9a7267fce677dc08d39e8553b398910d7f39c37e.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_7ef0a956e47234fd1ad17f502e6eb1479001a523.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_690306f010faddd1c1d1aa021ece7c48c6c24ed3.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_71d849e0b652c1bc607409bc84bf9d75eeac9a8e.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_44b9c87fa73c6e117694d886cbecaeeb2a340ff9.1920x1080.jpg?t=1645008168,https://cdn.akamai.steamstatic.com/steam/apps/546350/ss_0374470ea96ed3e121803ff1557858a3dbd17f10.1920x1080.jpg?t=1645008168",
    "Slug": "craft-keep-vr",
    "Meta Title": "Craft Keep VR: Apr 21, 2017, Strange Fire and Full Overview",
    "Meta Description": "Looking for information on Craft Keep VR? Check out the release date (Apr 21, 2017), developer insights from Strange Fire, and a complete game summary.",
    "Alt Text Image": "Official header image for Craft Keep VR game - Steam 546350",
    "Canonical URL": "https://gusku.site/game/craft-keep-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Craft Keep VR\", \"description\": \"Looking for information on Craft Keep VR? Check out the release date (Apr 21, 2017), developer insights from Strange Fire, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strange Fire\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Excalibur Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/546350/header.jpg?t=1645008168\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}