{
    "AppID": 1127860,
    "Name": "CyberLink PowerDirector 18 Ultimate - Video editing, Video editor, making videos",
    "Release date": "Oct 21, 2019",
    "About the game": "Professional Grade Video Editing PowerDirector Ultimate brings creators, and aspiring content producers all the precise professional tools and features, and offers high-end performance capabilities that are needed to take total control of the video production process and workflow, without a steep learning curve. Impressive Motion Graphics &amp; Animated Titles Combine motion graphic elements with your videos’ titles to make them stylish and modern. Shape Designer Apply and edit completely customizable vector shapes to your videos, with auto-fit text and keyframe controls. Perfect for YouTubers and video tutorials. Nested Projects as Adjustable PiP Objects Repurpose previous project files in your new ones. Embed them into scenes with keyframe control to scale, skew, rotate &amp; even set opacity. Audio Scrubbing Hear audio while dragging the playhead through a project so that you can quickly find the scene you need. 360˚ Video Stabilization Shaky video footage is virtually unavoidable when shooting with a 360º camera. Our 360º VR stabilization technology gives you the control to quickly produce mind-blowing VR videos, free of shakes and stutters. Reversible Timeline Track Order Switch timeline track order between top-down and bottom-up to suit your workflow. 4K Video Editing Preview Preview your projects in 4K quality, and see how your video will look like before you produce. Professional Format &amp; Camera Support Import and edit video shot on professional-grade cameras and in HEVC &amp; VP9 10bit HDR10 &amp; HLG, ProRes 10bit 4:2:2, XAVC 8bit 4:2:0 and MXF AVC 8bit 4:2:0 video compatibility. Make Stunning Videos in a few Clicks With Express Projects, you can pick from a huge range of ready-made templates complete with effects, transitions, animations, and music. From there it’s simply a matter of adding your clips to the timeline and clicking 'Produce'! Video Collage Designer to Combine Videos Easily Use Video Collage Designer to create a striking, totally customizable collage complete with animated openings and endings. Use one of our existing templates, or create your own to save and reuse on different projects. Creative Transition Effects 18 new, cool transition effects that will instantly turn your videos from ordinary to spectacular. Align Objects in a Snap Align or “snap” titles, masks and objects to position them perfectly within your frame. Snap to vertical/horizontal axes or other objects. Action Camera Center – The Extreme Video Toolkit Everything you need to edit, correct and enhance your action footage. The essential toolkit for working with action camera footage. 1:1 Square Video for Instagram &amp; Facebook Easily create, edit and produce content perfectly fit for social media. Produce square (1:1) output for Facebook and Instagram. Or edit and save vertical videos, the perfect size ratio for social media Stories. Produce Videos that Look True-to-Life TrueTheater® Color is one-click color correction technology that instantly optimizes hues and vibrancy in your videos for a true-to-life appearance. Don’t just take our word for it though, the results speak for themselves. CPU &amp; GPU Performance Boosts Powered by the 64-bit TrueVelocity engine with support for OpenCL &amp; multi-GPGPU acceleration. Support for non-full frame video clips and improved multi-threading performance.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1127860/header.jpg?t=1573810968",
    "Price": 99.99,
    "Developers": "CyberLink",
    "Publishers": "Deep Silver,CyberLink",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_be4d6d558323ed0d8a89f8d8b23e0a8fa8804538.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_e89d7bc2800290c70a7c28bf76efd5968d63be89.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_3651125a630efab86a504e6ef619cfd1cb1be942.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_16a10556e9a1e08b8f99ef2091f1ca8216ced43c.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_2ce73763c667aefe965d4fab53bc08bcc6d92499.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_eb60a6808f9728ce4ba7a0482e938a4c02b6e54b.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_cbb52c5234951e94531b5bf81881175497f52df2.1920x1080.jpg?t=1573810968,https://cdn.akamai.steamstatic.com/steam/apps/1127860/ss_1f95b32bc9fe50b3d19d6ccfe05409c57ee76a3b.1920x1080.jpg?t=1573810968",
    "Slug": "cyberlink-powerdirector-18-ultimate-video-editing-video-editor-making-videos",
    "Meta Title": "CyberLink PowerDirector 18 Ultimate - Video editing, Vide...",
    "Meta Description": "Looking for information on CyberLink PowerDirector 18 Ultimate - Video editing, Video editor, making videos? Check out the release date (Oct 21, 2019), ...",
    "Alt Text Image": "Official header image for CyberLink PowerDirector 18 Ultimate - Video editing, Video editor, making videos game - Steam 1127860",
    "Canonical URL": "https://gusku.site/game/cyberlink-powerdirector-18-ultimate-video-editing-video-editor-making-videos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink PowerDirector 18 Ultimate - Video editing, Video editor, making videos\", \"description\": \"Looking for information on CyberLink PowerDirector 18 Ultimate - Video editing, Video editor, making videos? Check out the release date (Oct 21, 2019), ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep Silver,CyberLink\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1127860/header.jpg?t=1573810968\", \"offers\": {\"@type\": \"Offer\", \"price\": 99.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}