{
    "AppID": 1691970,
    "Name": "Danganronpa S: Ultimate Summer Camp",
    "Release date": "Jul 20, 2022",
    "About the game": "DANGANRONPA S: ULTIMATE SUMMER CAMP is now on Steam! Summary Danganronpa S: Ultimate Summer Camp is a massively enhanced version of Ultimate Talent Development Plan, the boardgame from Danganronpa V3: Killing Harmony. The stage is set at the tropical resort of Jabberwock Island, and players improve their characters via the 'Development (Boardgame),' 'Battle,' and so on. Danganronpa S: Ultimate Summer Camp is the dream crossover of Danganronpa characters with over 1,000 event scenes, and offers new swimsuit outfits for all characters. Also, players can now collect collab illustrations drawn for merchandise in the Mono Mono Machine! ・Game features Development (Boardgame) The main part of the game in which players will develop their character over 50 days (50 turns) of summer camp on Jabberwock Island. Roll a die to determine how many spaces to move. An event will be triggered depending on which square the character lands on. Each character has various stats, including level. Character stats improve by leveling up, stopping on a Growth Square, or interacting with other characters on Event Squares. Bosses placed by Monokuma and monster battles triggered by Battle Squares will impede the player's path along the way. Talent Squares grant Talent Fragments, which grant characters new skills. Players will also need to acquire weapons and armor at shops and treasure chests as well as utilize cards featuring useful effects to their advantage. Battle A Battle Mode can be played separately from the Battle Squares found in the boardgame. Develop characters and form a party of up to four members and take on the 200-floor Tower of Despair where Monokuma-type monsters await. In the Tower of Despair, enemies attack in waves, and the player is rewarded with Monokuma Medals upon victory. Players need to increase their characters' levels while learning skills and gearing up their characters in order to emerge victorious. School Store In the School Store, players can spend Monokuma Medals and Monocoins they've obtained in battle to gain new characters and support items using the MonoMono Machine. Each character has different rarities, and the higher the rarity, the faster they will grow in Development mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1691970/header.jpg?t=1658367363",
    "Price": 19.99,
    "Developers": "Spike Chunsoft Co., Ltd.",
    "Publishers": "Spike Chunsoft Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1691970/ss_ae034fb0e1627b95ccf63a750f80a16a48e7b8ad.1920x1080.jpg?t=1658367363,https://cdn.akamai.steamstatic.com/steam/apps/1691970/ss_ee4ab3282810c360f6db02550b39cc80f3d23e5e.1920x1080.jpg?t=1658367363,https://cdn.akamai.steamstatic.com/steam/apps/1691970/ss_3979526e934a39649167e89fde812f5474b76405.1920x1080.jpg?t=1658367363,https://cdn.akamai.steamstatic.com/steam/apps/1691970/ss_baef57d49e2875305e03a6812f2ac4b4dee52418.1920x1080.jpg?t=1658367363,https://cdn.akamai.steamstatic.com/steam/apps/1691970/ss_cae650c9c9de1f3bdf81bc70881f9a8397ec3660.1920x1080.jpg?t=1658367363,https://cdn.akamai.steamstatic.com/steam/apps/1691970/ss_94a41f5cf2171425d6519eed041213070589c6a0.1920x1080.jpg?t=1658367363",
    "Slug": "danganronpa-s-ultimate-summer-camp",
    "Meta Title": "Danganronpa S: Ultimate Summer Camp: Jul 20, 2022, Spike ...",
    "Meta Description": "Looking for information on Danganronpa S: Ultimate Summer Camp? Check out the release date (Jul 20, 2022), developer insights from Spike Chunsoft Co., L...",
    "Alt Text Image": "Official header image for Danganronpa S: Ultimate Summer Camp game - Steam 1691970",
    "Canonical URL": "https://gusku.site/game/danganronpa-s-ultimate-summer-camp",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Danganronpa S: Ultimate Summer Camp\", \"description\": \"Looking for information on Danganronpa S: Ultimate Summer Camp? Check out the release date (Jul 20, 2022), developer insights from Spike Chunsoft Co., L...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spike Chunsoft Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spike Chunsoft Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1691970/header.jpg?t=1658367363\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}