{
    "AppID": 671510,
    "Name": "DESOLATE",
    "Release date": "Jan 17, 2019",
    "About the game": "Two years ago Granichny Island became an epicentre of a large-scale disaster of unknown origin. “The New Light” conglomerate covered up this catastrophic event - and now aims to rectify the consequences as much as they can. A massive campaign is underway, during which so-called “Volunteers” - most of whom have never held a weapon in their hands - are sent out onto Granichny. Their mission - to research the paranormal activities of the island, gathering information and undertaking dangerous tasks, all in hope of amending mistakes of the past. None of them are ready for what comes next. Play the role of a Volunteer, and explore a place filled with threats of every shape and size - from monsters and madmen to supernatural anomalies and seemingly impossible weather patterns. Journey through the present of this forsaken world to uncover its secrets. Dark past Explore the enigmatic island filled with abandoned settlements, military bases and top secret facilities. Investigate secrets of the island - find notes and diaries from Granichny’s previous settlers to uncover its mysterious history. Research the threats Battle for your life in open fights against monsters, marauders and soldiers, or use stealth to do critical damage out of the shadows. Research the creatures of Granichny - and gain advantages in battle while you learn more about them. Strength Through Unity Join a 4-player team to have a better chance at surviving the dangers of the island with unique team-based abilities, such as reviving your fallen team members - or act as a lone wolf to prove your mettle. Thrive among the wastes Unlock new abilities and train them to increase your chances of survival. Gather recipes and components to craft, modify and upgrade your weapons and equipment. Customize your Volunteer with new clothing and armor you scavenge throughout your journey on the island. Resist the madness (Or let it consume you) Take care of not only your physical condition, but your mental state as well. The insanity of Granichny will change the world around you, as well as yourself. Survive, explore and investigate the dark world of DESOLATE, alone or with friends in a party of four.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/671510/header.jpg?t=1637926375",
    "Price": 24.99,
    "Developers": "Nearga",
    "Publishers": "HypeTrain Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_fad971172c73d8f723b7783b9119a5953f6f53a2.1920x1080.jpg?t=1637926375,https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_33bdf293746defd61f49ef74238232e1996d8a14.1920x1080.jpg?t=1637926375,https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_eb9e09bdb6dc87e1cbbbea4e6a3031f8b76be3f6.1920x1080.jpg?t=1637926375,https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_d737c8949e60193e54dcbc9606fbcebc08f0a4fa.1920x1080.jpg?t=1637926375,https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_4b2a944e3eb1892a5c0aa7cb3dadf6b87040697a.1920x1080.jpg?t=1637926375,https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_c72c796e987dee96f977aa411990e602ece6108d.1920x1080.jpg?t=1637926375,https://cdn.akamai.steamstatic.com/steam/apps/671510/ss_2b63241901f7aabf20b4ee53143986f9f8b629d5.1920x1080.jpg?t=1637926375",
    "Slug": "desolate",
    "Meta Title": "DESOLATE: Jan 17, 2019, Nearga and Full Overview",
    "Meta Description": "Looking for information on DESOLATE? Check out the release date (Jan 17, 2019), developer insights from Nearga, and a complete game summary.",
    "Alt Text Image": "Official header image for DESOLATE game - Steam 671510",
    "Canonical URL": "https://gusku.site/game/desolate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DESOLATE\", \"description\": \"Looking for information on DESOLATE? Check out the release date (Jan 17, 2019), developer insights from Nearga, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nearga\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HypeTrain Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/671510/header.jpg?t=1637926375\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}