{
    "AppID": 1470020,
    "Name": "Dudes on a Map: Virtual Grid Paper",
    "Release date": "May 6, 2021",
    "About the game": "NOTE: Dudes on a Map's full feature-set is free for the duration of early-access. Game Masters need not purchase the 'Game Master' DLC upon release, but it will be required upon leaving early access. The DLC will however be available as a pay-if-you-want way to support the development of Dudes during early access. Dudes on a Map aims to be the easiest way of taking ANY Tabletop RPG online, and works great for digital mapping at the table as well. With a streamlined set of tools for sharing maps of any kind, along with streamlined automation for managing initiative, a customizable dice systems to support a variety of game systems, and a minimalistic approach to both player and non-player characters in the system. This feature-lite approach to online play may seem barebones when compared to similar systems, however it also affords the Game Master a much more flexible approach to running games, by not locking the game into any specific rules-systems or stat blocks, and letting you simply tell the story you want to tell without investing time and money learning how to work with API's, huge configuration blocks, modding, map triggers, complex lighting and on and on. The feature-lite approach also means that the user interface doesn't need to cram in all those extra features, making it much easier to learn and much easier to find the things you're looking for in the midst of the game. This lighter interface also allows for things like multiple players sharing a device (or the whole party even) , hybrid games where some players are present at the table while others join via the internet, viewing a second screen of the DM's (or one of those sweet tabletop-TV's), or streaming the player window to a mobile device to reveal the map as the players explore. Simple system to turn any digital image into a playable map for any tabletop RPG Flexible design keeps the GM in charge, not the computer. Easy to learn for the GM and the players Players setup takes just a few minutes, no special preparations for digital-play. Paper sheets work just fine here. Digital images can be converted to playable, gridded, maps in minutes once you learn the ropes, including features to match existing grids on your image. Map anything: dungeons, cantinas, countries, continents, planets, star charts, or concept-maps. Support for square grids as well as horizontal and vertical hexagonal grids , or use a simple distance scale, or no scale at all. Targeted automation to keep online games running smooth without overloading the GM Customizable dice system supports numeric and symbol-based dice. Simple initiative system minimizes the time it takes to run combats and supports a number of options for standard and symbolic dice. Works well on low bandwidth connections (but maps may take some time to send). Connect the way you want: self-hosting , LAN, (*experimental) public servers , or single-PC (for mapping at the table) are all supported. Own your data. Nothing stored online, no content limits, no arbitrary player limits, no accounts. No up-selling. No subscription fees planned for public servers (IF they are added, they will be the minimum needed to cover costs) Independently developed, I'm a solo-dev who just wanted to make playing online easier.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1470020/header.jpg?t=1634305311",
    "Price": 0.0,
    "Developers": "Big Sky Software LLC",
    "Publishers": "Big Sky Software LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_dbcb30393f21cc404cf06afc36517caf238214bd.1920x1080.jpg?t=1634305311,https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_696ae9437cc77bf95b112db3459d3dd9b5749bb5.1920x1080.jpg?t=1634305311,https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_c5639917b05826669e0c0def2102d86a42c66944.1920x1080.jpg?t=1634305311,https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_d683cbabdc3a94812604c87dd10500eefe069206.1920x1080.jpg?t=1634305311,https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_72e964cae2da213a6ce7b0269d8d48015e65ac1f.1920x1080.jpg?t=1634305311,https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_7836d4874166b50fcfe828558cb9b454e7d086ac.1920x1080.jpg?t=1634305311,https://cdn.akamai.steamstatic.com/steam/apps/1470020/ss_6c2dca3c9d8a9f18dd24fd678a316fe2df4fcd7b.1920x1080.jpg?t=1634305311",
    "Slug": "dudes-on-a-map-virtual-grid-paper",
    "Meta Title": "Dudes on a Map: Virtual Grid Paper: May 6, 2021, Big Sky ...",
    "Meta Description": "Looking for information on Dudes on a Map: Virtual Grid Paper? Check out the release date (May 6, 2021), developer insights from Big Sky Software LLC, a...",
    "Alt Text Image": "Official header image for Dudes on a Map: Virtual Grid Paper game - Steam 1470020",
    "Canonical URL": "https://gusku.site/game/dudes-on-a-map-virtual-grid-paper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dudes on a Map: Virtual Grid Paper\", \"description\": \"Looking for information on Dudes on a Map: Virtual Grid Paper? Check out the release date (May 6, 2021), developer insights from Big Sky Software LLC, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Big Sky Software LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Big Sky Software LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1470020/header.jpg?t=1634305311\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}