{
    "AppID": 1672930,
    "Name": "梅斯特姆",
    "Release date": "Feb 12, 2022",
    "About the game": "《THE INHERITOR》is a open world turn-based tactics game. In The Inheritor world, you will act as an inheritor of ancient inclined family. You may decide to revitalize family as a qualified inheritor, or put aside your family bonding to experience a variety of lives in this world. There’re multiple professions, skills and technics for you to choose; a lot of characters wait for you to know, to become friends, rivals or enemies; you may also marry someone you love, or just become lover/mistress with them. Until the end of this life, your everything will become your family inheritance to leave to your inheritors. Open world You can get into relation with a variety of characters. Having someone with you, or becoming a sole player to explore the world, is all your choice. Find your own way to revitalize your family. Character Developing There’s no level limitation. All you need to do to develop what you want to be, is to promote and upgrade 5 weapon skills and 20 abilities. Seamless War Chess Battle may happen at any time in map. If you need to make full advantage of your character, find a proper position before get into any battle. Pixel Graphics Actions were made picture by picture to make characters’ actions more vivid and natural. Planned Updates This game is the second independent game we made. First Doujin game,《Neverwinter Town Story》took two years to finish all the contents with monthly updates. So for《THE INHERITOR》, we will still use monthly updates to finish all the game contents. New Quest Lines We plan to complete main quest line, and rich side quest lines in our future updates. Professions We have professions in this game, and plan to add more professions such as merchant, mercenary, lord, and so on. Family System We plan to add family system in future updates, to compete with other families in this world, and who survives last will become the final master. More characters We will add more character graphics, to make NPCs more recognizable and abundant. Social Media 《THE INHERITOR》player chat group in QQ: 942832137",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1672930/header.jpg?t=1644733510",
    "Price": 11.99,
    "Developers": "Pyraminx Soft",
    "Publishers": "Pyraminx Soft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1672930/ss_5d4a4142ab232339392679e4853a4d3814e1ef82.1920x1080.jpg?t=1644733510,https://cdn.akamai.steamstatic.com/steam/apps/1672930/ss_1f9a661f55b39073441b29efbb9edac7d2894227.1920x1080.jpg?t=1644733510,https://cdn.akamai.steamstatic.com/steam/apps/1672930/ss_48b4802a342116a13912538bfc96c2ca3605b09e.1920x1080.jpg?t=1644733510,https://cdn.akamai.steamstatic.com/steam/apps/1672930/ss_58ef6589ea59c7cb683ee293974d3d90e9ca3650.1920x1080.jpg?t=1644733510,https://cdn.akamai.steamstatic.com/steam/apps/1672930/ss_cb04656db32c073828d74534e3e37dc498f518d4.1920x1080.jpg?t=1644733510",
    "Slug": "",
    "Meta Title": "梅斯特姆: Feb 12, 2022, Pyraminx Soft and Full Overview",
    "Meta Description": "Looking for information on 梅斯特姆? Check out the release date (Feb 12, 2022), developer insights from Pyraminx Soft, and a complete game summary.",
    "Alt Text Image": "Official header image for 梅斯特姆 game - Steam 1672930",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6885\\u65af\\u7279\\u59c6\", \"description\": \"Looking for information on \\u6885\\u65af\\u7279\\u59c6? Check out the release date (Feb 12, 2022), developer insights from Pyraminx Soft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pyraminx Soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pyraminx Soft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1672930/header.jpg?t=1644733510\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}