{
    "AppID": 1294760,
    "Name": "HARD BULLET",
    "Release date": "Oct 22, 2020",
    "About the game": "Hard Bullet is a physics sandbox action game that blends gunfights, cinematic effects, brutal melee encounters with insane tools and fun modifiers to create unique violent experience. Deep Interactions: disarm enemies, steal from holsters, kick with elbows, perform one-handed shotgun reloads and more in our innovative physics setup. Enemy Gore Body Damage: Accurate full body IK systems. You can start real gore mayhem with body dismembering, bullet holes and blood fountains. Sandbox: Use ammo workshop, giant generator, welding machine and built your own crazy weapons in this creative mode. Fast-paced Action: inspired by genre-defining classic Hong Kong action movies. Slow Motion and Tricks: control time like in famous PC and console blockbusters — perform slow motion jumps dual wielding and deal overpowered punches with fists. Weapons: Expect dozens of iconic pistols, submachine guns and shotguns, you'll get some sweet rifles and machine guns as well. ▬▬▬▬▬▬▬ G O R E ▬▬▬▬▬▬▬ R A G D O L L S ▬▬▬▬▬▬▬ A I ▬▬▬▬▬▬▬▬ Gore and Dismemberment Compex dismemberment and realistic bullet damage with blood fountains all around — can it be more fun? Oh boy it can. Use different gory instruments like meat grinders, sharp spikes, killer stackers and electricity powers to bring world of pain to this f*****s. They deserve this. Have your own gory ideas? Share them with us through Discussions or Discord . Ragdolls and AI All enemies have several weapons on them to use. They make special attacks if player gets too close. They comment the situation around. AI is not perfect and we work on it every day. Physics fun you can do: Hit with any object you can find. Gun butts are good too. Grab and punch enemies with your fists, throw them into abyss and use as shields . Shoot their limbs off or put into a hydraulic press — gory fun is on us. ▬▬▬▬▬ W E L D I N G ▬▬▬▬▬ S P A W N E R ▬▬▬▬▬ C R E A T I V E ▬▬▬▬▬▬ Creative Sandbox Mode For those who want to make their own brutal experience. Fight dwarves with giant pencils, build physics machines and design torture chambers with deadly machines. Welding Tool Connect any in-game objects into one physics object! You can combine firearms, props and living enemies to make your own grotesk weapons, machines or monsters. Custom Ammo Workshop Use any in-game asset as a bullet! Change its speed, size and rotation ability — charge your weapons with giant knives and swords to start fantastic bloodbath. Enemy Customization Create giant you can climb up, dwarves, immortal zombies or just change their fancy outfits. Spawner Tool You can spawn any object from Arenas, Lobby and Sadbox levels. Unlimited grinders and Drills, dozens of props and enemies can be placed in seconds around you. Location Presets Switchable environments with custom objects: Torture chamber, Climbing set, Shooting Range, Gym and collection of physics objects to play with. ▬▬▬▬▬▬▬▬ G U N S ▬▬▬▬▬▬ B L U N T S ▬▬▬▬▬▬ M O D E S ▬▬▬▬▬▬▬ Pistols, Shotguns, SMGs and Rifles Here is a collection of legendary firearms you can unlock during Early Access . Each gun has its unique sounds, damage and fire modes. 12 Automatic Pistols like Gretta, Sweet17, Greening and more! 16 Submachine Guns — take one in each hand and never stop bursting! 8 mighty Shotguns to shred enemies apart: Moss500 or Ram870? Why choose if you can take both? 5 Rifles. Ivan47 or Mark16 — the best of east and west for you. Notice that these guns do not copy the exact design of real prototypes, but we tried to stick to reality as close as we could. You can check the full list of guns and their real world inspirers here in Discussions . Bladed and Blunt handy weapons Different weapons — from tactical karambit and shovel to ancient chineese swords and spears — are here and waiting for you. Don't foget some old rusty pipes and pitchforks! Also, you can use any game object to fight enemies! Be creative! Two Gunplay modes: Arcade and Tactical We've prepared two different gun modes so you can feel as a powerful action movie hero as well as a tactical modern fighter: Tactical Mode brings everything you like in realistic shooters: hand reloads , cool mag-hits-mag tricks, slow-mo gunswaps and all the stunts you'll come up with. Use both hands to hold handguard weapons to reduce recoil, be fast and sharp to get out alive. Arcade Mode is the one we wanted to bring to VR. Your guns do autoreloads when you bring them closer to your waist, so both your hands can have one. Make crazy dual wielding jumps, use two shotguns at a time or show your gun-fu skills with dual wielded pistols. ▬▬▬▬▬▬▬▬▬▬ T O ▬▬▬▬▬▬▬ B E ▬▬▬▬▬▬▬ T O L D ▬▬▬▬▬▬▬▬▬▬",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1294760/header.jpg?t=1656172191",
    "Price": 19.99,
    "Developers": "GexagonVR",
    "Publishers": "GexagonVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_ddc418abd7eee1717dd92457f33b89320726cf2a.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_711e1387902f6a2120a6d604390ad59b01692135.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_a6f21c298f1ebdebf0f3eac546de393748e6f4f5.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_ee74f07a4f2b1e52ba3094b1874238dfcc38d163.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_5b412232a3743c40539fa993f624e6b54996c564.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_ba8ecf75f25e97745142b34d017ce4a8e4de830e.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_5174bf5148e5bc00df949d44bf878896158eaa79.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_a497f506700f538b36a8b30041db22b91303c8ad.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_c520acf4b1f7d0b225592c771d6788756b961b85.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_c6ce796f608431412303379e0b79b9dc3b2dd84d.1920x1080.jpg?t=1656172191,https://cdn.akamai.steamstatic.com/steam/apps/1294760/ss_b9d7e7fac28dec91be64f4aaea4e7c5b864e33cf.1920x1080.jpg?t=1656172191",
    "Slug": "hard-bullet",
    "Meta Title": "HARD BULLET: Oct 22, 2020, GexagonVR and Full Overview",
    "Meta Description": "Looking for information on HARD BULLET? Check out the release date (Oct 22, 2020), developer insights from GexagonVR, and a complete game summary.",
    "Alt Text Image": "Official header image for HARD BULLET game - Steam 1294760",
    "Canonical URL": "https://gusku.site/game/hard-bullet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HARD BULLET\", \"description\": \"Looking for information on HARD BULLET? Check out the release date (Oct 22, 2020), developer insights from GexagonVR, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"GexagonVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GexagonVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1294760/header.jpg?t=1656172191\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}