{
    "AppID": 1253520,
    "Name": "Heidelberg 1693",
    "Release date": "May 21, 2021",
    "About the game": "Carve a bloody path… ...through hordes of monsters and the undead in the ravaged city of 17th century Heidelberg. Manually reload your musket after every shot as you bring battle to the doorstep of hell and overcome these trials using what limited resources you can scavenge on the battlefield. Face the unknown… …and fight a vast number of hand-crafted and -animated enemies in over 20 lovingly detailed levels. Confront deadly bosses inspired by real historical figures as seen through the distorted lens of a nightmarish world where black magic and dark science rule supreme. Challenge the Moon King and send him back into the pits! Features Classic 2D Action: No backtracking, no inventory. Only pure, traditional action platforming gameplay. Tactical Combat: Rely on a powerful, single-shot musket that must be reloaded after every round and a swift rapier to conserve ammunition in visceral melee skirmishes. Face the unyielding hordes of the undead, rendered in beautifully animated sprites! Explore around 20 breathtaking stages with different routes. Visit authentic places and meet historical characters of the time. Animated cutscenes - inspired by the silent era of film - bring the darkest chapter of Heidelberg to life. Story The year is 1693: War engulfs Europe as France, led by the illustrious Louis XIV, battles the Grand Alliance. Also called the Sun King for his luxurious tastes and extravagant appearances, he is driven by the belief that the sun – his sun – should shine upon all peoples of the world. His enemies are as numerous as the stars but it is the moon that reigns the night. Poisoned and left for dead, Louis’s bastard son emerges from the smoke and ashes of Germany’s battlefields under the guise of the Moon King. With hatred festering in his heart, he has employed the aid of diabolical and forbidden sciences to build an army the likes of which the world had not seen since the days of Lucifer’s rebellion. Now the dead rise from their mass graves, seeking vengeance upon the king that demanded their deaths while he basked in glory. Can you, the Sun King’s bravest musketeer, stop the approaching eclipse before it swallows the sun? Rules Timing your actions is critical to success in this game, as a correctly timed jump or attack can be the difference between glorious victory and shameful defeat. Furthermore, studying and understanding your enemies will be of utter importance. Only by getting to know your demons can you hope to find their weaknesses – and exploit them. For instance, many foes can hurt not just you but also each other. Goading them into slaughtering their own is often vital to success. Lastly, a word of warning: The Moon King's army is not composed of conventional soldiers. These are the living dead, and simply killing them once is not enough to guarantee their surrender. There is only one antidote against the cancer of undeath: gunpowder and shot. Landing the killing blow with your musket will tear apart the body and make further resurrection impossible. Keep in mind that you can also shoot corpses before they revive. About Development on the game began in January, 2018. The feature we worked the longest on is the musket. There was hardly a precedent from other games for a similar mechanic, so we could not simply take an existing mechanic and put our own spin on it. Instead it was necessary to dive into and really understand the 17th century in order to transform the historical rules of early gunpowder weapons into a viable gameplay mechanic for a 2D action platformer. We spent a lot of time visiting museums and poring over books in order to make the game as authentic as we could. After we had a foundation that is accurate, we set free our creativity and created a typical 'Andrade Game' that is always an interplay between history and morbid phantasy. Die, have fun, die again!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1253520/header.jpg?t=1621931489",
    "Price": 14.99,
    "Developers": "Andrade Games",
    "Publishers": "Andrade Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1253520/ss_bd84f776581231c717b9aba44a53d4819ed20a88.1920x1080.jpg?t=1621931489,https://cdn.akamai.steamstatic.com/steam/apps/1253520/ss_43c714fce8f23ea38fb5fec6866092015bed24be.1920x1080.jpg?t=1621931489,https://cdn.akamai.steamstatic.com/steam/apps/1253520/ss_7ce96c209f8d7dd453b165301da3bcca70bb2f15.1920x1080.jpg?t=1621931489,https://cdn.akamai.steamstatic.com/steam/apps/1253520/ss_20f30b47bef86c0823ed59d2df3ea77291d2b903.1920x1080.jpg?t=1621931489,https://cdn.akamai.steamstatic.com/steam/apps/1253520/ss_a4a31c0c506bcb1e3fff6c1cdb59c41aae1d5beb.1920x1080.jpg?t=1621931489,https://cdn.akamai.steamstatic.com/steam/apps/1253520/ss_da00a291bf91fdd9d19a30debdff1684972d9c75.1920x1080.jpg?t=1621931489",
    "Slug": "heidelberg-1693",
    "Meta Title": "Heidelberg 1693: May 21, 2021, Andrade Games and Full Ove...",
    "Meta Description": "Looking for information on Heidelberg 1693? Check out the release date (May 21, 2021), developer insights from Andrade Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Heidelberg 1693 game - Steam 1253520",
    "Canonical URL": "https://gusku.site/game/heidelberg-1693",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heidelberg 1693\", \"description\": \"Looking for information on Heidelberg 1693? Check out the release date (May 21, 2021), developer insights from Andrade Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Andrade Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Andrade Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1253520/header.jpg?t=1621931489\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}