{
    "AppID": 1851330,
    "Name": "Heroes Of The Dark",
    "Release date": "Apr 6, 2022",
    "About the game": "Vampire, Werewolf, and Human: In this age of darkness, these three factions wage a bloody war for dominance and survival. Choose the faction that you want to embrace and battle. Heroes of the Dark (HotD) is an online RPG game set in a grim Victorian world full of lands to explore, mysteries to uncover, and monsters to vanquish and combat. But to do this, you must recruit and train heroes of darkness from each faction. For only one who can master their combined magic and might in 5v5 battle can prevent the darkest of fates from befalling the land of Tenebris to combat. Customise Your Mansion and Adventure You will begin your strategy RPG adventure from within a gothic mansion, filled with dark magic waiting to be unlocked. As your power grows, you can expand your mansion to allow more heroes of darkness to unite from the Human, Werewolf and Vampire factions. But you must also upgrade its defences to ward off invaders as you launch campaigns of conquest far and wide, while making your troops survive in combat. Strategic 5v5 Battle for Survival It is not enough to simply amass great heroes to your side; you need to combat for survival! HotD offers a deep level of strategy as you form teams for fast-paced 5v5 battle, utilizing dozens of unique Werewolf, Human, and Vampire heroes. Discover synergies between your heroes of darkness and their classes to outwit enemies and unleash unspeakable magic and devastation! A Living Online RPG Game The action never stops in HotD! Because this is a real-time online game, your might grows and the world evolves even as you sleep. You can send heroes to explore a dungeon now, and check back later to see what treasures they’ve found. And be sure to watch your allies’ backs to fend off unexpected attacks. Friends &amp; Allies to combat with Heroes As you forge mighty alliances and strategies with other HotD players, you can wage all-out alliance wars, vanquish your rivals in 5v5 battle, and rise to legendary renown. By working together, you can even claim whole regions, capture magic Crystals, and ultimately assault the Heart of Tenebris, the key to total domination of this RPG online game. A Tale of Bloody War &amp; Forbidden Magic When the moon shattered, its shards rained upon the world, granting the Werewolves untold strength. So the Vampires fled to Tenebris, bending it to their self-righteous will. But the Humans they rule have forged great technology in hopes of overthrowing their masters, just as the Werewolves have tracked the Vampires to this new land… Despite this, all three will need to unite to stop an even greater threat, as an arcane weapon threatens to decimate all of the living and undead in the world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1851330/header.jpg?t=1649287253",
    "Price": 0.0,
    "Developers": "Gameloft",
    "Publishers": "Gameloft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_3984b86ca7d5cf93be5fc88e451835f88657b036.1920x1080.jpg?t=1649287253,https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_7eace6ce2123572420fa534a81ead7c8671461c6.1920x1080.jpg?t=1649287253,https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_9a84d2ef58ba92caeeabf2ca0691701a9b250b9f.1920x1080.jpg?t=1649287253,https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_e72f35f284518e8809da371f37c03e3578f349ec.1920x1080.jpg?t=1649287253,https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_991e43bab8a48ffdec64e00ddb8be39290acb5ab.1920x1080.jpg?t=1649287253,https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_a735f138037b48468f27fefe7da3da4b057a4df9.1920x1080.jpg?t=1649287253,https://cdn.akamai.steamstatic.com/steam/apps/1851330/ss_3b7842a71ad30445a1f09dddaba29a6e732db002.1920x1080.jpg?t=1649287253",
    "Slug": "heroes-of-the-dark",
    "Meta Title": "Heroes Of The Dark: Apr 6, 2022, Gameloft and Full Overview",
    "Meta Description": "Looking for information on Heroes Of The Dark? Check out the release date (Apr 6, 2022), developer insights from Gameloft, and a complete game summary.",
    "Alt Text Image": "Official header image for Heroes Of The Dark game - Steam 1851330",
    "Canonical URL": "https://gusku.site/game/heroes-of-the-dark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heroes Of The Dark\", \"description\": \"Looking for information on Heroes Of The Dark? Check out the release date (Apr 6, 2022), developer insights from Gameloft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gameloft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gameloft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1851330/header.jpg?t=1649287253\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}