{
    "AppID": 1976800,
    "Name": "不可能犯罪事件簿-Impossible Crime Book",
    "Release date": "May 16, 2022",
    "About the game": "One accident, two suicides. Despite the many doubts, due to the lack of clues, these cases can only be resolved on the surface of 'suicide', 'accident'. Behind the scenes murderer is carrying what kind of purpose to promote the progress of a case after all, who will be the next victim. You and your partner were assigned to investigate the case, and you entered the school disguised as a teacher and a student. Under the test of life and death, you must use the fastest speed to search for clues, solve the murder, restore the truth of the event. Whether it can fulfill its mission to uncover the truth behind this improbable series of crimes. If we can turn the tide and save more innocent lives. Your choice will determine everything. GamePlay You will act a hot-blooded policewoman who just graduated from the police school, is ordered to sneak into the school together with your partner to investigate, through the dialogue of students and teachers related to the case, unannounced visit and other means to collect case clues, seek the truth of the matter in the clues. Read every paragraph carefully and pay attention to the details of the game, because every choice you make affects the story. The operation mode is simple and easy to use. The main test players logical reasoning ability, according to your reasoning, detect the truth behind the murder! Features Brain-burning criminal investigation themes As a brain-burning puzzle game, here's a near-perfect crime to solve. In the game, players need to rush around in a variety of different criminal cases, constantly collecting clues and seeking the truth of the matter in the clues. Exquisite game production Unique painting style, different characters. The dialogue can be chosen according to the character's personality to determine the direction of the story and the fate of the character. A riveting plot How exactly did the murderer do it? The priority is to identify the next possible victim. Save innocent lives through unique interactive clues and find the real killer in a fake suicide. Huge branch line This work rich plot, many branch lines. The difficulty of the game will change as the case is updated, creating a unique feeling of reading!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1976800/header.jpg?t=1652753902",
    "Price": 9.99,
    "Developers": "橙光游戏",
    "Publishers": "橙光游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1976800/ss_f81d68420121c75fbc548f9de9858598e17b72c0.1920x1080.jpg?t=1652753902,https://cdn.akamai.steamstatic.com/steam/apps/1976800/ss_74fd7a34b85b6f81d697d002fe686b9575abad51.1920x1080.jpg?t=1652753902,https://cdn.akamai.steamstatic.com/steam/apps/1976800/ss_bc7d8868bd76932f1413d524be30a62b4a3beef1.1920x1080.jpg?t=1652753902,https://cdn.akamai.steamstatic.com/steam/apps/1976800/ss_7cd2988aa32ce44f912f390f737d870a710e7d58.1920x1080.jpg?t=1652753902,https://cdn.akamai.steamstatic.com/steam/apps/1976800/ss_474826473304a9a93c0a132f3cd8bde321cf8d27.1920x1080.jpg?t=1652753902",
    "Slug": "impossible-crime-book",
    "Meta Title": "不可能犯罪事件簿-Impossible Crime Book: May 16, 2022, 橙光游戏 and Fu...",
    "Meta Description": "Looking for information on 不可能犯罪事件簿-Impossible Crime Book? Check out the release date (May 16, 2022), developer insights from 橙光游戏, and a complete game ...",
    "Alt Text Image": "Official header image for 不可能犯罪事件簿-Impossible Crime Book game - Steam 1976800",
    "Canonical URL": "https://gusku.site/game/impossible-crime-book",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4e0d\\u53ef\\u80fd\\u72af\\u7f6a\\u4e8b\\u4ef6\\u7c3f-Impossible Crime Book\", \"description\": \"Looking for information on \\u4e0d\\u53ef\\u80fd\\u72af\\u7f6a\\u4e8b\\u4ef6\\u7c3f-Impossible Crime Book? Check out the release date (May 16, 2022), developer insights from \\u6a59\\u5149\\u6e38\\u620f, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1976800/header.jpg?t=1652753902\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}