{
    "AppID": 1704490,
    "Name": "Inferno",
    "Release date": "Apr 29, 2022",
    "About the game": "Inferno is a simple but atmospheric puzzle game where you follow the journey of Dante Alighieri through the Nine Circles of Hell. The game is an adaptation of his epic poem Inferno written over 700 years ago, and between levels it includes many memorable quotes from the poem together with colorized artwork. Features Over 100 unique puzzles Nine levels of hell, each with its own athmosphere, lighting, music, and puzzle themes Follow Dante's original poem between levels and use the built in dictionary to look up words and the characters Dante meets. If you've never read Inferno , this game gives you an introduction Fifty classical paintings and engravings by Gustave Doré and others, colorized for this game Achievements on steam Midway upon the journey of our life I found myself within a forest dark, For the straightforward pathway had been lost Can You Make It Through All Nine Circles? Circles of Hell The forest Just like the poem, the game starts with Dante being lost in a dark forest. In this tutorial section you learn the controls and the physics of the game world. Gameplay here is centered around Sokoban-style box-pushing mechanics and ladders. The forest is brighter than most of the game, and the music is relaxing but somber. Dante meets Virgil who promises to guide him, and together they pass through the gates of Hell. Vestibule of Hell Before Dante and Virgil can enter Hell proper they pass through the Vestibule. Here you learn more about how gravity works, and how you can carry boxes on top of your head. The vestibule lies underground, but there are still trees, dirt, and some light from outside. Dante and Virgil meet Charon who takes them across the first river of Hell and to the first circle. The first Circle - Limbo According to Dante, Limbo is inhabited by the souls who in life picked neither the side of good nor evil, as well as the unbaptized and people who lived before christianity. This first circle of hell also has trees and fresh green meadows - here Dante and Virgil talks to old Greek and Roman philosophers. The music is mysterious and slow, and the lights area greenish. Gameplay is about manipulating blocks that have ladders attached. The Circle of Lust This circle contains the souls of the lustful who 'reason subjugated to appetite'. Here Dante and Virgil meet Cleopatra, Tristan, Helen of Troy, and they listen to Francescas tragic love story. These souls of this circle are forever thrown around in an infernal hurricane. The circle has a blueish purple theme, with rainstorms and violent winds. The gameplay in the circle of lust is about locks and keys. The Circle of Gluttony The circle of Gluttony goes in brown and yellow, it is full of dirt, mud, rain and hail, with the music having a medieval vibe. The gluttons lie in the mud turning themselves around, their punishment for a life of excess. In this section Dante can first interact with the inhabitants of hell - pushing a glutton makes him continue moving in the same direction until he hits a wall. The Circle of Greed Here lives the avaricious and the spendthrifts - like Sisyphous they push huge bags of money around. This circle introduces 'walkers' - souls that move in according to a simple patrolling movement pattern that the player can manipulate. The Circle goes in colors of green and gold and the music is relaxing but eerie. The Circle of Wrath In this section Dante and Virgil have to cross the swampy river Styx. Below the surface lies the wrathful, forever gurgling their throats. This section is very dark, and the music is creepy and oppressive. The gameplay is centered around manipulating lightsources - Dante has to carry them around, and combine lights of different colorsto break light-sensitive blocks. The Circle of Heresy Dante and Virgil pass through the City walls of Dis - the city of Hell - and enter the circle of Heresy. Heretics are those that rejected Christianity, here reside Greeks like Epicurus, and Anastasius II the heretical Pope. The heretics are standing in flaming tombs, forever being burned for their sin. The circle of Heresy has black walls, ramparts, and towers. The music is dark and mysterious, but gentle compared to the last circle. The circle of heresy has many classical puzzles implemented in the game engine - a sliding square puzzle, the towers of Hanoi, a tetris-puzzle and much more. The Circle of Violence According to Dante there are three types of violence: against your neighbour, agains yourself, and against God. This circle is divided accordingly. The first round contains Pflegethon, the river of boiling blood. Beyond lies a dark forest where people are turned into trees, and the last round is a desert with raining fire. The mechanic in this Circle is cooperative play - Virgil will help Dante and you can switch between the characters to solve puzzles together. The Circle of Fraud Dante and Virgil enter 'Malebolge', the evil ditches of the Circle of Fraud. Here different types of fraudsters are punished in creative ways, each according to his crime. This circle is fiery red with a very intense soundtrack. The mechanic is based around a type of sand-block that breaks on touch. The Well of Giants Between the circles of fraud and treachery lies the Well of Giants. Here three Giants are forever chained for their rebellion against God. In this short section Dante and Virgil has to climb and manipulate the Giants to solve puzzles. The well is stone-colored with turquoise lighting and water running down the walls. The Circle of Treachery This deepest circle of hell is covered in ice, with cold winds blowing from inside. Here traitors are frozen solid inside the ice, their tears forever freezing on their faces. The music has a slower and mysterious vibe. This circle combines all the mechanics from the previous circles - many puzzles are based on breakable ice-blocks together with walkers, allowing you to carve out paths for the walkers and construct a type of mechanical circuits. The circle of treachery ends with a showdown in the centre of Hell and an epilogue.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1704490/header.jpg?t=1651246420",
    "Price": 6.99,
    "Developers": "Blue Vertex",
    "Publishers": "Blue Vertex",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_ffb207341b89ec23da2bd5352467707a241a9a33.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_53fd8fe21c2845dec07ce20fbf7e8441bc668806.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_cad43038c57a4a7c5ae5029c2ce424f0c2a332b7.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_d7cd632f509f4347b7290e8aef6eea6a4dc6e3c6.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_31d950b9d45610d95e794cdc207cb4575881b838.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_d442b889be9df76bc45310c38ff330a01b8d0089.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_dcaf8f8ef97753687317165463e5c0f207d7e138.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_1c00a08ea621215507d77ed0121fdb858309fa06.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_b5c08258f91c54dbf209d5317ab95b969ce60030.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_be191008312d7597010f4e7243f8f75ec79de440.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_9272b93a93d1c6ca4a365854833ee69135adfaa7.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_260221e55dcffe8a9261a2fbdc14b48013ef3b70.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_afce1a35443e6e8448574b892a136ba48c677bc1.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_9e09c306d1e8cb89999ab12ec821f593ead77f1b.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_66acaf37fd5c227ac715161df3a5c038c7b24b38.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_3193bd42df0502355b01e7c565cd497007dded65.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_a1176c0a8d0a7a646236f9cb0e1865f489f7a7de.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_dfc4c08fd623f4bdf8c1cac7d423317d0f4afc2f.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_f714e02639f2a47a722dbe7427df1b6032c2883e.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_73fadf811cc9baad0ffa1463f37959b6369bb09c.1920x1080.jpg?t=1651246420,https://cdn.akamai.steamstatic.com/steam/apps/1704490/ss_127b6e08d776f39e8cd245f85af0389ea178b36f.1920x1080.jpg?t=1651246420",
    "Slug": "inferno",
    "Meta Title": "Inferno: Apr 29, 2022, Blue Vertex and Full Overview",
    "Meta Description": "Looking for information on Inferno? Check out the release date (Apr 29, 2022), developer insights from Blue Vertex, and a complete game summary.",
    "Alt Text Image": "Official header image for Inferno game - Steam 1704490",
    "Canonical URL": "https://gusku.site/game/inferno",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Inferno\", \"description\": \"Looking for information on Inferno? Check out the release date (Apr 29, 2022), developer insights from Blue Vertex, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Vertex\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Vertex\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1704490/header.jpg?t=1651246420\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}