{
    "AppID": 618990,
    "Name": "Into Oblivion",
    "Release date": "Jul 30, 2018",
    "About the game": "Into Oblivion is a drinking contest of ridiculous proportion. Each player is dealt five item cards perround and attempts to make one of many mixed drinks for themselves or their opponents. Some drinks have additional status effects, some will make you puke instantly, while others just leave a funny taste in your mouth. Mix, swap, and serve drinks to chip away at, or boost, each other's precious health, liver, and drunkenness to win. In this game, it is all about how you drink. Into Oblivion features three main modes: normal, Top Shelf, and The Sobering. Half-way through all modes, there is a half-time, dice rolling mini-game called Midnight. Keeping at least one die per round, you will try to score a 1 and 4 then all other dice are your points. You'll net a fancy trophy and bonus points for your final score by winning. In normal mode, you will compete to get the highest drunk score you can without going overboard. Of course you can always tank your opponent's liver to double the amount of drunk points they accumulate per drink, pushing them over the limit. Or you can reduce their health to zero and end the match fast. Use your accumulated drinks list, various status effects, or brutal mixology to win. If there is a tie, don't worry; everything is scored during a match so the points will decide in the end. In Top Shelf, you can only use special mixed drinks. Generic sludge drinks won't have any affect but will, however, count towards your end score. Learn new drinks on the fly or buy the Bartender's Book from the Shady Merchant to get the upper-hand. Utilize status effects to your advantage and slang one of 209 drinks to win. Beyond that, same rules apply as in normal mode: higher drunk score the better, reduce health to zero, or score decides the winner. In The Sobering, you are trying to keep your wits about you and your drunk score to a minimum. Ideally zero, or at least lower than your opponent. Keep an eye on your liver though, if it hits zero then you start taking double the drunk points per drink. Just like the previous two modes, knocking out the health score can instantly win the match and the score breaks all ties. The game has the following features best laid out in list format with snappy phrases like: Face off against eight different characters in single-player mode Various outfits, hair styles, and accessories Soundtrack by Macabre Gandhi and David Totten Personal and global statistics on debauchery Our favorite half-time mini-game Midnight Steamworks multiplayer with invites A leaderboard system of true alcoholics 55 item cards to mix, match, and drink 215 mixed drink recipes 30 temporary buffs to save your hide or sabotage you Drink in various locations around Starkham Bet against friends and foes to acquire coins Upgrade and unlock gear at the Shady Merchant's shop 40 achievements to obtain Halloween, X-Mas, St. Patrick's Day, and Easter Event modes Two free content expansions coming soon-ish The game features online and LAN cross-platform multiplayer for Linux, Mac, and Windows so you can drink your buddies under the table no matter what operating system they use. Steamworks is now integrated so you can invite folks to your lobby through Steam or just browse for an open game. Can't find a game? Don't like multiplayer? Face off against eight different 'special' bots or a series of randomly generated generic ones in single-player. Similar to the 'Street Loyalty' features of our last game, The Dope Game, there are some small bonuses for players of our other games. Mostly of the cosmetic variety. Each game played unlocks a different skin set to mix and match with the ones you have already. If you haven't played any of our previous games, fear not, you'll only have to spend a little of your hard-earn, in-game coin to get them at the Shady Merchant's shop.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/618990/header.jpg?t=1654702632",
    "Price": 4.99,
    "Developers": "Gramps Games",
    "Publishers": "CoaguCo Industries",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_517e371e3436cd659a87c45c023c93b4f6aa02ad.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_3c3f206036a6a50e4f14ecdff27bd614339c16ff.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_402271a45a3709ee78fe609ed78a147f001f4b50.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_cb454653094ab26ce558f18800e1fe512e90b8da.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_ef9dc59b45be69c8f75a75fb9bb71e996f1a602b.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_93331e00eb26d93401442ddd67b7dde898613209.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_49c3ff8859635fa1639d5b92dd98f0a173596e8d.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_17e5c0ce17c5e6ae02fef2aeadcc52503f70229f.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_70db46e6d9252c63e6bb4c72d59092ef94d5b09c.1920x1080.jpg?t=1654702632,https://cdn.akamai.steamstatic.com/steam/apps/618990/ss_74be20d28a67c3cb3812f6e441e7cc027c57d1a2.1920x1080.jpg?t=1654702632",
    "Slug": "into-oblivion",
    "Meta Title": "Into Oblivion: Jul 30, 2018, Gramps Games and Full Overview",
    "Meta Description": "Looking for information on Into Oblivion? Check out the release date (Jul 30, 2018), developer insights from Gramps Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Into Oblivion game - Steam 618990",
    "Canonical URL": "https://gusku.site/game/into-oblivion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Into Oblivion\", \"description\": \"Looking for information on Into Oblivion? Check out the release date (Jul 30, 2018), developer insights from Gramps Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gramps Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CoaguCo Industries\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/618990/header.jpg?t=1654702632\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}