{
    "AppID": 1595300,
    "Name": "Kells",
    "Release date": "Jun 1, 2021",
    "About the game": "Try the Free Demo Today! Kells is a retro puzzle game similar to the original Lemmings except instead of issuing specific commands to your Kells, you manipulate their movement using special Gravity Tiles instead. These tiles change the direction of gravity as Kells walk or fall over them, allowing you to manipulate your Kells in crazy ways like making them “fall upwards” to clear obstacles, “fall forward” to avoid dangerous spike pits, and even walk up or down walls! Objective The objective seems deceptively simple! All you have to do in each level is figure out how to get your Kells from the entrance to the exit flag. The thing is, you can't control them directly and unlike in Lemmings, you can't issue them commands either. What you can do is place tiles around the level to change the flow of gravity! Can you figure out how to make use of careful Gravity Tile placement to guide your Kells on a journey through 100 levels and 8 themed islands to find the mysterious Last Level? The Kellective As you progress through the game, you'll find many lost Kells on your journey to build up The Kellective and make it stronger and stronger. You will care for your Kells - you can rest them when they are injured, check in on them between levels to see how they are feeling and mourn them when they die. Uncover many secrets and hidden treasures Kells is full of secrets and unexpected twists and turns! There are secret coins that initially seem impossible to reach. There are secret passageways and areas to uncover. There are mysterious competitions and game modes to unlock. Rumour has it, apparently there is even an entire secret island hidden away somewhere on the world map! Other Highlights There are various routes to the Last Level - will you opt for the easier, longer route or risk the difficult route in order to reach The Last Level quicker? There are 100 Levels in total scattered across the World Map. Can you complete them all? Better still, can you PERFECT them all? Can you track down all the missing Kells and fully restore the Kellective? For completionists, there are 10 Purple Kellectibles scattered around the levels in difficult-to-access locations. Can you kellect them all?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1595300/header.jpg?t=1651349434",
    "Price": 5.99,
    "Developers": "Paul Drummond",
    "Publishers": "Paul Drummond",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_8166f33ce10fd70b22a3779f0a261a834ca5bdbf.1920x1080.jpg?t=1651349434,https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_ff9deb13022ca9810bf9327bb67d575bc71773b6.1920x1080.jpg?t=1651349434,https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_d075fc2d4fddaddfc65443bf1a9527163f69b46c.1920x1080.jpg?t=1651349434,https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_5cab581f92615659998f7abf3a685a9fbab9bae8.1920x1080.jpg?t=1651349434,https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_3804068d3c485f7c11651b18f122b9ae48f76370.1920x1080.jpg?t=1651349434,https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_5e5c412c8b58af13c3959010e7ca5d43c252f760.1920x1080.jpg?t=1651349434,https://cdn.akamai.steamstatic.com/steam/apps/1595300/ss_3d14f896a9efd3ff4420e38a2ed995f705d5775f.1920x1080.jpg?t=1651349434",
    "Slug": "kells",
    "Meta Title": "Kells: Jun 1, 2021, Paul Drummond and Full Overview",
    "Meta Description": "Looking for information on Kells? Check out the release date (Jun 1, 2021), developer insights from Paul Drummond, and a complete game summary.",
    "Alt Text Image": "Official header image for Kells game - Steam 1595300",
    "Canonical URL": "https://gusku.site/game/kells",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kells\", \"description\": \"Looking for information on Kells? Check out the release date (Jun 1, 2021), developer insights from Paul Drummond, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paul Drummond\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Paul Drummond\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1595300/header.jpg?t=1651349434\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}