{
    "AppID": 1159700,
    "Name": "Knights of Light: The Prologue",
    "Release date": "Feb 29, 2020",
    "About the game": "Story Setting The story events covers the great historical battle of Al-Qadiseiya that occurred at Iraq in the 7th century. The battle had a decisive outcome that lead to the collapse of the Sassanian empire. It lasted for approximately a week but the current game content covers the events prior to the battle. You play as two elite soldiers who happen to be also brothers. The twist is the army commander got sick and delegated his command to his elite soldier to lead the army. Characters Overview There will be two playable characters to play with (Qaikaa / Aassem). Each one has a distinctive combat style and different skills and abilities to unlock. Qaikaa is a heavy hitter who uses brute force and deals massive damage. While Aassem is quick and agile with his swift attacks. World of Iraq The game world represents Iraq in the 7th century with high visual fidelity and immersive art. Despite the common thought of Iraq as a desert but it is a very diverse land full of various terrains. Aside from the beautiful landscape the world will be rich with various historical landmarks and architecture. During that time Iraq was ruled by the Sassanian Empire which was the last Persian Empire existed. The Sassanian art and architecture is very unique inheriting from both the Assyrian and Sumerian cultures. Combat Mechanics The gameplay mechanic switches between single character combat and army control. The battlefield will contain wide areas and large unit numbers. Depending on mission type some are solo and some require a few troops while others are actual battles. Each weapon has a specific range and advantage against certain enemies with the ability to switch weapons quickly. Army controls are accessed through a quick menu and the player has to combine all those controls to achieve victory. World map is divided into several regions with either enemies or allies for the player to occupy and conquer. Resources management and building fortifications is a crucial tool for the player to hold his seized regions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1159700/header.jpg?t=1583011915",
    "Price": 24.99,
    "Developers": "Rumbling Games Studio",
    "Publishers": "Rumbling Games Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1159700/ss_2419deb2755cdf9cfaad0a0af178fabe42d81969.1920x1080.jpg?t=1583011915,https://cdn.akamai.steamstatic.com/steam/apps/1159700/ss_d489a75e962018c6c782fe65a6cb5ba45d04221b.1920x1080.jpg?t=1583011915,https://cdn.akamai.steamstatic.com/steam/apps/1159700/ss_2f71ab7fa9cd94fffc4d602cf79805e66af0fde1.1920x1080.jpg?t=1583011915,https://cdn.akamai.steamstatic.com/steam/apps/1159700/ss_f9d619a99e95afa4966bfcfc285e463d3bc234bb.1920x1080.jpg?t=1583011915,https://cdn.akamai.steamstatic.com/steam/apps/1159700/ss_043e0c4e3a8e6f96b9fae82e9f1d0597841d39df.1920x1080.jpg?t=1583011915",
    "Slug": "knights-of-light-the-prologue",
    "Meta Title": "Knights of Light: The Prologue: Feb 29, 2020, Rumbling Ga...",
    "Meta Description": "Looking for information on Knights of Light: The Prologue? Check out the release date (Feb 29, 2020), developer insights from Rumbling Games Studio, and...",
    "Alt Text Image": "Official header image for Knights of Light: The Prologue game - Steam 1159700",
    "Canonical URL": "https://gusku.site/game/knights-of-light-the-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Knights of Light: The Prologue\", \"description\": \"Looking for information on Knights of Light: The Prologue? Check out the release date (Feb 29, 2020), developer insights from Rumbling Games Studio, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rumbling Games Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rumbling Games Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1159700/header.jpg?t=1583011915\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}