{
    "AppID": 1685530,
    "Name": "Luminary Online: Rise of the GoonZu",
    "Release date": "Mar 16, 2022",
    "About the game": "Luminary: Rise of the GoonZu takes you to a new world created out of the ashes of the old, and in this rebuilt civilization you create your own community. But this new Luminary world has drawn some lessons from human history, establishing a government based on democracy and an individual’s right to free will. These principles have also led to an independent market economy, where you can freely trade stocks, real estate and other goods, as well as become an entrepreneur manufacturing new products. And if making money isn’t enough, you can run for political office, and rise in the ranks to become the elected ruler of the Luminary world, the GoonZu. When humans’ excessive reliance on technology went too far, the world crumbled. But as chaos ensued, humanity’s will to survive persevered, as pockets of the world’s population persisted amidst lands of ruin. And these hardy band of survivors would unite and then even thrive, establishing a new era of human civilization. Drawing from their history, groups of survivors organized to form towns, and these new villages would all become part of a new world called Luminary. 1. Fun - FREE TO PLAY! - Unique Weapons and Magic Skills provide exciting combat options. - Upgrade your character with more than 20 different skills. - Call on your summons, guardian spirits or even transform yourself! - Raise horses and animals to ride, from a foal to dragon! - Build your own character from wide variation of jobs and task. - Enchant various equipment and make your own products to sell. - Dress to kill, choose from a wide variety of costumes and avatars. 2. Real Economic System - Real-time trading stocks, real estate and other commodities. - Start your own business with a hot product and earn lots of money. - Market prices are set by players. The Luminary world is based on capitalism. 3. Political System - Luminary guarantees a free and open democratic system. - Users directly elect the head of the server, the GoonZu. - A GoonZu's term as elected leader is 60 days. - Lords preside over the local village governments. Originally created by Ndoors Interactive, Luminary Online has been a steady project. Now the game development and management is handled by VALOFE Global LTD and the employees of VALOFE are so passionate to cherishing corner of the game play to ensure our gamers can enjoy a game that last long for their time and effort spent into. Luminary Online received updates every months with event full of actions held by the Game masters. It's game system may be referred as old school 2D MMORPG, however, we would like to make a statement that it is a 'Stunning Retro 2D MMORPG'. Luminary Online has a vast in game systems that provides so much of user activities and exploration. The development team is still moving forward to make the game more exciting and worth while for the gamers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1685530/header.jpg?t=1654049182",
    "Price": 0.0,
    "Developers": "VALOFE,NEXON",
    "Publishers": "VALOFE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1685530/ss_f4e79fb776b71c638687e160a69712e02adee0e0.1920x1080.jpg?t=1654049182,https://cdn.akamai.steamstatic.com/steam/apps/1685530/ss_10aa3107dccb99c4b440f2d30be97c9203878d5d.1920x1080.jpg?t=1654049182,https://cdn.akamai.steamstatic.com/steam/apps/1685530/ss_b44d71f02988a3ed074d5a2596262b3050935d35.1920x1080.jpg?t=1654049182,https://cdn.akamai.steamstatic.com/steam/apps/1685530/ss_357362cf5691c3a35caac9107045601af51b6ad0.1920x1080.jpg?t=1654049182,https://cdn.akamai.steamstatic.com/steam/apps/1685530/ss_65c79508b5558b90e398ecf3bafba5c193a57d9a.1920x1080.jpg?t=1654049182",
    "Slug": "luminary-online-rise-of-the-goonzu",
    "Meta Title": "Luminary Online: Rise of the GoonZu: Mar 16, 2022, VALOFE...",
    "Meta Description": "Looking for information on Luminary Online: Rise of the GoonZu? Check out the release date (Mar 16, 2022), developer insights from VALOFE,NEXON, and a c...",
    "Alt Text Image": "Official header image for Luminary Online: Rise of the GoonZu game - Steam 1685530",
    "Canonical URL": "https://gusku.site/game/luminary-online-rise-of-the-goonzu",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Luminary Online: Rise of the GoonZu\", \"description\": \"Looking for information on Luminary Online: Rise of the GoonZu? Check out the release date (Mar 16, 2022), developer insights from VALOFE,NEXON, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"VALOFE,NEXON\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VALOFE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1685530/header.jpg?t=1654049182\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}