{
    "AppID": 725140,
    "Name": "Nogard",
    "Release date": "Mar 29, 2018",
    "About the game": "Explore the Floating Kingdoms with Nogard and try the materia power of the ancient Yksimals. Nogard is a low poly 3D platformer inspired by the very first experiences of this genre where you play as an elemental golem called Nogard. Restore the power of the Floating Kingdoms and discover what happened using the power to change your state from solid to liquid or gas within an incredible adventure. The Floating Kingdoms The Floating Kingdoms are formed by a group of islands in the middle of the sky. In those islands you can find a variety of different biomes with their own wildlife, plants and weather. All those islands were inhabited by an old civilization long time ago and even nowadays their architecture and technology prevails. The Old Yksimals Tech &amp; Goddess The Floating Kingdoms where inhabited long time ago by the Yksimal people, those who mastered the sky. They prayed to an old goddess that bless them with the power of the clouds enabling them to transform the clouds into different states. They used this power to create a hole civilization with their cloud technology even cloud golems as Nogard. A Golem to the Rescue Nogard is a security golem made by the old Yksimals to help the goddess. He has been awaken thousands of years from the cumulonimbus wars to restore the connection between the goddess and the kingdom lands. Your mission is to help him within this epic adventure and discover why the goddess has awaken him. Water States Nogard is an elemental golem made by the Yksimals, that can change the state of its materia. Using the power of the old technology he can change from solid ice, to the fluid water or ungravity steam. This power will allow him to reach new areas, use other types of technology and afront the environment in a whole new way. Collect them All The Floating Kingdoms are repleted of cloud drops and crystals of power. Seek out for them to get the goddess favor and restore Nogard’s power and unlock new areas.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/725140/header.jpg?t=1522335662",
    "Price": 4.99,
    "Developers": "Oryps Games",
    "Publishers": "Oryps Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/725140/ss_532c051b5231bfc20f48ad2cee6685ff9a40b0e0.1920x1080.jpg?t=1522335662,https://cdn.akamai.steamstatic.com/steam/apps/725140/ss_9da7f4b6c0dad8a0b2928a9f9330ac2ef5688eed.1920x1080.jpg?t=1522335662,https://cdn.akamai.steamstatic.com/steam/apps/725140/ss_f1b8bfdc55c651ce7620eea57f7d7996d6208e0c.1920x1080.jpg?t=1522335662,https://cdn.akamai.steamstatic.com/steam/apps/725140/ss_8e20f1e2f0f66ff282481b3786a866f35858d736.1920x1080.jpg?t=1522335662,https://cdn.akamai.steamstatic.com/steam/apps/725140/ss_94e0c96b41992e87d559b18b6cf5be2d8901906a.1920x1080.jpg?t=1522335662",
    "Slug": "nogard",
    "Meta Title": "Nogard: Mar 29, 2018, Oryps Games and Full Overview",
    "Meta Description": "Looking for information on Nogard? Check out the release date (Mar 29, 2018), developer insights from Oryps Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Nogard game - Steam 725140",
    "Canonical URL": "https://gusku.site/game/nogard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nogard\", \"description\": \"Looking for information on Nogard? Check out the release date (Mar 29, 2018), developer insights from Oryps Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oryps Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oryps Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/725140/header.jpg?t=1522335662\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}