{
    "AppID": 607670,
    "Name": "Puzzle Guardians",
    "Release date": "Apr 18, 2017",
    "About the game": "Puzzle Guardians Puzzle &amp; Rpg That Let Player Be the Hero To Defeat the Great War Elephant, Dragons, Etc. Create &amp; customize your hero Collect weapon, armor Collect guardians Enhance your equipments and guardians Basic Game Play Player have to manage to match to symbol to activate their effect. There are 5 type of symbol Attack - more match means multiple hit! multiple combo! Mana - increase player mana for using active skill (Attack, Heal, Buff, etc.) Gold - collect gold for upgrade equipment, training for better player stats Guardian - call guardian to attack and increase guardian mana (to cast guardian skill) Heart - increase player HP Game Features Character customization Players have to customize the Hero before start the adventure. You can select your hero gender, hair style, eye and mouth.(40 type of hair, eye and mouth) Combo Attack System If player learning passive skill, it can stack effect with combo gem. Player can attack 1 to 20 hits in one turn! Character Active/passive Skill Player Can Upgrade Active and Passive Skill Player can upgrade skill up on style that player can choose Combat Type. Critical Type. Guardian Type. Buff Type. Guardian Team Strategy Guardians can support player in the battle.\u000b\u000bGuardians have various skill up on the type of the guardian such as Critical Type, Support Type.\u000bPlayer need to collect the Guardian Stone to Summon or Level it. \u000b\u000bCan choose 3 guardians for battle and upgrade it to increase their power and ability. More than 25 guardians available for now. (1-5 Star) Puzzle Bonus Pattern The special panel that will appear on gem table in some stage. If you can arrange gems match with special panel color, you will get a bonus spin to receive treasure or buff. Equipment Player can equip 4 type of equipment for Hero. (1-5 Star) (Weapon, Shield, Helm, Armor). Element System that make advantage in the battle. Monsters, Equipment and Guardians have element too.More than 20 set of equipment for now. World Of Puzzle Guardians Player have to fight through a lot of enemy around the World, 5 Continent, more than 100 stages. Monsters More than 60 type monsters with various animation and skill. Training Training System \u000bPlayer can training hero to increase status with coin. Quest Player can do “Quest” to receive a reward up on the condition of quest or achievement. Multi-language Support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/607670/header.jpg?t=1492588029",
    "Price": 10.99,
    "Developers": "Miryn Innovation",
    "Publishers": "Miryn Innovation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/607670/ss_7021cc85885b4ec97d625e772ac3d02e9e9e2bdf.1920x1080.jpg?t=1492588029,https://cdn.akamai.steamstatic.com/steam/apps/607670/ss_d003a844e17ccedf100561847bff7b61c00ea9f6.1920x1080.jpg?t=1492588029,https://cdn.akamai.steamstatic.com/steam/apps/607670/ss_55a990644d7cfeda5d159e5cd6b328311a768074.1920x1080.jpg?t=1492588029,https://cdn.akamai.steamstatic.com/steam/apps/607670/ss_0c12872d2b0d04244e069657f9c7a1c407c3a129.1920x1080.jpg?t=1492588029,https://cdn.akamai.steamstatic.com/steam/apps/607670/ss_f67da182282d0e87027aa396438b79cbb476bcc3.1920x1080.jpg?t=1492588029",
    "Slug": "puzzle-guardians",
    "Meta Title": "Puzzle Guardians: Apr 18, 2017, Miryn Innovation and Full...",
    "Meta Description": "Looking for information on Puzzle Guardians? Check out the release date (Apr 18, 2017), developer insights from Miryn Innovation, and a complete game su...",
    "Alt Text Image": "Official header image for Puzzle Guardians game - Steam 607670",
    "Canonical URL": "https://gusku.site/game/puzzle-guardians",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Puzzle Guardians\", \"description\": \"Looking for information on Puzzle Guardians? Check out the release date (Apr 18, 2017), developer insights from Miryn Innovation, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Miryn Innovation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Miryn Innovation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/607670/header.jpg?t=1492588029\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}