{
    "AppID": 659160,
    "Name": "Rain of Pumpkins",
    "Release date": "Oct 23, 2017",
    "About the game": "What's It About! It's a first person collector! The game plays like a first person shooter but the purpose is to collect things – namely pumpkins! Set in a town populated by skeletons, your task is to gather pumpkins hurled at the town by the local witch. Deliver them to your local chefs at the mills to make pies and earn points. Perform well and the witch will leave you alone – that's until the next full moon! Game Play The pumpkins have to be collected (you can carry 5 at a time) and delivered to the chefs at the mills. The pumpkins come in three colours and three sizes. You'll get more points for blue than red pumpkins and even more points for the yellow. Red pumpkins have to be delivered to the red chef, blue pumpkins to the blue and yellow to the yellow chef. The larger the pumpkin the more points you'll get – but the larger they are the heavier they are and you'll move slower. Plus you'll get bonus scores if you collect pumpkins in batches of the same colour (three or more). So collecting pumpkins in the order; red, red, red, blue and yellow gives you a higher score than a red, blue, red, yellow, red collection. When you deliver your pumpkins to each chef you will get bonus points. The chefs will start to work making pies. Once a pie has been made you can visit the chef to pick them up. You can use these pies to buy stuff to help you get your job done! Each level you will be set a target, which could be a set number of red, blue or yellow pumpkins, and/or a set number of points. Plus the witch is impatient and each level you are up against the clock (you are generally given less than 10 minutes to complete each level)! Pumpkins tend to go off quite quickly and burst! This means you'll have less pumpkins to pick up – which might mean you can't complete the level! Also if you happen to be near a pumpkin when it bursts you'll get splattered which will slow you down! (Hint: visit the doc at the hospital to get fixed up). The Town If you've got some pies you can go over to the townsfolk and they will exchange your pies for stuff that might help you: Gym – gain strength (for a short while). This will enable you to carry those heavy pumpkins. Shoe Shop – buy some running shoes which will let you move faster (until they wear out). Saloon – take your chance at spinning the wheel with the chance of winning more pies! Marketplace – acquire a compass from the pirate. You'll find that it points to the nearest pumpkin. Old Father Time – visit them near the cemetery and you'll get more time to complete the level. Blacksmith – he can provide you with a helmet which will provide you protection from bursting pumpkins. Voodoo – special charm that slows down time! Hospital – when you get hit from a pumpkin bursting visit the doc to get healed. Mitten Shop – buy a mitten – very useful as some pumpkins sent down are on fire! Without flame proof mittens you won't be able to pick them up! The Town has a rat problem – watch out as those critters have a habit of getting in your way and messing with your pumpkins! Your Aim! How to Win – meet the level target! How to Lose – the clock reaches zero and the game is over. Never fear you can repeat the level (and you'll get some extra time to do it in). Delivering Pumpkins Just go up to a chef and they will take all the pumpkins that match their colour. Collecting Pies Just go up to a chef and they will give you any pies they've made. Note the windmill spins faster if there are pies to pick up. Endless Levels The first levels will introduce the rules/elements that make up the game. After that you get over 80 pre-defined levels/challenges before the game goes into endless mode – producing random levels! Each challenge/level lasts no more than 10 minutes the first time you play it - so it's quite a casual game hence the price. Game Controls Same as a first person shooter: WASD or arrow keys to move around Mouse to steer. Jump (space bar) is available. The main part of the game can be played with a joypad. Happy Collecting! Gary &amp; Eddy (and thanks to the talented John Leonard French for the music).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/659160/header.jpg?t=1567674610",
    "Price": 2.99,
    "Developers": "Gary & Eddy",
    "Publishers": "EGCL",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/659160/ss_88cd3523cf203a217bc688e79cdb92be4155fff3.1920x1080.jpg?t=1567674610,https://cdn.akamai.steamstatic.com/steam/apps/659160/ss_05fec3633fffe482019c00d987d5b5608ac92de2.1920x1080.jpg?t=1567674610,https://cdn.akamai.steamstatic.com/steam/apps/659160/ss_ffb66ae56236bb49de99ab9fbb0f65fc58071110.1920x1080.jpg?t=1567674610,https://cdn.akamai.steamstatic.com/steam/apps/659160/ss_16edeb0aced17f040463f1301cf1d11681a081b4.1920x1080.jpg?t=1567674610,https://cdn.akamai.steamstatic.com/steam/apps/659160/ss_5660dcd798441bbcf947ed37fa135102aca69e8a.1920x1080.jpg?t=1567674610",
    "Slug": "rain-of-pumpkins",
    "Meta Title": "Rain of Pumpkins: Oct 23, 2017, Gary & Eddy and Full Over...",
    "Meta Description": "Looking for information on Rain of Pumpkins? Check out the release date (Oct 23, 2017), developer insights from Gary & Eddy, and a complete game summary.",
    "Alt Text Image": "Official header image for Rain of Pumpkins game - Steam 659160",
    "Canonical URL": "https://gusku.site/game/rain-of-pumpkins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rain of Pumpkins\", \"description\": \"Looking for information on Rain of Pumpkins? Check out the release date (Oct 23, 2017), developer insights from Gary & Eddy, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gary & Eddy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EGCL\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/659160/header.jpg?t=1567674610\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}