{
    "AppID": 363890,
    "Name": "RPG Maker MV",
    "Release date": "Oct 23, 2015",
    "About the game": "POWERFUL enough for a developer SIMPLE enough for a child VERSATILE enough for any platform! For years, RPG Maker has been the easiest way to make your own Windows PC Roleplaying game. We have strived to give everyone, regardless of experience or skill level, the tools to make a game they could be proud of. Now, with RPG Maker MV, your game isn't just on Windows PC, its on the move. Make your game on your Windows or OS X PC, and then deploy it for iOS, Android, Windows, OS X, or even to play in a browser using HTML5! MAKE GAMES FOR THE PLATFORMS YOU WANT FROM ANY PC RPG Maker MV can run on both Windows and Mac OS X PCs. Users can also export games for the following platforms: Windows/EXE MacOSX/APP Android/APK iOS/IPA HTML 5 for Web Browsers BUILD YOUR WORLD WITH AN IMPROVED MAP EDITOR RPG Maker MV uses a user-friendly​ map system to help you build the RPG world of your dreams. With an additional automated upper layer, mapping in MV is even easier than before. MAKE YOUR WORLD LIVE WITH A SIMPLE EVENT SYSTEM In RPG Maker MV, you use the simple, intuitive event system to bring your world to life. You can easily and quickly create NPCs for your characters to interact with, puzzles for them to solve, and quests for them to complete. GET STARTED IMMEDIATELY WITH BUILT-IN RESOURCES RPG Maker MV, like previous RPG Makers, comes with its own graphic and audio resources for you to use in your game. From sprites to battlers, from sound effects to music. MV comes with resources for both Fantasy and Sci-fi games, and you are easily able to add more. USE TWO DIFFERENT BATTLE MODES, RIGHT OUT OF THE BOX With a tick of a checkbox, you can switch between the classic Front View Battle to a Side View Battle system. USE A MOUSE OR TOUCH SCREEN TO PLAY YOUR GAMES Tired of playing RPG Maker games with your keyboard? With RPG Maker MV, your game will allow the player to play the game with a flick of their mouse, or using a touch screen. SEE YOUR GAME IN HIGHER RESOLUTION RPG Maker MV can show more than ever before. With a default 1.5x the resolution, sprites can show more emotion and the scenery can be more detailed than ever before. USE PLUGINS TO MAKE A FULLY CUSTOMIZED GAME Want to customize your game even FURTHER? Use plugins to change things the way YOU want them. You can get them from us, get them from other fans, or master JavaScript to make your own! With our new plugin manager, you can just drop in the .js file of a plugin, and then configure it directly in the editor.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/363890/header.jpg?t=1657157949",
    "Price": 15.99,
    "Developers": "Gotcha Gotcha Games,KADOKAWA,Yoji Ojima",
    "Publishers": "Degica",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_1ed774c372d6e7568a9f25bca9f27fc1e9f5d081.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_3931a5ce8245a36450f71a570a5f679b8e39fc06.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_ed900c17009cd66b0ade4dba28a239ca73b6184e.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_38fe62700e399ef784b02e4f135ca25a702d2f29.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_4f6be133c84efd05a7b120b5d17f3cd3f3b81ac3.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_3be64c0e77a62c3f68b392295178c67c32295737.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_0c6188d3a19ed428351017c66c8538f661419e94.1920x1080.jpg?t=1657157949,https://cdn.akamai.steamstatic.com/steam/apps/363890/ss_0c0c7efdab936efa87ef5e42dff22a0ea13ea385.1920x1080.jpg?t=1657157949",
    "Slug": "rpg-maker-mv",
    "Meta Title": "RPG Maker MV: Oct 23, 2015, Gotcha Gotcha Games,KADOKAWA,...",
    "Meta Description": "Looking for information on RPG Maker MV? Check out the release date (Oct 23, 2015), developer insights from Gotcha Gotcha Games,KADOKAWA,Yoji Ojima, and...",
    "Alt Text Image": "Official header image for RPG Maker MV game - Steam 363890",
    "Canonical URL": "https://gusku.site/game/rpg-maker-mv",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RPG Maker MV\", \"description\": \"Looking for information on RPG Maker MV? Check out the release date (Oct 23, 2015), developer insights from Gotcha Gotcha Games,KADOKAWA,Yoji Ojima, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gotcha Gotcha Games,KADOKAWA,Yoji Ojima\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Degica\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/363890/header.jpg?t=1657157949\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}