{
    "AppID": 700330,
    "Name": "SCP: Secret Laboratory",
    "Release date": "Dec 29, 2017",
    "About the game": "Amidst the chaos of a disastrous mass containment failure at the supposed “master site” Site-02, you fight your way to the top alongside — and against — other players. From devious D-Class and cunning scientists to elite Mobile Task Force units (MTF), rebellious Chaos Insurgency (CI), and even the horrific SCP Entities, there are many key roles to play in this gruesome affair, so... How will you act amidst a containment breach? SCP: Secret Laboratory (SCP: SL) is a free-to-play multiplayer horror game heavily based on the SCP Foundation series and its expanded universe of monsters and paranormal phenomena. The primary objective of the SCP Foundation (also “the Foundation”) is to safeguard the world from any and all entities, objects, or phenomena that are deemed potential threats to humanity, and thus to uphold the normalcy of the modern world. Recently, however, Chaos Insurgency forces have begun acting against the Foundation in pursuit of a future where humanity reigns supreme. The question is: What role will you play? D-Class Personnel – Inmates kept within the bowels of the Foundation sites as lab rats; test subjects at the mercy of the Foundation’s cruel practices. Escape from your confines and rebel against your imprisoners — by any means necessary. Foundation Scientists – Researchers, engineers, and division specialists; you must ensure your own survival until an MTF extracts you from the ensuing pandemonium. Use your wit — and access cards — to survive. But be wary of the Class-D scurrying beneath you; they’ll do anything to escape their confines. Nine-Tailed Fox Units – The first MTF units to respond to the emergency. Your mission: To extract valuable Foundation personnel and to, with the utmost vehemence, terminate or re-contain any SCPs that have escaped. Foundation Security – On-site security personnel charged with restoring order amidst the chaos. Evacuate Scientists, terminate D-Class Personnel, re-contain escaped SCPs, and above all do whatever it takes to restore normalcy to your site. Chaos Insurgency – Once a mere splinter cell force and now a formidable military power, yet still but a shadow of their former Foundation employers. Your primary objective is to purge the facility of Foundation personnel and seize the “assets” that are deemed to serve the best interests of Delta Command, your elusive overseers. SCP Entities – Typically hostile sentient beings of an anomalous nature, all of which are extremely different from one another. You are to consider yourself an enemy of all humans, and formidable ones at that. Do not accept any attempts to compromise — you are naught but death. With each match comes new experiences, thrills, and threats. You will battle for survival with every faction: SCP Entities rampaging on their path to escape, Chaos Insurgency sabotaging the Foundation, MTF and Security mobilizing to secure the facility, and armed Scientists and D-Class who refuse to take “no” for an answer. Be prepared for anything. Rest assured, you will encounter many threats. Friends and foes alike will take up arms against you — you may be disintegrated by a tesla gate, or perhaps a hydrogen bomb lying right beneath your feet will begin its countdown to detonation. There are many ways to die, yet in turn, many ways to survive such a hell. SCP: SL features a growing roster of SCPs that includes the following: Playable SCPs SCP-049 – An archaic plague doctor with the sole intent of “curing” those ridden with the “pestilence”. Contact means death, but only momentarily; you may find that one of the side effects of the good doctor’s surgery is being denied such an easy end. SCP-079 – A sentient A.I. that has access to most of the facility's hardware and monitoring systems. With the facility under its control, beware the doors you lock tight for safety becoming the reason for your demise. And always remember: You never know who could be watching. SCP-096 – An extremely slender, frail-looking humanoid. It hides its face for a reason. Simply peering at it will induce a state of unstoppable rage, in which it massacres anything around with its immense strength. Running is futile. Don't even peek. SCP-106 – A humanoid composed of an anomalous jet-black substance. Contact means certain death, or supposedly an equivalent of such. Presume you’re never safe whilst 106 looms. SCP-173 – A mere concrete sculpture, upon first glance. On second glance, you’ll notice it’s somehow closer. There is no third glance — you're dead by then. SCP-939 – A pack-dependent predator that intelligently mimics human voices to deceive and entrap its desired prey. Remember who your allies are. Be wary of who you trust. Don't fall for stray imitations, lest you’re repaid with a bite. Object SCPs SCP-018 – A red 1969 Blam-O Super Ball that doubles its velocity with each rebound. Only aim towards targets authorized for immediate termination. SCP-207 – A bottle of cola, the contents of which offer radically increased motor functioning, for the mere cost of a completely devastated metabolism. You must ask yourself the question: Is momentary salvation worth the torturous death sure to follow? SCP-268 – A tweed newsboy cap that makes the wearer invisible to the naked eye. Don to avoid death or make a daring escape — the possibilities are endless, so long as you don’t draw unwanted attention. SCP-330 - A candy bowl filled with various treats and side effects, but the flavours are to die for. Remember to take no more than two! SCP-500 – A single red pill capable of instantaneously curing any affliction. Such a wonder drug is irreplaceable — think carefully before use. SCP-914 – An anomalous machine that is capable of improving or degrading whatever contents are placed within — all at the whim of its user. SCP-2176 - An anomalous lightbulb containing a Class-A Ectomorph, capable of disrupting electrical systems within the facility — be careful not to drop it! Site-02 is an unforgiving place. Stay on your toes, follow protocol, survive or die for the cause, and remember… We die in the dark so others may live in the light. ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ SCP: SL was initially based on the original single-player horror game SCP – Containment Breach (2012), by Undertow Games. More recently, Northwood Studios deviated from SCP – Containment Breach , creating a unique setting and expanding lore, with an ultimate goal of presenting players with a complete and immersive game experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/700330/header.jpg?t=1650127138",
    "Price": 0.0,
    "Developers": "Northwood Studios",
    "Publishers": "Northwood Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_56ac99b44995d1029cb5af31ac56337664286990.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_9a858e23c41e70f80404fdb3640131b30891cbb0.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_fe677f119902a29afc265449c4d335ef9b4156bb.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_f2a2127d26eb3dbc3d82e3de45ce5644182a187f.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_600400d9e97291211f212ccf15db1def4acf089e.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_aa1279910b2a0d84b2e0c9a4fce18b39b40485d2.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_c1d900e2a5debc20d95dbc224c1ab8093429a6aa.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_03e46947d30b54a531ac23232afb614fd0e7265c.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_5eafd755b4450302478edd5c06cb9309a1107596.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_ff4d626ef0ff11cbed228feb5a87e060f562be9f.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_3b1dbef2b30b05a90fe5bd346ab3f2b1a6c08aa7.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_570b0484b650703894a8d6137f30ba6fcdd8d7ce.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_a373e4a7ab3ca6ae412b4ef15d2e8a3f5e93f8ac.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_7197ff9996aaa7100f4fce40ee5867a80a4b9476.1920x1080.jpg?t=1650127138,https://cdn.akamai.steamstatic.com/steam/apps/700330/ss_ad76d326e17742b17edfdabd533eca88f4db0a10.1920x1080.jpg?t=1650127138",
    "Slug": "scp-secret-laboratory",
    "Meta Title": "SCP: Secret Laboratory: Dec 29, 2017, Northwood Studios a...",
    "Meta Description": "Looking for information on SCP: Secret Laboratory? Check out the release date (Dec 29, 2017), developer insights from Northwood Studios, and a complete ...",
    "Alt Text Image": "Official header image for SCP: Secret Laboratory game - Steam 700330",
    "Canonical URL": "https://gusku.site/game/scp-secret-laboratory",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SCP: Secret Laboratory\", \"description\": \"Looking for information on SCP: Secret Laboratory? Check out the release date (Dec 29, 2017), developer insights from Northwood Studios, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Northwood Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Northwood Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/700330/header.jpg?t=1650127138\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}