{
    "AppID": 626020,
    "Name": "Shadows in the Darkness",
    "Release date": "Oct 19, 2017",
    "About the game": "Shadows in the Darkness is an intense, cooperative roguelite, letting players venture down into the depths of mysterious dungeons to eradicate the darkness beneath. Play alone or with your friends to explore random dungeons, collect unique loot, and fight dangerous enemies. Features Vast randomly generated dungeons -Everytime a new game begins, a massive system of 21 floors is generated. Huge libraries, small hallways, and open spaces await in this underground network. Fully functional 4 player co-op or singleplayer -Explore the dungeons with friends! Create tactics to distract enemies, manage the various loot found, and dominate the final boss together. -This doesn't mean you can't play alone, however. The dungeon difficulty is fully adjustable. 4 intense boss fights -As you descend into the dungeons, tough bosses await to stop you in your tracks. Create a plan and figure out how to kill them before they kill you. Dangerous, wandering enemies -Fight orcs, goblins, slimes, spiders, and much more in the deeper floors. Enemies wander about, allowing for you to coordinate attacks and ambush to increase your likelihood of survival. Easy to learn, difficult to master -There are very few controls to learn throughout the game, but in order to be able to defeat the dungeon, you must learn the enemies, manage your resources, and fight your way to victory. Full physics-based item system -Physics-based items allow for a fighting system based on skill. Unique inventory system -Inventory does not go by slots, rather it is managed solely on space. Open up your pack, and place items in a fashion that allow for the maximum amount of space to be filled. -You have a single holster on your back for weapons allowing for quick access. Lots of loot -Find various swords, wands, potions, and scrolls scattered in chests and rooms. There are a wide variety of items to fight with or use but look carefully, as the best might be hidden somewhere in the darkest corners... Shadows in the Darkness is in Early Access, so please be mindful of all bugs or issues, and leave suggestions in the Steam forums or on the r/scornz subreddit. I'll work my hardest to remove and fix found bugs as soon as possible. Thank you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/626020/header.jpg?t=1508448062",
    "Price": 4.99,
    "Developers": "Scornz",
    "Publishers": "Scornz",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_806a771edf560cdf6d7fdaafaeeb41f6ffb62cbb.1920x1080.jpg?t=1508448062,https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_5aaa735217fd65d6fb05d8bc9b3079243570fbd1.1920x1080.jpg?t=1508448062,https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_0afdd641a83ab04b275ca54f6eaeb471d63bbd7f.1920x1080.jpg?t=1508448062,https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_c51f176d9ad1dcf2689f846547c88763732ade86.1920x1080.jpg?t=1508448062,https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_2b4024d33d7c38a8d863e5214b460bd059eed0bc.1920x1080.jpg?t=1508448062,https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_d97eed827a176f6b0b521e8a0d28786b339826fc.1920x1080.jpg?t=1508448062,https://cdn.akamai.steamstatic.com/steam/apps/626020/ss_6dbc7dd3768da65c8d67b1eaa4c4c000158df1a4.1920x1080.jpg?t=1508448062",
    "Slug": "shadows-in-the-darkness",
    "Meta Title": "Shadows in the Darkness: Oct 19, 2017, Scornz and Full Ov...",
    "Meta Description": "Looking for information on Shadows in the Darkness? Check out the release date (Oct 19, 2017), developer insights from Scornz, and a complete game summary.",
    "Alt Text Image": "Official header image for Shadows in the Darkness game - Steam 626020",
    "Canonical URL": "https://gusku.site/game/shadows-in-the-darkness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadows in the Darkness\", \"description\": \"Looking for information on Shadows in the Darkness? Check out the release date (Oct 19, 2017), developer insights from Scornz, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Scornz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Scornz\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/626020/header.jpg?t=1508448062\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}