{
    "AppID": 1231740,
    "Name": "Sorbetta: Gravely in Debt",
    "Release date": "Feb 20, 2020",
    "About the game": "When Sorbetta loses almost everything in a game of Blackjack, she realizes she has a serious gambling problem. Thankfully she was able to get help for her gambling addiction and also borrow what she needed to pay off her debts from her cousin. However, was this loan divine providence, or a deal with the devil? Join Sorbetta as she tries to not only earn the money (plus interest) to pay back her cousin, but also find four fantastical treasures that will ensure Sorbetta is never bothered by Sherberta again. It's not as if the treasures are just garbage, and Sorbetta is probably wasting her time, right? ... Right?! Sorbetta The protagonist of this lovely story. A necromancer by trade, she practices when she is able using all manner of bodies, both human and otherwise, to hone her skills. Unfortunately, she developed a fondness for Blackjack. A big fondness. Some bad decisions and a couple thousand gold later, she is now trying her best to pay off her over-bearing and bossy cousin. Sherberta Also a necromancer, like her cousin, however she specializes more with incorporeal beings rather than flesh and blood bodies. Self-serving, and ever the opportunist, she saw a perfect chance to profit off her cousin's little...problem. Even though she can be quite demanding and even a bit bullish, there does beat a heart of gold somewhere in that blue bombshell. Or, more likely, a heart that beats for gold. When it comes to the color of their skin and the outlandish attire they both love to wear, neither woman is forthcoming with an explanation. Perhaps some things are best left unexplained? Key-Anu Not much is known about Sorbetta's business associate . The piano mimic spends his days in the basement bar, The Dusty Femur, longing for the day he'll get brought up to the first floor. Maybe he's just lonesome? Raise the dead for fun and profit! Multiple (2) endings Original comedic script that isn't another JRPG parody or satire Several members of the RPG Maker dev community have cameos. See if you can spot them all! Most of the game development was done live on HawkZombie's Twitch.tv channel Made almost entirely from RTP assets, for better or worse!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1231740/header.jpg?t=1654737341",
    "Price": 0.0,
    "Developers": "Undead Avian Publishing",
    "Publishers": "Undead Avian Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1231740/ss_186cf7c357beab1d79e0b829796e70b86c3901fb.1920x1080.jpg?t=1654737341,https://cdn.akamai.steamstatic.com/steam/apps/1231740/ss_a0a69e533f4e63160da0f0a13edfd8576d7ddc0e.1920x1080.jpg?t=1654737341,https://cdn.akamai.steamstatic.com/steam/apps/1231740/ss_34bc608afa9c1484a5b24475a3f8983dad20b35d.1920x1080.jpg?t=1654737341,https://cdn.akamai.steamstatic.com/steam/apps/1231740/ss_2f19a48e5ca596d26596739f7a9848c15866bf22.1920x1080.jpg?t=1654737341,https://cdn.akamai.steamstatic.com/steam/apps/1231740/ss_ffe40a30adb11a71ffc1125f2edda7e37313e887.1920x1080.jpg?t=1654737341,https://cdn.akamai.steamstatic.com/steam/apps/1231740/ss_9a8b47d9a81a65d1c54c9d664a5bc718783b358e.1920x1080.jpg?t=1654737341",
    "Slug": "sorbetta-gravely-in-debt",
    "Meta Title": "Sorbetta: Gravely in Debt: Feb 20, 2020, Undead Avian Pub...",
    "Meta Description": "Looking for information on Sorbetta: Gravely in Debt? Check out the release date (Feb 20, 2020), developer insights from Undead Avian Publishing, and a ...",
    "Alt Text Image": "Official header image for Sorbetta: Gravely in Debt game - Steam 1231740",
    "Canonical URL": "https://gusku.site/game/sorbetta-gravely-in-debt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sorbetta: Gravely in Debt\", \"description\": \"Looking for information on Sorbetta: Gravely in Debt? Check out the release date (Feb 20, 2020), developer insights from Undead Avian Publishing, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Undead Avian Publishing\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Undead Avian Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1231740/header.jpg?t=1654737341\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}