{
    "AppID": 658480,
    "Name": "Starfighter General",
    "Release date": "Nov 21, 2020",
    "About the game": "Hello, The future is near, the MMO landscape is about to get great with the new engine I developed. Unlimited players in the same zone, 1/2 the latency (yes 1/2 the lag), and no server maintenance costs(The game will never end like other MMOS! I'll even get hiers and such to play it up to hopefully hundreds of years in the future). Play now to power up your base and fleet for in preparation for a huge MMO to compete with other titans of space mmos. Now: Build a Starbase, Research new ships, build a huge fleet of ships. Take your fleet of ships, and fight other fleets of ships and bases. Upgrade your Command Center to get more buildings (Max level 20), but other buildings can level up to 1000 and beyond. Use your Factory to Assemble more ships to battle on your side! User Research Lab to unlock the ability to research higher tier ships. Upgrade hangars to store more craft. Upgrade Computrons to use more of your fleet in battle with a chip. Mine for Xmatter with mining operations. Store matter with Silos. Get Power Plants to speed building. Even get a building that will give you a trickle of virtal currency(Triderium) Upgrade your ships individually Defend your base when you are offline with turrets. Raid bases and shoot mining operations or silos to gain Xmatter. Kill Ships/Buildings for scrap to build/research ships. I think this game is legit good now, and it will be better. Features I want to add: Capital ships Fleet placement Base/Attacking, and strategies. Bomber and Assault ships to gain bombs/missiles. MOBA(Actually done, but just launching single player at first because I don't know how to host a server.) MMO+Missions where you fight different skirmishes but get permanent loot. A sort of galaxy conquering mode strategically, but your battles are fought in first person. A grand Role Playing Game with Live Game Master where you get to alter the very course of the universe with any choice you make, and your actions are recorded. This is MMO and slated for a few months from now. ,Jim Another take: We want to get this MMO out done soon before the end of 2021 asap even! The MMO will contain 'Space dungeons' which are special zones that all players compete for a big reward. Each Space Dungeon has a different win condition and goals. One might be ffa. Another might be FFA highlander mode. Another might be science based. Another might be team vs team. Another might be chess team (aka you kill the king) you win. Another might be who kills a boss fastest. Long story short, once a day, these places will drop really good loot predictably either on a timer, or via clue sheet. Then most players will know where to be. And the same guy won't win every 'Space Dungeon' because the rules are dif for each. There will be resource trading, aka, buy aluminum or other metals one place and sell another like Elite. There will be a PVP bounty system. Everyone can PVP at all times. Stakes are low if your ship explodes. If you get attacked without declaring aggressive mode or an opponent to duel, the aggressor gets a bounty on their head in accordance with the damage dealt to you. If this bounty gets high enough, and they get caught, they will be put in jail. When they log on for the next few hours or days, their character can play only in jail, and visitors come see him and such. Global chat disabled. There will be illegal substances like fictitious drugs and contraband weapons which you can profit from greatly, but you risk your cargo being scanned by a random and getting a bounty on your head. There will later be grand space opera. AKA Live Game Masters will observe the game, and allow players to permanently change the history on their server. Then later, the ability to touch down on ground, and your player get out FPS style will come. I have other plans, but this will be a very fun game to come along for the dev ride. Enjoy updates and get yourself strong now, so when later the Space Opera comes out, you can be one of the big dawg influencers of the universe. Thank you for your interest! God Bless you. God is love. ,James W. Sager III",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/658480/header.jpg?t=1636026213",
    "Price": 0.0,
    "Developers": "James Sager III,Steve Reynolds",
    "Publishers": "James Sager",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/658480/ss_9ca195b216997ff56470887ad05ae8f7262b519a.1920x1080.jpg?t=1636026213,https://cdn.akamai.steamstatic.com/steam/apps/658480/ss_28795e25615b47e9ef7b5f414a5261a1a5c63ee2.1920x1080.jpg?t=1636026213,https://cdn.akamai.steamstatic.com/steam/apps/658480/ss_2416e71f063893d4d131700079ee6303830ddd5b.1920x1080.jpg?t=1636026213,https://cdn.akamai.steamstatic.com/steam/apps/658480/ss_16b5fc17c6f7fb941945df502ebb54b5444223b1.1920x1080.jpg?t=1636026213,https://cdn.akamai.steamstatic.com/steam/apps/658480/ss_840cad115d8e740ecc987fd79f9a8086b939a52a.1920x1080.jpg?t=1636026213",
    "Slug": "starfighter-general",
    "Meta Title": "Starfighter General: Nov 21, 2020, James Sager III,Steve ...",
    "Meta Description": "Looking for information on Starfighter General? Check out the release date (Nov 21, 2020), developer insights from James Sager III,Steve Reynolds, and a...",
    "Alt Text Image": "Official header image for Starfighter General game - Steam 658480",
    "Canonical URL": "https://gusku.site/game/starfighter-general",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Starfighter General\", \"description\": \"Looking for information on Starfighter General? Check out the release date (Nov 21, 2020), developer insights from James Sager III,Steve Reynolds, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"James Sager III,Steve Reynolds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"James Sager\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/658480/header.jpg?t=1636026213\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}