{
    "AppID": 1297790,
    "Name": "Sunday Rivals",
    "Release date": "May 16, 2022",
    "About the game": "SUNDAY IS FOR RIVALS Sunday Rivals channels the unique spirit and fun of early 90's sports games and supercharges it into an easy to pickup, high impact, arcade football adrenaline shot! PICKUP AND PLAY On the field, gameplay is tuned to be snappy and fun, rewarding quick thinking and creative players with dazzling open field jukes and bone crushing hits. Simplified rules and streamlined playbooks make it easy for players of all skill levels to jump in and immediately enjoy playing football video games again! FULL CUSTOMIZATION You have complete control over your custom leagues! Pick stadium colors, grass types, and endzone text. Define coaching strategies and choose which playbooks teams will run. Perfect your rosters with individual player ratings and a slew of appearance options, down to what kind of socks a player wears! DEEP SEASON MODE Season Mode lets you take the reins of a single team and guide them through the rigors of a full year, featuring sortable player stats, league leaders, weekly awards, custom lineups, and the ability to play, sim, or coach any game on the schedule. With support for custom league and schedule options, you'll have total control to create an unforgettable season! DYNAMIC WEATHER &amp; TIME OF DAY Experience the beauty and fury of mother nature with fully dynamic weather and time of day! Pouring rain turns grass to mud, howling winds blow kicks into uprights, and thickening fog limits visibility as day turns into night. When the mercury plunges, green fields transform into winter wonderlands, leaving players to trudge their way through white-out snow conditions. Ice bowl, anyone? HEADHUNTER Lead your favorite team through a 4 game, single-elimination tournament while racking up points using a fantasy football-style scoring system. As you battle increasingly challenging opponents towards victory, your stats are tracked and saved, along with 8 additional scoring bonuses tuned for maximum performance! After the game, check to see if the fruits of your hard fought victory are good enough to be enshrined in the record books and celebrated for years to come. ADDITIONAL FEATURES Exhibition Mode - play a game against the AI or versus a friend with a second controller AI vs AI - call plays in from the sideline or kick back and enjoy the game Custom Skill Level - tune sliders to find the perfect balance for your play style Variable League Sizes - choose from 8, 16, 24, or 32 teams to build your dream league Streamlined Playbooks - pick from 9 offense &amp; 5 defense playbooks to power your team Team Strategy - define the tendencies for each team that best utilize their roster Quick Games - no penalties and an accelerated game clock keeps the game moving",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1297790/header.jpg?t=1652708802",
    "Price": 19.99,
    "Developers": "26k",
    "Publishers": "26k",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_41e5abb64f6c5a9b449147c63306e45806a6f1d8.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_ff2e3e0a27c4e38b4a74a61f33eec314b545a064.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_9727e4ff12a0aa515bb1b05d4aac3448f693d9ed.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_7fdfcbbd34f5fe0273ab4f81091161b169f4965c.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_b18116f7c5f4ce467128bee34a94ad01b92c8c38.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_7180f6c504caf8cf6fb34f2cfe99172e77557411.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_c21ddb468741b97264aa5dc8bc8e122d0a7fcea3.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_544e25e70be875fb1cd204cd26561a39882deca6.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_be5a312de95f136204606a739b2298a7f2846741.1920x1080.jpg?t=1652708802,https://cdn.akamai.steamstatic.com/steam/apps/1297790/ss_ddb3936428bcd1ff4e6a3d5a906b3d170af959ab.1920x1080.jpg?t=1652708802",
    "Slug": "sunday-rivals",
    "Meta Title": "Sunday Rivals: May 16, 2022, 26k and Full Overview",
    "Meta Description": "Looking for information on Sunday Rivals? Check out the release date (May 16, 2022), developer insights from 26k, and a complete game summary.",
    "Alt Text Image": "Official header image for Sunday Rivals game - Steam 1297790",
    "Canonical URL": "https://gusku.site/game/sunday-rivals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sunday Rivals\", \"description\": \"Looking for information on Sunday Rivals? Check out the release date (May 16, 2022), developer insights from 26k, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"26k\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"26k\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1297790/header.jpg?t=1652708802\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}