{
    "AppID": 1020450,
    "Name": "There Will Be Ink",
    "Release date": "Sep 6, 2019",
    "About the game": "'Way more nuanced than it looks.' - local multiplayer games (Steam curator) There Will Be Ink is a difficult tactical action game for 1-8 players. Play solo or with friends in battles between stick figure armies on a paper notepad, just like you used to draw in class instead of paying attention! TWBI is a difficult game, where charging forward into the fray will rarely win a battle. Tactical thinking is essential. Assessing the battlefield, taking cover as needed, keeping an eye on troop positions: all of these are essential for winning the day. Or, if that sounds like a chore, switch to 'Arcade Mode' and run &amp; gun at will! Tactical Depth Although the theme and visuals might suggest otherwise, there is a lot of depth underlying these doodles. As units gain experience and level up during a battle, they become progressively more proficient at battle and will go prone to evade danger, hide behind cover when attacking, and dodge incoming rockets. Ranking up also increases various other attributes, such as stamina, ammo capacity, weapon accuracy, and even how quickly a unit will raise or lower a flag to take over a building. Actions such as running, rolling, and throwing grenades take stamina, and if a unit’s stamina runs out they become exhausted and must wait a short period to catch their breath. Outside of battle, the player can use experience points earned during battle to unlock unit-specific and global training and weapon upgrades as well as HQ abilities like ammo drops, paratroopers, and air strikes. Mission Variety While some missions see you attack the enemy head on, others involve building up a base using engineers, rescuing prisoners behind enemy lines using a lone sniper, fighting against your own defecting forces, traditional 'boss' fights, and even battling it out at sea (upcoming). In addition to the built-in campaign missions (39 and counting), There Will Be Ink includes a map editor to design your own battlefields from scrap as well as a campaign editor to string missions together into a full fledged campaign. Or, if you're not feeling creative, be sure to check out the 'Quick Battle' option, which allows you to choose a few variables using sliders and toggles and then jump into a random map. Persistent Battlefield In There Will Be Ink, the history of any given battle is retained by the craters, shells, and red ink spilled on the battlefield, while end-of-battle stats are there to give you a more numerical analysis of the battle. Play With Friends Play with or against up to 7 friends in local multiplayer (or with a few friends online using Steam Remote Play Together). A team can play through a whole campaign together or just a quick battle or player-designed map. In campaign missions that were previously won, players can join the enemy team for an extra challenge (or not!). In addition to end-of-battle stats for players to compare, badges are presented to players for such feats as the most kills, longest streak, most deaths avenged, and many more (including less brag-worthy badges like most deaths and most medics killed).  Game Features: Fast-paced action gameplay with a focus on cover Take control of any friendly unit on the battlefield Play through nearly 40 missions (and counting) across three campaigns Jump into a quick battle with the random map generator, with sliders and toggles for troops &amp; buildings, trees, debris, and rivers Unlock new recruit types as you play, including rifle infantry, assault infantry, snipers, medics, RPG troops, heavy machine gunners, engineers, laser jetpack troops, and flamethrowers, why not! Full featured map editor – lay out a battlefield and jump straight into the action Campaign Editor - string missions together into a campaign to play with your friends Enjoy hundreds of frames of (poorly but enthusiastically) hand-drawn art! Join a battle in progress for 8 player local co-op or vs. gameplay Online multiplayer using Steam's Remote Play Together Navigate dynamic battlefields by wading across rivers and taking cover behind trees, rocks, sandbags, and craters left behind in the chaos T-Rex with jetpacks! Compensate for weather effects like rain, wind, and smoke rising from burning buildings and trees Earn training credits, even when a battle is lost, to assign new abilities to your troops There Will Be Ink is a work in progress, so please send all constructive feedback and bug reports to hi@summitfevergames.com . Thanks!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1020450/header.jpg?t=1633613832",
    "Price": 6.99,
    "Developers": "Summit Fever",
    "Publishers": "Summit Fever",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1020450/ss_61e1ad518da2c88d2a884ca2d140e835bb2539ec.1920x1080.jpg?t=1633613832,https://cdn.akamai.steamstatic.com/steam/apps/1020450/ss_c36fc29eaea071adf889c6da01cad3dd7eeaee51.1920x1080.jpg?t=1633613832,https://cdn.akamai.steamstatic.com/steam/apps/1020450/ss_9f7cdffbce41a8da941c6a785f7dc3688c691e53.1920x1080.jpg?t=1633613832,https://cdn.akamai.steamstatic.com/steam/apps/1020450/ss_f27887c7b9e0fab93c9310b33a965aedc4ee307d.1920x1080.jpg?t=1633613832,https://cdn.akamai.steamstatic.com/steam/apps/1020450/ss_13d3b7e2862496a9ce3e7fd60d6afe7576f42695.1920x1080.jpg?t=1633613832",
    "Slug": "there-will-be-ink",
    "Meta Title": "There Will Be Ink: Sep 6, 2019, Summit Fever and Full Ove...",
    "Meta Description": "Looking for information on There Will Be Ink? Check out the release date (Sep 6, 2019), developer insights from Summit Fever, and a complete game summary.",
    "Alt Text Image": "Official header image for There Will Be Ink game - Steam 1020450",
    "Canonical URL": "https://gusku.site/game/there-will-be-ink",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"There Will Be Ink\", \"description\": \"Looking for information on There Will Be Ink? Check out the release date (Sep 6, 2019), developer insights from Summit Fever, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Summit Fever\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Summit Fever\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1020450/header.jpg?t=1633613832\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}