{
    "AppID": 521350,
    "Name": "Use Your Words",
    "Release date": "Apr 3, 2017",
    "About the game": "Grab a few friends and get ready to laugh—Use Your Words is the party game for funny people and their unfunny friends! Use Your Words is a game that invites players to respond to a variety of mini-games and prompts with the funniest answers they can think of! We tee up the jokes and you fill in the punchlines. Players can use their phones or tablets as controllers, making game-play seamless and quick to pick up. Players who get stumped can use one of the sneaky 'House Answers' to lay a trap for their fellow players once it's time for everyone to vote for their favorite. Whether you're a total novice or a world-famous comedian, we guarantee hours of non-stop hilarity. So, grab a few friends and get ready to laugh along with Use Your Words! For 3-6 local players (and up to 1,000 spectators)! Use your smartphone as your controller! Mini-Games Use Your Words ships with 4 unique mini-games: Sub The Title : Watch a short clip from a foreign film, then write your own subtitle! Fans of Mystery Science Theater 3000 will love making the actors onscreen say whatever they want in a variety of monster movies, martial arts movies, and some just plain weird films from the past. Blank-o-Matic : Fill in the blank to complete the sentence! Instead of waiting to have the funniest card in your hand, write an answer that matches your sense of humor! We've hired some of the funniest writers around to set up the jokes perfectly so that even Grandpa can crack off a zinger or two. EXTRA, EXTRA! : Write a hilarious caption or clickbait headline for a ridiculous photo, in a take on the classic 'caption this' game! Survey Says : Go with your gut in this rapid-fire game show style 'lightning round'! Features 4 hilarious mini-games with tons of content! Support for all HTML5-enabled devices! 'Family Mode' to filter out adult or otherwise controversial prompts! A classy vintage soundtrack with songs by legendary composer Bob Thompson! Hours and hours of playable content with more to come! Up to 1000 spectators will be able to watch and vote for their favorite answers! Note : This game is played locally, but remote players can play via stream or video conference. Note : all included content is in English only. Some trailer footage represents earlier phases of development.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/521350/header.jpg?t=1581680767",
    "Price": 14.99,
    "Developers": "Smiling Buddha Games, LLC",
    "Publishers": "Screenwave Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_7a30ecdeb5e970a265cc662526cb365b72b05e36.1920x1080.jpg?t=1581680767,https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_0b54b60c3b769c87fc9c87feffe59a4b50bf225f.1920x1080.jpg?t=1581680767,https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_2fe974e6d0017260d7ff2be4ecbbc0b553d063c4.1920x1080.jpg?t=1581680767,https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_fbf376bc027d0f4dfa763bc253bf93b8461efbd1.1920x1080.jpg?t=1581680767,https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_2eddc900fbe181e85f2e06ee8707223f39df5a5f.1920x1080.jpg?t=1581680767,https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_69e2113eac1d22591e65c1c7426833f09dfc35f5.1920x1080.jpg?t=1581680767,https://cdn.akamai.steamstatic.com/steam/apps/521350/ss_4458088c514ba675328dcd34ce8958d182bd8dec.1920x1080.jpg?t=1581680767",
    "Slug": "use-your-words",
    "Meta Title": "Use Your Words: Apr 3, 2017, Smiling Buddha Games, LLC an...",
    "Meta Description": "Looking for information on Use Your Words? Check out the release date (Apr 3, 2017), developer insights from Smiling Buddha Games, LLC, and a complete g...",
    "Alt Text Image": "Official header image for Use Your Words game - Steam 521350",
    "Canonical URL": "https://gusku.site/game/use-your-words",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Use Your Words\", \"description\": \"Looking for information on Use Your Words? Check out the release date (Apr 3, 2017), developer insights from Smiling Buddha Games, LLC, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Smiling Buddha Games, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Screenwave Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/521350/header.jpg?t=1581680767\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}