{
    "AppID": 444930,
    "Name": "Zaccaria Pinball",
    "Release date": "Jun 16, 2016",
    "About the game": "Zaccaria was founded by three brothers (Marino, Franco, &amp; Natale) and was the 3rd largest manufacturer of pinball machines in the world (behind Bally &amp; Williams). They had created and produced more than 35 different pinball machines between 1974 and 1987. FEATURES VR Support (needs to purchase VR DLC). Multiplayer mode to play with your friends online, just like in the classic arcade hall. Time Machine table is playable totally free. All other pinball tables are in trial mode that means there is a score limit. High detailed Zaccaria pinball tables. Original table rules, sound effects and vocals. Breathtaking light and shadow effects. Very accurate and customizable physics and ball movements. Different game modes such as Arcade, Simulation and Custom. Custom game mode allows you to tweak pinball physics and table settings the way you like! Camera Editor to customize 4 camera views for your own taste or select from 3 standard camera views. FREE TO PLAY The free to play version offers you the following FREE contents: Time Machine is a completely free table. Time Machine Retro table can be unlocked by joining the Zaccaria Pinball community page. All other tables have a score limit and can be played until the player reaches the set score limit of the table, this can be repeated unlimited times. Story Mode. Commander Jack: The Last Defense On Earth. CUSTOMIZATION FEATURES Purchase of Bronze Pack DLC is needed to unlock all customization features. Zaccaria Pinball has tones of awesome customization features which affect to graphics and physics aspects of the game. As well as there is a camera editor. Graphics Tweaks: Room Light, Metal FX, Particle FX, Dynamic Light, Reflection FX, Glow FX, Motion Blur, Lightmap, Colors Physics Tweaks: Flipper Size, Playfield Tilt, Flipper Force, Ball Elasticity, Ball Friction, Slingshot Force, Bumper Force, Ball Velocity, Plunger Force, Flipper Tap Pass VR SUPPORT VR support is available for those players only who purchased VR DLC. SOLID-STATE (SS) PINBALL TABLES Time Machine (free table!), Devil Riders, Locomotion, Pinball Champ '82, Pinball Champ, Farfalla, Blackbelt, Robot, Hot Wheels, Soccer Kings, Shooting the Rapids, Star God, Magic Castle, Earth Wind Fire, Clown, Future World, Fire Mountain, Space Shuttle, Winter Sports, Zankor, Pool Champion, Mexico '86, House of Diamonds, Mystic Star, Spooky, Star's Phoenix, Strike ELECTRO-MECHANICAL (EM) PINBALL TABLES Aerobatics, Circus, Combat, Moon Flight, Lucky Fruit, Universe, Supersonic, Cine Star, Wood's Queen, Nautilus, Red Show, Tropical, Granada, Top Hand REMAKE PINBALL TABLES Shooting the Rapids 2016, Space Shuttle 2016, Combat 2016, Cicrus 2017, Earth Wind Fire 2017, House of Diamonds 2017, Spooky 2017, Farfalla 2017, Magic Castle 2017, Hot Wheels 2017, Zankor 2017, Locomotion 2018, Robot 2018, Pinball Champ 2018, Blackbelt 2018, Winter Sports 2018, Future World 2018, Nautilus 2018, Star's Phoenix 2018, Pool Champion 2018, Clown 2019, Devil Riders 2019, Fire Mountain 2019, Tropical 2019, Wood's Queen 2019, Time Machine 2019, Star God 2019 DELUXE PINBALL TABLES Red Show Deluxe, Cine Star Deluxe, Spooky Deluxe, Strike Deluxe, Universe Deluxe, Pool Champion Deluxe, House of Diamonds Deluxe, Robot Deluxe, Combat Deluxe, Farfalla Deluxe, Space Shuttle Deluxe, Zankor Deluxe RETRO PINBALL TABLES Retro tables can be unlocked by purchased of Solid-State or Electro-Mechanical pinball table with the same name. Time Machine Retro, Locomotion Retro, Devil Riders Retro, Pinball Champ Retro, Shooting the Rapids Retro, Farfalla Retro, Hot Wheels Retro, Space Shuttle Retro, Circus Retro, Combat Retro, House of Diamonds Retro, Earth Wind Fire Retro, Robot Retro, Blackbelt Retro, Soccer Kings Retro, Star God Retro, Magic Castle Retro, Clown Retro, Fire Mountain Retro, Nautilus Retro, Mexico '86 Retro, Zankor Retro, Mystic Star Retro, Aerobatics Retro, Supersonic Retro, Universe Retro, Spooky Retro AWARD PINBALL TABLES Award tables can be unlocked by completion of achievements or purchase 'Achievement Table Pack' DLC. The Mummy, Aliens, Hippie, Fire Fighter, Speed King, Beast Master, Voyager, Wizard, Zombie, Caveman OTHER PINBALL TABLES Time Machine Retro - Join to Zaccaria Pinball Community Hub Wizard - Completion of Campaign Mode",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/444930/header.jpg?t=1640086699",
    "Price": 0.0,
    "Developers": "Magic Pixel Kft.",
    "Publishers": "Magic Pixel Kft.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_763e91d6896be288c9cb89c7c8bd0125bfb1c85f.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_46eb3ef5ba324cafcf38ee5b951de01c6a0ef4cf.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_6861c8bef4da2574ffcdd01e0347ab86a86edad7.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_0a8996ca61e4a8a63223da102aeddcb67b5813a0.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_b763521d2c7446b6afe89be1ee2c9088fc6f00bc.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_27f54d584b15e46909885e8430ead1b5ef05e845.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_61c21623faa397010fe3af9bff810abf201b58fb.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_09396872d654c41c02ec27cd35ffe7c544831eca.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_5e2ffb3f21c55726ee53d6ea955107a0e3e26e7b.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_bf4da4cf5edca47c347761c1b341b76a27754cb9.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_7ba590c610573d1bd96f5d60bfc09d312b815b9e.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_7383132ebfa18c7dafe4607935b42cc45d7f023a.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_c6d545f6f605a6ab56b0e6866ceb63ad96cf19ed.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_9a46862162a91b4e6da2b1083297b60d366e7ae8.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_9addd9a33f8b273e7d908350c2c575a1e760e9b8.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_42124f66780f9443a736b83846454ecd744f957d.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_918dff537c7f531eb4049bffdf4c3b8301f07e2f.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_ccd80d67292bbe90b6fdef6d0e7a9fa80e1fc572.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_fcfe3e786dc2e53c35ac30b554e04fd4def5d0e7.1920x1080.jpg?t=1640086699,https://cdn.akamai.steamstatic.com/steam/apps/444930/ss_6a01b9882878a4f9c52ed9db6b1d029eec8f77a1.1920x1080.jpg?t=1640086699",
    "Slug": "zaccaria-pinball",
    "Meta Title": "Zaccaria Pinball: Jun 16, 2016, Magic Pixel Kft. and Full...",
    "Meta Description": "Looking for information on Zaccaria Pinball? Check out the release date (Jun 16, 2016), developer insights from Magic Pixel Kft., and a complete game su...",
    "Alt Text Image": "Official header image for Zaccaria Pinball game - Steam 444930",
    "Canonical URL": "https://gusku.site/game/zaccaria-pinball",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zaccaria Pinball\", \"description\": \"Looking for information on Zaccaria Pinball? Check out the release date (Jun 16, 2016), developer insights from Magic Pixel Kft., and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Magic Pixel Kft.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Magic Pixel Kft.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/444930/header.jpg?t=1640086699\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}