{
    "AppID": 445220,
    "Name": "Avorion",
    "Release date": "Mar 9, 2020",
    "About the game": "Several hundred years ago, a cataclysmic catastrophe nearly ripped your galaxy apart - an impassable ring of torn hyperspace fabric appeared in the center of the galaxy, which normal hyperspace engines can’t overcome. Since this Event nobody has managed to get near the central regions of the galaxy. All you know is that the Event also spawned multiple untraversable hyperspace rifts throughout the entire galaxy and that a strange race of aliens, the Xsotan, has appeared in the center. It looks like these aliens have found a way to cross over the torn hyperspace fabric, but so far nobody has managed to establish contact with them. There are also rumors about a strange new metal called ‘Avorion’ which has appeared in the center of the galaxy around the same time as the Xsotan have arrived. Apparently, the aliens use this material to build their ships. Start out as a nobody at the edge and work your way to the center of a galaxy that gets more dangerous, but also more rewarding the closer you get to its core. Avorion takes sandbox aspects from games like X or Freelancer, throws in co-op multiplayer and lets you build your own ships. It features ships made of freely scalable blocks that can be procedurally generated and that break into pieces where they're hit in space fights. Equip your ship with chainguns, lasers and other weaponry to take on your enemies and enjoy the sight of completely destructible ships breaking at the exact points where you hit them. Defend your allies from pirates, hunt down enemies for coin or even participate in wars between entire factions. Once you’re victorious, collect loot from defeated foes which you can use to upgrade your ship: new turrets with special abilities like autofire or repair beams, or system upgrades that allow you to install even more weapons. Build hangars and command squads of fighters in your battles or destroy enemy freighters to steal their cargo. Fly through beautiful nebulas and dense asteroid fields in search of hidden treasures and meet the many factions that populate and control their portion of the galaxy. Each faction has its own characteristics, such as peaceful, intelligent or aggressive, and its ships and stations have a distinct look. Explore the galaxy at your own pace to find valuable goods in old ship wrecks, undiscovered asteroid fields rich in resources, gigantic asteroids which you can claim for yourself, or clues about what happened during the Event a few centuries back. There are no limits to the size or complexity of your ship besides your resources. But there is also a creative mode where you can just build to your heart’s content. You're not bound to the standard voxel style and while building an awesome ship in Avorion you won't get lost in lots and lots of micro-management. You can focus on building a great-looking ship, without having to worry about making it work. But always keep an eye on your ship’s maneuverability and energy requirements. Adjust your ship perfectly to its operational purpose: everything from light and agile explorers to heavily armored battleships with strong shields. And why build only one ship? Hire captains to fly your ships for you, manage your crews, weapons, hangars and fighters and build your own fleet of spaceships! Extend your ship with a cargo bay, find profitable deals and haul over a hundred trading goods across the galaxy to make a profit and buy your way up the food chain. Constructing a fleet of specialized transport ships with lots of cargo space will help you build up a trading corporation. Extend your influence in the galaxy by founding asteroid mines and factories that attract NPC traders who will buy and sell their goods at your establishments. Install trading systems that detect trading routes and supply and demand over multiple sectors and become the richest commander in the galaxy! Or maybe you're sick of being the good guy? Just raid freighters, smuggle illegal goods, or become a headhunter. You don't have to face all of these challenges alone! Avorion features co-op multiplayer, so team up with your friends to build stations together and destroy pirates and enemy factions! Everybody needs a copilot, and you can fly ships together, with one of you doing the steering and the other one taking care of firing weapons. Work with each other to extend your influence in the galaxy and build your own empire. Or, you know, blow your friends apart. It's a sandbox, you can do whatever you want! In Avorion you choose your personal playstyle. Haul cargo, find profitable trading routes and found factories. Or maybe you're sick of being the good guy? Build your own battleship, equip it with powerful weaponry and blow away your enemies. Be the aggressor that starts wars with entire factions, raid freighters, smuggle illegal goods and scavenge old wreckages. Find your way to the center of a galaxy that gets more hostile, but also more rewarding the closer you get to its core.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/445220/header.jpg?t=1631020795",
    "Price": 24.99,
    "Developers": "Boxelware",
    "Publishers": "Boxelware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_3e6fb8ae3e9e13ac20a34aa3f28d2e91a2207679.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_a2e2654fd01488ec9995201cdc9baff7954ac36e.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_c193c0313144967725034c8f9ba4d378dd801e77.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_42821076c3b7478a114b383b5e1e52e78bb15333.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_f7177b73cdf9ed8164ddffaebbfd317f8d9b1942.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_5648321300793677cb7132127c61ee2e909fee3b.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_9c2f12765f8fdea87f71846960512a87c41a0f68.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_5ecd07c695f48055606ab68b82bd16f3ef4b40a6.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_48874ceeffa872d33721b5ef81fb038c32211da6.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_af99bd25cd70590fc9d94e05f80adf19191a5f4b.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_438c8425670c6bd8edd405f31cd041d9bd957e88.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_1b0266203533e6c1df2c9c086145ecf2fa7c1cc8.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_7b23e7e126d0863c3d046262432eefb3ccb2632a.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_3574f1ec21e6a718e791d23d2c5b8cd08641ba4c.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_972ee087e4861bcc933050bc6f7eb23b416cb34f.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_a8267185ece3ef3271103d12b18e8c65f79410fc.1920x1080.jpg?t=1631020795,https://cdn.akamai.steamstatic.com/steam/apps/445220/ss_05d171264666d591f7350cef80b8b9b9a578e105.1920x1080.jpg?t=1631020795",
    "Slug": "avorion",
    "Meta Title": "Avorion: Mar 9, 2020, Boxelware and Full Overview",
    "Meta Description": "Looking for information on Avorion? Check out the release date (Mar 9, 2020), developer insights from Boxelware, and a complete game summary.",
    "Alt Text Image": "Official header image for Avorion game - Steam 445220",
    "Canonical URL": "https://gusku.site/game/avorion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Avorion\", \"description\": \"Looking for information on Avorion? Check out the release date (Mar 9, 2020), developer insights from Boxelware, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Boxelware\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Boxelware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/445220/header.jpg?t=1631020795\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}