{
    "AppID": 1282080,
    "Name": "Chang'an: The capital of Tang Dynasty",
    "Release date": "May 13, 2021",
    "About the game": "Build the real Chang'an city in history 'Chang'an the capital of Tang Dynasty' is a city building game made by myself. Players will come back to the Tang Dynasty of China in 8th century AD, and build the Chang'an city in an 1:1 ratio gameplay map. From the entire city arrangement to each small Dou Gong in the building, the game design is based on deep research work. I spend years in researching history, culture and architecture of Tang Dynasty and actually travel to Xi'an(which Chang'an is called now). During the game play, you can create your buildings in each 'Fang'(A large square zone that premade by the city), unlock famous wonders like the Great Wild Goose Pagoda, the Qujiang Lake when you reach a certain milestone, and even build the imperial palaces as the bonus content. A game play map of 81.3 square kilometers. Different from other city building games, 'Chang'an the capital of Tang Dynasty' is more focus on the 'Authenticity'. The gameplay map is the same scale of the city in the reality. which means a 83.1 square kilometers play map. From camera control to game UI, many efforts has been made to streamline the gameplay in such a huge map, but when you build the great city in the 1:1 ratio map, the unique experience will worth them all. Historical sites reconstructed in the map. Although players can create buildings of residences, commerce and public facilities, in the game map there are still many architectures stand as doodads. Most of them do not actually effect the gameplay, but they contribute to the theme that most important 'Build the real Chang'an city in history'. For example, there are numerous city gates in the capital, Someones are huge and famous like Dan Feng gate, Zhu Que gate, while other smaller ones like Chun Ming gate, Guang Hua gate. Their appearances, positions are referenced by academic materials. 3 imperial palaces in Chang'an. There are 3 imperial palaces in Chang'an: The Da Ming Palace, the Tai Ji Palace and the Xing Qing Palace, I spend much time in their reconstruction, especially the Da Ming Palace, which still stands its ruin in a historical park. For the Da Ming Palace, there are plenty of pictures and even 3D models for me to reference, and the Da Ming Palace is the most satisfying part of all reconstructions in the game. ------------------------------- Developer Note 2020.9.30 ------------------------------- Version 0.70 In the first released version, all main functions are implemented and tested. There will be new features and streamlines in the future updates. Current Features Implemeted: 1. The core buildings: Residences of comme peoples and nobles, Business zones and the according resource system, including gold(common residence), labor(business zone) and knowledge(nobles). 2. Public building, facilities: Water supply Facilities, gardens to upgrade core buildings. Public buildings to enhence the production of core buildings. 3. Milestone system and world wonder buildings As milestone bonus, when players archieve certain goals, there will be wonder building unlocked, like Greate Wild Goose Pagoda. 4. Palace System There is an resource called 'Authority', which is consumed by the population, so players need gain more Authority when the city is growing. One of the method is by building palace. These palace buildings are strictly referenced by the archaeology research. 5. Poet and Painting collection By increasing the noble population, you will gain cards of great poets and painting, put them into the equipment slot will gain special bonus.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1282080/header.jpg?t=1622174493",
    "Price": 9.99,
    "Developers": "Romulus",
    "Publishers": "Romulus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_4cd3a780f9563c4f51d0e05e5cf55f85ded9666b.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_df73f96678c71ca86c5b3ed7fedd80358d4c1f3a.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_316814a01dbfc3092051812e88e014e017362939.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_5019fca358b5891c570b32b3cd8ea78a46dee154.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_e9e9f5af256983640a3f214c04d582d355f18dd6.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_1ecf373c0061f4fa63337ba4358532e2a59c48e3.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_91a51874c5aea44767bc8ec576875df3b6f3adf5.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_6ee318fdd3a9c06d042fdd5273c70b268a9f4a5d.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_2e547475b1c81f49fd2877a6060995b7dea9ad86.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_57479ade3f464e05268213f956e3bd933aef4cf3.1920x1080.jpg?t=1622174493,https://cdn.akamai.steamstatic.com/steam/apps/1282080/ss_df3631fd7d8f32dc0873221054482775962c0b82.1920x1080.jpg?t=1622174493",
    "Slug": "chang-an-the-capital-of-tang-dynasty",
    "Meta Title": "Chang'an: The capital of Tang Dynasty: May 13, 2021, Romu...",
    "Meta Description": "Looking for information on Chang'an: The capital of Tang Dynasty? Check out the release date (May 13, 2021), developer insights from Romulus, and a comp...",
    "Alt Text Image": "Official header image for Chang'an: The capital of Tang Dynasty game - Steam 1282080",
    "Canonical URL": "https://gusku.site/game/chang-an-the-capital-of-tang-dynasty",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chang'an: The capital of Tang Dynasty\", \"description\": \"Looking for information on Chang'an: The capital of Tang Dynasty? Check out the release date (May 13, 2021), developer insights from Romulus, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Romulus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Romulus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1282080/header.jpg?t=1622174493\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}