{
    "AppID": 1097130,
    "Name": "Circuit Superstars",
    "Release date": "Oct 12, 2021",
    "About the game": "CIRCUIT SUPERSTARS is a top-down racer built by racing fans, for racing fans. The game celebrates generations of multi-disciplinary motorsport, focusing on driving that feels great – but with a high skill ceiling, that will have players spending hours honing their perfect lap. Starting out is simple but learning the nuances of each car’s handling and finding the best racing line through each corner of each track will be a challenge for a long time to come. Not only that, but with the option of fuel usage, tire degradation and racing damage, even a good pit stop strategy could make the difference between hero and zero. Feel the rubber bite into the road as you pass the start/finish line and dive, brakes squealing, into the first corner! Feel the tires meet the road Tactile handling model that lets you feel the tires bite into the asphalt. Celebrating Motorsport Race vehicles across multiple motorsport disciplines including Rallycross, Open wheel single seaters, SuperTrucks, GT racing, Eurotrucks and many more. Pit Stop Strategies Featuring tire degradation, fuel consumption, and damage, Circuit Superstars challenges you to dynamically choose your pit stop strategy during the race. Online Multiplayer &amp; Custom Lobbies Dive into specially curated online multiplayer races of up to 12 players from around the globe. Create your own tournaments and play online with friends! Top Gear Time Attack Take on a different kind of challenge with the special Top Gear Leaderboard – this time using the Circuit Superstars’ recreation of the world-famous Top Gear Test Track! Go up against drivers from a whole range of real-life motorsport series' as well as top eSports stars and see if you can beat them. Race against ghosts of the drivers' actual best laps, and look great while doing so with the special Stig costume! A motorsport playground We continue to add features that further expand the possibilities for fun in Circuit Superstars. Weekly Time Trials Every hundredth of a second counts! Challenge your friends and the rest of the world in regularly updated Time Trials events. Grand Prix Master all disciplines by conquering each of the single player tournaments designed for all 12 categories. Always a worthy rival Compete against 5 different AI difficulties to challenge you on your path to mastery on the world of Circuit Superstars. Free Play Mode Create your own race events or tournaments and play vs AI or with your friends in local multiplayer. The Garage Customize your cars and driver with liveries, helmets and victory celebrations you unlock as you level up! Ready Your Engines! 12 vehicles to choose from, each with their own unique handling models. I Ain’t Afraid of No Ghost Global ghosts let you see how players around the world are tackling each track, including the celebrity drivers from Top Gear x Circuit Superstars Star in a Reasonably Fast Car Invitational 2021! Location Location Location Race in 32 tracks across 15 vibrant locations. Race Replays Replays let you re-watch your races to see your epic overtakes or study your racing lines and those of your opponents. Built by Motor racing fans, for Motor Racing Fans A lifetime of racing experience inspired the developers to build the racing world of Circuit Superstars. The developers grew up on the pitlane, the paddock and the racetrack, living and loving the entirety of motorsport.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1097130/header.jpg?t=1653783720",
    "Price": 19.99,
    "Developers": "Original Fire Games",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_ec0e448f6eb9a47966f22bf08b5236c71fc64685.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_4cbd6add1bd45c31cc53c6abf0630081a0490ba0.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_8cc0d24b16a5cf7e1fef589a22291c28be61ed07.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_b7316e719589403a0efaac1db4cace8af48de4d4.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_a83d617cdbba13309827e941f58ea7f9bcfbbfb5.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_4d59a933b869d08ab5a9db5e040b2df1b9a92d2d.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_a162aa0242ffcf55d2e7f2c5bdf04df771ea2b4b.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_2d91dbd80930b56d9da0e30082dead022a535413.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_f9e590112ea49d78cde16bdd9d998fa6626852c5.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_e24a0fa45f601451d5ee93bb3950164eb6c89ca0.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_ac26b00385f1bf886d0120c053d06248885ca332.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_f88517f47241d1b5321cfce01f2cae9c1e6ca7c0.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_ea6260822102bd6d379d976c3ec9fd8964c46d53.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_732093bc88b3c5bcb374541d60c2c5b8a572a072.1920x1080.jpg?t=1653783720,https://cdn.akamai.steamstatic.com/steam/apps/1097130/ss_cda1e44254024775f57bc5d1e920cefb4904f91f.1920x1080.jpg?t=1653783720",
    "Slug": "circuit-superstars",
    "Meta Title": "Circuit Superstars: Oct 12, 2021, Original Fire Games and...",
    "Meta Description": "Looking for information on Circuit Superstars? Check out the release date (Oct 12, 2021), developer insights from Original Fire Games, and a complete ga...",
    "Alt Text Image": "Official header image for Circuit Superstars game - Steam 1097130",
    "Canonical URL": "https://gusku.site/game/circuit-superstars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Circuit Superstars\", \"description\": \"Looking for information on Circuit Superstars? Check out the release date (Oct 12, 2021), developer insights from Original Fire Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Original Fire Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1097130/header.jpg?t=1653783720\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}