{
    "AppID": 720270,
    "Name": "Defense Task Force - Sci Fi Tower Defense",
    "Release date": "Jun 19, 2018",
    "About the game": "Defense Task Force is an infinite waves tower defense game for PC. Featuring Large Scale Procedurally Generated Tower Defense Battles with FPS Quality Visuals. 10 tower types with different attack behaviours, each with 3 upgrade levels, plus many levels of boosts. 25 species of enemy alien units plus 3 which are spawned by other enemy alien units. Enemy alien classes include Regular Units, Swarmers, Racers, Cloakers, Healers, Boss Units and Spawners. Your role as commander is to defend the platform that's built to harvest energy and power Earth. You can defend by strategically building fortification towers to defend the harvesting platforms against aliens called Kraken. As commander it's upto you how you use your resources against the Kraken. Check it out before buying Before purchasing the game we recommend checking out the following gameplay video to get a good idea about the game. Game Overview The game is staged on a beautifully rendered planet with dynamic procedurally generated scenery. Many elements of the game including the enemy waves are generated procedurally offering a unique experience each game. Rather than a single master solution to each game level there are a whole multitude of possibilities. Instead of a linear 20 mission campaign, each mission is in part designed by the players choice of planet region, sector, and game level layout. Additionally a tech research tree provides an opportunity for the player to develop even more strategies as they progress through the game. Defense Task Force features 25 different types of enemy units versus 10 types of towers deployed by the player. Each tower features completely different attack behaviors, 3 upgrade levels and individual attribute boosts. The player needs to invest their rewards from winning each game level into researching a deep technology tree to unlock these before they may be used in game. The choice of which technology to research has a direct impact on the strategy options available to the player. Great care is being taken with respect to game balancing such that there is no single super tower. The attack behavior of the ten tower types are both different and complementary to each other. Once each mission is won you may proceed to the next mission or continue and try survive as many waves as you can. Game Features Large Scale Procedurally Generated Tower Defense Battles with FPS Quality Visuals. The main storyline features a campaign of 20 missions which would provide at minimum 15 hours of gameplay. The campaign structure is significant non linear aspects which make each level replayable in multiple different ways. The enemy waves are procedural generated with randomness for infinite mode gameplay of never ending waves. Additionally when playing the same mission a second time the wave composition will be different. The waves are composed of a total of 25 different types of alien enemy units plus 3 additional units which are spawned by other units. Each type of unit has differences based on speed, hit points, shield, strengths/weaknesses against tower types and special abilities providing for a large multitude of strategies to beat the players towers. The game features dynamic environments based on: procedurally generated background terrain and weather. Additionally the game level itself is based on a combination of environment and player selected game level layout (blueprint). These combinations provide very high replayability and variability of the same mission. The campaign is divided into 5 regions each containing 4 sectors to create a total of 20 missions. However the game level layout of each mission is dependent on the blueprint (energy mining platform) which the player researches and deploys for the mission. Ten types of towers are provided each with 3 upgrade levels. Additionally the third level tower can have its individual attributes such as rotation speed, damage, etc... upgraded individually. All of these upgrades must first be researched in a deep skills tree before they can be used in the game. Each tower type has a unique attack profile allowing the player to build a very wide variety of tower combinations. No tower is superior to others and to win the player must use a range of towers. Skills, unlock and research tree. The player uses energy gained from winning missions for both unlocking and researching. For the missions each region and sector must be unlocked before they can be played. Each blueprint (game level layout) must be researched before it can be deployed. Each skill such as global skills as well as tower upgrades must be researched before they are available in game. System Requirements Absolute Minimum Lowest Spec for lowest graphics quality at 1280 x 720 Laptop Video Card: NVidia GTX 620m / AMD Radeon 5570 Video Card Memory (VRAM): 1GB or better CPU: Dual Core I3 CPU 2.4 GHZ or better Ram: 4GB or more Note: With this spec launching the game with anything higher than lowest graphics quality will most likely crash the game. Framerate may drop on large blueprints due to the minimum CPU spec Minimum Spec for low quality at 1920 x 1080 resolution or medium or high graphics quality at 1280 x 720 resolution Video Card: NVidia GTX 650 / AMD Radeon HD 5830 Video Card Memory (VRAM): 1GB or better CPU: Dual Core I3 CPU 2.4 GHZ or better Ram: 4GB or more Note: Framerate may drop on large blueprints due to the minimum CPU spec Recommended spec for high graphics at 1920 x 1080 resolution Video Card: NVidia GTX 680 / AMD Radeon HD 7970 Video Card Memory (VRAM): 2GB or better CPU: Quad Core I5 CPU 3.0 GHZ or better Ram: 6GB or more This system specifications should comfortably support high graphics quality. Enthusiast spec for 60 FPS at highest quality graphics with full 4K resolution of 3840 x 2160 Video Card: NVidia GTX 980 / NVidia GTX 1080 Video Card Memory (VRAM): 4GB / 8GB CPU: Skylake Quad Core I7 CPU 3.0 GHZ / AMD Ryzen or better Ram: 6GB or more THE TEAM Defense Task Force is made by an indie team of 2 best friends plus 1 developer. As a team we have bootstrapped this project to bring this game alive and will continue to extend the game keeping it fresh and entertaining to our players. We hope to raise the bar in the Tower Defense Genre.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/720270/header.jpg?t=1562923279",
    "Price": 2.99,
    "Developers": "ChillX Ltd",
    "Publishers": "ChillX Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_761762662fd5448f1bf3df206ae5c0037a3bd79a.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_3f2b3e831b46d47b0dc99aad44db7ce91428ab2c.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_d7a17d8eb7f504d793f2a06d6e84874dc9a0cf0d.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_26dc730703a3528690392f67de30c1fdaeb9c79c.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_40075fed99680b6245a1ace4f0b1fe43af3fa8cb.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_eb17a7965a66593aa406900943aef52ce3815d41.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_f7ede808f0fe0af648d5a2f98c1a0112fd22cb3d.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_83558f91ee54d8d043d85d3d142def566c48781e.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_77c87adcff396d05470fe03cbe7fad55711927eb.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_a6cf4d873cff04b1455f2e08618be3f055ae05b6.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_851371756694af78acb72929f9d6ff4b93369570.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_930a2db14c3285a9ceec72ddc2a823a1c58b4d37.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_75b2bc1add15e4dc25efffad47698482e1b77ed5.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_d77f0664a4ae1c0bca45ebe89634104b22a038c1.1920x1080.jpg?t=1562923279,https://cdn.akamai.steamstatic.com/steam/apps/720270/ss_c11e2be390011b8f6901d3f54b27c2c3214b1d92.1920x1080.jpg?t=1562923279",
    "Slug": "defense-task-force-sci-fi-tower-defense",
    "Meta Title": "Defense Task Force - Sci Fi Tower Defense: Jun 19, 2018, ...",
    "Meta Description": "Looking for information on Defense Task Force - Sci Fi Tower Defense? Check out the release date (Jun 19, 2018), developer insights from ChillX Ltd, and...",
    "Alt Text Image": "Official header image for Defense Task Force - Sci Fi Tower Defense game - Steam 720270",
    "Canonical URL": "https://gusku.site/game/defense-task-force-sci-fi-tower-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Defense Task Force - Sci Fi Tower Defense\", \"description\": \"Looking for information on Defense Task Force - Sci Fi Tower Defense? Check out the release date (Jun 19, 2018), developer insights from ChillX Ltd, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ChillX Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ChillX Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/720270/header.jpg?t=1562923279\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}