{
    "AppID": 1070550,
    "Name": "Don't Escape Trilogy",
    "Release date": "Jul 29, 2019",
    "About the game": "From the creator of Don't Escape: 4 Days to Survive comes the original games that started it all. Don't Escape Trilogy contains all three of scriptwelder's original point-and-click horror adventures, compiled and preserved for Steam. Each small game within the anthology is a unique, standalone adventure that puts clever twists on every setting and format. PLEASE NOTE: These games do not contain any new content from their original versions. In Don't Escape , players find themselves in a remote cabin overlooking a tiny village. Before night falls, you'll need to find a way to effectively secure yourself inside the cabin, using everything at your disposal, in order to protect the townsfolk from yourself. Because when the full moon rises, you're not your best self... In Don't Escape 2 , you and your friend have barely suvived the undead ravaging your town, and must find a way to fortify the place you've holed up in before nightfall. Only problem is, the clock is ticking as you scour the surrounding countryside for supplies, and your friend isn't looking so great... In Don't Escape 3 , you awaken onboard a silent spaceship that holds a gruesome discovery. Without your memories, you need to find a way back home while unraveling the mystery of what happened to you and the crew, but are you really as alone as you think you are? Offering the top-notch atmosphere scriptwelder has become known for and creative puzzles and situations for you to overcome using logical problem solving skills, often with different solutions, the Don't Escape Trilogy is the perfect way to spend an evening with the lights turned down and the volume turned up. About the Developer: Poland-based developer Scriptwelder is a well known creator of creepy web-based games, perhaps the most iconic of which is the Deep Sleep series, which has won multiple awards and been played by millions all around the world. The Don't Escape series began as a web game in 2013 that inverted the classic escape-the-room formula... rather than trying to find a way out, players were instead trying to find a way to secure themselves within, usually from some sort of threat or danger. He recently released Don't Escape: 4 Days to Survive, his first full length premium game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1070550/header.jpg?t=1569518303",
    "Price": 4.99,
    "Developers": "scriptwelder",
    "Publishers": "Armor Games Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1070550/ss_d169e0f16f6c6be4fb4033b859b298ff1e8ed3d7.1920x1080.jpg?t=1569518303,https://cdn.akamai.steamstatic.com/steam/apps/1070550/ss_3e0681d158152150a282ef13d4bfd91155e1d294.1920x1080.jpg?t=1569518303,https://cdn.akamai.steamstatic.com/steam/apps/1070550/ss_612a5b0ada230859135909401430da6afb96e72f.1920x1080.jpg?t=1569518303,https://cdn.akamai.steamstatic.com/steam/apps/1070550/ss_58c265d009eae5c0e469fb7ab2b27a49e4d7ec5a.1920x1080.jpg?t=1569518303,https://cdn.akamai.steamstatic.com/steam/apps/1070550/ss_5a8d03e4b5e5778c383bca45a11b913c44b93acb.1920x1080.jpg?t=1569518303,https://cdn.akamai.steamstatic.com/steam/apps/1070550/ss_f1027289100f24ff6bd0e4b7bce2436502e6307b.1920x1080.jpg?t=1569518303",
    "Slug": "don-t-escape-trilogy",
    "Meta Title": "Don't Escape Trilogy: Jul 29, 2019, scriptwelder and Full...",
    "Meta Description": "Looking for information on Don't Escape Trilogy? Check out the release date (Jul 29, 2019), developer insights from scriptwelder, and a complete game su...",
    "Alt Text Image": "Official header image for Don't Escape Trilogy game - Steam 1070550",
    "Canonical URL": "https://gusku.site/game/don-t-escape-trilogy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Don't Escape Trilogy\", \"description\": \"Looking for information on Don't Escape Trilogy? Check out the release date (Jul 29, 2019), developer insights from scriptwelder, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"scriptwelder\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Armor Games Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1070550/header.jpg?t=1569518303\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}