{
    "AppID": 314330,
    "Name": "DROD: Gunthro and the Epic Blunder",
    "Release date": "Sep 23, 2016",
    "About the game": "'Deadly Rooms of Death' (DROD) is a turn-based strategy and tactics puzzle game series. It is a 2D top-down puzzle adventure that focuses on pure gameplay mechanics, best described succinctly as 'chess in a Zelda-like environment.' The DROD series began over a decade ago and has enthralled thousands of players. Swordplay and puzzles combine in this thinking man's dungeon crawl. It's simple to learn, with just a handful of commands to master. This game's rogue-like exterior belies clever puzzle design and unique play mechanics that provide amazing depth. Each room is a hand-crafted puzzle that you solve by clearing out all the monsters with your Really Big Sword without letting any reach and kill you. Monster types each have their own AI, with deterministic movement patterns. Puzzle elements and terrain types help and hinder you in solving each puzzle. You start by learning basic mechanics and fighting techniques, and then the difficulty steadily ramps up as each room you face presents a fresh challenge with a logical solution. This game features a novel play style, with story- and puzzle-driven voiced dialogue delivered inline with hardcore puzzle solving that involves a mix of strategy, tactics, lateral thinking and linchpins. As developers, our goal is to present you with a novel experience where game mechanics are paramount. DROD will give you that 'just one more room' feeling. This game is the entry-point title in the ongoing DROD franchise. 'Gunthro' is designed as an beginner-level offering to the DROD world, with both new players and veterans in mind. The level layout is has multiple hub areas to explore as you progress. The game starts easy, has a smooth learning curve and an integrated online hints system. You should be pleased by the puzzle designs that went into this game, making for a delightful blend of fun and challenge. A level editor and enthusiastic player community make this a game you can relish for years. Main game features Over 300 puzzle rooms across 25 levels, each organized around different combinations of puzzle elements. All-new enhanced version of the 'Gunthro and the Epic Blunder' campaign! Over 25,000 usermade rooms available for download! Dozens of secret areas and optional extra challenge levels that lie in store for the more curious and adventuresome, uncovered in a variety of ways. Varied elements and monster types like rock golems, giant serpents, wraithwings, and evil eyes, each with a distinctive AI behavior and requiring different strategies and tactics to conquer. Hours of contextual music composed by synthpop artist Jon Sonnenberg of Travelogue. New and upgraded in-game artwork, including three all-new terrain styles, with real-time lighting and a range of environmental effects. Full-featured level/campaign editor, with custom scripting engine and modding capabilities Active and friendly player community Hi-score competition and hints system via our CaravelNet service The story: In this game, Beethro Budkin recounts an epic tale of adventure to his precocious nephews about his grandfather, Gunthro Budkin, and his exploits in the dangerous nation of Rasarus. Gunthro is a third-generation smitemaster and a rather ugly man. Smitemasters are hard-bitten, muscled veteran dungeon exterminators that slay hideous beasties in dark places for a living. You know Gunthro will get the job done, and you'll happily pay him to clear your basement of giant man-eating dungeon roaches. When the Rasarun king is slain by an officer of Tueno, Gunthro is recruited by Rasarus to defend his country and reclaim its honor. However, as Gunthro searches deeper, he will find that things are not quite as they seem. Experience the unique turn-based puzzle dungeon adventure of DROD! Deluxe Bundle: Contains: DROD: Gunthro and the Epic Blunder DROD OST: Deadly Music of Death, Volumes 1 and 2",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/314330/header.jpg?t=1646782770",
    "Price": 9.99,
    "Developers": "Caravel Games",
    "Publishers": "Caravel Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_bd773186df264acec8110cfeb43c09e4db2b1412.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_c8c808b02b3f0fc5c8fe6102d63cb8737aa5517e.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_d15c5d813a70d3e23c9684ca14bfafd4ba0cb121.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_a7b071ca592e6371b4bacaa596fddd8965dcf460.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_644f77030c6424ab5b1888fb0c259a51845f2641.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_8ce4efb6199a459c82b1a31a6b08d147fb443ac2.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_baf937d794d1da79031241705b1af351fbc71d99.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_ce139c5276355108b5b6810557abddb02037308a.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_0be25470c39ffb04ffe6418dfdcd8161dc767f3d.1920x1080.jpg?t=1646782770,https://cdn.akamai.steamstatic.com/steam/apps/314330/ss_793af41151b9ad2180f1adb862c72971f9dab10d.1920x1080.jpg?t=1646782770",
    "Slug": "drod-gunthro-and-the-epic-blunder",
    "Meta Title": "DROD: Gunthro and the Epic Blunder: Sep 23, 2016, Caravel...",
    "Meta Description": "Looking for information on DROD: Gunthro and the Epic Blunder? Check out the release date (Sep 23, 2016), developer insights from Caravel Games, and a c...",
    "Alt Text Image": "Official header image for DROD: Gunthro and the Epic Blunder game - Steam 314330",
    "Canonical URL": "https://gusku.site/game/drod-gunthro-and-the-epic-blunder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DROD: Gunthro and the Epic Blunder\", \"description\": \"Looking for information on DROD: Gunthro and the Epic Blunder? Check out the release date (Sep 23, 2016), developer insights from Caravel Games, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 23, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Caravel Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Caravel Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/314330/header.jpg?t=1646782770\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}