{
    "AppID": 1273120,
    "Name": "Eira: Echoes of Adventure",
    "Release date": "May 8, 2020",
    "About the game": "Eira always felt destined for greatness. Grandchild to the greatest treasure hunter in the clan, Eira grew up as a star apprentice. But when out on a dangerous intergalactic hunt for a renowned vault, Eira’s grandfather never returned. Years have passed since, and the clan has all but given up hope of his return—but not Eira. After discovering a potential clue indicating their grandpa’s whereabouts, Eira embarks on a journey to a frozen planet in hopes of finding him. Eira: Echoes of Adventure is a casual adventure game where you play as Eira and trace your grandfather’s footsteps to journey through an icy world filled with curious alien wildlife, spatial puzzles, and hoards of treasure. Use your powerful GalactiVac to terraform the frozen landscape in a sandbox abundant with riches and valuable gems. Rebuild a path through the broken world to follow the dangerous journey your grandfather once took. Track down the remnants of blueprints to upgrade your GalactiVac, unlocking new passages full of treasures and secrets to explore in every region. Will you be able to solve the mystery of your grandpa’s disappearance? Key Features Terraformable Terrain Use your powerful GalactiVac to terraform the frozen landscape. Build with snow to reach new heights. Melt ice to find what secrets have been frozen in the world. Repairable Structures Find resources throughout levels to repair ladders, bridges, and more. Everything you repair gives you rewards that can go toward upgrading your GalactiVac. Spatial Puzzles Explore different levels to find puzzles leading to secrets. Every level in the game is littered with spaces to explore and treasure to find. Curious Alien Wildlife Alien wildlife is bouncing around this planet trying to eat up enough fish-fruit to stay happy and full. Use the wildlife to your advantage to explore the planet and discover new secrets. Hoards of Treasure If you have a treasure finding itch you need to scratch, we’ve got you covered. There are tons of treasure chests hidden throughout the planet. Can you find them all? The Development Team We are a group of students who area passionate about making games. Eira: Echoes of Adventure began as a senior capstone project at Champlain College in August 2019. We are all very excited to showcase this game on Steam for free so people can enjoy the experience we created! We hope this game becomes an example of what students can create and to encourage people to make games of their own.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1273120/header.jpg?t=1588953604",
    "Price": 0.0,
    "Developers": "No Scope Studios",
    "Publishers": "No Scope Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1273120/ss_3c4b7cd6af6a373060aa8a671ac43395f880c223.1920x1080.jpg?t=1588953604,https://cdn.akamai.steamstatic.com/steam/apps/1273120/ss_5d449027c884ef513930eb2a21ac0e40951a2770.1920x1080.jpg?t=1588953604,https://cdn.akamai.steamstatic.com/steam/apps/1273120/ss_56c87a9eaacb1b7b12a50c31a7c6ff10cd181dd8.1920x1080.jpg?t=1588953604,https://cdn.akamai.steamstatic.com/steam/apps/1273120/ss_238d31c7ac2303200d739c99df8b2ae484d56dc1.1920x1080.jpg?t=1588953604,https://cdn.akamai.steamstatic.com/steam/apps/1273120/ss_b35aa1fc26f7d38f3dd6adcf0ba64f3e75fc1341.1920x1080.jpg?t=1588953604",
    "Slug": "eira-echoes-of-adventure",
    "Meta Title": "Eira: Echoes of Adventure: May 8, 2020, No Scope Studios ...",
    "Meta Description": "Looking for information on Eira: Echoes of Adventure? Check out the release date (May 8, 2020), developer insights from No Scope Studios, and a complete...",
    "Alt Text Image": "Official header image for Eira: Echoes of Adventure game - Steam 1273120",
    "Canonical URL": "https://gusku.site/game/eira-echoes-of-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eira: Echoes of Adventure\", \"description\": \"Looking for information on Eira: Echoes of Adventure? Check out the release date (May 8, 2020), developer insights from No Scope Studios, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"No Scope Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"No Scope Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1273120/header.jpg?t=1588953604\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}