{
    "AppID": 416600,
    "Name": "Full Metal Furies",
    "Release date": "Jan 17, 2018",
    "About the game": "From the creators of Rogue Legacy comes a 'true-cooperative' action RPG. FULL METAL FURIES puts an emphasis on team play with a unique combat system where everyone is important. Work together to defeat special enemies, string organics combos to deal massive damage, and save a wartorn world that is battling itself to extinction. Play on the couch or online with friends, and make it a party for up to four players! Or go solo in single-player, and show off your skills through a Pick 2 quick-switch system that retains all the nuances of multi-play. GAME FEATURES Want to play with friends? Get friends first. Up to 4 players can join in on the adventure, both ONLINE and OFFLINE . Full couch and on-line co-op supported, and every variation in between. Want to play alone? Expected. The Pick 2 system lets you choose two party members to enter the battlefield. Use the Quick-Switching to create dynamic combos, and air-crit enemies. All nuances of co-op are retained. Everything you do in multiplayer, you can do alone. There’s no I in Team. And there’s no I in Full Metal... Furees. True coordination is needed to take down your foes. Enemies enter the battlefield with coloured barriers , and only allies of a similar colour can shatter them. You must revive your fallen allies. Barriers won’t break themselves! Revive bars naturally raise over time, but a helping hand never hurts. Cooperation, not competition. No more fighting for last hits, battling for gold, or trolling for health drops. Everything is shared, so you can focus on working together. Four classes, four different styles of play. Alex the Friendly Fighter – Engages up close with counters and combos. Meg the Near-sighted Sniper – Plant mines, shoot from afar, and juggle your enemies. Triss the Boxy Tank – Save allies with your shield, or send enemies flying. Erin the Ovally Engineer – Control the battlefield with her turrets. She also has a gun! A new take on combat. Experiment with a combat system full of counters, combos, and oval-shaped engineers. Every class has their own unique skill tree. How many skills? So many skills! Don’t change equipment, change abilities. Give the Tank a FREEZING SHOUT . Turn the Fighter’s Leap into a POWER DIVE. Or just give the Engineer a machine gun. A new take on enemies. The Furies are tough, but the enemies are tougher. Encounter over 70 different enemies , each with their own unique tells and counters. No more cannon fodder! Enemies come at you at a furious pace, and there’s no rest for the weary. New threats are introduced in every single stage you play. Battle massive Titans in multi-phasic matches that will keep you on your toes. An adventure full of intrigue, twists, and one liners. Travel through the ruined snow-capped town of Thessaly, brave your way through the Foloi Forest, enter the tombs of the Stygian Well, and more. But keep an eye out; there’s more to the world than what is on the surface. Secrets, clues, and hidden dimensions are scattered throughout! Discover a story spanning over 20,000 words in 8 different languages. Discover 20,000 one liners. Addendum An abstruse allegorical action adventure about atonement, allusions, and alliteration awaits all at an alternate age around Athens’ ashes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/416600/header.jpg?t=1651149477",
    "Price": 19.99,
    "Developers": "Cellar Door Games",
    "Publishers": "Cellar Door Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_baf330dc08a5d0e8206c1d691b9950056123c5ff.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_b7e4fea11a44f1122e8b8153f3134bfa724d6e87.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_9249a968da318c2ca0325512673377429227d645.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_04f49a913535f019213478ddc62005b99cd0f9d3.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_1af98df8c7c6fbb79cb4429d4855aca9212d2ee4.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_96242741a0ddb3f5f311c686d9dcbf78202756a7.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_443b7294eeec38f7506df22bb36df94d61fbcc72.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_1a7e33cb7e19f21226660fe1f7b95e646b7fcb91.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_c6b28dfcf7b219f110f3ee3ccdd0e8af441a03c7.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_4e711c96b8bae72e3adde0426de11eb77609114b.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_e392396baf75f95e5aba8347909525b5b1208043.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_d3b4e454cc0393ea42ac8f3959416297d5dc35f3.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_ee5cfac7458b5110744f2dbcf08df6fc16ccfbbb.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_011d025ebca4a0da853f67439de1f080d0f0f3eb.1920x1080.jpg?t=1651149477,https://cdn.akamai.steamstatic.com/steam/apps/416600/ss_a5b85c2c31df5488f67da99fe83ec6716e427db0.1920x1080.jpg?t=1651149477",
    "Slug": "full-metal-furies",
    "Meta Title": "Full Metal Furies: Jan 17, 2018, Cellar Door Games and Fu...",
    "Meta Description": "Looking for information on Full Metal Furies? Check out the release date (Jan 17, 2018), developer insights from Cellar Door Games, and a complete game ...",
    "Alt Text Image": "Official header image for Full Metal Furies game - Steam 416600",
    "Canonical URL": "https://gusku.site/game/full-metal-furies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Full Metal Furies\", \"description\": \"Looking for information on Full Metal Furies? Check out the release date (Jan 17, 2018), developer insights from Cellar Door Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cellar Door Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cellar Door Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/416600/header.jpg?t=1651149477\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}