{
    "AppID": 1303660,
    "Name": "Geometric Sniper",
    "Release date": "Dec 17, 2020",
    "About the game": "When taking the mission, pay attention to the photo and information obtained by secret agents about your target. As a Sniper, you need to have a good memory to find and eliminate the target in the crowd before it runs away and makes another victim. Immerse yourself in Andrew's story and feel the pressure of being a sniper. In lively and varied environments, designed exclusively for this fantastic game, you will not have a second chance, precision is everything! - Game Details: After troubled events, Andrew reflects on the direction of his life and the consequences of his career. His senior officers had planned a 'rest' time for Andrew, but he was assigned to a secret division where he will have to carry out missions for the good of his country and deal with the ghosts of his past. Game Modes: In all game modes the locations of targets and objects are random, so you can have a lot more fun! In living environments designed exclusively for this game, put yourself to the test in 12 missions, one more challenging than the other. Experience the pressure of being a sniper. Every detail counts, from carefully observing the mission information to finding the perfect shot opportunity. Every second will make the difference between life and death! Sharpen your precision even more! Have fun in this game mode where you have to find objects scattered around the scenarios and hit them. How fast and accurate are you able to shoot? This mode is enabled when you finish the adventure mode, in it you will have to complete the 12 missions again, but without the aid of Zoom and the precision to stabilize the aim along with this mode a new ranking is also enabled. Who will remain at the top of the Sniper Elite?[/list] – Ranking Who will remain at the top? Who will be the fastest and most accurate Sniper? These questions will be answered here! There will be ranking for adventure and elite mode. Killing innocents in the game will result in major rank points lost, causing your ranking to drop, so be accurate and hit the correct target! - Steam Community: We would like to see your funniest moments during the game. We love to see those moments! We encourage you to take screenshots and post them in our community. Be sure to tell us what you think of the game. We are a small studio and your feedback is very important to provide excellent moments of fun for you! Feel free to do a review, it will help us a lot!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1303660/header.jpg?t=1655575849",
    "Price": 1.99,
    "Developers": "YAW Studios",
    "Publishers": "YAW Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1303660/ss_287edf145f690a438bd7f2d3bf7928d27beb0ca8.1920x1080.jpg?t=1655575849,https://cdn.akamai.steamstatic.com/steam/apps/1303660/ss_17f5fd09d55df8c7949daaa996b0db977011eb21.1920x1080.jpg?t=1655575849,https://cdn.akamai.steamstatic.com/steam/apps/1303660/ss_09a49b0c78e7b3f6199d969b69904f36efc3f57e.1920x1080.jpg?t=1655575849,https://cdn.akamai.steamstatic.com/steam/apps/1303660/ss_3ea8f24dccfe3e39e8414a78c2534f9af4177a66.1920x1080.jpg?t=1655575849,https://cdn.akamai.steamstatic.com/steam/apps/1303660/ss_35aeb9b3b286764ed90b404073b272bb485bc82f.1920x1080.jpg?t=1655575849",
    "Slug": "geometric-sniper",
    "Meta Title": "Geometric Sniper: Dec 17, 2020, YAW Studios and Full Over...",
    "Meta Description": "Looking for information on Geometric Sniper? Check out the release date (Dec 17, 2020), developer insights from YAW Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Geometric Sniper game - Steam 1303660",
    "Canonical URL": "https://gusku.site/game/geometric-sniper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Geometric Sniper\", \"description\": \"Looking for information on Geometric Sniper? Check out the release date (Dec 17, 2020), developer insights from YAW Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"YAW Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YAW Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1303660/header.jpg?t=1655575849\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}