{
    "AppID": 1667100,
    "Name": "Hardpunch: Fuck 4Joy",
    "Release date": "Oct 4, 2021",
    "About the game": "An incredible organic android is created by a mysterious engineer with the mission to discover and hunt technological artifacts created before our civilization existed. However, the true motivations of the engineer hide hidden secrets. Such a mystery is marked by resentment, obsession, and lust. THE CONTEXT A dangerous military scientist obsessed with his dead wife decides to recreate her in a laboratory. However, that decision will destroy the world. An apocalyptic wind destroys 90% of the population, leaving the rest obsessed with sex. Only Sonya, but known as Hardpunch can survive in this world. It absorbs energy when having sex. The survivors of this world worship a goddess called 'Venus'. In fact, Venus is one of the clones of the mad colonel's wife. The colonel is actually an immortal. In the past, his wife was murdered by a demon. The colonel goes crazy and spends his whole life rebuilding his wife. Without knowing it, it creates a lethal virus with extreme sexual appetite. Harpunch becomes the only hope in this subversive world. As a clone, she can survive the violent sexual libido of the source of pleasure. That fountain is still alive thanks to the mad colonel. A Venus-worshiping sect created beings known as Spoils. These creatures produce strong sexual energy when they have sex. They are not dangerous. They practically have sex or masturbate constantly. The problem is the mutants that protect the spoils. Mecazombies, also known as carcasses. Sonya Rubra was one of the clones who managed to escape the colonel's laboratory. This happened during the cataclysm that destroyed almost the entire human race. Such a cataclysm turned the remaining humanity into freaks. In this world, there are no children because reproduction does not exist. Only explicit sex. Hardpunch found that she could become the host of Venus if she absorbs as much energy as she can with spoils. THE MISSION In the future, the last clone manages to transport itself to the past in order to destroy the dangerous engineer before the virus is created and spread across the world. This new version has the characteristics of Venus. However, the transfer was mental, unlike the other quantum leaps that were performed previously. Then, Venus' soul occupies the body of one of the most formidable clones developed by the engineer. The EML model. Also known as 'indestructible lady'. The player explores an open world in the first person. It is necessary to survive until the end. In other words, find the portal of triumph and cross it to transport yourself to a new world. During this challenge, it is important to collect items of all types (health, stamina, bladed weapons, etc.). There are no firearms in this future. Practically the weapons available are swords, knives, and shields. After all, there are spoils. Dying humans are kept on platforms in order to provide energy. Whoever has the power to absorb through sex is supplied in these places. However, there will always be a creature protecting these posts. The main objective is to obtain enough sexual energy to activate the powerful Alive-Bomb that is hidden in the last level of the game. This machine could become the only hope for this world lost to nuclear cataclysm. Playing is extremely easy because you can use your computer's keyboard and mouse or you can choose a joystick. This game is for PC Windows and is not heavy to play. The interface offers a lot of gameplay information. In addition, you can count on the help of a complete inventory.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1667100/header.jpg?t=1633815627",
    "Price": 14.99,
    "Developers": "Orgipix Prod,Ojoy Studios",
    "Publishers": "Orgiflix Club,Orgipix Prod",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_86a525fbc6ea7ee511537f45314adc1182886736.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_5973d2be8f4210fd042130651d68aca191510efd.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_05ea75bad686adcd89877e93ef409a4afc198fb6.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_648702ad17dc482217f63764dcef7fce2e028e87.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_53fb11b6dd00f9b11a338a35be019e89bbcd5a13.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_335bd0e5dc61d1d7e2909012a5d98eacca15f47c.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_27a9cf6cb161b5e5ba9de039874739d950c5ce0d.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_2d0f9ecff0165f57c322783caaaffcd99e0ade57.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_f5bc18ad6c7315620358c2af022f3e2b2e4db867.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_a4596905496b112d2575e10bba9c39d5400469e3.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_47e45b3faa219c22d3f2b4c13e93e3e6ae72fcbe.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_58d7ca0c464502eba0a75e47140bebcb4e4e5ee4.1920x1080.jpg?t=1633815627,https://cdn.akamai.steamstatic.com/steam/apps/1667100/ss_7a439a1ee994a9a5d31bc03fa695e5c5021b40e7.1920x1080.jpg?t=1633815627",
    "Slug": "hardpunch-fuck-4joy",
    "Meta Title": "Hardpunch: Fuck 4Joy: Oct 4, 2021, Orgipix Prod,Ojoy Stud...",
    "Meta Description": "Looking for information on Hardpunch: Fuck 4Joy? Check out the release date (Oct 4, 2021), developer insights from Orgipix Prod,Ojoy Studios, and a comp...",
    "Alt Text Image": "Official header image for Hardpunch: Fuck 4Joy game - Steam 1667100",
    "Canonical URL": "https://gusku.site/game/hardpunch-fuck-4joy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hardpunch: Fuck 4Joy\", \"description\": \"Looking for information on Hardpunch: Fuck 4Joy? Check out the release date (Oct 4, 2021), developer insights from Orgipix Prod,Ojoy Studios, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Orgipix Prod,Ojoy Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Orgiflix Club,Orgipix Prod\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1667100/header.jpg?t=1633815627\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}