{
    "AppID": 1386950,
    "Name": "Heavy Metal Babes",
    "Release date": "Dec 21, 2020",
    "About the game": "In a not so distant future, humanity has reached the very edges of the galaxy. Perfect genetically improved clones of the most beautiful women on Earth are now used in combat and exploration missions. With the unique ability to synchronize and control powerful robots, they are the ultimate AI companions. But recently, Earth has lost communication with one of its colonies: a planet called X-69, inhabited exclusively by XEN units. Your mission is to discover what happened there, fix the issue and re-establish communication with the lost planet. To do that, you will join your AI companions on a crazy adventure that will have you go deep into planet exploration, battling corrupted XEN units and defeating powerful enemies. Fact and features Unlock hot animations with all of your sexy companions and create a dream harem with the most beautiful girls in the galaxy! Group Sex H-Scenes Incredible group H-scenes where you will see your girls having a lot of FUN! Engage in spicy chats with all of your girls...AT THE SAME TIME! Collect all of their naughty photos and unleash your wildest fantasies! Amazing Storyline Travel through space with a ship full of HOT girls dying to get your attention! Chat with girls and make them yours Choose your words wisely and make your girls wet! High-quality animations with lots of sexy girls who just want to show how you HORNY they are! Unlock crazy hentai sex scenes beyond your wildest dreams! Challenge other players Compete against other players and prove that your girls are the strongest and the sexiest! Show that you are the best commander by training your sex partners and making it to the top of the league! Powerful abilities Build your dream team, put your horny girls to the task and defeat all the enemies standing in your way! Make your girls go wild and unleash powerful attacks! XEN Labs Challenge Fight your way through increasingly difficult challenges, satisfy your girls and reach the top to claim your prizes! As you will win more and more battles, you will be able to upgrade your character, unlock a map, and even partake in some side games to switch things up a little. Close your eyes for a second, and allow yourself to be transported by the music; the jazzy tunes that play in the main frame will set the mood for you to make the most of everything, *wink wink*. But once your squad is assembled and ready for battle, the high-octane action music will definitely drive your will to victory. And, of course, this game wouldn’t be complete without a super villain; enters the Dark Goddess, your steaming and evil nemesis. So sit tight, buckle up for the ride, and get on board, sexy thing; it’s time for heavy metal!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1386950/header.jpg?t=1649236446",
    "Price": 0.0,
    "Developers": "SexyArts Games",
    "Publishers": "Nutaku Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_f93cc8ea4f97a629df956c6aa563b491c3e34a12.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_86d10e11c29ebd7f4944c3779eb471715b84a989.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_50e14b879253dda722336eaed3a5134adf9a9f67.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_8b16a73d6186cc7669003e26dd9f1c898851649c.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_bfe506ba37433b174e7a9dcccb4beb14ff674759.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_4fd3647c271605cf48e5efff4c1cc0d4f37bf3c4.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_77c0c2e8637e6ec2da00f36cd435f9f7cbd46a9e.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_a8c020aeba536cf5ee6965eb0f9b68501532b7ae.1920x1080.jpg?t=1649236446,https://cdn.akamai.steamstatic.com/steam/apps/1386950/ss_5fab2c6720246b6a737bddca034570488f51118e.1920x1080.jpg?t=1649236446",
    "Slug": "heavy-metal-babes",
    "Meta Title": "Heavy Metal Babes: Dec 21, 2020, SexyArts Games and Full ...",
    "Meta Description": "Looking for information on Heavy Metal Babes? Check out the release date (Dec 21, 2020), developer insights from SexyArts Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Heavy Metal Babes game - Steam 1386950",
    "Canonical URL": "https://gusku.site/game/heavy-metal-babes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heavy Metal Babes\", \"description\": \"Looking for information on Heavy Metal Babes? Check out the release date (Dec 21, 2020), developer insights from SexyArts Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"SexyArts Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nutaku Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1386950/header.jpg?t=1649236446\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}