{
    "AppID": 1239900,
    "Name": "Infection Point",
    "Release date": "Mar 21, 2020",
    "About the game": "Infection Point is a quarter view Hack and slash zombie hunting game. [Summary] A gas leak occurred in the city. When the city was paralyzed, the army gave orders to the main character. The order calls for searching the skyscraper where the accident began. The main character goes to his destination, killing a lot of zombies with his team. And the main character arrives at the skyscraper, which reads 'The One,' and the story begins. [System] The game consists of two modes. Story mode, Defense mode Story mode is the way to play the main story. After viewing the end of story mode, you can restart the game with the character in the auto save slot by pressing 'Resume' in the main menu. Defense mode is a challenge mode. Defense mode can be played by choosing the save file you want. If you Clear the round 7 or 9 you get the special gun. In this mode, you can get Exp and money. No other content is save. (Upgraded items in defense mode are not saved in the save file.) [item Upgrade] Weapons and accessories are upgradeable. You have to use money to upgrade your weapons. The way to make money is to get items in the game and recycle them. After '5 Class', you can press the 'Tap' key to fire a special bullet. Accessory upgrades should use the same type of accessories. Up to four accessories are available as an upgrade material. The higher the class of accessories used as an upgrade material, the higher the probability of the upgrade. [character] Characters have two ways of raising statistics and choosing 'IDENTITY'. The way to raise statistics is simple. If the level is raised, a certain point can be obtained. You can use that point to raise statistics. IDENTITY is given a point of 10. Select four of the seven characteristics in total. Then assign points to each characteristic. It is possible to invest 3 points per characteristic and takes 12 points to film all 4 features. However, only 10 points are given, so you have to choose the points allocation well. [Battle] A game is a way to kill an enemy using a gun. In an emergency, dodge skills (rolls, jumps) can be used to invalidate enemy attacks. You can use a grenade to give your enemy a stun. Dark areas can be lit using flashlight.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1239900/header.jpg?t=1584785507",
    "Price": 13.99,
    "Developers": "JHEMGame",
    "Publishers": "JHEMGame",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1239900/ss_635d1f888b022565a8feabc334473e0fd59b5cde.1920x1080.jpg?t=1584785507,https://cdn.akamai.steamstatic.com/steam/apps/1239900/ss_44ccb87a616c8c3a78a7abe87dbb0bfb961c0aa2.1920x1080.jpg?t=1584785507,https://cdn.akamai.steamstatic.com/steam/apps/1239900/ss_ee89a5759e78ba4181af238001eb7f9cffeea7d2.1920x1080.jpg?t=1584785507,https://cdn.akamai.steamstatic.com/steam/apps/1239900/ss_80aa796b7b4a08369d89457a596499779c3d6b6e.1920x1080.jpg?t=1584785507,https://cdn.akamai.steamstatic.com/steam/apps/1239900/ss_e07a7c60ca67db2ca867a5e5f7138da95277b37a.1920x1080.jpg?t=1584785507",
    "Slug": "infection-point",
    "Meta Title": "Infection Point: Mar 21, 2020, JHEMGame and Full Overview",
    "Meta Description": "Looking for information on Infection Point? Check out the release date (Mar 21, 2020), developer insights from JHEMGame, and a complete game summary.",
    "Alt Text Image": "Official header image for Infection Point game - Steam 1239900",
    "Canonical URL": "https://gusku.site/game/infection-point",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Infection Point\", \"description\": \"Looking for information on Infection Point? Check out the release date (Mar 21, 2020), developer insights from JHEMGame, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"JHEMGame\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JHEMGame\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1239900/header.jpg?t=1584785507\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}