{
    "AppID": 697550,
    "Name": "It Lurks Below",
    "Release date": "May 29, 2019",
    "About the game": "It Lurks Below is a retro-styled, 2D, action-oriented, survival RPG by David Brevik. Create a custom character and choose from several different classes to delve deep into the mysteries of what evil lurks below. Dig down and explore the randomly generated levels, find random items, and combat deadly monsters to get the answers. Though this game looks similar to other games in the genre, it plays very differently. It is a true RPG, with many stats and character classes. It is very reminiscent of other games made by David Brevik such as Diablo, Diablo II, Hellgate: London and Marvel Heroes. With eight character classes to choose from, randomly generated levels, random stats on items, secret areas, bosses, a survival talent tree and three different play modes, it delivers a very different and unique gaming experience. Are you ready to find out what Lurks Below? CREATE YOUR CHARACTER Bard (melee) - Wield the power of song and screaming to best your foes in battle. With trusty sword and shield and specializing in passive area effect damage and buffs, the bard is a force of nature in the battle field. ⠀⠀ Cleric (melee + ranged) - Come prepared for battle with heavy armor and plenty of healing power. Choose to fight with a mace and shield or a ranged wand. The cleric is the only class who is given this choice. Paired with its high survive-ability, it is the class that will outlive all others. ⠀⠀ Enchanter (ranged) - Stun and lightning are the enchanters tools of choice. What better way to avoid damage than stopping enemies in their tracks. If that wasn't enough, the enchanter can wield the power of illusion and turn into a wisp and fly away. ⠀⠀ Necromancer (ranged) - Wielding the skulls of the dead as undead minions, marks the necromancer as the games resident pet class. Pair this with powerful poison and cold damage and self buffs, means the necromancer is an undead friendly powerhouse. ⠀⠀ Paladin (melee) - Dashing into combat wielding a powerful two handed sword or hammer makes the paladin one of the most formidable melee characters in the game. Consecrating the ground, area effect purification and damage are just a few of the tools this powerful holy warrior brings to the table. ⠀⠀ Rogue (melee) - Slip past enemies by hiding in the shadows and then when the moment is right, stab them with the rogue's powerful dual wielding daggers. ⠀⠀ Warrior (melee) - Decide between defensive stance and offensive stance; both make the warrior an incredible beast in battle. While defensive stance focuses on survive-ability and offensive stance focuses on damage, both are incredibly satisfying, especially combined with the warriors whirlwind ability. ⠀⠀ Wizard (ranged) - Harnessing the power of the elements through powerful area affect spells make the wizard an unstoppable elemental force. Their spell set is rounded out with a drake companion and teleport. ⠀⠀⠀ CHOOSE YOUR GAME STYLE ⠀⠀ Creative - Enjoy all the game has to offer in more relaxed setting. No need to worry about survival mechanics, though still have the benefit of the survival tree. Many of the recipes and building supplies are already unlocked, which makes it much easier to languish in the joy of building and farming the whole surface. With no invasions to worry about, the only monsters that will be encountered are below in the dungeon. Descent - Same difficulty as Survival, just without the survival aspect. For anyone interested in just thrashing monsters and getting all the loot. No survival tree, no hunger, and no fatigue. Survival - This is the original game design mode. Not that this makes the other modes any less valid, but most of the game is designed with Survival Mode in mind. This includes all the bells and whistles of surviving and the survival tree, paired with difficult dungeon challenges and plenty of invasions. Hardcore - Both Survival and Descent have a hardcore option. This doesn't change anything about the particular mode other than you get only one death. Choose what works best for you! There are no wrong choices! FEW LAST TIPS! Surviving is rough out here (unless you are playing Descent, in which case, learn to make potions!). Make sure to grab all the food you can find, cook your vegetable, chop down trees, dig up ore, craft some new armor, and start your farm. ⠀⠀ One last thing that will help with survival, inventory space and your characters fabulous look is to build up your town. Many new buildings will become unlocked as you travel further into the dungeon; don't forget to build them. And while you are at it, you might as well craft yourself some new armor as well. Oh and maybe a ring...and some potions. ⠀⠀ Now you are truly ready! We hope you enjoy the game as much as we did creating it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/697550/header.jpg?t=1598239259",
    "Price": 19.99,
    "Developers": "Graybeard Games",
    "Publishers": "Graybeard Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_e0b890fe7418add957ac24c8379c72938cc1d3d7.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_0128b1cb423c5485914f7e71a3fc2eed2de83074.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_0c981f759acb100252895baef729244d52791aa2.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_c473f0386e8e299e9a9949a9bf8aa9d321563f65.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_c79306c6e5d9122def0904660ddb4af7aafce40c.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_5651ad981cc627150e2c61d5672273ae371df307.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_debb01f6580476fc37d35418334952f2bf5d12ba.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_6b035f9cee9a8485f2c8c2840d454a7906343333.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_50cfa14dfe95dfacef2fb1aace964b0d586842c8.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_817085e285e13b0e9051aee8574a8365db6af21f.1920x1080.jpg?t=1598239259,https://cdn.akamai.steamstatic.com/steam/apps/697550/ss_da75cbe7a33b1c91b0d591a50943ba9efb616934.1920x1080.jpg?t=1598239259",
    "Slug": "it-lurks-below",
    "Meta Title": "It Lurks Below: May 29, 2019, Graybeard Games and Full Ov...",
    "Meta Description": "Looking for information on It Lurks Below? Check out the release date (May 29, 2019), developer insights from Graybeard Games, and a complete game summary.",
    "Alt Text Image": "Official header image for It Lurks Below game - Steam 697550",
    "Canonical URL": "https://gusku.site/game/it-lurks-below",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"It Lurks Below\", \"description\": \"Looking for information on It Lurks Below? Check out the release date (May 29, 2019), developer insights from Graybeard Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Graybeard Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Graybeard Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/697550/header.jpg?t=1598239259\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}