{
    "AppID": 1090440,
    "Name": "Kelipot",
    "Release date": "Nov 3, 2020",
    "About the game": "Kelipot is a story-driven action platformer with rogue-lite elements. Combining classic side-scrolling gameplay, a great variety of powers and a gripping plot from start to finish, immerse yourself in the adventure to come! Many Paths Lie Before You Time and space intertwined, this journey will bring you across many timelines, into the Celephais of untold parallel worlds. Step through every corner of the fallen town. The tale has yet to be told, discover and unveil the truth buried within! At present the game contains several dozen of monsters, 7 unique Bosses that branch into over ten different Boss battles. Depending on your choices and the development of the plot, each Boss fight may just change in unexpected ways! Vast Array of Items at Your Disposal With over a hundred items and runes already in-game, pick and choose as you wish. Every item could offer you unique powers for an entire run. Collected runes may strengthen you permanently, choosing to activate a rune will further grant a variety of enhancements. Tired of swinging your sword? No problem, stomp those monsters flat instead! Unique Experience of Action and Bullet Hell The gameplay blends side-scrolling combat with intricate elements of bullet hell. Sounds a little difficult? Fear not! Your plethora of items and mighty dashes will help you push through every obstacle. Hand-Drawn Designs Presented with Style Created in an entirely hand-illustrated 2D style, every monster and character brought to life with detailed frame-by-frame animations. Presenting to you the most beautiful surroundings and vibrant characters! Features A cast of intriguing, lovable characters! Every new discovery will empower you, be that finding a secret or winning someone’s favor. The story unfolds, piece by piece as you set forth. We hope to bring you a stirring and entertaining experience. Face wave after wave of dazzling barrages. Dash! Jump! Give it your all to take down every adversary standing before you! Stylish staging and epic boss battles. What drove everyone to fall into madness? Only by defeating them will you find the answer. “Are they friend or foe?” The choice is in your hands. Every rune features something unique. Collect and activate them, they will enhance your powers. Accompanied by a cinematic soundtrack. Story and Setting A mysterious plague befell the ancient town of Celephais without warning. In the hope of saving his brother, in the hope of rescuing all those lost to the madness, Prince Abel must venture alone into the fiend-infested ruins. Traverse countless parallel realms, search for the old friends who have survived, investigate the cause of the plague and uncover the answers behind every questions. Time and space intertwined, this journey will bring you across many timelines, into the Celephais of untold parallel worlds. Step through every corner of the fallen town. The tale has yet to be told, discover and unveil the truth buried within! As for what awaits you at the end of the road, that will depend on the choices you make. Have no fear, however, for every run is a new beginning. You can visit any world, seek any number of outcomes as many times you wish. There is bound to be a conclusion to your liking. Kelipot may also satisfy your curiosity, be bold and try every possibility, there may just be some little surprises waiting for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1090440/header.jpg?t=1656480805",
    "Price": 13.99,
    "Developers": "Unlimited Fly Games",
    "Publishers": "Unlimited Fly Games,Gamera Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_426e8be50bd7a5e02755a55fe73aa461db610661.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_e22dc35cdaedd0bc1a0f1cbece47c6fb3c7d622a.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_2a5e9b273b9162873323636a306efb08f0cca6d1.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_60079ed73a6811a70decb9109a9daea04ce4175c.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_bc0b79c3579c0ec86c6f5d8380cec16e2196564d.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_f11100ad604832b7c735661366dbabee5951f243.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_e855d7bff8fea19f1380f93ef7d9d1b411c98d5e.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_4cf45cf42ffea0cf46d6b1e92d3fab5cd77687e5.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_a8ec8f20f9d625e272f0174dd2b2d39b09fca011.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_42af264769b8351be34d974a34240d84338c3c01.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_9563ce06351e5ecc38b231a29b5552079c20d435.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_06d4057fdf74b5eac959b8522070b878b315d790.1920x1080.jpg?t=1656480805,https://cdn.akamai.steamstatic.com/steam/apps/1090440/ss_96038dce7fd4e8362fc436c6e0cd64a302b3ac93.1920x1080.jpg?t=1656480805",
    "Slug": "kelipot",
    "Meta Title": "Kelipot: Nov 3, 2020, Unlimited Fly Games and Full Overview",
    "Meta Description": "Looking for information on Kelipot? Check out the release date (Nov 3, 2020), developer insights from Unlimited Fly Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Kelipot game - Steam 1090440",
    "Canonical URL": "https://gusku.site/game/kelipot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kelipot\", \"description\": \"Looking for information on Kelipot? Check out the release date (Nov 3, 2020), developer insights from Unlimited Fly Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unlimited Fly Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unlimited Fly Games,Gamera Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1090440/header.jpg?t=1656480805\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}