{
    "AppID": 1597790,
    "Name": "Mainframe Defenders: Meltdown - Prologue",
    "Release date": "Jun 2, 2021",
    "About the game": "Mainframe Defenders: Meltdown - Prologue is a free introductory version of the retro-futuristic tactical game Mainframe Defenders . Command a squad of 4 prototypes to protect the Mainframe from infection by an unknown virus. You will have to fight off assaults, destroy fabricators, download valuable data, clear infected nodes, and much more on your way to the deepest areas of the complex. Bypass the limitations and disadvantages of items and create powerful combinations. Destroy opponents with a variety of tactics: overheat them, destroy them with corrosion, absorb damage and shoot back.Don't rely on a single strategy - enemies may have a way to counter it. The Prologue content: 6 of 24 mechs, 90 of 190 items, 1/3 of missions (1 act). * RETRO STYLE: Graphics, inspired by 80s terminal PC with hybrid synthwave soundtrack. * DIVERSE TACTICS: Cook enemy robots to death, bury them under your bullets, eliminate with a single powerful shot, or render your opponents useless with debuffs - this game is designed with a lot of viable strategies in mind. * BUILD YOUR SQUAD: Similar to how in card games you have to build your deck, in Mainframe Defenders you have to combine different items with unique abilities, to create an unstoppable squad. Work with item drawbacks or double down on them, creating flawed, yet powerful build! * UNIQUE ENEMIES: Enemy squad won't sit idle, though. Each unit has its own role in the squad and designed to counter certain strategies. Pick your targets wisely, or you will lose. * PROCEDURAL LEVELS: Hand-made rooms are combined with procedural generation to create random levels. Missions have differing objectives, combined with unique mission conditions. Will you accept the challenge or avoid the unknown and risk falling behind? * PROGRESSION SYSTEM: Victory or defeat, the game is not over yet! Unlock new units, each with a unique set of upgrades and load-outs. Unlock new items to bolster your new strategies. Synthetic Domain is a small team of hobbyists with a passion for making games. We are working with limited resources to deliver quality games focusing on polish and execution. We look at indie games, games from the 90s and 00s for our inspiration, hoping to bring some of the spirit of this era to the modern age. Meltdown - this is not just an addition, but the love of all players who saw a lot of interesting things for fixes. Of course, a pinch of our flaws is present. A complete list of fixes and added content can be found here: Meltdown v1.3 Do not hesitate to contact us if you have any problems, you want to leave a review or a suggestion: Synthetic Domain",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1597790/header.jpg?t=1657427651",
    "Price": 0.0,
    "Developers": "Synthetic Domain",
    "Publishers": "Synthetic Domain",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_18b2b1b8f0397ff8f1fc294bed85004593f8c76a.1920x1080.jpg?t=1657427651,https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_e8630db5998554177b92ec57e9b9f17fd6affd1b.1920x1080.jpg?t=1657427651,https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_81f9f90f4fcd6676361686b7bf57fb4d7aeb8811.1920x1080.jpg?t=1657427651,https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_1a1a93f5c1c1c6e1b814a9cec0420e8b836721ef.1920x1080.jpg?t=1657427651,https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_131a88d46e89c398890dff51dae59c49bd85a25f.1920x1080.jpg?t=1657427651,https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_0e02e1ee20141d1b72fd0455aec929f3f8af71e9.1920x1080.jpg?t=1657427651,https://cdn.akamai.steamstatic.com/steam/apps/1597790/ss_d9ffb0d929397d1be774586d4b67ce489a392ac1.1920x1080.jpg?t=1657427651",
    "Slug": "mainframe-defenders-meltdown-prologue",
    "Meta Title": "Mainframe Defenders: Meltdown - Prologue: Jun 2, 2021, Sy...",
    "Meta Description": "Looking for information on Mainframe Defenders: Meltdown - Prologue? Check out the release date (Jun 2, 2021), developer insights from Synthetic Domain,...",
    "Alt Text Image": "Official header image for Mainframe Defenders: Meltdown - Prologue game - Steam 1597790",
    "Canonical URL": "https://gusku.site/game/mainframe-defenders-meltdown-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mainframe Defenders: Meltdown - Prologue\", \"description\": \"Looking for information on Mainframe Defenders: Meltdown - Prologue? Check out the release date (Jun 2, 2021), developer insights from Synthetic Domain,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Synthetic Domain\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Synthetic Domain\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1597790/header.jpg?t=1657427651\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}