{
    "AppID": 958670,
    "Name": "MekaFighters",
    "Release date": "Jul 13, 2021",
    "About the game": "Foreword: The game is under heavy development and is very much a work in progress. It's being developed by one person currently and will take quite a bit of time to perfect and get right! You may encounter bugs, issues, and things that just don't plain work. Should you not be ready for that experience, please wait until we are out of early access to consider to purchase the game. Thanks for even considering to support the game and cheers! MekaFighters is a retro-stylized third-person shooter where you take control of a Meka Rider and their Meka as countries clash against one another in wars to maintain dominance. Battle out against others and emerge victorious, using your abilities to outplay and destroy enemy Mekas! CURRENT FEATURES: OUTPLAY YOUR OPPONENTS With multiple Mekas (Characters) to play as, you have multiple opportunities to outsmart your opponents using Jet Propulsion or use each Mekas Unique Active ability. RETRO STYLED GRAPHICS Inspired by retro games, we use a bunch of flat colors and try to not have shadows and make every scene in the game popout. TAKE ON OPPONENTS In MekaFighters, we feature gamemodes where you can 1v1 somebody or team up with another player and face off against another 2 players! With even more gamemodes to come! EVER-GROWING MEKA LIST Wendy and JICE, the Light Bringers, can shoot a devastating beam of light that passes through everything it hits and upon contact with an enemy deals some damage and if enemies don't exit the beam the damage is increased. Also, for each bullet they hit on an enemy, they deal additional damage. Sed and SAIRO, the Shadow Fighters, can enter stealth for some time and then upon exiting gain the ability to shoot a laser shadow that deals tremendous damage upon contact. Sed and SAIRO also gain an increased fire rate and whenever entering stealth, gain bonus movement speed. Nika and TERA, the Earth Users, can manifest a rock and throw it towards an enemy dealing damage based on distance traveled. Nika and TERA also passively have more damage, movement speed, and more resistances. Khaleed and ZHEN, the Red Barons increase their damage output for a short duration and whenever they are low on health gain additional resistances for a short time before it goes on cooldown. James and JK1, the Dawning Shadows increase their stats when their active ability, Dark Barrier is ongoing. Dark Barrier places a barrier in a small area that lasts for a few seconds, or whenever a certain amount of damage is dealt to them. Gerard and AM3, the Widowmakers tremendously decrease their active ability's cooldown at a cost of increasing the resources needed to use it as well as jump significantly higher and move faster. Their active ability is a projectile that deals damage based off of how much their target's max health is and Gerard and AM3's missing health.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/958670/header.jpg?t=1655550352",
    "Price": 0.0,
    "Developers": "Austin James",
    "Publishers": "Austin James",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/958670/ss_da09fa84fbf1a0ecae0852e816b604c804b55a30.1920x1080.jpg?t=1655550352,https://cdn.akamai.steamstatic.com/steam/apps/958670/ss_cdbadf9afcf2ce26a809cb5f3e1a77fb9c82b840.1920x1080.jpg?t=1655550352,https://cdn.akamai.steamstatic.com/steam/apps/958670/ss_2d132ebcd3a3649511e4c3331004e432f02911e2.1920x1080.jpg?t=1655550352,https://cdn.akamai.steamstatic.com/steam/apps/958670/ss_ea136aac37c33f1aa5ea8a699a79f7d30ca8a26c.1920x1080.jpg?t=1655550352,https://cdn.akamai.steamstatic.com/steam/apps/958670/ss_e901ed74c969b34bdadc1f128ff4f7c1336b6041.1920x1080.jpg?t=1655550352",
    "Slug": "mekafighters",
    "Meta Title": "MekaFighters: Jul 13, 2021, Austin James and Full Overview",
    "Meta Description": "Looking for information on MekaFighters? Check out the release date (Jul 13, 2021), developer insights from Austin James, and a complete game summary.",
    "Alt Text Image": "Official header image for MekaFighters game - Steam 958670",
    "Canonical URL": "https://gusku.site/game/mekafighters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MekaFighters\", \"description\": \"Looking for information on MekaFighters? Check out the release date (Jul 13, 2021), developer insights from Austin James, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Austin James\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Austin James\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/958670/header.jpg?t=1655550352\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}