{
    "AppID": 595270,
    "Name": "Million to One Hero",
    "Release date": "Jul 23, 2019",
    "About the game": "“Becoming a truly great hero depends on only two things: yourself and the rest of the world.” The Heroum Code, art. 0.1 Embark on an epic adventure where using your heroic abilities to advance through the levels is only half the fun. You can also design new stages with a degree of detail you’ve never seen before and create your own platformer. Sharpen your sword. Sharpen your intellect. Give yourself a fighting chance at becoming a Million to One Hero. BECOME A TRULY GREAT HERO Travel through the memories of Chronos, the god of time, and discover the story of Epicus, an aspiring hero who dreams of becoming the greatest legend the world has ever seen. Or at the very least, getting a statue in his village’s main square. Dive into a fantastic adventure full of traps, puzzles, mystical artifacts, and mythological creatures. An adventure with hundreds of possible paths today and even more tomorrow: each day, you’ll find new memories to explore and fresh challenges to overcome. Run, jump, compete, discover, fight, risk it all… and if you die, don’t worry. With a bit of luck, Chronos will give you another chance. BECOME A WICKED MASTERMIND Being a glorious hero is great, but making the hero’s life difficult is even more fun. Everything - absolutely everything - you see is available for you to use in an editor with an infinite amount of ways to craft the craziest situations. Or the most surprising. Or the deadliest. But don’t limit yourself to creating levels. This editor lets you go even further. Thanks to its campaign mode and narrative options, you’ll be able to include dialogues, design quests, and create entire chapters with your own plot. Imagine your very own 2D platform adventure and make it a reality as you fuel the legend of Epicus. BECOME PART OF THE STORY Compete against other heroes, master all the possible challenges, create an epic storyline other players will love, design the most devious level of all… there are dozens of ways to have your name carved into the history of the game. Calling all new recruits! Join us on social media (Twitter, Discord) and tell us what inspires you: new ideas, better traps, surprising scenarios, unimaginable enemies… well, someone’s got to imagine them. Why not you? “A truly great hero knows that one small action today can have incredible consequences tomorrow. With any luck, they’ll be good consequences.” The Heroum Code, art. 2.2",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/595270/header.jpg?t=1626699748",
    "Price": 14.99,
    "Developers": "Over the Top Games",
    "Publishers": "Over the Top Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_7ba846d2dff14ee1ff0dcfec96f756550b3dbd6c.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_cc769800f7ee0d053a6b53c108a0faf941f1775e.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_d7af85988aadfe3147f11cc2a3d71f998381b9c5.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_b9bcf026eac1152e44359b1fd6e82681a9b6d016.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_9d7e32ed36cad248d7217a40384fbc5ff9c9ba00.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_02806f48a5fdfc74591cc91e745c489571bcc3db.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_e56ca2345a67e6f2585401edbbd8786432b9a55e.1920x1080.jpg?t=1626699748,https://cdn.akamai.steamstatic.com/steam/apps/595270/ss_ddcbac49dc46d2085d95347f70f16a88e8fafb92.1920x1080.jpg?t=1626699748",
    "Slug": "million-to-one-hero",
    "Meta Title": "Million to One Hero: Jul 23, 2019, Over the Top Games and...",
    "Meta Description": "Looking for information on Million to One Hero? Check out the release date (Jul 23, 2019), developer insights from Over the Top Games, and a complete ga...",
    "Alt Text Image": "Official header image for Million to One Hero game - Steam 595270",
    "Canonical URL": "https://gusku.site/game/million-to-one-hero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Million to One Hero\", \"description\": \"Looking for information on Million to One Hero? Check out the release date (Jul 23, 2019), developer insights from Over the Top Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Over the Top Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Over the Top Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/595270/header.jpg?t=1626699748\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}