{
    "AppID": 1127400,
    "Name": "Mindustry",
    "Release date": "Sep 26, 2019",
    "About the game": "Gameplay Create elaborate supply chains of conveyor belts to feed ammo into your turrets and produce materials to use for building Use production blocks to create a wide variety of advanced materials Defend your structures from waves of enemies Play with your friends in cross-platform multiplayer co-op games, or challenge them in team-based PvP matches Distribute liquids and fight constant challenges, like outbreaks of fire or enemy flier raids Get the most out of your production by supplying optional coolant and lubricant Produce a wide variety of units for automatic management of your base or assault on enemy bases Campaign Conquer the planet Serpulo as you advance through 250+ procedurally generated sectors and 16 hand-made maps Capture territory and set up factories to produce resources while you play other sectors Defend your sectors from periodic invasions Coordinate resource distribution between sectors via launch pads Research new blocks to fuel progress Invite your friends to complete missions together 120+ technology blocks to master 33 different types of drones, mechs and ships 50+ achievements to complete Gamemodes Survival : Build turrets to defend from enemies in tower-defense based gameplay. Survive as long as possible, optionally launching your core to use your collected resources for research. Prepare your base for intermittent attacks from airborne bosses. Attack : Build factories for units to destroy the enemy cores, while simultaneously defending your base from waves of enemy units. Create a variety of different types of support and offensive unit to assist you in your goals. Optionally enable an AI that builds defensive structures to an extra challenge. PvP : Compete with other players on up to 4 different teams to destroy each other's cores. Create units, or attack other bases directly with your mechs. Sandbox : Play around with infinite resources and no enemy threat. Use sandbox-specific item and liquid source blocks to test out designs, and spawn in enemies on request. Custom Games &amp; Cross-Platform Multiplayer 16 built in maps for custom games, in addition to campaign Play co-op, PvP or sandbox Join a public dedicated server, or invite friends to your own private session Customizable game rules: Change block costs, enemy stats, starting items, wave timing and more Mix &amp; match gamemodes: Combine PvP and PvE gamemodes together Custom Map Editor Paint terrain with an editor UI Edit and preview structures in-game Configurable tool modes: Change how each tool functions Powerful map generation system, with many different types of filters for procedural manipulation of terrain Apply noise, distortion, smoothing, erosion, symmetry, ore generation and random terrain to your maps Randomize and configure ore generation, as well as placement of river and resource tiles Configure enemy wave layouts Share exported maps on the Steam Workshop Customize base map rules Use 80+ different environmental blocks",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1127400/header.jpg?t=1633888087",
    "Price": 5.99,
    "Developers": "AnukenDev",
    "Publishers": "AnukenDev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_19dbb62a615fc63788cf499ab948947fe365a9d2.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_6dec4c801cd7ddca04a04ad97a0e85e4c315f9a2.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_a124f701b2eec73e5093ad147083fad1ac21ebbc.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_4394351c612e1114b2b3d945e2b2d80d00bb2dcb.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_d73367d8ca6ba91297c3ca4e10974c767431d3f1.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_7fe22e4c65f08f89b19114d57c3e6a7f1ce32bcc.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_1af638f7262e5f60475bfb417c40d526377fd7ca.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_9dd6927f900024e28b8ce78ecee22cbce346778b.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_2038ebdeb9339ede1a075bde0e9f81ffdbc1ae72.1920x1080.jpg?t=1633888087,https://cdn.akamai.steamstatic.com/steam/apps/1127400/ss_27c73eb996e4320ce8adf7aa4bc38c564b3b575d.1920x1080.jpg?t=1633888087",
    "Slug": "mindustry",
    "Meta Title": "Mindustry: Sep 26, 2019, AnukenDev and Full Overview",
    "Meta Description": "Looking for information on Mindustry? Check out the release date (Sep 26, 2019), developer insights from AnukenDev, and a complete game summary.",
    "Alt Text Image": "Official header image for Mindustry game - Steam 1127400",
    "Canonical URL": "https://gusku.site/game/mindustry",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mindustry\", \"description\": \"Looking for information on Mindustry? Check out the release date (Sep 26, 2019), developer insights from AnukenDev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"AnukenDev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AnukenDev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1127400/header.jpg?t=1633888087\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}