{
    "AppID": 428550,
    "Name": "Momodora: Reverie Under The Moonlight",
    "Release date": "Mar 4, 2016",
    "About the game": "Momodora: Reverie Under The Moonlight takes the player on a journey through a cursed land on the brink of eradication. Evil spreads, the dead rise, and corruption reigns. Hope is but a faded memory for all but one: a priestess named Kaho from the village of Lun. If only Kaho could somehow gain audience with the Queen, Her Majesty could surely be convinced to lend her power to help save the land and its inhabitants from certain doom―but time is short, and each coming night falls darker than the last... Reverie Under The Moonlight is the fourth installment in the Momodora series of side-scrolling action platformers, featuring melee combos, dodge mechanics, and a plethora of items and spells to unleash upon your enemies. Play casually to fully take in and enjoy the rich setting and engaging, mysterious story, or crank up the difficulty to run your reflexes through a truly brutal gauntlet. Beautifully animated graphics Exciting action gameplay: pull off impressive combos, dodge attacks, and skewer enemies with arrows Intense boss battles with challenging patterns and epic scale Difficulty settings appropriate for all types of players―from story and setting lovers to hardcore action enthusiasts A breadth of items that can be combined to facilitate new strategies An amazingly diverse world to explore, filled with secrets and treasures Eccentric allies and foes with compelling personalities Mysterious lore and rich backstory woven into events, dialogue, and item descriptions For this fourth installment in the Momodora series―which actually serves a prequel to the previous games―the primary focus during development was on improvements to the gameplay and art. The combat gameplay has truly evolved since the days of Momo III, and the character sprites are now bigger and better animated. We also made an effort to include more tiny details here and there, expand on the world lore, and create more exciting boss battles. I believe this is the best Momodora game in the series, and definitely the most polished title so far. Most of us at Playism grew up playing video games during the early days of the NES, and throughout the years, action-platformers have been some of the staples in our respective game libraries. Long before “Metroidvania” was a thing, we fell in love with the original Castlevania series, as well as with other Hall of Famers such as the Metroid, Contra, and Ninja Gaiden games. About halfway through the lifecycle of the first-generation PlayStation, sprite-based game development took an unfortunate nosedive, and the sorts of games we loved most and grew up with just weren't being made as frequently or, frankly, with as much love and care as they once were. Indie game development really helped to reinvigorate both the sprite-based action-platformer genre and the magic of actual sprite animation. rdein's games combine what we’ve always loved about tight-action 2D gaming with splendid influences from more modern games like Dark Souls. The dedication to your actions necessitated by animation locks; the insane intensity driving the boss fights and how epic it is that this quaint little heroine can tackle these heroic endeavors; the attention to detail in the environments, designs, and animations... all of this stuff is simply stunning and rdein pulls it off to beautiful effect. Then there’s also the story itself, which is also a masterpiece in game storytelling: a strange, mysterious world that you inhabit with countless hopeless souls whom you are trying to save. There is painstaking detail in every item, every snippet of dialogue. You find yourself constantly readjusting how you feel about these people. You're trying to save them, but do they even want to be saved? Or should you be more worried about that awkwardly sinister tone in their voices...? Momodora: RUTM shouldn’t exactly be categorized as “Metroidvania” or “Souls-like”, but there certainly are elements of both contained within. It's a game of its own, and it’s one of the best entries in the mind-bogglingly expansive genre of side-scrolling action-platformers. We at Playism all love the game, and we can state with absolute confidence that if you’ve bothered to read this far, then you certainly will, too.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/428550/header.jpg?t=1656062895",
    "Price": 9.99,
    "Developers": "Bombservice",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/428550/ss_051cd90e0d4329259efe71cba64c439cdd607beb.1920x1080.jpg?t=1656062895,https://cdn.akamai.steamstatic.com/steam/apps/428550/ss_13295e95e06dc2f83061fe7e788c38e62464c930.1920x1080.jpg?t=1656062895,https://cdn.akamai.steamstatic.com/steam/apps/428550/ss_a55bea5554e3c611a740d90bc0cb6281ea4a1eed.1920x1080.jpg?t=1656062895,https://cdn.akamai.steamstatic.com/steam/apps/428550/ss_da33aec54363c15d013ee1fdd57e8b429df66f0f.1920x1080.jpg?t=1656062895,https://cdn.akamai.steamstatic.com/steam/apps/428550/ss_bbd84596e4568fffd71639dea09562d946edd185.1920x1080.jpg?t=1656062895",
    "Slug": "momodora-reverie-under-the-moonlight",
    "Meta Title": "Momodora: Reverie Under The Moonlight: Mar 4, 2016, Bombs...",
    "Meta Description": "Looking for information on Momodora: Reverie Under The Moonlight? Check out the release date (Mar 4, 2016), developer insights from Bombservice, and a c...",
    "Alt Text Image": "Official header image for Momodora: Reverie Under The Moonlight game - Steam 428550",
    "Canonical URL": "https://gusku.site/game/momodora-reverie-under-the-moonlight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Momodora: Reverie Under The Moonlight\", \"description\": \"Looking for information on Momodora: Reverie Under The Moonlight? Check out the release date (Mar 4, 2016), developer insights from Bombservice, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bombservice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/428550/header.jpg?t=1656062895\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}