{
    "AppID": 2018990,
    "Name": "Mythic Origins",
    "Release date": "Jul 14, 2022",
    "About the game": "We created a unique fusion of the MMORPG and Roguelite genres, incorporating our favorite elements from each. Discover a world packed with puzzles, enemies, bosses, and treasure. Join forces with fellow heroes to hunt down the gods, or strike out alone and be the first to discover uncharted territory. This is the free version of Mythic . Mythic Origins is an action-packed experience filled with enemies, loot, a cool boss fight, and a gauntlet minigame with a global leaderboard. MASSIVELY MULTIPLAYER Fully online. Enter a massively multiplayer experience with up to hundreds of people on your screen at any given time. Choose your party. Navigate the world alone, with a few friends, or with anyone you meet along the way. Build your character. Customize your character with unique loot, each coming in a variety of item levels and rarities. TRUE EXPLORATION Procedural generation. Each room in the world is a new, procedurally generated challenge filled with challenging puzzles and winding mazes. Discovery. Mysteries are scattered throughout Mythic. Will you be the first to uncover secrets hidden deep in the maze? Or explore an area no other player has ever seen? Rewarding Achievements. The first few players to discover uncharted territory will earn rare treasure. High scoring players in minigames will earn equipment only they can wield. Real accomplishments mean real rewards in Mythic Origins. ROGUELIKE ELEMENTS Live. Die. Repeat. Prepare for challenging combat and gameplay that will lead to frequent and punishing deaths. Many Roguelites. Each elemental biome in Mythic Origins is designed as a self-contained roguelite. Death will return you to the start of the biome you are currently exploring. No Permadeath. Complete a biome to unlock new abilities and areas. Completed biomes stay complete, even if you die. What is the difference between “Mythic Origins” and the full version “Mythic”? Mythic will have: an infinite, procedurally generated world where each room is a brand-new challenge 4 more unique elemental biomes 4 more elemental bosses to be conquered more unique enemies, quests, and puzzles over 50 more unique items to equip 3 more crafting systems multiple skill trees to customize your character with",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2018990/header.jpg?t=1657828825",
    "Price": 0.0,
    "Developers": "Abyssal Studios LLC",
    "Publishers": "Abyssal Studios LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2018990/ss_9fb24dd29334114b3aec485d65621a34edae92ca.1920x1080.jpg?t=1657828825,https://cdn.akamai.steamstatic.com/steam/apps/2018990/ss_16d5f1af509fa40e437e3cf37cd2be1fc946a12c.1920x1080.jpg?t=1657828825,https://cdn.akamai.steamstatic.com/steam/apps/2018990/ss_79501ebe40693838f6d319f339aa614fa71891ca.1920x1080.jpg?t=1657828825,https://cdn.akamai.steamstatic.com/steam/apps/2018990/ss_29297a118d348f4aea4ebc789236cc2b91a5d1cf.1920x1080.jpg?t=1657828825,https://cdn.akamai.steamstatic.com/steam/apps/2018990/ss_c0a772a3fecff73eb9a626ea00daa9940fce6008.1920x1080.jpg?t=1657828825,https://cdn.akamai.steamstatic.com/steam/apps/2018990/ss_7f9a0fffb0f7d7bb30100573ca98462eee9e3d1e.1920x1080.jpg?t=1657828825",
    "Slug": "mythic-origins",
    "Meta Title": "Mythic Origins: Jul 14, 2022, Abyssal Studios LLC and Ful...",
    "Meta Description": "Looking for information on Mythic Origins? Check out the release date (Jul 14, 2022), developer insights from Abyssal Studios LLC, and a complete game s...",
    "Alt Text Image": "Official header image for Mythic Origins game - Steam 2018990",
    "Canonical URL": "https://gusku.site/game/mythic-origins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mythic Origins\", \"description\": \"Looking for information on Mythic Origins? Check out the release date (Jul 14, 2022), developer insights from Abyssal Studios LLC, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Abyssal Studios LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Abyssal Studios LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2018990/header.jpg?t=1657828825\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}