{
    "AppID": 1278150,
    "Name": "Nayati River",
    "Release date": "Aug 20, 2021",
    "About the game": "In just a few hours, the region of Nayati River suddenly descended into chaos. From the seaside in the east to the national park in the north, the majority of inhabitants suddenly turned into living dead, forming ferocious hordes hungry for the blood of the living. A few survivors, however, found refuge in the national park, once populated by the powerful native American tribe of Chief Nayati, whose mysterious legend seems to echo the cataclysm the region is experiencing today! This is where the survivors' adventure begins! They must build and manage a secure and autonomous camp, with the help of a large range of structures unlocked through discoveries and events, as well as repair and upgrade their vehicles to ensure the group's survival in a world infested with the dead. To do this, they will need to journey out into the vast region of Nayati River in search of the many resources, construction materials, vehicles, documents, weapons and armor found throughout the area, all while fighting the hordes of the dead roaming everywhere. And also to start looking for the dozens of missing who will join the ranks of the community, to find each a place in the group according to their skills and personalities. But the infestation of the dead in the region cannot go unanswered! The survivors will have to summon their courage, their sense of organization and their wits to head the investigation over the course of a perilous adventure, which will lead them to the four corners of the region in hope of putting an end to the crisis and unraveling the mysteries of the legend of Nayati River! Key features: A vast region rich in resources — Explore the region of Nayati River, with its hundreds of buildings and varied locations, by launching multiple expeditions to collect resources or to find survivors. Over 120 characters — Find the numerous survivors in the region and integrate them into your group to build the strongest community possible with all the skills necessary to survive! Make use of their strengths, manage their weaknesses, and take into account their unique personal stories so that each one finds their place. An immersive adventure — Unravel the mysteries of the legend of Nayati River and try to end the crisis in an immersive tale that will take its survivors to every corner of the region. A complete building/management system — Construct a camp for the survivors with the help of over 60 available buildings. Assign tasks to community members to work them. Make sure the survivors' morale is good and that their needs are met. Protect your camp against attacks from the dead. A dynamic combat system — Fight against hordes of the dead with the help of the numerous weapons and pieces of equipment available. Upgrade vehicles, equip survivors, and train their combat skills to ensure their survival! An efficient building looting system — Send survivors into a building for them to loot it and automatically load resources onto nearby vehicles! Dozens of vehicles — Collect abandoned vehicles in the region to move around more easily and transport essential resources. Day/night — Ensure that your community is capable of surviving when night falls! 2 single-player game modes —Withstand waves of the dead with only a few survivors in 'Survival' mode, or jump into the adventure in 'Story' mode!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1278150/header.jpg?t=1643016077",
    "Price": 18.99,
    "Developers": "Worlds To Play",
    "Publishers": "Worlds To Play",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_63aaa9519e332098574ba4738d0f5de053db2d46.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_9c1a1e6c17a0cece1a5debad9bcf73217c87e788.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_5c2b2affba9b63c2d4da1e454e3c796681587162.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_9d7fdb0c9ca0ec7e24a791559e475e67dbe29ffa.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_c8b29d85591ae68b444805f3085b816a2c5ffab8.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_8d2f0df8f2595659923b627db1576e40da152663.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_13452e6655d33600c44b131cf6d962a673cf5a30.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_dec23c8d03d662e84f7ad0a8dacd033e0dea3e50.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_41506b6beb3cbf091ee76e5b2f372a568f3f0806.1920x1080.jpg?t=1643016077,https://cdn.akamai.steamstatic.com/steam/apps/1278150/ss_4420c810588e195dde052bae20e63e3b0c0fd4e1.1920x1080.jpg?t=1643016077",
    "Slug": "nayati-river",
    "Meta Title": "Nayati River: Aug 20, 2021, Worlds To Play and Full Overview",
    "Meta Description": "Looking for information on Nayati River? Check out the release date (Aug 20, 2021), developer insights from Worlds To Play, and a complete game summary.",
    "Alt Text Image": "Official header image for Nayati River game - Steam 1278150",
    "Canonical URL": "https://gusku.site/game/nayati-river",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nayati River\", \"description\": \"Looking for information on Nayati River? Check out the release date (Aug 20, 2021), developer insights from Worlds To Play, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Worlds To Play\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Worlds To Play\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1278150/header.jpg?t=1643016077\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}