{
    "AppID": 1553080,
    "Name": "Nikola Tesla: War of the Currents",
    "Release date": "May 12, 2022",
    "About the game": "At the dawn of the electrical age, can you outsmart Thomas Edison and electrify the world? Rewrite history with worldwide wireless power, alien contact, death rays and sapient machines! Nikola Tesla: War of the Currents is a 225,000-word interactive science-fiction novel by Dora Klindžić. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. The man who invented the 20th century was a queer immigrant from Serbia. Nikola Tesla dreamed of distributing free energy to all of mankind but passed away in a New York hotel room alone and forgotten. What if it had gone differently? In the year 1886, you join the eccentric Tesla as his laboratory apprentice. Notoriously bad at monetizing his inventions, but nonetheless ingenious at building them, Tesla needs your help with making a living wage as much as your help in the lab. Fend off Edison’s spies, Wall Street bankers, electrical industry magnates and other unsavory types as you navigate real historical adventures involving electrocuted elephants, the Niagara Falls electric plant, pigeons, and that time Mark Twain had the mishap of soiling his trousers in Tesla’s lab. Develop your own science skills, your social life, or opt to be more business-minded. Manage your mentor’s fragile mental state while balancing your laboratory’s checkbook. Love your work, your pigeon, or pursue a risqué romance with Edison’s daughter. Will you manage to maintain enough funding and influence to prevent the destruction of Wardenclyffe tower and perform the most esoteric of experiments? Bring free power to all, contact the aliens, or accidentally flatten a city. The history of the last great independent inventor, as well as the future of society, are in your hands. Play as male, female, or non-binary; gay, straight, bi, or asexual/aromantic. Achieve fame through spectacular inventions, people skills or cunning business. Change historic events such as the invention of the electric chair, the Chicago World Fair, the social unrest at the turn of the 20th century, and more. Monetize your inventions or uphold Tesla’s ideals of working for the betterment of mankind. Uncover secret societies lurking in the background of early-capitalist New York. Meet a cast of historic characters such as Thomas Edison and his family, George Westinghouse, Mark Twain, J.P. Morgan, Joseph Pulitzer, Lewis Latimer, Charles Steinmetz, Lord Kelvin and many more. The world awaits in darkness, ready for your electric light.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1553080/header.jpg?t=1652359657",
    "Price": 6.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1553080/ss_f83bc0a1db3dc133af053b18c5a02d84b84ebf10.1920x1080.jpg?t=1652359657,https://cdn.akamai.steamstatic.com/steam/apps/1553080/ss_65d1a48825b901bdf6c699e17635a06a2e843757.1920x1080.jpg?t=1652359657,https://cdn.akamai.steamstatic.com/steam/apps/1553080/ss_a3878eec98195badebf88184858607ffcc851662.1920x1080.jpg?t=1652359657,https://cdn.akamai.steamstatic.com/steam/apps/1553080/ss_635e77a7d0fbb5f0ac92ef21a3586990d3668a9b.1920x1080.jpg?t=1652359657,https://cdn.akamai.steamstatic.com/steam/apps/1553080/ss_6919774c8e1d15fd4b992dbe86e7192e3972c552.1920x1080.jpg?t=1652359657,https://cdn.akamai.steamstatic.com/steam/apps/1553080/ss_b640274d02e183d1c955978c25d3f89f662177c5.1920x1080.jpg?t=1652359657",
    "Slug": "nikola-tesla-war-of-the-currents",
    "Meta Title": "Nikola Tesla: War of the Currents: May 12, 2022, Choice o...",
    "Meta Description": "Looking for information on Nikola Tesla: War of the Currents? Check out the release date (May 12, 2022), developer insights from Choice of Games, and a ...",
    "Alt Text Image": "Official header image for Nikola Tesla: War of the Currents game - Steam 1553080",
    "Canonical URL": "https://gusku.site/game/nikola-tesla-war-of-the-currents",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nikola Tesla: War of the Currents\", \"description\": \"Looking for information on Nikola Tesla: War of the Currents? Check out the release date (May 12, 2022), developer insights from Choice of Games, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1553080/header.jpg?t=1652359657\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}