{
    "AppID": 1085940,
    "Name": "Orders Of The Ruler",
    "Release date": "Dec 27, 2019",
    "About the game": "Holy EAGLE order facing against fearless RED CROSS for what? For the covetable lands, tasty glory and wealth. No time to rest, no time to idle … this is the time that blood will spill some kingdoms fall and some are rise. No one is weak here, you can not underestimate anything. Always there will be a stronger one that has all the wealth, lands and glory and when the that times come, you will obey him and bend the knee. Features; For now, OOTR has 2 Factions ,3 Maps, 15+ Characters ,12+ Buildings and 3 Game mode. (It will be upgraded very soon!) Our 2 factions are EAGLE and RedCross. They are historical fiction style factions. That means our all factions will be have a historical base. With our factions there will be faction based buildings and characters that you can control. Every character and building will be unique with their faction. Map are unique and good planed for optimum equality. No one has an advantage over anyone else. Some maps are more challenging than others cause of the geography. Every map has tricks to master and learn. OOTR right now has 1 game mod and that’s multiplayer. Multiplayer is what we are focused on while making the game. It will be fun, equal and challenging. Hard but for a good player it will be rewarding. Upcoming mods are Skirmish, Survival and Campaign. There is no match to OOTR’s graphics in RTS genre. Nothing luck based, Nothing Random, Nothing unreasonable .. Everything is in your hands and skills. Fog of war system. Balanced navigating minimap. Micro and macro gameplay balance. 360 free camera for cinematic footage. UPCOMING UNIQUE stealth FEATURES (LAND SYSTEM and ORDERS SYSTEM) Gameplay; Multiplayer gameplay what are we looking for. Balanced, unique also feels old school. (You will see new things and at the same time you will taste the old RTS experience.) Build and Upgrade buildings. Summon peasants, knights, archers, horses etc. to serve you. Improve your lands, Improve your army, Improve your folk and be stronger. Defend your lands while conquer others. Gather resources for improve. And be the only Ruler in your lands with defeating other players. Orders of the Ruler is a indie RTS game which has you commanding your folk in a medieval world. You are the RULER and your mission is protect your lands while invading others. Face other Ruler's for the sake of wealth and honor. Command your army, build your base, gather resources and improve with your loyal soldiers. Some Of the Characters, Buildings and Factions; Workers;They are Peasants that cutting trees, plowing fields, mining ores, making buildings and do whatever they RULER orders to them. They are hard workers that have honor. Their loyalty to their RULER is undeniable and they can fight to protect their lands if the situation requires. They can build anything, like houses, barracks, farms, towers, walls. Spearman; Long pointy tools. Invented for fruit gathering and hunting but it seems it’s a strong item for killing man too. Spears and pikes are the most successful weapons in war. They have the most range of all melee weapons. They are the backbone of the war. Knight; Have the best and most expensive armor, have a big sword and they are noble. They are superior on the battlefield. Simple soldier can't do anything against heavy armored knight. Militia; They are peasants that trained fighting to protect their village. They are not too powerful. They just want to live in freedom but sometimes without war freedom is no possible. Base; This is your main hub my Lord. Protect it even if your life on the line. A good ruler never escapes (if it’s not a strategy ofc). RULE them from here. Command your ORDERS from here. Live here and die here. You’re here to defend your lands and invade others. Land is power and you should not allow any exceptions. Farm; Food. You need to eat and maintain your strength my Lord. These buildings earn your food to feed yourself and your people. Never underestimate food. If there is no food there is no soldiers there is no peasants, there is not even a RULER. Keep your food safe. Remember one old saying my Lord. EAGLE; Land means power and wealth. This religious order sees their lands as their honor. Gain more and lose none. They carry the holy EAGLE emblem to battlefield. EAGLE brings fear to their foes heart and brings serenity to their follower’s minds. Redcross; Religious order that praises to bible. They are honorable and fearless. They are believing death is not the end and if you combat for your RULER you get rewarded gold, honor and every wealth after you die with an honorable death. Their emblem is the holy RED CROSS. You can check our work of progress in our website.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1085940/header.jpg?t=1596915745",
    "Price": 19.99,
    "Developers": "E2D2Works",
    "Publishers": "E2D2Works",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_ee609ee9a84710611a07843e89c353c5284d96a0.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_ba6597e9a6f347dbed9a515f4a9f1b2c3df0620f.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_ee32591d55c67e96d24d74caa92c50280d963df8.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_2dd00ab19c9b3014185e85c672226d029173ffb0.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_9f7c8293036a91d39b33ea0e479d367528564862.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_c66a4912a6ea4ebe1b3a405a65564664eb506b1e.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_9a32ac77ae37e7a143bc72dca0b2cafd6f1a127b.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_35bac8e5cb14a89b3585df8555547ca2e7e4240c.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_820af314937c2a4f4435b7405dc196475c7633de.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_30a10f284266dd06a255aeb0ca14f6bf8ced4404.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_2c47b480eb4d8b2fdf61b47ffd75f62a3d6488c3.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_1b0336aeecd41772c16ced0ae5890c4537b7a5db.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_c0383c2b29e6d121315656528818a285627125d6.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_8ef4c050927cf5eb82b70b0014822f3c2b59f38d.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_7259b602d6eda0385b270a3e03dc97d53830e0bc.1920x1080.jpg?t=1596915745,https://cdn.akamai.steamstatic.com/steam/apps/1085940/ss_ae545c077de3af3996f9d84e9ccfec1abba3b610.1920x1080.jpg?t=1596915745",
    "Slug": "orders-of-the-ruler",
    "Meta Title": "Orders Of The Ruler: Dec 27, 2019, E2D2Works and Full Ove...",
    "Meta Description": "Looking for information on Orders Of The Ruler? Check out the release date (Dec 27, 2019), developer insights from E2D2Works, and a complete game summary.",
    "Alt Text Image": "Official header image for Orders Of The Ruler game - Steam 1085940",
    "Canonical URL": "https://gusku.site/game/orders-of-the-ruler",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Orders Of The Ruler\", \"description\": \"Looking for information on Orders Of The Ruler? Check out the release date (Dec 27, 2019), developer insights from E2D2Works, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"E2D2Works\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"E2D2Works\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1085940/header.jpg?t=1596915745\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}