{
    "AppID": 1135450,
    "Name": "Psy High 2: High Summer",
    "Release date": "Aug 15, 2019",
    "About the game": "What If Summer Could Last Forever? Summer is a magical time: suspended between past and future, long days and warm nights. One year after saving Kingsport High at the junior prom, you’ve graduated, and you’re working as a counselor at a sleepaway camp before heading off to college. You’re in charge of a cabin full of nine- and ten-year-olds, responsible for taking care of them and teaching them everything you know. But you’re also enjoying a summer of freedom: you’re away from your parents and on your own. Camp Cedarcrest has its share of mysteries. Why do the people in the camp’s photos look like they never age? Why is the groundskeeper always lurking on the edges of the camp? Why can’t your friends remember what happened last summer? And what about the ghost stories? Generations of campers tell stories about seeing the White Lady floating through the woods. When you meet the White Lady and her companions, you discover that what’s really going on in the forest is even stranger than just ghosts - and when you find a powerful source of new magic, you also discover that it comes with a high price. How far are you willing to go to preserve or destroy it? And how are you ever going to figure that out while you’ve got a dozen kids looking to you for the answers to their life’s questions? Are you even ready for that? You’re still just a kid yourself. But you’re the only person who can save the camp – and the only one who can make the big choices about how to use the magic that you’ve discovered. All your friends from Kingsport High are just a text away: you can always look to your best friend for support, ask the editor of the school newspaper to help with research, or sneak a date with your hometown sweetheart. Sing songs around the campfire, eat s’mores, make friendships that will last forever. Play as male, female, or nonbinary; gay, straight, or bi. Find summer love with your co-counselor or a mysterious stranger; or deepen your relationship with your high school sweetheart. Learn magic from a powerful mentor, and teach magic to a new generation. Earn your campers’ love – or just ignore them and have your own fun. Win Colorwars! Save Camp Cedarcrest – or decide that it’s better off closed. Explore a secretive society and its powerful magic. Be a good influence on your campers, or teach them to be troublemakers, just like you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1135450/header.jpg?t=1565883271",
    "Price": 5.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1135450/ss_9e7029ee4744bb6163b13ec7d50069ea29fb96ff.1920x1080.jpg?t=1565883271,https://cdn.akamai.steamstatic.com/steam/apps/1135450/ss_edcc20f223f368f7d9cf3428f1436db7efeaf511.1920x1080.jpg?t=1565883271,https://cdn.akamai.steamstatic.com/steam/apps/1135450/ss_ec4228eb1f98c43303d823e36c39c735c19e2ae2.1920x1080.jpg?t=1565883271,https://cdn.akamai.steamstatic.com/steam/apps/1135450/ss_97b87441bf27af58f8261a371c8933699051e6f3.1920x1080.jpg?t=1565883271,https://cdn.akamai.steamstatic.com/steam/apps/1135450/ss_86b20ce463255e413ce34865393a57664b3a4407.1920x1080.jpg?t=1565883271",
    "Slug": "psy-high-2-high-summer",
    "Meta Title": "Psy High 2: High Summer: Aug 15, 2019, Choice of Games an...",
    "Meta Description": "Looking for information on Psy High 2: High Summer? Check out the release date (Aug 15, 2019), developer insights from Choice of Games, and a complete g...",
    "Alt Text Image": "Official header image for Psy High 2: High Summer game - Steam 1135450",
    "Canonical URL": "https://gusku.site/game/psy-high-2-high-summer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Psy High 2: High Summer\", \"description\": \"Looking for information on Psy High 2: High Summer? Check out the release date (Aug 15, 2019), developer insights from Choice of Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1135450/header.jpg?t=1565883271\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}