{
    "AppID": 413540,
    "Name": "Recourse",
    "Release date": "Feb 29, 2016",
    "About the game": "Curiosity is a sign of intelligence. Journey to a scenic arctic planet inhabited by experimental A.I. units and discarded robots. Play as Sleet, a sentient robot confronted with a series of puzzles and has little idea what's going on. Then meet Floe, an older A.I. unit, willing to help you proceed and unravel the mysteries of this beautiful desolate planet. Key Features Puzzle Variety: Recourse offers a content rich puzzle solving experience with more than 100 different elements. Length: It takes about 25-30 hours to finish the core game. Unlocking all possible secrets and achievements will take more depending on how good you'll become in the end. The core game consists of 14 large Puzzle maps in addition to 5 Payload and 5 Wave Rush levels. 3 Game Modes: Puzzle, Payload and Wave Rush (read more below). Character mobility: Dash, jet-boost, grapple, and fly your way around the levels to quickly reach any point. You are never ever limited to the ground. Unlockables: You can upgrade Floe, access new levels and if you manage to collect all golden question marks, you'll be awarded with the advanced modules for 'WINTER' - Floe's favourite weapon on the entire planet. Drop-In/Drop-Out Split-Screen Co-Op: A second player can seamlessly join or leave the game at any time to help you. Enemies: If you're ever bored of solving puzzles, you can dive into more action-packed game modes and battle your way through hordes of Failbots to unlock Floe's upgrades. Deployables : You can deploy eight different tools (Circular Saw, Incinerator, Tesla Coil, Laser, Vortex, Point A, Thumper and Singularity) to interact with the environment or counter enemies (find more information below). Environmental Hazards: It's not perfectly safe to wander around though. There are many hazards on the planet. Some of them can be turned on/off and even converted to your side. Color-coded Objects: Blue glowing objects are on your side. Orange glowing objects are on Failbots' side. Yellow glowing objects hate everyone. Achievements as Challenges: There are 53 achievements and many of them are rewarded upon the completion of a specific challenge. Challenges can be viewed at Floe's terminal. More to come: A free map pack is already in the works. It builds on the core game and introduces new puzzle elements and challenges. Small File Size: The total size of the game is less than 500 MB. It may come as a surprise as it's not even in the GBs. This was achieved through an integrated approach that combines good asset management, compression, 3D modelling and lighting features without giving up on production quality. Game Modes: There are three game modes in Recourse: Puzzle, Payload and Wave Rush which share elements but have different objectives. Each level contains a certain number of golden question marks that can be collected to ultimately unlock a mysterious weapon called ‘WINTER’. Puzzle Mode: The goal is to solve enough puzzles to reach the final checkpoint. Finishing puzzle levels unlock other game modes and levels. Puzzle levels are very peaceful: there are either very few or no Failbots that would disturb you. Payload Mode: Battle your way through armies of Failbots to collect their CPUs and deposit them to your wagon which must then be escorted to the finish line to complete the level. Deposited CPUs can be spent toward upgrading Floe. Wave Rush Mode: Failbots grow tougher with each wave. You can stay as long as you want or solve your way to the final checkpoint and complete the level when ready. Deployables: There are eight deployables that can be deployed to interact with the environment, solve puzzles and counter enemies. Each deployable applies damage in their own way. Circular Saw: Destroys crates (and more) blocking your way. Can be used to box in and damage Failbots. Incinerator: Burns enemies and affects heat-activated objects. Tesla Coil: A ranged tool that damages enemies with electric arcs. It also powers up sockets. Laser: Rotating lasers that damage characters and activate optical receivers. Vortex: Elevates and hurls enemies around. Powers wind-activated objects. Thumper: Screws itself to the floor and launches characters and physics objects in the air. Highly effective in launching enemies toward ceiling hazards or simply cause them falling damage. They can also break apart glaciers blocking your way. Point A: Teleports physics objects and characters to an activated Point B. Singularity: Pulls and traps enemies at its center. Can be used to turn slippery enemies into easy targets or pin them against environmental hazards. *",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/413540/header.jpg?t=1649019973",
    "Price": 19.99,
    "Developers": "Clouds and Blue",
    "Publishers": "Clouds and Blue",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_6c7adb7c7f3f0befbe16f98488a502f691e8a117.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_d96c77d128a1d20eada1e6fa1dbe8a45f667b1c5.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_ced609e3aa19e08d11bbb9e28dddcff364680a48.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_57398089b2c625734dfc4d46ff6910b05a3010ae.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_61460e1d89313a1d42ce7b18b54a4d70cbf035bc.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_2f3fbdaae8a356ac7ac6c79ccc6d35621fc0603d.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_a7c64a7c99c91dd2c46e9fc9f146d4ae69386501.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_c6b3670359602285e89d47c94df345ee2b7065db.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_534c25ba21d544bb9c88322d8cc59a2bff465584.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_b1aae428ee8813629dfe962071eb69fed4bb7eb8.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_16af877f4e1515259dbe875269f37ae8ee149e1e.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_2e67e89b0ea951da375d5a927455350740002d33.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_88682f4cfbb0c81235a1bc0eacc4a411aaa55352.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_36c60a2434924ff77f0f3a72caed3f3853437f8e.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_4da20ffe7a1e10e6dad131ca75fb1398d22669ff.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_819a385feb2e2263a4a0a3564b4b3ca229a21e22.1920x1080.jpg?t=1649019973,https://cdn.akamai.steamstatic.com/steam/apps/413540/ss_4677a0f0db0b185cd125881c72e76e06b4b2cd88.1920x1080.jpg?t=1649019973",
    "Slug": "recourse",
    "Meta Title": "Recourse: Feb 29, 2016, Clouds and Blue and Full Overview",
    "Meta Description": "Looking for information on Recourse? Check out the release date (Feb 29, 2016), developer insights from Clouds and Blue, and a complete game summary.",
    "Alt Text Image": "Official header image for Recourse game - Steam 413540",
    "Canonical URL": "https://gusku.site/game/recourse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Recourse\", \"description\": \"Looking for information on Recourse? Check out the release date (Feb 29, 2016), developer insights from Clouds and Blue, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 29, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Clouds and Blue\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Clouds and Blue\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/413540/header.jpg?t=1649019973\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}