{
    "AppID": 808980,
    "Name": "Rose Seed Replica",
    "Release date": "Sep 9, 2020",
    "About the game": "What if you got zapped to smithereens by some kind of alien contraption, only to somehow wake up in a remote space station far, far away from Earth? That'd be awful, right? But what if the lady who kind of did that to you actually turned out to be the loveliest person ever? And she liked girls too? What would that make it? Gay . There's no way around that. It's queer women kissing and messing with each other, feel-good slice-of-life, aloof banter, silly dates, an occasional serious topic, rainbows, awkward humor, bad puns, nonsensical mysteries and stuff. What's the big deal? 100% yuri 100% gay agenda 100+ choices to make 170,000 words worth of dialogue 6 different story routes 4 different romance types Awkward humor and light drama LGBT+ positive and inclusive Made by a lesbian Who are the characters? Sophie , the heroine of our story, is an ordinary gay scientist doing research for a somewhat shady private laboratory. Or, well, she was at least, until her disappearance from the planet put a definitive halt to her research and whole career. Even though Sophie can be kind of spontaneous and aloof at times, she's still a rather calm and sensible person in general. She loves cats and of girls, even though she rarely got to spend that much time with either. Bryn is the mysterious lady who kind of took Sophie with her to the far end of the galaxy. She appears cool and a bit quiet at first, but do first impressions ever prove right? Could her personality actually be quite different once she's comfortable with Sophie's company? Actually, who is she anyway, and what did she try to achieve? Even though she looks like a human, is she actually from Earth at all? Like, the technology she had in her possession definitely wasn't from Earth, and she might just have been a wee bit reluctant to accurately answer certain questions about herself. Some strange individuals inhabit the isolated place where Sophie and Bryn arrive. These individuals might turn out to be helpful as Sophie tries to make sense of the confusion. Depending on what Sophie does, they might even become friends with her over time. Also, even though meeting new people might be very unlikely somewhere in deep space, who knows if someone else could actually be transported there the same way Sophie and Bryn were. Like, whoever is behind the mess might have no reason to stop with the nonsense... How does this play? Well, you mainly just point and click to move around and talk to characters. You're also prompted for decisions at certain point of the game, and those will affect in various ways what happens later. Depending on how you interact with the characters and the environment, you can end up with different kinds of romances with Bryn, go to different kinds of dates, incite various levels of drama and do some weird and funny things. Oh, and you might also be able to make sense of some of the nonsense going around if you keep at it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/808980/header.jpg?t=1657514332",
    "Price": 14.99,
    "Developers": "LezLiz",
    "Publishers": "LezLiz",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/808980/ss_882a1e3fbe908fdf16deccca5538358b9dddc85e.1920x1080.jpg?t=1657514332,https://cdn.akamai.steamstatic.com/steam/apps/808980/ss_026f225fadb6653a3617ec27792ce0d1b4cfdacc.1920x1080.jpg?t=1657514332,https://cdn.akamai.steamstatic.com/steam/apps/808980/ss_b16f01229d8948c30646336d4f7ec0bf35dc040b.1920x1080.jpg?t=1657514332,https://cdn.akamai.steamstatic.com/steam/apps/808980/ss_7409ad9c34b0413ca4af1fb8860fbe406e8f77f9.1920x1080.jpg?t=1657514332,https://cdn.akamai.steamstatic.com/steam/apps/808980/ss_4f2232768e94e24cbbd5dcf580c33169a1669c9f.1920x1080.jpg?t=1657514332,https://cdn.akamai.steamstatic.com/steam/apps/808980/ss_41d27ec7af8af5509d7e2ae4aa529b1a4b65f1e0.1920x1080.jpg?t=1657514332",
    "Slug": "rose-seed-replica",
    "Meta Title": "Rose Seed Replica: Sep 9, 2020, LezLiz and Full Overview",
    "Meta Description": "Looking for information on Rose Seed Replica? Check out the release date (Sep 9, 2020), developer insights from LezLiz, and a complete game summary.",
    "Alt Text Image": "Official header image for Rose Seed Replica game - Steam 808980",
    "Canonical URL": "https://gusku.site/game/rose-seed-replica",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rose Seed Replica\", \"description\": \"Looking for information on Rose Seed Replica? Check out the release date (Sep 9, 2020), developer insights from LezLiz, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"LezLiz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LezLiz\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/808980/header.jpg?t=1657514332\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}