{
    "AppID": 955360,
    "Name": "Stronghold: A Hero's Fate",
    "Release date": "Nov 16, 2018",
    "About the game": "Defend your stronghold from invading monsters and lead your people to glory! Rule your territory, punish your enemies, and build your legacy in an epic fantasy tale that spans decades. Stronghold: A Hero’s Fate is a 250,000-word interactive fantasy novel by Amy Griswold and Jo Graham, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. Monsters have plagued your valley for as long as you can remember. But if anyone can destroy them, it’s you: you’ve already killed a powerful undead lich, and your sovereign was so impressed that he gave you a town in return. As the ruler of this new settlement, you’ll fend off invading goblin armies, flesh-eating bats, and feuding warriors in your quest to build a thriving community. Now that you have your own stronghold, will you raise an army to repel the monsters once and for all? Or will you hold power for a lifetime without ever attacking another soul? Harness your strength, cunning, and even magic to defend your citadel and help your people prosper. Invest in trade, mining, or farming—but choose your favorites wisely. Show mercy and forgiveness to your enemies, or be bold and aggressive as you expand your realm. Will the burden of governance make you serious and solemn, or will you retain your sense of humor and win fans near and far? Which groups will you please, when you can’t ever please everyone? And when the end draws near, will you be respected, forgotten, or reviled? Will you triumph as a great leader, or see your stronghold fall? Play as male, female, or non-binary, gay or straight. Enjoy an epic fantasy of adventure, friendship, and city-building. Lead your people as a bold warrior, clever diplomat, or fledgling sorcerer. Defeat a goblin army or make peace with your people's oldest enemies. Rule on blood feuds between your townspeople, or just judge the best pickles at the harvest fair. Court a spouse (or two), or found a new family with a sworn sibling. Select an heir to continue your legacy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/955360/header.jpg?t=1542574698",
    "Price": 5.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/955360/ss_b00a8fe3fa332dcf508e59b49b8bdcaaf5dfbc9b.1920x1080.jpg?t=1542574698,https://cdn.akamai.steamstatic.com/steam/apps/955360/ss_d54a17dbdf1c9a81304f7d269a8a41e238afdf45.1920x1080.jpg?t=1542574698,https://cdn.akamai.steamstatic.com/steam/apps/955360/ss_ef8f03c27952efbe1f32ba2a08250ea2fa845736.1920x1080.jpg?t=1542574698,https://cdn.akamai.steamstatic.com/steam/apps/955360/ss_0d15ae261de374bd144d097cc6f3770f5ec284db.1920x1080.jpg?t=1542574698,https://cdn.akamai.steamstatic.com/steam/apps/955360/ss_ce93c99a312a51ad1ac453ded35687fdac4ac367.1920x1080.jpg?t=1542574698",
    "Slug": "stronghold-a-hero-s-fate",
    "Meta Title": "Stronghold: A Hero's Fate: Nov 16, 2018, Choice of Games ...",
    "Meta Description": "Looking for information on Stronghold: A Hero's Fate? Check out the release date (Nov 16, 2018), developer insights from Choice of Games, and a complete...",
    "Alt Text Image": "Official header image for Stronghold: A Hero's Fate game - Steam 955360",
    "Canonical URL": "https://gusku.site/game/stronghold-a-hero-s-fate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stronghold: A Hero's Fate\", \"description\": \"Looking for information on Stronghold: A Hero's Fate? Check out the release date (Nov 16, 2018), developer insights from Choice of Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/955360/header.jpg?t=1542574698\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}