{
    "AppID": 990180,
    "Name": "The Ghost of You",
    "Release date": "Dec 21, 2018",
    "About the game": "The year is 1951, somewhere in a small town in Italy; and the lives of five women are about to take an unwanted dip into the dark waters of despair… You take on the role of a young woman called Libretto Pansatto, an aspiring violinist in her early twenties. Having recently suffered the loss of her mother, Libretto has never felt more hopeless. But in the midst of her life’s biggest tragedy, an exciting opportunity makes itself known – as she receives an invitation to watch her closest friend perform at the grand re-opening of the symphony hall in town. Soon after arriving at the hall, Libretto feels death is in the air around her…and realizes that this isn’t just any performance – but perhaps the last song that humanity might ever hear... The Ghost of You is a 510,000+ word epic about love, loss, and survival. You make the choices that shape Libretto’s character; and you shape just what kind of an ending you get. With two romance routes and ten possible endings, will you end up with the girl you love, or will you end up alone? Will you fight the evil going on in this place, or will you join it? And most importantly – will you survive the madness of the symphony hall? Are you prepared for what’s to come? 510,000+ words. The Ghost of You is a rich, in-depth look into the life of Libretto – and what can happen when just one person has an effect on the lives of so many. With half a million words, we'll make sure you get your money's worth! You decide on your game. Libretto’s fate is in your hands; from her words to her actions, you choose just what kind of path you want to set her on. Two romance routes! Decide between Mona Tenebre, Libretto’s lovelorn, gloomy ex-girlfriend; or Elisa Durante, the bright and charming childhood friend who has seen it all. Will either of them win Libretto’s heart in a place like this? A full soundtrack and 400+ unique sound effects. To enhance your reading experience to its fullest, we have included a classical soundtrack and plenty of haunting sound effects that will get you squirming in your seat. Ten possible endings. Under your guidance, Libretto can be a woman of many different faces; will she be a kind soul to those around her, or will she be an addition to the evil at work? The choice is yours...and the endings will reflect just what kind of person you were. An all 'yuri' cast. Alongside Libretto and her friends, you’ll also find several other characters to accompany you on your journey…or hinder it. This story is full of an all-female entourage that you won’t want to miss. Multiple Extras. With the main cast and all the history they bring with them, you can unlock many pieces of their story; and find out just why this symphony hall from hell really exists. A 75-page long extra route. A prominent couple in the main cast get their own opportunity to share their story - and you can read it after completing the game once. Just how do a mobster and a songstress with a heart of gold fall in love? You'll have it at your fingertips to find out!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/990180/header.jpg?t=1545437584",
    "Price": 5.99,
    "Developers": "Noodletub Games",
    "Publishers": "Noodletub Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_14309ecdf9232829ef1410bdf697a9ce165ff9b8.1920x1080.jpg?t=1545437584,https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_5e0a6adb7b0c447944545cb67253519056e093b6.1920x1080.jpg?t=1545437584,https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_949c6fb26368939a39e191ab93827eb805eb776c.1920x1080.jpg?t=1545437584,https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_ffc920afe6a3ab378233ee0660fbb8f176460de1.1920x1080.jpg?t=1545437584,https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_ce0d0756cfda3ffb336243eacd3458aba744b3e1.1920x1080.jpg?t=1545437584,https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_927974bba6ddc35cd27d82d3cc056a47f71e1b6f.1920x1080.jpg?t=1545437584,https://cdn.akamai.steamstatic.com/steam/apps/990180/ss_6d841679c35b0a1f486644516b8dbbfd805c47a2.1920x1080.jpg?t=1545437584",
    "Slug": "the-ghost-of-you",
    "Meta Title": "The Ghost of You: Dec 21, 2018, Noodletub Games and Full ...",
    "Meta Description": "Looking for information on The Ghost of You? Check out the release date (Dec 21, 2018), developer insights from Noodletub Games, and a complete game sum...",
    "Alt Text Image": "Official header image for The Ghost of You game - Steam 990180",
    "Canonical URL": "https://gusku.site/game/the-ghost-of-you",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Ghost of You\", \"description\": \"Looking for information on The Ghost of You? Check out the release date (Dec 21, 2018), developer insights from Noodletub Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Noodletub Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Noodletub Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/990180/header.jpg?t=1545437584\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}