{
    "AppID": 1755870,
    "Name": "The Monster Within",
    "Release date": "Oct 22, 2021",
    "About the game": "ABOUT THIS GAME Monsters roam the streets of the city, including you! Fight off sinister creatures while stopping yourself from turning into one too in this deck building card game. Craft a unique deck each round from Day cards, Night cards, and Monster cards. Do you try to stay above board and beat your opponents through clever investigation and tactics, use the seeder underbelly of the city to your advantage, or embrace your burgeoning evil instincts? Or maybe mix a bit of all three! Pick one of six different classic monsters to play as. Unlock new cards and characters as you play, unlocking more and more playstyles and strategies. Themed after 1950's horror comics, build the story of your battle with the cards you play. In classic deck building fashion, buy cards to use to damage your opponent, protect yourself, or just buy even better cards in the future. Over two hundred cards to play with and unlock. Take your pick of monsters each with their own cards and strategy. Feed on your foes blood as the Vampire, embrace the night as a the Wraith, make your opponents green with envy as the Plant, crush them with sheer bulk as the Blob, and more! As you loose health, you become more and more monstrous and the cards you can buy change. Keep your health high to stay in the Day, or intentionally let it slip to gain powerful Monster cards. Just don't let yourself fully lose control to the monster within! Fangs, Scaly Skin, Mysterious Secretions, take your pick of Afflictions each round to power up your character and find new strategies to win. What's a little inhumanity when it comes with such power? Use the Blood system to make the game more difficult the more you play it. The harder it is, the faster you'll unlock more content. The Monster Within is fully playable, with an expansive amount of content already. But it's not quite expansive enough, Since only six of the ten planned monsters are available to play, the game is still in early access. More monsters, more cards, and the fourth and fifth round with dual class monsters and the final boss are all coming soon, free of charge. Just buy the game now and you'll have access to all the upcoming content as it comes out with no additional purchases necessary. So get in there and show the competition why you're the meanest monster around!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1755870/header.jpg?t=1635044684",
    "Price": 14.99,
    "Developers": "GMO Free Games",
    "Publishers": "GMO Free Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_35406a5fa760b6861dd811908c6fabc6c8a5c0b9.1920x1080.jpg?t=1635044684,https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_02cdee1d93c7b8883e056a30082b512f7e8c33dc.1920x1080.jpg?t=1635044684,https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_2efdc3fe344f003e7ba43cb87d2299c036a5742c.1920x1080.jpg?t=1635044684,https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_797ea13fbd61c68f6116c94bec765f4aa519e97f.1920x1080.jpg?t=1635044684,https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_c30437925534587eb7f47494d8b429a921018db4.1920x1080.jpg?t=1635044684,https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_5e55e85904e80b56d45f3f342ff9526ce6d9e0f4.1920x1080.jpg?t=1635044684,https://cdn.akamai.steamstatic.com/steam/apps/1755870/ss_c83a320327ae3879ac4b9c5708a22811b0cb6be7.1920x1080.jpg?t=1635044684",
    "Slug": "the-monster-within",
    "Meta Title": "The Monster Within: Oct 22, 2021, GMO Free Games and Full...",
    "Meta Description": "Looking for information on The Monster Within? Check out the release date (Oct 22, 2021), developer insights from GMO Free Games, and a complete game su...",
    "Alt Text Image": "Official header image for The Monster Within game - Steam 1755870",
    "Canonical URL": "https://gusku.site/game/the-monster-within",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Monster Within\", \"description\": \"Looking for information on The Monster Within? Check out the release date (Oct 22, 2021), developer insights from GMO Free Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"GMO Free Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GMO Free Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1755870/header.jpg?t=1635044684\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}