{
    "AppID": 797020,
    "Name": "TinyWar high-speed",
    "Release date": "Feb 21, 2018",
    "About the game": "This game is 8bit style RTS. A lot of NES-like armies move on the screen and wage war. This game has a speed button for high-speed play. With 9 speeds up, you can win in 5-10 minutes per stage. Easy operation. Your color is 'Red'. You can build buildings on red areas. When you build a production-type-building, the building automatically creates armies. Armies advances to a nearest city of enemies. When you build a defensive building, the building automatically atacks enemy's armies. When you occupy all towns, you win. You get Buildings and Special Powers. Various stages are waiting for you! How to fight on the battlefield -1- Over time, you get war funds for the number of your city. Your color is red. You build buildings on the land of a red city using your war funds. When you build a production-type-building, the building automatically creates armies. Armies advances to a nearest city of enemies. When you build a defensive building, the building automatically atacks enemy's armies. Only infantry can occupy cities. When you occupy all cities, you end the stage. Select a map Battle begins with your battlefield selection. If your land is surrounded by enemies, you will be attacked from all sides. If your land is narrow, you can only place a few buildings. Four maps are displayed at random. And you can change it any number of times. As the stage progresses, the game becomes difficult. The number of towns will increase and enemy's initial war funds will increase. Special ability When you win, you can choose one building or special ability. Your choices will increase for each new stage. Special abilities have various effects. Ability to acquire war funds. Ability to increase range and HP for defensive buildings. Ability to call bears, monsters and guardians. Bomb : Ability to destroy all enemy units and stop production of enemies for a certain time. Repair : Ability to repair all your buildings and produce your units at once. Meteor : Ability to destroy enemy buildings at random. In order to acquire special ability, game strategy changes. How to fight on the battlefield -2- You should build a defensive building in the place where the enemy units come. You should build a production type building far from the enemy. Let's destroy the towers and fortress with tanks and Self-propelled artilleries. And let's occupy the city with infantries. If you have a lot of war funds, you may attack with fighters and bombers. You should minimize defense and maximize production. Let's overrun the enemy with the overwhelming number of units. Play at high-speed Waiting for unit production ... Waiting for the occupation of the city ... In the game you may wait for results. In that case you can change the speed of progress. You can speed up to 9. If you skip the wait time, you can win 5-10 minutes per stage.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/797020/header.jpg?t=1519270005",
    "Price": 9.99,
    "Developers": "Masakazu Yanai",
    "Publishers": "Rutenn no oheya",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_316f165ff49dbede70b4cca8c8619d187aa41b84.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_dfa0e8093ced8666cddd8a23b27ed711f421a285.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_a213408ea3c6c03aa774e2341958de1bba2892ee.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_78b8b8ac976319004036ecfe78d388511118b5a6.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_77abd48b544b0c15ae97db6c7790fb458906999a.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_1c9ed7ed3c4ec4fdb6bdf85ffad84d1affa07d9c.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_762751612d6d2b9997bb19e72a33ff2070ea705c.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_9e84249a83687f9f7543d5150500d5526f78463c.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_6a6f200b6f00f3aaf152db5b1f65f392709038c1.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_e0e1f7f5276d2f752a84ed52f0ca408b56b866cd.1920x1080.jpg?t=1519270005,https://cdn.akamai.steamstatic.com/steam/apps/797020/ss_7719017c74a5bab87c34ff2bf01e23ff4281755a.1920x1080.jpg?t=1519270005",
    "Slug": "tinywar-high-speed",
    "Meta Title": "TinyWar high-speed: Feb 21, 2018, Masakazu Yanai and Full...",
    "Meta Description": "Looking for information on TinyWar high-speed? Check out the release date (Feb 21, 2018), developer insights from Masakazu Yanai, and a complete game su...",
    "Alt Text Image": "Official header image for TinyWar high-speed game - Steam 797020",
    "Canonical URL": "https://gusku.site/game/tinywar-high-speed",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TinyWar high-speed\", \"description\": \"Looking for information on TinyWar high-speed? Check out the release date (Feb 21, 2018), developer insights from Masakazu Yanai, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Masakazu Yanai\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rutenn no oheya\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/797020/header.jpg?t=1519270005\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}