{
    "AppID": 1767570,
    "Name": "Tour de France 2022",
    "Release date": "Jun 9, 2022",
    "About the game": "BECOME A LEGEND In Tour de France 2022, you can create your own cyclist in Pro Leader mode. Choose your profile (climber, sprinter, puncher or versatile) and become a future winner of the Grande Boucle or a specialist of the great classics! Take control of a team in Pro Team mode! You start at the lowest levels and must prove yourself to receive invitations from organizers to high-profile races. Create your own tour with My Tour mode and the 92 stages available. Choose teams, rest days and stages to build your own unique tour. NEW FEATURES New online mode with leaderboard Race incidents (falls, illnesses…) New preparation system New interface on cobbled sections More intense races with a more aggressive peloton and more collaborative breakaways All 21 official stages of the Tour de France 2022 New ''Primavera Classic'' inspired by a major Italian race 3 new teams: Eolo-Kometa Cycling Team, Caja Rural-Seguros RGA and Uno-X Pro Cycling Team NEW ONLINE MODE: RACE OF THE WEEK Enjoy a new challenge each week, competing against players from all over the world as you try to reach the top of the leaderboard! The controllable team and objectives – e.g. win the overall classification, score more points in mountain stages – differ based on the race. NEW: RACE INCIDENTS You can now choose to enable or disable race incidents and their consequences. If you enable them (for yourself and your opponents or just your opponents), you can choose their frequency and enable or disable their consequences, which vary depending on the incident's severity: loss of power for a short or long duration, or even withdrawal. Be prepared to adapt because your strategy might need to be completely re-evaluated at any moment. NEW: RACE PREPARATION To add more unpredictability to races, a new preparation system has been added. Five random cyclists (from your team or in the peloton) will be especially well prepared for the race and five others may potentially underperform. Unfortunately, you can't know who these cyclists will be… You will need to keep an eye on all your opponents. OTHER IMPROVEMENTS To make the cobbled sections of races more immersive, we have added shuddering to the entire user interface. This new feature reflects the difficulty of cobbled sections. You have never experienced the Arenberg trench quite like this! In Tour de France 2022, the races are more intense than ever, with even bigger early breakaways and better collaboration in all breakaways. You will need to adapt your strategy accordingly!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1767570/header.jpg?t=1658481862",
    "Price": 39.99,
    "Developers": "Cyanide Studio",
    "Publishers": "Nacon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1767570/ss_434870432df29c75f5f013ba01debeb2cb4a7540.1920x1080.jpg?t=1658481862,https://cdn.akamai.steamstatic.com/steam/apps/1767570/ss_437e3cbe3d8013bda1c1a086ab2c245fd124685f.1920x1080.jpg?t=1658481862,https://cdn.akamai.steamstatic.com/steam/apps/1767570/ss_f51f29b6246755d658e996ee858df2e3adde5d91.1920x1080.jpg?t=1658481862,https://cdn.akamai.steamstatic.com/steam/apps/1767570/ss_684b930025d303dd5cf1cd826d5306dd9b47f0aa.1920x1080.jpg?t=1658481862,https://cdn.akamai.steamstatic.com/steam/apps/1767570/ss_3f620e1fe8cb734a16f96d144d2e6e8c82933fbb.1920x1080.jpg?t=1658481862",
    "Slug": "tour-de-france-2022",
    "Meta Title": "Tour de France 2022: Jun 9, 2022, Cyanide Studio and Full...",
    "Meta Description": "Looking for information on Tour de France 2022? Check out the release date (Jun 9, 2022), developer insights from Cyanide Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Tour de France 2022 game - Steam 1767570",
    "Canonical URL": "https://gusku.site/game/tour-de-france-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tour de France 2022\", \"description\": \"Looking for information on Tour de France 2022? Check out the release date (Jun 9, 2022), developer insights from Cyanide Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cyanide Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nacon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1767570/header.jpg?t=1658481862\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}