{
    "AppID": 1904160,
    "Name": "Trainz Plus",
    "Release date": "May 30, 2022",
    "About the game": "Trainz Plus offers the latest retail version of Trainz (TRS22), PLUS exclusive new features released on a regular basis. Stay ahead of the rest and be first to experience the latest updates and new content. You'll also enjoy a ongoing complimentary First Class Ticket for premium download speeds from the Trainz Download Station by choosing one of our Trainz Plus membership options. As of May 2022, the latest exclusive feature for Trainz Plus is Surveyor 2.0 , the brand new suite of tools making route building easier than ever! TWO TRAINZ PLUS MEMBERSHIP OPTIONS TO CHOOSE FROM: Trainz Plus - Standard Enjoy the latest version of Trainz (currently TRS22) and a whole lot more including: Exclusive access to new features added to the game as we develop them. Full Access to Multiplayer Surveyor (MPS) The brand new Surveyor 2.0 world building tools 22 different routes Over 100 Custom-built Sessions (or create your own) Over 1,500 traincars (locos, freight, passenger) Over 35,000 items in total to build your dream railroad A First Class Ticket for premium Download Station Access Experience Trainz Plus for just $7.99 for your first month. That's just 26 cents a day! Or less than 20 cents a day by choosing the Annual option. Trainz Plus - Gold Class Everything in Trainz Plus Standard + Access to the the full Trainz DLC library including additional Routes, Sessions and Rolling Stock (over US$3,000 value if purchased individually). NOTE: You can cancel membership at any time. Access will end at the end of the current billing period. Not into memberships? No problem. You can also choose to purchase TRS22 outright from the Steam Store. TRAINZ PLUS BONUS CONTENT Your Trainz Plus membership not only gets you the latest version of Trainz (TRS22), but you also receive this enormous list of Bonus Content from previous Trainz releases! TRS19 ROUTES: Canadian Rockies - Golden BC Sebino Lake - Italy Niddertalbahn - Germany Cornish Mainline - UK ECML Edinburgh - Dundee The Innter Kohn Necktion RR Belarusian Woodland Midwestern Branch TANE ROUTES Kickstarter County (TRS19) - (Fictional) Chesapeake &amp; Ohio RR, Hinton Division - (United States, 1950) ECML Kings Cross - Edinburgh - (United Kingdom, 1976) Healesville - (Australia, 1910's) OTHER BONUS CONTENT JR Loco Pack (7 Locos, 8 Freight Cars) Nickel Plate High Speed Freight Set LMS Duchess ETR 1000 - Frecciarossa NYC J3a- Dreyfuss Streamlined Hudson VR V499 Baldwin Early &amp; Late Models DRG Class 05 Steam TE3-1072 TE7-083 WHAT IS SURVEYOR 2.0? (EXCLUSIVE TO TRAINZ PLUS) Trainz has been best known for 20 years for the easy-to-use Surveyor world editing tools, with tens of thousands of amazing routes created by fans around the world. Trainz Plus now delivers Surveyor 2.0 (S20), the first complete overhaul of the world building tools in 20 years! Instead of dealing with assets one at a time, the new tools allow you to paint pre-built forests, towns and even yard ladders quickly and easily. Multiple items can be selected and moved or deleted in a few clicks. Everything you need to do is a click or two away, and the best route building tools just got a whole lot better! See the S20 online guide for more details. WHAT'S NEXT FOR TRAINZ PLUS? New features are added exclusively to Trainz Plus on a regular basis. Our next update will include a new User Interface in S20 which allows the route owner to add or remove content packages for use in that route. This is primarily aimed at MPS but will allow a user to determine which installed packages are required if they wish to share their route with other players. There are also a number of under the hood beta features including: .tzarc Compression (smaller files, faster loading) DX12 Support XAudio2 Support WHAT DOES TRS22 OFFER? A big part of your membership is access to the latest retail version of Trainz which, right now, means Trainz Railroad Simulator 2022. TRS22 is the result of 20 years of development, making Trainz the longest running train simulator in the world. We've come a long, long way and more and more people are discovering there's more to a train sim than just driving trains! TRS22 includes five brand new routes, each with a range of new sessions and highly detailed new trains for you to enjoy. TRS22 also delivers a brand new experience to Steam with 'Multiplayer Surveyor' (MPS) allowing you to build and drive in a world you create online with friends. (Of course you can still build offline with our user-friendly Surveyor route editor too). We've also added new tools, loads of new content and ensured that the vast majority of your earlier Trainz content is fully compatible. 1000s of Trains Get access to thousands of locos, freight &amp; passenger cars - both built-in and online through the Trainz Download Station or Content Store. 1000s of Routes Explore thousands of routes with FIVE of the best included in TRS22 (requires additional free download after installing the core game). Expand your collection by downloading free content from the Trainz Download Station or choose to purchase your favorite DLC content from the Content Store. BUILD AND DRIVE ONLINE WITH FRIENDS You can now Collaborate in real time. Build &amp; drive practically endless worlds together using the latest Trainz world building technology, 'Multiplayer Surveyor' (MPS). Trainz Plus MPS allows you to share your own route with others using the current MPS content set, and provides access to all other routes (subject to owner permission settings). Our next Trainz Plus update will allow route owners to create custom content packages for each route. TRS22 BRAND NEW ROUTES: Download any or all of these FIVE incredible routes in-game from the Content Store. (Trainz Plus also entitles you to a huge range of Bonus Content) 'West from Denver' - USA Drive from Denver to Hot Sulphur Springs in this beautiful detailed journey through rugged mountainous terrain. Stunning Detail - West from Denver takes full advantage of the latest Trainz features and content to bring you the best driving experience, including full seasonal support. Amtrak P42DC Phase V - The P42DC (GENESIS Series I) has been completely remodelled inside and out with incredible detail. Includes interactive sessions. Watch the trailer above. Schwäninger Land, Germany An expansive route including a busy main line, high speed corridor and local branch lines. Brimming with potential for many kinds of operations. A Route That Has It All - Whether it's InterCity Expresses, commuter services, bulk or local freight and marshalling operations, you'll find it all here. Industry &amp; Yards - Schwäninger Land plays host to several large yards on opposite ends of the route with several rail networks connecting them. Includes interactive sessions. Watch the trailer above. Liskeard to Looe, United Kingdom Liskeard to Looe is a stunning prototypical route based in the United Kingdom. Class 47 Locomotive - Experience the new Class 47 engine in spectacular detail. Class 47 Cab - Climb aboard the new Class 47 fully interactive cabin interior. Includes interactive sessions. Watch the trailer above. Bairnsdale to Orbost, Australia Bairnsdale to Orbost is a prototypical route set in the 1970-80s showing off an amazing recreation of an Australian outback railway. The Orbost Rail Bridge - Trundle across the famed Snowy River floodplain bridge at Orbost, one of the longest timber bridges in Victoria. VR T Class Locomotive and Cab - Climb into the fully detailed VR T Class interactive cabin interior and drive the 'High Cab' and 'Low Nose' T class locomotives! Includes interactive sessions. Watch the trailer above. Beloreck - South Ural Mountains, Eastern Europe Created by Ukrainian content creator Oleg, Beloreck - South Ural Mountains is a faithful representation of the railways of Central Eurasia and the Ural Mountain range. Two-system Electric Loco VL82 - Experience the prototypical VL82 engine. VL82 Cab - Climb into the fully detailed VL82 interactive cabin interior. Includes interactive sessions. Watch the trailer above. TRS22 NEW FEATURES MULTIPLAYER SURVEYOR Build &amp; drive practically endless worlds together using the latest Trainz multiplayer world building technology 'Multiplayer Surveyor'. We've streamlined the route building process to focus on user collaboration. Drive and create together using the most advanced multiplayer world building tech ever created for train simulation! UNIFIED DRIVER / SURVEYOR (UDS) Forget reloading the whole map to switch back and forth from Driver to Surveyor. UDS allows you to instantly switch between editing and driving and back again. Spot something you need to tweak? Just jump into Surveyor, make the change, and switch instantly back to Driver to continue on your way. NEW EFFECT LAYER TOOLS AND PRESETS Choose from a range of presets to quickly create new effect layers for your current route. Set up 'masks' to prevent effect layers from appearing under water, on a slope or above/below a certain height. Create and Edit custom preset effect layer assets (and share your assets via the DLS or .cdp). NEW EDITOR TOOLS Bulk Paint ground textures under a spline (e.g. add ballast under a track throughout the whole route or section of the route). Bulk Add effect layers to existing ground textures (e.g. add Turffx or clutter to a specific ground texture). NEW CAMERA OPTIO﻿NS We've unified the Driver and Surveyor camera controls while adding more camera modes such as Car, Walk, Fly and Drone. CONTENT STORE It's now easier than ever to organise your DLC with filtered tabs for Store, Purchased and Updated items. Search, install, uninstall, update and of course purchase with this powerful new interface. LOADS OF NEW SCENERY We've added over 1,000 brand new quality scenery items to offer even more variety in your route building options. GAME CONTROLLER SUPPORT Controller support allows you to drive trains and control cameras within Driver.* * Full controller support not available. NOTE: The minimum specifications shown allow you to run the game at low settings. Installing all the Trainz Plus content requires 150GB free disk space. Installing all the Gold Class DLC requires another 150GB+ free disk space.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1904160/header.jpg?t=1653966225",
    "Price": 7.99,
    "Developers": "N3V Games",
    "Publishers": "N3V Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_0ff2db332f5be733e932fdd5d9f1420fce94b6e0.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_e78f16489bcf3d2b60a6bf4ae9c009e8bce35b44.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_d18d6d1601fefc21b87f1c48fd75ceea416eca34.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_b331eeb122dee3715efbf3a410f59cf63ed1f4a5.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_ea70ea8c8707e0584db84267ac9b6c3bb029ee0d.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_765c3947732e41340ff9ede3c17df8cc55a1fb20.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_78c6aec31aa8806ca2cccb0b00014adca3638100.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_1460a4cf6dca5168698bc75c44d6c952215e2156.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_26893887d6d17ffdf6669935fece27aaf08ae2f6.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_585846c40f58374dce867a6b376e1bcdcf3d6987.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_723dbbb12b7cb0b0bc943ce0e519a9fce6240191.1920x1080.jpg?t=1653966225,https://cdn.akamai.steamstatic.com/steam/apps/1904160/ss_ff6738572e613a78a0acb8540960431f2ac2e23f.1920x1080.jpg?t=1653966225",
    "Slug": "trainz-plus",
    "Meta Title": "Trainz Plus: May 30, 2022, N3V Games and Full Overview",
    "Meta Description": "Looking for information on Trainz Plus? Check out the release date (May 30, 2022), developer insights from N3V Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Trainz Plus game - Steam 1904160",
    "Canonical URL": "https://gusku.site/game/trainz-plus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trainz Plus\", \"description\": \"Looking for information on Trainz Plus? Check out the release date (May 30, 2022), developer insights from N3V Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1904160/header.jpg?t=1653966225\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}