{
    "AppID": 1223390,
    "Name": "A Player's Heart",
    "Release date": "Feb 13, 2020",
    "About the game": "Find love, fame, and intrigue on the stage of the city's all-woman Opera! Put on a show, survive drama on and off-stage...and win your lover's heart. A Player's Heart is a 222,000-word interactive lesbian romance novel by Melissa Scott. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. You're a rising member of the all-woman Opera company, one of three great theater companies in the glittering rivermouth city of Tristendesande. But Tristendesande’s legal ruler is a three-year-old boy, and his mother the Regent is under ever-increasing pressure from the Castagi Ambassador to rein in the city’s notorious freedoms, the theaters among them. The Opera’s leaders are determined to stay neutral, but the louche, disreputable Electricity Theater—where, scandalously, men and women perform on the same stage, in the same acts—is equally determined to undermine the Ambassador’s influence. And in the hothouse of the theater, love and politics are always entangled. Who will you choose? Will you seduce your elegant rival at the Opera, Celeine, with a glittering smile and a dancer's grace, the remains of last night's paint on her lips as she helps you strive to be your best? Or the innocent Myrr, a genius 'artifex' on the stage crew: olive-dark, clever, quick and resourceful, holding you close with strong hands and broad shoulders? Or will it be Mervelles, the daring star of the Electricity Theater, with her dapper suit and deliberately messy dark hair, a nimble and sensuous dancer at home with her contradictions? Or perhaps you'll have the society hostess Jasquillyn Isalis, with her kohl-lined eyes and hair piled fashionably high, scented with rose perfume, diamonds flashing against her warm ivory skin. Save the day with your brilliant performance and win your true love's heart. On and off stage, a player's heart conquers all! Play as female, romancing women. Find love with a scandalous rival, a fashionable noblewoman, your reliable friend, or an ambitious fellow actress. Choose to play male roles, female roles, or to be a theater technician. Show your skill at intrigue in Madam Isalis's salon. Attend a scandalous performance and escape the watch. Bring your fellow players together, or seek to outdo them all. Court your love in a fencing match or through shared performance. And now, the curtain rises.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1223390/header.jpg?t=1581608828",
    "Price": 4.99,
    "Developers": "Heart's Choice",
    "Publishers": "Heart's Choice",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1223390/ss_5ba880172882df58d34d58738e70a39ee7e871b9.1920x1080.jpg?t=1581608828,https://cdn.akamai.steamstatic.com/steam/apps/1223390/ss_c91fd7c6b222be54ebb3d99c8c291ec0709adfa7.1920x1080.jpg?t=1581608828,https://cdn.akamai.steamstatic.com/steam/apps/1223390/ss_6b4c8c04da10c63210854588bbdaaeef1fd35a16.1920x1080.jpg?t=1581608828,https://cdn.akamai.steamstatic.com/steam/apps/1223390/ss_a6b5d4547a1081c3cd84b58d7f82d3655634c7c3.1920x1080.jpg?t=1581608828,https://cdn.akamai.steamstatic.com/steam/apps/1223390/ss_2123d1c0c004e9f2aee7a5697727f3ff29d0da59.1920x1080.jpg?t=1581608828",
    "Slug": "a-player-s-heart",
    "Meta Title": "A Player's Heart: Feb 13, 2020, Heart's Choice and Full O...",
    "Meta Description": "Looking for information on A Player's Heart? Check out the release date (Feb 13, 2020), developer insights from Heart's Choice, and a complete game summ...",
    "Alt Text Image": "Official header image for A Player's Heart game - Steam 1223390",
    "Canonical URL": "https://gusku.site/game/a-player-s-heart",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Player's Heart\", \"description\": \"Looking for information on A Player's Heart? Check out the release date (Feb 13, 2020), developer insights from Heart's Choice, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1223390/header.jpg?t=1581608828\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}