{
    "AppID": 1680650,
    "Name": "Astonishing Baseball Manager",
    "Release date": "Jan 14, 2022",
    "About the game": "Astonishing Baseball (or AB for friends) is not your usual baseball simulation game. It's not only about tables full of players and stats. It's about people! Well okay, you heard that line from your Economics 101 class already. But I promise, this game will be way more interesting! It's like a narrative roguelike sports game, Seriously! What's new in AB21 Already an AB player? Here are some of the main new features: Play historic seasons or try our brand new scenarios. There's a challenge for every kind of coach! Always play for the best team in the new career mode A new minor team system, where you can hire your coach and train your rookies! Edit the portrait of your favorite player, or import an online logo for your team! Congratulate your starter, taunt your rival or ask your fans what to do with your new rookie thanks to the Bleachers message creator! Hire a brand new coaching staff to get advice on contracts and strategies Join the excitement of the draft thanks to the new Draft projections, or the top prospect interview Enjoy a brand new history listing, retire your Hall of Famer number in the ballpark, or use the new player history to check past performances! Pick the menu at your stadium, and hire a chef to get the prestigious ballpark awards! Show who's the boss in the new World Cup, or admire the best players in the Power Contest and Pitching Contest. And more, like league records, improved game simulation, smarter AI, new awards, legendary players... Too much to describe here! Fake (but real) baseball players AB is about fake (sorry, virtual ) baseball players. Some you'll like, some you will hate, and a lot of them you will LOVE! That anonymous 'Jim' guy at the top of your lineup? Give it a few minutes, and he will become your favorite player ever. Or maybe he's actually very bad, and you'll send him finish his career in your minor league team, because he disappointed you. Poor Jim... And that starter, Sandy. Is he an ace or not? Well, maybe you should train him a bit. And make sure you have solid relievers to help him if a left-handed batter is giving him a headache. After all, you're paying him 12M a year, that's a lot! And he's asking for an even bigger extension contract now. Not sure you'll like Sandy after all... Oh but look, his nickname is 'Cubbie', that's so cute! Watch them evolve! One of your tasks is to draft rookies. And once you've drafted your first prospect... Let's call him John okay? Well, you're going to be very interested in John's life. Where to put him in the lineup? How much training does he need? Do I start him everyday, or does he need to go to the minor leagues first? Why is he suddenly struggling? Wait, it's getting better... HE'S THE MVP NOW! But is he really worth 20M per year? See, it never stops! The lineup of your dreams Okay so the team is not too bad these days, but you want to do a big move and win the Baseball Cup. Is it time to do a big trade with another team? Or maybe it would be better to wait next year and sign a big free agent during the offseason? Or maybe do both? One thing is sure, building the lineup of your dream is actually super hard! And you haven't even tested the 'Extreme Mode' yet. Or maybe you want freedom and receive job offers from other teams too. In that case, the career mode is for you! A living world Astonishing Baseball features an artificial but living world. Fans are posting about the game and your brand new rookie. Journalists write articles about your starter's last night performance. Players send you messages about their concerns or their contract. It's all about baseball! Fortunately, all these people are very positive persons! Except if they complain about their contract. Or their role in the lineup. Or the team performance... Well, it could be worse. It's not like they're French and complain all the time, right? For baseball fans and stats nerds Astonishing Baseball is very easy to learn. If you know the game rules, you'll know how to play! But if you're a sabermetrics savant, you'll find all kind of stats to satisfy your nerdy instinct! I even suggest to use wOBA. You don't know what wOBA is? Don't worry, according to very serious studies, about 99.999% of people don't care about wOBA. Good news, right? And now you can even see the future thanks to our WAR projections! Get international Not enough talent in your league? Send your incredible and local scouts to find the best prospects in the world, and then invite the most promising player to your team! But be careful, even the best scouts can make mistakes... My favorite one is named 'Francis Dupont'. Yes, he's French, from Paris, and he's always hyping up his prospects. Like 'Look, I just saw that guy from Strasbourg for three minutes and I'm rating him 80/80 and he's already in the Hall of Fame blablabla'. Best thing to do with Francis is to ask him to spend a bit more time on the prospect. Generally it ends with a final rating of 50+/80 and a simple 'I told you so'. I really like you Francis, but if you're reading this, do your job correctly please. Live incredible stories As a coach, you have a life too! In Astonishing Baseball, you can take your team to a burger restaurant, help local associations, but also meet your favorite author, become a rock star, visit Iceland and even marry the love of your life! Apparently I have to put a disclaimer here. You're not going to really meet the love of your life with this game. It's like... Your in-game soulmate, okay? If you like baseball, fantasy sports and simulations, or just good stories, you'll love Astonishing Baseball Manager! I hope. If you don't, I like messages!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1680650/header.jpg?t=1658162045",
    "Price": 0.0,
    "Developers": "Aerilys",
    "Publishers": "Studio Zero,Zero One Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1680650/ss_13e65ed6cbe0f77d1f486362911e653b680ffcda.1920x1080.jpg?t=1658162045,https://cdn.akamai.steamstatic.com/steam/apps/1680650/ss_1a463bbd3d9ee89b8f14d6d94766d6ad66804624.1920x1080.jpg?t=1658162045,https://cdn.akamai.steamstatic.com/steam/apps/1680650/ss_b059b4862e6dd9409b9411ba49397a8ac94a8f74.1920x1080.jpg?t=1658162045,https://cdn.akamai.steamstatic.com/steam/apps/1680650/ss_0358e329611ef6c49384450f8ef272a8b85e2202.1920x1080.jpg?t=1658162045,https://cdn.akamai.steamstatic.com/steam/apps/1680650/ss_e3666379c59c51f508f071e5dffde60fad2231a9.1920x1080.jpg?t=1658162045,https://cdn.akamai.steamstatic.com/steam/apps/1680650/ss_f3b91ef183fb0ea09e96ddaec8804fe08c70fc4e.1920x1080.jpg?t=1658162045",
    "Slug": "astonishing-baseball-manager",
    "Meta Title": "Astonishing Baseball Manager: Jan 14, 2022, Aerilys and F...",
    "Meta Description": "Looking for information on Astonishing Baseball Manager? Check out the release date (Jan 14, 2022), developer insights from Aerilys, and a complete game...",
    "Alt Text Image": "Official header image for Astonishing Baseball Manager game - Steam 1680650",
    "Canonical URL": "https://gusku.site/game/astonishing-baseball-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Astonishing Baseball Manager\", \"description\": \"Looking for information on Astonishing Baseball Manager? Check out the release date (Jan 14, 2022), developer insights from Aerilys, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aerilys\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Zero,Zero One Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1680650/header.jpg?t=1658162045\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}