{
    "AppID": 756790,
    "Name": "cityglitch",
    "Release date": "Feb 23, 2018",
    "About the game": "Glitches are trapped in the city! Go city witch, fly between rooftops to light the ancient runes of power. Light them to complete the ritual and set the glitches free. Beware! Glitches take on many forms. They haunt the rooftops as traps, spooks, and dark things that skitter. Scaredy cats will block your path and fearsome beasts will face you. Learn their movements to outwit them, and you'll progress to new cities with new challenges. Cityglitch is a game of small, bite-sized puzzles. Take turns moving around the board as glitches move and react to you. If a glitch catches you it will restart the level, but don't worry, with each attempt you'll learn more clues to complete it. Cityglitch starts with simple puzzles but ramps up quickly to challenge you! How to play: Each puzzle is a 5x5 board of tiles Press on your character to see available moves Click to move to any tile that you can reach You can move any number of tiles in a straight line (like a queen in chess) Pass over runes to light them Light all the runes to complete the level Avoid enemies by understanding their movements Use UNDO to go back one turn Use RESTART to try the level again Complete levels in the fewest possible turns to master them Features: Simple point and click controls Easy to play but offers deep challenge 95 tricky levels across 7 cities Fierce boss encounters Big shimmering pixels and glitchy shaders Synthy atmospheric soundtrack Steam achievements Optional turn count display with mastery goal Optional low graphics mode, with reduced shimmering Easily resizable window: play while watching streams or queueing for games Developer Note: Mindfungus is four friends making games together. We like to make small games with our weird art and music. If you like retro puzzle games with vibrant pixels, simple movement and devious challenge then Cityglitch is for you. If you have any problems playing the game or just want to say hi then hit us up on the forums, twitter, or our website. Thanks for reading, we hope you enjoy the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/756790/header.jpg?t=1565557401",
    "Price": 2.99,
    "Developers": "mindfungus",
    "Publishers": "mindfungus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/756790/ss_45d2b27461a73c05a46aa71e4e7b241141666290.1920x1080.jpg?t=1565557401,https://cdn.akamai.steamstatic.com/steam/apps/756790/ss_949d808ab8917abf43fb0b895af7d8c7d54ee15c.1920x1080.jpg?t=1565557401,https://cdn.akamai.steamstatic.com/steam/apps/756790/ss_d086751d0daaa3d6f137cb077f270eacbf68d3c6.1920x1080.jpg?t=1565557401,https://cdn.akamai.steamstatic.com/steam/apps/756790/ss_4b4e2a991413031af158710c0e8ca9c2ea51c417.1920x1080.jpg?t=1565557401,https://cdn.akamai.steamstatic.com/steam/apps/756790/ss_3b47b07654298514692db497fe5432aedd7fb8f3.1920x1080.jpg?t=1565557401,https://cdn.akamai.steamstatic.com/steam/apps/756790/ss_c52481b284eaf81afc52d7b99372d103d45fdc6b.1920x1080.jpg?t=1565557401",
    "Slug": "cityglitch",
    "Meta Title": "cityglitch: Feb 23, 2018, mindfungus and Full Overview",
    "Meta Description": "Looking for information on cityglitch? Check out the release date (Feb 23, 2018), developer insights from mindfungus, and a complete game summary.",
    "Alt Text Image": "Official header image for cityglitch game - Steam 756790",
    "Canonical URL": "https://gusku.site/game/cityglitch",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"cityglitch\", \"description\": \"Looking for information on cityglitch? Check out the release date (Feb 23, 2018), developer insights from mindfungus, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"mindfungus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"mindfungus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/756790/header.jpg?t=1565557401\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}