{
    "AppID": 1236670,
    "Name": "Codename: Terranova",
    "Release date": "Jul 27, 2020",
    "About the game": "OVERVIEW Codename: Terranova is a two player (Agent and Operator) Co-Op Communication Game. You will never play the same Mission twice: environments to explore, puzzles to solve and sequences to discover. Two players, two ways to play: PC and Web App. Speed and accuracy are required to complete the mission within the time limit and set a new record. Will you have the necessary concentration? A NEW FORM OF CO-OP COMMUNICATION “ Communication is not what we say, but what reaches others. ” (Thorsten Havener) This is the challenge proposed by Codename: Terranova: to communicate effectively, creatively, constantly adapting to unexpected and unknown situations. Do you already have your communication pattern? TIME To finish before time runs out: this is your goal. Time passes, stress increases and making mistakes becomes easier, and easier. An incorrect indication or hesitating too much in making a decision can cost you the Mission. The harmony with your partner will be put to the test! GAME MODE Choose how you play: QUICK mode or CAMPAIGN mode QUICK mode, designed for those who love to play for the pure pleasure of doing it. Fast sessions to spend your free time with the right teammate. Every module is a surprise. CAMPAIGN mode, where you must overcome a series of Missions with increasing difficulty, each containing a special challenge. Will you be able to position yourself at the top of the leaderboards? AGENT The Agent will explore the virtual environments with which he will interact. Their task will be to identify devices and objects, discovering how they work. Only by carefully following the instructions provided by the Operator will they be able to complete the mission unscathed OPERATOR The Operator, with the help of the Terranova Operating Central System (O.C.S.), will have to guide the Agent's movements and help them pass the various tests. But it will not always be so simple: the O.C.S. carefully guards important information. The Operator must keep a cool head, keep track of time, retrieve the necessary information and transmit it correctly to the Agent ONE COPY TWO PLAYERS The purchase of a single copy gives you access and use the O.C.S. for free. , to which you can connect from any type of Smart Device. Enter the connection code and… Good luck on your Mission! Take communication to a new level of interaction: get the best time, solve all difficult situations, overcome every operation. Requrements To play Codename: Terranova you need: A single copy of the game A voice connection A smart device (or a PC) A Friend Features Test harmony between the two players, interacting as much as possible and set the best time By purchasing a copy you can use the Terranova Operating Central System ( -ocs.acgames.it ) to play as Operator, free of charge Terranova Operating Central is a multi-platform connected app that can be used via the web.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1236670/header.jpg?t=1640345061",
    "Price": 23.99,
    "Developers": "ACGames",
    "Publishers": "ACGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_7b2529d2edf91a82a2dad073f54a4b85e5ae095e.1920x1080.jpg?t=1640345061,https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_1dad3b2dc60bb61a2f143d775f7f3d4e90102502.1920x1080.jpg?t=1640345061,https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_1f774575fcc0e0478184edeeac60f340e96d2a30.1920x1080.jpg?t=1640345061,https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_838e61d1f832360da7ac34b03d57c026b275fa89.1920x1080.jpg?t=1640345061,https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_b1b27001d56004c2bb39929b0508f96326992723.1920x1080.jpg?t=1640345061,https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_489d2b67608fe91e9ae0545a0b41a716ce868fdf.1920x1080.jpg?t=1640345061,https://cdn.akamai.steamstatic.com/steam/apps/1236670/ss_ca0aa881daaa555f74bee60d56c714c1f7e0079f.1920x1080.jpg?t=1640345061",
    "Slug": "codename-terranova",
    "Meta Title": "Codename: Terranova: Jul 27, 2020, ACGames and Full Overview",
    "Meta Description": "Looking for information on Codename: Terranova? Check out the release date (Jul 27, 2020), developer insights from ACGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Codename: Terranova game - Steam 1236670",
    "Canonical URL": "https://gusku.site/game/codename-terranova",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Codename: Terranova\", \"description\": \"Looking for information on Codename: Terranova? Check out the release date (Jul 27, 2020), developer insights from ACGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ACGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ACGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1236670/header.jpg?t=1640345061\", \"offers\": {\"@type\": \"Offer\", \"price\": 23.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}