{
    "AppID": 686680,
    "Name": "Computer Tycoon",
    "Release date": "Oct 12, 2017",
    "About the game": "Computer Tycoon is a grand strategy and business management hibryd about Computer Evolution and starting your own company in the 70s . Lead the research race until 2034, create the best hardware and operating system , take care of your infrastructure handle your marketing , lead your team of experts , find video game gems to promote them on your platforms, conquer the global market and become literally immortal ! HERE IS THE ROADMAP OF THE GAME! DISCORD Computer Tycoon is different from other building/tycoon games because it has a 'grand strategy game' aspect. You will control your 'computer empire' viewing a world map and managing resources. You won't build a park or railways, you won't arrange furniture in offices, instead of these you will analyze the market and find ways to be profitable, reinvest into research and push out your opponents from the business. Unlike other games, here you will see your opponents' products and their pricing, which will compete with yours on a simulated market. While Computer Tycoon is not as deep as GearCity it is definitely more complex than most of the modern Tycoon games today. This obviously means that the game has a steeper learning curve, but on the Beginner difficulty level (especially by turning off opponents) you can have a Sandbox-like experience as well. Start your adventure in the 70s as a small business somewhere in the world. Learn more about hardware and software inventions that were the first steps to our current modern world, and get a taste of what is waiting for us in the future. Find the classic video games and help a new culture to be born. In Computer Tycoon the decisions you make during development really matter. Take advantage of the technology, upgrade and design combinations! Does your product need more computing capacity or should you focus more on features, low price, or prestige? Maybe change to portable computers or develop more easy-to-use Operating Systems? These decisions will have a major impact on the success of your company. Expand your corporation in a smart way into multiple countries, build more offices, factories, laboratories, and other required facilities. Poor countries have cheaper labor, but richer countries will give you more educated engineers. Having the best product isn't enough. Finding the right partner and managers is as important as a good product. Balance your budget well between development, production, marketing, and expansion. You can win the game by becoming a monopoly or reaching the technological singularity if you are fast enough - but living trough 60 years of computer history is let alone a victory! The game is in an EA alpha state. It has bugs and missing/simplified features. Everything is subject to change. Please read the EA details! Also here is a brief list of what is and isn't included (yet): Features implemented Start a computer manufacturer company in the 70s Design and create hardware, home computers, personal computers, portable computers, and handheld computers Rule the market of the world on a grand strategy level Research and study the technology of the earliest models to the near future computers Expand your industrial sites across the globe World Map with algorithmically generated data for increased replayability Reviews about your products Historical world map with more realistic population/economy/border data Hire and lead a team of managers, advertise, train or steal if you must Features not implemented yet Tech trading and 'diplomacy' with the opponents (something like in Master Of Orion II or CIV) Random events Achievements/Steam Integration Localizations for a. Hungarian b. German c. Chinese d. French e. Spanish f. Turkish g. Italian h. Russian i. Portuguese",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/686680/header.jpg?t=1645441830",
    "Price": 19.99,
    "Developers": "Progorion",
    "Publishers": "Progorion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_df5c93f00708a0178a68a0fe371d73c0c3d0a152.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_284ebe0374bb78d5f2d229aece7cf6be36b8569d.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_ca541c5e8ba789c95ad1e9d2cfc2eb2a81b6548b.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_da928b69489b8ad7d66bb362a047c6b0b1cc36e8.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_813776b9f4d632fd58e572973fd1f1363e845804.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_65544618bdf6271a7b30c19f236e69eef5141338.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_92269998c601ce2d81d8b082b67aad50d7010a7f.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_17d3aaf348c2948b162fcd5ef630d3ced506376e.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_4acb252a483483e2394a9fcd941b364d254da84a.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_35d675e4a5081565532a69f7f2cc3cbf2ebc413e.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_a7e543c7b2a12cdf051115cb0e209271da4688cc.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_2fefaf2efcbcc8e4c3c6ff66188e0eea22c20767.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_648f2e04ef1d854ee473330a35d6aee1fcbc1b5e.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_a98465cfef4538fbe888d10475745d8a13bb5a74.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_476d312d31ca1baf0d93932d6c639097c6a13dbd.1920x1080.jpg?t=1645441830,https://cdn.akamai.steamstatic.com/steam/apps/686680/ss_1a0d6454351edb9bb76755c2b7b36e0acafb446d.1920x1080.jpg?t=1645441830",
    "Slug": "computer-tycoon",
    "Meta Title": "Computer Tycoon: Oct 12, 2017, Progorion and Full Overview",
    "Meta Description": "Looking for information on Computer Tycoon? Check out the release date (Oct 12, 2017), developer insights from Progorion, and a complete game summary.",
    "Alt Text Image": "Official header image for Computer Tycoon game - Steam 686680",
    "Canonical URL": "https://gusku.site/game/computer-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Computer Tycoon\", \"description\": \"Looking for information on Computer Tycoon? Check out the release date (Oct 12, 2017), developer insights from Progorion, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Progorion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Progorion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/686680/header.jpg?t=1645441830\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}