{
    "AppID": 666220,
    "Name": "CS2D",
    "Release date": "Nov 15, 2017",
    "About the game": "CS2D is a fast-paced top-down multiplayer shooter! FREE for Windows &amp; Linux! Two teams fight each other in action packed matches. With a variety of missions like bomb planting, hostage rescue, V.I.P. assassination, capture the flag, construction, zombies, deathmatch and team deathmatch. You have access to a huge arsenal of weapons - also including crazy stuff like portal guns, lasers, RPGs and much more. Play online, in LAN or against bots. Use the built-in map editor to create your own maps within seconds or write Lua scripts to modify and extend the game! CS2D is 100% FREE! Zero costs. No payments. No pay to win. No way to spend money. That's right! You don't have to pay anything to play this game! We just want you to have some fun! Fast paced online action (or offline against Lua scripted bot AI) Pistols, shotguns, rifles, sniper rifles, (S)MGs, grenades and many other weapons Many game modes: Classic (Bombs, Hostages, VIP), Deathmatch, Zombies, Construction... Easy to use map editor with entity/trigger system Console &amp; buy scripts Modify &amp; extend with Lua scripts (yes, we also have mods with funny hats!) Dynamic light effects and a 'GTA 2'-like top-down 3D mode Win &amp; Linux clients and headless dedicated server Many active players around the world, loads of custom maps and scripts! ... also... did we mention that all this is FREE OF CHARGE ?! Many different firearms and a tactical shield Fancy special armors (including a medic armor and a stealth armor) Medikits &amp; bandages (instant health recovery on pickup) Money items (gain money by collecting them) Close combat: machete, wrench, claw, chainsaw Special 'grenades': flare, molotov cocktail, gas grenade, airstrike, snowball Launchers: RPG launcher, rocket launcher, grenade launcher Mines: anti-personnel mine, laser mines And more: flamethrower, laser, portal gun, ... - over 70 different items in total! Classic mode with DE, CS and AS maps (bombs, hostages, VIPs) Deathmatch: just go crazy and kill everyone! Team Deathmatch with capture the flag and domination maps Construction mode: Build your own turrets, walls, teleporters, dispensers and more! Zombies! Try to survive or be a zombie and infest all survivors! CS2D has been around for over a decade and it has been improved with many updates A complete and working game! No early access! No wrong promises! WYSIWYG! The awesome CS2D community already created tons of custom maps and mods",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/666220/header.jpg?t=1629020337",
    "Price": 0.0,
    "Developers": "Unreal Software",
    "Publishers": "Unreal Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/666220/ss_eaf34d571db37507ce66bf0e37bc8b2cbc5b7682.1920x1080.jpg?t=1629020337,https://cdn.akamai.steamstatic.com/steam/apps/666220/ss_44bc7be7d2264a5d50dd6e0045162615ef0e2400.1920x1080.jpg?t=1629020337,https://cdn.akamai.steamstatic.com/steam/apps/666220/ss_1438f86559fc6f9278ec43cad7c9862fc07d0742.1920x1080.jpg?t=1629020337,https://cdn.akamai.steamstatic.com/steam/apps/666220/ss_998640e7f002ff38cccd65cc44c9011cd1b4dc36.1920x1080.jpg?t=1629020337,https://cdn.akamai.steamstatic.com/steam/apps/666220/ss_3ae027134e9e7ec64395c4011e22fc085eca1750.1920x1080.jpg?t=1629020337",
    "Slug": "cs2d",
    "Meta Title": "CS2D: Nov 15, 2017, Unreal Software and Full Overview",
    "Meta Description": "Looking for information on CS2D? Check out the release date (Nov 15, 2017), developer insights from Unreal Software, and a complete game summary.",
    "Alt Text Image": "Official header image for CS2D game - Steam 666220",
    "Canonical URL": "https://gusku.site/game/cs2d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CS2D\", \"description\": \"Looking for information on CS2D? Check out the release date (Nov 15, 2017), developer insights from Unreal Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unreal Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unreal Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/666220/header.jpg?t=1629020337\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}