{
    "AppID": 864310,
    "Name": "Destiny of a Wizard 2:  Beyond the Vale",
    "Release date": "Jun 7, 2018",
    "About the game": "THE STORY THUS FAR... Since the beginning, the legend of the Blue Wizards was known to everyone. People from all corners of the world came to behold their wonderful power. Life was peaceful for countless ages time until a rival, Darklin came to wage war against the Wizards and everyone who opposed him. This twisted Blue Wizard succumbed to the dark arts and made it his mission to destroy anything and everything living. While other wizards thrived on peace and tranquility, Darklin pleasures were chaos and destruction. . . ​A war waged on between the Blue Wizards and Darklin for many wearying seasons. In the end, Darklin was defeated and he was banished by the great Cecil to another realm never to be seen again. . . Darklin was never truly defeated and the Wizards knew this. They knew their power could also be used to bring back Darklin from his eternal prison. ​For this reason, the Wizards shut themselves away in secret never to be heard from the outside world again. This plan worked until a Dark Mistress named Zarra craved the same desires as Darklin and wanted to bring him back. Zarra tracked down the Wizard's hidden village and took great pleasure slaughtering every remaining Wizard except for two. . . ​A young child and her father. Before the village was reduced to ashes, the father hid away his child and told him about the coming of Darklin. This last hope... this last Blue Wizard was sent on a quest to stop Zarra’s plan and prevent the return of Darklin. . . ​As hopeless as this quest was,the young would-be-wizard did not shy from danger. The young child met the Sage of Light known as Lightin. This old sage would guide him to become a true Blue Wizard. He traveled to the glittering shores of the Vale Islands and embarked on a quest to discover the four elemental crystals. ​Slowly, the would-be-wizard unlocked his true potential! The last remaining Blue Wizard traveled to the dark island of Dark Mistress Zarra and confronted her! The battle is long and hard but our hero defeated her in combat! Yet before our hero could stop the twisted Zarra, she sacrificed the hero’s father to bring back Darklin! She uses a ritual not-so-named to bring him back and the final battle between Darklin and our hero commenced! ​The battle challenged everything in the weary warrior, but the last remaining Blue Wizard defeated Darklin and peace returned to the Vale Islands. Before Zarra’s Island sank into the depths below, the hero’s father told him to go adventuring and spread his wings. Let the world know that the Blue Wizards live again! THE STORY THUS NOW... Since the defeat of Darklin, our hero has embarked on a new journey beyond the Vale Islands. A new chapter has begun for him. He approaches a new land and according to the CrystalNET this is the land of Lulisa. ​What new adventures await the last remaining Blue Wizard? What sort of challenges will the inhabitants of the land present our hero? Will Lulisa respect the Blue Wizards once again. . . or will they remain in hiding forever? ​Our story continues where the hero is about to arrive at a small town known as Davowie. . . NEW FEATURES! * A linear turned based RPG spanning over eleven chapters, nearly 40 hours in game play content! * Old school retro combat returns with a new engine by MogHunter! * Comedy, fourth walls, and other references with a personal touch return! * Nearly over 75 monsters to contend with! * New voice overs! With over nine different voice overs played by various people, meet new and old characters alike! Nearly over 2 1/2 hours of voice recorded content! * Explore the land of Lulisa as well as the Vale Islands in a new world map stage select system! * New side quests and bonus features to discover and unlock! * Hire party members to aid you in your quest! From the high damaging Witch-Hunter to the mysterious tales of the Poet! Over ten different playable classes to choose from. Select up to three party members to aid your journey!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/864310/header.jpg?t=1629396940",
    "Price": 10.99,
    "Developers": "UltimaCJ Productions",
    "Publishers": "UltimaCJ Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_80499cd0cbd91b88fe616f8a80b9bc2f9608f807.1920x1080.jpg?t=1629396940,https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_973527b179a34f5f97968792222ce27fc8e50498.1920x1080.jpg?t=1629396940,https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_b210b55fae62c3b4c4ff48b31020ab6190e55fcb.1920x1080.jpg?t=1629396940,https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_c4dfb23b7326b52399943fa5499ca3ee295d346f.1920x1080.jpg?t=1629396940,https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_cb4aef65aa33f4f6a2dfee2e303361125434dc29.1920x1080.jpg?t=1629396940,https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_14d0f13d4a0964fc9e86013256f95aa9de026fea.1920x1080.jpg?t=1629396940,https://cdn.akamai.steamstatic.com/steam/apps/864310/ss_beec4c95c0d991c5b1a7da3bc27b133d430dd5e9.1920x1080.jpg?t=1629396940",
    "Slug": "destiny-of-a-wizard-2-beyond-the-vale",
    "Meta Title": "Destiny of a Wizard 2:  Beyond the Vale: Jun 7, 2018, Ult...",
    "Meta Description": "Looking for information on Destiny of a Wizard 2:  Beyond the Vale? Check out the release date (Jun 7, 2018), developer insights from UltimaCJ Productio...",
    "Alt Text Image": "Official header image for Destiny of a Wizard 2:  Beyond the Vale game - Steam 864310",
    "Canonical URL": "https://gusku.site/game/destiny-of-a-wizard-2-beyond-the-vale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Destiny of a Wizard 2:  Beyond the Vale\", \"description\": \"Looking for information on Destiny of a Wizard 2:  Beyond the Vale? Check out the release date (Jun 7, 2018), developer insights from UltimaCJ Productio...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"UltimaCJ Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UltimaCJ Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/864310/header.jpg?t=1629396940\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}