{
    "AppID": 1563850,
    "Name": "DIY MY LADY",
    "Release date": "Mar 20, 2021",
    "About the game": "DIY MY LADY (PC edition) is a creative game that combines AI, Sandbox and AR technologies. This game unleashes the creativity within players, as it allows them to customize a lovely girl avatar on PC. Different from other existing games on Steam, the girl avatar has an AI soul. Players can tailor-make their girl avatar’s body features and upload a photo from their computer to generate a face of their choice, which could be someone important to you. This creative game has all the following subsystems: (1)Face DIY from a photo This game is unique among all simulation games as it allows players to create faces through photos with one click. The AI technology used in this game ensures the complete copy of the photo uploaded by players. Note: The uploaded photo will be immediately reflected on players’ avatar, as shown in the above/below examples. All the head designs customized by the player will be stored in a 3D menu. Players can drag any head from this menu to their girl avatar for easy access. All 3D menus offer various options, which players can creatively use to customize their girl avatar. (2)Body/dress DIY editing Give your avatar a wonderful body which you love: Players can set their girl avatar’s body features at will. The 3D menu offers diverse options for bust, waist, and hip measurements. They can also choose their girl avatar’s skin tone, leg to butt ratio, and hairstyle as finishing touches. Players can pick the clothes for their girl avatar too. Players can unleash their creativity through the comprehensive and powerful control panel. Note: You can save up to 10 DIY avatars! (3)Design Actions/Animations, Sexy Movie Making Players can choose their girl avatar’s movements. The game offers a library of more than 200 daily actions and 60 sets of dance actions for players to set combinations. Players can also make a short movie by setting animation groups. Attention: Please abide the laws. (4)AI Interactions, chatting, comforting The girl can chat with players, both by text messaging or voice chatting (in the latter, a microphone may be needed). Anyway you like. She can understand 15 languages. Players can also personalize their voice dialogues/interactions with their girl avatar. For example, if a player says “I love you” through the microphone, the girl avatar will react by blowing kisses excitedly and joyfully. Note: Players can personalize their interactions with their girl avatar, as shown in the above example. They can type specific words or phrases through the provided virtual keyboard and then set how their girl avatar reacts to them. By doing so, players will only need to speak these words or phrases via the microphone, and their girl avatar will respond accordingly. (5)AI Love, hate, and demand (Red bar/Blue bar) The girl avatar can understand some popular voice commands and will respond accordingly. During the game, her mood toward a player will change, and she will behave differently following her liking. For example, the girl avatar will blow a kiss to show her love: By contrast, she will prefer to be alone if she is unhappy. The game is constantly under development to improve the demand functions recognized by the girl avatar. Thus, players can enjoy more demand functions in the future. Currently, the girl avatar can feel thirsty and drink water in some scenes (not all). She also displays excitement about playing with dinosaurs on the Dinosaur Island scene. (6)Dances/Customized Dances How to add your own customized dances? Players can simply choose a video from their computer and upload it to the game (a single dance is preferred). Then, its unique AI technology will extract an action from this video. This action will be learned by the girl avatar, as shown below. (7)Worlds and construction mode: Build your own homeland with your girl The current version has 380 worlds you can choose to live in and build your homeland. Embeded are following five interactive scenes: 1. The DIY Room, which is the main scene; 2. A pretty club, which includes dancing and carnival scenes; 3. The Dinosaur Island, which shows the beautiful world of dinosaurs; 4. A Sakura park; 5. A luxury villa, which is a perfect place for a couple. While other 370+ worlds can be added from the menu: DIY your lady. Build your homeland. Your beloved can always be there. Never fade away.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1563850/header.jpg?t=1658502488",
    "Price": 8.99,
    "Developers": "William at Oxford",
    "Publishers": "William at Oxford",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_b093a6cb22dda7089cea6ce6f75124d2c6dbd604.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_1d9ba2e41f8a02d3afea282dc0e200ed809daaf8.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_07d8a276721641b7b461989f006065b402043ec4.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_5f7aa48f49d181ae04e37f3ce147cefb26672430.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_a713c44c6a246960fd0dbef07c3b61b8605b9195.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_b43694c3f97aefd18098d1aa5f1f1db9be086e09.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_2802e2f33bb21416292d4ce7fcbfb7444a8c62eb.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_e7df0a79de8b459e63a442cede670b924dab2efc.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_4d847ece2b03d21f335d95475679a8fa903672af.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_664ca7348ba024ec034355c4b6d923c2b2852144.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_7789947e4a0ef272e62b453d83b6f631b2fcf3cc.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_9aea1ab19735ac7528814700abedc62aea0e11d5.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_d6632285ee339e311a80cdbf3f24bc0e60a34307.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_ea741818563812619f239b20febe708ea6732ab1.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_e99409d3f6e18413ec1221ca2da99761d75b68d3.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_78039212defbc1e7e5230dca25b88a98d146e4d0.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_385f02132188ae5d96737a7439e896dec9f9bdae.1920x1080.jpg?t=1658502488,https://cdn.akamai.steamstatic.com/steam/apps/1563850/ss_db9d4980a43f3a716269c5026d52bcafd73893da.1920x1080.jpg?t=1658502488",
    "Slug": "diy-my-lady",
    "Meta Title": "DIY MY LADY: Mar 20, 2021, William at Oxford and Full Ove...",
    "Meta Description": "Looking for information on DIY MY LADY? Check out the release date (Mar 20, 2021), developer insights from William at Oxford, and a complete game summary.",
    "Alt Text Image": "Official header image for DIY MY LADY game - Steam 1563850",
    "Canonical URL": "https://gusku.site/game/diy-my-lady",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DIY MY LADY\", \"description\": \"Looking for information on DIY MY LADY? Check out the release date (Mar 20, 2021), developer insights from William at Oxford, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1563850/header.jpg?t=1658502488\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}