{
    "AppID": 254300,
    "Name": "Dofus",
    "Release date": "Nov 15, 2016",
    "About the game": "A VAST WORLD JUST WAITING TO BE DISCOVERED! Step into the World of Twelve and explore its vast, lush landscapes, its gloomy moors and its many treasures. Its cities are bustling centres of commercial (and criminal) activity... The wildlife is magnificent, the water is pure, the air is fresh and sharp, and the earth is the most fertile you've ever seen... But behind the idyll, shadows and traps lurk... Its boundaries are still unclear, and new areas are being discovered all the time... especially since the Divine Dimensions, the worlds of the gods, opened up to brave adventurers. Fighting is an art. Rather than rushing in headlong, think hard about your tactical game plan. They work on a turn-by-turn basis: you take your turn to perform your actions, then observe those of the other players and monsters. Form a group of up to 8 players and attack the meanest monsters around! Are you on a quest for quests?: So what IS a Dofus? It's a dragon's egg! They exist in various shapes, sizes and colours. The ones we're really interested in are the six Primordial Dofus: Emerald, Ochre, Turquoise, Crimson, Ivory and Ebony. They are hidden, scattered all around the World of Twelve. Legend has it that the one who manages to gather all six will become as powerful as a god. So, what do you say? Ready to start searching? All work deserves payment!: Where there are professions, there is work. 'What?! Work, in a video game?' But don't forget that where there is work, there is pay! Work hard and you'll earn kamas in spades! Sound more appealing now? DOFUS offers 18 professions that can craft something as simple as a loaf of bread or something as complex as high-level hats, capes, belts, boots, rings, amulets, or weapons. You can even improve existing gear with the smithmaging professions. You're not alone! DOFUS gives you the chance to communicate with everyone in the World of Twelve. Share, conspire, offer advice... whilst remaining friendly and polite, of course! Don't be shy: break the ice, whether it's by facing a monster together, exploring a dungeon, discussing why Boowolves are so hairy, or simply sharing your best adventure stories! You can even put together a lasting team by founding (or joining) a guild. Whether you're part of a band of friends, a batallion of mercenaries or an association of Pandawas who love their Bamboo Milk, there's always a reason to get together! I can't hang out tonight, I have DOFUS stuff to do![/b]: As well as its exciting world, DOFUS has a special calendar. Each month has its own protector, who imposes his or her character and wishes on the month and its weather. As for the days, they are taken care of by 'Meridia', minor gods with their own themes and powers. Thanks to their Meridian Effects, each day in the World of Twelve is a little different... Whatever you like! Treasure hunter, fearless (and brainless) warrior, summoner of voodoo dolls... you'll be spoilt for choice. Of the 18 classes to choose from, some are more suited to close combat and some prefer to attack from afar, whilst others still focus on healing and protecting. The choice is yours...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/254300/header.jpg?t=1576224179",
    "Price": 0.0,
    "Developers": "Ankama Studio",
    "Publishers": "Ankama Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_3804d7c65dd3c037fb16496678dd24ddd6291d0a.1920x1080.jpg?t=1576224179,https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_12cfaced78ed31775dc3617e2aba8cfd79bf8d1b.1920x1080.jpg?t=1576224179,https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_f10d9044331a75cdbb0e09a3e49fe08744835bd9.1920x1080.jpg?t=1576224179,https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_a7be5bbf05709e12774d9bc889afcaaf8634fb67.1920x1080.jpg?t=1576224179,https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_9675ebc32a6669df3dcade32e1b754b333b807e4.1920x1080.jpg?t=1576224179,https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_e613c414361a119c49d3dc8e1a2eb28ee6068239.1920x1080.jpg?t=1576224179,https://cdn.akamai.steamstatic.com/steam/apps/254300/ss_2c958550144e30b49bc9a2b03362d802bff1122a.1920x1080.jpg?t=1576224179",
    "Slug": "dofus",
    "Meta Title": "Dofus: Nov 15, 2016, Ankama Studio and Full Overview",
    "Meta Description": "Looking for information on Dofus? Check out the release date (Nov 15, 2016), developer insights from Ankama Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Dofus game - Steam 254300",
    "Canonical URL": "https://gusku.site/game/dofus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dofus\", \"description\": \"Looking for information on Dofus? Check out the release date (Nov 15, 2016), developer insights from Ankama Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ankama Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ankama Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/254300/header.jpg?t=1576224179\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}