{
    "AppID": 1310950,
    "Name": "DRazor",
    "Release date": "May 23, 2020",
    "About the game": "You are about to defend our energy planet from enemy orbs. Use the cursor keys to fire lasers into the orbs that appear on the screen. The ones coming from above use the up key, from below, the down key. Only use the left and right keys for orbs that are moving side to side, from the left and from the right. In the easy and normal levels, you can shoot at any time. On the hard level, you have to wait until the cross icon disappears from the orb before shooting. Also in the hard level, if you try to shoot an orb with the cross or into a direction that has no orb, you will be blocked from using the laser for a few seconds. Until the window flashes blue and a 'released' message sounds. Also, from time to time a special type of weapon is used to destroy the planet. A big target type icon will appear and you must press X in your keyboard. In the normal and hard levels, you need to wait until the icon scales down and blinks inside the planet before you can press the key. You have a total of 4 levels per difficulty and on each level, you will receive a full shield and a set of bombs that can be used with the space bar. On the harder levels, the bombs also unlock the laser when blocked. To get higher scores, try to destroy orbs in a series to get combos that will multiply as you hit more and more orbs during a short period of time. Another way to get more points is to shoot orbs near the energy planet to get double or a million points. Also, there are 4 Play Modes. Mode A is the regular one, with just red orbs. Mode B has red and blue orbs and you must use the second set of keys to shoot the blue orbs and the regular keys for the red orbs. On Mode C you will have red, green and blue orbs. The secondary set of keys will select which colour you can shoot. The HUD colour will change to the one that you can target. Check the Options-Input settings to see and change key or buttons configurations. Have Fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1310950/header.jpg?t=1590878390",
    "Price": 0.49,
    "Developers": "Dash Dot Games",
    "Publishers": "Dash Dot Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1310950/ss_47e0a4b2b8dd063cda27218bb5e1adc1f9a470df.1920x1080.jpg?t=1590878390,https://cdn.akamai.steamstatic.com/steam/apps/1310950/ss_7fb9acd88839cfbbd1ea002db20e12a0bd0c81ee.1920x1080.jpg?t=1590878390,https://cdn.akamai.steamstatic.com/steam/apps/1310950/ss_c2b14e099bd0ec38bd68cb8cdf7a35f09df89e3b.1920x1080.jpg?t=1590878390,https://cdn.akamai.steamstatic.com/steam/apps/1310950/ss_dd22d7ed19e806c9b3cb04ec68e26bb3439b651f.1920x1080.jpg?t=1590878390,https://cdn.akamai.steamstatic.com/steam/apps/1310950/ss_555d257f99510e239b15e5fe05c30b45d797952a.1920x1080.jpg?t=1590878390",
    "Slug": "drazor",
    "Meta Title": "DRazor: May 23, 2020, Dash Dot Games and Full Overview",
    "Meta Description": "Looking for information on DRazor? Check out the release date (May 23, 2020), developer insights from Dash Dot Games, and a complete game summary.",
    "Alt Text Image": "Official header image for DRazor game - Steam 1310950",
    "Canonical URL": "https://gusku.site/game/drazor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DRazor\", \"description\": \"Looking for information on DRazor? Check out the release date (May 23, 2020), developer insights from Dash Dot Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dash Dot Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dash Dot Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1310950/header.jpg?t=1590878390\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}