{
    "AppID": 663300,
    "Name": "Enlightenment",
    "Release date": "Jul 24, 2018",
    "About the game": "Enlightenment is an action-shooter Roguelike game with a unlinear narrative. Players will venture into a Wasteland-inspired dungeon known as the Ark and experience a risky journey plagued by crisis. The original inhabitants of this dim underground complex and those who have dared to enter it have either died or have lost their mind. Will you be the exception to the rule? '...the asteroid hit the Earth in the end anyways, and fxxked everybody up.' 'So let's cut this short: An asteroid wiped out civilization as we know it. Some wasteland tramp discovered that the asteroid shards grant possessors unexplained powers; so they founded this cult, calling it the 'Scientific Church of Enlightenment' and this 'Church of Enlightenment' built the Ark and they built a whole city around it. It's gonna be where the restoration of humanity starts, they said. But just look around you; these streets are all empty, not a soul to be seen at all now.' 'Sounds worthy of your life to have a look... right?' Procedurally-generated Dungeons - In the underground complex of The Ark, use the environment to your advantage as you fight against enemies in challenging scenarios that change every time you enter the game. Unlockable Weapons and Items - As you return to the starting camp after death, talk to the different merchant to purchase potent unlockables like new guns and other consumables to help you on your next journey. Difficulty and Hardcore Play - In the beginning you may die a lot, maybe even 'a lot' a lot. Just give Enlightenment and yourself a bit more time and patience and everything's going to be alright. Smooth, Fast-paced Fighting Experience - As you get through the game, the fluidly-animated action and sense of accomplishment from overcoming what's thrown to you will provide a rewarding experience. Stay wary though, as there are a lot surprises! Weird, Post-Apocalyptic Story - In Enlightenment, you will obtain scattered information about the world constantly. These jigsaw pieces are hidden in item descriptions, the environment, and through NPC interactions which eventually form a 'Big Picture' look about the end of the world and the society, culture, and religion that it left behind. LizardKing is founded in 2015, we are 7 seasoned fervent gamers and work in a small city alongside Yangtze River, on top of the pursuit of perfection, we are also into both exploring the possibility of game-making.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/663300/header.jpg?t=1646643153",
    "Price": 11.99,
    "Developers": "LizardKing",
    "Publishers": "LizardKing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/663300/ss_2417aa146f5b405c40c60800adaae283a94636cd.1920x1080.jpg?t=1646643153,https://cdn.akamai.steamstatic.com/steam/apps/663300/ss_5ae1fb85188fd2870524cabbb6d0baf0ba8d4570.1920x1080.jpg?t=1646643153,https://cdn.akamai.steamstatic.com/steam/apps/663300/ss_0e401606f1c697b6a9237022d47cc42d328041a8.1920x1080.jpg?t=1646643153,https://cdn.akamai.steamstatic.com/steam/apps/663300/ss_171497b2a3c178292f14352b034072a168b283f8.1920x1080.jpg?t=1646643153,https://cdn.akamai.steamstatic.com/steam/apps/663300/ss_bed135d8f9bf3b14fd43923c14a6e97a837be38f.1920x1080.jpg?t=1646643153,https://cdn.akamai.steamstatic.com/steam/apps/663300/ss_d8c29f7538fd1d5010d4ed16a1dd33eeb6d7275f.1920x1080.jpg?t=1646643153",
    "Slug": "enlightenment",
    "Meta Title": "Enlightenment: Jul 24, 2018, LizardKing and Full Overview",
    "Meta Description": "Looking for information on Enlightenment? Check out the release date (Jul 24, 2018), developer insights from LizardKing, and a complete game summary.",
    "Alt Text Image": "Official header image for Enlightenment game - Steam 663300",
    "Canonical URL": "https://gusku.site/game/enlightenment",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Enlightenment\", \"description\": \"Looking for information on Enlightenment? Check out the release date (Jul 24, 2018), developer insights from LizardKing, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"LizardKing\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LizardKing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/663300/header.jpg?t=1646643153\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}