{
    "AppID": 536800,
    "Name": "FILE 9",
    "Release date": "Sep 30, 2016",
    "About the game": "We are still working on FILE 9 and close to finally launching for PC and also will have Oculus Rift support as well! While the overall of FILE 9 is still being added too with much more content, upgraded art, and UI, we are going to be launching an update in mid 2019 that will have all the current areas that are available now with updates. Included in update, will also be available for PC with full controller support along with support for Oculus Rift as well. We will continue to make our FILE 9 title a full story-based game, adding the additional areas as well as making major updates to the existing areas. New features will include: • The final two simulations, which will be story based and also will be in two unique, beautifully crafted environments • Terminal area overhaul to include asset upgrades, expanded play area ( secret areas hidden throughout the simulations), and a day/night cycle. • New and unique game play offensive and defensive tools for each simulation • Complete UI/UX overhaul • Complete asset overhaul • Complete sound overhaul • Steam Cloud saves • Steam trading cards • Steam leaderboards for select simulations • New Steam achievements for upcoming and existing simulations • PC with full controller support and Oculus Rift headset and controller support in room scale - Adding (Mid 2019) We will also be localizing FILE 9 in multiple languages to give the user a much better experience. Next major update in last quarter 2019 for all areas. We are expecting to have fully completed along with the DLC content available by November 2019. The initial areas available now are very engaging and are in the story line. We do encourage you to go into the lower area of the Main Terminal to get a better understanding of the back story. If you have any questions please contact us at info@cypressinheritance.com We will work to make sure this game from Cypress Inheritance is what it was intended to be, enjoyable AAA entertainment. FREE CST2 DLC FOR ALL PURCHASES OF FILE 9 FROM NOW UNTIL THE UPDATE IS LAUNCHED IN LATE 2019. The DLC will include the following: CST2 • Terminal area 2 with two new story based simulations • New unique environment for both the simulations and Terminal area • New tools built specifically for this new expansion • New achievement’s The cost for the DLC after November 2019 release will be $30.00 About FILE 9: FILE 9 built by Alfred Cypress, is one of the Sub Terminal Areas housing several areas within for Cypress training simulations. Each designed with their own unique features, using everything from stealth, weapons, searching, and sometimes strategy to achieve objectives. Reflexes and ability to stay calm will be tested under pressure but with patience and focus you can achieve success! Alfred Cypress has several locations around the world that are always in danger of a security breach or being hacked. This is due to what he has invented with energy sources as well as what he was currently working on. Because of these constant threats, he has created sub training areas away from the main training underground facility and hangars. This area is known as FILE 9. Here there are multiple programs, which include Transport Tunnel, Infiltrate and Destroy, Drone Evasion and others. Each has specific event possibilities to help be prepared and to overcome possible adversaries if necessary. Lorna, who was adopted at birth, grew up not anything about her birth family. Now she learns her actual grandfather is Alfred Cypress. This new along with Alfred's recent disappearance, comes as a shock. With the events that have followed since she has learned this, she knows she need to take advantage of as much training as possible. As part of the Cypress bloodline, Lorna is able to access FILE 9 and utilize each of these areas to prepare herself for what's to come. Currently within sub training area FILE 9, there are areas completed, that are up and running with more coming on line as completed. Each area does have its own unique features and will require skill to achieve the objectives and complete. Game Play Features Within FILE 9: Multiple areas to encounter. Active VR combat will be used within certain simulations. Maintaining endurance is essential to achieving goals. Stealth will be a huge asset within at least two more of the simulations that are coming on line in the near future. Enemy drones will be encountered and have to be avoided and in some cases destroyed. We will be featuring more back story segments within FILE 9 on the official FILE 9 site: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/536800/header.jpg?t=1557756070",
    "Price": 59.99,
    "Developers": "Cypress Inheritance, LLC",
    "Publishers": "Cypress Inheritance, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_082ad5639f080b838c4d5f68baaaf5888455c2c8.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_4edded6f12f7e7944e40babe8027b08fb4ba56b9.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_bfded8957a2e122e9781711c7d1c7d7378fd92b5.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_903f4cfe551c80a955b87bd8e1f91b277931670f.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_9ae589ff9d675cd25f4d3e8975b2c01a1ab855ab.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_657c3b9e27af6562879899123717fa39e20c3155.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_fb449d0d36e848986524da30385a82c29d13acb1.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_eb7b083593b5a5c896567c9aca522f8f2e5f47bd.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_b6d1ebada1bb142dc1357cae4ff391ef59d5565d.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_c120caf03e5137176bbe28bac31637d0c0b53b0a.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_aae86bb6aa31acf3e9b0571dfdd6ab5327e549e9.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_daf572fbf2584b0754a3204a5ec503587bb12c3c.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_2431faf7fa1f0f9141c6209e8abc5efe161acb68.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_2c4546be0f0a57ccd5a580febef36d955b7365ba.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_5e12adb2235ae74a8dea3d86236fb754e45be518.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_0e0142fbe6683311923ad9b48957026bb97ea096.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_a00aa0abc3d4f1af4b2b74eaab47f38ff1cc122f.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_b12bc2adf1ad5b210341fe02802ce8ad6355180b.1920x1080.jpg?t=1557756070,https://cdn.akamai.steamstatic.com/steam/apps/536800/ss_a390bbd758ff91610aa239cbf24ce49a427f81cd.1920x1080.jpg?t=1557756070",
    "Slug": "file-9",
    "Meta Title": "FILE 9: Sep 30, 2016, Cypress Inheritance, LLC and Full O...",
    "Meta Description": "Looking for information on FILE 9? Check out the release date (Sep 30, 2016), developer insights from Cypress Inheritance, LLC, and a complete game summ...",
    "Alt Text Image": "Official header image for FILE 9 game - Steam 536800",
    "Canonical URL": "https://gusku.site/game/file-9",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FILE 9\", \"description\": \"Looking for information on FILE 9? Check out the release date (Sep 30, 2016), developer insights from Cypress Inheritance, LLC, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cypress Inheritance, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cypress Inheritance, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/536800/header.jpg?t=1557756070\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}