{
    "AppID": 871140,
    "Name": "Great Old One - Arrival",
    "Release date": "Dec 3, 2018",
    "About the game": "Here is an honest introduction to the game. 'Arrival' is not a diablo-like game, except for the camera perspective. Friends who helped us with the test were asking us at the first sight of the game, is this the type of game Diablo? Yes, we are all Diablo, especially the Diablo 2 fans, but when we develop 'Arrival', we are more focused on the sense of the battle. We also love the rich RPG features of Diablo, which are presented in a simpler, more straightforward way in 'Arrival'. So if you're a fan of a heavy RPG system, 'Arrival' may not meet your expectations, it's our fault. If you like real-time and muson battle, 'Arrival' should be worth a try. Save the world in a simple way How can the last Guardians save the world in crisis? Although we provide unique settings and complete storyline in the game, in general it is the constant ascent of the Guardian's power to keep the Guardian strong enough to defeat the Great Old One who once again brought the world into crisis. In the case of saving the world, we still think that simplicity is the best way. The simple way does not mean that there is no difficulty and challenge, the Guardian can take advantage of the following features in game: - Careful and superb combat skills, brute force fight can not be won. - Use the different characteristics and attributes of various weapons will make the fight against a particular enemy more efficient. - Strengthen the Dragon pet which is a powerful force in the fight. The hero should never be alone. - The Magic card collected in battle can promote different attributes, choose the way you like to combine cards, you can create the most convenient fighting style. - Fighting is not the only way to be strong, the 'Master Turtle' has already seen through this point, remember must go to ask him. Message from Developer Arrival is an indie game that was developed by Zack Zhu and Lyle Shu. It is the first Real-time 3D Action Adventure game we developed. 14 months of hard work is a fun and challenging journey for Zack and Lyle. Thankfully, we can finally show the game. We do not want to use seductive and gorgeous words to describe it, because we also hope that there are many ways to achieve higher standards in mind. We expect the rhythm of battle in 'Arrival' to be so intense that it will be fun to have a brisk fight. We also try to avoid redundancy and deliberate procrastination in the rhythm of the game, entertainment time for everyone is very valuable. Your purchases and encouragement will help Zack and Lyle better to continue developing more fun games. We love games, we always feel that the most important thing in the world should be simple and happy. if we can create some such things to the world, it is worth our joy. Thanks to Exocet Yu for advice and testing assistance during the development process.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/871140/header.jpg?t=1543850375",
    "Price": 8.99,
    "Developers": "Mahjong Knight",
    "Publishers": "Mahjong Knight",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/871140/ss_e6bc9f075f4fdd47bfedc89374d21641e614505a.1920x1080.jpg?t=1543850375,https://cdn.akamai.steamstatic.com/steam/apps/871140/ss_8cbb6bb45e54da8fd70673179c0a7b686e8b316f.1920x1080.jpg?t=1543850375,https://cdn.akamai.steamstatic.com/steam/apps/871140/ss_5d811461032215bfa047c3cd633064850cc826c1.1920x1080.jpg?t=1543850375,https://cdn.akamai.steamstatic.com/steam/apps/871140/ss_7b0a240f3a425bdebdf692b536d270bb253e10da.1920x1080.jpg?t=1543850375,https://cdn.akamai.steamstatic.com/steam/apps/871140/ss_992aa1bc7cf5c817d3a7fa7d29fce3f0737c9a0e.1920x1080.jpg?t=1543850375,https://cdn.akamai.steamstatic.com/steam/apps/871140/ss_fd6f8e519400cfe3f969bb6486839d23febee594.1920x1080.jpg?t=1543850375",
    "Slug": "great-old-one-arrival",
    "Meta Title": "Great Old One - Arrival: Dec 3, 2018, Mahjong Knight and ...",
    "Meta Description": "Looking for information on Great Old One - Arrival? Check out the release date (Dec 3, 2018), developer insights from Mahjong Knight, and a complete gam...",
    "Alt Text Image": "Official header image for Great Old One - Arrival game - Steam 871140",
    "Canonical URL": "https://gusku.site/game/great-old-one-arrival",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Great Old One - Arrival\", \"description\": \"Looking for information on Great Old One - Arrival? Check out the release date (Dec 3, 2018), developer insights from Mahjong Knight, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mahjong Knight\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mahjong Knight\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/871140/header.jpg?t=1543850375\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}