{
    "AppID": 1023650,
    "Name": "Gun Man",
    "Release date": "Apr 26, 2019",
    "About the game": "its a 16 bit game Gun Man is a fun platform and arcade shooter where you need to complete the levels as fast as possible without dying. There are dozens of levels in the game, each one carefully created to provide you with platforming challenges as well as numerous shooting tests. Lots of enemies What makes Gun Man unique is the fact that you can enter various levels and each one of them will have one or more enemies. These are very fast so if you’re not careful they will shoot or stab on the spot. That’s why Gun Man is all about offering you ways to protect yourself, but you do need to be quick when it comes to reacting to this. Otherwise you will have challenges and you have to avoid that as much as possible. Level puzzles Sometimes you will have keys in the levels and these will help you open up the ending of that level. Which is quite nice, because you are always in control and you can have quite a lot of fun in no time. The experience shines for Gun Man just because you have to pass through multiple challenges and avoid traps in order to win. Traps are cleverly added all over the game world. And many times in order to reach a key you will have to do everything you can in order to win. It’s certainly rewarding and among some of the best and most interesting experiences that you can see out there. Test your skill At its core Gun Man is a game of skill and it continues to challenge you all the time. It’s designed to be a lot of fun and very intense, but you always have a fair shot at completing every level. Sure, some levels are very complex and challenging, however you can complete any level in the game. If a level seems hard, you need to improve your platforming skills and you will be more than fine. Gun Man is one of those games where the more you play it, the better you will get at it. And the skills you improve here will be great and suitable for other platformers as well. If you love platform games with exciting and cool gaming ideas and options, all you need is to give Gun Man a shot. This is a passion project from a developer that loves platforms and wants to bring you the most interesting, dynamic 2D platforming experience which is also very fun. Check it out today!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1023650/header.jpg?t=1608314656",
    "Price": 0.99,
    "Developers": "kessels game studio",
    "Publishers": "kessels game studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1023650/ss_f6d21889437a08169cece478499e3cc096458eb2.1920x1080.jpg?t=1608314656,https://cdn.akamai.steamstatic.com/steam/apps/1023650/ss_f5cb603fe6e6b6ac0f052cf8175c90cd6428ddd0.1920x1080.jpg?t=1608314656,https://cdn.akamai.steamstatic.com/steam/apps/1023650/ss_e117238f2e14dabc5e2816981000c4e91909cbc1.1920x1080.jpg?t=1608314656,https://cdn.akamai.steamstatic.com/steam/apps/1023650/ss_1604b04e5a40f9f34714e586aa7e3db6fac3e0ef.1920x1080.jpg?t=1608314656,https://cdn.akamai.steamstatic.com/steam/apps/1023650/ss_0138023e71970480191c13d22cd8710b1497fc26.1920x1080.jpg?t=1608314656,https://cdn.akamai.steamstatic.com/steam/apps/1023650/ss_c37fe4616b2525a11311c36c6144b5d1d6b406de.1920x1080.jpg?t=1608314656",
    "Slug": "gun-man",
    "Meta Title": "Gun Man: Apr 26, 2019, kessels game studio and Full Overview",
    "Meta Description": "Looking for information on Gun Man? Check out the release date (Apr 26, 2019), developer insights from kessels game studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Gun Man game - Steam 1023650",
    "Canonical URL": "https://gusku.site/game/gun-man",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gun Man\", \"description\": \"Looking for information on Gun Man? Check out the release date (Apr 26, 2019), developer insights from kessels game studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"kessels game studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"kessels game studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1023650/header.jpg?t=1608314656\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}