{
    "AppID": 608800,
    "Name": "Guns of Icarus Alliance",
    "Release date": "Mar 31, 2017",
    "About the game": "Guns of Icarus Alliance is the expanded and definitive edition of Muse’s flagship title Guns of Icarus Online , the original player-vs-player steampunk airship combat game. Alliance features all of the content from the original title, but with the addition of player-vs-environment cooperative experiences, an ongoing war between six elite factions vying for control of a world ravaged by machines, and an ever-changing world that is constantly being shaped and reshaped by the players. With a good ship and the right crew, you can conquer the skies - and maybe even the world! The ultimate co-op experience Players can take on the roles of pilots, gunners and engineers, working together as a single unit to maximize their airship’s effectiveness and own the skies. You won’t be told to stay still and not die while a veteran preserves their Kill/Death ratio. In Guns of Icarus Alliance, you are forced to work together. It’s an entirely interdependent gameplay experience that cannot be won by a single crew member. Your crew versus the world Take your airship and crew, and pit them against a huge variety of AI-controlled challenges, including escort missions, convoy raids, base assaults, and more. AI that learns The AI won’t take defeat lying down. Dynamic learning systems mean that every battle will teach the AI what tactics you use, increasing the challenge with every fight. Pit crew against crew In addition to AI-controlled missions, airship crews can also battle one-on-one against other human-crewed opponents. Every battle matters Rival factions are in a constant battle of wills to take and retain territory and control vital resources. Every victory and defeat will sway the tides of the larger war. Become a legend The story of Guns of Icarus Alliance is constantly being written based on the results of online gameplay. Achieve a key victory and your name may become part of the lore! A vivid steampunk world Lumbering, heavily-armored airships bristling with guns patrol the skies above a land ravaged beyond repair by an out-of-control industrial revolution. Build your own airship Starting from a selection of basic hulls, players can mix and match hundreds of custom parts to create their own unique airship, then assemble a crew to fly it. Your ship is your life Your ship is your collective life bar - when the ship goes down, the crew goes down with it. Every member of the crew plays an integral role in not only maintaining the integrity - “life” - of the ship, but also weakening the integrity of enemy ships as they work cooperatively towards a shared victory. The Industrial Revolution never ended. Raging out of control, the new machines consumed the world, staining the sky, scouring the land and poisoning the water. Humanity came to the brink of extinction, all but destroyed by their own unrestrained ingenuity. A few pockets of civilization survived, sheltering in the crevices of the world, and it is time for a comeback. Divided by wide expanses of toxic wasteland, a handful of these remnants have developed airship technology. Cruising through the sky, safely away from the poisoned earth, trade and industry could finally begin anew. However, with resources so desperately limited, war was inevitable. After years of isolation, the six factions have developed very different ideas about how this new world should be reclaimed. Reinvigorated by a fulfilled prophecy, the members of the Fjord Baronies don their ceremonial gowns in readiness to fight for lands that have been promised to them. With the Creed close to their hearts and an old, but formidable, armada of airships behind them, the Baronites venture forth to protect those who seek The Creed and to reclaim what is rightfully theirs. The King’s Seat, once occupied by a line of righteous high lords and ladies, is now led by the Silver-Haired Savior. Inspiration sweeps through these feudal lands and all are ready to take up arms to become whole again. Much of the world is teetering out of control, but the Chaladonians are only concerned with correcting a single aspect: sequestered in the eastern isles for too long, the Order of Chaladon now embarks on a mission to put an end to the ecological devastation that their mainland neighbors partake in. The days are already numbered as the natural balance of the world spirals out of control, leaving everything on the planet to die. The island dwellers ask, who will die first? With their advanced organic technologies, the Chaladonians are sure it won’t be them. Rapacious, manipulative, and aggressive are the most common words used to describe those of the Mercantile Guild. Only the desperation of a war-torn world would allow them to get away with the ruthless deals for which they are known. The Mercantile Guild knows everything has its price and they are naturally attracted to the best transactions. Nothing angers Merchants more than denying them a trade. With profits at their highest, the Guild worms its way into every nook and cranny of the world in the hopes of finding retribution and making their enemies pay the ultimate price. The Anglean Republic works to uncover the remains of an ancient civilization from underneath the northern icescapes. In these ruined, sunken cities, war machines spit smoke and artifacts harness the power of lightning. The Angleans claim that, through these relics, the Ancients whisper dark secrets to them. Despite the dilapidation, the buried cityscapes are proof to the Angleans that the time of the Ancients was a superior one. Instead of finding a new way of life, they believe a great one is waiting to be resurrected. With newly unearthed powers, the Angleans have become the deadly harbingers of a second Golden Age. Discord, disorder, and disarray have taken hold of the land for far too long. People wander in the wastelands without hope, and without purpose. What an unimaginable way to live, a life without meaning. This life doesn’t exist within the borders of the Yesha Empire. An aimless soul can once again find determination in one of its great western cities with their gardens of alabaster columns, and surrounded by great stone walls. Whether it be standing guard at a palace, minding the tops of tables at a restaurant, or fighting fiercely on the battlefront, a Yeshan can lead a fulfilled life by following their ordained path. With time, the desert turns all things to sand and dust - all things, except for the Arashi League. Made up of disparate tribes ruled by the most powerful warrior, the Arashi believe that only the strongest deserve to live. Weaker clans are trampled as the tougher ones join and fortify the ranks of the imposing League as it makes its way out of the desert into a world unknown. The Arashi thirst to be tested, to prove their might and dominance. To them, the world is but an arena where only one can be left standing. These are the six great powers that are currently known, but rumors abound of other nations secreted in remote strongholds, biding their time and gathering their strength. Who knows what the future may hold? Select your faction, build a custom airship, assemble a trusty crew and get ready to change the world! Every mission you undertake, whether it results in victory or defeat, will have an effect on the factional struggle for dominance. Play the way you want to: become a berserker who lusts only for battle and conquest, protect your domain from aggressive invaders, or take on one of your faction’s constantly changing list of objectives. Missions take a wide variety of forms, including straight-up airship battles, tense infiltrations, convoy raids, assaults on heavily-fortified bases and much more. Impress your faction and you will enjoy great rewards, from unique character costumes to powerful experimental weapons. The story of Guns of Icarus Alliance is constantly being written, and in-game events determine the course of the story. This means that a player who achieves a key victory, oversees a notorious massacre or repulses an overwhelming invasion may find that their name becomes part of the official lore. We are Muse Games, an independent studio based out of New York City. Our debut game, Flight of the Icarus , was the seed that would later grow into our flagship title. After releasing the unique and eye-catching platform game CreaVures in 2011, we dedicated ourselves to re-engineering our debut title into a fully-featured cooperative online airship combat game. We released Guns of Icarus Online in October 2012, right in the midst of Hurricane Sandy. Despite that challenging start, the game earned a loyal audience and built up a healthy community, passing the million player mark in January 2016. Since then, we have remained committed to supporting and expanding the Guns of Icarus experience. What was originally intended to be an expansion that would introduce AI opponents and player-vs-environment gameplay grew into a new standalone game - Guns of Icarus Alliance , the ultimate and definitive Guns of Icarus experience - which released in March 2017.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/608800/header.jpg?t=1569260269",
    "Price": 4.99,
    "Developers": "Muse Games",
    "Publishers": "Muse Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_53a17b5fac81868b96c3b2b7f536841d8a7d724a.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_1a2ab6e25a99fcf2e5ad5d278e396560ae6eab18.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_35408c5289aee4d90fc446fa65a4d2077055e549.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_6e14408071a37fd85d9bd6c12ff34f8aa05cd237.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_75dcd08a892a0ad545fad90471baf3fbbd97e3e7.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_638eda320c1f2c51e242b62dbc185f86e9f945da.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_cccd7e4fd1c5ca319743c0ab1142e70693eb0c7b.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_7d7d965ec59f8d003544d9f5c5a3c61d0f138b14.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_732e7825f5ed98b89266ec86cf0b886cc8fd7fae.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_fd4d6b9015ce9c06ebf328ec95561b28994df60e.1920x1080.jpg?t=1569260269,https://cdn.akamai.steamstatic.com/steam/apps/608800/ss_c19e604b27e77751a2931538b4d76b9cdcfca7ac.1920x1080.jpg?t=1569260269",
    "Slug": "guns-of-icarus-alliance",
    "Meta Title": "Guns of Icarus Alliance: Mar 31, 2017, Muse Games and Ful...",
    "Meta Description": "Looking for information on Guns of Icarus Alliance? Check out the release date (Mar 31, 2017), developer insights from Muse Games, and a complete game s...",
    "Alt Text Image": "Official header image for Guns of Icarus Alliance game - Steam 608800",
    "Canonical URL": "https://gusku.site/game/guns-of-icarus-alliance",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Guns of Icarus Alliance\", \"description\": \"Looking for information on Guns of Icarus Alliance? Check out the release date (Mar 31, 2017), developer insights from Muse Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Muse Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Muse Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/608800/header.jpg?t=1569260269\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}