{
    "AppID": 1619450,
    "Name": "Heart of a Warrior",
    "Release date": "Feb 1, 2022",
    "About the game": "The 1000 years of the defeat of the dark god, the kingdom of Azputa will have a feast of remembrance to celebrate their victory and their warriors for fought for the realm, but there are those who still worships the dark gods and secretly they planned to open the ancient gates of forbidden unleashing mayhem to the realm of men. The masked ones they are called. But to free the dark god they will need the blood of the old kings whose bloodlines are kept secret. You will play as Nahele, a young warrior with the old bloodline of kings as he embark on his journey to safe his twin sister from the hands of the dark god. Travelling through portals to different realms to find his way to the dark world. Quests and Loots Heart of a warrior is a quest driven adventure game, the main objective is to survive and complete the quest. To survive in this world, you will need to gather as much loots as possible, which you only get when you defeat an enemy or from hidden loot boxes scattered around the world. Dialogues and Interactions with AI Interact with the AI's by approaching the said AI. Dialogues with AI are text based and drives the quests. Skills The Skills depends on the weapon of choice you choose from the Inventory, The arch sword comes with it unique skill and so are other weapons of choice that you retrieve from the world. There are two types of guns available Long gun(sniper) and Short gun. The long gun is used to target enemies from far distance and the short gun for enemies that are close by. Combat Heart of a Warrior features an action-based first person combat system. It is a tab-targeting or auto attacks. In Heart of a Warrior the player’s weapon really matters and a player with better weapon will often defeat a player with less equipment. Crafting There is no crafting system available in Heart of a Warrior at the moment but can be included in feature updates. All weapons are already made and available for players to use. World Heart of a Warrior is set in the great world of Azupta. The first continent players will enter is called azupta , it is the realm of men and contains the gates of forbidden. The land of the Halflings is the second world the player will encounter and is a massive vegetation containing different types of creatures friend and foe. In total , there are 5 realms to visit (The Realm of men, The world of the halfling, The cursed lands, he desert world and the dark world) all rendered is stunning detail using Unity3d game engine.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1619450/header.jpg?t=1644494678",
    "Price": 10.99,
    "Developers": "Techworld Communication",
    "Publishers": "Techworld Communication",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_fa517c3b5ed4799b23086eacf298b2962ee6ee4c.1920x1080.jpg?t=1644494678,https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_d7d57a8014342ae5afff8c677959d25a41f7ae01.1920x1080.jpg?t=1644494678,https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_c126fa9bfa3660585906a8c48b7753ab2407991b.1920x1080.jpg?t=1644494678,https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_1905175dc5d9d0d496dfaacccbe6b68b19e21b56.1920x1080.jpg?t=1644494678,https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_684eafcf2ff7bd4ca6fa28f354256f5043d89516.1920x1080.jpg?t=1644494678,https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_b3dec1adf705615df1855e233256aa429ac4d469.1920x1080.jpg?t=1644494678,https://cdn.akamai.steamstatic.com/steam/apps/1619450/ss_4de1618317583f0efccaedb38070752e53cad1b0.1920x1080.jpg?t=1644494678",
    "Slug": "heart-of-a-warrior",
    "Meta Title": "Heart of a Warrior: Feb 1, 2022, Techworld Communication ...",
    "Meta Description": "Looking for information on Heart of a Warrior? Check out the release date (Feb 1, 2022), developer insights from Techworld Communication, and a complete...",
    "Alt Text Image": "Official header image for Heart of a Warrior game - Steam 1619450",
    "Canonical URL": "https://gusku.site/game/heart-of-a-warrior",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heart of a Warrior\", \"description\": \"Looking for information on Heart of a Warrior? Check out the release date (Feb 1, 2022), developer insights from Techworld Communication, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Techworld Communication\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Techworld Communication\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1619450/header.jpg?t=1644494678\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}