{
    "AppID": 1233690,
    "Name": "Hypergalactic Psychic Table Tennis 3000",
    "Release date": "Mar 3, 2020",
    "About the game": "Paddle your balls! Explore the vast hypergalaxies in the year 3000 or so to become the ultimate paddle champion of love and paddle skill. Upgrade your stats, learn new abilities, cast devastating spells and put someones underwear on your head while riding a swamp beast! Fulfill your destined purpose of romancing paddles through the ancient art of video table tennis! Plus! the first video table tennis role playing game to have full voice acting by Mark Meer (Commander Shepherd, Mass Effect). Nothing says 'Aw baby!' like some steamy romance between Video Table Tennis Paddles. Believe me. Nothing. The dynamic patented 'PaddleTalk™' dialog system will allow you to have deep and meaningful (albeit short and to-the-point) conversations with various boss paddles you encounter throughout the hypergalaxies. Upgrade your charisma and sweet talk those paddles to form rich, lasting relationships. Whether it's an epic encounter with a screen-cramming monster paddle or a tiny little baby boo boo cutesy pootsy poo paddle, every battle brings adrenaline pumping table tennis action and suspense! Except for the battle with the Possessed Piece of Pork. That one is mostly just weird. Holy moly. No exhilarating RPG experience is complete without a bevy of devastating spells, right? Right. Well in Hypergalactic Psychic Table Tennis 3000, a bevy of devastating spells you shall have! Cast Fireball to incinerate the little invisible hairs on your opponent in an instant. Cause them damage. Take control of physics itself (themself? themselves?) with the reality bending spell Psychic Repulsor. The world is your oyster when you're a powerful magic user. Or you know, just put all your level up bonuses into strength and bully your way through every conflict. Whatever. Tired of travelling the hypergalaxies without any clothes on? Don't worry about that, bruh, just crack open one of the many treasure chests you'll come across and inside its glorious containment space, you will find some amazing new equipment to wear. Stuff like a Slightly Ill-Fitting Tunic will give you the confidence you need for your next battle. Or the Boots With Fish in the Heels. Those ones will catch the eye of any paddle you're hoping to romance. Just don't worry about it, OK? Get dressed up. Be the best paddle you can be! Ever wanted to ride around on the back of a Moshi? I'm sure you have. Well now you can. Not only that, but there's also a Unicorb that sparkles in the moonlight, and a little Woodle. All sorts of majestic beasts are hiding in the bushes waiting to become your best friends and accompany you on your hypergalactic journey. Are you ready for friendship? You better be, buddy, because friendship is what you will get. What are you waiting for? The game's like so cheap and, honestly, who doesn't love a little table tennis? Especially when the ball is a square, right?! Get to it, buddy, get paddling those balls and smash them in the face of your foes. Smash your balls into the faces of everything you see. Hell, smash them on the walls if you have to... Don't worry they'll bounce off. Just get those balls wherever you think they need to go and trust me, you'll have some fun.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1233690/header.jpg?t=1618873549",
    "Price": 1.99,
    "Developers": "Blue Wizard Digital",
    "Publishers": "Blue Wizard Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_059ec36b16840e62683b1596eb21d4b26d24aa85.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_f079e9cd35ab6d113c8d7a64776187015e4c51bd.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_0555792826b010ae2c6360e44732954eeb93e9a9.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_4339281a4e4586afe43aba30f91d341e6fdfc371.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_8f56db2d17e1f5ae20e2f520a19998e4be92e882.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_8d73a281b2cc52daad87d60ec8cfba3b8a40bd59.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_3c51e0c3c90fdabdc1f732ff301bcb3b0e2e52c0.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_08360f4038dff3edce78eb324b6fb5ea24a10b15.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_c761159585b1cb288dd47f56501276c71d4941ac.1920x1080.jpg?t=1618873549,https://cdn.akamai.steamstatic.com/steam/apps/1233690/ss_343562f7ced3317ff633bd84227b7b31792ca013.1920x1080.jpg?t=1618873549",
    "Slug": "hypergalactic-psychic-table-tennis-3000",
    "Meta Title": "Hypergalactic Psychic Table Tennis 3000: Mar 3, 2020, Blu...",
    "Meta Description": "Looking for information on Hypergalactic Psychic Table Tennis 3000? Check out the release date (Mar 3, 2020), developer insights from Blue Wizard Digita...",
    "Alt Text Image": "Official header image for Hypergalactic Psychic Table Tennis 3000 game - Steam 1233690",
    "Canonical URL": "https://gusku.site/game/hypergalactic-psychic-table-tennis-3000",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hypergalactic Psychic Table Tennis 3000\", \"description\": \"Looking for information on Hypergalactic Psychic Table Tennis 3000? Check out the release date (Mar 3, 2020), developer insights from Blue Wizard Digita...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Wizard Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Wizard Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1233690/header.jpg?t=1618873549\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}