{
    "AppID": 58230,
    "Name": "MacGuffin's Curse",
    "Release date": "Apr 19, 2012",
    "About the game": "Help Lucas MacGuffin (magician turned thief turned werewolf) sneak and smash his way through this fiendishly addictive comedy-puzzle-adventure for PC and Mac. Winner of the Freeplay Award for Best Game Writing! With hilarious dialogue, charming hand-drawn art and huge replay value, it's perfect for seasoned adventurers and casual gamers alike. When fugitive magician Lucas MacGuffin bungles a museum robbery, he finds himself: magically bound to an ancient amulet; up against a city in full high-tech security lockdown; and suddenly dealing with the worst body hair problems he's ever had. As a human, Lucas is agile and cunning. Wolf Lucas would rather smash anything in his way. Only by transforming between the two forms and cleverly utilising both sets of skills will he stand any chance of lifting his curse. And with the city's most powerful billionaire after his blood, a jaded Private Investigator on his (now-literal) tail and the rent long overdue, he'll need every ounce of ingenuity he manage. Along the way he'll need to befriend a hilarious cast of characters, convince the city its most beloved citizen is a terrifying criminal mastermind, and hardest of all, teach his daughter it isn't funny to fill the fridge with dog food. From the award-winning indie developers behind Jolly Rover (Australian Game of the Year, 2010 Freeplay Awards), MacGuffin's Curse is a story brimming with humour, personality and heart. Key Features: Friendly for all players - Enjoy a quick, fun logic puzzle fix, or lose yourself in a sprawling full-length cartoon adventure. 150+ Puzzle Rooms - Inspired by classic top-down console adventures, these increasingly mind-bending challenges will push your logical thinking skills to the limit! Challenge Without Frustration - Stuck on a room? P.I. Strump is on the line to help you along (at least between thinly veiled insults) with a seamlessly integrated hint system. 90+ Sidequests - Meet the colourful nightlife of Feyre - a carnival city under curfew - and earn their trust with bizarre, legally questionable favours! Charming Hand-Drawn Art - Collect 50 lavishly-illustrated comic panels to piece together - each expanding on the scandalous secret backstories of key characters! Razor-Sharp Dialogue - With witty banter straight the golden age of point-and-click adventure games, you'll want to chat to every stranger and examine every park bench! Insanely Catchy Soundtrack - From spooky strings to acoustic gypsy power-rock, this fun, upbeat score is destined to have you humming along! Extensive Replay Value - Post-game challenges, hidden easter eggs, unlockable comics and developers' commentary will keep you coming back long after the credits roll.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/58230/header.jpg?t=1647374087",
    "Price": 9.99,
    "Developers": "Brawsome",
    "Publishers": "Brawsome",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_38430883ee979645a9cdc5e3481fa223fcf2aab8.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_e5feadd96fc6cd4f591c3f227b51c9c96d281531.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_84958b28d9180125af75fa2391749b4693c1033c.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_cf69f7a901f68a8331b0d0cfb81d66217c08c888.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_c294823200b5d2ea4a26db3b4e6c667545144de2.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_60079af87ec1296f32bcf4bbb948e159f978fc52.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_cf5d6abbe64563fc6c40f9c5a2a44140e4061e06.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_7ac5501114907c6ffac634f9db5a48d17f186fd0.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_49e721f7ca158934913cde2531d3183d8024d9bc.1920x1080.jpg?t=1647374087,https://cdn.akamai.steamstatic.com/steam/apps/58230/ss_708bce4512a289af4d2670a06a279439732b3963.1920x1080.jpg?t=1647374087",
    "Slug": "macguffin-s-curse",
    "Meta Title": "MacGuffin's Curse: Apr 19, 2012, Brawsome and Full Overview",
    "Meta Description": "Looking for information on MacGuffin's Curse? Check out the release date (Apr 19, 2012), developer insights from Brawsome, and a complete game summary.",
    "Alt Text Image": "Official header image for MacGuffin's Curse game - Steam 58230",
    "Canonical URL": "https://gusku.site/game/macguffin-s-curse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MacGuffin's Curse\", \"description\": \"Looking for information on MacGuffin's Curse? Check out the release date (Apr 19, 2012), developer insights from Brawsome, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2012\", \"author\": {\"@type\": \"Organization\", \"name\": \"Brawsome\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brawsome\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/58230/header.jpg?t=1647374087\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}