{
    "AppID": 503480,
    "Name": "Mahluk:Dark Demon",
    "Release date": "Jul 19, 2016",
    "About the game": "Run, jump and slash your way through an epic, vast world of challenges and embark on an epic adventure! The retro 2D hack and slash, platformer adventure game is now also available on PC. Help Mahluk on his adventure to stand against darkness and bring back the peace and serenity that once was. A dark civilization that lived long before mankind, and a evil, devil king powerful enough to rule the civilization, mankind and the world: Kindar. He ruled his world with cruelty for 3000 years. He sent the ones who did not obey him to the underground kingdom filled with pain, torture and misery. No one could come back, but only a mysterious one managed to escape. Legends say, he was an assassin or an exiled king. He was overcoming every obstacle in his path and moving towards to Kindar’s castle with anger and vengeance that can be seen in his red eyes. Evil forces could no longer stop him. If you enjoy classic hack and slash, platformer, retro adventure games, then you will love this! Forget looking for your old consoles and cartridges, you will be able to revive the nostalgic childhood memories on your computer. PLAY WITH THE MOST FEARLESS ADVENTURER. BE THE HERO, AND JOIN THE QUEST TO SAVE THE DARK PLANET NOW! Our retro styled addicting game will be one of your favorite adventure games. As we want to keep the vintage style, you can play the game with your gamepad or controller, and you don´t need an internet connection to play. Designed with love, we conjure up the spirit of old school adventure games giving an epic twist to the story, so you can feel like you are playing the most famous sagas on a new realm, with new characters and a new environment in this world. A GREAT ADVENTURE • Explore a magical realm full of dungeons, mountains, treasures... and horrendous monsters. • Gain experience and level-up and power-up your character. • Lots of dark areas to explore, and monsters to face off. ETHEREAL MAGIC AND SHARP SWORDS • Find powerful weapons, items and discover great spells to defeat your enemies in different ways. • Venture into gloomy caves and dungeons to discover powerful, hidden treasures. • Customize the controls to your preference. FEATURES • 16 handcrafted levels • 3 'End of the Act' bosses, • Over 30 different enemies like zombies, orcs, goblins, flying ones... • 4 different weapons. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/503480/header.jpg?t=1628139816",
    "Price": 3.99,
    "Developers": "Serkan Bakar",
    "Publishers": "Serkan Bakar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/503480/ss_998d1f161e1839e6a7722176fe3e152ec3d97b2c.1920x1080.jpg?t=1628139816,https://cdn.akamai.steamstatic.com/steam/apps/503480/ss_ce7fcf6d108acff9b920e9112e49e11b1ab49f96.1920x1080.jpg?t=1628139816,https://cdn.akamai.steamstatic.com/steam/apps/503480/ss_92a3240563f426a1a158b8d5ea72c5cac35c340f.1920x1080.jpg?t=1628139816,https://cdn.akamai.steamstatic.com/steam/apps/503480/ss_89fa7112205fc16eb92ff2b1c167fd9ef7797119.1920x1080.jpg?t=1628139816,https://cdn.akamai.steamstatic.com/steam/apps/503480/ss_cfa25f0c84b5f681380c1df85ce6718262b0b5df.1920x1080.jpg?t=1628139816",
    "Slug": "mahluk-dark-demon",
    "Meta Title": "Mahluk:Dark Demon: Jul 19, 2016, Serkan Bakar and Full Ov...",
    "Meta Description": "Looking for information on Mahluk:Dark Demon? Check out the release date (Jul 19, 2016), developer insights from Serkan Bakar, and a complete game summary.",
    "Alt Text Image": "Official header image for Mahluk:Dark Demon game - Steam 503480",
    "Canonical URL": "https://gusku.site/game/mahluk-dark-demon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mahluk:Dark Demon\", \"description\": \"Looking for information on Mahluk:Dark Demon? Check out the release date (Jul 19, 2016), developer insights from Serkan Bakar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Serkan Bakar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Serkan Bakar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/503480/header.jpg?t=1628139816\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}