{
    "AppID": 1946300,
    "Name": "Masks Of Deception",
    "Release date": "Jun 17, 2022",
    "About the game": "Masks of Deception is a 6 player multiplayer game where you must work together to find and expel a demon. However, correctly identifying the monster will be difficult as one of you has been possessed and turned against the rest. Use your senses and investigative tools to gather the information required to send this hellish creature back to the depths from whence it came, all while avoiding the fatal wretched beings that stalk these haunted lands. Note that one chance is all you get, and any mistake can lead to utter failure. Who is the Demon? In Masks of Deception, each match will contain a total of 6 players. One of the players will be possessed by a 'Demon.' The goal of the 'Demon' player is simple: they must either eliminate the other players or deceive them into thinking they’re innocent. The 'Demon' player will have a different set of abilities/perks than the other players: Steal: The ability to steal a random item from another player's inventory. Invisibility: *POOF* Go invisible for a short period of time to either perform other abilities or run away in order to avoid being caught after doing something suspicious. Summoning Circle Activation: Being the 'Demon' player, you must find and collect at least 3 hidden 'Demon Books' in order to unlock Demon Mode. After collecting at least 3 'Demon Books,' using this ability atop a summoning circle will unlock Demon Mode. Demon Mode: This ability lets you slay other players once unlocked. Once activated, your demon form will leave your body and enable you to roam and find your next victim! But beware, it leaves your body behind in a still state which other players can discover and identify you as the 'Demon'! Who are the Purgers? The players who are not possessed by the 'Demon' are considered 'Purgers .' The 'Purgers' are part of a secret society with the sole duty of expunging Demons and other evil foes from the Human Realm. Shrouded in mystery, there is not much known about the organization behind the 'Purgers' except they have been around a long time, and they follow no specific religious belief but accept all. As a 'Purger,' one of the goals and win conditions of a match is to figure out the following: Which player is the Demon. What type of Demon it is. The name of the Demon. You will accomplish this with many mechanics inside the game. Which Player Is The Demon As mentioned above, one of the players is possessed by the Demon. As a 'Purger,' you must watch the other players to see if they display suspicious activity. Depending on the play style of the Demon, this will either be easy or very difficult. Thankfully, there are some tools the player can use to help them. Each player has the ability to search other players' inventory. A player can go up to another player and request to see their inventory, and a player can accept or decline this request. Since Demons have access to hidden items such as Demon Books, or the ability to steal other players' items, it's an excellent tool to use against suspicious players. Figuring Out The Demon Type Spread out randomly throughout the environment, at the start of each match; there will be 'Paranormal Zones' in which the Demon and Human Realm are starting to combine, allowing paranormal activity to occur. With this activity occurring, you will use specialized equipment to collect data points. For example, one of the devices you can use is called a 'ParaMeter' which records E.M.F (Electronic Magnetic Fields) and temperature readings. You will use this device to get a specific reading, then use this data point and compare it with the Demon Database to filter down the demon type. Accompanying your equipment, you also have your senses to collect data points: your sense of smell and your current emotional state. But you have to work fast, as these zones spawn randomly and are only around for a limited amount of time. Name Of The Demon Spread throughout the environment, letters of the alphabet will spawn periodically to help the player figure out the Demon's name. The player can also use one of the equipment tools called a 'Ghost Box' to reveal more of these hidden letters, aiding you in uncovering the Demon's name. Threats Not only do the Purgers have to watch out for the 'Demon,' but there will be multiple A.I. threats in the environment that can attack them; this includes 'Shadow People.' These entities are from the Shadow Realm and are determined to bring the Purgers back to the Shadow Realm. To protect yourself against the 'Shadow People,' you must be in the zone of a U.V.E.D. The U.V.E.D is an item you can use inside the game. The Demon, however, is immune to these threats. Life After Death If you happen to fall victim to one of the threats, don't worry, you are not out of the game. You will enter 'Ghost Mode' in which you have a separate mechanic to win the match. Randomly spawned across the environment will be 10 hidden 'Sacred Pages' you will need to collect and turn in. If you find all 10 pages and turn them in, the 'Purgers' win! But these pages will be difficult to acquire and don't spawn in often.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1946300/header.jpg?t=1655736305",
    "Price": 13.99,
    "Developers": "Reflect Studios",
    "Publishers": "Reflect Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1946300/ss_f33c1b8e39fe173e94238ed59f8a69ab6afb1c37.1920x1080.jpg?t=1655736305,https://cdn.akamai.steamstatic.com/steam/apps/1946300/ss_f4d3128dbda39017d4afaa9ba56f9029fd15242d.1920x1080.jpg?t=1655736305,https://cdn.akamai.steamstatic.com/steam/apps/1946300/ss_c4919fb42438ed0c450846846ec05c8520cc5402.1920x1080.jpg?t=1655736305,https://cdn.akamai.steamstatic.com/steam/apps/1946300/ss_bb331332ef85f4a8dac65f8366a58a59f29b2743.1920x1080.jpg?t=1655736305,https://cdn.akamai.steamstatic.com/steam/apps/1946300/ss_98ab9fea684f4a6318ab0ca5acfb201eacf72ed4.1920x1080.jpg?t=1655736305",
    "Slug": "masks-of-deception",
    "Meta Title": "Masks Of Deception: Jun 17, 2022, Reflect Studios and Ful...",
    "Meta Description": "Looking for information on Masks Of Deception? Check out the release date (Jun 17, 2022), developer insights from Reflect Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Masks Of Deception game - Steam 1946300",
    "Canonical URL": "https://gusku.site/game/masks-of-deception",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Masks Of Deception\", \"description\": \"Looking for information on Masks Of Deception? Check out the release date (Jun 17, 2022), developer insights from Reflect Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reflect Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reflect Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1946300/header.jpg?t=1655736305\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}