{
    "AppID": 1788740,
    "Name": "MedaAbi",
    "Release date": "Mar 10, 2022",
    "About the game": "What is Meda Abi? An action game with mysterious characters! Enjoy the little adventures of the cloaked eyeball 'Medaman' and the purple demon king 'Abyss'! There are two built-in games, 'Make a wish that thing in the basement.' and 'L.Report,' in which each of them is the main character. By the way, I update my manga and illustrations every week on Twitter. Please check it out from the link on the right! Make a wish that thing in the basement. One day, Medaman learns something amazing from his friend Dogma. He says, 'There is a wish-granting thing in the underground ruins near the ocean! So they decide to have a competition to see who can get their wish fulfilled first. Megaman: 'I'm off!' A simple 2D platform game with stage clearing! Advance through the stages while firing shots from your eyes. There are some hidden items along the way that will increase your HP limit. There are bosses waiting for you in the middle and at the end of each stage! The boss battles are especially powerful in this game! Take advantage of an opening in their behavior! The boss battle is not a typical 'just hit the enemy and cut off the gauge' battle. It's more like 'find a way to deal damage from the enemy's attack pattern and deal damage'. For example, you can pick up an enemy's unexploded bomb before it detonates and throw it into the enemy's mouth. Each time you deal damage, the attack pattern changes, so it's fun to watch! L.Report While Abyss is taking a walk, a mysterious flying object appears from the sky! And the people who jumped out of it are giving him a bad name. Abyss gets pissed off and decides to beat them up, while also trying to figure out the mystery of the flying object...... Abyss: 'Let's go!' The genre of the game is 2D platform action game. In this game, you can gain abilities by defeating bosses. Use the various abilities to your advantage to get the game going! Let's make you the strongest. I'm going to beat the crap out of these weirdos! However, the first Abyss is super poor and can't even attack. Oh...... But! If you work hard and defeat the bosses, you get abilities! Furthermore, abilities are stacked on top of each other, so the more bosses you defeat, the stronger Abyss becomes. Depending on the combination, you can even stop time while spreading bomb shots in the air. Get your hands on these powerful abilities and beat up your enemies! There are a total of 27 different abilities that you can acquire, allowing you to customize the abilities of Abyss to your liking. Create the strongest Abyss you can! (It's still in beta right now, but we plan to update it to the final version!　Stay tuned!)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1788740/header.jpg?t=1653125832",
    "Price": 4.99,
    "Developers": "オモムロス",
    "Publishers": "オモムロス",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_0c98e0e2590fec22d5c48f6914fa450c715839b2.1920x1080.jpg?t=1653125832,https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_613fcd9193281e57be76ae379516d53f0d9a336a.1920x1080.jpg?t=1653125832,https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_ea758423c29ccb3bdbda599cfc7ce2e0f7296f88.1920x1080.jpg?t=1653125832,https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_d1f67a25933e486464c0cdc75e437dee4edd7c4c.1920x1080.jpg?t=1653125832,https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_1db8d6aedcc3f9446bfd272948751e2287159806.1920x1080.jpg?t=1653125832,https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_5f0f423df9bf6d459f3d1ad05d436cc2bc8f2418.1920x1080.jpg?t=1653125832,https://cdn.akamai.steamstatic.com/steam/apps/1788740/ss_8a9e9b32dd15dcbee2544e5e81a0ace1a26c71c1.1920x1080.jpg?t=1653125832",
    "Slug": "medaabi",
    "Meta Title": "MedaAbi: Mar 10, 2022, オモムロス and Full Overview",
    "Meta Description": "Looking for information on MedaAbi? Check out the release date (Mar 10, 2022), developer insights from オモムロス, and a complete game summary.",
    "Alt Text Image": "Official header image for MedaAbi game - Steam 1788740",
    "Canonical URL": "https://gusku.site/game/medaabi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MedaAbi\", \"description\": \"Looking for information on MedaAbi? Check out the release date (Mar 10, 2022), developer insights from \\u30aa\\u30e2\\u30e0\\u30ed\\u30b9, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u30aa\\u30e2\\u30e0\\u30ed\\u30b9\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u30aa\\u30e2\\u30e0\\u30ed\\u30b9\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1788740/header.jpg?t=1653125832\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}