{
    "AppID": 1582620,
    "Name": "Mega Man X DiVE",
    "Release date": "Sep 14, 2021",
    "About the game": "This version will first be launched in the following regions and territories: Taiwan, Hong Kong, Macau, Thailand, Singapore, Malaysia, Indonesia, Philippines, Cambodia, India, Turkey, New Zealand, Australia, United Arab Emirates, Saudi Arabia, United States of America, Canada, Mexico, Argentina, Bolivia, Brazil, Chile, Colombia, Ecuador, Guyana, French Guiana, Paraguay, Peru, Suriname, Uruguay, Venezuela For servers, players can choose the Asia server for one of the following regions: Region 1 X, Region 2 Zero, Region 3 Axel, Region 4 Vile. For players who have been playing the mobile version of the game (Asia server), you can bind your SteamID and play Mega Man X DiVE by downloading the Steam version via PC. The latest chapter in the classic action shooting game, 'Mega Man X'! Play as the legendary Irregular hunters X and Zero, and take on the internet world known as the 'Deep Log.' ◾Has the same computer world from previous versions of Mega Man X -- 'Deep Log'. An unexplainable error occurred in the Deep Log one day, causing the game data of 'Mega Man X' to malfunction. Use legendary heroes such as 'X' and 'Zero' to take on the Irregular data! ◾A literal and uncompromised presentation of authentic Mega Man actions Dashes, jumps, buster, and saber! The game retains the authentic actions of 'Mega Man X' and has added automatic aiming and 360-degree shooting. The unique optimization of this game makes movements even smoother! The size and positioning of the buttons can also be customized to make it even closer to the original 'Mega Man X'! ◾The Characters of 'Mega Man X' will be introduced one after the other The images and 3D models in this game have been recreated using the latest specifications. The characters of your memories will be introduced with brand new appearances! ◾Equip a wide variety of Weapons and boss Chips In addition to the necessary busters and saber, there will be a large number of weapons added to the game. Try the beam sickle of Grim Reaper Sigma and enjoy the thrill of tearing through enemies! In addition, collect corresponding chips by defeating bosses. Make boss skills part of your own arsenal, and swiftly defeat all of the enemies. ◾Experience the thrill of Co-op/Versus Modes This is the first time that the co-op system is implemented in the 'Mega Man X' series! Enjoy completing difficult levels with your friends. In Versus Mode, you can use the characters you've cultivated and show off various skills to defeat your opponents.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1582620/header.jpg?t=1646272947",
    "Price": 0.0,
    "Developers": "CAPCOM TAIWAN",
    "Publishers": "CAPCOM TAIWAN",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1582620/ss_e00d93504d01b2c0a3a70c8ce9a4f5164836ee66.1920x1080.jpg?t=1646272947,https://cdn.akamai.steamstatic.com/steam/apps/1582620/ss_cf3ff7d21fab5f5d03f64c0f29946d768db53788.1920x1080.jpg?t=1646272947,https://cdn.akamai.steamstatic.com/steam/apps/1582620/ss_fdf604f97c1b364d2dbe394dda4d7f69cb40adea.1920x1080.jpg?t=1646272947,https://cdn.akamai.steamstatic.com/steam/apps/1582620/ss_d4b70e3b30b85f669420114e504d5b65d3f0f359.1920x1080.jpg?t=1646272947,https://cdn.akamai.steamstatic.com/steam/apps/1582620/ss_1fd776c33a9c99a0ab140b4b7a7a0aa3b6babae7.1920x1080.jpg?t=1646272947",
    "Slug": "mega-man-x-dive",
    "Meta Title": "Mega Man X DiVE: Sep 14, 2021, CAPCOM TAIWAN and Full Ove...",
    "Meta Description": "Looking for information on Mega Man X DiVE? Check out the release date (Sep 14, 2021), developer insights from CAPCOM TAIWAN, and a complete game summary.",
    "Alt Text Image": "Official header image for Mega Man X DiVE game - Steam 1582620",
    "Canonical URL": "https://gusku.site/game/mega-man-x-dive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mega Man X DiVE\", \"description\": \"Looking for information on Mega Man X DiVE? Check out the release date (Sep 14, 2021), developer insights from CAPCOM TAIWAN, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CAPCOM TAIWAN\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CAPCOM TAIWAN\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1582620/header.jpg?t=1646272947\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}