{
    "AppID": 1777750,
    "Name": "Ninki Seiyuu: How to Make a Pop Voice Actress",
    "Release date": "Oct 14, 2021",
    "About the game": "FEATURES 20+ hours of story Two branching heroine routes Full Japanese voice acting by seasoned professionals A mostly-realistic glimpse into the voice acting industry! SUMMARY Production Bloom, a mid-sized voice acting agency, is chronically short on staff. To help out, Keito Nagakura, a family friend of the manager, is asked to work part-time, collecting scripts from the various studios and bringing them back to Bloom's office. But when his mother is hospitalized over her slipped disc (yet again) and has to take time off to undergo surgery, it's up to Keito and his younger sister Konatsu to fill in for her. Her occupation? Caretaker of Maikaze Dorm, a prestigious all-girls dormitory for the up-and-coming voice actresses and models who attend Seikadai Academy. One guy in a dorm filled with drop-dead gorgeous women? What could possibly go wrong? As Keito gets to know the lovely floormates, he finds himself mentor to a voice actress who's struggling to develop her career, the idol of his dreams, and... his little sister? How are actors cast for roles? What goes on inside the recording booth? And what are the secrets to succeeding as a voice actress? Step into the recording booth and find out what the fascinating industry of voice acting is all about! CHARACTER Itsumi Seno (Voice: Sora Haruka) Classmate of Keito, Itsumi is nothing if not a real go-getter. Not only is she the Maikaze dorm leader, but she’s also student council president of Seikadai Academy! But despite her best efforts, she just can’t seem to catch a break. While she has a regular gig as an extra in an anime series, there never seem to be any new jobs on the horizon that will give her that big chance she really deserves, and her agency is slowly turning its back on her. Will Keito be able to help her turn her luck around? Yukako Kurusu (Voice: Kanau) Yukako is the name on everybody’s lips. Known as Kurushii to her fans, her nickname comes from the fact that she's so beautiful, it's excruciating to be in her presence. With constant events and even her own radio show, she’s the hottest new idol around... but is being in the spotlight everything it’s cracked up to be? Keito is one of her biggest fans, but little does he know that the idol of his dreams is about to come crashing into his life. Konatsu Nagakura (Voice: Yui Kusuhara) Keito’s younger sister is a bright and bubbly girl who’s more than happy to help fill in for Mom as substitute caretaker of the dorm. She’s got a knack for cooking and an encyclopedic knowledge of voice actors, but the manager of Production Bloom sees something else in her... the potential to become a star voice actress! When Konatsu finds herself flung into the deep end of this complex and confusing industry, who better to turn to for support than her loving older brother?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1777750/header.jpg?t=1634259877",
    "Price": 39.99,
    "Developers": "MintCUBE",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_f4ba3887060a0576b66a8c955202f955cec7bbf5.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_efb7439b8c5aa3be46777f5712dc0fa75e97c37f.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_1e6994a6f5bacd8cbb7e1fa659537e79f20198a1.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_3e045cfed15b2626d54b313444dec86b696ece68.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_6ef2ef1aecb1ea58898f30daaba962d01f7a34b9.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_51b7d1c38f2cd19becb33ce7bd2075cb3dde8a7e.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_65ac46d15917bd7d47e1ef661eb4beebd3a3fbf2.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_625b61caee1463933bd6faa98bf54847b1b38bb6.1920x1080.jpg?t=1634259877,https://cdn.akamai.steamstatic.com/steam/apps/1777750/ss_30c21737bbba04565b579b782b70f1fb3982b865.1920x1080.jpg?t=1634259877",
    "Slug": "ninki-seiyuu-how-to-make-a-pop-voice-actress",
    "Meta Title": "Ninki Seiyuu: How to Make a Pop Voice Actress: Oct 14, 20...",
    "Meta Description": "Looking for information on Ninki Seiyuu: How to Make a Pop Voice Actress? Check out the release date (Oct 14, 2021), developer insights from MintCUBE, a...",
    "Alt Text Image": "Official header image for Ninki Seiyuu: How to Make a Pop Voice Actress game - Steam 1777750",
    "Canonical URL": "https://gusku.site/game/ninki-seiyuu-how-to-make-a-pop-voice-actress",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ninki Seiyuu: How to Make a Pop Voice Actress\", \"description\": \"Looking for information on Ninki Seiyuu: How to Make a Pop Voice Actress? Check out the release date (Oct 14, 2021), developer insights from MintCUBE, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MintCUBE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1777750/header.jpg?t=1634259877\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}