{
    "AppID": 1371520,
    "Name": "Red Colony Uncensored",
    "Release date": "Aug 12, 2021",
    "About the game": "Red Colony Uncensored is the developer's original idea for the game that was too lewd for other platforms. Experience this Ecchi inspired Horror Game in its true glory. The Red Colony was supposed to save the human race, not end it. . . After a crazy scientist plays God and experiments with the colonists’ DNA, a deadly virus infects them and turns them into blood-thirsty zombies. Maria is trapped in the turmoil and desperately searches for her daughter in this Ecchi inspired Horror Game. However, the secrets she finds in her personal life and the colony means she will have to be the Hero and rid the colony of the wicked virus. Red Colony Uncensored Features: - Anime character design. - 3 Types of outfits. - Twisted story. - Blood, gore and horror! - 2DTCT (2D Tear-Clothes-Technology)...(!?) - Drama inspired by 'The Bachelor' and 'High School of the Dead'. - Graphic Novel story-telling with more interactive and immersive gameplay. - Uncensored and true to its original intent. Hi! I'm Maria, CEO of LAB. LAB is one of the most exciting places to work at in the Colony. At LAB we are paving the way for the future. I've been CEO for five years and have been leading the way on some groundbreaking projects that will help all of us in the Colony. Even though the Red Colony follows a strict Communist Code and each individual's work is as important as the next, I do believe that LAB is the heart of the Colony and the most important thing for our future. Recently we received a big check from the Mayor, which we have put towards upgrading our equipment, expanding the LAB facility and hiring new staff (some of which come from the Blue Colony... That will be interesting...) Plus, our most exciting and revolutionary project at the LAB is. . . Sorry, I get so carried away with work! I can't tell you all of our secrets. I forgot to mention that I'm married to James, the Mayor of the Red Colony (Convenient, I know) and we have a beautiful daughter together called Diana. She's just as smart and beautiful as her mother. Life in the Red Colony is perfect, there's nothing that could ever spoil our wonderful commune. The Red Colony follows a strict communist code. The inhabitants all aim towards a common goal for the betterment of the Colony and humankind as a whole. Insulting another person's work can lead to huge fines, imprisonment or in the worst case; banishment from the Colony. In the early days, it was clear that capitalism and competition would cause more harm than good for the Colony. Thus the Founders wrote 'The Communist Code' whereas the neighbouring Colony chose capitalism as a founding principle. Over time, the colonies have become rivals, leading to an arms-race. Ironically, both colonies have similar goals but very different approaches. Thus, the arms-race is to see who will succeed first. Travel between the colonies has become more difficult than ever, especially since you have to travel by air. To do this, inhabitants must be presented with a special permit to visit the neighbouring colony. Therefore, interaction between the inhabitants of the two colonies is near impossible. 2DTCT (2D Tear-Clothes-Technology) To get to the flesh, Zombies like to tear through peoples' clothing. When Maria's clothing reaches 0%, she can no longer fight off the zombie horde and will get bitten. Be careful! This game contain Mature Content such as Blood, Gore, Nudity and Swearing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1371520/header.jpg?t=1635448294",
    "Price": 7.99,
    "Developers": "RunicCodes",
    "Publishers": "RunicCodes,Shinyuden",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_7077fb02b66fed0260ae62fb33348f6e0582d406.1920x1080.jpg?t=1635448294,https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_e98d65d183e843ec3e6f50c2f89daf83f57e9834.1920x1080.jpg?t=1635448294,https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_0ac0fd1bb1354eca01e8b28476a212517323583c.1920x1080.jpg?t=1635448294,https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_bbe8b3dfc38fde17b8b248a0425c55e895baa64c.1920x1080.jpg?t=1635448294,https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_6b254931f0aad4aed2b9d37cf90ecbc0f33a5398.1920x1080.jpg?t=1635448294,https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_cea0ab0e90a9edf5875184467bc0344d3c632020.1920x1080.jpg?t=1635448294,https://cdn.akamai.steamstatic.com/steam/apps/1371520/ss_db0e92f5a38382bc1cf7eeee90f2cbc42db1d29f.1920x1080.jpg?t=1635448294",
    "Slug": "red-colony-uncensored",
    "Meta Title": "Red Colony Uncensored: Aug 12, 2021, RunicCodes and Full ...",
    "Meta Description": "Looking for information on Red Colony Uncensored? Check out the release date (Aug 12, 2021), developer insights from RunicCodes, and a complete game sum...",
    "Alt Text Image": "Official header image for Red Colony Uncensored game - Steam 1371520",
    "Canonical URL": "https://gusku.site/game/red-colony-uncensored",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Red Colony Uncensored\", \"description\": \"Looking for information on Red Colony Uncensored? Check out the release date (Aug 12, 2021), developer insights from RunicCodes, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"RunicCodes\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RunicCodes,Shinyuden\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1371520/header.jpg?t=1635448294\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}