{
    "AppID": 1343400,
    "Name": "RuneScape ®",
    "Release date": "Oct 14, 2020",
    "About the game": "Journey into the Sixth Age of Gielinor and discover a fantasy world deep with legend and lore. Gielinor's people may be thriving, but the Elder Gods still scheme. The clouds are darkening and war looms. Experience a fantasy online world 19 years in the making. It's up to you. Will you explore the world with friends, or seek your fame and fortune as a lone adventurer? Whether you’re engaged in daring quests, quietly tending to your farm, risking it all against a high-level boss or spending a night at the circus, RuneScape is the perfect second-screen game. Play how you want – the choice is yours. What type of hero will you be? With a world that’s been growing for an incredible 19 years, RuneScape continues to thrill players with an adventure unlike any other. With 270 million installations and cross-playability on PC and mobile, join the hundreds of millions of people who have explored the fantastic and mystical world of Gielinor. Make friends – and maybe sometimes enemies – with a rich roster of memorable NPC characters. From lovable companions and friendly rogues, to deceitful villains and vengeful gods, the many faces of Gielinor offer a deep fantasy experience unlike anything else. Visit dozens and dozens of unique and striking locations, from the medieval castles of Burthorpe and the tranquil harbours of Catherby, to the dangerous barren expanses of the Wilderness or the tropical reaches of Anachronia. Own your own port! Run your own farm! Make a pretty penny trading with players at The Grand Exchange, and keep your exotic wares safe in the Bank. With 28 skills to master, what will you become? Will you be one with nature by perfecting Woodcutting, Fishing, Herblore and Cooking? Or would you prefer to be more creative with Crafting, Farming, Smithing and Construction? Or perhaps your tastes lay elsewhere – with Hunting, Divination, Invention or Runecrafting? Or maybe your soul yearns action, and you’ll take to Magic, Summoning, Slayer and Dungeoneering! Do you want to get up close and personal with a sharp blade in your hand? Or will you take a tactical approach and attack from range? Or perhaps your skills are more mystical, and you prefer the arena of magic? Fight a dazzling assortment of foes including an unimaginable array of epic bosses. From demons to dragons and rock monsters to serpents, nightmares beyond your wildest imagination lay in wait. RuneScape can be played free, but also offers optional membership that unlocks even more thrilling content, including 8 additional skills, over 120 extra quests and access to the entire game world map! Check out the Steam DLC Bundles Membership Access offers featuring launch exclusive Steam cosmetic items and special rewards. Add your unique voice to our vibrant RuneScape community. Enjoy a strong connection to RuneScape's independent development team by joining them for regular livestreams, and share ideas on the forums. We shape RuneScape together!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1343400/header.jpg?t=1653412331",
    "Price": 0.0,
    "Developers": "Jagex Ltd",
    "Publishers": "Jagex Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_58ccbf00fac1dfedc85c565ac82a2e325d04441c.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_d1df12b95079aa271302db38e39e03ed552ae267.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_6e1a3533cc34da2b72c7dec35f7e6a47b351c3c4.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_9767437df270c8a146293d000ad95b3b6023b631.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_c8f49937739fe32c65326a157415e9e1cb1a1d81.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_1f6edab8ebdfd0c2455f45e9575a32047612c758.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_8f1bd1fc2a720c0625397eaf2196902b6ba283f8.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_58bfd7022db000a7a78910678e9f088f41bb69e2.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_ca0009964825804ee8f1479cad3ccb50b059150c.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_58cabdd7a7ab614cefb25bfa519da5e7deec6cd1.1920x1080.jpg?t=1653412331,https://cdn.akamai.steamstatic.com/steam/apps/1343400/ss_3db7e583b1d298052e33464cacfe97b922b08a99.1920x1080.jpg?t=1653412331",
    "Slug": "runescape",
    "Meta Title": "RuneScape ®: Oct 14, 2020, Jagex Ltd and Full Overview",
    "Meta Description": "Looking for information on RuneScape ®? Check out the release date (Oct 14, 2020), developer insights from Jagex Ltd, and a complete game summary.",
    "Alt Text Image": "Official header image for RuneScape ® game - Steam 1343400",
    "Canonical URL": "https://gusku.site/game/runescape",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RuneScape \\u00ae\", \"description\": \"Looking for information on RuneScape \\u00ae? Check out the release date (Oct 14, 2020), developer insights from Jagex Ltd, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jagex Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jagex Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1343400/header.jpg?t=1653412331\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}