{
    "AppID": 1865730,
    "Name": "Runes of Pandemonium",
    "Release date": "Feb 22, 2022",
    "About the game": "Six heroines find themselves in an unknown world, the last memory of their former homes being a blinding flash of light that emanated from a small rune-carved stone. Separated by time and space, they awaken to find themselves in a world of powerful magic and horny monster girls. Defend yourself from the monster girls as you look for a way home, but be wary of their cunning tricks and traps as they lure you into their embrace. An inattentive moment could find yourself transformed into one of them with magics both ancient and carnal. But in the world of Pandemonium, defeat is not the end. Shed your humanity and join the monster girls, adding their strengths to your own. Wield the powers they offer as you seek out the reason why you were brought to this world, and with them you may discover the secrets that hide in the shadows. Enter the world of Pandemonium, and discover the dreams and nightmares that lurk at the edges of existence. Enter the world of Pandemonium, and be transformed! FEATURES Story-Rich Adult Gameplay Tired of generic shovelware h-games? We here at Bottled Starlight have developed Runes of Pandemonium to be a story-rich jRPG accentuated with lovingly-illustrated boobs and stories of boobs. Most of us are story-tellers in one way or another. We've poured our efforts into making a game with memorable characters, fun quests, and emotional attachments, then woven all of these into a tapestry filled with eroticism. In short, Runes of Pandemonium is not just another shovelware porn game, it's a full-featured jRPG where the adult content is only the icing on the cake! Transformations In typical transformation games, being transformed is a Bad End. In Runes of Pandemonium, transformation is a tool to be used. Being transformed unlocks new monster girl forms for you to use along with the natural abilities those monster girls have. Use your new powers and body to access new areas, strike at an enemy's weakness, or just have fun seeing how the world reacts to your new appearance. Observant NPCs In the world of Pandemonium, your physical form is a mutable thing. Transformations happen, and not always by choice. In Runes of Pandemonium, many NPCs will react to you differently depending on what transformation you are currently using, with some being more appreciative of certain forms than others. THE FUTURE Two chapters released and four to go, with the final chapter being longer than the first five combined. We expect each chapter to take about a year to create, with each chapter being a full game on its own.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1865730/header.jpg?t=1645962848",
    "Price": 0.0,
    "Developers": "Bottled Starlight",
    "Publishers": "Bottled Starlight",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1865730/ss_f518f89349af631b9d5a5972f23d58680f293023.1920x1080.jpg?t=1645962848,https://cdn.akamai.steamstatic.com/steam/apps/1865730/ss_abcdcede19471a6baaa9c2069fe5229051000582.1920x1080.jpg?t=1645962848,https://cdn.akamai.steamstatic.com/steam/apps/1865730/ss_c318b210909af6710be0036f2b9a49c1c1ab2f70.1920x1080.jpg?t=1645962848,https://cdn.akamai.steamstatic.com/steam/apps/1865730/ss_688759d528f858d31bee4db6ba5657843ee575c8.1920x1080.jpg?t=1645962848,https://cdn.akamai.steamstatic.com/steam/apps/1865730/ss_7b538d8890a3fea4699cef6448da1eb3059ed877.1920x1080.jpg?t=1645962848",
    "Slug": "runes-of-pandemonium",
    "Meta Title": "Runes of Pandemonium: Feb 22, 2022, Bottled Starlight and...",
    "Meta Description": "Looking for information on Runes of Pandemonium? Check out the release date (Feb 22, 2022), developer insights from Bottled Starlight, and a complete ga...",
    "Alt Text Image": "Official header image for Runes of Pandemonium game - Steam 1865730",
    "Canonical URL": "https://gusku.site/game/runes-of-pandemonium",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Runes of Pandemonium\", \"description\": \"Looking for information on Runes of Pandemonium? Check out the release date (Feb 22, 2022), developer insights from Bottled Starlight, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bottled Starlight\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bottled Starlight\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1865730/header.jpg?t=1645962848\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}