{
    "AppID": 1302480,
    "Name": "Slurkum",
    "Release date": "Mar 9, 2021",
    "About the game": "Slurkum is a fantasy themed survival game designed to provide a unique experience. Explore a map of vast proportions with many points of interest, filled with a plethora of various monsters based on AD&amp;D lore. Towns, villages, ancient ruins and unholy places strewn across the map in various realms. Develop your skills and reputation at a casual pace, claim land as your own for your housing, speak with townspeople for quests and goods to trade. Resources are plentiful through mining, hunting, monsters, and crafting throughout the land, and each region has it's own unique points of interest and monsters. The basic game mechanics are simple. Play how you want. Housing can be used with a land claim, factions can be joined for Order/Chaos pvp, trade your wares, lurk in the woods and hunt, or even crafting at your own tower. It's up to you! Game server environment is loosely based on key elements of popular mmo and simplified for a more casual gaming experience in that genre. Using a purely authoritative server architecture, Slurkum is made with the admin / host in mind, as well. With the built-in Game Master menu, administrators can designate trusted players as GM's for events, disputes, and more! As with any situation, awareness is key. With that said, keep these points in mind as you explore Slurkum. =PvP Color Flags= Blue = Lawful citizen Green = Fellow townsman and ally Orange = Enemy town citizen Red = Murderer (attackable by all and banished from safe zones) Be mindful in your travels, as many beasts, vermin, undead, and other foul things dwell in the wilder and darker regions of the land. =Beastiary= Trollkin: kobolds, goblins, orcs, hobgoblins, cyclops and trolls Dragonkin: wyverns, dragons, hydras, lizard and dragonmen Nightspawn: ghastly, vampire, nightmare, werewolves and nightfiends Vermin: snakes, rats, spiders, mutants, insectoids Legendary: snowfiend, manticores, harpy, tree ents, vendigos, chimeras and griffins Hellborn: lava golems, beholders,, rippers, undead soldiers, demon lords Wildlife: bears, wolves, deer, rabbit, boar, fox Slurkum offers a robust combat system with single, double, even triple melee attacks (sufficient stamina required). Crossbow and pyromancy offer ranged options, with kick and uppercut for when that enemy gets in too close. =Combat= Armor Class: AC reduces the attack rating by scaling the damage: (raw damage * scaled percent) / 100 Example: AC of 15 would weaken an attack to 85% Stamina Cost: all melee attacks cost stamina Attack Strength: raw damage is scaled against current stamina: actual damage == (raw damage * scaled % of stamina) / 100 Example: 50% stam reduces attack damage to half, while 100% delivers full Pugilism: right hook, left hook, uppercut, kick, jabs, rolls, and combos Great Weapons: more attack range and damage in exchange for high stam cost Hand Weapons: one handed weapons quick but less damage Combo Attacks: single click- 1 swing, dble click- 2 swing combo, pressing 2 concise dble clicks- 3 swing attack, kick key and also a special melee key (all dependent on stamina supply) As stated earlier, simplified functionality is intended and crafting is no exception. For most items, crafting will be a two part process where you refine ingredients or resources using a station, then combine them with your crafting menu. Each station requires a specific fuel, depending on it's purpose. =Crafting= Forge: process ores and also prepared metal to create ingots Work Station: mill select raw lumber to plank Tanning Station: process various animal and monster skin to rawhide for leatherwork Cooking Station: cook prepared meals and basic meats Alchemy Station: distill extracts for potions and tincture Camp Fire: cook meats, regain temperature, repel nightspawn =Resources= [Mining] Ores and Rock can be obtained by breaking apart boulders scattered throughout the land (pierce damage is best) [Gathering] Herbs can be picked from the ground [Harvesting] Wood and certain plant materials are can be had by physically damaging them - (slashing damage is best) [Water] Only available from wells which can be found in town or crafted and placed on claimed land [Loot Drops] Both day creatures and nightspawn have their own loot lists which drop ingredients specific to their genre The struggle between Order and Chaos has been with us since the dawn of time. It permeates all eras, all dimensions, all cultures. Those devout in principal may choose to enlist their service for the cause by joining the townstone of that faction. You will know your enemy by their orange hue. Even as these forces of Order and Chaos dance in eternal duality, so too does the wheel of karma. Attacking players who are not your enemy will cause loss of karma. The taking of innocent life will also mark your player as a murderer for all to know. Karma does regenerate slowly, and murder counts do erase themselves, with enough passage of time and good behavior. =Chaos / Order= [Score] Every enemy, criminal, or murderer killed awards 1 point [Murders] kill innocent receive 1 count More features, objectives, and systems yet to be implemented, such as faction influence, resource claims, and altar boons. To place structures you must own land, and to do that you must drop a claim stone (which can be crafted). =Land Claim System= Claim block keeps all structures in radius invuln Claim block decay over time, use repair hammer to keep fresh if claim block dies, all structure items become vulnerable can add friends to the builders list Skill proficiencies increase things like damage and heal potency, as well as defining your profession and rank. =Skill Gain and Profession System= skill level affect damage/heals at += .2 * skill level skill gain occur from item use and recipe crafting ancillary skills to be used for various criteria in other game code, as things evolve Magik is no stranger to Slurkum, and there are two branches for the devout to embrace. =Schools of Majik= Book ok Life -restoration Book of Fire -pyromacy",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1302480/header.jpg?t=1658111925",
    "Price": 9.99,
    "Developers": "Ark Valley Gaming",
    "Publishers": "Cohesive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_b1c93b0179463627e873012f3df0fe82e6e6be4a.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_5ab17f397e9201cd9a89e26bd10b43f93a217b4c.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_0adc9b3f5315b86396de5708cd76561358323929.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_20a4db2d392793c45a570abaa5dca5327876269f.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_930257c31dd5246d587828d79d93e83206af79c0.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_413594e86b860c09c5c98e15e60c27acf5d78376.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_ad21e6d2b936d53422c6772c518ace8e6349f3c5.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_42cb6648837d6f7c19b38e07d8a23a81fbfdc939.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_9946cfee186deb3239abcba797c30065fff02414.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_87e2c5dabdea0f5688a93de27d971a8ab52fc298.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_d1b5b6ceba26c8ef5263d5ddbab65f892c1070de.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_94b6d935ad00a68375034d0bfd7e97c3694e59ed.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_b55b072aa57a63634f422956df4c71646bf62d26.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_5058b624c46d1db4014ed22f68f733c6cbaa0d64.1920x1080.jpg?t=1658111925,https://cdn.akamai.steamstatic.com/steam/apps/1302480/ss_2f37ca02e5978128dba0c35c6a5bd3283080ea3b.1920x1080.jpg?t=1658111925",
    "Slug": "slurkum",
    "Meta Title": "Slurkum: Mar 9, 2021, Ark Valley Gaming and Full Overview",
    "Meta Description": "Looking for information on Slurkum? Check out the release date (Mar 9, 2021), developer insights from Ark Valley Gaming, and a complete game summary.",
    "Alt Text Image": "Official header image for Slurkum game - Steam 1302480",
    "Canonical URL": "https://gusku.site/game/slurkum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slurkum\", \"description\": \"Looking for information on Slurkum? Check out the release date (Mar 9, 2021), developer insights from Ark Valley Gaming, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ark Valley Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cohesive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1302480/header.jpg?t=1658111925\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}