{
    "AppID": 631130,
    "Name": "Strata Design 3D SE",
    "Release date": "May 16, 2017",
    "About the game": "Strata Design 3D SE: The Perfect Way to Get Started 3D MODELING, TEXTURING &amp; RENDERING If you’re just getting started, and don’t need animation and the latest in power that the CX version provides just yet, Design 3D SE is the perfect way to get started. With Design 3D SE you can learn the basics with a very capable tool. MODEL WITH POWERFUL TOOLS Every 3D image starts with a model, and SE gives you some key tools to get started – including polygon modeling, spline curves and Booleans. And you can bring in existing 3D assets – you’ll find a variety of import filters for third-party models and scenes. APPLY SURFACE TEXTURES Design 3D SE gives you some of the key texturing features you’ll need to produce quality work, including: Wrap any image around any 3D object; Give surfaces texture with bump and normal maps; Generate realistic metals with anisotropic maps; use polygon subset texturing and – more! And it’s easy to get started with the huge library of pre-made textures. SET UP YOUR SCENE AND LIGHTING Design 3D SE is like a photography studio where you have total control. Position your 3D objects and then place lights, reflection panels, cameras, backgrounds, environments and more to produce a quality final render. RENDER PROFESSIONAL IMAGES Design 3D SE’s renderer produces excellent results. From outlines, to toon-style rendering, to photo-realism – Design 3D SE can produce quality images fit for professional work. CONNECT TO EVERYTHING ELSE Several 2D and 3D file formats connect you to the rest of the world. This includes Collada files tailor-made for Apple’s iBooks Author app, OBJ, DXF and more. You can even 3D print with the included file formats that are accepted by desktop 3D printers and popular online 3D printing services. TAKE ADVANTAGE OF THE 3D UNIVERSITY Strata offers a complete online training site that provides tutorials covering all aspects of the Design 3D line of products. This includes first time users to 3D professionals. It’s a great way to learn and is guaranteed to get you up to speed. Visit the University YOU’RE READY TO STEP UP Design 3D SE is a subset of its big brother, Design 3D CX. Once you’ve mastered Design 3D SE you’ll be ready to step up to CX without missing a beat. With Design 3D CX you’ll get an expanded toolset – including powerful modeling tools, UV texturing tools, animation, special effects and more. Learn more about Design 3D CX for Mac and for Windows. IN-DEPTH FEATURE LIST Drawing Features Strata Design 3D SE makes it easy for 2D designers to get started in 3D. You can import 2D elements from applications like Adobe Illustrator or you can draw 2D objects directly in Strata Design 3D SE. 2D/3D Text 3D Primitives 2D Drawing Tools Bezier Lines/Regions Modeling Features Strata Design 3D SE offers an incredible array of modeling options. You can model using familiar Bezier splines, but now in 3D: traditional polys- but now with Quad Polysplines; Extrude and Lathe; Boolean to combine or subtract; Skin and more! Polyspline SDS Bezier Surfaces Extrude Lathe Boolean Skin Polygonal Modeling Path Extrude Lighting Features You’ve heard of “looks good in any light” – now you’ve found the tool that gives you that elusive “any light”. Point Lights Spot Lights Directional Lights Glowing Surfaces Gels Special Effects Features Any image can be spiced up with special effects like Lens Flare, Auras, Particles – and Script FX. Add multiple effects, and place effects on any object. Lens Flares Auras HotSpots ScriptFX Rendering Features The core of what makes Strata Design 3D SE so good – and what it’s famous for – is the high-quality rendering. Rendering is the process of taking the design you worked to put together and creating the final image. Toon Photons Raytracing Raydiosity Pointcloud Anti-Matter Effect Atmospheric Effects MIP Mapping Soft Shadows Reflection Blurring Texturing Features “What if” is as simple as drag-and-drop in Strata Design 3D SE. Select from the palette of pre-made surface textures or make your own using Photoshop or other 2D image files. Bump &amp; Normal Mapping Anisotropic Reflections Blurred Reflections Blurred Transparencies Layer &amp; Mix Fog 15 Channels Multi-Texture Blending Mix Modes File Import/Export Features Being able to talk to other programs in your design studio is an important issue. Strata Design 3D SE offers a number of options in this area. Collada (in/out) Illustrator/EPS v8 or AI v8 (in) Photoshop PSD (in/out) STL (out) 3DS (in) DXF (in/out) OBJ (in/out) VRML 1 &amp; 2 (in/out) True Type Fonts (in)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/631130/header.jpg?t=1502227264",
    "Price": 0.0,
    "Developers": "Strata Mixed Reality, Inc.",
    "Publishers": "Strata Mixed Reality, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/631130/ss_f416f1bc6fb8d8453f6b5fde35dd74fa4673422e.1920x1080.jpg?t=1502227264,https://cdn.akamai.steamstatic.com/steam/apps/631130/ss_0d22e1699588c92252307b4f02f98f4f3aec49fc.1920x1080.jpg?t=1502227264,https://cdn.akamai.steamstatic.com/steam/apps/631130/ss_6f6ab2cb5b5b1e7089cb3418e973c825f9770f4c.1920x1080.jpg?t=1502227264,https://cdn.akamai.steamstatic.com/steam/apps/631130/ss_62f5ccc3ace86db7fb4b6f040d7169ce98be018d.1920x1080.jpg?t=1502227264,https://cdn.akamai.steamstatic.com/steam/apps/631130/ss_40195d8227282b118ce869700f2e8d9941159c23.1920x1080.jpg?t=1502227264",
    "Slug": "strata-design-3d-se",
    "Meta Title": "Strata Design 3D SE: May 16, 2017, Strata Mixed Reality, ...",
    "Meta Description": "Looking for information on Strata Design 3D SE? Check out the release date (May 16, 2017), developer insights from Strata Mixed Reality, Inc., and a com...",
    "Alt Text Image": "Official header image for Strata Design 3D SE game - Steam 631130",
    "Canonical URL": "https://gusku.site/game/strata-design-3d-se",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strata Design 3D SE\", \"description\": \"Looking for information on Strata Design 3D SE? Check out the release date (May 16, 2017), developer insights from Strata Mixed Reality, Inc., and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 16, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strata Mixed Reality, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strata Mixed Reality, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/631130/header.jpg?t=1502227264\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}