{
    "AppID": 1092800,
    "Name": "Summit of the Wolf",
    "Release date": "Apr 21, 2020",
    "About the game": "Summit of the Wolf is a poignant point-and-click narrative adventure presented in the visual style of graphic novels. Created by a two-person husband-and-wife indie development team, it features both fantasy and real-world segments. STORY After falling asleep in her warm bed one night, twelve-year-old Ophelia wakes up in an ethereal garden with no memory of how she got there. After speaking with a mysterious goddess named Adena, Ophelia sets out on a personal journey to find the fabled Summit of the Wolf, whereupon she must uncover the tragic real-world events that led to her arrival in this fantasy realm. Will Ophelia complete her quest, or will she succumb to the many dangers she must face along the way? Meanwhile, in the real world, Ophelia lies comatose in the hospital, and a sympathetic nurse attempts to uncover the truth behind the tragic events that led to her life-threatening injury. Ophelia's parents insist that she fell down the stairs in the middle of the night...but can they be trusted, or are they hiding a dark secret? At its core, Summit of the Wolf is a game about trauma and its psychological effect on children. Inspired by true events and written by a medical professional (and fellow survivor), Summit of the Wolf endeavors to shed light on the topic of child abuse by showcasing the emotions that are experienced by a young girl as she makes the transition from victim to survivor. While the game does not shy away from the darkness of the topic, the tone is ultimately positive and, hopefully, both inspiring and empowering. GAMEPLAY Summit of the Wolf is a cross between a traditional 2D point-and-click first-person adventure game and a visual novel. It is presented in the visual style of graphic novels and focuses on exploration and narrative. Explore the world by navigating from scene to scene. Separate inventory, map, journal, and character screens are available at the push of a button. All standard adventure game mechanics are present, including locations to explore, items to collect and use, characters to meet and interact with, and puzzles to solve--all without any major pixel hunting! FEATURES Explore an original fantasy world: The realm in which Ophelia awakes is vast and features a variety of environments, from living forests to damp caverns to cursed catacombs...and more! Interact with its many unique inhabitants: Summit of the Wolf features over two dozen characters, all with their own distinct personalities--some quirky, others helpful, and a select few terrifying. Professional actors, including the legendary Lani Minella (best known as the voice of Nancy Drew) provide many of the voices. Experience a complex narrative: Story comes first in Summit of the Wolf , and Ophelia's personal journey--both literal and metaphorical--lies at the heart of this emotional tale. Enjoy a beautiful orchestral score: Summit of the Wolf 's soundtrack is over two and a half hours long! Solve a multitude of challenging puzzles: Puzzles abound in Summit of the Wolf , but they are organic rather than obstructive and fit within the context of the narrative. While you may feel challenged, you should never feel frustrated or hopelessly stuck! Uncover the truth: Summit of the Wolf is a 10+ hour interactive drama that teaches us that it is always darkest before dawn. AN ONGOING SAGA Summit of the Wolf is the fifth entry in the ongoing Storycentric Worlds series. While Summit of the Wolf is a standalone story and can be enjoyed in full without any prior knowledge of the series, it is also part of a larger, ongoing saga. Longtime fans will see the return of fan favorites Kate Ekan and Brianna Auberon from Shady Brook and The Filmmaker , respectively, and Summit of the Wolf sets up events for the next chapter in the series.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1092800/header.jpg?t=1589323219",
    "Price": 14.99,
    "Developers": "Storycentric Worlds",
    "Publishers": "Unimatrix Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_cd52e248aed6f8eb55e2c0cc01f27164c507d641.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_f3dbe07a50b4c301a0d557673cb0d2a8244ae7b9.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_95d0d8a3be4c8b1309961975101887bf38095b12.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_3dd8d3d9e404eb88df7f5cbd078bd9acb87ab4e9.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_7d35bd25d795653c519ff1095cee599cc8a19556.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_dda2eacbe562416eee3c29a39f71e75a23a5237f.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_41ebe7b44eb58f35b828ce41383597e58e8f5ff0.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_5c9444fbe3ff3a1db4a015730a48d97f0291f502.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_b30527d352b16d7db57fd619b3b768dd2a86d983.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_c30cafa3fc4b0f560009f2f6e2386993ebc2178c.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_55ab35ea1f5f91d3399d6f27a9a434a990363d83.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_78ced5a3439580e3d8c89d06934eb9803610c946.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_27c7123241f3822bb3f268f010b85f6eecd66b4f.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_654caddda16382d872ea90b88751e2953d8341b4.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_e9bddb41f2a4a0d09d1ff6b97bec216e9d1ba7ec.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_8f44cda94382006297b7d521d49496ba42baeb8f.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_01e8b5f737a56d418d2e36306485da9642e33b08.1920x1080.jpg?t=1589323219,https://cdn.akamai.steamstatic.com/steam/apps/1092800/ss_8e9bf84df2c0b076acd813f9bd56433dac24b6ff.1920x1080.jpg?t=1589323219",
    "Slug": "summit-of-the-wolf",
    "Meta Title": "Summit of the Wolf: Apr 21, 2020, Storycentric Worlds and...",
    "Meta Description": "Looking for information on Summit of the Wolf? Check out the release date (Apr 21, 2020), developer insights from Storycentric Worlds, and a complete ga...",
    "Alt Text Image": "Official header image for Summit of the Wolf game - Steam 1092800",
    "Canonical URL": "https://gusku.site/game/summit-of-the-wolf",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Summit of the Wolf\", \"description\": \"Looking for information on Summit of the Wolf? Check out the release date (Apr 21, 2020), developer insights from Storycentric Worlds, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Storycentric Worlds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unimatrix Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1092800/header.jpg?t=1589323219\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}