{
    "AppID": 1454140,
    "Name": "SUPERCHICOS",
    "Release date": "Nov 24, 2020",
    "About the game": "VIDEOJUEGO PARA NIÑOS Y PADRES EMPRENDEDORES Juego en tercera persona para niños y padres. Es un pequeño mundo abierto donde los niños pueden aprender a emprender en pequeños negocios como la venta de limonadas, pasteles y también aprender sobre finanzas, con entretenidas misiones e importantes moralejas para la vida. Superchicos en la primera temporada tiene todo un mundo para explorar entre amigos que irán superando las 8 misiones, logramos combinar la diversión con el aprendizaje y los buenos hábitos de Educación Financiera y emprendedurismo. Son guiados por un mentor que da buenos consejos para las misiones y tienen un balance de sus ingresos cuando lo generen y/o compren algo, así llevan un hábito de control de ingresos y egresos. La primera temporada está canalizada a niños de 6 a 12 años. Logramos conectar el juego, con la diversión, la adrenalina, los sueños y tener siempre la disciplina y la perseverancia de luchar por lo que amamos. Tenemos una visión clara, ayudar a crear una mentalidad de éxito en una nueva generación que serán los próximos líderes y creemos fielmente que el éxito y los sueños se crean en una familia con información actualizada. Durante los últimos años hemos trabajado con más de 3000 familias de forma presencial, la interacción y los resultados fueron increíbles. Los niños ya estaban dispuesto a más porque los juegos les ayudaban a destapar su capacidad de creatividad con sus sueños, algunos ya empezaron con sus negocios y otros ya se animaron a lanzarse como YouTuber, para dar continuidad a ese crecimiento y como todo va al mundo virtual, tuvimos la idea de canalizar todo el aprendizaje en un video juego, teníamos toda la duda y la incertidumbre de que si iba a ser atractivo e interesante si los niños entenderían esta aventura y se sumó a esta gran experiencia el equipo de Waraní Studios con experiencia en la materia y con juegos de alto nivel, incluso desarrollando juegos para la Play. -Puedes elegir jugar como niño o niña. -Se te asignará un amigo imaginario en función a tu tipo de inteligencia sobresaliente. -2 primeros negocios. -8 Misiones principales. -Sistema de ahorro de dinero.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1454140/header.jpg?t=1606227265",
    "Price": 0.0,
    "Developers": "Waraní Studios",
    "Publishers": "Niño Emprendedor SRL",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1454140/ss_8066fe5ac603cdbe5266c05439a6564dd526f7fa.1920x1080.jpg?t=1606227265,https://cdn.akamai.steamstatic.com/steam/apps/1454140/ss_ed08e73783e2cda29744612f8259458fc4ce17d3.1920x1080.jpg?t=1606227265,https://cdn.akamai.steamstatic.com/steam/apps/1454140/ss_232edf1d4411034c2f65f06d1343a222369bf16b.1920x1080.jpg?t=1606227265,https://cdn.akamai.steamstatic.com/steam/apps/1454140/ss_5ee5d536959298963b881011503b92c94574f1d1.1920x1080.jpg?t=1606227265,https://cdn.akamai.steamstatic.com/steam/apps/1454140/ss_b0d41252dce441e6eadba4f318be4d4f31a44d84.1920x1080.jpg?t=1606227265",
    "Slug": "superchicos",
    "Meta Title": "SUPERCHICOS: Nov 24, 2020, Waraní Studios and Full Overview",
    "Meta Description": "Looking for information on SUPERCHICOS? Check out the release date (Nov 24, 2020), developer insights from Waraní Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for SUPERCHICOS game - Steam 1454140",
    "Canonical URL": "https://gusku.site/game/superchicos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SUPERCHICOS\", \"description\": \"Looking for information on SUPERCHICOS? Check out the release date (Nov 24, 2020), developer insights from Waran\\u00ed Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Waran\\u00ed Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ni\\u00f1o Emprendedor SRL\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1454140/header.jpg?t=1606227265\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}