{
    "AppID": 332650,
    "Name": "The Exiled",
    "Release date": "Feb 23, 2017",
    "About the game": "The Exiled is a fast-paced PvP game set in a forsaken valley. Game worlds last for up to one month . Open PvP and Full Loot mean that you will to constantly balance risk and reward. Find a group of friends and form a clan to thrive in the valley. Cooperate or conquer, craft or combat; every decision is critical as you seek to flourish in a forsaken valley. A classless system means you shape your character to fit your style of play. With no grind, full loot and unrestricted PvP clashes, you must constantly balance risk and reward as you decide how to interact with the world and your fellow players. Craft equipment, construct your settlements and build alliances, as you explore challenging open world environments with unique geography and features. Each skirmish and siege will define your fate, as you vie to win your freedom from The Exiled. - Why we're creating The Exiled To make a long story short: We love PvP but we hate having to grind for it. Doesn't matter if that grind means clicking on rocks and trees, farming rats or watching our mining lasers overheat on some asteroid. We just want to log into the game, find a friend or two and compete with an army twice our size. We want a game that takes us seriously as adults and allows us to make our own diplomatic decisions instead of throwing us in a battleground with a bunch of randomly selected 'friends' and 'enemies'. We want a game that is constantly changing, keeping us on our toes and forcing us to get better instead of showering us with meaningless rewards and digital bauble. - Meaningful PvP Open PvP : Engage other players in combat anywhere, anytime. Full loot : Carrying high-level equipment into combat means you risk losing it. Player-run clans : No pre-built factions. You decide who you ally with. City building and sieges : Build up your own towns - or raze those of your enemies. - Skill-based Combat Full friendly fire : Make sure your fireballs hit the enemy and not your allies. Line of sight : Hide behind a bush to ambush your enemies - and look behind you! Footsteps : Every player leaves them behind - want to be a bounty hunter? - Free Character Development 15 different class combinations : Have you ever played a Scythe-wielding mage? 80+ combat abilities : Build a lightning wall, lay explosive traps or shoot a hail of arrows. All equipment is player-crafted : You can tweak your gear to fit your play-style. - A Changing World in Conflict The world of The Exiled is in a state of upheaval. A once peaceful and prosperous trading city turned from a multi-cultural melting pot into a stone cold dictatorship. You are on the receiving end of this societal change and together with hundreds of other misfits - criminals, political rebels and adventurers - you get exiled to a barren land -The Valley. Now you have to decide how to continue your life. Do you become a lone wanderer and live off the lands? Will you join the rebels and try to leave the valley by force? Or do you turn to your baser instincts and survive by robbing your fellow inmates?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/332650/header.jpg?t=1655080944",
    "Price": 0.0,
    "Developers": "Fairytale Distillery",
    "Publishers": "Fairytale Distillery",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_667a361a0bcd05732374440579021083af69b6e7.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_a0968034235fb16341e064df7db0ab602bd33dcc.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_f17925a3b3fcd4c9705e2e0d7d73a2b2b090921a.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_5b2ca90eac5a767288c0bc026ad703d22a828656.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_d2678c10dd3b9325782128b6929c0a60f18f48c6.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_b61ca52053a00b954959c16de64beac25808d9b8.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_95cca0af5bc082e80ee7ab89d3e9badd6e800adb.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_9fc185080f912536fab3346efc0cdd058ce783c8.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_9529df8676a664eee0792103bd843f39cdb629f0.1920x1080.jpg?t=1655080944,https://cdn.akamai.steamstatic.com/steam/apps/332650/ss_349f2aea0ae39e42503f49c4d0eb62de5a3ff61f.1920x1080.jpg?t=1655080944",
    "Slug": "the-exiled",
    "Meta Title": "The Exiled: Feb 23, 2017, Fairytale Distillery and Full O...",
    "Meta Description": "Looking for information on The Exiled? Check out the release date (Feb 23, 2017), developer insights from Fairytale Distillery, and a complete game summ...",
    "Alt Text Image": "Official header image for The Exiled game - Steam 332650",
    "Canonical URL": "https://gusku.site/game/the-exiled",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Exiled\", \"description\": \"Looking for information on The Exiled? Check out the release date (Feb 23, 2017), developer insights from Fairytale Distillery, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fairytale Distillery\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fairytale Distillery\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/332650/header.jpg?t=1655080944\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}