{
    "AppID": 1668170,
    "Name": "Track & Burn",
    "Release date": "Nov 2, 2021",
    "About the game": "Track &amp; Burn is a stylish free-to-play racing game, combining the best of old school racing with custom track-building. Zip through urban cityscapes. Design your own tracks. Compete with the community. And burn some rubber! WISHLIST TRACK &amp; BURN JOIN OUR COMMUNITY Hi Track &amp; Burn early adopters! 🏁 Thanks for dropping by. Wanna be on the inside track? Follow us on social media to hang out with the community, chat with us, and be the first to hear about new updates &amp; events. Follow us on Twitter @tranckandburn Instagram @tracknburn Wishlist on Steam to get notified when the game goes live! Track &amp; Burn is a stylish free-to-play racing game, set in the 70s. The spiritual successor to legendary titles like ‘Driver’ &amp; ‘Trackmania’, it combines the best of old school racing with custom track-building. Built by a veteran Parisian team with a passion for motorsports &amp; effortlessly elegant French design. 🚘 Burn some rubber &amp; make some noise! Race fun-to-handle muscle cars through chic cityscapes. Flex your driving skills. And rip up the road. Realistic speeds, no coins, no boosts, no minimap &amp; no fake drift. In Track &amp; Burn, it’s all about the car, the road, and your true racing grit. 🔧 Become the ultimate track-builder! Build and share your own custom tracks - with a variety of track pieces &amp; combinations to choose from. Challenge the community with lethal loops &amp; breakneck bends. Try out user-generated tracks. Embrace your inner architect with quirky designs. Or just build a straight line. We don’t judge ;) 🏁 Compete with friends. Or take on the world. Show the Track &amp; Burn community what you’ve got via racing ghosts, world leaderboards, special Mini Cups &amp; more. Note: Only selected competitive features will be available in the game during Early Access. FREE UPDATES Around the launch of Early Access, Track &amp; Burn will include one racing level, track-building features, one track-building environment, the ability to race against ghosts &amp; more. But we plan on bringing FREE CONTENT DROPS &amp; UPDATES to Track &amp; Burn across Early Access and beyond, including: New tracks New environments New paint jobs &amp; stickers New challenges Keep an eye on our social media channels for updates &amp; early sneak peeks. PREMIUM CUSTOMISATION &amp; EXTRAS The Early Access version of Track &amp; Burn will not offer any paid extras. But when the game is fully launched on Steam, we hope to offer a variety of epic premium customisation options like special paint jobs, bonus environments &amp; even more set pieces, in addition to all the great stuff that’s freely available in the base game. These will be paid add-ons. But don’t worry - we hate ‘pay-to-win’ as much as you do. Track &amp; Burn’s premium extras will always be just that...extras! No game advantage. No getting trounced by the player with the deepest pockets. Just some good old fashioned *goodies*, for anyone who wants them 👌 &amp; MORE We’ve got big plans for Track &amp; Burn. We hope to bring the game to more platforms in the future, reaching an even wider community of motorsports fans. Tayasui is a Parisian development studio with a passion for simple, elegant design. With over 10 years of experience in mobile apps, the team is incredibly excited to be launching Track &amp; Burn as their first title for the PC &amp; Mac market.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1668170/header.jpg?t=1639127594",
    "Price": 0.0,
    "Developers": "Tayasui",
    "Publishers": "Tayasui",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1668170/ss_e237ceab7715bde5c8c6739eb8b3a5699ffec576.1920x1080.jpg?t=1639127594,https://cdn.akamai.steamstatic.com/steam/apps/1668170/ss_2cc2e192fc6a74c089671cbe306105be2b7299a1.1920x1080.jpg?t=1639127594,https://cdn.akamai.steamstatic.com/steam/apps/1668170/ss_99f31254c825f7a3fde2b3179d6527a562d40000.1920x1080.jpg?t=1639127594,https://cdn.akamai.steamstatic.com/steam/apps/1668170/ss_46ce2874526c87ac09e4b9cb8d23585443113316.1920x1080.jpg?t=1639127594,https://cdn.akamai.steamstatic.com/steam/apps/1668170/ss_5485f1b620d4be5860240b9ebf87b3d75273e7f1.1920x1080.jpg?t=1639127594,https://cdn.akamai.steamstatic.com/steam/apps/1668170/ss_7ba84622995eaf2245741153e2434453ffcc72ae.1920x1080.jpg?t=1639127594",
    "Slug": "track-burn",
    "Meta Title": "Track & Burn: Nov 2, 2021, Tayasui and Full Overview",
    "Meta Description": "Looking for information on Track & Burn? Check out the release date (Nov 2, 2021), developer insights from Tayasui, and a complete game summary.",
    "Alt Text Image": "Official header image for Track & Burn game - Steam 1668170",
    "Canonical URL": "https://gusku.site/game/track-burn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Track & Burn\", \"description\": \"Looking for information on Track & Burn? Check out the release date (Nov 2, 2021), developer insights from Tayasui, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tayasui\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tayasui\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1668170/header.jpg?t=1639127594\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}