{
    "AppID": 1584980,
    "Name": "Warhammer Quest: Silver Tower",
    "Release date": "Jun 2, 2021",
    "About the game": "Warhammer Quest: Silver Tower is a turn based strategy, dungeon crawler game set in the Age of Sigmar by Games Workshop. Fight your way through hundreds of stages in this unique challenge of tactics, using your favourite Champions from Warhammer. Listen up Champions! Chaos is everywhere! Fight through the Silver Tower. Lair of the hideous Gaunt Summoner. Once you have found all the parts of his Talisman, face the master of evil in an epic final quest. Stormcast, Darkoath, Aelves, and other Champions from all over the Mortal Realms will enter the tower, driven by vengeance, honour, or even to gain the boon of the Gods themselves. They will fight Acolyte, Tzaangor, Daemon and all manner of Chaos monsters in turn based strategy battles. Only by beating the Summoner’s trials and finding all the pieces of his Talisman can you have a chance at escape! ========== Turn based strategy: Strategic skirmishes to test your inner tactician. Summon Epic Warhammer Champions: From the Games Workshop Age of Sigmar range, each champion comes with a unique skillset and gameplay. Huge Campaign: Find the Summoner’s Talisman, and experience over 200 battles across 25 unique environments in the Realm of Chaos. Quest Daily: Hand-crafted adventures for the most hardcore dungeon crawler, sent to you every single day. Hoards of Treasure: Choose from hundreds of weapons, items, and trinkets to level up your team. Boons: Equip your champions with Legendary skills and traits to unlock new gameplay. ========== Based on the hit Age of Sigmar board game from Games Workshop. Fight the forces of Chaos in the realm of the Gaunt Summoner! Quest with your Champions in his Silver Tower to find the pieces of his Talisman. Show that you are the king dungeon crawler and master of turn based strategy in our challenging game modes, The Gauntlet and The Crucible. Customize your guardian with exotic items and legendary weapons from the Age of Sigmar setting. Summon your fighters from the Warhammer Grand Alliances of Order, Chaos, Death and Destruction. Download Warhammer Quest: Silver Tower, and take part in the epic turn based strategy fantasy battles. Slay your enemies and find that elusive Talisman! Have a taste of the Games Workshop, Age of Sigmar universe! ========== Warhammer Quest: Silver Tower © Copyright Games Workshop Limited 2020. The Warhammer Quest: Silver Tower logo, GW, Games Workshop, Warhammer, Warhammer Age of Sigmar, Stormcast Eternals, and all associated logos, illustrations, images, names, creatures, races, vehicles, locations, weapons, characters, and the distinctive likeness thereof, are either ® or TM, and/or © Games Workshop Limited, variably registered around the world, and used under licence. All rights reserved to their respective owners.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1584980/header.jpg?t=1654791413",
    "Price": 0.0,
    "Developers": "Perchang",
    "Publishers": "Perchang",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1584980/ss_6798abb49ae2068809bf62022f6c62cba6759f38.1920x1080.jpg?t=1654791413,https://cdn.akamai.steamstatic.com/steam/apps/1584980/ss_c272c0bcfe750cf15ebcb5ae192976a1269d59e2.1920x1080.jpg?t=1654791413,https://cdn.akamai.steamstatic.com/steam/apps/1584980/ss_b3ba995c2e5ef47453387a00e3b932501de05d98.1920x1080.jpg?t=1654791413,https://cdn.akamai.steamstatic.com/steam/apps/1584980/ss_8bbc0585553ab5df33a47e0cd2bf73625ac09a6b.1920x1080.jpg?t=1654791413,https://cdn.akamai.steamstatic.com/steam/apps/1584980/ss_0822b162d0531823e84908f00212aa59539b1bb7.1920x1080.jpg?t=1654791413",
    "Slug": "warhammer-quest-silver-tower",
    "Meta Title": "Warhammer Quest: Silver Tower: Jun 2, 2021, Perchang and ...",
    "Meta Description": "Looking for information on Warhammer Quest: Silver Tower? Check out the release date (Jun 2, 2021), developer insights from Perchang, and a complete gam...",
    "Alt Text Image": "Official header image for Warhammer Quest: Silver Tower game - Steam 1584980",
    "Canonical URL": "https://gusku.site/game/warhammer-quest-silver-tower",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warhammer Quest: Silver Tower\", \"description\": \"Looking for information on Warhammer Quest: Silver Tower? Check out the release date (Jun 2, 2021), developer insights from Perchang, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Perchang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Perchang\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1584980/header.jpg?t=1654791413\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}