{
    "AppID": 1090190,
    "Name": "Winds of Change - The Opening Act",
    "Release date": "May 31, 2019",
    "About the game": "NOTE: This is the first act of the game. You will not be able to play any further than that. If you wish to do so, you can purchase a copy of the game in Early Access or Wishlist it in order to receive an e-mail when it's fully released. Your unlocked achievements and save file WILL carry over to the actual game. Winds of Change is a 2D Adventure game set in a living, breathing fantasy world. Embark on the journey of a lifetime! Join The Rebellion, amass an army, and liberate the world! Fully voice acted, with romance options, side quests, and optional content! Inspired by Dragon Age and Mass Effect. A huge amount of dialogue choices let you role play exactly as you want! Huge conversational trees! A game-changing 2D adventure project! STORY You are The Seer of Valinorth. Blessed by the realm of spirits, you are given visions of the future in order to steer your nation's history down the right path. However, one night, a vision shakes the very foundation of everything you know. Forced to leave your home for good, you are thrust into the larger world of Alestia, and taken in by the arms of The Rebellion. Vying for freedom from the tyrannical rulers of the world – The Triumvirate -- The Rebellion fights for liberation. At the center of this conflict is the mysterious “Blade of Exodus”. Once belonging to The Triumvirate themselves, it seems the key to victory may lie in using their own weapon against them. But who can wield an artifact of such immense power? Is victory really within reach, or will The Rebellion fall and be lost to history? The fate of everything rests on your shoulders alone, Seer. Choose wisely, and enjoy your adventure... FEATURES In-Depth point and click interface! Massive story line set in an incredible fantasy world! Voice acted by a stellar cast! Bond with your comrades! Pursue friendships, and even romances! Non-linear story flow! Feel free to stop and explore! Open world atmosphere. Return to past areas at any time! Find hidden objects and books in the environment! Learn about the world! Stop and chat with your party members at any times! Watch your party members interact with each other in skits! View parallel scenes taking place all across the world! Multiple stories at play! Experience side quests and optional stories! ABOUT THE VOICE ACTING Winds of Change features a massive voice cast, featuring top talent from the industry! Voice actors in Winds of Change are best known for performing in franchises such as: The Legend of Zelda Persona 5 Fairy Tail Hunter x Hunter Danganronpa Zero Escape Gundam Mob Psycho 100 One Punch Man One Piece Secret of Mana Fire Emblem Re:ZERO Dust: An Elysian Tail",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1090190/header.jpg?t=1570062964",
    "Price": 0.0,
    "Developers": "Tall Tail Studios",
    "Publishers": "Tall Tail Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1090190/ss_07983f89e336ba38db74e1f56abfb5b0cc8f0b65.1920x1080.jpg?t=1570062964,https://cdn.akamai.steamstatic.com/steam/apps/1090190/ss_affbbc6eb329d58be9a96753599854cb4ce83589.1920x1080.jpg?t=1570062964,https://cdn.akamai.steamstatic.com/steam/apps/1090190/ss_223920f9e51ab372c88f75686687aa05da2664ed.1920x1080.jpg?t=1570062964,https://cdn.akamai.steamstatic.com/steam/apps/1090190/ss_e1c4cd5a5fe04bc03cbbc21c7557dc3684f44e0e.1920x1080.jpg?t=1570062964,https://cdn.akamai.steamstatic.com/steam/apps/1090190/ss_df30e47c55728c7a37c79a986dea3d0b6af1f827.1920x1080.jpg?t=1570062964,https://cdn.akamai.steamstatic.com/steam/apps/1090190/ss_07ae3e6d7ce016db7095635438079d8c6aa198fc.1920x1080.jpg?t=1570062964",
    "Slug": "winds-of-change-the-opening-act",
    "Meta Title": "Winds of Change - The Opening Act: May 31, 2019, Tall Tai...",
    "Meta Description": "Looking for information on Winds of Change - The Opening Act? Check out the release date (May 31, 2019), developer insights from Tall Tail Studios, and ...",
    "Alt Text Image": "Official header image for Winds of Change - The Opening Act game - Steam 1090190",
    "Canonical URL": "https://gusku.site/game/winds-of-change-the-opening-act",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Winds of Change - The Opening Act\", \"description\": \"Looking for information on Winds of Change - The Opening Act? Check out the release date (May 31, 2019), developer insights from Tall Tail Studios, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tall Tail Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tall Tail Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1090190/header.jpg?t=1570062964\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}