{
    "AppID": 1254430,
    "Name": "YATB：You Are The Best - Egypt Chapter",
    "Release date": "Mar 20, 2020",
    "About the game": "This is a very simple independent game, no movie-level game art, no complex game system, no cool skills. This is also a very difficult puzzle solving game, always testing your logical thinking ability. This game, with more than 200 puzzles of logical thinking, can repeatedly experience the fun of game clearance. This game, the illustration style is strange, because I am lack of money, so I only can draw by myself. This game, you can rely on your extraordinary IQ to challenge alone. This game, you can also interact with your children and cultivate their logic ability. This game, you can challenge the vedio game streamer and compete with the speed of game clearance. This game, without dialogue and subtitles, you don't have to worry about language causing trouble at all. This game, only one function, is to constantly choose your correct answer. This game, is only used to prove that you are the best! Ancient Egyptian History Menes: Menes was the founding king of the first dynasty in Ancient Egypt. He unified Egypt, opened the era of pharaoh rule, and established a kingdom with long-term and brilliant influence in the history of human civilization. In about 3100 BC, he conquered lower Egypt and initially unified the whole of Egypt into one country,created the first dynasty of ancient Egypt. Khepesh: The most unbreakable weapon in ancient times, loved by the pharaohs of Ancient Egypt, so it was also called “the Pharaoh's Sword”. Ra, the Sun God: There are many gods in Ancient Egyptian mythology, and the top god of the gods, is the Sun God,Ra. According to legend, Ra is an eagle-headed person，with a snake wrapped around a solar plate overhead.During the day, Ra sailed on the sun-boat 'Mandjet' in the sky，and sailed on another sun-boat 'Mesektet' in the underworld at night, constantly bringing light, warmth and growth to Ancient Egypt. Game developers: Hello, everyone. I am a teacher and a fan of independent games. I have always wanted to develop independent games through my own efforts and integrate education into the games. It took me more than a year to create more than 200 logical puzzles. At the same time, I used the basic RM game development technology to develop this pure puzzle game in my spare time outside of education. The function of this game is extremely simple, and it doesn't even have a multilingual function, because I haven't learned it yet, but I will continue to work hard to learn the game development technology, and what I hope more is that you can experience the joy of logical thinking in solving problems through this game. I also hope to bring the fun of parent-child education to families with children. Through the YATB series of games, we can combine games with education, teach for fun, and exercise the logical thinking skills of game enthusiasts and children who solve puzzles. I hope this simple and challenging game can get your love and support, which will inspire me to continue to adhere to my concept and continue to develop independent games that integrate education into the game. Thank you again for your support! Thank you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1254430/header.jpg?t=1585120074",
    "Price": 2.99,
    "Developers": "QWER STUDIO",
    "Publishers": "QWER STUDIO",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1254430/ss_73f7fae8bae2347169705b9ea5d22c83f0ee8d8c.1920x1080.jpg?t=1585120074,https://cdn.akamai.steamstatic.com/steam/apps/1254430/ss_c6ab4c62a92d408183e690557d4b56c0e9b29212.1920x1080.jpg?t=1585120074,https://cdn.akamai.steamstatic.com/steam/apps/1254430/ss_6ea9e7bda39c75c990679a3ada29794074e9f682.1920x1080.jpg?t=1585120074,https://cdn.akamai.steamstatic.com/steam/apps/1254430/ss_40014a3a13e636754b2c730763c596bb9ce8383e.1920x1080.jpg?t=1585120074,https://cdn.akamai.steamstatic.com/steam/apps/1254430/ss_400469eb6f745fa158f580be784e7108757c3239.1920x1080.jpg?t=1585120074,https://cdn.akamai.steamstatic.com/steam/apps/1254430/ss_6bc4bee27a9ae28141524dd55196cb5bd9050b0e.1920x1080.jpg?t=1585120074",
    "Slug": "yatbyou-are-the-best-egypt-chapter",
    "Meta Title": "YATB：You Are The Best - Egypt Chapter: Mar 20, 2020, QWER...",
    "Meta Description": "Looking for information on YATB：You Are The Best - Egypt Chapter? Check out the release date (Mar 20, 2020), developer insights from QWER STUDIO, and a ...",
    "Alt Text Image": "Official header image for YATB：You Are The Best - Egypt Chapter game - Steam 1254430",
    "Canonical URL": "https://gusku.site/game/yatbyou-are-the-best-egypt-chapter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"YATB\\uff1aYou Are The Best - Egypt Chapter\", \"description\": \"Looking for information on YATB\\uff1aYou Are The Best - Egypt Chapter? Check out the release date (Mar 20, 2020), developer insights from QWER STUDIO, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"QWER STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"QWER STUDIO\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1254430/header.jpg?t=1585120074\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}