{
    "AppID": 1943740,
    "Name": "Arrival of Beasts",
    "Release date": "May 13, 2022",
    "About the game": "Prepare yourself for the next map at the headquarter by equipping your base and unlocking strong abilities. Study maps in detail and plan your next strategy. Take a look at the beastcards, your statistics and compare yourself with other players in the online ranking . Create a team with up to 8 players and help each other reaching further progress with boosts. Build more than 9 different towers to implement your individual tactics. Some towers allow you to use modules to create unique effects . Other towers have military abilities by default to support your plan. Each standard tower can be upgraded from level 1 to level 8 to kill the strongest beasts. Craft 8 different basic modules and use them to improve your towers. In the late game, modules can be combined to stronger modules in order to create enormous effects. By leveling the modules you can defeat the hardest beasts. More than 45 unlockable skills await you in the skillstar. You can unlock more buildings, spells for your player or more special talents. The basic modules can also be reinforced there. Each achieved profile level allows you to invest points in Military , Economy or Science . This allows you to specialize and improve your individual playing style. The campaign consists of 6 worlds and 30 maps and can be repeated infinite times after playing through. This process is called prestige and rewards you enormously. In addition, the game difficulty changes dynamically after each prestige, so new strategies are required. Discover more than 37 beasts and 28 bossbeasts . Each beast is unique and can be equipped with special skills later in the game that make life difficult for the player. There are also ranged beasts that can destroy your towers. A tactical placement is therefore very important. Collect Resources (Gold, Rubonium and Amnestryth) to buy buildings, modules or upgrades during a match. If you win, resources are converted into valuable skillpoints. Build lots of different buildings from the three pathes military, economy and science. These include mines, towers, power-up buildings, module factories, ... and more! Be the best! Collect prestige-points and climb up the ranking to show everyone you´re the best. Create a team of up to eight players and work together to get #1 in the ranking. You can help and strengthen each other with team donations. Buy random generated objects with random generated properties and four different rarities. Equip your base with up to 8 objects suitable for any strategy. Prove yourself on the endless map . Which wave can you reach? Compare yourself to other players on the endless map ranking. No matter how far you get, the endless map remains dynamically exciting because of an interesting spawning system. Choose the appropriate difficulty, collect 100 achievements , collect and study beastcards, learn interesting mechanics and use them cleverly, prestige-ranks unlock new content, buy &gt;24 different random generated prestige-items if you reach prestige-rank 2, your profile statistics will depicted legendary in the trophyroom, play random maps with new situations, levelsystem for profile/beasts/abilities, ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1943740/header.jpg?t=1654068607",
    "Price": 14.99,
    "Developers": "FreeTimeDevelopment",
    "Publishers": "FreeTimeDevelopment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1943740/ss_aecc2d46838cb730ea95326c00a9101af1ebcdad.1920x1080.jpg?t=1654068607,https://cdn.akamai.steamstatic.com/steam/apps/1943740/ss_ab15a7c20704ddee3fadc5920586eac8b73fb82b.1920x1080.jpg?t=1654068607,https://cdn.akamai.steamstatic.com/steam/apps/1943740/ss_01eb93376416c362908d1a254adadb3f514de888.1920x1080.jpg?t=1654068607,https://cdn.akamai.steamstatic.com/steam/apps/1943740/ss_4b59b2504e98375bbfb9a31e6b976ce278374217.1920x1080.jpg?t=1654068607,https://cdn.akamai.steamstatic.com/steam/apps/1943740/ss_51e2a1fe87e34355b6722c38870b4469ab87756f.1920x1080.jpg?t=1654068607,https://cdn.akamai.steamstatic.com/steam/apps/1943740/ss_0a0acdba7c62e341ffbb7a526b8297d50f113354.1920x1080.jpg?t=1654068607",
    "Slug": "arrival-of-beasts",
    "Meta Title": "Arrival of Beasts: May 13, 2022, FreeTimeDevelopment and ...",
    "Meta Description": "Looking for information on Arrival of Beasts? Check out the release date (May 13, 2022), developer insights from FreeTimeDevelopment, and a complete gam...",
    "Alt Text Image": "Official header image for Arrival of Beasts game - Steam 1943740",
    "Canonical URL": "https://gusku.site/game/arrival-of-beasts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arrival of Beasts\", \"description\": \"Looking for information on Arrival of Beasts? Check out the release date (May 13, 2022), developer insights from FreeTimeDevelopment, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FreeTimeDevelopment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FreeTimeDevelopment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1943740/header.jpg?t=1654068607\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}