{
    "AppID": 1555220,
    "Name": "Artemishea",
    "Release date": "Jun 24, 2021",
    "About the game": "Artemishea: A Rugged World to Survive in Artemishea is built on the principle of being a realistic open world animal survival game, where the player takes control of a creature and fights to survive within their environment. Discover everything and uncover mysteries along the way. Explore vast and beautiful landscapes: from the rocky regions, to lakes, valleys, mountains and even the sky! Make the gameplay your own. There is nothing stopping you from personalising your creature's survival journey each time you step into Artemishea's naturalistic world, an open and limitless experience. Be conscious that if you die, your game will start all over again. This multiplayer adventure offers a brutality that will teach you how to hunt, survive and thrive in this rugged world. Massive online multiplayer When logging into one of our servers you will be given options of what creature you can start a survival journey on. From small and resourceful raccoon and rabbit, all the way to the large and dangerous rhinoceros and tiger. Our servers will offer 100+ online player's with the intentions of surviving. As a predatory creature you will need to learn how to hunt in order to survive, which entails taking on other players with their own personal set of skills in self-defence. You never know which hunt will be your last. The option to scavenge from the prey remains left behind by successful hunters is too a dangerous path, as you never know where the predator may be lurking. Trusting other players may get you killed and turned into dinner. Game Modes Prior to joining a server you will see which game mode they are hosting. These include: sandbox and progression. Sandbox offers you a punish free zone to practice your fighting, get used to the feeling of each animal and meet new players without the concern of losing hours of survival time. Select your desired animal and spawn into the sandbox world, have some risk-free fun! Progression, on the other hand, requires you to spawn in as a low tier animal initially (example: raccoon -&gt; fox -&gt; wolf -&gt; bear). To unlock new tiers you will be required to achieve a specific amount of points within a specific server, points do not apply across servers. Each minute of survival is a single point gained, so you will be required to survive as a low tier for at least 45 minutes in order to gain 45 points to unlock the next tier. The cycle will continue until you reach your goal animal. As previously mentioned, if you die your points will reset and you will be starting from the beginning once more. The harder you work to survive the more impressive your achievements will be. Future Artemishea's future is to be turned into a realistic simulation of our current natural world. What we plan to represent: - Ailments: breaking bones, altered stances from injury, scars, disease, sickness, and even paralysis. Your creatures survival story, their fights and struggles, will be told through the visible wounds and tattered conditions. - Creatures: we will offer more animals as the game progresses - Scent system: aiding in tracking animals footsteps, finding food and water. - AI: realistic creatures with complex behaviours able to be hunted. - Gore: spawned gore will be available around the map to offer a secondary source of meat supply. - Reproduction: birds will be able to nest whereas mammals will be giving birth to live young. - Mod Support: steam workshop will allow for custom maps, settings, creatures etc. - Fishing: animals known to fish, such as the raccoon and leopard, will be able to use this mechanic in water sources like ponds. - Snatching: birds of prey will be able to snatch the small young of other animals. - Fighting: more mechanics will be added for combat. - Destructible environment: you will be able to interact with the land around you and alter it within reason. This is our current list for planned updates, this is up for expansion and alternating as time continues. Feedback is a necessity, community input will be needed for Artemishea's wonderful transformation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1555220/header.jpg?t=1646258515",
    "Price": 19.99,
    "Developers": "Opendix147",
    "Publishers": "OpendixStudios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_ebb366a584e8ea379ebd93c59833c1a6b45a739d.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_59b9de203e7a15a0cf0045f42d9e0bf298694915.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_df11b2896441efd16e90d9f68ac9f39a847bda89.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_87b8ab009cb7c56c6cf64fb87bfd7c82b9226827.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_af4443ca872f3e1f8633d1a1bb31c65b43674d8d.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_c02800d2d72023858f4dd9abc397646aa6a1ee84.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_b3796f0e8582c1a31c11d17688dbe3ca3f466609.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_9b79f1ce326769b141cd6f56286e087ee451f0b5.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_1a7e8ee26ccd662dd4760a34c9685c16af572a2c.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_e2698a4951b774433cfceb4a9dd485d3880bde0b.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_0b67316ee9323e41c6ac5b0b4326404a135db8da.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_95a69527365bc266ebe91cf42218cdab7c118f54.1920x1080.jpg?t=1646258515,https://cdn.akamai.steamstatic.com/steam/apps/1555220/ss_79891f6916d7d1b6b41bfd686153a8ce7af83b70.1920x1080.jpg?t=1646258515",
    "Slug": "artemishea",
    "Meta Title": "Artemishea: Jun 24, 2021, Opendix147 and Full Overview",
    "Meta Description": "Looking for information on Artemishea? Check out the release date (Jun 24, 2021), developer insights from Opendix147, and a complete game summary.",
    "Alt Text Image": "Official header image for Artemishea game - Steam 1555220",
    "Canonical URL": "https://gusku.site/game/artemishea",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Artemishea\", \"description\": \"Looking for information on Artemishea? Check out the release date (Jun 24, 2021), developer insights from Opendix147, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Opendix147\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OpendixStudios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1555220/header.jpg?t=1646258515\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}