{
    "AppID": 1578190,
    "Name": "Arttista",
    "Release date": "Apr 2, 2021",
    "About the game": "What is Arttista and how it can help you Arttista is a drawing application that mix vector drawing and illustration using a innovative way of do things, keeping everything alive and organic. Focused on artistic drawings like living forms, landscapes, cartoons and paintings, it supplies different tools and techniques that can give you different results. These tools and all these differences, makes you draw and paint freely like you were drawing on paper or canvas, without lose any vector information behind it, cause in Arttista, everything behind all painting remains vector, but with organic visual aspect. In current version, we already can see a lot of possibilities while we can draw very complex arts with illustration and painting aspect. This is what is really important in Arttista… to make your vector drawing so alive and organic as some other illustration or painting by hand. Easy To Use It’s really really easy to use. In about 20 minutes you can know all Arttista features and how to use them. The rest it’s up to your creativity. Draw Like You Were Illustrating And Edit Like Everything Were Vector Arttista is a vector drawing software with a powerful and fast render that tries to render with illustration or painting aspect as much as possible. This gives us beautiful results while every little thing remains editable at any time. Brushes You can create your own brushes and define how it’s dynamics will work. Besides, the same brush can be used with different textures giving again another universe of possibilities. And everything remains vector backstage. You can paint freely or just inside objects you have selected. If you paint inside some object, these brushes will be part of it and then, you can easily select entire objects including it brushes or select only the brushes. You can create your own brushes adding textures, setting rotation, size and alpha dynamics. Besides this, you can save your current brush to Brush Library and use it anytime in any other drawing/project. Pens You have a point click pen and a free-hand-pen. Both support dynamics like brushes and you can also save your current pen to pen library. Although a pen is usually used for foreground, you can also use a texture with a pen, which lets you give a more imperfect aspect when needed. Dynamics In Arttista, the same line can have some points with different size, different colors and transparency. You don’t need to separate an object in many parts just to give “hand drawn aspect”. You can select any points of any object’s line, with others objects points, and then edit all together. Arttista has very flexible dynamics and every tool has it implemented. Eraser Eraser in Arttista is very powerful, cause it really behaves like a real eraser, which gives us a very impressive correction over drawings. Eraser it’s a brush inverted and also has dynamics and texture. It’s not like erasers in other vector drawing softwares, cause Arttista treats erasers like an organic component too. Although Arttista is a vector drawing software, eraser render results like in the raster softwares. So, that’s why you can do amazing finishings using Eraser in Arttista. Animation Arttista has grown and now has a great frame to frame animation system. It provides tools that will help to control frame content over animation frames and tools that will help to deal with points/vertices selection, transforming into an easy process of pose creation. It also helps you copy, move and reverse copy, animation of all or just some selected objects during a selected time at timeline. Shapes Library Arttista has a shapes library with predefined usual shapes as rectangles, triangles and circles. But, beside all this, you can export any drawing/project of yours to this shapes library, and then, reuse it any time in others drawings. This shapes library supports animation too, which means that an eye in movement exported to this library, and then imported to current drawing, it will come with all animation frames to your current drawing. Development Arttista is in constant development. It has a long way to go and this is very positive, because all this is just the beginning. Imagine what will be possible. And you, as a user, can participate giving ideas and suggestions. We can build a very impressive drawing software together. eedbacks are not just welcome, they are really implemented most of the time. Supported import Image files JPEG PNG Supported export Image files PNG Supported export animation files PNG SEQUENCE Supported selection of content to export All objects in the scene Only Selected objects in the scene Supported import vector files ART (Arttista vector files)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1578190/header.jpg?t=1652451640",
    "Price": 54.99,
    "Developers": "Helmuth Schmitz",
    "Publishers": "Helmuth Schmitz",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_6388e89ea559342430faed7a4715b8d66471a9a6.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_abd3a9e34ede9e7dbe9b0011894ab2d549e2237e.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_f57d8aa4dc21ab646b60826e0b140173463a48aa.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_11c97769902c9c48201e9d2e034ce959a6cbbdd6.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_1b4b7c35dc47e6ce29c040c9afb17be01c9cdfeb.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_b519efdb48af3e2b7c7bbd0f50fdc821f9d1f03d.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_0a4d776cb073a6b69807cb9d3c9ae5d934f892bf.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_416cb61fdc6492f78f0c252406f37a103cbbdb30.1920x1080.jpg?t=1652451640,https://cdn.akamai.steamstatic.com/steam/apps/1578190/ss_cf1d89d3428637ffc0339cbb24d4110f2254ce23.1920x1080.jpg?t=1652451640",
    "Slug": "arttista",
    "Meta Title": "Arttista: Apr 2, 2021, Helmuth Schmitz and Full Overview",
    "Meta Description": "Looking for information on Arttista? Check out the release date (Apr 2, 2021), developer insights from Helmuth Schmitz, and a complete game summary.",
    "Alt Text Image": "Official header image for Arttista game - Steam 1578190",
    "Canonical URL": "https://gusku.site/game/arttista",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arttista\", \"description\": \"Looking for information on Arttista? Check out the release date (Apr 2, 2021), developer insights from Helmuth Schmitz, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Helmuth Schmitz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Helmuth Schmitz\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1578190/header.jpg?t=1652451640\", \"offers\": {\"@type\": \"Offer\", \"price\": 54.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}