{
    "AppID": 742520,
    "Name": "Astrologaster",
    "Release date": "May 9, 2019",
    "About the game": "The story London, 1592. A great plague sweeps through the capital. When doctors flee the city in fear, a hero rises. His name is Simon Forman, “Doctor” of Astrology, Astronomy and Physick. Not only does he have the power to cure the sick, he can find their lost pets and predict their futures! All by reading the movements of the stars. But when the plague ends, Forman’s problems begin. The real doctors return to London and they will stop at nothing to bring him down... The game Play as ‘Doctor’ Simon Forman - unlicensed medical professional and astrologer - and help him win a medical licence. Astrologaster is a narrative-based comedy game. Explore Forman’s life, his work, and his relationships with his clients. Make story choices by performing astrological readings. Choose strategically or make decisions just for fun - but be aware that your choices will have consequences (and unpredictable side effects!) 13 clients come to see you 5-7 times seeking advice for personal, professional and medical problems. By examining the stars in the sky, you diagnose and determine answers for your clients’ problems. As well as affecting the storyline, these choices will alter your clients’ satisfaction levels. Satisfied clients will write you letters of recommendation, and with enough of these letters you can obtain a medical licence from the University of Cambridge. So-called “real” (licensed) doctors call Forman a quack and fraud. Help Forman prove these medical establishment elitists wrong! Features Perform real* astrology: Examine the sky and choose astrological interpretations that Forman will use to advise his patients. (But remember: astrology is not an exact science!) Solve Hilarious Problems: Consult on problems ranging from Elizabethan terror plots and foul diseases, to romantic entanglements and stolen pies! Change Lives: Win your patients’ favour or ruin their lives. Advise 14 characters who return 5-7 times. Patients have their own ongoing stories which often overlap with each other. Use gossip from some characters to guide and manipulate others. Win A Medical Licence: Convince patients to write letters of recommendations. Collect enough letters to exchange them for a medical licence. Fully Voiced Character Dialogue: Sitcom-style comedy brought to life by a cast of over a dozen actors. Sing Along: Enjoy Renaissance-era music and sing along to each character’s theme song. Casebooks Come Alive: Simon Forman’s cases are presented as a beautiful pop-up book. Turn pages to delve deeper into your patients’ stories. Summary Astrologaster is a story-driven astrological comedy game set in Shakespeare’s London. Based on a true - and truly ridiculous - story. Simon Forman was considered a sage by some and a charlatan by others. What will your legacy be? Will you put your faith in the stars?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/742520/header.jpg?t=1611763525",
    "Price": 9.99,
    "Developers": "Nyamyam",
    "Publishers": "Nyamyam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_6fd67e02f53d88f29eac55b323db7318f20a9c47.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_26142ef2e24b6c57eb0362043688dcc7e791f8f1.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_7e3eae728d6d2b9ece4c6d96cfba82fb4b04adf7.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_38d2ea408ebd4966560f4f3c57359dd3f170dce1.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_0e28a5dffb288631843ccb1f1ec9ab07ed5338f9.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_ab7518d97776c230b012593dc5b050dbfbe1e0cc.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_f142fb7d09158cfc662fd2194c9a558ee1b69abd.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_556255cfaf538d57783ae7e2178b653e91e94526.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_4998aed060507be40b950940a936ba6906a3d9de.1920x1080.jpg?t=1611763525,https://cdn.akamai.steamstatic.com/steam/apps/742520/ss_abe94607eba8b2ae49d2c93cfec55f0da788610b.1920x1080.jpg?t=1611763525",
    "Slug": "astrologaster",
    "Meta Title": "Astrologaster: May 9, 2019, Nyamyam and Full Overview",
    "Meta Description": "Looking for information on Astrologaster? Check out the release date (May 9, 2019), developer insights from Nyamyam, and a complete game summary.",
    "Alt Text Image": "Official header image for Astrologaster game - Steam 742520",
    "Canonical URL": "https://gusku.site/game/astrologaster",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Astrologaster\", \"description\": \"Looking for information on Astrologaster? Check out the release date (May 9, 2019), developer insights from Nyamyam, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 9, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nyamyam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nyamyam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/742520/header.jpg?t=1611763525\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}