{
    "AppID": 1563940,
    "Name": "Atlantica Europe",
    "Release date": "May 20, 2021",
    "About the game": "Atlantica Europe is a free-to-play (F2P) 3D tactical massively multiplayer online role-playing game (MMORPG) developed by NDOORS Corporation. The game's primary setting is a fantasy-themed alternate history Earth composed of a diverse blend of historical, cultural, allegorical, and mythological elements. The game world is primarily modeled after real-world geography with accessible locations on six of the seven continents as well as the mythical floating continent of Atlantis from which the game's name is derived. Atlantica, a powerful and magical civilization is the most looked upon producer of the material: Orikarukon. However, due to overwhelming greed, they have exhausted all the sources of Oriharukon and lost control of their magic powers. Atlantis disappeared but the remnants of Oriharukon survived. As the descendant of the Atlantians, you must discover the world and save mankind from the evil influences of Oriharukon, together with the mercenaries you meet on your journeys. Mercenaries - Collect more than 30+ mercenaries to aid you on your quests and battles! Create the perfect formation! Strategic Combat and PVP - Standard or Turn-based, strategize and defeat your opponents! Historical Content - Interact with familiar NPCs from stories of the past along your journey, some of them can also become your ally. Travel places based on real continents and its countries! Customizable 'MyHome' - Decorate, store items, train mercenaries, have a feast! Your home, your rules! Guild and Nation Conquest - Be a guild leader or unite a group of guilds and become a king of the nation! Quest and Dungeons - Over 20+ Dungeons waiting to be discovered and conquered! Full Customization of your Avatar! - Dress your character whatever theme you want, in fact you can dress your mercenaries too! Combine and Conquer - Conquer and wage war against other guilds who occupy other towns! Only the strong guild shall survive! Atlantica's publisher and developer, NDOORS Interactive, regularly releases new content updates which include, for instance, new dungeons, quests, NPCs, skills, mercenaries, outfits, equipment, mounts, and community features. Now, the game development and management is handled by VALOFE Global LTD and the and being supported by the VALOFE Operation team.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1563940/header.jpg?t=1654049148",
    "Price": 0.0,
    "Developers": "VALOFE,NEXON",
    "Publishers": "VALOFE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1563940/ss_66eed95e25fc4e0806d686f82117ccc0898613ac.1920x1080.jpg?t=1654049148,https://cdn.akamai.steamstatic.com/steam/apps/1563940/ss_2e13355026afb169d448e0a91150bf64698619c0.1920x1080.jpg?t=1654049148,https://cdn.akamai.steamstatic.com/steam/apps/1563940/ss_488287ea9214df19649ebe336fb8c3a60d4f2091.1920x1080.jpg?t=1654049148,https://cdn.akamai.steamstatic.com/steam/apps/1563940/ss_12b9c42bdf8c938df1ecdfcfe1bc298f3e14656b.1920x1080.jpg?t=1654049148,https://cdn.akamai.steamstatic.com/steam/apps/1563940/ss_e777e76fd6d81ee8165f392b2f63e18bfd395178.1920x1080.jpg?t=1654049148,https://cdn.akamai.steamstatic.com/steam/apps/1563940/ss_0f78fc1d9b12896e09f4b99a3f0e89eb86b2b767.1920x1080.jpg?t=1654049148",
    "Slug": "atlantica-europe",
    "Meta Title": "Atlantica Europe: May 20, 2021, VALOFE,NEXON and Full Ove...",
    "Meta Description": "Looking for information on Atlantica Europe? Check out the release date (May 20, 2021), developer insights from VALOFE,NEXON, and a complete game summary.",
    "Alt Text Image": "Official header image for Atlantica Europe game - Steam 1563940",
    "Canonical URL": "https://gusku.site/game/atlantica-europe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Atlantica Europe\", \"description\": \"Looking for information on Atlantica Europe? Check out the release date (May 20, 2021), developer insights from VALOFE,NEXON, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"VALOFE,NEXON\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VALOFE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1563940/header.jpg?t=1654049148\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}