{
    "AppID": 1482850,
    "Name": "Big Adventure Of Fighting Chicken",
    "Release date": "Dec 21, 2020",
    "About the game": "Essential Upgrade! The upgrade of the game has fixed BUGs, optimized some scenes and sound effects, made the game run more perfectly, increased save points, improved game mechanics, and the game has become more conducive for players to quickly run the game. In addition, it also has fixed save points related issues. This game is an orthodox 2D Platform Action Adventure Game. In this game, you will play as Jack, the strongest warrior of the chicken clan in the peaceful farm, run through the huge levels, defeating powerful enemies to rescue chicks from the distance. ●This game is challenging. It is true that the world is cruel. No one can casually succeed. Only by defying hardships and dangers, moving forward courageously, and patiently bursting toward the goal can the ideal be achieved. ●Synopsis Of Game Story In the beautiful countryside, there is a peaceful farm. The roosters, hens and chicks all lead a stable life. One day, the Furious Eagle led his subordinates and caught the chickens One day, the Furious Eagle led his subordinates and caught the chickens rapidly, as the chicks were defenseless. Jack, as the strongest warrior among the chickens, lives up to the elder's expectation, takes on the responsibility of saving the chickens, embarking on an incredible journey across different places, defeating different enemies and their boss, and the leader of the bosses Furious Eagle. Charge! Fighting chicken, the future of the chicken clan depends on you! ●Collect Objects To Power up yourself ① By constantly strengthening yourself, then the player has enough power to defeat the strong bosses. In this game, player can collect Diamonds to increase the limit of HP, collect Amethysts to increase the limit of SP, and collect Rubies to increase attack power (including skills attack power). ② Player can also gain food to restore HP and skill SP by knocking down enemies. Apples, corns, bananas, carrots, and watermelons are used to restore HP; Pears, oranges, grapes, cherries, and cantaloupes are used to restore SP. ●Different Skills ① The original skills of this game are Punch, Air cannon, and of course sliding. ② By knocking down the bosses of the specific levels, the protagonist can acquire new skills from these bosses, they are Heavy Smash, Strong Kick, and Super Air Cannon. The new skills can better cope with more and more powerful enemies or bosses. ③ Using newly learned skills will consume a certain SP, but Air Cannons and Super Air Cannons can through the walls, player should make good use of this feature and make full use of the player's wisdom to solve various problems. ④ SP will restore automatically. ●24 Huge Levels ① This game has 24 huge levels, the terrains of levels includes riverbanks, swamps, forests, deserts, caves, mountains and so on, which make us exciting. ② In addition to a large number of enemies in the level, there are also a large number of obstacles and hazzards that player need to avoid. ●72 Different Types Of Enemies(Including Bosses) There are 72 different types of enemies in this game. There are close combat, long range combat and a combination of the two. They are very strong, player need to use wisdom to knock them down, especially in the BOSS battle. After knocking down the enemy, you can collect the dropped objects of enemies. ●12+ Different Types Of Bosses ① This game contains 12 main level bosses. They need to be knocked down to qualify for entering the next level, player need to be cautious and patient in the battle. After knocking down, there will be generous rewards. ② In addition, this game also has extra bosses with the same strength as the main bosses, although they are not required to be defeated, there are extra rewards for defeating them. ●Support GamePad Control Any control of this game can be done with a gamepad. ●This game is for all those who dare to pursue their dreams ●The game is developed by one person",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1482850/header.jpg?t=1620736453",
    "Price": 9.99,
    "Developers": "Observer Of World",
    "Publishers": "Observer Of World",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_7b31d7aa4dead03390b74db05aa5a574685a67e2.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_24d06aaaa43562c952bbf6d9e78de0d852a28571.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_65ef9d8374008b82aa82084837a144bda3c7828a.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_c211f922f9851f8e9c0941e22bd84a11644e2599.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_a1b652b9837b4b8cb4d29659850e51233f2556ba.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_faeadf4a0eb234c91511ea3309f894509533bf08.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_b180d990b67c23786695d1ee5037a4fe03870200.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_0c8184dbd0464aaf72340c7d18ea315ffa4a94e0.1920x1080.jpg?t=1620736453,https://cdn.akamai.steamstatic.com/steam/apps/1482850/ss_94bfc7d4d6c9653c475e8f7d654d838307176c4d.1920x1080.jpg?t=1620736453",
    "Slug": "big-adventure-of-fighting-chicken",
    "Meta Title": "Big Adventure Of Fighting Chicken: Dec 21, 2020, Observer...",
    "Meta Description": "Looking for information on Big Adventure Of Fighting Chicken? Check out the release date (Dec 21, 2020), developer insights from Observer Of World, and ...",
    "Alt Text Image": "Official header image for Big Adventure Of Fighting Chicken game - Steam 1482850",
    "Canonical URL": "https://gusku.site/game/big-adventure-of-fighting-chicken",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Big Adventure Of Fighting Chicken\", \"description\": \"Looking for information on Big Adventure Of Fighting Chicken? Check out the release date (Dec 21, 2020), developer insights from Observer Of World, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Observer Of World\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Observer Of World\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1482850/header.jpg?t=1620736453\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}