{
    "AppID": 778390,
    "Name": "Corpse Party: Book of Shadows",
    "Release date": "Oct 29, 2018",
    "About the game": "NOTE: This title is a followup to Corpse Party , and thus contains considerable spoilers for that game. If you have not played it, then I beg thee delve farther into these depths at your own risk, dear player! An anthology series that serves as a Corpse Party sequel, prequel, midquel, and alternate universe tale all in one, Corpse Party: Book of Shadows is a horror/adventure game developed by MAGES. (formerly 5pb. Games) and published under the supervision of the original series creators at Team GrisGris. Corpse Party: Book of Shadows builds upon the events of the first game, exploring or re-exploring past incidents, characters, and points of view, and allowing the player to escape many of the deaths that occurred previously, thus steering them toward all-new (albeit not necessarily better) outcomes. This PC version updates the original PSP system version’s art to HD and adds full mouse support for authentic point-and-click gameplay, providing the definitive Corpse Party: Book of Shadows experience for series fans who are eager to delve a little deeper into its storied lore. Before, during, and after the events of Corpse Party —in the canon universe, as well as in several alternate timelines—the students of Kisaragi Academy, Byakudan Senior High, Paulownia High, and Musashigawa Middle School had far more experiences within the cursed halls of Heavenly Host Elementary than the stories typically recount. How would events have unfolded, for example, in a universe where each student went into the Sachiko Ever After ritual with an unconscious awareness of everything that was going to happen to them? What might’ve occurred to Mayu if she’d never interacted with the ghostly children in the school infirmary? What might’ve occurred to Yuka if she’d been caught during the harrowing chase in the second wing? What might’ve occurred to Seiko if Naomi had gotten to the bathroom just a bit earlier? On the other side of the coin, how did Naho actually get into Heavenly Host, and whom did she come with? What was Tohko’s relationship with Kizami, and how did that result in a lost tooth? And what connection did Ms. Yui have to the cursed elementary school prior to ever taking part in the Sachiko Ever After ritual? Most crucially, what happened to the survivors of the previous incident after their escape? How did the loss of their friends affect them? And what does all of this have to do with the mysterious tome known as the “Book of Shadows”…? FEATURES Point-and-Click-Style First-Person Gameplay More realistically proportioned and immersive first-person environments bring Heavenly Host to life in all its grim glory, with point-and-click-style “Search Mode” allowing players to scour every inch of every room via keyboard, gamepad, mouse, or any combination thereof… Original Japanese Voiceovers with More 3D Audio Than Ever Before Every line of dialogue is spoken in its original Japanese by a who’s who of Japanese voiceover talent, with many crucial scenes recorded in binaural 3D using dummy-head microphones: play with quality headphones or a hi-fi stereo setup to hear the horror coming from all around you, or perhaps from right next to your ear… Dastardly “Darkening” System Leads to Painful Demise Characters gradually become frightened and unstable as horrific discoveries are made, distorting the game’s graphics and altering their decision-making abilities; continuing down these darkened paths will result in one of the game’s many dozens of gruesome “Wrong Ends,” all of which are virtually guaranteed to replay in players’ nightmares… Enhanced Focus on Side Characters The already robust cast from the original game is further humanized, with a focus on those characters whose screen time may have been lacking before; learn more about your favorite side characters, and find out just what was going on in their heads (before those heads were crushed)… Unlockables, Achievements, and More Steam achievements, collectibles, voice cast interviews, music tracks, art stills, and more are unlockable through a variety of means for attentive and detail-oriented players; additionally, those who’ve conquered or even just dabbled in the first Corpse Party will be able to import their save-data to unlock dozens more art stills, and possibly even make the crucial final chapter of the story available to play through a bit sooner than it otherwise would be…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/778390/header.jpg?t=1624578370",
    "Price": 14.99,
    "Developers": "MAGES. Inc.,5pb.",
    "Publishers": "XSEED Games,Marvelous USA, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_fe8b103c9d565a981d8eda8cc0ee094946e78f0e.1920x1080.jpg?t=1624578370,https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_6583afdce5afe71d4b8c6b4ba526dc92edb0b8b1.1920x1080.jpg?t=1624578370,https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_009e35bd1491f30fcb17f0fc932fb41089a9fc3c.1920x1080.jpg?t=1624578370,https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_f476a8d1703278cc2c26ce90bf4b4ee4603c8e26.1920x1080.jpg?t=1624578370,https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_1e50905bb3ca59abac813b72bf6108735e98ef86.1920x1080.jpg?t=1624578370,https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_b5afe793debd2df73e0207b692de526019015ca1.1920x1080.jpg?t=1624578370,https://cdn.akamai.steamstatic.com/steam/apps/778390/ss_351eba7d1fec90c567732c5417a9d88723cb10b4.1920x1080.jpg?t=1624578370",
    "Slug": "corpse-party-book-of-shadows",
    "Meta Title": "Corpse Party: Book of Shadows: Oct 29, 2018, MAGES. Inc.,...",
    "Meta Description": "Looking for information on Corpse Party: Book of Shadows? Check out the release date (Oct 29, 2018), developer insights from MAGES. Inc.,5pb., and a com...",
    "Alt Text Image": "Official header image for Corpse Party: Book of Shadows game - Steam 778390",
    "Canonical URL": "https://gusku.site/game/corpse-party-book-of-shadows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Corpse Party: Book of Shadows\", \"description\": \"Looking for information on Corpse Party: Book of Shadows? Check out the release date (Oct 29, 2018), developer insights from MAGES. Inc.,5pb., and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGES. Inc.,5pb.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XSEED Games,Marvelous USA, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/778390/header.jpg?t=1624578370\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}