{
    "AppID": 1334760,
    "Name": "CRASH: Autodrive - Prologue",
    "Release date": "Aug 18, 2020",
    "About the game": "This is the FREE prologue demo for CRASH: Autodrive! PLEASE NOTE: The final game has a lot more polish than this old prologue build! :-) CRASH: Autodrive is a narrative adventure set in the near future where nobody drives and self-driving Autocabs rule the city streets. It's just a normal day when four strangers get into an Autocab, but they are quickly thrust into danger when the car impossibly hits a cyclist. When they exit the car, they discover they all know the victim and they all have a motive for murder! Even the car's artificial intelligence! You play as Emily, a young woman from a small town trying to make it in the big city. You will get to know your fellow passengers, and the car's A.I. as you investigate clues, solve puzzles, and use the clues you find to contradict lies, explore new conversations, and piece together the mystery of who killed Thomas Sinclair! Key Features A compelling sci-fi murder mystery story with some thought-provoking life lessons and themes of grey morality. A diverse cast of charming and authentic characters. Spirited and funny writing, yet serious when it needs to be. A bangin' soundtrack inspired by classic detective and murder mystery games. A 3-4 hour playtime for players with a busy schedule and too many games to play. Meet the Cast! Emily Knight (that's you!) The down-and-out college student who needs to break out of her small-town shell. Thomas Sinclair The charismatic tech maven, inventor of the Autocab's artificial intelligence, but now stuck in middle management at Vanguard Global Industries. Kyle 'Kondor808' Kondor Once a fat nerdy kid bullied by Thomas Sinclair, now a fit hugely successful game streamer with insecurities. Anna Lamarr The A.I. psychologist and frustrated co-worker of Thomas Sinclair who just wants to move up in her career but keeps hitting a glass ceiling. Carter Jones Genius engineer, inventor, family man, and snubbed former partner of Thomas Sinclair. A.D.A. The unique and enigmatic Autocab artificial intelligence owned by the Vanguard Global Industries megacorporation. Find the clues! Get to know your fellow passengers! Contradict their lies with the clues! Find out who killed Thomas Sinclair in this short narrative adventure murder mystery.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1334760/header.jpg?t=1625842786",
    "Price": 0.0,
    "Developers": "Studio Nightcap",
    "Publishers": "Studio Nightcap",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1334760/ss_0735569e57eef7ac50324dbfd9eaca7a95f5f0c9.1920x1080.jpg?t=1625842786,https://cdn.akamai.steamstatic.com/steam/apps/1334760/ss_1a7bbc375fc5963a0d02d83081250e644665c0fa.1920x1080.jpg?t=1625842786,https://cdn.akamai.steamstatic.com/steam/apps/1334760/ss_fd2b6f470d12afdab6f6a9989b23987c57d29dbf.1920x1080.jpg?t=1625842786,https://cdn.akamai.steamstatic.com/steam/apps/1334760/ss_2b0c22bea7951576ecfe03fdd17868b005369a35.1920x1080.jpg?t=1625842786",
    "Slug": "crash-autodrive-prologue",
    "Meta Title": "CRASH: Autodrive - Prologue: Aug 18, 2020, Studio Nightca...",
    "Meta Description": "Looking for information on CRASH: Autodrive - Prologue? Check out the release date (Aug 18, 2020), developer insights from Studio Nightcap, and a comple...",
    "Alt Text Image": "Official header image for CRASH: Autodrive - Prologue game - Steam 1334760",
    "Canonical URL": "https://gusku.site/game/crash-autodrive-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CRASH: Autodrive - Prologue\", \"description\": \"Looking for information on CRASH: Autodrive - Prologue? Check out the release date (Aug 18, 2020), developer insights from Studio Nightcap, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Nightcap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Nightcap\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1334760/header.jpg?t=1625842786\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}