{
    "AppID": 978990,
    "Name": "Cyberlink Screen Recorder 4  - Record your games, RPG, car game, shooting gameplay - Game Recording and Streaming Software",
    "Release date": "Nov 27, 2018",
    "About the game": "Livestreaming Online Start creating content that engages with your followers on Twitch, YouTube or Facebook. Integrate webcam commentary into livestreams with additional overlay objects. Use a Custom Streaming Server Not only does Screen Recorder let you stream to your favorite platforms like Twitch, Facebook &amp; YouTube Live, it also lets you use custom streaming servers to reach your audience. Multistream to Twitch, YouTube, Facebook and Custom Servers Screen Recorder lets you multistream to up to five different services. This means you can simultaneously livestream to Twitch, YouTube, and Facebook, plus up-to two additional custom servers. It's an easy to reach a wider audience without the need for additional relay servers. Integrate Your Webcam into Livestreams Share more than just your gameplay. Share your gaming secrets, reactions and commentary with your viewers by integrating webcam &amp; microphone audio and video on top of your in-game footage, even when you’re streaming from a gaming console. You can also use chroma key to apply a custom background. Reduced System Footprint We understand that CPU and GPU processing power is vital for smooth gameplay and streaming. While other screen capturing solutions consume far too much of the precious processing power that gamers require, we’ve taken every step possible to ensure Screen Recorder minimizes CPU &amp; GPU load as much as possible for your gameplay. Record &amp; Edit with Ease Record &amp; edit content to provide your audience with videos that are detailed, high-quality, and informative. Record with Chroma Key Get creative when adding webcam footage to your screen recordings. Remove the background from your webcam footage thanks to a powerful chroma key engine, and replace it with your own cool, creative background image. Add Overlay Objects to Recordings Overlay objects to your desktop and webcam recordings. It's an easy way to brand your videos, promote a sponsor, or add a unique watermark to your recordings. Customizable Hotkey Support Get recordings started quicker, mute and unmute instantly, pause without having to touch your mouse, and quicklt take screenshots by setting customized hotkeys for recording and streaming. Real-time Webcam &amp; Mic Preview Setup recordings faster with real-time webcam &amp; mic previews. See exactly what you'll look like before you hit record using the preview window, and quickly adjust resolution and settings. The microphone preview allows you to quickly adjust volume and preview audio levels. Record from PC or Connected Device Whether you’re a vlogger, gamer, or how-to expert, Screen Recorder will have you producing high-quality, detailed videos in next to no time. Record your whole screen, just a window, or lock to a specific app. For gamers, you can record gameplay from your PC even in exclusive mode, and also capture directly from your gaming console! Easy-to-use Editing Tools Don’t spend hours figuring out how to edit your footage. Screen Recorder comes with a remarkably simple editing interface that allows you to quickly import and trim your footage, add titles and transitions, and also now add two unique audio tracks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/978990/header.jpg?t=1543830144",
    "Price": 49.99,
    "Developers": "CyberLink",
    "Publishers": "Deep Silver",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/978990/ss_791511dd44f1af7163a12e0c2a063021a115f27b.1920x1080.jpg?t=1543830144,https://cdn.akamai.steamstatic.com/steam/apps/978990/ss_26b73374a4daaa1c10e5f026525348e3e386d588.1920x1080.jpg?t=1543830144,https://cdn.akamai.steamstatic.com/steam/apps/978990/ss_d282266c2a682107e7d44e024a2cddd04ad598d1.1920x1080.jpg?t=1543830144,https://cdn.akamai.steamstatic.com/steam/apps/978990/ss_2ffdbfe7235dbe153967bd88e54b10b3256c7092.1920x1080.jpg?t=1543830144,https://cdn.akamai.steamstatic.com/steam/apps/978990/ss_b1535f9e43a6e46cd64613a691237982b62a1914.1920x1080.jpg?t=1543830144,https://cdn.akamai.steamstatic.com/steam/apps/978990/ss_24194e6182d5737001b3fbfc61f62828907ee586.1920x1080.jpg?t=1543830144",
    "Slug": "cyberlink-screen-recorder-4-record-your-games-rpg-car-game-shooting-gameplay-game-recording-and-streaming-software",
    "Meta Title": "Cyberlink Screen Recorder 4  - Record your games, RPG, ca...",
    "Meta Description": "Looking for information on Cyberlink Screen Recorder 4  - Record your games, RPG, car game, shooting gameplay - Game Recording and Streaming Software? C...",
    "Alt Text Image": "Official header image for Cyberlink Screen Recorder 4  - Record your games, RPG, car game, shooting gameplay - Game Recording and Streaming Software game - Steam 978990",
    "Canonical URL": "https://gusku.site/game/cyberlink-screen-recorder-4-record-your-games-rpg-car-game-shooting-gameplay-game-recording-and-streaming-software",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyberlink Screen Recorder 4  - Record your games, RPG, car game, shooting gameplay - Game Recording and Streaming Software\", \"description\": \"Looking for information on Cyberlink Screen Recorder 4  - Record your games, RPG, car game, shooting gameplay - Game Recording and Streaming Software? C...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep Silver\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/978990/header.jpg?t=1543830144\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}