{
    "AppID": 616330,
    "Name": "埋葬 DIG A BOO",
    "Release date": "Jul 5, 2017",
    "About the game": "DIG-A-BOO is a roguelike game mainly focused on exploring and digging,by which you can uncover the whole story while discovering.This is also more than a normal AVG game which just for treasures or MF.You need to deal with 3 different races living underground and make decisions whether making friends with them or robing them.What’s more,you need to find out the ancient emperors’ real deaths between deceits and truthes.In order to improve your empathy,We charted and cast every characters,bosses and monsters.Hope you enjoy!GLHF! We are from a folk independent game team, using our spare time for the game programming. We stick with our independent game dream, paid so many efforts to finish our first game. And since it was the first time we made game, we came through a lot of difficulties and barriers. We love Roguelike, that why we choose this type. But playing games and programming games are totally different, we revised many times and show you the game ‘to be perfected’ which including various scripts, fighting plots and tasks. We expect you advices and comments, especially those with substantial contents giving us guidance for making a good game. We will take those advices in the future game programming, and customize, improve and complete this game according to your opinions. To show our sincerity, mainly of the scripts are dubbed by voice actors. These voice actors are really very good, though you may not follow them, but you can definitely feel our sincerity. By the way, we tried our best to find some translators familiar with foreign customs and folkways, but how it feels is up to you. 14 Seiyuus cast more than 1500 dialogues and 30000 words Game Languages: English, Japanese, Simplified Chinese, Traditional Chinese We hope we can make progress and you can enjoy you time. We have varities characters and intersting avatar things The words of white colour is to show the Animation effect The wors of yellow colour is to show the Function area The Prospect and the Medium shot can moves The explain of function: The tent: the place where is to make equipment and if u upgrade the tent, u guys can make more equipments. The equiment Drawing must be discovered Underground. The elder tree: when u guys dig underground, u can make co2, and the co2 can make the elder tree bear fruit(some eqip and some Item Tree root: the root can grow up by the co2 which is made by our Underground exploration, we can use the tree root go back to the ground Gravestone: show off the bosses which have been killed by us Safe box: can Store items .so we can use these item in next games Shovel：if u buy shovel, it can bring more benefits The entrance of underground:touch this to enter the under ground,game start! U have to dig down to discover things, everythings are produced random. And Proceed in an orderly way and step by step Catacomb have 15 Ways to play. There have 500 art pictures of Plot Over 100 random quests and Events There are over 100 kinds of Last words of Catacomb Over 9 bosses Over 27 Truths Over 50 equipments The number of Drops ，Scroll and skills are over 50 12 PETS Over 50 monsters And so on There are three races underground, and the lives and the deads are Enemy which,U kill or help each side can effect to the other side. Each race have their Script dialogues, voices ,art resources. 9 bosses are related to the three races. The content are related to three races U must pay attention to the relationship of three races. U can move mouse to discover the frog When u dig the monster u can fight with it,or find another way to avoide the fight. When u discover the landmark, it will show u the way to The tomb and even u can find the way to boss room.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/616330/header.jpg?t=1502800732",
    "Price": 9.99,
    "Developers": "bonefrog",
    "Publishers": "bonefrog",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_da60a1ac24dd782be3b6490dcef8f016426801b5.1920x1080.jpg?t=1502800732,https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_b73b05b332ce0ccf63f1b24ea36a05d22fe9a05f.1920x1080.jpg?t=1502800732,https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_3824f669a027db3206acdb6731bd43dc1e94eb96.1920x1080.jpg?t=1502800732,https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_29d1959d4c28e00cca0e43796521805a20ef153c.1920x1080.jpg?t=1502800732,https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_8c20927096d69f4d0ad15ba829fc297a7d8fe120.1920x1080.jpg?t=1502800732,https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_1dfeb18d70bb2716d2270ef3795cc2d139abd21a.1920x1080.jpg?t=1502800732,https://cdn.akamai.steamstatic.com/steam/apps/616330/ss_f619e2109e2decbffd79f39388421a07fc6ca3d7.1920x1080.jpg?t=1502800732",
    "Slug": "dig-a-boo",
    "Meta Title": "埋葬 DIG A BOO: Jul 5, 2017, bonefrog and Full Overview",
    "Meta Description": "Looking for information on 埋葬 DIG A BOO? Check out the release date (Jul 5, 2017), developer insights from bonefrog, and a complete game summary.",
    "Alt Text Image": "Official header image for 埋葬 DIG A BOO game - Steam 616330",
    "Canonical URL": "https://gusku.site/game/dig-a-boo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u57cb\\u846c DIG A BOO\", \"description\": \"Looking for information on \\u57cb\\u846c DIG A BOO? Check out the release date (Jul 5, 2017), developer insights from bonefrog, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"bonefrog\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"bonefrog\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/616330/header.jpg?t=1502800732\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}