{
    "AppID": 1488560,
    "Name": "Football Simulator",
    "Release date": "Jun 8, 2022",
    "About the game": "Football Simulator is a unique physics based football game where you can struggle through and break tackles for first downs, juggle tipped passes and make diving interceptions. You can also be the cinematographer and create your own videos using the replay system. In the RPG Season Mode you play as the coach of your team. Explore a huge sports complex. Collect new playbooks. Build your dream team with editable rosters and Fantasy Draft. Play RPG Season Mode with up to 3 friends local co-op (online coming soon). Play local multiplayer or online through Steam Input / Steam Home Streaming (TBD). Online multiplayer is in development. In-depth modding system for rosters, jerseys, teams, players and more. We want the football video game community on Discord to be heavily involved in the design and development of this game. Its an evergreen game. No yearly versions. Fully and easily moddable. PLANNED FEATURES: Online Multiplayer: Online Quick Match &amp; Exhibition. Auto-share of chosen game Mod. Performance: Performance optimizations for console launch. Physics based LOD system so you can walk through a physics based crowd smoothly. Art &amp; Animation: 10x the number of existing animations need to be added, including better hand animation. Better character models for sideline characters. More facial animations. Alternate jersey support. Interactive Cutscenes Cutscenes play throughout the game to highlight players, coaches and fans. For example: touchdown dances, high-fiving fans, dunking on the crossbar, the ambulance driving onto the field when there is an injury, a player's reaction when the coach benches him or he subs out from fatigue or an altercation with a fan. Between plays or during TV timeouts the player should be able to wander around the stadium, interact with fans and get into a Malice at the Palace type situation if they are Away and the crowd is rowdy. Online Leagues: Meet other players online to create and play in custom leagues where you play ranked matches to climb up the leaderboard and become an online season champion. Features include trades, injuries, a commissioner, team stats, player stats, a sports complex where you can hang out with other coaches in the league, exhibition matches and multiplayer practice mode. Bring your local co-op friends online with you. Enhanced RPG Mode: In RPG Mode you complete player quests and coach challenges to improve or boost your player’s stats and increase your team’s league value, making trades easier and ultimately making that dream team possible. As you play you unlock new quests to get access to new free agent talent, appear on Monday Morning QB TV shows and viral videos. Ultimately play to win the league championship. Then, in the off-season, negotiate contracts, do the off-season talk show circuit and get ready for the draft. Press conferences will be interactive. New Modes: Practice Mode. Challenges. Full-motion VR game mode (currently 50% complete). 22-Player Single Position Online Multiplayer. Fulfill your dream of being an athletic pulling Left Guard.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1488560/header.jpg?t=1657704688",
    "Price": 19.99,
    "Developers": "Refactor Games",
    "Publishers": "Refactor Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_ab76c1ad7478d21d4110c9b840e936a412741e55.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_a850b9ff152bea9c527a5c7a13ab0e276bd5b90c.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_d2c584432cfba5c6620512451af5bd8ab1b4960a.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_8d1496ccb4592b710ff01a61b2c1ac98e33ef71b.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_bea162bb2dbcda69aeed5893a568d9b0d9a89136.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_ef151d64535a2f2da34a863068684876ca216a92.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_d85ade1eac56b1f87874b0977c5700dc7c36a117.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_09e81fb1e26165abab8789317c4860fbaa8c2a38.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_68c726eb505fd7a556be3c00e18188e91630e8bd.1920x1080.jpg?t=1657704688,https://cdn.akamai.steamstatic.com/steam/apps/1488560/ss_9241a6ed536c861ee8aeebd27e464e9e75c0a39e.1920x1080.jpg?t=1657704688",
    "Slug": "football-simulator",
    "Meta Title": "Football Simulator: Jun 8, 2022, Refactor Games and Full ...",
    "Meta Description": "Looking for information on Football Simulator? Check out the release date (Jun 8, 2022), developer insights from Refactor Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Football Simulator game - Steam 1488560",
    "Canonical URL": "https://gusku.site/game/football-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Football Simulator\", \"description\": \"Looking for information on Football Simulator? Check out the release date (Jun 8, 2022), developer insights from Refactor Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Refactor Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Refactor Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1488560/header.jpg?t=1657704688\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}