{
    "AppID": 2013220,
    "Name": "绝世武林",
    "Release date": "Jun 24, 2022",
    "About the game": "★绝世武林客服★ 官方客服QQ：3468443840，添加客服QQ即可领取游戏大礼包和参加相应的线下活动 PS：添加时记得备注游戏名和角色名 《绝世武林》是一款以古风武侠为题材的角色扮演类手机网络游戏。在游戏中，玩家可以通过任务、副本、活动获取强力的装备、道具，以此来提升自己的战斗力，玩家通过擒贼平乱，拯救黎民百姓于水火；从而统一武林，还江湖一片盛世乾坤。《绝世武林》，用丰富多彩的特色玩法，精致细腻的完美画面为玩家完美还原真实的武林世界，从而培养了玩家乐观进取和团队协作的精神。 《绝世武林》以南宋末年为历史背景，虚构出一连串的江湖英雄与爱恨情仇。游戏主要讲述的是南宋末年，朝廷腐败昏庸，国家内忧外患，武林群龙无首。玩家扮演的主角与师妹襄儿师承隐世高人，学成之后，主角奉师命下山，与丐帮黄帮主、马长老汇合，以商量武林大会共抗外敌一事。 就在汇合的地点，主角与襄儿屡遭神秘人伏击，主角一路掩护襄儿，与神秘人周旋。就在此时，两人发现黄帮主倒在路上，人事不知。随后出现一个神秘人，将二人打伤。眼看神秘人举剑直指襄儿，主角气血攻心，走火入魔之下竟功力大增，最后还击败了神秘人。只是主角用功过渡，昏迷倒地。 主角再度清醒时已经遗忘了前事，一名自称公孙姑娘的女子救了你与襄儿；公孙姑娘是忘忧谷的谷主千金，她称，自己同时救起你与襄儿的；主角潜意识里面对襄儿有种熟悉的情感，隐隐觉得她是一个很熟悉的人。 主角前去探望襄儿，然而襄儿已经疯疯癫癫，并不能向主角提供什么有用的情报。公孙姑娘姑娘向主角表示出极大的诚意，甚至将坐骑送给你向你示好；为了让主角早日恢复武功与记忆，她希望你能够留在谷中历练一段时日；主角留在忘忧谷中，忘忧谷大方地请出门内高手与你过招，助你早日恢复功力。 随着主角现身江湖，江湖上也渐渐流传出主角背叛兄弟，忘恩负义的谣言；江湖中人对主角的态度也十分恶劣，甚至有公然出手教训他；主角一路上单挑了很多高手，终于让他找到一个了解实情的人，这个人是丐帮的弟子，指责主角出卖丐帮黄帮主，勾结忘忧谷，打击侠义大派丐帮。 为了查清楚前因后果，知道自己是被谁所害，主角带着襄儿决定前往雪岭——丐帮总坛；丐帮总坛之上，守卫森严，一路上大家表现出来都是指责主角出卖黄帮主，勾结忘忧谷；但是疯疯癫癫的郭襄、娇憨的灵童，则是在别人恶言相向的时候一路鼓励主角，坚信主角是一个正直、侠义的英雄好汉；最后，主角终于在雪岭之巅见到了现在丐帮的掌权者马长老；但是襄儿却是表现出极度的不安与恐惧，哭恼不休； 原来，黄帮主、马长老、主角是一同结义的好兄弟，马长老告诉主角，主角为了讨好忘忧谷的公孙姑娘，故意出卖黄帮主，马长老顾念往日旧情，不忍向你出手，只派出山庄的高手对你行刑；主角心觉有异，带着襄儿逃离雪岭。主角一路逃至枫林晚，目睹马长老嘱咐高手不惜一切代价要除掉自己。主角终于明白，自己之所以会失忆，襄儿疯癫，竹林埋伏，原来都是因为马长老！ 因为顾虑襄儿与灵宠，主角暗中藏匿自己的气息，决定将马长老的高手逐个击破；最后，你在枫林之中与马长老最后决战，马长老不敌，挟持襄儿要你投降。襄儿在恐慌之中终于恢复记忆，恢复记忆的襄儿证实了主角的猜测，而且襄儿还说出当日在竹林里面黄帮主遇害的事实。 主角从高手手中获得信件，信件之中记录黄帮主还在人世，只是被人囚禁在烈焰地宫的消息。主角遂带领众人前往烈焰地宫迎救黄帮主。 主角暗暗发誓：“……我一定要救出黄帮主，不止是为了洗清大家对我的怀疑，更是为了武林安宁，天下苍生！”武林新一轮的明争暗斗正悄然拉开帷幕…… 4、扮演角色 玩家将扮演江湖上成名的英雄，因为一次意外而卷入丐帮的明争暗斗之中。玩家也因此流浪江湖，结交武林英雄、绿林好汉，与众多红粉知己相遇相知，在经历一连串的阴谋、背叛、苦难之后，玩家凭着自己强大的信念与意志、平定中原内乱，打退外族敌兵，安邦定国，统一武林。 职业介绍 真武 近战高输出职业，拥有迅捷灵敏的移动能力和爆发力，是团队作战中的输出主力。剑圣是江湖上令人闻风丧胆的存在，他掌握高深卓绝的剑法，能用出神入化的剑术对敌人造成致命的伤害！剑一出鞘，势必荡尽敌寇。 真武的沉着冷静，让他在任何时候都能做出精确的分析，给敌人以致命一击。他不苟言笑，对自己和他人都十分严厉，但这种严厉是建立在自身武艺和才华的基础之上。 江湖百晓生惊艳于真武的绝世武艺，慨然为真武题字：三尺青峰，纵横天下。剑荡八荒，群魔辟易。 破天 近战坦克，拥有出众的防御能力，常在第一线吸引敌人的火力，为队友提供良好安全的输出环境。 破天凭借着一双长刀坚盾，身披铁甲在敌阵冲锋，即使身受重创依然不倒，拥有悍不畏死的精神，是敌人难以逾越的屏障。 豪爽、霸气的性情容易让人误会这是一个勇而无谋之辈。可无谋之人怎能乱世江湖中生存？他时常在笑，因为他胸中早已胜券在握。 江湖百晓生亲自为破天送上题字：狂刀饮血，力拔山河。铁壁铜墙，万夫莫敌。 5、游戏角色 （1）公孙姑娘 角色介绍： 忘忧谷少主，与独臂大侠有过一段旧缘，虽然隐居幽谷，但是心怀天下。 （2）黄帮主 角色介绍： 天下第一帮的丐帮帮主，虽是女流，但是武功高绝，为人任侠，江湖中人对其莫不敬佩有加。 （3）忘忧谷弟子 角色介绍： 本是浪迹江湖的年轻侠士，后来因为看不惯烟雨城武林纷争，干脆久居忘忧谷，苦练神功。 （4）鲁长老 角色介绍： 丐帮长老，为人忠厚老实、个性略有些顽固死板，但是对帮主忠心耿耿，是丐帮内威望最高的长老。 （5）马长老 角色介绍： 丐帮长老，为人野心勃勃，一直处心积虑谋夺帮主之位。 （6）蒙面人 角色介绍： 身份不明的神秘人，背后有一个势力极大的组织，一直阻止主角的行动。 （7）独臂大侠 角色介绍： 本是孤儿，后来被龙姑娘收留，学成一身武艺。 6、游戏主要场景 （1）桃花山庄 桃花山庄并非如传言那般遍植桃花，而是竹林遍野，清幽雅致。这是玩家在游戏里面会遇上的第一张地图。此场景视野开阔，只在两侧点缀竹林植被，另一侧有荷花池，静中有动。竹林的区域每一个都未口袋型的设计，主要为布置怪物与关卡设置而设计，暗示主角来到这片区域时，会遭遇危机。 （2）忘忧谷 忘忧谷的背景是一群世外高人退隐深谷之中，此地虽有萧瑟枫林，却丝毫不亚于繁花苍翠之美。这是玩家进入游戏后，接触的第二个场景。 （3）烟雨城 烟雨城是玩家经历的第三张游戏场景，以江南水乡为创作蓝本，营造出一个水色江南，烟柳画桥。烟雨城一角，两侧有荷花清池，十分清幽。烟雨城一角，此处有莺歌蝶舞，也有江湖恩怨，但是在危急的时候，NPC就会出现，挺身相助。 （4）凌霄峰 凌霄峰是玩家可以接触到的第四张场景，皑皑白雪，苍茫古道，壮志凌霄，尽在于此。凌霄峰视野开阔，供给玩家足够的活动范围，玩家可以在凌霄峰自由选择自己要进行的玩法与活动。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2013220/header.jpg?t=1656732731",
    "Price": 0.0,
    "Developers": "绝世武林",
    "Publishers": "绝世武林",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2013220/ss_a9fc195f45faa6de6f7837d25a15e9772e717df9.1920x1080.jpg?t=1656732731,https://cdn.akamai.steamstatic.com/steam/apps/2013220/ss_cdc91d0a9004474ee7a2f66106a58c60c282cfa5.1920x1080.jpg?t=1656732731,https://cdn.akamai.steamstatic.com/steam/apps/2013220/ss_3331c93c6fa7a68d24f35c59b4b7bfe87b192aad.1920x1080.jpg?t=1656732731,https://cdn.akamai.steamstatic.com/steam/apps/2013220/ss_0cbdafef420293b0b32deae5325eb3d52a24451c.1920x1080.jpg?t=1656732731,https://cdn.akamai.steamstatic.com/steam/apps/2013220/ss_5b23caf3ade3b7a43611226f8533688228f24477.1920x1080.jpg?t=1656732731",
    "Slug": "",
    "Meta Title": "绝世武林: Jun 24, 2022, 绝世武林 and Full Overview",
    "Meta Description": "Looking for information on 绝世武林? Check out the release date (Jun 24, 2022), developer insights from 绝世武林, and a complete game summary.",
    "Alt Text Image": "Official header image for 绝世武林 game - Steam 2013220",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7edd\\u4e16\\u6b66\\u6797\", \"description\": \"Looking for information on \\u7edd\\u4e16\\u6b66\\u6797? Check out the release date (Jun 24, 2022), developer insights from \\u7edd\\u4e16\\u6b66\\u6797, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7edd\\u4e16\\u6b66\\u6797\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7edd\\u4e16\\u6b66\\u6797\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2013220/header.jpg?t=1656732731\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}