{
    "AppID": 913060,
    "Name": "Jet Lancer",
    "Release date": "May 12, 2020",
    "About the game": "Jet Lancer is a high-velocity aerial combat shooter where you duel enemy aviators, hunt giant robots, and defy death at supersonic speeds. You are Ash Leguinn: badass pilot, highly paid mercenary, and flight-school drop out. Your day job is fine - the daily grind of dealing with Sky Pirates pays the bills - but nothing compares to the rush of demolishing a ninety-ton mechanical monstrosity at the speed of sound. And you’ll have your chance. As mechanized weapons converge on Root City, you’ll have to be at the top of your game to survive, and you’ll have to surpass your limits if you want to save the world. Be A Badass : Jet Lancer is easy to learn but hard to master. Precise and responsive controls make you feel like an ACE as you dodge and weave through enemy fire without even a scratch in the paint. Surpass your Limits in Ash’s Story : Make your way from rookie aviator to ACE pilot in a story-driven single player campaign containing 30 missions, 11 bosses, and only 1 chance to save the world. Aggressive New Game Plus : Go higher, further, and faster in Jet Lancer’s New Game Plus mode which features more relentless AI, new attack patterns, and some fancy new upgrades for the LANCE to provide a fresh experience. Choose From an Extensive Arsenal : Customizable loadout with 28 different guns, payloads, and flight components to let you dominate the skies in any way you’d like. Customize with Accessibility Options :We think everyone should have the opportunity to feel like an ACE pilot. To that end we’ve included anti-fatigue control toggles, adjustable dodge windows, an invincibility option, and the ability to disable screenshake and screen flashing. Talking Cat : There’s a talking cat! His name is Lem. And if that isn't enough we've got ARCADE MODE , Jet Lancer's take on a wave based score-attack mode! Unique, stacking upgrades : Make each run one-of-a-kind. The longer you survive, the more powerful you become. Multi-boss battles : Fight multiple bosses from the story mode at the same time. New Pilots : Three new pilots with unique jets and handling. Level Up : New Progressions system to unlock additional pilots and their jets New Weapon: Flamethrower : Immense repeatable damage at very close range. New Weapon Railgun : Instantaneous precision shots. New Weapon Coil Gun : Chain lightning between grouped enemies. You can also join our Discord to get news about the game and interact with the developers. Vladimir Fedyushkin is the designer of Jet Lancer and is also in charge of art and hacky code solutions. A string of random events in his life led him to game development as a career and he hasn't looked back. You can follow him on Twitter @WhyNotArtDump Nicolai is the code wizard in charge of making things move on the screen. He hits buttons and helps to make the game as fun as we envisioned in our minds. You can follow him on Twitter @NicolaiGD Fat Bard are the guitar-shredders behind Jet Lancer's soundtrack. A composition/sound design duo, they create memorable music and immersive audio for games. Jet Lancer is the debut game from Vladimir Feduyshkin and Nicolai Danielsen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/913060/header.jpg?t=1603124784",
    "Price": 14.99,
    "Developers": "Code Wakers",
    "Publishers": "Armor Games Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_42c09dcccc72618be01677e0c7034d093706721e.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_f5359c7c0a516b731e3bb3b38139f03380506cb6.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_fcef1fa1bbce3ebeb640b4a8d76f97b881942d9b.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_7e5509224a2bb6beb1b78ed5194aba1a635e03f5.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_3b62d2fde68bc84cc1e762ae6b4d0c0a142e3a70.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_59bf80b6a64b75d33aa2ad8c6d4ee70a32d7335f.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_b10a9e48ebf1a8344def8fc7462e6d37cc9ed05d.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_93ce3871e41c1a7302f9ca9dd19fb1be2034da3d.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_502736158207f4b39ed7a3780c62feed60eaaba8.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_8667be8efb151ece0650ff0cd7e9d4a2d0bfd231.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_2db13b11c74afda3988a93bb618c91172e95eb79.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_a92b43907e78927940dc0f71ca3fc64c321530bb.1920x1080.jpg?t=1603124784,https://cdn.akamai.steamstatic.com/steam/apps/913060/ss_f91ba3af19ad79311f791f91db53422e8fdf055a.1920x1080.jpg?t=1603124784",
    "Slug": "jet-lancer",
    "Meta Title": "Jet Lancer: May 12, 2020, Code Wakers and Full Overview",
    "Meta Description": "Looking for information on Jet Lancer? Check out the release date (May 12, 2020), developer insights from Code Wakers, and a complete game summary.",
    "Alt Text Image": "Official header image for Jet Lancer game - Steam 913060",
    "Canonical URL": "https://gusku.site/game/jet-lancer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jet Lancer\", \"description\": \"Looking for information on Jet Lancer? Check out the release date (May 12, 2020), developer insights from Code Wakers, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Code Wakers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Armor Games Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/913060/header.jpg?t=1603124784\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}