{
    "AppID": 1867740,
    "Name": "Like Dreamer",
    "Release date": "Jul 21, 2022",
    "About the game": "A pop and cute bullet-hell shooting game by Cosmo Dreamer 'Outside'. The game is based on the theme of 'bullet-hell SNS,' and players can dodge through a barrage of bullets in a variety of virtual spaces. Increase the number of likes and followers with your nice playing. Bulletstorms may seem difficult, but don't worry. The game is designed for beginners, while advanced players can play more actively. Bulletolk the popular bullet-hell social network. If you play a shooting game well you will get likes from other users. The user with the most likes and followers is called The user who has the most likes and followers is called 'Queen' and is very popular. However some of the girls were jealous of the queen and posted bad words and false accusations. This angered the queens and they fought back! She made them the target of a barrage! In no time at all they were in flames! Enemies attacked from all over the community! Who will win the fierce clash of the barrage? ・Vanilla Alice 　A geeky cosplayer who posts selfies in sexy cosplay. 　Loves kawaii and shooting games. 　She has a strong need for approval. ・Yuricocoa 　A cool high school girl who calls herself a black cat type. 　She is very confident in her appearance, but her problem is that she has a bad mouth. 　She has a strong desire for approval. ・UJAKO 　She is a bullet-playing girl with a genius streak who plays with Bulletolk's program with a little modification. 　She has personal feelings for Queen and has jumped into the fierce Bulletolk competition. 　She has a little bit of desire for approval. ・You can choose! My own style 　・You can choose from 3 different girls and customize your shots and bombs to your liking! ・Don't worry if you can't avoid it! 'Mental gauge' system for offense and defense 　・The more shots you fire and the more you accumulate the gauge, the higher your mental level. 　・When the mental level is up, even if the player is hit by a bullet, the shield is activated and the player takes no damage. 　・The mental level can be used to launch powerful bombs. ・Get the SNS going! 'Buzz gauge' system 　・The more likes and followers you have, the more buzz gauge you have. 　・When it reaches the maximum, 'Buzz Fever' will be activated for a short while. 　・When it reaches the maximum, 'Buzz Fever' is triggered for a short period of time. The number of likes you get is also greatly increased! ・'Stage select system' to move on to the next stage slowly... 　・When a stage is cleared, stages are released one after another, and the game can be resumed from the previous stage even after the game is over. ・Challenge your weakest point! 'Practice Mode' 　・In the practice mode, the starting point and parameters can be freely set. ・Three difficulty levels can be selected to match your skill level. If you show your skill, you can play in a more difficult mode. ・Traditional arcade-style 'Trial Mode' and 　 Extra modes such as 'Boss Rush,' in which players fight a series of bosses, are also included. ・When you fulfill the conditions, you can add illustrations to the gallery and earn achievements. 　・Will you be able to collect them all?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1867740/header.jpg?t=1658412045",
    "Price": 12.59,
    "Developers": "あうとさいど",
    "Publishers": "あうとさいど",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_2bba6eba65db74ee05a120f95af8d9a5bfb77908.1920x1080.jpg?t=1658412045,https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_9d04738a11e9010f8d7152bb3d1df89814ab84a9.1920x1080.jpg?t=1658412045,https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_645d1dfa9d47709c7cc7c57538d119af59af3141.1920x1080.jpg?t=1658412045,https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_9a59d54aa003290546f5ead8d81d9d548694fc57.1920x1080.jpg?t=1658412045,https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_0e573ce0f0e80b0d70c070feb96a36e8abb1565c.1920x1080.jpg?t=1658412045,https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_42cd977fa89bab98ca6c0ff898a9ea5e454ddaba.1920x1080.jpg?t=1658412045,https://cdn.akamai.steamstatic.com/steam/apps/1867740/ss_6e45997de50328c93ebc9e64b91a3df3afc687ea.1920x1080.jpg?t=1658412045",
    "Slug": "like-dreamer",
    "Meta Title": "Like Dreamer: Jul 21, 2022, あうとさいど and Full Overview",
    "Meta Description": "Looking for information on Like Dreamer? Check out the release date (Jul 21, 2022), developer insights from あうとさいど, and a complete game summary.",
    "Alt Text Image": "Official header image for Like Dreamer game - Steam 1867740",
    "Canonical URL": "https://gusku.site/game/like-dreamer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Like Dreamer\", \"description\": \"Looking for information on Like Dreamer? Check out the release date (Jul 21, 2022), developer insights from \\u3042\\u3046\\u3068\\u3055\\u3044\\u3069, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u3042\\u3046\\u3068\\u3055\\u3044\\u3069\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u3042\\u3046\\u3068\\u3055\\u3044\\u3069\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1867740/header.jpg?t=1658412045\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}