{
    "AppID": 864610,
    "Name": "Magic Realm: Online",
    "Release date": "Nov 22, 2019",
    "About the game": "Since the first watcher discovered his powers, Eternium was the one thing that gave our watchers strength to overcome everything and everybody that threatened our universe. Now, for the first time, Eternium itself is in great danger. For the first time watchers, a secret oath was broken and for the first time ever, someone that is not a watcher knows about Eternium, knows how to get there and is one power-hungry, malicious, cruel witch. Magic Realm: Online Is a co-op multiplayer objective defense game developed exclusively for VR. Idea was to create a fun epic world where players can experience different play styles through heroes system. Game is skilled-based which means, the more you play, the more fluent your gameplay is going to be. The Game is inspired by epic fantasy itself and tower defense games. It is an endless wave-based shooter that combines different game genres. Play on your own or online with up to 4 other people that can join anytime. The game scales based on the number of people playing which makes it easier to play the game the way it's meant to be played - in multiplayer. See how long you can hold out against the relentless invaders and compete for the top spot on the global leaderboard as waves get increasingly more difficult. Play as one of distinct characters with unique abilities: Wizard - master of elemental forces. Sunglasses included because casting shiny spells is bad for your eyes. Gunslinger - dual wielding gunner. Has a hidden passion for exploding things which he doesn't hide very well. Archer - master of bow and arrow. Firearms are overrated. Tinker - The Unstoppable War Machine. Every map represents one planet in Magic Realm Universe. Maps are created to give players a fun and fast gameplay, also an immersive experience of a fantasy world in Virtual reality. Each enemy presents a dangerous foe - some of them will attack you, some of them will wait for your attacks to turn them against you and some of them will increase the morale of other enemies and significantly speed up the pace. Others are visceral flyers that aren't interested in the objective as much they're interested in destroying you. Use our session-based upgrade system with unique upgrades for every character as a tool to destroy even more foes. You can decide if you want to upgrade only one skill to the point of destroying all enemies with it, or play tactically combining more skills and upgrades. In every session, you are collecting experience which can be used to upgrade your hero's skills. Every hero has 4 unique spells you can choose from, and every spell has its own 4 perks for an upgrade. In every session, besides experience points, the hero is gathering coins too. Coins are used in the in-game shop, where you can buy different items to enhance your gameplay. You can choose between potions, bombs or turrets which can help you defend the gate easily. Since the game is session-based, we introduced leaderboards where you can check your score with players all around the world. There are two different leaderboards, one for the singleplayer game, where you can check your personal standing in the world of Magic Realm, also a multiplayer one, where you can make it to the top with the help of your friends or with a random team you can find. You are starting a game as a Wizard, the most powerful hero in our Universe but also the hardest to master. There are 30+ achievements that can be unlocked, and every achievement has something locked behind it. The first few and easier ones will unlock new characters or maps. Also, most items in the shop and beautiful shiny shields are locked too. You need to achieve different tasks so you can unlock them and use them in your future gameplay. Join our Discord channel: Disclaimer: This game is not associated with any other fantasy movie, game or book. Any similarity is purely coincidental.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/864610/header.jpg?t=1574771284",
    "Price": 12.99,
    "Developers": "Software Wolf,ITC Studio",
    "Publishers": "Software Wolf",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_46d0725110ae5031eb12f59a0bcfffbf4b3f0771.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_f24c8cb84cc191f1d48dd1bba68838c7ca04ebf1.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_1a11cd770530f7003933766c6efe80854e27cdb7.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_aae3bf76f9651aa1281f03ddfe79f1372c93c1e2.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_fbf819f412821c1c14808d941369b3d9289ea27f.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_73ac9ff7970acb28807f0d6577b8c1dfa39754ac.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_bee10891db66ae50ea2f1b08b5dbcd33bf3de173.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_e3bab03da5cd553a8a95e79fa7368e46eb5a249e.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_e679e0762816cb4206b084845e8c2b7d6ff2bb9c.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_225c6b11bfa4ac38a2c480a1da19d2f72f9608e3.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_6a3aaed9ca091c69d792d64e9d243f5e7920f5dc.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_30a27a0c6fc0721b20d17a606e4439c5adcbd1b6.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_86e648fd2249457b37ddb92ae4c673926597aa1f.1920x1080.jpg?t=1574771284,https://cdn.akamai.steamstatic.com/steam/apps/864610/ss_187b1be9945b13e1590a63ac9d39b152074bb348.1920x1080.jpg?t=1574771284",
    "Slug": "magic-realm-online",
    "Meta Title": "Magic Realm: Online: Nov 22, 2019, Software Wolf,ITC Stud...",
    "Meta Description": "Looking for information on Magic Realm: Online? Check out the release date (Nov 22, 2019), developer insights from Software Wolf,ITC Studio, and a compl...",
    "Alt Text Image": "Official header image for Magic Realm: Online game - Steam 864610",
    "Canonical URL": "https://gusku.site/game/magic-realm-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magic Realm: Online\", \"description\": \"Looking for information on Magic Realm: Online? Check out the release date (Nov 22, 2019), developer insights from Software Wolf,ITC Studio, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Software Wolf,ITC Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Software Wolf\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/864610/header.jpg?t=1574771284\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}