{
    "AppID": 1251550,
    "Name": "NagiQ",
    "Release date": "Mar 5, 2020",
    "About the game": "NagiQ is a family-friendly word game. In NagiQ you think of English words and place them on a board, vertically or horizontally, trying to connect your words with some special, mystic letters already placed on the board. There are more than 100 levels grouped into 5 islands, and each island introduces variations to the basic gameplay: Mindia Island : For completing Mindia’s boards we only have to conquer all of the mystic letters already placed on the board. Vulcania Island : Vulcania’s boards contain bugs! Hopefully, not 'programming bugs,' but little creatures on cells of the board. We have to surround those bugs with letters, and also catch all of the mystic letters. Nuntel Island : These boards have a timer! Don't worry, though, as the timer fully restarts with each word you place on the board. Raspit Island : This island introduces an additional requirement, as any new word you place on the board will have to include orange tiles. Each time you play a new word on the board some of its letters will have their tiles colored orange. And your next words will have to include at least one of such letters in orange tiles. Partok Island : An island whose boards combine challenges from previous islands. Controls Type a word with your keyboard. If the word is accepted by the game's dictionary then use your mouse to place the word on free cells of the board. Your word can overlap cells which are already occupied by a letter, but only if letters match. You can also use your mouse to type your word with the on-screen keyboard, but using a real keyboard is much faster. Press the space bar to switch the orientation of your word (vertically or horizontally). Alternatively, do a right click with your mouse inside the board. Press the backspace key to delete the last letter of the word you're currently typing. Alternatively, do a right click with your mouse outside the board. Press the escape key to clear the word you're currently typing. Press the enter key to place a word on the board. Or simply do a left click on the board. The game has a little on screen keyboard which also has special buttons for some of these actions, such as changing the orientation of a word.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1251550/header.jpg?t=1583403943",
    "Price": 4.99,
    "Developers": "IKIGames",
    "Publishers": "IKIGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1251550/ss_98ef67e455f31d6af3ee45940b65e325d1fbaab2.1920x1080.jpg?t=1583403943,https://cdn.akamai.steamstatic.com/steam/apps/1251550/ss_e19f893a569fa7ef16a46092010dccd838b52fb2.1920x1080.jpg?t=1583403943,https://cdn.akamai.steamstatic.com/steam/apps/1251550/ss_aaa75c1c7cd6efd3792ffd81c06cdccdb7221426.1920x1080.jpg?t=1583403943,https://cdn.akamai.steamstatic.com/steam/apps/1251550/ss_6e053142a18948e1451f29e50eadc18f815ec60c.1920x1080.jpg?t=1583403943,https://cdn.akamai.steamstatic.com/steam/apps/1251550/ss_2e4a3e79c578076d532a514270495c030a1f4894.1920x1080.jpg?t=1583403943",
    "Slug": "nagiq",
    "Meta Title": "NagiQ: Mar 5, 2020, IKIGames and Full Overview",
    "Meta Description": "Looking for information on NagiQ? Check out the release date (Mar 5, 2020), developer insights from IKIGames, and a complete game summary.",
    "Alt Text Image": "Official header image for NagiQ game - Steam 1251550",
    "Canonical URL": "https://gusku.site/game/nagiq",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NagiQ\", \"description\": \"Looking for information on NagiQ? Check out the release date (Mar 5, 2020), developer insights from IKIGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"IKIGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IKIGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1251550/header.jpg?t=1583403943\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}