{
    "AppID": 348200,
    "Name": "Nimble Writer",
    "Release date": "Apr 21, 2015",
    "About the game": "Nimble Writer is a general-purpose tool for writing stories, be it short fiction stories or even complete novels or books. It focuses on being distraction-free, simple, and fully customizable. Principles We built Nimble Writer with a couple principles in mind to make it stand out as a primary application for authors: Writing without distractions or worrying about formatting. Stay more organized with many useful organizational features. Materials of reference (such as photos, drawings, scribbles of text, character information, and much more) are available at your fingertips. Don't have any limitations to the default array of features. This means full customization, with a fully customizable and scriptable interface. Turn off features you don't need, change the entire look and feel of your writing environment, and much more. If you are used to writing stories in applications such as Word or other regular office tools, you'll find that Nimble Writer will be able to help you organize bundles of stories and notes together much simpler and faster. In addition, Nimble Writer is able to import some of those old documents and convert them into the Nimble Writer format. Advantages over traditional software Traditional writing software such as Word, Open Office or Google Docs are made just for the purpose of writing, so they don't have anything that helps story writers manage their notes and reference material, and neither does it offer much customization. They don't have any kind of chapter management either. Nimble Writer has all of those things, making it a much more productive choice for story writing. Steam's advantages With Nimble Writer's presence on Steam we can use the power that Steam's platform brings us, such as Steam Cloud . This means that you will be able to save your stories and notes entirely on Steam's cloud servers, so that you can load up your stories on another computer as well, just as easy! Don't forget about Steam Workshop ! With the implementation of the Workshop, you'll be able to share interface themes and addons with the world, or just to customize the app with other people's addons! Share creativity!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/348200/header.jpg?t=1613668755",
    "Price": 9.99,
    "Developers": "Nimble Tools",
    "Publishers": "Nimble Tools",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_353eca5087b042514d954e8c813869a89bd61c7f.1920x1080.jpg?t=1613668755,https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_efa93324d32184b7da3e871af64ea202f455e976.1920x1080.jpg?t=1613668755,https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_90dfe9cd7aa3d6aa6072f2f755f5e6990e006f4c.1920x1080.jpg?t=1613668755,https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_6d96f2aba7287ce4941e853721ffbaabfd2aac3c.1920x1080.jpg?t=1613668755,https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_21cdb4def88dfd69d90c47855bc172ade03649f1.1920x1080.jpg?t=1613668755,https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_b7e649096413e0195dd045138b15009ee598774f.1920x1080.jpg?t=1613668755,https://cdn.akamai.steamstatic.com/steam/apps/348200/ss_b82a094895baa473b2dfe3d9cdab5b781ca83d9c.1920x1080.jpg?t=1613668755",
    "Slug": "nimble-writer",
    "Meta Title": "Nimble Writer: Apr 21, 2015, Nimble Tools and Full Overview",
    "Meta Description": "Looking for information on Nimble Writer? Check out the release date (Apr 21, 2015), developer insights from Nimble Tools, and a complete game summary.",
    "Alt Text Image": "Official header image for Nimble Writer game - Steam 348200",
    "Canonical URL": "https://gusku.site/game/nimble-writer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nimble Writer\", \"description\": \"Looking for information on Nimble Writer? Check out the release date (Apr 21, 2015), developer insights from Nimble Tools, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nimble Tools\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nimble Tools\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/348200/header.jpg?t=1613668755\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}