{
    "AppID": 1554850,
    "Name": "One Try Tower",
    "Release date": "Jun 7, 2021",
    "About the game": "One Try Tower is a reaction-based roguelike horror sidescroller. You'll find yourself in a tower consisting of three different locations each of which will have two parts. Locations could be described as library prison and warehouse. Each part is thirteen floors, seven of which are on the inside and six of which are on the balconies. At the beggining of each part, except for the first one, you'll find an altar restoring HP and serving as a checkpoint. There will also be a unique boss at the end of each part. You could hear it when you get to the altar of the corresponding part. There will be eighteen playable characters. Besides having unique stats and weapons they'll have different corresponding animals and colors. As an example the first character you'll be able to play is will have rhino as his animal, blue as his color, average stats and a spear symbolizing the horn of the animal and its way of fighting. As one of the main features each character will have their own unique helmet. The thing is, all enemies and obstacles can be divided as coming from the bottom, the middle or the top. Each helmet has its own design allowing the user to see different obstacles. Each eye has nine corresponding squares, part of which will be open or closed. Coming back to the rhino: as every other hero he has the main square open, besides it he has a square allowing him to see his back and the back of the middle enemies. He has no open squares which would allow to see him traps on the top but he has a bottom middle square open which allows him not only to see the traps at the bottom but to get an idea of which top traps are coming on the floor below him since all of them are attached to the celling. The first version of the game will feature the first tower with three playable heroes. There will be five updates during 2021, each of which will add a new tower and a pack of playable characters. Towers are only different in the sense of time. The tower, where the new characters will begin their descent is the same tower but older. So since in the first tower the characters defeated a boss, this boss won't appear in the next tower. The enemies in the tower will change accordingly to the amount of time passed between each trio of characters. Trios will always consist of the standard balanced hero, the hardcore hero and the last will be the most difficult one with a unique game mechanic. You'll always start as the balanced hero. To open the other heroes you'll have to beat the game by the previous hero. I think that this amount of information is more than enough for now. Thank you for watching.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1554850/header.jpg?t=1623262158",
    "Price": 0.99,
    "Developers": "Bilzivar",
    "Publishers": "The Overall Angle",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_e2622c2d014f2f6ab48d83be7c7a49af2ad0d96b.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_cb7a534916f8757d9c276c945308cbdbc107ecb2.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_0d7b2bf0d45a5bfa415f60c09571638e18f5d38b.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_1300f9ca6f5e9decbbb12f080da38c38b402d36c.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_32cd228a9bbdb563ef8ac78bf12f42627499c154.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_b16e4190ad105d5b9aea1af63c8217515c716574.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_abde312099c5a710e2d3c4d6a8cf1913bad02221.1920x1080.jpg?t=1623262158,https://cdn.akamai.steamstatic.com/steam/apps/1554850/ss_33badaf9fd6007669bac4c0f8d1abd08c2e957a9.1920x1080.jpg?t=1623262158",
    "Slug": "one-try-tower",
    "Meta Title": "One Try Tower: Jun 7, 2021, Bilzivar and Full Overview",
    "Meta Description": "Looking for information on One Try Tower? Check out the release date (Jun 7, 2021), developer insights from Bilzivar, and a complete game summary.",
    "Alt Text Image": "Official header image for One Try Tower game - Steam 1554850",
    "Canonical URL": "https://gusku.site/game/one-try-tower",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"One Try Tower\", \"description\": \"Looking for information on One Try Tower? Check out the release date (Jun 7, 2021), developer insights from Bilzivar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bilzivar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Overall Angle\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1554850/header.jpg?t=1623262158\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}