{
    "AppID": 1338410,
    "Name": "Para Bellum",
    "Release date": "Oct 23, 2020",
    "About the game": "Para Bellum — is a real-time strategy puzzle game that will require a high level of microcontrol from you. The action takes place in an original fantasy universe in which you have to take control of the fate of an entire continent. During the story campaign, you will take one castle after another by storm, step by step freeing your patrimony from the power of the vile but powerful empire of Denatar. Para Bellum is an unusual RTS that uses original mechanics for the genre. You are the first ruler to unite the scattered kingdoms of western Kiltmer under your rule in order to effectively counter the threat of the elven empire of Denatar. However, the Emperor of the Elves and the most vile of his vassals managed to outwit you: your army was weakened, your brother was killed, and you managed to escape only by a miracle, after a fierce battle for the capital. Many years have passed, and finally you have the opportunity to return what is yours by right, recapture every fortress of western Kiltmer and end the rule of the cunning elves! Having examined the sketch of the fortress walls from your scouts, having analyzed the enemy's defenses, you lined up your army in the correct formation, putting each troop in its place. All troops have special abilities and their own specialization. It is necessary to correctly combine units with their abilities to overcome the enemy's defense. However, it doesn't end there! You have to personally lead the assault, opening up the potential of each troop on each of the five attacking lines simultaneously. Cover defenseless soldiers with shields, dodge the devastating shots of enemy ballistae, counteract the attacks of the besieged, light torches in the darkness and In the end, break through the gates of the coveted castle with successive blows of your rams! The game sets certain conditions at the stage of army formation. You are free to choose the troops and their formation by yourself. To line up a turtle bristling with shields so that no enemy arrow reaches the target, or opposite, to shower the defenders with heavy fire of their own arrows, so that they are afraid to even look towards your impending army - the choice is yours! Most importantly, do not forget that to counter the enemy's defenses on each of the attacking lines, you need to select the appropriate units in your own army. Para Bellum is characterized by high dynamics of what is happening, any mistake or delay can cost you dearly. You will need to collect a unique army, to successfully complete the level. This feature turns the preparatory assault phase into a puzzle. There are three sets of challenges for each level, differing in their complexity. Maximum difficulty will require you to concentrate and use all units competently. The army formation depends on your playing style. Many interesting and varied squads and mini-games associated with them. Colorful locations and formidable fortresses.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1338410/header.jpg?t=1603459228",
    "Price": 7.99,
    "Developers": "NullCloneGames",
    "Publishers": "NullCloneGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_1cc1210e5dd4aae5ec8f2bc8c24577db59850200.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_eb8adb26b7226e4ccd020affa7f99bd291538c54.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_569794b34dc7794312a192a7bc565435c18d08ce.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_05b6676d874fbd488fd6911c15ce7e1bafe38e8a.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_e9ce8522598159dbbdc789201a57ee5969f65b18.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_4ea3f08105ed94620b1608f76e266cf185951b53.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_127e0698aeb71c48911b6bf443fcca05db52e5eb.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_cef4ae17dd989cb8c373c5684f98f20b34513e77.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_75bd08be7d1c81756b56030a34b4cbda9456a15f.1920x1080.jpg?t=1603459228,https://cdn.akamai.steamstatic.com/steam/apps/1338410/ss_711c946de4e77c385b80b88dd63ff48b7f176e06.1920x1080.jpg?t=1603459228",
    "Slug": "para-bellum",
    "Meta Title": "Para Bellum: Oct 23, 2020, NullCloneGames and Full Overview",
    "Meta Description": "Looking for information on Para Bellum? Check out the release date (Oct 23, 2020), developer insights from NullCloneGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Para Bellum game - Steam 1338410",
    "Canonical URL": "https://gusku.site/game/para-bellum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Para Bellum\", \"description\": \"Looking for information on Para Bellum? Check out the release date (Oct 23, 2020), developer insights from NullCloneGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"NullCloneGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NullCloneGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1338410/header.jpg?t=1603459228\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}