{
    "AppID": 1186640,
    "Name": "Pumpkin Jack",
    "Release date": "Oct 23, 2020",
    "About the game": "Pumpkin Jack is a spooky scary 3D platformer in which you embody Jack, the Mythical Pumpkin Lord! Dive into an epic adventure through otherworldly landscapes and help the Evil annihilate the Good! Colorful Cartoon Setting: Travel through lurid landscapes in levels featuring alluring atmospheres, each crafted with vibrant color palettes, and high-quality lighting effects Fight For Your Life: With challenging beasts lurking around every corner, players must master the art of combo attacks; dodging, and timing to survive dynamic real-time battles! Players must unlock weapons and choose wisely in order to strike down all who oppose them Don't Lose Your Head: Solve puzzles that focus on physics; gravity, and reflection as Jack, or ditch the skinsuit and just use your flaming head to burn books; hammer some moles, create paths for magic spheres; and more as each level introduces new and exciting challenges Find Friends to Fight at Your Side: Helpful companions are there to assist Jack on his journey, including a haughty hooty owl to guide him along; and a snarky crow, itching to assist with long-range attacks Dive into an epic adventure and help the Evil annihilate the Good! Follow the will of the Devil himself and slay your nemesis in an epic quest that will take you on a journey in the Arc En Ciel Kingdom, a mythical realm shattered by the curse. You will meet friends along the way, from a haughty owl to a snarky crow! Discover Stunning atmospheres in a Colorful yet Spooky Scary Kingdom Travel through epic and dramatic settings, with each level having its own eerie atmosphere. Using a vibrant palette and high quality lighting effects, Pumpkin Jack invents its own unique cartoon universe inspired by the classic PS2 graphic style. Jump, Run &amp; Climb to carve your own way in Unique Levels Pumpkin Jack is a classic 3D Platformer before anything else! Every level will challenge you through several themed platforms, all giving you new trials to complete. Fight for your life against Evil Beasts by using awesome Unlockable Weapons You will have to master the arts of dodging, timing and movement to vanquish Jack's foes. During the dynamic real time battles, choose which weapon you want to use and strike at the critical moment! Face Breathtaking Challenges and discover tons of Original Gameplays Solve puzzles that focus on physics, gravity and reflection. Inhabit a pumpkin head and burn books, hammer some moles, create a path for magic spheres… But also more! In each level, you will be faced with an action sequence using a new exclusive gameplay!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1186640/header.jpg?t=1645200442",
    "Price": 11.99,
    "Developers": "Nicolas Meyssonnier",
    "Publishers": "Headup,Beep Japan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_dab3ac623119d1ea5d29d40c52cdacbe3b34cba5.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_4745f3354893cbc1977f652250adc50bbbb53272.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_135333cd5edb17ed08117173573905528c8e6d5c.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_90cf5254b15368e8ea6b6f071e7e0afdc451b412.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_ae410e19a17bcba49fe07188132a98e1ba464093.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_ed285dd77e6639f44485095fa1456f36390c3ab9.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_1741fc963a4e02ba97dd79a2559a34f1a5f1ea4b.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_78ae857537543dd7de0e733de57a1301dadd26c7.1920x1080.jpg?t=1645200442,https://cdn.akamai.steamstatic.com/steam/apps/1186640/ss_6b74b39e7c3b8a1ce85886d9823b8c94edc877b3.1920x1080.jpg?t=1645200442",
    "Slug": "pumpkin-jack",
    "Meta Title": "Pumpkin Jack: Oct 23, 2020, Nicolas Meyssonnier and Full ...",
    "Meta Description": "Looking for information on Pumpkin Jack? Check out the release date (Oct 23, 2020), developer insights from Nicolas Meyssonnier, and a complete game sum...",
    "Alt Text Image": "Official header image for Pumpkin Jack game - Steam 1186640",
    "Canonical URL": "https://gusku.site/game/pumpkin-jack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pumpkin Jack\", \"description\": \"Looking for information on Pumpkin Jack? Check out the release date (Oct 23, 2020), developer insights from Nicolas Meyssonnier, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nicolas Meyssonnier\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup,Beep Japan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1186640/header.jpg?t=1645200442\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}