{
    "AppID": 576120,
    "Name": "Purgatory II",
    "Release date": "Feb 28, 2018",
    "About the game": "Most stories end when the hero dies. Our story begins as General Xzus has a dagger plunged into his back. Command your mighty legions of hellish creatures! Fight your way through the real world and seek vengeance for those who have wronged you! Features: Complete challenges to harness the power of Spirit Points Play your way! You decide which creatures to hire for battle, each with their own unique skills and attributes! Buy and equip gear to increase your prowess on the battlefield! Fall prey to ambushes during battle! Hunt down treasure chests, avoid traps! Lay siege to mighty fortresses! Progress through the game in a journal-like fashion, defeating enemies as they come! Original story written by RPG enthusiast Ross Tunney, of the Data Hacker series. LOTS of reading! Awesome hand-drawn pixel art and frame-by-frame animation About the Game In this game, you control ex-General Xzus as he breaks free of the hellish Purgatory, dark ghouls and skeletons in tow, in order to exact revenge on those who have wronged him in life. He also wishes to find and protect his daughter Lucile. You use Purgatory as your base, where you can improve stats, complete challenges and hire new creatures to your cause, ready for the challenge that lies ahead in the land of the living. This takes the form of a map, with each point providing a new journal entry and battle challenge. Many of these battles include hidden surprises such as ambushes and treasure chests, in order to add additional levels of enjoyment to the title. Reviews of the original Purgatory on Steam: [NOT] 'Love this game! I just want to play it all day. Awesome music and sounds too.' Bechstein 'Another tactical RPG like Fire Emblem or Overfall; this time in a grungy, impressionist pixel art aesthetic that pits your undead army against another undead army. Plenty of reading, story and customization. The troops' skill trees are quite easy to follow, and it's all alright now.' Youtube - Tkillaah 'Think strategic, Make smart moves so you can build a big army, it got a lot of levels, This is def not a bad game, and if you like monsters then you shouldn't doubt getting this even without discount' Our Story: The Purgatory series is a labour of love. I've always been a fan of fantasy strategy games like Age of Wonders and HoMM (and more recently Fire Emblem). I love to write for the interactive medium that is video games, and Xzus' story (some of you may recognise from my Data Hacker RPG series) is one that I really wanted to expand upon. I really hope you like what we're doing here. From my own time testing and tweaking the game, I think it's shaping up to be something really awesome.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/576120/header.jpg?t=1519828443",
    "Price": 1.99,
    "Developers": "New Reality Games,Eduard Mirica",
    "Publishers": "New Reality Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/576120/ss_8e85be286c7f1fefac5c9809b1a4d1b508e7afe4.1920x1080.jpg?t=1519828443,https://cdn.akamai.steamstatic.com/steam/apps/576120/ss_b677c5d145998ba923c498537da8abb2aac20e6e.1920x1080.jpg?t=1519828443,https://cdn.akamai.steamstatic.com/steam/apps/576120/ss_93176be6129a95202870360c9da7b4296a69366b.1920x1080.jpg?t=1519828443,https://cdn.akamai.steamstatic.com/steam/apps/576120/ss_f7596bf96c854b8a07eba0a381469d1ff6426343.1920x1080.jpg?t=1519828443,https://cdn.akamai.steamstatic.com/steam/apps/576120/ss_61dd4c77e10380bfadc5efd3ee46198d3b1b34bd.1920x1080.jpg?t=1519828443,https://cdn.akamai.steamstatic.com/steam/apps/576120/ss_5b301a0e94a75f046787e1fff8c602c40525754a.1920x1080.jpg?t=1519828443",
    "Slug": "purgatory-ii",
    "Meta Title": "Purgatory II: Feb 28, 2018, New Reality Games,Eduard Miri...",
    "Meta Description": "Looking for information on Purgatory II? Check out the release date (Feb 28, 2018), developer insights from New Reality Games,Eduard Mirica, and a compl...",
    "Alt Text Image": "Official header image for Purgatory II game - Steam 576120",
    "Canonical URL": "https://gusku.site/game/purgatory-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Purgatory II\", \"description\": \"Looking for information on Purgatory II? Check out the release date (Feb 28, 2018), developer insights from New Reality Games,Eduard Mirica, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"New Reality Games,Eduard Mirica\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"New Reality Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/576120/header.jpg?t=1519828443\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}