{
    "AppID": 697970,
    "Name": "Pyramaze: The Game",
    "Release date": "Sep 13, 2017",
    "About the game": "Pyramaze: The Game is a 2D hack and slash platformer. The Game was created to honor the great music from Pyramaze the Progressive-Power-Metal-Band. You can choose a character out of 5 bandmembers to fight your way through evil foes taken from the Pyramaze-Lore like Ghosts, Will-o'-the-wisp or the Phoenix. Play as Jacob to use his Guitar-Magic-Staff to summon Fire, Ice and Thunder or Teleport through the enemies Play as Jonah to use his Keytar-Blade to Strike and Slash through the enemy-hordes Play as Morten to use his Drumstick-Spear to fill the screen with mighty water attacks Play as Terje to use his Microphone-Hammer to create powerfull schockwaves Play as Toke to use his Guitar-Axe to burn the Evil with his Fire abilities. Move your character to the right of the screen and defeat as many enemies as you can to get Pyrapoints. If you reach the far right of a map you will transition to the next map. There are a total of 6 stages and 2 Bosses, every Stage gives you a timer of 300 seconds. You take to long? You lose! Your goal is to get the most Pyrapoints to be in the Top 10 Highscore-List. Every Time you die or defeat the final Boss you will be able to submit your Highscore to compare yourself with other players. It might be a good Idea to not just rush through the stages. Collect every Gold Coin, they will grant you a lot Pyrapoints. If your health is low search for the green Coins, they heal 1 Point of your healthbar. The Menu is controlled by mouse and Left-Click. We suggest you check out the 'How To Play' - Section in the Home-Menu. Controls for every Character: Movement - Arrow Key left or right to move and Arrow Key up to jump S - Shield Attack D - Anti Air Attack F - Forward Attack Special Controls for Jonah and Jacob: Teleport to the Left with 'W' and to the right with 'E' Special Controls for Toke and Terje: F - Forward Attack (Any Time without cooldown + usable in air) ___________________ This is the first version of the Game. The Game is and will always be free but we want to offer free support to improve the Game after Release. We are just 2 People who love Video Games and some good Metal. We wanted to give you a short Entertainment and a tough Challenge. Hope you like it and have fun :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/697970/header.jpg?t=1505326543",
    "Price": 0.0,
    "Developers": "Impawsible Games",
    "Publishers": "Impawsible Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/697970/ss_161029bfd176be08a698f96140f56e6fa45fd3a0.1920x1080.jpg?t=1505326543,https://cdn.akamai.steamstatic.com/steam/apps/697970/ss_98cc0c6a92cc239c5fd4d532879668ae909d3954.1920x1080.jpg?t=1505326543,https://cdn.akamai.steamstatic.com/steam/apps/697970/ss_0dcb0b30142479358f7126d5a2724d4f0921b3ee.1920x1080.jpg?t=1505326543,https://cdn.akamai.steamstatic.com/steam/apps/697970/ss_10204f93e7c2d4c98f54c26e5ce0eeedc175af0a.1920x1080.jpg?t=1505326543,https://cdn.akamai.steamstatic.com/steam/apps/697970/ss_815ab7cd3eb494fb772efad1a73f8e0effb8da57.1920x1080.jpg?t=1505326543",
    "Slug": "pyramaze-the-game",
    "Meta Title": "Pyramaze: The Game: Sep 13, 2017, Impawsible Games and Fu...",
    "Meta Description": "Looking for information on Pyramaze: The Game? Check out the release date (Sep 13, 2017), developer insights from Impawsible Games, and a complete game ...",
    "Alt Text Image": "Official header image for Pyramaze: The Game game - Steam 697970",
    "Canonical URL": "https://gusku.site/game/pyramaze-the-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pyramaze: The Game\", \"description\": \"Looking for information on Pyramaze: The Game? Check out the release date (Sep 13, 2017), developer insights from Impawsible Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Impawsible Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Impawsible Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/697970/header.jpg?t=1505326543\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}