{
    "AppID": 516430,
    "Name": "Ruin of the Reckless",
    "Release date": "Apr 26, 2017",
    "About the game": "'What's that music in the trailer', Why, it's the Ruin of the Reckless Theme song by SLIME GIRLS. Since the beginning of time, or maybe longer, this place has been here. It is a beacon of sorts, attracting the souls of those who both lived and died with recklessness in their hearts. Bound by some unknown force, these wayward spirits cannot leave. And so they remain… With time their souls will rot. They will fade away and they will be forgotten. But even here there is hope… a legend whispered among the ghosts and specters. That any spirit to reach the tower’s peak will be granted one wish… Ruin of the Reckless is a 2D action roguelike with a focus on fast-paced melee combat, speedy movement, and co-operative play. Capturing the feel of 16-bit classics while providing a major graphical update, Ruin of the Reckless ups the pace, adds challenge and randomness - and lets you play with your friends! (LOCAL co-op only) ---- FEATURES ---- Speed through the environment at lightning pace, crush giant hordes of enemies in melee-focused combat. Upgrade your weapons, find new equipment, level up your hero. Explore a detailed, mysterious, randomly-generated tower that changes with each ascent. Discover its purpose and you may see your one true wish granted... If you get that far. Accessible and easy to pick up and play, but ascending to the higher levels of the tower will take intense skill. Bring a friend for local co-op fast-paced fun. ---- MECHANICS ---- Weapons: Wield a variety of dangerous melee weapons, each one has benefits and drawbacks, and although some are better than others there is no 'best weapon' to fit every play style. Spellbooks: Ancient secrets lie within these tomes. Spellbooks contain a set spell and a set amount of charges - when your spellbook is out of charges, it's time to switch! All spellbooks can be charged for more powerful effects, but it will drain them faster. Alter your spell abilities with orbs gained by leveling up! Skill Orbs: Dangerous and fragile shards of knowledge. Consume them to permanently gain a new ability, or use them as powerful weapons to strike down your enemies. (Or maybe just mess up and have them blow up in your face instead.) Dashing: Every one knows that you can't dash without boots! Explore the tower to find all kinds of stylish boots to change your dashing capabilities. Dash longer and further, chain multiple dashes at a time, stun enemie as you strike them with your body... Or maybe you just want to fly right past hazards, it's all possible if you have the right boots! Cards: Complete special challenges to collect cards which you can keep between runs. Most cards have a benefit and a drawback, so choose carefully! Combine different cards to create your own custom rule set before your run starts, or just use them to alter rules you don't like; for example, turn friendly fire off with the 'Friends' card.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/516430/header.jpg?t=1630524437",
    "Price": 9.99,
    "Developers": "Faux-Operative Games",
    "Publishers": "Poppy Works",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_8a9b612ad975ffe8b4a42703be3350fc26d6dea5.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_c2531f66a1bc1f1705288f2eb9751b25acea2f92.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_35df0de588470b920408b7c1d964383f7e3b020c.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_e0bcb81c9e91f5f246e7a7de1939581131af290b.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_a47e893496bce1a513ed8c488758bf7c6a30a879.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_3890160e0e82ab5fd4cfb0402a133695d4365930.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_7ded393ff98764cbcf29f2d7403a9470e50f6333.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_3ec265ae55cd8ee082645708a6bbde9d6ff3168c.1920x1080.jpg?t=1630524437,https://cdn.akamai.steamstatic.com/steam/apps/516430/ss_802298e120be2aecb94572c253a139330acf4ec1.1920x1080.jpg?t=1630524437",
    "Slug": "ruin-of-the-reckless",
    "Meta Title": "Ruin of the Reckless: Apr 26, 2017, Faux-Operative Games ...",
    "Meta Description": "Looking for information on Ruin of the Reckless? Check out the release date (Apr 26, 2017), developer insights from Faux-Operative Games, and a complete...",
    "Alt Text Image": "Official header image for Ruin of the Reckless game - Steam 516430",
    "Canonical URL": "https://gusku.site/game/ruin-of-the-reckless",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ruin of the Reckless\", \"description\": \"Looking for information on Ruin of the Reckless? Check out the release date (Apr 26, 2017), developer insights from Faux-Operative Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Faux-Operative Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Poppy Works\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/516430/header.jpg?t=1630524437\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}