{
    "AppID": 445140,
    "Name": "Smell Of Death",
    "Release date": "Jul 4, 2016",
    "About the game": "Smell of Death is a Horror FPS virtual reality game includes action and horror items. The game consists of two game modes including Story and Survival. In Survival mode, you can compete with your friends and get the highest score. You will be the member of a team which is fighting with the mutants in the world that is captured by them. In the first episode of the game called Smell of Death EP1 Dark House, story starts in the mansion that is full of mutants and you are searching for a safe place for people who survived. Prepare your weapons ! Your deepest fears are waiting for you in the house filled with mutants. general story: I can't say that i have an information about where and how did it start but there is not much left from humanity.I know that there were only 182 people at last count.Since the world has changed we shut ourselves in the safe place. To stay alive we are growing plants.Most of the time we put ourselves in danger and try to supply our needs.We create our own team but we only have 2 doctors in our team Jeni and Sam.Dr. Jeni and Sam try to find the virus that cause humans to mutate.To find the cure for the virus Dr Jeni and Sam need to work on the first generation thoroughbred creatures.To work on them they need our help.We often go to the place,where the creatures are intense,to catch them.Even if we killed hundreds there are still thousands of them around us.I know that they are careful about research but they need more time to complete.Day by day the attack of the creatures getting more often and they become more intelligent.We have to kill as many creatures as possible and keep ourselves in safe until they find the cure. You know the rules and what to do.Don't make much noise it cause them to come more.Be careful and make sure that you are safe.One shot to head is enough to kill most of them.Hurry up, complete your mission and come back. Smell of Death - Episode 1: Dark House : Our safe house was invaded by creatures and we had to leave.But now we need a new safe place for our people.Dr. Sam suggested using the manor of former mayor.Firstly you should check it out and you have to make the manor safe for us. Time's running out. Hurry up, out is not safe for us. Survival: While you were trying to escape in old shelter, mutants stalemated you. Mutants are coming from everywhere.Try to stay alive until someone come and help you. Features: Be A Hero By Fighting With Scary Mutants Compete with your friends and opponents in survival mode Fight mutants with Baretta and Katana weaponry.Expand your guns with DLC packs Shot mutants head and slice their body with your sword. Dominate time with the bullet time effect. Break, explode and vandalize the objects Teleport anywhere you want and explore the mansion Search closets and drawers to find key ,magazines and items that will help you to stay alive. Feel the fight with realistic changing weapons and magazines Fight tooth and nail with 15 enemies and bosses which have different characteristics.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/445140/header.jpg?t=1498177915",
    "Price": 9.99,
    "Developers": "Alkame Games",
    "Publishers": "Alkame Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/445140/ss_254c587c9b9d9c05917a02fab32983b85aa84700.1920x1080.jpg?t=1498177915,https://cdn.akamai.steamstatic.com/steam/apps/445140/ss_0a9cfbb90a08c514afa55b03152f0a352a3ec122.1920x1080.jpg?t=1498177915,https://cdn.akamai.steamstatic.com/steam/apps/445140/ss_af3974c5f89be1cea88b855f73b7245368bad68f.1920x1080.jpg?t=1498177915,https://cdn.akamai.steamstatic.com/steam/apps/445140/ss_e0923cdc87db14859f69cef538c6ae6a7cda4089.1920x1080.jpg?t=1498177915,https://cdn.akamai.steamstatic.com/steam/apps/445140/ss_93fc70afa38209aad2598c56952f85de4065173b.1920x1080.jpg?t=1498177915,https://cdn.akamai.steamstatic.com/steam/apps/445140/ss_5c6ec234b3a9f53a54e6fd5099ccb213757f63e6.1920x1080.jpg?t=1498177915",
    "Slug": "smell-of-death",
    "Meta Title": "Smell Of Death: Jul 4, 2016, Alkame Games and Full Overview",
    "Meta Description": "Looking for information on Smell Of Death? Check out the release date (Jul 4, 2016), developer insights from Alkame Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Smell Of Death game - Steam 445140",
    "Canonical URL": "https://gusku.site/game/smell-of-death",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Smell Of Death\", \"description\": \"Looking for information on Smell Of Death? Check out the release date (Jul 4, 2016), developer insights from Alkame Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 4, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alkame Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alkame Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/445140/header.jpg?t=1498177915\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}