{
    "AppID": 529060,
    "Name": "Space Simulator",
    "Release date": "Feb 26, 2018",
    "About the game": "Space Simulator is a realistic space flight simulator game featuring high-quality models, hi-res textures, IBL shaders, and a full-scale Solar System running on a proprietary purpose-built (double-float precision) physics library to create a better, faster and more realistic space flight simulator. Gravitational forces, including moons and distant celestial bodies, orbit instabilities, resonances, etc. are calculated with utmost accuracy. The physics solver computes and predicts real n-body trajectories that vary in real time, allowing -for the first time- the player to design and fine-tune very complicated orbital maneuvers, eg, orbital slingshots, etc. With the dynamic loading textures and multi-threaded physics running on GPU cores, the game reaches at 50-60 fps on most PCs with modest RAM requirements. We are also implementing VR support for a fully immersive flight experience as well as support for all major joysticks and flight controllers. We intend to release the game for an introductory price for a limited time only. CONTENT Space Simulator features a mix of high quality Steam specific missions while also having a legacy mode with all the missions, models, etc of the mobile version included for the convenience of our mobile players. Steam Specific Missions : (Early Access) Chapter 1: The Apollo Days. Featuring a growing number incredibly detailed and realistic Apollo Program missions starting -at launch date- with Apollo 8 lunar orbit missions. In the following months, we will complete all relevant missions in the Apollo Program. Included also is the mobile version content with: • Project Apollo Space Simulator features the complete Apollo 11 program missions. Players can choose to play particular missions or the entire Apollo 11 program from beginning to end: launch the Saturn V from Cape Kennedy; perform Trans-Lunar Injection, transposition rotation and docking; land on the Moon; power through the lunar ascent and rendezvous; and finally return back to Earth with reentry and splashdown. • Space Transportation System Space Shuttle fans can also enjoy a wide selection of Space Shuttle missions: launch from Cape Kennedy; rendezvous and dock with the International Space Station; return to Earth with reentry and play the final landing in day and night scenarios. • Space Launch System Space Simulator also includes a number of contemporary spacecrafts, such as the SLS (Orion) .We also plan to include SpaceX vehicles in the near future. • Custom Free Roam Missions Space Simulator is a realistic simulator of the entire Solar System with all its planets and major moons. Players can also choose to play custom free roam scenarios with general purpose spaceships. GAMEPLAY All spacecraft cockpits will come with interactive multi-functional displays that provide information on every aspect of your flight data. We have orbit, surface, transfer, docking, flight, HSI and other display panels. For Apollo enthusiasts, we have fully emulated the Apollo Guidance Computer and DSKY running actual code from the 60’s. You can run and control the Apollo spacecrafts exactly as how the astronauts did during their flight. Ultimately, our aim is to create a realistic space simulator that is comprehensive yet easy to use and accessible to players at all levels with the most advanced graphics and rendering techniques. All planets in the game are modeled with hi-res NASA imagery. Selected planets such as the Earth, Moon and Mars have 3D surfaces modeled from NASA altitude data. We try to use original audio as much as possible for Apollo and Space Shuttle missions. SUMMARY Lift-off from the Kennedy Space Center; land on the Moon; enjoy the magnificent views of Earth from orbit; plan a trip to a faraway planet; practise your favorite orbital maneuvers ­doing gravitational slingshots, Hohmann transfer orbits; rendezvous and dock with the ISS; perfect your Space Shuttle landings or go to the edge of space and back with the hypersonic X-­15 space plane. The possibilities are endless and as unbounded as your wildest astronautic dreams!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/529060/header.jpg?t=1519645856",
    "Price": 9.99,
    "Developers": "Stuka Games Inc",
    "Publishers": "Brixton Dynamics Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_665c6ad28d72711548c18675d5f1f133587899e6.1920x1080.jpg?t=1519645856,https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_f5db1a6bcf10544ca689a946d632610d6eb4aa2b.1920x1080.jpg?t=1519645856,https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_e4c11039a2c25b52a24c3f5931cfc1941a9f0fa1.1920x1080.jpg?t=1519645856,https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_2a9e43e5e10334fb06276813973a12388f7d01e5.1920x1080.jpg?t=1519645856,https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_7e54867eefddce5a6d92f29ea35ffb352458a610.1920x1080.jpg?t=1519645856,https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_01a3ce2f98fc2d8954a394268ab34b2fe104e766.1920x1080.jpg?t=1519645856,https://cdn.akamai.steamstatic.com/steam/apps/529060/ss_72324a251d2e232077b019660ffd1ae69f81ccd5.1920x1080.jpg?t=1519645856",
    "Slug": "space-simulator",
    "Meta Title": "Space Simulator: Feb 26, 2018, Stuka Games Inc and Full O...",
    "Meta Description": "Looking for information on Space Simulator? Check out the release date (Feb 26, 2018), developer insights from Stuka Games Inc, and a complete game summ...",
    "Alt Text Image": "Official header image for Space Simulator game - Steam 529060",
    "Canonical URL": "https://gusku.site/game/space-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Simulator\", \"description\": \"Looking for information on Space Simulator? Check out the release date (Feb 26, 2018), developer insights from Stuka Games Inc, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stuka Games Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brixton Dynamics Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/529060/header.jpg?t=1519645856\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}