{
    "AppID": 1425110,
    "Name": "Space Empires I",
    "Release date": "Oct 8, 2020",
    "About the game": "Space Empires I is the first chapter of the Space Empires series. A classic galactic conquest and turn-based strategy video game where you are the leader of a race of intelligent beings building large spaceships for interplanetary and interstellar travel through warp points between star systems. You will meet extraterrestrial races while fighting for survival and conducting diplomacy signing treaties between empires, trade agreements to full-blown partnerships, and even create protectorates. In Space Empires, the player assumes the role of the single leader of a race of intelligent beings that has recently acquired the technology required to build large fully space-based ships for interplanetary and interstellar travel. Starting out with only a few possible hull sizes for their ships, on which they can place any number of components to essentially create a unique ship, the player can research new hull sizes and components to use with them, eventually being able to build ships ten times the size of his original hull size. The components available to the player can vary greatly, from ship bridges, long-range scanners and shield generators to emergency supply components that, when used, will be destroyed but will allow a ship to continue moving for a longer time, and of course, weapons of various kinds, boarding parties, cloaking devices right up to Dyson sphere construction material and star-destroying devices. The player can meet extraterrestrial races (which will inevitably happen as the player expands their realm) and conduct diplomacy with them. Treaties can be signed between two empires, varying from the basic trade agreement to full-blown partnerships and even protectorates. The player can also conduct intelligence operations, from simple information gathering missions, to ship bombs, to inciting rebellion on a planet. Interstellar travel in Space Empires is not faster-than-light drive based, but instead relies on anomalies called 'warp points', essentially wormholes between two star systems. Warp points are naturally occurring but a player can open and close these warp points if she or he has the appropriate technologies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1425110/header.jpg?t=1602186404",
    "Price": 1.99,
    "Developers": "Malfador Machinations",
    "Publishers": "Strategy First",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1425110/ss_0c6a6e14ac225816082a5a1c0db2eb97d7f02bd2.1920x1080.jpg?t=1602186404,https://cdn.akamai.steamstatic.com/steam/apps/1425110/ss_f589f593a09763fef1e709d17d783c37e64dfd75.1920x1080.jpg?t=1602186404,https://cdn.akamai.steamstatic.com/steam/apps/1425110/ss_c329228316a55bae19f32133eb7feb2c075d0f2d.1920x1080.jpg?t=1602186404,https://cdn.akamai.steamstatic.com/steam/apps/1425110/ss_67ae06607e85b5dc97fee1d6edc1ce9a659a707b.1920x1080.jpg?t=1602186404,https://cdn.akamai.steamstatic.com/steam/apps/1425110/ss_2ddfe2596d223270fda4765b8740e89380c6588d.1920x1080.jpg?t=1602186404",
    "Slug": "space-empires-i",
    "Meta Title": "Space Empires I: Oct 8, 2020, Malfador Machinations and F...",
    "Meta Description": "Looking for information on Space Empires I? Check out the release date (Oct 8, 2020), developer insights from Malfador Machinations, and a complete game...",
    "Alt Text Image": "Official header image for Space Empires I game - Steam 1425110",
    "Canonical URL": "https://gusku.site/game/space-empires-i",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Empires I\", \"description\": \"Looking for information on Space Empires I? Check out the release date (Oct 8, 2020), developer insights from Malfador Machinations, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Malfador Machinations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strategy First\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1425110/header.jpg?t=1602186404\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}