{
    "AppID": 1034140,
    "Name": "Subverse",
    "Release date": "Mar 26, 2021",
    "About the game": "Welcome to a new era in adult entertainment! Tired of crappy, low effort hentai games? Then enter the Subverse – an old school PC gaming experience developed from the ground up for the discerning adult by a team of filthy apex perverts. EXPLORE A WACKY NEW GALAXY Discover the Prodigium Galaxy – filled to the brim with original lore and thick, meaty content. Explore dozens of star systems and hundreds of planets to find all sorts of missions, anomalies and other interesting stuff like sexy bounty hunter squidgirls that relentlessly stalk you and your equally sexy crew of waifus. FIGHT IN SPACE OR PLANETSIDE Throw down in either SHMUP -style space missions dripping with retro nostalgia or take the thinking man’s approach and duke it out on the ground with dynamic turn-based combat . Mastering both modes will lead to glorious booty so you can upgrade your ship and troops. YOUR OWN SHIP The Mary Celeste not only holds the record for fastest sub-light delivery of weed in the galaxy but she’s also your base of operations. Visit your various stations like Engineering, the Hangar and the Locker room to upgrade your forces, or relax in leisure spots like the Bar and your Quarters. ROGUE’S GALLERY OF BADASS BABES There are no good girls in Subverse. Well, not until you train them, anyway. These are the baddest babes in the galaxy complete with exceptional combat potential and drop-dead gorgeous looks. Earn their loyalty and get some other exceptional benefits in the process. Like sex. UNWIND AFTER A HARD DAY It’s time for some fully animated StudioFOW-quality rewards! Experience a diverse array of scenes from F/F pairings F/M pairings F/whatever the FUCK that thing is pairings all animated by the same team that brought you such cinematic classics as “Bioshag Trinity” and “Mila Red Riding Hood” FEATURES LIST No Pay2Win, no Gacha, no Lootboxes and no daily logins. Get rewarded for winning, not for losing Spend your rewards on unlocking diverse sex scenes, including certain premium ones with the ability to control speed and the moment of climax An ensemble of waifus to join your crew, all fully voice-acted by an all-star cast of adult voiceover talent Powered by the latest Unreal Engine 4 tech, this is Studio FOW like you've never seen them before! Beautifully rendered babes and the trademark cinematic quality has been given the next-gen treatment Cutscenes and animated models drive the narrative forward Fight in space with high-octane SHMUP missions, or planetside with tactical turn based combat A pulsating 35+ track OST with chillstep, trap and synthwave tunes Upgrade your ship and waifu's combat abilities",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1034140/header.jpg?t=1617793402",
    "Price": 29.99,
    "Developers": "Studio FOW Interactive",
    "Publishers": "Streembit Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_718a728e2c06341a853ca83678b8d937b9f97ebd.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_13d81e923f97bbf45a3770e0132205d5c80eba21.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_a82bd5c962863bc62edf3f1a3798f417c7f865c6.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_b2e1430bd09fd7ba7dea7b3f5d08458aa0743642.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_20b67c8a17243564240f47252292c94e5070cc24.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_2a2021253970715a31981816c81e88895aac0e6d.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_827c1ac3ac11a83740ca2d0c9c1e4da5fe81f5c0.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_9ef5685ad82d3c14878c454ba2c027a6166956d2.1920x1080.jpg?t=1617793402,https://cdn.akamai.steamstatic.com/steam/apps/1034140/ss_c2fd4a4737be9d12ba9fbf60a09b3746bf43aa98.1920x1080.jpg?t=1617793402",
    "Slug": "subverse",
    "Meta Title": "Subverse: Mar 26, 2021, Studio FOW Interactive and Full O...",
    "Meta Description": "Looking for information on Subverse? Check out the release date (Mar 26, 2021), developer insights from Studio FOW Interactive, and a complete game summ...",
    "Alt Text Image": "Official header image for Subverse game - Steam 1034140",
    "Canonical URL": "https://gusku.site/game/subverse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Subverse\", \"description\": \"Looking for information on Subverse? Check out the release date (Mar 26, 2021), developer insights from Studio FOW Interactive, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio FOW Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Streembit Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1034140/header.jpg?t=1617793402\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}