{
    "AppID": 488350,
    "Name": "The Karters",
    "Release date": "Jun 7, 2018",
    "About the game": "The Karters is an arcade karting game, inspired by Crash Team Racing’s gameplay, dynamics, and overall design. Grab one of the killing weapons, compete and challenge your friends in a local or global multiplayer where only one can win. Pick one of the thrilling maps and try to find alternative routes to outsmart your rivals and get the gold! The Karters was originally released in 2018 but we've spent over three years to rebuild it and provide absolutely the best possible quality and awesome arcade kart racing experience on Steam. Get ready for the upcoming 2022 reboot ! Ready. Set. Go!!! We realize that a kart racing game has to have a lot of modes to ensure all types of players can enjoy our game to the fullest, that's why we have prepared some variations of what our players can expect when they start their karting experience. Take a look! Enjoyable Singleplayer The singleplayer experience is really important to us as we would love to bring back the times when the player had to go through each track, unlock its secrets or simply play a track and show your friends who has got the best time. Play through the Adventure and challenge your friends in the Arcade. Remember, if you are tired of getting hit by that pesky rocket you can race your friends in our Speed mode - only pure skill matters! Online Multiplayer Join the competitive online multiplayer. If you have what it takes, do not hesitate to show your skills to the entire world, but beware, you will be putting your drifting ability to the most difficult test! Can't get your friends to play locally? Invite them over and play to your heart's content. You got those buddies at your home? Play split-screen multiplayer online together! Split-screen/ Split-Screen Multiplayer Play with up to 6 of your friends in split-screen. The more the merrier; let the old-school couch party make a dramatic comeback as you race against your friends for that everlasting glory. We're bringing back those neighborhood rivalries so you can relive the nostalgia once again! Bring your friends and battle it out for old times sake! Various Game Modes There’s a lot to choose from, but keep in mind that all of our game modes are available in both singleplayer and multiplayer, even with split-screen multiplayer! Dodge toxic barrels, collect fuel, find hidden letters and even race with your friends in a relay race! A lot of game modes, so there’s definitely a lot to do in The Karters! 6 Unique Characters Allow us to present you our determined heroes of The Karters. All characters are playable, each with its very own voice and behavior. Each fueled by its own motivation to be the best kart racer there is, the competition can get pretty intense. It is true of what they say, the Karters roster is filled with characters possessing extraordinary driving skills, but the most important factor which is often overlooked is that each member is one of the most determined and competitive individuals on the entire Astoc Island. That's what the Gerbil Magazine states anyway. Complete a character’s story in the Adventure mode and you will unlock the golden skin in both singleplayer and multiplayer! 6 Exciting Maps The Astoc Island consists of regions with their very own ecosystems. The entire island features two enormous and dusty Kanyons (not a typo!), two wild Jungles of which one is more industrialized than the other and with two calm and pleasant Beaches to wrap things up (more tracks in the future!) Message from the Developers: As great fans of Crash Team Racing, we used to wonder what this game would look like in modern times. While browsing through various forums about CTR, it became clear to us that the community shares our desire for a more up-to-date karting game, especially the one that would support online multiplayer. In The Karters, we are trying to bridge the gap that CTR has left. We realize that Crash Team Racing is a legend that set the bar high. However, by putting a strong emphasis on the mechanics and marking the game with its unique style, we do hope The Karters will bring players lots of joy and pure fun. About the Developers: Pixel Edge Games is an indie studio from Poland, having a highly successful track record of mobile VR applications (Cmoar Cinema or Cmoar Rollercoaster) and Racket Fury: Table Tennis VR. We are now bringing our second game on the PC!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/488350/header.jpg?t=1641989639",
    "Price": 19.99,
    "Developers": "Pixel Edge Games",
    "Publishers": "Pixel Edge Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/488350/ss_a2a442bcafeeac1e74a52b7cee9b743fd86a8447.1920x1080.jpg?t=1641989639,https://cdn.akamai.steamstatic.com/steam/apps/488350/ss_9a22a9c89d808fde70ebd70136f20969ceb65fd2.1920x1080.jpg?t=1641989639,https://cdn.akamai.steamstatic.com/steam/apps/488350/ss_67e0683baf31e40fd0f0ec80d4580f5e33cfdf64.1920x1080.jpg?t=1641989639,https://cdn.akamai.steamstatic.com/steam/apps/488350/ss_319443b65056d6c5d35c69b7c8b99bcbd638e500.1920x1080.jpg?t=1641989639,https://cdn.akamai.steamstatic.com/steam/apps/488350/ss_9c377bda72d87183c9c4665afa32ad3c2b71f4d5.1920x1080.jpg?t=1641989639",
    "Slug": "the-karters",
    "Meta Title": "The Karters: Jun 7, 2018, Pixel Edge Games and Full Overview",
    "Meta Description": "Looking for information on The Karters? Check out the release date (Jun 7, 2018), developer insights from Pixel Edge Games, and a complete game summary.",
    "Alt Text Image": "Official header image for The Karters game - Steam 488350",
    "Canonical URL": "https://gusku.site/game/the-karters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Karters\", \"description\": \"Looking for information on The Karters? Check out the release date (Jun 7, 2018), developer insights from Pixel Edge Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pixel Edge Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Edge Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/488350/header.jpg?t=1641989639\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}