{
    "AppID": 676990,
    "Name": "The Stone",
    "Release date": "Aug 25, 2017",
    "About the game": "In this prosperous Galactic Federation Planet, local residents are reluctant to mingle with new comers. The reason is simple, because no one knows how long these new comers will stay here. And Jake is one of them. Fortunately, Aurora does not care about this. As the saying goes, lovers are the most stupid people. Jake does not know Aurora is the President Rod’s daughter until everyone around are discussing about their love relationship. Rod promised Jake, he would allow Aurora to marry this young man if he could succeeded in accomplishing “Silent Mission”. “Silent Mission” sends gene enhanced special agents of Galactic Federation to holy place “Star Tower”, which is created by ancient “Pioneers”. It is the code to bring back “the Stone”, the holy relic that controls spiritual world. Whoever controls “the Stone” shall control the spiritual world. However, human’s genes cannot enter the Star Tower to touch “the Stone”, even being conducted gene enhancement. The Silent Mission is a mission impossible for countless excellent special agents even by contributing their lives. Jake took this mission for an opportunity to being with Aurora in his life, but he did not realize this is a desperate game as well as the hidden conspiracy behind it. The real fight shall begin when Jake arrives at the “Star Tower”. Player holds the role of Jake as the game character, interacting with virtual characters face to face, freely exploring the vast fantasy world, executing fierce fighting mission. Player will experience the real emotion and life and death fight. All these experiences will make you being part of the game. Game Feature - Beyond imagination exploration. We have done very careful VR feature design in each game levels. You will be immersed in a fantasy world, being moved by experiencing the real virtual world. - Real emotion communication. We will use real identity and personality to shape game character, enhancing the sense of immersion. This will let you experience the mixed feeling as happened in real world. - Fierce and brutal fight. We will restore real FPS combat experience into the game as the development of story plot. All these fierce and brutal fight will contribute to your game experience, you even could have the out-of-body experience after death of game character. Cool weapons and gesture recognition skills. You will use gesture recognition skills to initialize shield system. Matching different weapons to fight against brutal enemies. In conclusion, we integrate movie story narrative, VR game style and RPG/FPS game design concept to represent a high quality movie style RPG game for you. In the subsequent game, we will offer challenger mode and more weapon and skills than before. We hope to have your support and valuable advices.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/676990/header.jpg?t=1504362002",
    "Price": 12.99,
    "Developers": "Bornteks Entertainment",
    "Publishers": "Bornteks Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/676990/ss_29f30acc3010d0800225cb3eeaaf3536ab7fa11c.1920x1080.jpg?t=1504362002,https://cdn.akamai.steamstatic.com/steam/apps/676990/ss_48e307823ef440c8eced9d0c462716c567b9b894.1920x1080.jpg?t=1504362002,https://cdn.akamai.steamstatic.com/steam/apps/676990/ss_71af8c0225b6f1c3ed5664175efe671643f0fcbe.1920x1080.jpg?t=1504362002,https://cdn.akamai.steamstatic.com/steam/apps/676990/ss_5e7147f3cfb5fcfbf1222986c14912f372cf0ca8.1920x1080.jpg?t=1504362002,https://cdn.akamai.steamstatic.com/steam/apps/676990/ss_f3a0fb9af3361cced647979394696dff514933c1.1920x1080.jpg?t=1504362002,https://cdn.akamai.steamstatic.com/steam/apps/676990/ss_0caa24bb9644fbdb7623717b211e5dcb55259ef7.1920x1080.jpg?t=1504362002",
    "Slug": "the-stone",
    "Meta Title": "The Stone: Aug 25, 2017, Bornteks Entertainment and Full ...",
    "Meta Description": "Looking for information on The Stone? Check out the release date (Aug 25, 2017), developer insights from Bornteks Entertainment, and a complete game sum...",
    "Alt Text Image": "Official header image for The Stone game - Steam 676990",
    "Canonical URL": "https://gusku.site/game/the-stone",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Stone\", \"description\": \"Looking for information on The Stone? Check out the release date (Aug 25, 2017), developer insights from Bornteks Entertainment, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bornteks Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bornteks Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/676990/header.jpg?t=1504362002\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}