{
    "AppID": 1826960,
    "Name": "Trip In Another World",
    "Release date": "Jun 16, 2022",
    "About the game": "Trip In Another World is a more casual strategy war game, it bid farewell to the endless confrontation between players in traditional strategy games! More emphasis on collaboration between players. The game integrates strategy warfare and card development gameplay, simulated business gameplay, team-dungeon gameplay, designed an urban construction model centered on prosperity and civilization, and innovated a 'private territory' that did not exist in previous strategy games. The new concept of 'safe collection'. At the same time, players can also send business travelers to freely communicate with each other across the continents, donate supplies, and prosper together and develop harmoniously! Exclusive territory, safe collection Facing a different world that is about to be destroyed, you, as the lord of the city, will become a candidate for the throne and have your own private territory. There you can collect, play wild, and defeat the bosses of monsters as much as you want, farm safely without being disturbed, focus on improving the construction of the capital, and create a new world of your own! Develop civilization and build homes The fire of civilization is endless. After canceling the concept of combat power in traditional strategy games, we introduced the concepts of civilization and prosperity. As the heir to the throne, force cannot determine everything. Therefore, rather than letting players fall into endless battles in the game and constantly pursuing combat effectiveness, we hope that players will help each other, spread civilization and develop cities, and build a prosperous new capital! Shuttle the mainland, free trade After canceling the traditional strategy game in which players grab resources by attacking each other’s cities, we have opened up the runner gameplay of mutual trade between mainlands, six regions, 30 specialties, multiple runner paths, and real-time updates. Trade information, random events. Maybe not every trade is smooth sailing, but risks and opportunities coexist, challenges and benefits coexist, maybe you are a business wizard in another world! Wasteland Experience, Relic Treasure Hunting Stopping in another world, exciting adventures are also indispensable! We have opened the Wasteland Palace that can challenge ourselves. At the same time, as your main city hall level increases, copies of the ruins of different difficulties will also be opened for you. Whether it's dangerous underground caves or desolate desert ruins, you can enjoy the fun of teamwork and multiplayer teamwork, and find lost treasures in danger! Hero development, territorial war Three races, massive heroes, legendary heroes with various characteristics, each hero has its own mission. They will accompany you all the way in your life in another world, and do their best to help you fight the enemies, fight against the monsters, and win the crown! 6 regions, 36 cities, and 36 legendary lords, this continent is full of wealth and opportunities, waiting for you to conquer!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1826960/header.jpg?t=1658485188",
    "Price": 0.0,
    "Developers": "Fantasy World",
    "Publishers": "Fantasy World",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1826960/ss_e0018fe6ef7564121041e6925c83b1852d650538.1920x1080.jpg?t=1658485188,https://cdn.akamai.steamstatic.com/steam/apps/1826960/ss_4c874e3df2d13c70df82ff2ffc1b5372d6a492c9.1920x1080.jpg?t=1658485188,https://cdn.akamai.steamstatic.com/steam/apps/1826960/ss_3176eb14f2a9d6d391f406453d3ed50c56de4c88.1920x1080.jpg?t=1658485188,https://cdn.akamai.steamstatic.com/steam/apps/1826960/ss_7c7573f4309c7ba56004793c261c3d324217f7ee.1920x1080.jpg?t=1658485188,https://cdn.akamai.steamstatic.com/steam/apps/1826960/ss_ef8460d6bb12d7d566fb663dff44e84493f6c53c.1920x1080.jpg?t=1658485188,https://cdn.akamai.steamstatic.com/steam/apps/1826960/ss_9c6cd12524be3fc1176cb6dd94787db47b7b5241.1920x1080.jpg?t=1658485188",
    "Slug": "trip-in-another-world",
    "Meta Title": "Trip In Another World: Jun 16, 2022, Fantasy World and Fu...",
    "Meta Description": "Looking for information on Trip In Another World? Check out the release date (Jun 16, 2022), developer insights from Fantasy World, and a complete game ...",
    "Alt Text Image": "Official header image for Trip In Another World game - Steam 1826960",
    "Canonical URL": "https://gusku.site/game/trip-in-another-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trip In Another World\", \"description\": \"Looking for information on Trip In Another World? Check out the release date (Jun 16, 2022), developer insights from Fantasy World, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fantasy World\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fantasy World\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1826960/header.jpg?t=1658485188\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}