{
    "AppID": 13230,
    "Name": "Unreal Tournament 2004: Editor's Choice Edition",
    "Release date": "Mar 17, 2004",
    "About the game": "Unreal Tournament 2004 is a multiplayer first person shooter that combines the kill-or-be-killed experience of gladiatorial combat with cutting-edge technology. Ten game modes - both team-based and 'every man for himself' -- provide even the most hardcore gamer with palm-sweating challenges through unbelievably detailed indoor arenas and vast outdoor environments. As the ultimate techno-gladiator of the future, players will take their fates into their hands, battling against up to 32 other players online in action-packed, frag-filled arenas. Assault Mode - Assault mode returns! Redesigned for UT2004, this fan-favorite mode sees teams face-off to defend and attack fortified bases, from fast-moving trains, barreling across an arid alien desert to a Skaarj mother ship, poised to attack the human home world. Onslaught Mode - Onslaught mode takes team combat to the next level! Opposing teams are pitted against each other to capture and hold strategic points in order to attack and destroy the enemy power core. Taking place in massive outdoor environments, here is where vehicular combat comes into its own. Flying and driving machines take combatants to the frontline and gigantic mobile battle stations serve as a platform from which to launch devastating attacks. Vehicles - Rev-up and ride out in an array of land-, air-, and space-based vehicles that play critical roles in a successful combat strategy in Assault and Onslaught. With vehicles ranging from single man fighters to five man behemoths, Unreal Tournament 2004 provides players with plenty of choices when shopping for a mechanized implement of destruction. Levels - More than 95 maps will be available immediately, including more than 45 brand new maps for all existing game play modes as well as new modes of play. Vast outdoor environments, deep space combat areas and tightly packed indoor techno-arenas are all waiting for the latest entrants to the Tournament. Weapons - The entire smorgasbord of frag-dealing weaponry from Unreal Tournament 2003 returns for the experienced player to wield masterfully against new contestants. Those armaments are joined by three new implements of doom: the Mine layer, which disperses spider-like bombs that chase and harass any enemy that comes within range; the anti vehicle rocket launcher, or AVRiL, which deals out a payload of massive rockets tuned to seek and destroy enemy mechanized units; the Grenade Launcher, which launches timed explosives that will bounce on the ground and stick to enemies and enemy vehicles, only to be triggered by the weapons altfire command; and, the return of the notorious Sniper Rifle from the original Unreal tournament, completely redesigned and upgraded to make heads roll. New Characters - Unreal Tournament 2004 introduces 32 new characters on four new teams: The human Thunder Crash, lead by Tournament hero, Malcolm; the Robotic Corrupt, lead by an upgraded Xan Kriegor; the Iron Skull, a team of merciless Skaarj warriors; and the Hellions -- wreckless human mercenaries and pirates who delight in the thrill of the kill. New Technology - Unreal Tournament not only brings new content for hardcore fans to relish, it also delivers a tremendous technology update over its predecessor, delivering a faster, slicker, deeper experience than ever before.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/13230/header.jpg?t=1572723581",
    "Price": 14.99,
    "Developers": "Epic Games, Inc.",
    "Publishers": "Epic Games, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003802.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003803.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003804.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003805.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003806.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003807.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003808.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003809.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003810.1920x1080.jpg?t=1572723581,https://cdn.akamai.steamstatic.com/steam/apps/13230/0000003811.1920x1080.jpg?t=1572723581",
    "Slug": "unreal-tournament-2004-editor-s-choice-edition",
    "Meta Title": "Unreal Tournament 2004: Editor's Choice Edition: Mar 17, ...",
    "Meta Description": "Looking for information on Unreal Tournament 2004: Editor's Choice Edition? Check out the release date (Mar 17, 2004), developer insights from Epic Game...",
    "Alt Text Image": "Official header image for Unreal Tournament 2004: Editor's Choice Edition game - Steam 13230",
    "Canonical URL": "https://gusku.site/game/unreal-tournament-2004-editor-s-choice-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unreal Tournament 2004: Editor's Choice Edition\", \"description\": \"Looking for information on Unreal Tournament 2004: Editor's Choice Edition? Check out the release date (Mar 17, 2004), developer insights from Epic Game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2004\", \"author\": {\"@type\": \"Organization\", \"name\": \"Epic Games, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Epic Games, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/13230/header.jpg?t=1572723581\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}