{
    "AppID": 944640,
    "Name": "Xenia's Ark",
    "Release date": "Aug 12, 2021",
    "About the game": "Xenia’s Ark -- a 4X strategy game that seamlessly blends planetary, star system, and galaxy maps into a comprehensive, compelling, and captivating experience. After fleeing their dying galaxy, the major empires of Ousia Omina seek to reestablish their once thriving peoples in a new and alien galaxy. After founding a new capital in a strange new world, the player must explore the rest of their recently adopted homeworld, star system, and galaxy. New resources, technology, and territory will need to be swiftly gained and defended by Mechs and Ships, as all the former empires of Ousia Omina seek to make a new home in the galaxy of Xenia. Includes: Planetary, Star System, and Galactic Maps Play across 3 map types, each procedurally generated for a unique experience in every playthrough. Six unique Empires to choose from From the science focused Phaedon to the militaristic Arkidoun and others, choose an empire that fits your playstyle or presents you with more of a challenge. Ark Customization Select which resources, units, modules, and leader you will start with on your new home planet. Research System Unlock new technologies to develop your cities, outfit your military, advance your empire, and expand your influence. Unit Customization for Mechs and Ships Outfit your military units with the latest weapons, shields, and utility, or tailor them for specific missions. Tactical Planetary and Star System Combat Use the environment to your advantage to set up ambushes, hide your numbers, and take out soft targets, both on planets and in space. Leader progression Hire leaders to govern cities or command military units, and invest in new traits to improve their effectiveness. Diplomacy Establish relations with other empires in order to trade maps, cooperate in research, sign treaties, give ultimatums, declare war, and more. Trade/Supply Route System Manage the distribution of resources throughout your empire and establish trade routes with other empires. Espionage Produce spies that can infiltrate foreign cities, sabotage resource gathering, siphon funds, keep a close eye on neighbors, protect domestic assets, and more. Story The Black Holes had been growing and moving toward each other for billions of years — long before life had evolved in the galaxy. The effects had been storied in lore as the blessings of the gods in the form of auroras that covered entire planets and dark omens by the strange disappearance of stars. But in the past couple of centuries, the effects of the gravitational waves (G-Waves) produced by the twin black holes had grown ever more destructive across the entire galaxy. Planets had their orbits altered to the point of making them uninhabitable, or even put on collision course with other planets. A representative from each empire in the galaxy was sent to meet on the home planet of the Phaedon Empire — an empire renown for science, prosperity, and peace. A century earlier, the very same hall had seen an end to the Great Chaos War that had engulfed the entire galaxy for nearly two centuries. Now it would host the empires as they sought a means of mutual survival as the entire galaxy is under imminent threat of destruction by foes they cannot fight. After many days of questions, ideas, and debate, the empires unanimously agreed to abandon the only galaxy they had called home and sojourn to places unknown in order that their empires may live on. It was estimated that the galaxy would be uninhabitable, if not outright destroyed, in no more than 50 years. The Phaedon had recently developed wormhole technology that would allow travel to the farthest stretches of the universe in a matter of moments. This new and untested technology would be the means by which the races would survive and live on elsewhere. The empires, united by this cause, diverted all resources to the development of the technology, scouting of the universe, and the building of the Great Arks that would transport the empires to their new foreign homes. The empires met again after new galaxies had been scouted. They debated, argued, wrangled, and finally settled on a new galaxy to reestablish their empires. An ancient Phaedon word for “hospitality” — generosity and courtesy shown to those who are far from home — was chosen as the name for their new home. It would be known as Xenia. You have been appointed leader of the Great Ark of your people. The day you have yearned for and dreaded is here as your Ark sets a heading for the wormhole. The fear and hope of your people weigh heavily on you as you consult the star charts and maps of the planets that await you on the other side. The Great Ark approaches the coordinates for staging before the launch through the wormhole, when a giant G-Wave hits your ship. Sensors detect at least another three or four in its wake. You have no choice but to launch now. The survival of the Empire and the legacy of your former galaxy are in your hands.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/944640/header.jpg?t=1628989329",
    "Price": 29.99,
    "Developers": "Malicious Games",
    "Publishers": "Malicious Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_a9a62170895cf63d866c9b95c825ddb1fc659241.1920x1080.jpg?t=1628989329,https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_70dfbf1f4d7d64f48d526888d1d0825010d2af4e.1920x1080.jpg?t=1628989329,https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_19a777247f72799b767c56a56af160d76738ce7d.1920x1080.jpg?t=1628989329,https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_6a7d5dc671cd72a463087290d6cd6f78b984a119.1920x1080.jpg?t=1628989329,https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_e8fd72ec5d7bbd77e1478ec0b62ff53f06c011c8.1920x1080.jpg?t=1628989329,https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_2761e639393b8aaa004684921c94a7c3fb7fbf3c.1920x1080.jpg?t=1628989329,https://cdn.akamai.steamstatic.com/steam/apps/944640/ss_215baa92f5c1f13e0d0a752b3732dd13795a6b12.1920x1080.jpg?t=1628989329",
    "Slug": "xenia-s-ark",
    "Meta Title": "Xenia's Ark: Aug 12, 2021, Malicious Games and Full Overview",
    "Meta Description": "Looking for information on Xenia's Ark? Check out the release date (Aug 12, 2021), developer insights from Malicious Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Xenia's Ark game - Steam 944640",
    "Canonical URL": "https://gusku.site/game/xenia-s-ark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Xenia's Ark\", \"description\": \"Looking for information on Xenia's Ark? Check out the release date (Aug 12, 2021), developer insights from Malicious Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Malicious Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Malicious Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/944640/header.jpg?t=1628989329\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}