{
    "AppID": 1419760,
    "Name": "Zombie's Cool",
    "Release date": "Dec 20, 2020",
    "About the game": "- Game Description Zombie's Cool is a growth-type shooting action game in which you have to mop up zombies that frequently pop up in town while searching for the root of the zombie virus. - Weapon System ■ Single Shot Pistol: You can use it limitlessly, but its firepower is weak. ■ Machine Gun: The damage dealt per bullet is low, but since its per-second firing speed is high, you can deal a lot of damage within a short time. ■ Shotgun: It has a short range, but it deals a lot of damage to multiple enemies. ■ Launcher: Along with an explosion, it inflicts physical damage on multiple enemies and also causes flame damage, which zombies can spread to each other. ■ Laser Gun: No matter what kind of enemy you're facing, they can be brought down with a single shot from this gun. You can only use it a single time during the game, though. ■ Double-handed Pistols: Shots that hit enemies irregularly bounce of to other areas. If you're lucky, you can bring down multiple foes with a single shot. ■ Gunkata: Fire double-handed pistols at random with a cool pose. Looks awesome, no matter how many times I see it! Gunkata can be used once per stage after it is opened. Most of the weapons can be upgraded. Once you upgrade, you'll experience how, while the beginning is a bit Souls-like, the end is pure Warriors! - Stage Types Just as there are many different weapons, there are also various stage types as well. ■ Normal Stage: All you have to do is wipe out enemies. It's the ideal type of stage for earning coins. Within the Normal Stage type, there's also the Nighttime Stage sub-type. At night, the zombies' attack power increases tremendously, and you have to fight them while relying only on the light you get when you fire off shots.' ■ Death Race Stage: Within a time limit, you have to exterminate zombies on the map with a zombie car. ■ Baseball Stage: You have to stop the zombies rushing to home with baseballs. ■ Barricade Stage: You have to stop the zombies trying to get through the barricade. ■ Escort Stage: You have to escort survivors to the escape point. ■ Big Escape Stage: You have to drive a tank to the escape point while defeating the enemies swarming upon you. ■ Boss Stage: Zombie's Cool features five bosses who possess varied patterns. You have to defeat these bosses if you want to progress further in the story. - Coins and Upgrades Once you upgrade your weapons' and the player's abilities, stages you once thought were difficult will be able to be cleared with ease. All upgrade elements within the game are carried out using coins. You can earn more and more coins the higher your combo chain number, which rises as you kill enemies, goes. Be careful though, the chain is broken if you are attacked by an enemy or if a set amount of time passes without you killing an enemy. That doesn't sound very easy, you say? Well then, maybe you should try replaying the previous stage a few times to collect some money then upgrade your weapons. If you do that, then at some point, you'll be able to enjoy the experience of having coins gush forth suddenly. Coins can solve anything in this game! Just be sure to remember to maintain your combo chain by not letting enemies attack you! - Multiple Round Elements So you've seen the first round ending? Then you should try the Normal and Hard difficulties too, where even stronger zombies and bosses are awaiting you. Thanks to diverse zombies risking life and death to fling themselves at you from an early phase, you'll be able to experience a different feeling then you did when you played the Easy difficulty. - Enemy Types There are also many different types of enemies. ■ Walker: Moving at a sluggish pace, it's ready to become a good source of coins for the player. ■ Rusher: Once it approaches a certain distance, it goes mad chasing after the player. ■ Smasher: It's not only great at taking blows, it's also got great attack power and mobility. ■ Eater: It's the slowest moving of all the zombie types, but also the strongest against attacks, so it will soak up all the bullets you throw at it like a sponge, leaving you with no ammo left. ■ Helldog: It's the weakest against attacks, but it leaps all over the place, making the player busy just keeping up with it. ■ Crawler: It crawls around on the ground while shooting out scary acidic spit, requiring a continuous exercise of judgment and control from the player. - Wait just a second... Did you just say you don't think you can handle playing, because of all the different enemies? This isn't the first time I'm telling you this, but when you feel like that, you should discuss things with some coins. Coins can solve any problem you'll run into in this game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1419760/header.jpg?t=1608528750",
    "Price": 3.99,
    "Developers": "Game Museum",
    "Publishers": "Game Museum",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_b8367089f2ce08242bf68792954644d9a10dd99f.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_5104cdb4bbad84111097c5dfdeeb0157a7a5db3b.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_18a982a8d8a8a0047f60fa03ed961be72ecbbe89.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_fa8b10f7ef27be69e8a2aa4469b3747b088e0e46.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_7974dff1632c85a91a598d81b2486548d6583b8b.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_a5baa4fa7e6739ce6415f652ae429cad83a46a1b.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_d1face1372835759267d4179a91dfecd095b218e.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_4f3697c7ea85cc7493ee1c47ae775454ff826321.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_2d07011842b05de405c0f679bfe1797f7dc79b5a.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_9f160ac100a3c8379bed1eec3581b7a14a4c00f3.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_096005a5570edf1b790d5245eb3c4588b920ada3.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_5c93fd84ccf7eddb7b9bc1cd670c12189dcee617.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_a89f1d75ed874097b4027738a118836214a81ec5.1920x1080.jpg?t=1608528750,https://cdn.akamai.steamstatic.com/steam/apps/1419760/ss_a50a2f42de690f24a94ba5e2fbc542f3a4339adc.1920x1080.jpg?t=1608528750",
    "Slug": "zombie-s-cool",
    "Meta Title": "Zombie's Cool: Dec 20, 2020, Game Museum and Full Overview",
    "Meta Description": "Looking for information on Zombie's Cool? Check out the release date (Dec 20, 2020), developer insights from Game Museum, and a complete game summary.",
    "Alt Text Image": "Official header image for Zombie's Cool game - Steam 1419760",
    "Canonical URL": "https://gusku.site/game/zombie-s-cool",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie's Cool\", \"description\": \"Looking for information on Zombie's Cool? Check out the release date (Dec 20, 2020), developer insights from Game Museum, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game Museum\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game Museum\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1419760/header.jpg?t=1608528750\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}