{
    "AppID": 537110,
    "Name": "Angels of Death",
    "Release date": "Dec 19, 2016",
    "About the game": "NOTE: This game was made using RPG Maker. Please note the following features. Normally, the F12 key is used to take screenshots with Steam Overlay. Please change the screenshot key settings to another key other than F12. Key functions: F12: Reset the game Toggle full-screen/window modes 'Please... kill me.' 'Help me get outta here, and I'll kill you.' This dark promise deepens the peculiar bond between two reluctant partners. Where is this place in which they’ve found themselves trapped? Why have they been imprisoned here? What does fate have in store for them? Thus begins a dangerous and terrifying escape mission from a mysterious sealed building! Angels of Death is a psychological horror-adventure game from the creator of Forest of Drizzling Rain (“Kirisame ga furu mori'). Consisting of four episodes and originally released by Den-fami Nico Game Magazine , Angels of Death is now available worldwide with full English localization! WARNING: Some material may be inappropriate for children. The original Japanese version was published as freeware, and the Steam version was released in order to help support the developers. Consists of four episodes, each containing a dark and thrilling story Unique storytelling style that complements and takes full advantage of the game's gorgeous 2D graphics Psychological horror featuring a fascinatingly demented serial killer Features a variety of missions, mixing genres such as 'shooting' and 'escape' themes Includes four games – each acting as a single episode of an overarching story – together in one package The psychological horror game Angels of Death follows the story of Ray and Zack as they attempt to escape the terrifying world in which they've somehow been entrapped. Where are they? What is going on? With so many unanswered questions and nobody else around (who isn't trying to kill them), the pair have no choice to trust each other and fight for their very lives. Ray awakens to find herself in a concrete room with no memory of how she may have gotten there. She leaves the room, exploring this mysterious, creepy environment in search of an exit. Eventually she crosses paths with Zack, a man carrying a large scythe. Fearing for her life, Ray runs from Zack and gets on an elevator, going up… Managing to evade danger for the time being, Ray and Zack make their way to Floor B3 - a modern-looking space with dazzling white walls. From the speaker in the ceiling, a woman's voice can be heard in the form of a bizarre, howling cackle. 'Come, wretched sinners. You shall know the agonizing pain demanded from the forgiven.' In an attempt to mock what she considers to be the weak fragility of the pair's 'promise', their deranged guard runs Ray and Zack through a gauntlet of sadistic tortures. Faced with almost certain death and forced to fight for their lives, will Ray and Zack manage to see their promise through? Dragging an unconscious Zack in tow, Ray presses on to Floor B2, finding herself inside a huge cathedral. The sound of a pipe organ fills the floor and a mysterious, sweet fragrance permeates the air of the hallway. Strange text appears on the walls, demanding that Ray repent for her sins. Yet Ray decides to keep pushing forward, determined to uphold her promise to Zack. Soon after, Ray encounters a 'priest' in the deepest depths of the cathedral, and is bewitched by the sweet fragrance emanating from his body... Arriving on Floor B1, Ray and Zack find themselves outside of what appears to be an average, ordinary house. However, they enter the living room to find it splattered with blood. Suddenly, Ray breaks down completely... 'Please, Zack! Kill me right here, right now! Before you find out too much!' With that, Ray loses consciousness. As utterly confused Zack stares at her, dumbfounded, he begins to hear the sound of knocking on the living room door... In order to learn more about Ray's past, Zack sets out to explore the strange house while avoiding the countless heinous traps set throughout. But he ends up finding much more than he bargained for... Will Ray and Zack be able to fulfill their promise to each other and escape the building alive? Official Site: / Traditional Chinese: 咲月漢化組 Korean: Nagi English: Ryan Stofer",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/537110/header.jpg?t=1606327789",
    "Price": 9.99,
    "Developers": "Vaka Game Magazine,Makoto Sanada",
    "Publishers": "Vaka Game Magazine,PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_d189770d087f099ad7139417bf191b2f5d6ca1e6.1920x1080.jpg?t=1606327789,https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_bcb529320b43e47dff47f9cded69ec0a0312c367.1920x1080.jpg?t=1606327789,https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_5c3ef7a8050fc142ea623210ef2654f9035d51f8.1920x1080.jpg?t=1606327789,https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_8af2c1afda0e4cf4ce6c48df43ba1e2f6f3d9ebb.1920x1080.jpg?t=1606327789,https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_fdcf28a63d77e1bab3e66baf6c1f701b432b0d4c.1920x1080.jpg?t=1606327789,https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_ec8ae384cff234d2155b4a2dc776fe7d6b99d73f.1920x1080.jpg?t=1606327789,https://cdn.akamai.steamstatic.com/steam/apps/537110/ss_a852b47e845d42e2ebbbbade70585ff9f34ab0f2.1920x1080.jpg?t=1606327789",
    "Slug": "angels-of-death",
    "Meta Title": "Angels of Death: Dec 19, 2016, Vaka Game Magazine,Makoto ...",
    "Meta Description": "Looking for information on Angels of Death? Check out the release date (Dec 19, 2016), developer insights from Vaka Game Magazine,Makoto Sanada, and a c...",
    "Alt Text Image": "Official header image for Angels of Death game - Steam 537110",
    "Canonical URL": "https://gusku.site/game/angels-of-death",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Angels of Death\", \"description\": \"Looking for information on Angels of Death? Check out the release date (Dec 19, 2016), developer insights from Vaka Game Magazine,Makoto Sanada, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vaka Game Magazine,Makoto Sanada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vaka Game Magazine,PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/537110/header.jpg?t=1606327789\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}