{
    "AppID": 1542890,
    "Name": "Angry Celt Warrior",
    "Release date": "Mar 12, 2021",
    "About the game": "Witness the battle for the New World, as Damon the Angry Celt Warrior, and Elizabeth Yomoda aka. Widowmaker and all their battle hardened friends take on the diabolical Dr. Janet Anita, her evil henchmen and her army of Zodraz Soldiers. WHAT IS THIS GAME? A 2D Pixel Art, Action Adventure game with arcade-style gameplay which pits you against incoming hordes of soldiers and the bosses that await you! Battle through the evil forces that stand in your way, and witness the story unfold in cartoonish-style Visual Novel scenes, following the stories of Damon the Angry Celt Warrior, Elizabeth Yomoda aka. Widowmaker, and the Gaming Gods that created the New World. ABOUT ANGRY CELT WARRIOR You play the game as one (or two, or three) Angry Warriors that have been bestowed the Powers of Anger and Rage. A godly power that grants its user incredible strength and power that can take down even an entire army. Faced with enemies that want to rule the New World like Dr. Janet Anita, or who just want to be respected like Damon Healy, our heroes must punch, swing, yell and blast their way through their adversaries in order to save the New World! MEET THE WARRIORS -Damon the Angry Celt Warrior: The son of a proud and respected Celt Queen, Damon was reincarnated into the present day by Dr. Janet Anita. Realizing the truth of his return to the living, Damon sets out to rid the world of all those who seek to inflict harm. He comes across as a bit thick-headed, although it looks like he's hiding something... -Elizabeth Yomoda aka. Widowmaker: A highly trained assassin born to the last Japanese Samurai and a New Zealand spy, Widowmaker joins Damon's crusade as his girlfriend and partner-in-crime. Intelligent, strong, flexible and oozing sex appeal galore, Widowmaker is a danger in all forms! FEATURES -Visually appealing Visual Novel artwork, backed by a befitting soundtrack -Simple Arcade-style gameplay even casuals and novices can enjoy -Thrilling combat against soldiers and bosses -Enjoy a epic story spread out through Story Mode, Side Stories and Visual Novel Stories -Mini-games such as Arcade Mode and Rush Survival (more to come) -Free additional content for future updates (You bought the game already, so you deserve it!) HIGHLY RECOMMENDED IF YOU -Love simplistic gameplay -Looking for a good way to pass the time -Love an unfolding story -Love interesting and wacky characters -Love Cartoon-style art",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1542890/header.jpg?t=1615542832",
    "Price": 0.0,
    "Developers": "Ruben Zardoz Entertainment",
    "Publishers": "Ruben Zardoz Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1542890/ss_29960991efdf733c7a9aa59a6dbabb9fb5324464.1920x1080.jpg?t=1615542832,https://cdn.akamai.steamstatic.com/steam/apps/1542890/ss_9611a48bdf80dfdecedefaf27a55659800da4cae.1920x1080.jpg?t=1615542832,https://cdn.akamai.steamstatic.com/steam/apps/1542890/ss_f35a605bd58da45b9b3e9132ffc409f175ee19dc.1920x1080.jpg?t=1615542832,https://cdn.akamai.steamstatic.com/steam/apps/1542890/ss_bd75e42094f5ca36028587109127e185ed8ba514.1920x1080.jpg?t=1615542832,https://cdn.akamai.steamstatic.com/steam/apps/1542890/ss_9448e5c090438514e9e886b83fd15fa7e71344e9.1920x1080.jpg?t=1615542832",
    "Slug": "angry-celt-warrior",
    "Meta Title": "Angry Celt Warrior: Mar 12, 2021, Ruben Zardoz Entertainm...",
    "Meta Description": "Looking for information on Angry Celt Warrior? Check out the release date (Mar 12, 2021), developer insights from Ruben Zardoz Entertainment, and a comp...",
    "Alt Text Image": "Official header image for Angry Celt Warrior game - Steam 1542890",
    "Canonical URL": "https://gusku.site/game/angry-celt-warrior",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Angry Celt Warrior\", \"description\": \"Looking for information on Angry Celt Warrior? Check out the release date (Mar 12, 2021), developer insights from Ruben Zardoz Entertainment, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ruben Zardoz Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ruben Zardoz Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1542890/header.jpg?t=1615542832\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}