{
    "AppID": 411480,
    "Name": "BATTLECREW™ Space Pirates",
    "Release date": "Jul 10, 2017",
    "About the game": "JOIN THE CREW, RAID THE WORLDS BATTLECREW™ Space Pirates is a fast-paced competitive multiplayer shooter that offers a really dynamic and nervous gameplay. Choose your hero, call a few friends and join in on the fun! Each character has unique abilities (attack, defense, and movement attributes) that not only change the entirety of your playstyle but also the way in which you navigate the maps! It's up to you to find the one that suits you best! Create your own crew of pirates and lead your team into intense and epic battles! Steal as much of your ennemies' gold as you can in Gold Rush mode or turn them into space dust in classic Team Deathmatch mode! Between battles, dock at Tortuga, a space station that has become the lair and meeting-place of the worst buccaneers in the galaxy! Find new team members or invite your friends to play, check the leaderboards, and take part in the ongoing community challenges… BATTLECREW is more than just a shoot 'em up - it's alive! Players can unlock new content like environments, taunts, skins, emotes and game modes by winning regularly-updated community challenges! Features Fast and addictive gameplay designed for competition: in BATTLECREW, games are based on skill and cooperation with up to 8 players! Gold Rush 4vs4 mode in which you and your team have to collect as much gold as possible to win! Team Deathmatch 2vs2 mode in which you have to kill as many of the enemy pirates as you can to claim victory! 4 character classes, each with entirely different playing style! A richly-colored cast of cool and charismatic pirates! Pirate Bounties &amp; Pirate Points: BATTLECREW regularly challenges the community! Earn Bounties Points and Pirate Points (XP) to unlock new content (maps, skins, taunts…) 18 unique maps already unlocked, 9 maps for the Gold Rush mode and 9 maps for the Team Deathmatch mode. More to unlock by the community through our Pirate Bounties system Tortuga, the game community’ hub, is where pirates can meet, chat, check the game statistics and leaderboard, customize their avatar, check the community challenges, and launch games. Crews (Unlimited version only) - Create your own squad of 4 players for the Gold Rush mode or 2 players for the team Deathmatch mode. When your crew is complete, you will enter your own Tortuga. Tutorials &amp; Training mode Player vs. Bots – BATTLECREW’s fast-paced action can be daunting for newcomers, but that shouldn’t be a problem anymore thanks to a tutorial that introduces novice players to the core concepts of each character’s gameplay and skills. 20 unique Steam Achievements are now waiting to be unlocked! Steam Item Trading – BATTLECREW now supports the Steam Inventory and Trading systems, where players can trade 8 BATTLECREW cards. Website : Facebook : Twitter : YouTube :",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/411480/header.jpg?t=1500365612",
    "Price": 0.0,
    "Developers": "DONTNOD ELEVEN",
    "Publishers": "DONTNOD ELEVEN",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_a36f30d888020798bf316460b81fd531465889da.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_ae357b4a9d1186164ee7f8ec19ccf69d8b03ee1b.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_236e30be9497d1f60148e9afeedf07f09cd21a19.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_0a3a3317008c6abf0ccf6a8c55aa82f6526ea44f.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_cb08777cb9eec28bbb7de71f12f00e6ee49dcdc8.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_a0e8dde233ac9131dc0634b33eaf835aab7fd69b.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_1f047d4bab935acb11ea620be0fd07be627ba59e.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_8b55e92d4b760fbb5c36c436fa52e6cc7a72cd84.1920x1080.jpg?t=1500365612,https://cdn.akamai.steamstatic.com/steam/apps/411480/ss_07140da12a3ee9287e859349844cd42b785892a7.1920x1080.jpg?t=1500365612",
    "Slug": "battlecrew-space-pirates",
    "Meta Title": "BATTLECREW™ Space Pirates: Jul 10, 2017, DONTNOD ELEVEN a...",
    "Meta Description": "Looking for information on BATTLECREW™ Space Pirates? Check out the release date (Jul 10, 2017), developer insights from DONTNOD ELEVEN, and a complete ...",
    "Alt Text Image": "Official header image for BATTLECREW™ Space Pirates game - Steam 411480",
    "Canonical URL": "https://gusku.site/game/battlecrew-space-pirates",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BATTLECREW\\u2122 Space Pirates\", \"description\": \"Looking for information on BATTLECREW\\u2122 Space Pirates? Check out the release date (Jul 10, 2017), developer insights from DONTNOD ELEVEN, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 10, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"DONTNOD ELEVEN\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DONTNOD ELEVEN\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/411480/header.jpg?t=1500365612\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}