{
    "AppID": 945530,
    "Name": "Bohrdom",
    "Release date": "Dec 20, 2018",
    "About the game": "This is technically a skill-based, non-violent asymmetrical fighting game loosely derived from a chemistry model that is itself loosely based on reality. Alternatively, think of it as a hybrid of a bullet hell and a racing game, with the inclusion of self-propelled pinballs. If you love chemistry or physics, you'll probably enjoy this. If you hate chemistry or physics... you'll still probably enjoy this. High-Speed, Low-Stress: Electron Electron gameplay involves scoring as high as possible and/or escaping the current atom. Physics is heavily involved with electron gameplay, as electrons are accelerated towards desired positions by firing Photons in the opposite direction. In addition, electrons will ricochet off each other, the rings of the current atom, and even the nucleus itself, so quick trajectory calculations are often required. High-Stress, Low-Speed: Nucleus The antithesis of electron gameplay, Nucleus gameplay is focused around keeping electrons from escaping the current atom. Nuclei never move, remaining locked to the center of the atom. Instead, they control the atom itself, with abilities that allow them to lock atomic rings against electrons' exit, change electrons' trajectory, and keep electrons' energy below critical levels. Given the number of electrons that must be controlled (up to 12) and the speed and trajectory changes they are prone to, nucleus play is filled with leading targets and multitasking. If there's anything that'd make you fear the thought of being a sodium atom, it's this. Multiple Gamemodes Campaign: Primarily a method by which to unlock more atomic playing fields, but also contains a story told through the backgrounds Single-Player Challenges: In Timed modes, practice or replay campaign levels; for the skilled, test how long you can maintain control of an atom in the infinite time Control modes (nucleus only) Local Multiplayer: Allows up to four people to engage in splitscreen competition. Quantum Nightmares: Online multiplayer that can hold up to 13 people in one match. Simultaneously the most responsive and least responsive multiplayer you'll ever experience. (Consider a game where position, energy, actions, etc are synchronized between all players. Now consider a game where only actions are even considered and positions are only hinted at...) Nothing Unearned All cosmetics are either unlocked by default or locked behind achievements, meaning that the more noticeable ones are also badges of skill and/or dedication.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/945530/header.jpg?t=1561459188",
    "Price": 1.99,
    "Developers": "Cole Allen",
    "Publishers": "Cole Allen",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_0a48a7a5c04d220fb2d88363e45675a00face723.1920x1080.jpg?t=1561459188,https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_4a167ac31415c1427bd744dc0104257caf7a15da.1920x1080.jpg?t=1561459188,https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_d9bd4a645aca619ea553306e64e6a227cbda4e3b.1920x1080.jpg?t=1561459188,https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_3bdf8e518f2cf6f5694bc207ebabc7e78f096aec.1920x1080.jpg?t=1561459188,https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_ef0cd40aaf3334ac961a6d68304a6ce221ab7e01.1920x1080.jpg?t=1561459188,https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_346ce6216f42ebfb740748ca9c1cd06b10fe3335.1920x1080.jpg?t=1561459188,https://cdn.akamai.steamstatic.com/steam/apps/945530/ss_086d35ca7d37b0e442b15a7beb7641d1178be38c.1920x1080.jpg?t=1561459188",
    "Slug": "bohrdom",
    "Meta Title": "Bohrdom: Dec 20, 2018, Cole Allen and Full Overview",
    "Meta Description": "Looking for information on Bohrdom? Check out the release date (Dec 20, 2018), developer insights from Cole Allen, and a complete game summary.",
    "Alt Text Image": "Official header image for Bohrdom game - Steam 945530",
    "Canonical URL": "https://gusku.site/game/bohrdom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bohrdom\", \"description\": \"Looking for information on Bohrdom? Check out the release date (Dec 20, 2018), developer insights from Cole Allen, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cole Allen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cole Allen\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/945530/header.jpg?t=1561459188\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}