{
    "AppID": 1961740,
    "Name": "Charmareians",
    "Release date": "Jun 17, 2022",
    "About the game": "Features: 12-15 hours of reading time. Interactable Map Sections - Get enriched with new planets with point and click elements(Some events can be clicked on multiple times and can unlock other events). A common route story and 4 character routes that include the main heroines(Varlim, Cherumi, Freya, Mavarin and Naho). 4k resolution with zany character and background art. Music composed by multiple talented Japanese artists(Asobeat, Soundscape, Cyber Rainforce, and Desk Top Mafia). A needy bird god. Momo. The Story of Charmareians: The Charmareian race is in a dire situation. Our offspring are infected by what our people call a plague. They label these Charmareians as Outliers. Said Outliers have been treated poorly for long enough! I will not stand by any longer while my people are fighting amongst themselves! Every passing day, the Misfit army grows bigger and stronger! We will do whatever it takes to bring the people of Charmara together. Not everyone can become a Misfit, but all ask for is your support! If you're interested in joining, please talk to one of my elite members! Meet the elite squad! Misfit Elite #4: Cherumi The Misfit's bundle of joy. If Cherumi isn't feeling well, the group's morale will be tarnished. (Notes: She was supposed to be the third elite member, but her sister is one bad apple. Whatever those are.) Misfit Elite #3: Varlim The thorn in my side... The red hot varlet! She's nothing like her twin sister. She just does whatever she wants and pays people no mind. You'll never see her without her custom Charmara Armor, Mark 1. Misfit Elite #5: Freya Freya Charmara, princess of Planet Charmara. Otherwise known as the Outlier Princess. She's lead a tough life despite her position. Years and years of ridicule from her people has backed her into a corner. That all changed one fateful day, when she met up with the leader of the Misfits. Misfit Elite #6: Mavarin Mavarin, the Charmareian of Earth. After being pushed around her entire life, she made the decision to leave her people behind. She is revered as a god by the Earthians. Despite her terrible experiences on Planet Charmara, she hopes to return one day. There's someone she has to see again no matter what. Misfit Elite #7: Naho Naho... She's weird... S-She irks me...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1961740/header.jpg?t=1656180768",
    "Price": 0.0,
    "Developers": "Team Misfit Makers",
    "Publishers": "Team Misfit Makers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1961740/ss_30ef6c8e587525003a6f1b648df545ec14e14f02.1920x1080.jpg?t=1656180768,https://cdn.akamai.steamstatic.com/steam/apps/1961740/ss_beaea38d3fca7252a0b2952178b05612e880475a.1920x1080.jpg?t=1656180768,https://cdn.akamai.steamstatic.com/steam/apps/1961740/ss_568dbc6e86d68b61ed9e5d5052c3d0145ed93e07.1920x1080.jpg?t=1656180768,https://cdn.akamai.steamstatic.com/steam/apps/1961740/ss_cf2802a4c1514d060e802c06d4f9ddb8083069fb.1920x1080.jpg?t=1656180768,https://cdn.akamai.steamstatic.com/steam/apps/1961740/ss_a0ba88fdf0e91cb19ec7ce3dd9ab4c7cf152d8c4.1920x1080.jpg?t=1656180768",
    "Slug": "charmareians",
    "Meta Title": "Charmareians: Jun 17, 2022, Team Misfit Makers and Full O...",
    "Meta Description": "Looking for information on Charmareians? Check out the release date (Jun 17, 2022), developer insights from Team Misfit Makers, and a complete game summ...",
    "Alt Text Image": "Official header image for Charmareians game - Steam 1961740",
    "Canonical URL": "https://gusku.site/game/charmareians",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Charmareians\", \"description\": \"Looking for information on Charmareians? Check out the release date (Jun 17, 2022), developer insights from Team Misfit Makers, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Misfit Makers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team Misfit Makers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1961740/header.jpg?t=1656180768\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}