{
    "AppID": 734900,
    "Name": "Chemically Bonded",
    "Release date": "Nov 30, 2019",
    "About the game": "Chemically Bonded Enter the melancholic life of a Japanese high school student, as you soon become entwined in the dispute between two female students. Learn more about their past as you piece together their relationship and mend their bond, all whilst forming bonds of your own. Players will be presented with both conventional and unconventional choices which shape the relationship formed with the girls. Help restart the Science club or choose to increase your athletic capabilities as you grow closer to she who holds the key to your heart. Notice: Chemically Bonded is a work of fiction. Any resemblances to any persons, living or dead, or organisations are coincidental. All characters depicted in Chemically Bonded are over the age of 18. Story Between two girls' hearts lies a rift. One of misunderstanding, conflicting views and deceit. Each having a dream far too different from that of the other, but somehow keeping themselves ever so similar. Struggling to keep up with your own responsibilities, you stopped being a dreamer long ago. By chance, the lives of these two girls engrosses your world as you unwittingly form new bonds with them whilst trying to mend the broken ones they once held so dear. Maybe then, their dreams can come to fruition as you learn more about them and what matters the most to you. Features: Multiple routes and endings Interactive phone system for choices and dates. 5+ outfits and multiple poses for both girls. High quality artwork. Voice Acting Genre: Romance, Drama, Comedy Romance: B x G Team*: Scenario, Programming, UI: ds-sans Original Artwork: Jun Project, mB0sco Original Score: L. Dougherty, Red Robotix Main Heroine VAs: N i i, Amber Barile * Full cast and credits available in-game. Frequent updates on the project can be found on twitter @dssansVN Kiyoko Ishikawa (CV: N i i) As an aspiring scientist, Kiyoko prides herself on her ability to control her emotions through the use of logic. At least, that's what she believes. Despite having an overly emotive personality, she's often mistaken for the quiet type despite having a lot to say. Her inquisitive nature usually leads to chaos, as despite enjoying an experiment or two she has no concern for health and safety procedures. Kiyoko is the founder and currently sole member of the science club and tends to keep to herself, being known around the school for her outstanding intellect. Naomi Satō (CV: Amber Barile) Naomi is a girl with plenty of passion, most of which she puts into her attitude. Extremely popular, even to those of the same sex. She isn't afraid of conversation, however despite her popularity her social circle is quite limited. She is the captain of the athletics team when she isn't having her say over every sporting club in the school. She'd be considered a tomboy by most outsiders, but those who know her well are privy to her innermost girlish quirks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/734900/header.jpg?t=1609891390",
    "Price": 9.99,
    "Developers": "ds-sans",
    "Publishers": "ds-sans",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/734900/ss_995be4ce32e78b656f357e61cacb1d208ac92395.1920x1080.jpg?t=1609891390,https://cdn.akamai.steamstatic.com/steam/apps/734900/ss_c948d6d8fb3de3c2fe4162ec0b8bc063287547d1.1920x1080.jpg?t=1609891390,https://cdn.akamai.steamstatic.com/steam/apps/734900/ss_b488edf27fdc670eb6f923118f7d5ff927d58828.1920x1080.jpg?t=1609891390,https://cdn.akamai.steamstatic.com/steam/apps/734900/ss_933dc8ea2fcd5ca44c3f7d3e6ca3e1cab437f290.1920x1080.jpg?t=1609891390,https://cdn.akamai.steamstatic.com/steam/apps/734900/ss_2496be63a3f2971d692999f9d36192db2e4c6556.1920x1080.jpg?t=1609891390,https://cdn.akamai.steamstatic.com/steam/apps/734900/ss_bc123f5dc733190e83eda37cb7373cb3af3d50f9.1920x1080.jpg?t=1609891390",
    "Slug": "chemically-bonded",
    "Meta Title": "Chemically Bonded: Nov 30, 2019, ds-sans and Full Overview",
    "Meta Description": "Looking for information on Chemically Bonded? Check out the release date (Nov 30, 2019), developer insights from ds-sans, and a complete game summary.",
    "Alt Text Image": "Official header image for Chemically Bonded game - Steam 734900",
    "Canonical URL": "https://gusku.site/game/chemically-bonded",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chemically Bonded\", \"description\": \"Looking for information on Chemically Bonded? Check out the release date (Nov 30, 2019), developer insights from ds-sans, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"ds-sans\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ds-sans\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/734900/header.jpg?t=1609891390\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}