{
    "AppID": 960040,
    "Name": "Clash of Chefs VR",
    "Release date": "Sep 16, 2021",
    "About the game": "Ready, set, cook! Clash of Chefs VR is a competitive cooking game that’ll put your culinary skills to the test! Whether in single player or against other chefs online, you’ll race to cook orders, serve them to hungry customers, and slap your opponents in the face with your leftovers as you battle to become the greatest chef in the world! Hone your skills in single player, with 80 challenging levels, split across four unique restaurants. The quicker you turn each order around, the happier the customer will be – but more complex recipes will test the reactions of even the most seasoned chefs. Become the burger boss! Master cooking in an iconic American diner, building the burgers of your customers’ dreams. French the fries, burn cook the patties, and deal with any extra toppings requested, as the customer is always right. With bacon sizzling, drinks sloshing, and cucumbers…cucumbering just like real life, you’ll need speed and precision to come out on top. Luckily, the game’s smart tech is always there to lend a helping hand, making your ingredients sit nicely on their plates - no matter how hard you throw them. Get a pizza the action! Step into the shoes of an Italian pasta master and get ready to start making dough – of both kinds! Toss and stretch pizzas, cook pasta, and debate the acceptableness of pineapple in a traditional Italian environment! With new recipes, new mechanics, a new waiter, and some fiery Mediterranean tempers combining to create a high pressure environment, you’ll need to put in the practice to come out on top – but once you’ve mastered new techniques, like shredding cheese, you’ll do grate! (Sorry). Show off your super sushi! All of the fish, and none of the cooking – yet sushi is a lot more challenging than it sounds! It takes a great chef to make great sushi – and with so many ingredients to choose from, you’ll need lightning fast reactions to get it right. If you prefer your food to be cooked (heathen!), you can even make warm ramen, with freshly cooked noodles, and lots of new ingredients! Toss up a top tortilla! In the Mexican restaurant, master the fire and flavors of the region as you tackle tortillas, build burritos, and put plenty of spicy salsa on your nachos. With more ingredients, more complex recipes, and yet more potential combinations for customers to choose from, speed and spice are the order of the day! When your food has this much kick, don’t be surprised if they want to take the edge off with a nice, cold beverage, with ice and a slice. Fight fire with food! Chef getting the better of you? Customer giving you lip? Let off some steam – and let the food fly! If you’ve burnt your bacon, just slap it in a customer’s face – you know it’ll make you feel better. After all, is it even a VR game if you can’t throw things around at random? Who knows, maybe you might even unlock a secret achievement or discover an Easter egg… Chat to the master chefs! Join us on Discord for regular updates on the game and give us some feedback! Enjoy swapping stories (and recipes!) with other eager chefs. Who knows, maybe one day you’ll meet on the battlefield of Clash of Chefs VR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/960040/header.jpg?t=1631810965",
    "Price": 19.99,
    "Developers": "Flat Hill Games",
    "Publishers": "Flat Hill Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_f86ccbc95283204f56d46e8e754f938af3c97163.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_7b801da9bdc13d48cd1436ccd40b8084b2a0f794.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_084bf15d48904aec16aee86d6b9537bfcf62a863.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_35843876d16e7cfdad0ff446735b6760beaf1082.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_c9cdefd77c7b5583f94b0c747e63fd81e2b80239.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_5b70621fd5e995ca370e2494f45ba18a59ad21cb.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_0db95d593e1fe01ccf353e59876ef6cd25214642.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_6ad54246770344c775d0d6a8b34fca7c44d753a6.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_e821f71be1cf42383e0fba75645f60fb2714d386.1920x1080.jpg?t=1631810965,https://cdn.akamai.steamstatic.com/steam/apps/960040/ss_b43f2a2bb3b442f710df25c22f67eb030fe42d7f.1920x1080.jpg?t=1631810965",
    "Slug": "clash-of-chefs-vr",
    "Meta Title": "Clash of Chefs VR: Sep 16, 2021, Flat Hill Games and Full...",
    "Meta Description": "Looking for information on Clash of Chefs VR? Check out the release date (Sep 16, 2021), developer insights from Flat Hill Games, and a complete game su...",
    "Alt Text Image": "Official header image for Clash of Chefs VR game - Steam 960040",
    "Canonical URL": "https://gusku.site/game/clash-of-chefs-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Clash of Chefs VR\", \"description\": \"Looking for information on Clash of Chefs VR? Check out the release date (Sep 16, 2021), developer insights from Flat Hill Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flat Hill Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flat Hill Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/960040/header.jpg?t=1631810965\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}