{
    "AppID": 989690,
    "Name": "Conan Unconquered",
    "Release date": "May 29, 2019",
    "About the game": "Assemble a massive army, build an unconquerable base, and send your heroes out to fight and explore. From the Command &amp; Conquer veterans at Petroglyph comes the first ever survival RTS set in the savage world of Conan the Barbarian. Play solo or team up in multiplayer in Conan Unconquered’s action-packed co-op Mode where you build a shared stronghold and fend off the hordes together. The people of Khoraja flourished during its years of peace and prosperity. But they also turned lazy and feeble. The devious and tyrannical wizard Thugra Khotan looks to seize this opportunity and is marching his army to claim your kingdom as his own. You must awaken your people from their apathy, you must build your city defenses and fend off armies of attacking monstrosities. How long will you be able to stand against the invading hordes? Play solo or with a friend in the intense and action-packed multiplayer Co-op Mode. Choose between four different heroes, including Conan, with their own special abilities. Research new technology to build more advanced structures and improve your defenses. Randomly generated maps ensure that every playthrough is unique. NEW! 10 challenges to overcome, as well as the potentially never-ending Unconquered Mode. Take on the online leader-boards – or submit your own challenge! MULTIPLAYER CO-OP MODE Play together online and build a shared stronghold while fending off the enemy hordes. Both players can build structures freely, and research upgrades, walls, and structures are all shared. You can also try the game in challenge mode, where you can play the same maps as other players and see how well you compare to them. STAND AGAINST THE HORDE Battle wave after wave of increasingly more difficult enemies coming to destroy your stronghold, from lowly footmen to experienced elites and mighty siege weapons. Giant snakes and scorpions, spearmen, necromancers, and flying demons will arrive in vast numbers to see your home burn to the ground. CONTROL LEGENDARY HEROES Heroes are incredibly powerful units that can greatly influence the outcome of battles. These heroes, including Conan himself, possess special abilities and you can equip them with unique artifacts that you find as you explore the world. MANAGE YOUR RESOURCES Manage resources such as food, gold, wood, and iron to fuel your expanding stronghold. Construct a variety of different buildings from housing to temples and military barracks. Build defensive walls around your stronghold and equip them with traps such as oil cauldrons to keep attackers at bay. Train units and keep them fed and paid to see their power grow. SURVIVE DISEASE, FIRE, AND DEATH The world of Conan the Barbarian is one of blood, battle, and savagery. As your soldiers and those of your enemy die on the battlefield, their bodies will be left to rot and spread disease that can quickly turn the tide of war. Of course, a necromancer might be able to turn that to their advantage. EXPLORE THE ENVIRONMENT Randomly generated maps allow for infinite replayability and each map holds vast opportunities for players that dare to explore beyond their stronghold. Discover ruins hiding great treasures, but beware: these are often protected by massive guardians that you need to bring down to claim your loot. CALL UPON THE GODS Build a temple and dedicate your stronghold to Mitra. Summon their massive avatar that towers above the battlefield and crushes your enemies in its footsteps.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/989690/header.jpg?t=1592475976",
    "Price": 7.99,
    "Developers": "Petroglyph",
    "Publishers": "Funcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_5f0a7648072db7e3bd0588f81523767168274133.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_71a3241142ad0a6e88045c37107cba24af93ce1e.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_d25d23ba562d9eadec10bae8605d4bc44e3bf5ec.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_672b7e8c3c8490953e7e7716d2d755301d588f49.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_f500803ba88efef3813ba2eaf43a8b636e263b11.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_273ecd266bc40c9b66d2d80cfb73dc97ad12de74.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_f7d7f5ffcd781bd24982476fda5e84c3794533b6.1920x1080.jpg?t=1592475976,https://cdn.akamai.steamstatic.com/steam/apps/989690/ss_750eebc7b3305abc9787f6564753b036823c642f.1920x1080.jpg?t=1592475976",
    "Slug": "conan-unconquered",
    "Meta Title": "Conan Unconquered: May 29, 2019, Petroglyph and Full Over...",
    "Meta Description": "Looking for information on Conan Unconquered? Check out the release date (May 29, 2019), developer insights from Petroglyph, and a complete game summary.",
    "Alt Text Image": "Official header image for Conan Unconquered game - Steam 989690",
    "Canonical URL": "https://gusku.site/game/conan-unconquered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Conan Unconquered\", \"description\": \"Looking for information on Conan Unconquered? Check out the release date (May 29, 2019), developer insights from Petroglyph, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Petroglyph\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/989690/header.jpg?t=1592475976\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}