{
    "AppID": 1518000,
    "Name": "CooKing",
    "Release date": "Feb 26, 2021",
    "About the game": "Do you like cooking? Are you still learning it? Or are you afraid that you would burn the kitchen by making a scrambled eggs? Whatever your answer, this game will make you masterchef of your own kitchen. Enter the kitchen and put on your virtual apron. You will not make microwave sausages and cook pasta here, and you can forget ordering food too. Luckily for you, you don't have to worry about burning food and washing dishes or crying, because of cutting onions. Make the favourite dishes of different nations from combinations of the right ingredients. Don’t get overconfident, because your logic will also be tested in the kitchen. You may need to make an ingredient from the elements that you will need to prepare certain meals. At first, you’ll only facing with simpler dishes, and then as you turn around in more and more kitchens, the preparation of meals will become more and more complex. Recipes for prepared dishes can be found in the in-game recipe book, which allows you to prepare them at home. If you do, send a picture of the food in a message to the game's Facebook page, and if it looks delicious enough, it will be appearing on the page, let your friends see what an excellent chef you are. Story You play as a novice chef who has to prepare the dishes based on the restaurant menu. You start with simpler dishes first, and then, as you occur in more and more restaurants, the dishes become more complicated. Gameplay The goal of the game is to figure out what ingredients each food is made from. Some foods will require two ingredients, others require three. Moreover, it may be necessary to first produce another ingredient that will later be used for a food on the menu. On a given level (restaurant) the menu includes 10-12 dishes. You complete a level when you discover all the dishes on the menu of the particular nation’s cuisine. Each time you have successfully discovered all the dishes on the menu, you are transferred to the cuisine of another nation, where more food and new ingredients await you. Furthermore, if you have managed to discover a dish, it can even be made at home based on its recipe in the game. Key Features Logic and Puzzle Gameplay Find out what ingredients can be used to make the dishes on the menu Normal (two-ingredients) and difficult (three-ingredients) foods Increasingly harder challenges, more complex puzzles The discovered dishes can actually be prepared based on the recipes in the game 8 different hand-drawn menus with typical national dishes",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1518000/header.jpg?t=1615657326",
    "Price": 4.99,
    "Developers": "Gábor Présinger",
    "Publishers": "Gábor Présinger",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1518000/ss_63119db3674aa04e32a42713ee9d701150960bb3.1920x1080.jpg?t=1615657326,https://cdn.akamai.steamstatic.com/steam/apps/1518000/ss_1deff37380e00fc16fe073c58a9cd5bf86565eb5.1920x1080.jpg?t=1615657326,https://cdn.akamai.steamstatic.com/steam/apps/1518000/ss_19f5ff03e17276b98e803fae41c0eb11622ebd6c.1920x1080.jpg?t=1615657326,https://cdn.akamai.steamstatic.com/steam/apps/1518000/ss_9d4e451f83ce31b5881eb02bc42b20fcc0c9f237.1920x1080.jpg?t=1615657326,https://cdn.akamai.steamstatic.com/steam/apps/1518000/ss_03073fc7486dc25ee84c6ce661dce1c10545dae0.1920x1080.jpg?t=1615657326",
    "Slug": "cooking",
    "Meta Title": "CooKing: Feb 26, 2021, Gábor Présinger and Full Overview",
    "Meta Description": "Looking for information on CooKing? Check out the release date (Feb 26, 2021), developer insights from Gábor Présinger, and a complete game summary.",
    "Alt Text Image": "Official header image for CooKing game - Steam 1518000",
    "Canonical URL": "https://gusku.site/game/cooking",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CooKing\", \"description\": \"Looking for information on CooKing? Check out the release date (Feb 26, 2021), developer insights from G\\u00e1bor Pr\\u00e9singer, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"G\\u00e1bor Pr\\u00e9singer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"G\\u00e1bor Pr\\u00e9singer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1518000/header.jpg?t=1615657326\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}