{
    "AppID": 1127010,
    "Name": "Ebullition LBVR",
    "Release date": "Sep 19, 2019",
    "About the game": "* Multiplayer cooperative game (1-4 players) internet connection required, supports multiplayer playing in the same room as well as in separate booth * Ebullition LBVR is a high fidelity horror multiplayer shooter, designed for Virtual Reality Arcade, that means players can start playing within seconds. This game is designed to be simple to play and without learning curve, so players can start having fun right away, even if they are not a gamer. This game can be played using just one controller or up to two controllers for dual-wielding, no movement required, no virtual reality sickness, suitable for first time VR user, great for co-location gameplay, also supports PPGUN with vive tracker. Story: In a future dystopian world dominated by megacorportions, portals to other dimensions have been discovered, mysterious creatures have been found, leading to megacorporations and governments forming research organizations. You are soldiers in an elite squad formed by the organization, dedicated to enforcing their will, whatever it may be. Ebullition has episodic concentrated action, each mission is about 8-12 min long. You and your friends will be challenged by special missions, accomplish the mission or die trying. Dedicated server is used for multiplayer NOT Peer to Peer(P2P) to ensure the best connectivity possible. Fast multiplayer auto matching with local arcade players or online players from other arcades Simple and intuitive reloading, just point the gun down and get back in the action No difficulty to learn movement input, no motion sickness, great for beginners Native PPGUN with vive tracker support. VR RoomSync support. (setup each headset 2 meter apart) Average 10 min sessions are perfect for busy people who just want some quick action Massive number of enemies to slaughter, kill them with realistic modern or sci-fi weapons Boss too hard? Join official discord channel to find people to play with: for support email: support@secretcastlegames.com Arcade owner please use the commercial license as it has the additional configuration for the commercial license only, manual can be found here: -ofrslYXyfdE",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1127010/header.jpg?t=1576199708",
    "Price": 24.99,
    "Developers": "Secret Castle Games Inc.",
    "Publishers": "Secret Castle Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1127010/ss_fdd294b2bf6276286f4db115569c9c90698554fa.1920x1080.jpg?t=1576199708,https://cdn.akamai.steamstatic.com/steam/apps/1127010/ss_a9dc157c5dc9e5adcdf71d54966a0d6efb9922ed.1920x1080.jpg?t=1576199708,https://cdn.akamai.steamstatic.com/steam/apps/1127010/ss_646361c0d8b059f6c9c3192ca21e6359fedb3612.1920x1080.jpg?t=1576199708,https://cdn.akamai.steamstatic.com/steam/apps/1127010/ss_71808492eaf68b8e781e1173da2eaf2054a16271.1920x1080.jpg?t=1576199708,https://cdn.akamai.steamstatic.com/steam/apps/1127010/ss_c66ef6935388eb8a54d9e366c3bc7da02cf9b6fd.1920x1080.jpg?t=1576199708",
    "Slug": "ebullition-lbvr",
    "Meta Title": "Ebullition LBVR: Sep 19, 2019, Secret Castle Games Inc. a...",
    "Meta Description": "Looking for information on Ebullition LBVR? Check out the release date (Sep 19, 2019), developer insights from Secret Castle Games Inc., and a complete ...",
    "Alt Text Image": "Official header image for Ebullition LBVR game - Steam 1127010",
    "Canonical URL": "https://gusku.site/game/ebullition-lbvr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ebullition LBVR\", \"description\": \"Looking for information on Ebullition LBVR? Check out the release date (Sep 19, 2019), developer insights from Secret Castle Games Inc., and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Secret Castle Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Secret Castle Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1127010/header.jpg?t=1576199708\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}