{
    "AppID": 2063110,
    "Name": "Elemates",
    "Release date": "Jul 8, 2022",
    "About the game": "Are you ready to find friends for life? As the young girl Mayha breaks with the traditions of her tribe and supersedes her brother in the mystical trial of their god, Quetzal, she doesn’t expect to meet the banished god of death, Xol. She wants to prove her worth to the tribe. He wants to finally leave his prison and break free again. While they are as different as day and night, the unlikely duo has to work together to reach their goals: Finish the trial of Quetzal and face the wicked god. Join the fantastic adventure of Elemates and accompany Xol and Mayha on their journey as they become friends and teammates during their difficult quest. Twin-stick shooter with living crosshair The two protagonists are linked together by the power of a magical glove called 'Band of Humility' that always points at the dog guide, Xol. Shooting from this glove means your are always shooting at Xol. While each shot he takes empowers his abilities, it also means that you have to continually watch both characters' relative positions in order to fight whatever comes your way or solve the temple's puzzles that require clever positioning and timing. Teamwork is everything. The power of the elements Utilize three powerful elements with distinct mechanics to destroy walls, block projectiles and teleport across vast chasms. In order to use the inherent ultimate abilities of Fire, Earth and Lightning, both your dog guide, Xol, and the Band of Humility need to be charged. This is done by hitting Xol himself or hitting enemies that stand in your way, respectively. Hand-painted Aztec-inspired environment Discover the god Quetzal's ancient temple on your way to the top of the pyramid. Within these hand-painted, painstakingly constructed environments, coordinate the two characters simultaneously to solve challenging puzzles, dodge deadly traps and fight the ancient stone guardians of the structure. This is a journey through different biomes that gradually show the growing magic influence of the old god on your surroundings. Walk from freezing water through the arid steppes, continue on through the jungle's twilight and finally face the fire of the mountain itself. About Elemates' origins Since 2011 the University of Applied Sciences Mittweida has been offering the degree course Media Informatics and Interactive Entertainment and has been educating creative media specialists and computer scientists ever since. The goals and content of this bachelor degree course are shaped by the current job profile of the modern media informatics / game development industry. The study program aims to train graduates in both the disciplines of media technology and media management and computer science core disciplines to form a comprehensive, interdisciplinary basis. During our fifth semester all the media informatics students of the 2015 matrikel took part in developing our very own video game within a development team of 79 students over the course of 4 months. Following the beta, our very own games conference / release event was held at our university. We are proud to present our final project of four month's work to the public. We'd like to thank our diligent team leads, our great project teams, our helping hands, friends, family and everyone else who has given us their patience, strength and trust for those four months. We are proud of our game and hope you'll have fun playing it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2063110/header.jpg?t=1657269469",
    "Price": 0.0,
    "Developers": "MI Matrikel 15",
    "Publishers": "Hochschule Mittweida,Games-Studieren",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_4be2d645621f32643ff6d455682a0e8840b12433.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_04b3b148878564810547e790551c8453675747c8.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_a9c5dd802c4ce58cab08972dcc7ff6442cdfa194.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_2f6492de10cad74278648982fba113e80d654734.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_7581f87b1076cabbd36f2295fd70be2d0345656e.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_2185a3152e2626a5d6c048a27aabc41195ec0833.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_cedd5ac9a222d5f60a556afc436c0f09f90019e9.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_e01b3bc01554b524c58bab75ed754d0404d0950a.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_32ce95fc616778e1553ed94cd3c92e6479c46290.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_beeaf5a3b6a00240764b76427c38f9767851cbc9.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_4b656efd7f6a6f891856956e738c9b049e908f81.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_279e8f66ff942460fd14de50f6d0549f3e45ac9c.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_104c0a1f20abc39fc18c4ad593793468f8efd098.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_82efb1f1be0a61a54e847f3d17b370506a0c8c0b.1920x1080.jpg?t=1657269469,https://cdn.akamai.steamstatic.com/steam/apps/2063110/ss_1bca219f2f23cc356e4259b241420b5aa18cb695.1920x1080.jpg?t=1657269469",
    "Slug": "elemates",
    "Meta Title": "Elemates: Jul 8, 2022, MI Matrikel 15 and Full Overview",
    "Meta Description": "Looking for information on Elemates? Check out the release date (Jul 8, 2022), developer insights from MI Matrikel 15, and a complete game summary.",
    "Alt Text Image": "Official header image for Elemates game - Steam 2063110",
    "Canonical URL": "https://gusku.site/game/elemates",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elemates\", \"description\": \"Looking for information on Elemates? Check out the release date (Jul 8, 2022), developer insights from MI Matrikel 15, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MI Matrikel 15\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hochschule Mittweida,Games-Studieren\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2063110/header.jpg?t=1657269469\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}