{
    "AppID": 1201370,
    "Name": "HAMMY",
    "Release date": "Dec 18, 2019",
    "About the game": "You are an 'Internship God', with a group of lovely people, you can realize HAMMY's wishes, fill the island with plants and life, teach HAMMY's survival skills, give them architectural inspiration, and everything about HAMMY is in your hands.Can you change HAMMY's life? DIFFERENT LIFE Let them become smart HAMMY, feel technology and modernization, but development is often accompanied by environmental problems, your decision will change their life trajectory. Let them be warmhearted, build all kinds of defense weapons, build their own empires, resist all kinds of invasions, but a nation that advocates force also needs certain technology to go for a long time, and how do you make decisions. Let them become the devout HAMMY, the most loyal believer of God, unswervingly. Or, what kind of HAMMY do you want them to be, simple farmers, busy in planting and breeding every day, or become vicious and cruelIt's all up to you! LOVELY PEOPLE Your champion, HAMMY They are very inefficient, and only when one thing is finished can they think about another thing; they don't like to move things very much, and their dream is to have an automatic carrier, or the warehouse is full; they always make wishes to God, and they will be sad if they don't realize their wishes; they will kill people with knives when they are angry, but it's very easy to pacify them; they won't build things by themselves, but they will only follow your arrangement; they are very committed to renovating buildingsIf you can get to know them better, you will be a wonderful God! INTRODUCTION As an apprentice god, you have your own skills.But every time you use a skill, it will consume ham sausage - HAMMY's regular tribute is the only way to get him.In addition, some special buildings can also affect their tribute. Of course, the higher the belief value is, the higher the amount of tribute they pay each time. You can use skills to do anything, you can help HAMMY learn survival skills, give them enough resources, unlock architectural drawings, make them smart, strong, and so on. Only by using your skills can you become an excellent God and master everything of HAMMY. FEATURES: ● Dumb and cute HAMMY, with his own emotions, can observe all their behaviors at close range ● Random map and random assessment task, the journey of practicing God will be more wonderful ● Unknown battle and invasion, the island needs your protection ● Multiple Skills, 30 + drawings, etc ● Multiple endings, waiting for you to finish",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1201370/header.jpg?t=1579165974",
    "Price": 2.99,
    "Developers": "HEYGO Studio",
    "Publishers": "HEYGO Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1201370/ss_3111f2fc4a4f9a7203eb99dd2a8813c13101797f.1920x1080.jpg?t=1579165974,https://cdn.akamai.steamstatic.com/steam/apps/1201370/ss_024e4728853f89f68c7a78dbd46a7ea6d88e98d5.1920x1080.jpg?t=1579165974,https://cdn.akamai.steamstatic.com/steam/apps/1201370/ss_0272168f694ea4a75632fea8d4f5befeb7e7165e.1920x1080.jpg?t=1579165974,https://cdn.akamai.steamstatic.com/steam/apps/1201370/ss_f381b62489a8dda18fed22b8fed0ecd5e9f0df57.1920x1080.jpg?t=1579165974,https://cdn.akamai.steamstatic.com/steam/apps/1201370/ss_3741c23886af8b3fd027d33418e2f5806000d26f.1920x1080.jpg?t=1579165974",
    "Slug": "hammy",
    "Meta Title": "HAMMY: Dec 18, 2019, HEYGO Studio and Full Overview",
    "Meta Description": "Looking for information on HAMMY? Check out the release date (Dec 18, 2019), developer insights from HEYGO Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for HAMMY game - Steam 1201370",
    "Canonical URL": "https://gusku.site/game/hammy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HAMMY\", \"description\": \"Looking for information on HAMMY? Check out the release date (Dec 18, 2019), developer insights from HEYGO Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"HEYGO Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HEYGO Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1201370/header.jpg?t=1579165974\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}