{
    "AppID": 1648000,
    "Name": "Heroines",
    "Release date": "Jul 25, 2021",
    "About the game": "The kingdom of Lusnistan under the ingenious leadership of queen Elysabeth was once a prosperous kingdom until the arrival of the Dark Legion. After the defeat of Queen Elysabeth, the Dark Legion under the leadership of the Darkness Titan Kilgranuth attacked and destroyed the entire town of the kingdom of Lusnistan. The fall of the kingdom of Lusnistan is now only a matter of time. During the Dark Legion's final assault on the capital of the kingdom of Lusnistan, Laria, the Guardian of Lusnistan saved Princess Alice from this bloody siege. Wishing to defeat the Dark Legion and restore the kingdom, Alice and Laria sought the help of Dragon Emperor Zalaras. A thousand years ago, Zalaras defeated the evil Orcs from Lusnistan and helped build this kingdom. However, over time he gradually became corrupted and evil. After meeting Zalaras, Alice and Laria learn the truth that Zalaras has signed a shadow contract with the Darkness Titan Kilgranuth. In order to receive the endless power of darkness, Zalaras opened the portal of darkness for the Dark Legion to attack this world. However, with the help of Helena and Isemeine, Alice and Laria defeated Zalaras and together they set off to attack the Dark Legion..... FEATURES: Intriguing storyline. Female Protagonist. Beautiful graphics. Attractive gameplay. Diverse and attractive skill system. Alice - Princess Knight Alice is the daughter of Queen Elysabeth. She trained to be a Princess Knight since childhood. With the power of wind, she can slash all enemies in a flash and no one can dodge her attack. After Queen Elysabeth was defeated by the Dark Legion, she was saved by Laria, Guardian of Lusnistan. Wishing to defeat the Dark Legion and restore the kingdom of Lusnistan, Alice and Laria went to Dragon Heart Mountain to seek the help of Dragon Emperor Zalaras. Laria - Wizard Laria was born to be the Guardian of Lusnistan. She has been taught magic since childhood. With her intelligence, she learned the magic of light which is extremely powerful. In addition to the magic of light, she also has extensive knowledge of dragons and she has befriended dragons throughout the kingdom. And Fronnidam, Champion Of The Skies is one of the strongest she befriends. She also learned that, a thousand years ago, Dragon Emperor Zalaras defeated the evil Orcs from Lusnistan and helped build this kingdom. However, over time he gradually became corrupted and evil. After the fall of the kingdom of Lusnistan, Laria and Alice seek the help of Dragon Emperor Zalaras. Although she knows that Zalaras has been corrupted, she still believes that Zalaras will save the kingdom of Lusnistan. Helena - Feral Huntress Helena is a wild female hunter. Born and raised in the forest, she understood the principle of hunting more than anyone. With her agility, not a single wild animal could escape her. However she and all the others were cursed by Weretiger Maxima. Maxima cursed all the hunters in the Dragon Heart mountain to become monsters like him. She didn't want to be the slave of the one who cursed her, so she gathered the other cursed hunters against Maxima. After being promised by Alice to help her defeat Weretiger Maxima, she joined Alice's party and promised Alice to help Alice defeat the Dark Legion. Isemeine - Dragon Huntress Isemeine is a famous female dragon hunter. She goes on an adventure to find and slay the most famous dragons to add to her collection. In order to join the Dragon Hunter Guild with other powerful dragon hunters, she went to Dragon Heart mountain to kill Dragon Emperor Zalaras.However, her comrades were killed during this journey and the main cause of their deaths was the Dark Legion. As she neared the encounter with Dragon Emperor Zalaras, she realized that she alone could not slay the dragon. So she went with Alice's group in the hope of defeating the Dark Legion to avenge her comrades and hoped that Alice's group would help her kill Dragon Emperor Zalaras.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1648000/header.jpg?t=1634280623",
    "Price": 6.99,
    "Developers": "Silver Cloud Games",
    "Publishers": "Silver Cloud Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_4a3f23e951810ed2409080d469a89354c749f140.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_dc5e2770873735583a18ab549ac7be225e0af8b3.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_92edb85d5167eb99d138a02f3996954fbf88b1f8.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_ac25715a7d830d60dc838bba52d25a53e0a3fe68.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_3269a24fe12ca932b9eb6a7975b0103871300067.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_665771300fe803ffe4a6d9bdca22533efd575f54.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_949c569ef12926778ec384f66912724c5bcf7507.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_6bae73d8071eccac2c3db2a4c54037d931e1ee8f.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_a6d6443961a9296f850650d1d522cb06756fcb46.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_7aca42a02e81f6387a4459d35b62bbc6a99f5a4d.1920x1080.jpg?t=1634280623,https://cdn.akamai.steamstatic.com/steam/apps/1648000/ss_505a5846849d8e55dac253a5a2460a8d54abb4bc.1920x1080.jpg?t=1634280623",
    "Slug": "heroines",
    "Meta Title": "Heroines: Jul 25, 2021, Silver Cloud Games and Full Overview",
    "Meta Description": "Looking for information on Heroines? Check out the release date (Jul 25, 2021), developer insights from Silver Cloud Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Heroines game - Steam 1648000",
    "Canonical URL": "https://gusku.site/game/heroines",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heroines\", \"description\": \"Looking for information on Heroines? Check out the release date (Jul 25, 2021), developer insights from Silver Cloud Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Silver Cloud Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Silver Cloud Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1648000/header.jpg?t=1634280623\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}