{
    "AppID": 1820640,
    "Name": "Marimo -VS- I.A.S",
    "Release date": "Jan 31, 2022",
    "About the game": "A side-scrolling shoot'em up game that cute Marimo Moss Balls fight against ferocious alien species! Overview A 2.5D shooter with old-fashioned side-scrolling and a way to attack enemies in the background. Fight with lock-on shots that can track up to 6 enemies appearing from the back of the screen at the same time, and forward charge shots that can penetrate enemies and enemy bullets. Defeating many enemies with one attack will increase the score you get, and the final score will change greatly depending on the order in which you defeat the enemies. Please check the in-game tutorial for details on how to play. Game features 2.5D side scroller Simple operability with only movement and two types of buttons 5 stages + 1 hidden stage Charge shot whose power and effect change depending on the charge time Lock-on shot that can attack multiple enemies appearing from the back of the screen at the same time Gimmick by physical behavior 4 difficulty levels that can be selected according to your skill Tutorial for first-time users Two operation types and key config Graphic quality that can be changed according to PC specifications Orchestra sound that creates an atmosphere of crisis Bonus: A collection of data to learn about real alien species Story In 2222 AD, the world's ecosystem changed drastically due to the destruction and pollution of the natural environment on the ground. The impact of large-scale destruction has eroded the land, connected the sea to lakes and marshes, and threatened freshwater organisms. In addition, unknown mutations occur in aquatic organisms that have taken in 'mysterious particulate matter' that has poured from the ground into the entire body of water. Lake Akan, the habitat of Marimo, was also invaded by various mutated alien species and preyed on native species one after another. Spherical marimo, once protected by humans, has been significantly reduced in number, leaving only one small colony now. The non-resisting Marimo seemed to be extinct without any help, but suddenly a mutant individual appeared in it. Mutant Marimo, which gained the ability to freely manipulate ​oxygen released by photosynthesis, succeeded in repelling alien species for the first time by that power. The few survivors of the spherical marimo have begun to roll to fight the imminent hordes of alien species. Disclaimer This game is fiction. The creatures that appear are modeled on real animals and plants, but there are expressions that differ from the actual ecology.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1820640/header.jpg?t=1643616424",
    "Price": 13.99,
    "Developers": "JoyPlot",
    "Publishers": "JoyPlot",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1820640/ss_9084c3d32287cc3c353be96662e847bd151a221a.1920x1080.jpg?t=1643616424,https://cdn.akamai.steamstatic.com/steam/apps/1820640/ss_73c7863648cd33855986f44bfdd1a9fb09135e69.1920x1080.jpg?t=1643616424,https://cdn.akamai.steamstatic.com/steam/apps/1820640/ss_9b44df40af83a3a2cbec0e5386e83324ef96fe4a.1920x1080.jpg?t=1643616424,https://cdn.akamai.steamstatic.com/steam/apps/1820640/ss_c3bf19e7d5934eac1541849da859aaa5b3408410.1920x1080.jpg?t=1643616424,https://cdn.akamai.steamstatic.com/steam/apps/1820640/ss_eec93148a081d13becaeef2334d5f23cb20e9362.1920x1080.jpg?t=1643616424",
    "Slug": "marimo-vs-i-a-s",
    "Meta Title": "Marimo -VS- I.A.S: Jan 31, 2022, JoyPlot and Full Overview",
    "Meta Description": "Looking for information on Marimo -VS- I.A.S? Check out the release date (Jan 31, 2022), developer insights from JoyPlot, and a complete game summary.",
    "Alt Text Image": "Official header image for Marimo -VS- I.A.S game - Steam 1820640",
    "Canonical URL": "https://gusku.site/game/marimo-vs-i-a-s",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Marimo -VS- I.A.S\", \"description\": \"Looking for information on Marimo -VS- I.A.S? Check out the release date (Jan 31, 2022), developer insights from JoyPlot, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"JoyPlot\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JoyPlot\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1820640/header.jpg?t=1643616424\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}