{
    "AppID": 1543630,
    "Name": "Mind Lock",
    "Release date": "Mar 2021",
    "About the game": "Mind Lock is the sequel to Heart Lock . We highly suggest playing Heart Lock for free before purchasing this game. Enter a world inside your own mind. Watch your imagination come to life before you, as you come to face life struggles that may seem all too familiar. Mind Lock is a 2D metroidvania experience that welcomes players to explore strange worlds and craft hundreds of custom spells never seen before. This game was created with the intention to expand your creative thinking, and to find your passion in crafting your way to success. Features In our current development cycle, all features are nearly identical to the features seen in Heart Lock. This will change over time, as Mind Lock is intended to become a much larger sequel to Heart Lock. Core Abilities From the beginning of the game, players are able to perform a few core abilities: hover, dodge, and shield/deflect. We have created several more core abilities, but these will be unlocked as we add more levels to the game. Spells Players can craft and cast dozens of unique spells with Gems. Soon we will be adding the 'Mod' socket, which allows players to attach Status Effects to their spells! Over time, we will improve the visuals (such as element color and texture), crafting cost, and power of all spells. Elemental Barriers Players will encounter Elemental Barriers that require specific spells to break. In a typical metroidvania, players are required to unlock abilities that enable them to progress. In addition to ability-driven progression , we hope to push that standard by instilling a crafting-driven progression design. Critters Little monsters run amuck in this world! You must craft spells powerful enough to defeat them. These critters drop Gems, Dust, and XP. Over time, each critter will be tailored to have their own unique stats, loot drops, and behaviors. Currently their combat stats are slightly imbalanced, and their AI is kinda dumb, but we will be improving this with more player feedback. Boss Level 1 has one unique boss fight. A dark, mysterious manifestation haunts your soul. You will be greatly rewarded for defeating this boss. Take advantage while you can, the boss rewards will change as we add more content to the game. The Pillow Fort Relaxing as a park bench, and comforting as a campfire. The Pillow Fort gives players the means to become stronger, and customize their stats to be more effective in combat. In addition, the Pillow Fort allows players to listen to music, or even build your own pillow fort! Loot All around the world, players will loot various items to help them on their journey. Loot currently includes Gems, Dust, XP, and Charms. Players can equip Charms to increase their stats or movement speed. World Traversal Tracking Flora - As players explore, they will encounter plants that grow beneath their feet. As the game intentionally has no map, Tracking Flora was added to help players keep track of places they've already explored. It's quite pleasing to watch the world come to life around you! Swap Points - Players can quickly teleport back to the Pillow Fort to heal and reflect before venturing out to face more critters. Geysers - When jumping isn't quite enough, players will encounter geysers that will boost them up to high platforms. Who needs double-jump when you can just launch .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1543630/header.jpg?t=1644468206",
    "Price": 4.99,
    "Developers": "Lunar Penguin Media LLC",
    "Publishers": "Lunar Penguin Media LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_cde6a90c103be6756afa14b592d52286158360f6.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_bac8135433d348b89ea993a676bb310de39d4c1f.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_c42144cf2c77ebda97a0fcc0baf81ca156483854.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_21eb042f9fed219c86fa34ad13952d56e94b3564.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_9646b167022458f9d3339d9c9484f4adb320af59.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_df75f61451553fbf2df0ce7f93aa9f3eca46f386.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_8d0336852a76be15c9a44e6caeb66d4097663125.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_2ae4d32c832babdedb44ff45d6e0c36b7fc4d013.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_42c460368342aa790745a620da07f33d7a67e1df.1920x1080.jpg?t=1644468206,https://cdn.akamai.steamstatic.com/steam/apps/1543630/ss_1ff34d24d5173ca640dd785fc666e10cac87f194.1920x1080.jpg?t=1644468206",
    "Slug": "mind-lock",
    "Meta Title": "Mind Lock: Mar 2021, Lunar Penguin Media LLC and Full Ove...",
    "Meta Description": "Looking for information on Mind Lock? Check out the release date (Mar 2021), developer insights from Lunar Penguin Media LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Mind Lock game - Steam 1543630",
    "Canonical URL": "https://gusku.site/game/mind-lock",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mind Lock\", \"description\": \"Looking for information on Mind Lock? Check out the release date (Mar 2021), developer insights from Lunar Penguin Media LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lunar Penguin Media LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lunar Penguin Media LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1543630/header.jpg?t=1644468206\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}