{
    "AppID": 1526190,
    "Name": "Mysteries of Shaola: The Cave",
    "Release date": "Jan 13, 2022",
    "About the game": "Mysteries of Shaola: The Cave is a role-playing game that brings mystery elements to the fantasy genre. Fight through the Kazen Kingdom and uncover the truth of the mysterious cave. Discover secrets, build your legend and ultimately confront the corrupt force in this new chronicle of Shaola. It looks like any common cave—just a rocky cave, silently sitting alone in the cold wilderness. Even on the brightest day, the cave's entrance remains dark, as if concealing thousands of secrets. No one knows what it's like inside the cave because no one has ever come out of it. Many brave men, unable to resist their curiosity, have infiltrated the cave to discover the secrets inside. None have come back. It's as if they vanished into thin air. Darkness descends over Kazen. Wars, conspiracies, mysterious abductions are overshadowing the kingdom. The Rose family has spent a year running for their lives, desperately trying to escape the warlords and powerful factions after failing to convince people that they don't have that valuable thing that people have been searching for. No one believes them. They have gone deep into deserts, jungles and islands, but no matter where they went, no matter how hard they tried, they couldn't escape. They have reached a dead end. The cave! The scariest place in the world has become their only option, as no one would dare enter it! However, when they reached the area, the enemies came at full force. Richard Rose and his beloved wife sacrificed themselves so that their two children could escape. Denzel, badly wounded, and his little sister, Helen, finally reached the entrance, trying to swallow their tears, pondering whether to enter the cave... Thirty-five years later, a powerful family in the Ankania Kingdom was slaughtered. No living things were left alive and the mansion was burned down to ashes. A week later, another family was found slaughtered, in exactly the same circumstances. The Ankania Kingdom seeks help from its ally, the Zuda Kingdom. The Iron Eagle of Zuda is the world's oldest and most powerful organization of spies. As the spymasters start digging deeper, they discover the link between the killing sprees and ... the cave. As one of the top agents of the Iron Eagle, Ice will go to the cave and do everything to stop this madness before the body count rises—even if it means risking his life. A suspenseful, thrilling story with shocking plot twists Simple, easy-to-learn game controls and mechanics Earn irresistible rewards for advancing levels Slash bushes, find hidden treasures, explore secret areas Nostalgic, classic sideview, intense turn-based battle system, with on-field visible enemies and no random encounters in which you walk five steps and get into a battle No 'game over' Different interesting conversation depends on the makeup of your party Multiple endings based on dialogue choices, subtle triggers and other variables; each ending reveals a meaningful secret",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1526190/header.jpg?t=1652037645",
    "Price": 9.99,
    "Developers": "Smiling Dragon RPG Studios",
    "Publishers": "Smiling Dragon RPG Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_621b501a06e2a6e29806eedf8eee476e477ccc41.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_3390717120cb6939ea64bef6a44774c4259ba476.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_a4be0ecb3fd44a5d4a605a2507697a5e6ad8eb30.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_fb6b10ac5fc0671b3c210bf6b9a4e232d2fa0fa2.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_92d0a743b8215641dc00027b2602a75a8600008a.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_313db5d857d18451155da460085f8b85707701a1.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_b02df4d7429317afba36de9d0a6247e9b3a1df8a.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_fbf094f4030fa0c28895b4e35cb2f79d3ab46a34.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_98751737dd168bbc6789776b9b51a03d1605e899.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_6c71a2d381d6a4486c4c3108beb47804c69abd52.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_6666e9982906b2df6f0b2e254de59f7ded1cbe93.1920x1080.jpg?t=1652037645,https://cdn.akamai.steamstatic.com/steam/apps/1526190/ss_1dd161fff878cfae598af579b9f26910e036796a.1920x1080.jpg?t=1652037645",
    "Slug": "mysteries-of-shaola-the-cave",
    "Meta Title": "Mysteries of Shaola: The Cave: Jan 13, 2022, Smiling Drag...",
    "Meta Description": "Looking for information on Mysteries of Shaola: The Cave? Check out the release date (Jan 13, 2022), developer insights from Smiling Dragon RPG Studios,...",
    "Alt Text Image": "Official header image for Mysteries of Shaola: The Cave game - Steam 1526190",
    "Canonical URL": "https://gusku.site/game/mysteries-of-shaola-the-cave",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mysteries of Shaola: The Cave\", \"description\": \"Looking for information on Mysteries of Shaola: The Cave? Check out the release date (Jan 13, 2022), developer insights from Smiling Dragon RPG Studios,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Smiling Dragon RPG Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Smiling Dragon RPG Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1526190/header.jpg?t=1652037645\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}