{
    "AppID": 1949180,
    "Name": "Nocturama",
    "Release date": "Apr 21, 2022",
    "About the game": "Nocturama Bononia [/] is a container of interactive comics of the urban fantasy genre, set in a nocturnal Bologna. The stories are linked to places, monuments and city objects, located on a map of Bologna, and tell of different characters but with a single common denominator: living the most important night of one's existence [/]. Liber Paradisus[/] [/h2] 'This is the memorial of the male and female servants who were freed by the Municipality of Bologna ...' [/] Red has been in Italy for some time and is a rider. He is very tired from the continuous work. Called back by the company several times, he is forced to suffer and move forward, for himself and his family. There is someone who is waiting for him for the umpteenth delivery, a man who recites the memorial known as the Book of Paradise. And he seems really looking forward to meeting his rider. Ars Memoriae [/] [/] What are you willing to risk for a great story? [/] A narrator has lost all inspiration and wanders through the streets of Bologna under the moonlight. Entering the historic University Library, he finds a hooded figure who promises to help him if he will play a strange game, with a worn-out tarot deck. Gargoyle [/] [/] Son of Good. O Son of Evil. Without knowing where one or the other is. [/] A man wanders aimlessly after drinking all night, gripped by pain. When he finds a street corner where Good and Evil coexist, he will have to accept this paradox. And confront his demons. A seamstress' night[/] [/] One obsession: that your art is never forgotten. [/] After winning the most important tailoring award, Roberta was torn apart by critics. Obsessed with her work, she cut off every other relationship. The only leisure she allows herself is to spend a few minutes in the cloister of the Church of Santo Stefano, at the end of her working day. Here, one night, she finds a woman who proposes a pact to make her art immortal. The Wanderer[/] [/] The ultimate recipe for the control of souls, an inheritance at hand. And only a guy who can stop you. [/] Dasein is the last descendant of an ancient Academia, formed by the nobles who studied at the University of Bologna in the Archiginnasio. Here they accumulated the many ingredients needed to prepare Theriaca, an elixir to control human souls. And Dasein has only one obstacle to overcome to reach his inheritance: a boy. The Wanderer. Emma [/] [/] Emma is thirteen years old and has gotten lost in the large park of Villa Angeletti. As she searches her way home, she finds the macabre remains of previous visitors to the park, until she gets close to the banks of the Navile Canal. Here she discovers where those remains came from, and what lies hidden in the waters of the Canal. Requiescat [/] [/] Even if you are infallible, there are always those who will prove the opposite to you. Whether it is corporeal or not. [/] Dalia has been hunting ectoplasms for more than twenty years, and no ghost has ever deceived her. You receive a letter, a request for help from the ancient Villa Clara, just outside the city. The Slayer is suspicious, no one sends such letters anymore. And once she reaches the Villa she discovers that her suspicions are well founded. Perhaps she, for the first time, she was really deceived. Two soloists A promising pianist, a ruthless killer. Two soloists. Carlo, an acclaimed pianist, is about to debut at the Teatro Comunale. When he starts to play, each of his chords corresponds to a crime in the alleys of Bologna, carried out by a heinous murderer. Neither Carlo nor the murderer are able to stop: both are desperately seeking the applause of their audiences. Kairos What if Bologna is one of the Pillars of Time? Proarke and Sige are the two Guardians of Kairos, the temporal dimension, and have been resting for centuries, petrified in the form of Eagles set in the facade of Palazzo d'Accursio. But as the sundials and clocks of Bologna begin to melt, they awaken to try to understand who is endangering time. They discover that the cause has to do with their past, and with ancient, unsolved jealousies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1949180/header.jpg?t=1651514110",
    "Price": 0.0,
    "Developers": "Italian Party of Indie Developers",
    "Publishers": "IV Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_a2eb6a5ef8eacfc74933488894e497529956b3c4.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_a8df58024bbd6456117fd5fd1fe44312cf7f43fc.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_8387df567f699cdae8a1b54b6ec9091c0927ccf2.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_df55bf900ca800fd1c603f189bc76aca6e1e7e5a.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_4985ca073d3740d0ce4a501772f23cb489bc8aca.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_97ef40f46abe67c8b9561748dd8c721928b11d18.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_c71307ceb8a6d9bb8ee71ff907c7c27a37aadaaa.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_29263cc4a4957c213d5fc0c7c9b4c7240fe7a6ad.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_dead37608e6e107a413e1bb765ced1dafad5e3e1.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_ddc2454c21e91f931cf8d2e20f847e6a3e7ab906.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_8d841dedf05509a4937773ee0c11517430d5edb8.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_5f6e9f59e2de3e88ef4b126987e95cea40cb3e19.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_d6dd2a05fc35f34c78ed1098ef6ec63b4c54bdee.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_7675379af1a46a705916c38bc5ef78a9d94238c5.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_453b5daf38e888efceef8314063d8c035c878bc8.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_53818dfe86b0f9087781203fe080d1aa01addf96.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_f8a44f42c66818891331c7487efd686812f42a85.1920x1080.jpg?t=1651514110,https://cdn.akamai.steamstatic.com/steam/apps/1949180/ss_f193177ea95709b1fc4adf2a055350cee1208e41.1920x1080.jpg?t=1651514110",
    "Slug": "nocturama",
    "Meta Title": "Nocturama: Apr 21, 2022, Italian Party of Indie Developer...",
    "Meta Description": "Looking for information on Nocturama? Check out the release date (Apr 21, 2022), developer insights from Italian Party of Indie Developers, and a comple...",
    "Alt Text Image": "Official header image for Nocturama game - Steam 1949180",
    "Canonical URL": "https://gusku.site/game/nocturama",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nocturama\", \"description\": \"Looking for information on Nocturama? Check out the release date (Apr 21, 2022), developer insights from Italian Party of Indie Developers, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Italian Party of Indie Developers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IV Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1949180/header.jpg?t=1651514110\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}