{
    "AppID": 953920,
    "Name": "Palace of the Azure Dragon",
    "Release date": "Dec 1, 2018",
    "About the game": "Long ago, the heavens were held up by four great pillars, until calamity struck and the pillars fell. The sky ripped open, and the lands of China were torn asunder by uncontrollable wildfires and torrential flooding. Upon seeing the suffering of mankind, the Goddess Nuwa could not stand idly by. She gathered five colored stones and smelted them together to create a patch for the sky. Nuwa imbued the five-color stone with all her might, creating the Godstone and sacrificing her very divinity for man, and with her task complete, she fell into a deep slumber. But without the Goddess's careful watch, the Godstone shattered, its fragments scattering across the world. The Godstone was a primal thing, and its fragments were no less wild. The fragments drew the energies of the world like a magnet, transforming their surroundings into holy mountains and spirit glades brimming with demons and ghosts. The spirits' movement woke Nuwa from her slumber. When she saw what had become of the world, Nuwa feared what would happen if the growing wildness was left unchecked. With the last of her power, the Goddess summoned a champion, a Chosen One, from the human world, and thus the battle for the Godstone fragments began. Game Play Guide： 12 waves of monsters are coming to attack your Guardian Crystal. Before each wave, you will get 10 seconds to adjust the positions of your Immortal Guardians to best defend your Guardian Crystal. Once an attack starts, monsters will jump out of the portal and start making their way to your Guardian Crystal. The portal will have a red exclamation point above it if more monsters are on their way. Place Immortal Guardians on the glowing platforms along the path to try and take them out before they reach your Guardian Crystal! Immortal Guardians are waiting for your call in the clouds. Grab an Immortal Guardian to summon them, but remember you will need to pay them with Spirit Crystals . Each Immortal Guardian's fee is displayed above their head. If you don’t have enough Spirit Crystals to summon them, their fee will be shown in red. The giant crystal in the middle of the playing field displays how many Spirit Crystals you currently have. When a monster is destroyed, they will drop Spirit Crystals. Make sure to catch them before they fall. Talismans will periodically appear in the sky. Grab them and give them to an Immortal Guardian to boost their abilities. If a monster reaches your Guardian Crystal they will start their final attack. If your Guardian Crystal's health reaches 0, its game over. To beat the level, successfully defend your Guardian Crystal for all 12 attack waves!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/953920/header.jpg?t=1549774762",
    "Price": 4.99,
    "Developers": "GeneGames",
    "Publishers": "GeneGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/953920/ss_b93e3866edbf7589ba21d98d8627a0497ba37b14.1920x1080.jpg?t=1549774762,https://cdn.akamai.steamstatic.com/steam/apps/953920/ss_d7e28f1a8a0266c2616d14fdd0843bc1e6785ba1.1920x1080.jpg?t=1549774762,https://cdn.akamai.steamstatic.com/steam/apps/953920/ss_b7f9077bdb8053b70596e9f358923bd3965772ef.1920x1080.jpg?t=1549774762,https://cdn.akamai.steamstatic.com/steam/apps/953920/ss_52b36ed62c41b22c5ff7f38c1789c08ba8638bcb.1920x1080.jpg?t=1549774762,https://cdn.akamai.steamstatic.com/steam/apps/953920/ss_f027b6f3462eb6f7d04dad069b9844463506a92b.1920x1080.jpg?t=1549774762",
    "Slug": "palace-of-the-azure-dragon",
    "Meta Title": "Palace of the Azure Dragon: Dec 1, 2018, GeneGames and Fu...",
    "Meta Description": "Looking for information on Palace of the Azure Dragon? Check out the release date (Dec 1, 2018), developer insights from GeneGames, and a complete game ...",
    "Alt Text Image": "Official header image for Palace of the Azure Dragon game - Steam 953920",
    "Canonical URL": "https://gusku.site/game/palace-of-the-azure-dragon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Palace of the Azure Dragon\", \"description\": \"Looking for information on Palace of the Azure Dragon? Check out the release date (Dec 1, 2018), developer insights from GeneGames, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"GeneGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GeneGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/953920/header.jpg?t=1549774762\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}