{
    "AppID": 1334040,
    "Name": "Paper Dolls 2 纸人贰",
    "Release date": "Jul 2, 2020",
    "About the game": "“Paper Dolls 2” continues the game style of the “Paper Dolls Original” horror survival adventure. Yang Ming Yuan will continue his adventure in the high floor of Yin Mansion. Compared with “Paper Dolls Original”, “Paper Dolls 2” will have more grand scenes, more detailed plot animations, and more challenging gameplay. It may take about 10 hours for players who experience for the first time. There are four difficulty mode in the game, among which the most advanced nightmare mode needs to be unlocked after the game is accomplished once, we hope you can get the highest rating on the nightmare difficulty mode. Story Yet again, Yang Mingyuan awakens from a nightmare with a start; gripped by an unshakable sense of terror. Upon closing his eyes, the same scene plays, as if projected upon the insides of his eyelids—a rotten old mansion, a gloomy hall of mourning, ethereal shadows, and eerie paper dolls. It plays repeatedly, relentlessly. He hears a voice calling him, a murmur urging him forth, and yet he cannot make out exactly what it says. Yang Mingyuan watches the setting sun through the window, painting the sky red. He puts this all down to work stress and his other worries. 'Just take it one day at a time…', he tells himself. He picks up his jacket and car keys, and tells his daughter to pack for the journey. That's right, she's going back to her mother's place today. About to close the door, he sees the box of medicine on the table and hesitates for a short moment. 'Those blasted dreams must be some side effect of the medicine. 'I'll toss the whole lot out, and get myself a new doctor!', he decides, before slamming the door shut. As the highway lights fade into streaks as they speed by, the light starts to dazzle him, and that's when the familiar voice returns. His daughter seems to be saying something, but even sat right beside him, he can't hear a thing: it's as if they were miles apart. What… What do you want!? Out with it!', he roars hysterically. Dimly ahead there's a light flashing, and a loud bang follows, and then utter silence… 'This is…' When Yang Mingyuan comes to, he finds himself at an old and abandoned mansion. It is familiar yet alien to him, like a half-forgotten dream. The faint call of his daughter pulls him out of his daze, and he manages to rise up, albeit with considerable effort. He follows her voice into the deep darkness. What secrets do the mysteries within hold? The truth shall be unraveled, one piece at a time… The Old Yin Mansion In Beijing's western suburbs lies a mansion upon a wooded mountain. At the end of the Qing dynasty it belonged to the Yin family; the master of which was born into aristocracy, attaining great success as a youth and was highly valued by the imperial court. Leading an army, he pacified the lands far and wide, and would later marry a woman of similar social standing. Yet, their good fortune was to be short lived. When power over the imperial court shifted, Master Yin fell into a deep depression, and decided to live in seclusion. Thus, he chose a patch of land with suitable feng shui, with both mountains and rivers, and built his mansion. The only ones accompanying him were his personal attendants and two disciples. One of which was the erudite scholar Mr. Liu, the other Zhao, an expert painter. While his life was markedly more lonely than before, it was peaceful. Master Yin had wanted a son for many long years, and finally, the Mistress became pregnant. Yet, this created ripples much like a stone upon a still pond. Terrible rumors were spread, stirring the hearts of those in the mansion, and a series of tragedies came to pass… A heavy rainstorm fell upon the land, continuing for several months. Having cleared up, the mansion had simply disappeared from existence, its inhabitants vanishing from memory, together with their secrets… GAMEPLAY A first-person horror adventure game. Players must explore the gloomy ancient mansion and discover the unknown secrets behind the story. FEATURE Explore Search for your daughter in a gloomy Chinese mansion of the Qing dynasty, experience this terrifying journey of thrills and confusion. Adventure The path to his daughter is riddled with obstacles: how will you help him avoid, shake off, and defeat the many lost souls of the dead? As the story unravels, the truth gradually comes into light. Survival Those who die with unfinished business turn into restless spirits. For some reason, this manor is home to many such spirits and a single misstep may lead you into death's cold embrace. Puzzles Yet, the spirits of the dead are not your only worries. As terror looms in every corner, you must attempt to remain calm and solve the mysteries within. By piecing together what happened there, you will gain the knowledge required to open a gate—a gate that has been sealed shut for a hundred years. Collect Find all of the messages and information, discover the horrible truth of this hundred-year-old mansion. Please note: The sound is an important basis for storyline and foreseeing hazards. Please wear headphone and start the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1334040/header.jpg?t=1657242028",
    "Price": 19.99,
    "Developers": "Beijing Litchi Culture Media Co., Ltd.",
    "Publishers": "Beijing Litchi Culture Media Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_a24e2ba13cb3d93fa87ee470f8e8947f2fd9d1a7.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_735e07faf9c511ebb6372e40eb8d619e6a71d2bf.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_ba4ebeccc5642fc29d68ebad30131943889a2b6a.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_87908441e2b8c413a2b32882975fe52f986c9cb5.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_d8c0f27a0fef040ba4d4af1e39df29a0ff95c6ef.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_f2a53fb7ede1ad40a0bb4ca36764b06e249742e8.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_4abe84708ec7260695962d1f31c9fbd66492993a.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_ddeeb33880afde2ce7cf79d5d26c566d5127e265.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_c83817de119571a582b7f8d1eaa123a034a33d7b.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_2e6024bca298ec9beabc264dd1f78c5540b0ee8f.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_903e9539e8f8dad1ce6e85644d39a1a6f6690dc0.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_4fff345ce6c18e67c37241100bbc3f5cc2d7a65a.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_7320dd543d74bdd4666e1cb52b2a2b379e106f39.1920x1080.jpg?t=1657242028,https://cdn.akamai.steamstatic.com/steam/apps/1334040/ss_d355185f244a9f55d836a0781e4dbb9b179c82e0.1920x1080.jpg?t=1657242028",
    "Slug": "paper-dolls-2",
    "Meta Title": "Paper Dolls 2 纸人贰: Jul 2, 2020, Beijing Litchi Culture Me...",
    "Meta Description": "Looking for information on Paper Dolls 2 纸人贰? Check out the release date (Jul 2, 2020), developer insights from Beijing Litchi Culture Media Co., Ltd., ...",
    "Alt Text Image": "Official header image for Paper Dolls 2 纸人贰 game - Steam 1334040",
    "Canonical URL": "https://gusku.site/game/paper-dolls-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paper Dolls 2 \\u7eb8\\u4eba\\u8d30\", \"description\": \"Looking for information on Paper Dolls 2 \\u7eb8\\u4eba\\u8d30? Check out the release date (Jul 2, 2020), developer insights from Beijing Litchi Culture Media Co., Ltd., ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beijing Litchi Culture Media Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing Litchi Culture Media Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1334040/header.jpg?t=1657242028\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}