{
    "AppID": 1124390,
    "Name": "Paradigm City",
    "Release date": "Aug 22, 2019",
    "About the game": "The Golden Age of heroes is over, but you're just beginning. Will you use your powers to help the world or help yourself? Set on a near-future Earth that has been irrevocably altered by the arrival of superhumans, the world has been dealing with a radical shift in the nature of humanity. For thirty years, those with world-altering powers - referred to as capes - have been at the forefront of the world's media. There has been heroes, there has been villains, and there has been world-shattering confrontations when those two groups came into contact. For a time, those individuals walked the world like modern deities. For a time, it was good. But things change. Given time, all things resolve to entropy. The Golden Age is over. The player, a member of the newest graduating class of an international academy for powered individuals, needs to find their place in this new world, and whether that place will be determined by their own hand - or by the machinations of others. Assigned to the troubled Paradigm City, it'll be up to the player to determine whether their name becomes a byword for fame or infamy, idealism or pragmatism, and loyalty or ambition. Paradigm City is a 110,000 word interactive fantasy novel by James Rhoden, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. Play as male, female or non-binary, straight, gay or bi! Experience your life from youth to the end of your first big mission! Multiple endings, with differences both big and small! How will your actions affect the future of the world? Utilize the three precepts of epic heroism - brawn, bravado and brains - to solve challenges! Increase the potency of your electrokinetic superpower to overcome dangerous threats! Work with a team of elite heroes to solve a mystery - your relationships with them will determine their fates, and whether you'll learn their stories. Uncover and unveil a conspiracy, or work to use it for your own ends! Embrace the traditional values of the classical crusader, or embody the cutting-edge pragmatics of modern powered heroes! Sixty achievements! Three romance options to choose from - or don't, and keep things strictly professional!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1124390/header.jpg?t=1566508467",
    "Price": 3.99,
    "Developers": "Hosted Games",
    "Publishers": "Hosted Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1124390/ss_054ba7bacbe57d967147280056eb98669d92a294.1920x1080.jpg?t=1566508467,https://cdn.akamai.steamstatic.com/steam/apps/1124390/ss_92c9ffb760cb18ff4f57dd30bfea04f6d70b376c.1920x1080.jpg?t=1566508467,https://cdn.akamai.steamstatic.com/steam/apps/1124390/ss_c73610dd00d188b71700383d5894fe20c8f95b9e.1920x1080.jpg?t=1566508467,https://cdn.akamai.steamstatic.com/steam/apps/1124390/ss_cae2ad66575c5e961cb8eb926a54f3e1e31b95a3.1920x1080.jpg?t=1566508467,https://cdn.akamai.steamstatic.com/steam/apps/1124390/ss_db42ff280eca56514a8d54f185ca6194ea2d9bfc.1920x1080.jpg?t=1566508467",
    "Slug": "paradigm-city",
    "Meta Title": "Paradigm City: Aug 22, 2019, Hosted Games and Full Overview",
    "Meta Description": "Looking for information on Paradigm City? Check out the release date (Aug 22, 2019), developer insights from Hosted Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Paradigm City game - Steam 1124390",
    "Canonical URL": "https://gusku.site/game/paradigm-city",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paradigm City\", \"description\": \"Looking for information on Paradigm City? Check out the release date (Aug 22, 2019), developer insights from Hosted Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1124390/header.jpg?t=1566508467\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}