{
    "AppID": 1938360,
    "Name": "PLASMATIC",
    "Release date": "Jun 22, 2022",
    "About the game": "Plasmatic is a virtual, utopian space into which our society has voluntarily moved. We wake up from it unexpectedly. Our goal is to repair the main simulation core of Plasmatic. The continuation of life lived in it before will not be possible without the reparation. We are helped to achieve the goal by the Plasmatic's artificial intelligence called SPIRIT. During the game we slowly get to know the real intentions of our guide and we start to question the rightness of the goal we have to achieve. We are also becoming more and more aware of the fact that its implementation depends only on us. THE GAME Using our dexterity, logical thinking and the right tools we need to match colors of flying plasma balls into rotating batteries. To complete a certain level each battery must be fulfilled with the given color of plasma within specific amount of time. Only after refilling all batteries with the given color the timer will end the countdown and we will be able to proceed to the next level. Along the way there are waiting for us many surprises such as additional tools or new systems of moving the plasma around. Each of them diversifies the gameplay by increasing the difficulty of a level provided to finish the challenge. Our guide named SPIRIT will be leading us during the game. She is the voice of the artificial intelligence of the Plasmatic system. She will teach us to navigate in the area and also how to use all the tools provided. She is quite demanding... and can be blunt in her thoughts. However, we have a common goal which is just to repair the main Plasmatic core. If we achieve it, we will be able to regain access to the life we have lived before. Also the SPIRIT will not lose her own life. She cannot repair the parts of Plasmatic manually, but she has the 'know-how' in this matter. We do not have the 'know-how', but we have two working hands. Therefore we have to get along with each other to be able to cooperate. This is the only way to achieve the common goal. Plasmatic is a form of a manifesto of threats posed by the technology industry. It answers the question: how bad the society can become due to constant improvement of the technology industry? Special Features Intense gameplay - Plasmatic is based on solving logical puzzles in a predetermined short time interval. The game is accompanied by emotions related to the approaching end of the countdown as well as sound and visual effects that do not allow us to forget about the time pressure even for a moment. Future technology - Gameplay mechanics which you've never known before. Complicated challenges combined with an innovative puzzle solving method that require you not only to think but also to coordinate your movements. All this is presented in a futuristic style. Get absorbed - Extensive gameplay space: 22 challenging levels, a variety of scenes and intricate layouts for constructing puzzles on each of them. A variety of colors that delight with its style. Try to Keep Up - The mechanics and tools appear progressively during the game. Solve puzzles using additional tools like color pistol and gravitron. Remember about the obstacles that appear on new levels and master your control of the plasma’s flow that feeds the core.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1938360/header.jpg?t=1656495702",
    "Price": 7.49,
    "Developers": "EpicVR",
    "Publishers": "EpicVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1938360/ss_7c74a4f616ffffd27cf061fa7b1f2c6dedd28db4.1920x1080.jpg?t=1656495702,https://cdn.akamai.steamstatic.com/steam/apps/1938360/ss_64ee3dcd70ee2577002025a327c52f2462d448fc.1920x1080.jpg?t=1656495702,https://cdn.akamai.steamstatic.com/steam/apps/1938360/ss_0a78d08b6aeb898c600c66ecb3a5610edd3a7b42.1920x1080.jpg?t=1656495702,https://cdn.akamai.steamstatic.com/steam/apps/1938360/ss_e52d59dcf25c39adf6383b71810d6780bf7deb3e.1920x1080.jpg?t=1656495702,https://cdn.akamai.steamstatic.com/steam/apps/1938360/ss_0ce567477ff0a1b3e028b0f0bfe09c25b6253a0e.1920x1080.jpg?t=1656495702",
    "Slug": "plasmatic",
    "Meta Title": "PLASMATIC: Jun 22, 2022, EpicVR and Full Overview",
    "Meta Description": "Looking for information on PLASMATIC? Check out the release date (Jun 22, 2022), developer insights from EpicVR, and a complete game summary.",
    "Alt Text Image": "Official header image for PLASMATIC game - Steam 1938360",
    "Canonical URL": "https://gusku.site/game/plasmatic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PLASMATIC\", \"description\": \"Looking for information on PLASMATIC? Check out the release date (Jun 22, 2022), developer insights from EpicVR, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"EpicVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EpicVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1938360/header.jpg?t=1656495702\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}