{
    "AppID": 906120,
    "Name": "POLYBIUS",
    "Release date": "Dec 21, 2018",
    "About the game": "POLYBIUS is a fast, trippy tunnel shooter playable on a normal screen or in VR for the best effect. It features 50 levels of blissful trance shooting action set to a blistering soundtrack. The PS4 version was EDGE Magazine's VR GOTY in 2017, and the PC version of the game was even used as the basis for a NIN music video. So put on your trance trousers, bust out the Oculus if you have one, and strap in for a euphoric ride. Blast, boost and fly through 50 geometrical environments. Hit the boost gates to increase your speed. How fast dare you go? More speed means more points but also more danger! Pick up powerup pills along the way to increase your firepower, become invincible, launch yourself to stratospheric speeds, even slow down time. POLYBIUS is designed to bring you quickly to a euphoric flow state, and to keep you there the whole time you are playing. There are no bosses to spike your progress, and the game will never make you redo sections - progress made is progress kept, always, even if you lose a life. We want you to come out of every game of Polybius, whether or not you've beaten your highscore, smiling and happy because you've enjoyed the act of playing so much. Drop in for a quick blast or settle in for a long trip with Llamasoft's tried and true arcade game modes: Pure (start from the beginning and see how far you can get), Endurance (start from the beginning with a fixed number of lives, no extras are awarded during Endurance games), or Normal. In a Normal Mode game, you can choose to restart from any level you have previously arrived at. Our Restart Best system starts you off with the best-ever lives and score that you've had at that point in any game previously. Over time you can dip in and improve the individual Restart Best stats for any of the levels and gradually build a platform for achieving better and better high scores. The inspiration for POLYBIUS was an old urban legend about a strange, abstract, psychedelic arcade game that was supposedly released for a brief time in the 1980s. According to the legend people who played the game experienced strange and rather unpleasant psychological reactions after becoming addicted to it. There was talk of the CIA and Men in Black. Of course the legendary game has never actually been found but - especially with the advent of VR - we thought it might be fun to make a game inspired by the old legend. Our version is intended only to have positive effects on the minds of its users though! Don't just take our word for it, read for yourself some quotes from PS4 players after getting their hands on POLYBIUS! POLYBIUS! I can't believe a game can make me feel such joy. Thank you @llamasoft_ox for an incredible experience! Polybius is easily one of the best immersive PSVR showcases, alongside Rez Infinite, Thumper and SuperHyperCube - amazing work. The difference between non-VR and VR modes is incredible - even the title screen is astonishing. @llamasoft_ox has found his ideal canvas :) @llamasoft_ox what have you done to my brain? @llamasoft_ox thx for providing such a wonderful VR gaming xperience. Most immersive, fun and addictive #psvr game so far! I think it's the best game you have ever written, it's fucking epic! Nice one mate :-) Any initial WTF? Confusion of #Polybius is soon replaced with euphoria &amp; a great big grin. Amazing work @llamasoft_ox and all involved Polybius from @llamasoft_ox has the most *brilliant* 3D TV mode - great fun even without PSVR. First reason I’ve ever had to switch TV to 3D #Polybius in VR. Blimey. Words can't begin to describe it. Never before has a videogame given me a headrush. My compliments to @llamasoft_ox What you can't hear in this POLYBIUS (PSVR) clip is me laughing w/delight; thx @llamasoft_ox Oh My God. Polybius is the best PSVR game by a mile. If you have a PSVR, you *need* this game. Polybius wow ! Played to level 20 and now I feel chiiiiiiiiiiled 🐑 first time in ages I am not worrying myself sick. 10/10 Get #Polybius by @llamasoft_ox for PSVR. It's gorgeous, mind warping and extremely fun. Very inspirational as well! Shout out to #Polybius and @llamasoft_ox. Great game. I wondered what an 80s shooter would feel like inside an arcade game. This is it #psvr Halted my POLYBIUS time until tomorrow but let the eldest have a go before bed and as I was making a brew, all I could hear was laughter. So if you have a PSVR then you need to get Polybius. If you don't have a PSVR then get one and get Polybius. My word @llamasoft_ox So far Polybius by @llamasoft_ox is incredible and doesn't want to let me go.. love it! Well #Polybius is ridiculous. When you are really going + the screen is pulsing, colours separating — I think I taste colour. Blimey! Just played Polybius, the most intense legal trip you’ll ever take. Legendary work @llamasoft_ox this is THE reason for having PSVR 1st VR Polybius run. Holy mackerel! You get in a trance zone, when you finally run out of shields, you're like what day is it @llamasoft_ox #Polybius is ridiculous fun @llamasoft_ox has absolutely nailed it! Blew the dust off the psvr for @llamasoft_ox Polybius. Techno goodness. IncrediBull @llamasoft_ox Dude, you *so* nailed it. Relaxed into the game tonight and did so much better. All the things you spoke about - delivered. Go with the flow is about all the instruction you need for Polybius. I should be in bed but here I am. Beautiful. Thanks @llamasoft_ox Seriously, I have the *biggest* grin on my face right now, and it’s all @llamasoft_ox’s fault. #polybius @llamasoft_ox New Jeff game... Download NOW and... 4K 60fps = amazing! Plug in PSVR... I HAVE NO WORDS!!! 30 years I been waiting for this! Oh my god you guys smashed it :D and the music is magic , a very happy chappy indeed Now that I've finished mopping up the brains dribbling from my ears...moar #Polybius congrats to @llamasoft_ox it's finally out everyone go buy it your life will never be the same again. thank you llamasoft!! Best VR game I've ever played! No motion sickness (finally), super fast, just amazing. I really don't know what to say. @llamasoft_ox Polybius on PS4VR is freaking incredible.U just get so consumed by it 😁😁😁 great music as well can’t. stop. playing. Polybius. It has a tru",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/906120/header.jpg?t=1545391126",
    "Price": 6.99,
    "Developers": "Llamasoft Ltd.",
    "Publishers": "Llamasoft Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_b1e40bf16dd33d8eb1505f267b7cbe197b4870fb.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_dd4b3ed3f5372bdf33ce68abe6a60912382b9606.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_57c4fd32fc8f75aee3959d8048685f4744a2cfc5.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_9b688c40fcd24bb93df6fd2111cbbb6a18c8810b.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_c8070dd08eb4446c62c29bdc5810e197cdfc4e85.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_59a6c73eedcd40c2d3f2cf9a6b957184d3a433ff.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_9ab826d3983c96a94f891da6ac5b146b1ca7aa1f.1920x1080.jpg?t=1545391126,https://cdn.akamai.steamstatic.com/steam/apps/906120/ss_b0681d055b3107140dc30fae5f3404c06e9b267c.1920x1080.jpg?t=1545391126",
    "Slug": "polybius",
    "Meta Title": "POLYBIUS: Dec 21, 2018, Llamasoft Ltd. and Full Overview",
    "Meta Description": "Looking for information on POLYBIUS? Check out the release date (Dec 21, 2018), developer insights from Llamasoft Ltd., and a complete game summary.",
    "Alt Text Image": "Official header image for POLYBIUS game - Steam 906120",
    "Canonical URL": "https://gusku.site/game/polybius",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"POLYBIUS\", \"description\": \"Looking for information on POLYBIUS? Check out the release date (Dec 21, 2018), developer insights from Llamasoft Ltd., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Llamasoft Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Llamasoft Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/906120/header.jpg?t=1545391126\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}