{
    "AppID": 1189650,
    "Name": "Post Scriptum CTG: Collectible Token Game",
    "Release date": "Mar 12, 2020",
    "About the game": "PS: CTG Post Scriptum Collectible Token Game is a turn based strategy game, which is one of the entertainments that patrons have in taverns of the gloomy post-apocalyptic world Post Scriptum. The game is based on creating your own army of collectible coins, that turn into formidable warriors on the playing field. ABOUT THE GAME PS CTG is a turn-based strategy game with collectibles; The collectibles are the tokens of warriors that you can get out of booster packs; Right now there are 3 races available: humans, demons, undead; Right now in the build that we have you can play: solo versus a bot, versus a friend on the same pc, online versus friends, online versus random players using quickmatch; The warriors can have properties that trigger under certain conditions or combinations of other warriors around them; Average game duration should be 15-30 minutes; We are still working on the balance and triggers for the warriors; We are still working on the whole collectibility and technology behind it; PLANS FOR THE GAME It is planned to record a life story for each collectible token based on the distributed registry technology; We plan to use the distributed registry technology based on Tangle; We plan to show the main statistics of the games; We hope to see tournaments of the game in the future LIVING ROADMAP SHORT STORY Long before the Armageddon events, a team of dashing lumberjacks, having cut down another bunch of trees (also having drained a few bottles of new wine) have decided to relax in the shade of the tree crowns. The wine has hit the spot, but alas, the nap did not take its toll. After some time one of the strong men pulled out a coin shaped cut of a branch, which had been prepared in advance, and loudly declared in a drunken bass: “My King, what are your orders?!” The scene then was followed by a booming laugh. When the laughter had subsided, one of the participants took a second wooden coin and nibbled it as if it was made of gold. “My coins of the undead are stronger than yours! My forces will bite into them, and they won’t even get to the battle” – he completed in a thoughtful tone. “Then I will play as demons!” – picked up the third. All three looked at each other laughing again. “Let us play, let’s battle, yes let’s play” – echoed laughter through the trees. It would have ended like this, just a joke, but the next day, without any arrangements, all three of them would bring along a couple of dozens of uneven round coin shaped tokens made from a chopped branch. They all set down around a stump and looked at each other, as if saying “so, how are we even going to play this?”. And then the Lord of Acorns, holding one of his tokens high, declared that his cavalry was advancing on the Undead. With these words, he slammed the token on the stump with such force that it let out a creak. “Now it is your turn of the “Undead”, or yours of the “Demon”, decide for yourself, I’m not afraid of any of you...” - declared the first player in a royal tone of utter importance, lifting his head up to emphasize his noble origin. A month later, all the lumberjack brigades were already playing the wooden tokens. A little later, the fame of a peasants’ small fun game reached the local guild master. There was only one problem – the status did not allow the upper classes to mess with the chopped branches. But defeating the hideous werewolves and demons using the Golden Templars is of course another matter entirely. Thus the first Post Scriptum CTG coins were cast.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1189650/header.jpg?t=1593615534",
    "Price": 0.0,
    "Developers": "Alien Intelligence UAB",
    "Publishers": "Alien Intelligence UAB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_aa7a021e6bc88c46ab8a5a05ee2af2308f092bb0.1920x1080.jpg?t=1593615534,https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_1a4ba8e13751a8fb17ed31917c432cd88b47bbcd.1920x1080.jpg?t=1593615534,https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_ca804a6a28718e29cd000f9a70fabfda578fa636.1920x1080.jpg?t=1593615534,https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_026fdff5cb8eb2d0941aa7346c2ea824eadab03d.1920x1080.jpg?t=1593615534,https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_b1b89854eef2a7ccf0a4d299e876f2276922438e.1920x1080.jpg?t=1593615534,https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_9509a813209d39f409c670853ea6b73d694991c1.1920x1080.jpg?t=1593615534,https://cdn.akamai.steamstatic.com/steam/apps/1189650/ss_04a064eb29d1f7e4209eb2fb15ce0407d72046b0.1920x1080.jpg?t=1593615534",
    "Slug": "post-scriptum-ctg-collectible-token-game",
    "Meta Title": "Post Scriptum CTG: Collectible Token Game: Mar 12, 2020, ...",
    "Meta Description": "Looking for information on Post Scriptum CTG: Collectible Token Game? Check out the release date (Mar 12, 2020), developer insights from Alien Intellige...",
    "Alt Text Image": "Official header image for Post Scriptum CTG: Collectible Token Game game - Steam 1189650",
    "Canonical URL": "https://gusku.site/game/post-scriptum-ctg-collectible-token-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Post Scriptum CTG: Collectible Token Game\", \"description\": \"Looking for information on Post Scriptum CTG: Collectible Token Game? Check out the release date (Mar 12, 2020), developer insights from Alien Intellige...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alien Intelligence UAB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alien Intelligence UAB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1189650/header.jpg?t=1593615534\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}