{
    "AppID": 1427700,
    "Name": "Realm Engine | Virtual Tabletop",
    "Release date": "Mar 5, 2021",
    "About the game": "Realm Engine is, at its heart, an in-depth 3D world builder &amp; virtual tabletop that was built to be flexible enough to support the most popular tabletop RPGs and wargaming scenarios. Realm Engine is packed with a large arsenal of tools to be drawn upon for you to create the perfect map for each encounter, from dynamic lighting, animated miniatures &amp; spell effects even 3d terrain sculpting. Supporting a wide variety of campaign styles with hundreds of high-quality assets from arid &amp; ancient desert tombs to lush forest &amp; dark winding dungeons, you can let your imagination run wild. Realm Engine is free for players and Game Masters to build maps and share them across the steam workshop or just between each other personally. Multiplayer features are currently in the final stages of development and will be released as a single purchase DLC. This will only be necessary for the Game master to run games, players using the free version will still be able to join hosted sessions. From desk lamps to cauldrons, even the entire sun! Dynamic lighting allows you to create realistic scenes where you as the game master can control all light levels seen by the players. Controls for individual lights allow the players and game masters to interact dynamically with their environment and can help to set the mood for the adventures. With the control of the environment and weather at your fingertips, you can tweak the rain, fog, and time of day with just a few sliders! Build mountains, valleys, rivers, islands and so much more with the in-game terrain sculptor. This feature automatically generates the texture of cliffs, valleys, and overhangs to allow for the quick creation of realistic natural features. Change the entire landscape and environment with just the push of a slider! From lakes, oceans, and lava flows, you can tweak the environment to suit your needs. The versatile grid system lets you modify the height and color of the grid as well as toggle its visibility helping you to keep track of your players no matter where their adventures may lead. Online multiplayer support ensures that all players can join in on the experience Completely Free, only the Game Master needs to own the multiplayer edition to host the session. This approach also provides the potential for streamers to host their sessions publically allowing invited individuals to join as players and others to participate as spectators. Giving you more ways than ever before to immerse yourself in all aspects of tabletop gaming! Build truly unique maps and scenes for each encounter your adventure hurls at you, with animated spells and line of sight indicators you can map out the battlefield to make the most of your chance to get that sneak attack Hotkeys to toggle between visible layers allow game masters and avid map builders to quickly and easily navigate to different parts of the map. This also allows game masters to have complete control of what the players see as they make their way through sprawling mansions and into the deepest dungeons of your adventure Full Features List: Hundreds of Placeable Assets (More to come over time) Dynamic Lighting Fog of War Grid and Grid-less Play. Procedural Terrain Generator Terrain Sculpting and Painting Import Your 3D Models. (Supports textured FBX files) Import Your Own Audio Files. Import 2D images. Dynamic weather &amp; Environment. Animated Spells &amp; Miniatures. Export Hi-Resolution Images for Other Virtual Tabletops. Hundreds of Ambient and Musical Soundtracks to Mix. In-Game Chat + Dice Log Chat-Based Dice Roller Multi-level building support (Allows hiding and displaying individual layers of Dungeons.) Top-down, Free view, and First Person Mode. Save and Load Multiple Maps. Share and Download Maps via The Steam Workshop Export and Share Maps with Friends Second Monitor Support Join Session Hosted by a Game Master (Coming Soon!)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1427700/header.jpg?t=1626460631",
    "Price": 0.0,
    "Developers": "Blake Johnson",
    "Publishers": "Pixel Ghost",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_4bdbf9392d87e06b1a7b3fbdbcac3f05f1e5db72.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_f8712245e98831174fc9477642cc70d922fd1fb5.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_b539b9653294e722b41a85f13c0e312148677c84.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_bc98cb35e3685a1fdd84ea3dd1aef35578a9d534.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_405f7b5b95e90d83087b529fea73df8b40b9cf8e.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_a57c2b7d68c0deaee4bb61cf78439dde21df5054.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_3ac036417f6813a65e05824f88952d7d80f769e5.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_268ad3fd5daa44eff541db3a133b0453ddffa700.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_afc7b22d467876930456452bc2eec691a848f452.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_090b4c52c0b024006c6897bcb4646ee578916799.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_58d9e0b07614123698d325c3f9ba84bb91db72e5.1920x1080.jpg?t=1626460631,https://cdn.akamai.steamstatic.com/steam/apps/1427700/ss_d07b3dbb9c646fb93e5ad6124c87b318ba600f72.1920x1080.jpg?t=1626460631",
    "Slug": "realm-engine-virtual-tabletop",
    "Meta Title": "Realm Engine | Virtual Tabletop: Mar 5, 2021, Blake Johns...",
    "Meta Description": "Looking for information on Realm Engine | Virtual Tabletop? Check out the release date (Mar 5, 2021), developer insights from Blake Johnson, and a compl...",
    "Alt Text Image": "Official header image for Realm Engine | Virtual Tabletop game - Steam 1427700",
    "Canonical URL": "https://gusku.site/game/realm-engine-virtual-tabletop",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Realm Engine | Virtual Tabletop\", \"description\": \"Looking for information on Realm Engine | Virtual Tabletop? Check out the release date (Mar 5, 2021), developer insights from Blake Johnson, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blake Johnson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Ghost\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1427700/header.jpg?t=1626460631\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}