{
    "AppID": 250760,
    "Name": "Shovel Knight: Treasure Trove",
    "Release date": "Jun 26, 2014",
    "About the game": "Shovel Knight: Treasure Trove is the full and complete edition of Shovel Knight, a sweeping classic action-adventure game series with awesome gameplay, memorable characters, and an 8-bit retro aesthetic! Run, jump, and battle as Shovel Knight, wielder of the Shovel Blade, in a quest for his lost beloved. Take down the nefarious knights of the Order of No Quarter and confront their menacing leader, The Enchantress. But that’s not everything! Shovel Knight: Treasure Trove also features four additional games all unto themselves! Take control of Plague Knight, Specter Knight, and King Knight on adventures of their own or battle each other in a local four player Showdown. Together, they form a grand and sweeping saga! With Shovel Knight: Treasure Trove, you get it all. Play with a friend in Shovel of Hope's cooperative campaign, test your mettle in full-featured challenge modes, battle together in Showdown, and change the game with Body Swap mode. Uphold the virtues of Shovelry, earn relics and riches, and discover the true meaning of shovel justice! Includes: Shovel Knight: Shovel of Hope – Steel your Shovel Blade and start digging through the adventure that started it all! Jump, battle foes, and discover treasures as you quest to defeat the Order of No Quarter and their vile leader, The Enchantress. Shovel Knight: Plague of Shadows – Prime your potions and become the maniacal alchemist Plague Knight in his adventure to brew the ultimate potion! Combine bomb parts to create custom loadouts. Discover new items, areas, bosses, and maybe even a bubbling romance. Shovel Knight: Specter of Torment – Summon your scythe in the prequel to Shovel Knight! Take control of Specter Knight to dash through levels completely redesigned around his unique style of play. Climb walls, master a new arsenal of weapons, and slash your foes to ribbons with deathly precision. Become the reaper, discover your tragic past, and recruit the Order of No Quarter! Shovel Knight: King of Cards - Step into the gilded boots of King Knight in the biggest and most regal Shovel Knight game of them all! Leap, Shoulder Bash, gather new subjects, and strategize your way through this prequel in your quest to become King of Cards! Shovel Knight Showdown - Duel with up to 4 players locally and scramble after gems, or take control of your favorite character and dig into Story Mode! Master every move, explore a vast array of items and locales, and discover new revelations in this platform fighting game. Features: Yacht Club Games' beautifully authentic style bridges the gap between yesterday and today. Design, art, and audio hearken back to the days of 8-bit. The systems of today also give Shovel Knight modern touches: detailed animation, multilayered parallax backgrounds, and novel game design. Leap over gaps! Duel with foes! Uncover treasure! Find Secrets! Upgrade! Shovel Knight is simple to learn and play, but the challenge lies everywhere. Multiple awesome soundtracks by Jake 'Virt' Kaufman with additional songs by Manami Matsumae! Amass riches to upgrade your armor and weapons. Detailed, living background art and animation! Big, beautiful pixels! Lovable characters and treacherous bosses! Balanced gameplay is a warm welcome to newcomers, and an old embrace for experts. A light touch to narrative with humor, levity, and heart. Relive the adventure and uncover all of the world's secrets with New Game+! Challenge Mode - Up the ante in every imaginable way with over 100 full-featured challenges. Body Swap - Did you ever wish Shovel Knight was a lady, or Shield Knight was a guy? Well, now you can designate character genders however you like, with brand new designs for all of the main characters in Shovel of Hope! Co-op! – Grab a friend and play through Shovel of Hope as a fully cooperative adventure! Or uncover Story Mode together in Showdown!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/250760/header.jpg?t=1644022538",
    "Price": 39.99,
    "Developers": "Yacht Club Games",
    "Publishers": "Yacht Club Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_019205f5f9ae1c3f0d5359e967135a76ae1ebd2d.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_d4a97787fdb4f0c6bdc0826fcbb7319f74fffc6c.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_77b1cdeb564ee017030e7ff88f647db7ada26206.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_30ebf4cbeb9acb9a8c4143f4506f119ba7680400.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_f0d2dfe0a02a4750b4953b028ce043b4ee86c3a9.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_cf9a46ca4d7941eaa1ba5f19a058addc4df49202.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_1dc2ba98d6e8d2ca12544674cce6a62758958222.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_0bb0425139b57c639371a46cbabaabc0378d7296.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_1518e6e1a4f9140ee975c53e5ce19aaebb2545fa.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_141ac3acc8e707c10caf7a5f57e9b741eae425a6.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_5fd0950aaee3df4d90827276dcd8565fc2d33a61.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_be27c91845b7d2138e68371a2d2d28897ff47766.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_f45ec6c6be7bb4e73847fd12379141ad55eeb062.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_93336af730e82e8f05501c604c0cad0f68af00db.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_d995fb232d0546e957edba08516c72a22da286b8.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_88d474bb61a900b1203ae86d444737421107cb3d.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_afe1b89f34b6268e010fe9b1ea299543ea02eb35.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_9edfca9b560478dbfd589ccfca2eac4cbb015bf9.1920x1080.jpg?t=1644022538,https://cdn.akamai.steamstatic.com/steam/apps/250760/ss_ca650cb9a2a5e103e951dbfbce61bc366c67e03c.1920x1080.jpg?t=1644022538",
    "Slug": "shovel-knight-treasure-trove",
    "Meta Title": "Shovel Knight: Treasure Trove: Jun 26, 2014, Yacht Club G...",
    "Meta Description": "Looking for information on Shovel Knight: Treasure Trove? Check out the release date (Jun 26, 2014), developer insights from Yacht Club Games, and a com...",
    "Alt Text Image": "Official header image for Shovel Knight: Treasure Trove game - Steam 250760",
    "Canonical URL": "https://gusku.site/game/shovel-knight-treasure-trove",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shovel Knight: Treasure Trove\", \"description\": \"Looking for information on Shovel Knight: Treasure Trove? Check out the release date (Jun 26, 2014), developer insights from Yacht Club Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 26, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yacht Club Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yacht Club Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/250760/header.jpg?t=1644022538\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}