{
    "AppID": 870200,
    "Name": "SimpleRockets 2",
    "Release date": "Nov 8, 2018",
    "About the game": "SimpleRockets 2 is a fully 3D space sim that lets you build rockets, airplanes, rovers, or anything you can imagine and explore highly detailed 3D planets. Sharing is a core concept in SR2 and it has built-in capability to easily share crafts, saved games, and even planets with the community. With SimpleRockets 2, it is easy to get started, but advanced players can dig into technical details if they are interested in the math behind rocket engines and orbital mechanics. Included are 17 different challenges to put your creations to the test. This is actual rocket science! Join us as we enter Early Access and continue adding new features, such as a Campaign Mode. We want to make sure we are building a game that players will love, so if you have suggestions for the game, we want to hear them . Those who followed our work on SimplePlanes know that we are highly responsive to player feedback. We are taking this a step further with SR2 and have set up a Roadmap page to open up our development process and be as transparent as possible. Build crafts by snapping parts together. Choose from the pre-built engines, such as the Mage, which is a powerful kerosene-fueled engine. Or choose the very weak, but highly efficient Ion Engine. Or you can dig deeper into the complexity of rocket science and design your own rocket engines. Choose from the eight available engine types, seven nozzles, and six fuel types. From there you can change engine size, nozzle length, throat radius, and chamber pressure, which allows for endless combinations of engines. Use interstages to split your craft into multiple stages and piece together modular fairings to protect your precious cargo. Launch multiple crafts into orbit. You can dock with your existing crafts to build space stations, moon bases, refueling stations, and more. Take photos of your journey across the solar system with the built-in Photo Library tool. Stretch and shape fuel tanks, wings, cargo bays, fairings, and nose cones with easy-to-use tools that help you create exactly what you want. Resize solar panels, landing gear, pistons, jet engines, etc to fit your needs. Paint your craft custom colors and tweak their reflectiveness, emissiveness, and texture styles. Rocket science is hard, so you might run into the occasional, rapid unscheduled disassembly (i.e. explosion). It happens to even the most experienced rocket surgeons. Might as well embrace it and take advantage of the opportunity to snag some spectacular photos. Easily drag and drop code blocks to program your crafts to log telemetry, automate them, design your own touch screens, etc. With Vizzy, a programming language designed specifically for SimpleRockets 2, you can expand the capabilities of your crafts while learning programming, maths, physics, etc. Using Planet Studio, an in-game design tool, you can make your own planets, stars, moons, and stellar systems, starting with a large set of templates and tools to easily make infinite unique procedural celestial bodies. For the more adventurous, Planet Studio has an advanced mode with many modifiers to add and tweak different noise layers, adjusting the terrain and the biomes, as well as a paintbrush tool to be able to achieve the most complex shapes. Orbits are realistically simulated and support time-warp so you don't have to wait several months to reach another planet. The Map View makes it easy to see your orbits and plan future burns, which you can use to set up future encounters with other planets or satellites. The flight model dynamically updates the drag and lift characteristics of your craft as it changes. Re-entry effects kick in when you're screaming through an atmosphere at hypersonic speeds. Be careful, because the excessive heat can cause those aforementioned rapid unplanned disassemblies. Download from a huge collection of user-uploaded crafts, sandboxes, planets, and mods on our website . Upload your own crafts and sandboxes and share them with the community. Rise through the ranks from a white level builder to a gold level builder and beyond. FEATURES Fully 3D Rocket Designer that allows building anything from basic rockets to very complicated multi-stage rockets, airplanes, rovers, satellites, robotic mechs, etc. Simple to get started, but advanced players can dig into the technical details if they are interested in the math behind rocket engines and orbital mechanics. Design custom rocket engines and jet engines Realistic rocket physics and orbital mechanics. Program your rockets with Vizzy, a Visual Programming Language, to automate basic flight maneuvers. Download community-made mods, planets, crafts, and sandboxes. Includes full controllable astronauts, or space sailors, equipped with jetpacks and a grappling hook. Over 30 parts, including fairings, retractable solar panels, procedural landing gear, RCS, gyro, etc. Highly procedural parts that can be resized and reshaped into endless combinations, such as the resizable fuel tank and the cargo bay. Map View to navigate the solar system that displays predicted orbits and encounters. Fully 3D, rotating planets that support water and multiple biomes, such as desert, grasslands, tundra, etc. Persistent sandbox that retains your previous launches. Online community where players can upvote and comment on other players' content. Several Build and Flight Challenges. Parts support textures, reflections, and custom coloring. Flight model dynamically updates drag and lift characteristics of your craft as it changes. Re-entry effects including visual effects and part damage from heat. The Nav Sphere makes it easy to control your rocket's heading. The traditional Navball (FDAI) provides vital attitude information. Custom Launch Locations allow launching from multiple places in the solar system. Support for saving custom subassemblies. Crafts can dock together in orbit and transfer fuel. Built-in tutorials show you how to build a craft and how to achieve orbit. Time-Warp allows fast-forwarding while in orbit. Ion Engine supports burning during time-warp. Supports transferring fuel between tanks and advanced fuel management such as fuel cross feeds, priority, etc. Performance Analysis window makes it easy for advanced players to see how their craft's Delta-V, TWR, engine Isp, etc are changed as they build their rockets.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/870200/header.jpg?t=1643649063",
    "Price": 14.99,
    "Developers": "Jundroo, LLC",
    "Publishers": "Jundroo, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_f2851e4861ec89a1caeafb459e1c51a598349533.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_92257a94efb807020b2803b6076a6c822f6babdd.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_1928929a421d4d6e86d4a52eb3ec94bf389398ec.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_89bc31eee127040af0e4fbc3b059e1e52f6993dd.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_a8ea81a41809ee0a01e297e62393b1e68d500d81.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_71ec9df80bfba52eac13a0ee49fe6e60d905b3c8.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_2fdea813f97639823e4263e75204da07c2925ac0.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_e1a90cd74e06ee57ac2df35b876c05a8a3721707.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_784c9a59f08bd1d111ccf84db9306b5901dabf0a.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_b2e8d263d42a4b53a16f341274de1de816d681e3.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_6139980ace6511d5549bfdcc9a3e378ccc7a8c64.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_537a4dd97a1f75a83f0e92d250f2bf3480d645fa.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_c7d066fd1851c5e84feb703afbd0184c7fd49b02.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_b3eae4d774068eeb12ad748b4c53e725335ee4e8.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_e0165eace72655e48f220fbe44d0e616f81cae70.1920x1080.jpg?t=1643649063,https://cdn.akamai.steamstatic.com/steam/apps/870200/ss_368c61e173fc333df9979611989927f8f794e92a.1920x1080.jpg?t=1643649063",
    "Slug": "simplerockets-2",
    "Meta Title": "SimpleRockets 2: Nov 8, 2018, Jundroo, LLC and Full Overview",
    "Meta Description": "Looking for information on SimpleRockets 2? Check out the release date (Nov 8, 2018), developer insights from Jundroo, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for SimpleRockets 2 game - Steam 870200",
    "Canonical URL": "https://gusku.site/game/simplerockets-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SimpleRockets 2\", \"description\": \"Looking for information on SimpleRockets 2? Check out the release date (Nov 8, 2018), developer insights from Jundroo, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jundroo, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jundroo, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/870200/header.jpg?t=1643649063\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}