{
    "AppID": 1864530,
    "Name": "Succubi's Trap Dungeon of Seduction",
    "Release date": "May 13, 2022",
    "About the game": "※ All characters that appear in this game are over the age of 18. 【Story】 The town of warriors, Kazanstall... Kazanstall aimed to bring up fine warriors who could vanquish monsters in the future. Of course, all the young men in town had dream jobs they sought after. Some wanted to be swordsmen, others wanted to be spell casters, martial artists, or monks... One morning, Mirai (the protagonist of this story) woke up and went out in town to greet his childhood friends and fellow monster slayer trainees. Mirai thought that another ordinary day would pass by... However, an incident strikes him out of the blue. A flock of succubi attacked the town. All the men were kidnapped. No one knew what happened to the women. When Mirai woke up, he was inside a prison. He was completely stripped of his weapons and equipment. He looked around the cell and saw his fellow trainees inside... Apparently, the succubi had successfully created their next by camouflaging themselves as humans. The succubi launched a direct assault to prey on the humans, now that they had enough manpower. Mirai, Tsubasa, Kai, and Kaoru... Could these four men successfully escape this nest, and bring peace back to Kazanstall? There are various traps within this nest set up to not allow any escape. Some traps are human-shaped. Other traps are in the form of items... They come in all sizes and shapes. Of course, there is a chance that the men may encounter the succubi. Mirai must go through the nest while fighting and trying to avoid the traps. He must escape, no matter what happens... 【Main Characters】 Mirai Protagonist He has a cute face and is popular with girls. He lost his parents in war and lives on his own right now. Mirai aims to become a spell caster because his father was a profound wizard. Despite his adorable looks, he has a brave personality, and he has the courage to go against life's hardship. Tsubasa Tsubasa wants to become a swordsman. He has a leader-like position within his group of friends. He is incredibly bright and has a cool, collected personality. However, there are times that his body moves before he can think things through. Tsubasa has known Mirai for a long while and has been taking good care of him. Because he cares for Mirai so much, he gets into fights with Marill often. Kai Kai is a passionate fellow who wants to become a martial artist. Just like Mirai, Kai lost his parents when he was younger because of a war. The similar circumstances they share allowed them to become friends. Perhaps because of his eager desire to become independent as soon as possible, Kai is rarely in town. He is usually training every day from dawn to dusk. Thanks to his vigorous training, he is the strongest out of the four men. Kaoru Kaoru is a cowardly boy who wants to become a monk. He takes care of the horses in his barn. He is a son of a rich family. Kaoru cares for his friends a lot and he pursued a career as a monk because he wanted to protect everyone. His mother died of an illness, so there is a part of him that misses her a lot. Marill Marill is the aristocratic daughter of the mayor of Kazanstall. She has known Mirai since they were children. She likes Mirai, but cannot be honest with her feelings. She is worried about Mirai, who has decided to become a spell caster since his parents' deaths during the war. She may look like she has a strong personality, but inside she is quite vulnerable. It's her dream to marry Mirai in the future. She has an older sister who is beautiful and gentle.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1864530/header.jpg?t=1652425286",
    "Price": 5.99,
    "Developers": "ドライドリーム",
    "Publishers": "WASABI entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_c966175faefd2a9cead2ffd0267b9bfd18934e1c.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_ea07c58386bcb87b98f42700b6530a9238b92de4.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_2f4ad4d8068b3f00d5ce7a594a84b0c335711919.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_e7adddf0602b0c8e406aafe4fc83aa50b0866f77.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_20d5bca05b3bd5c9054b5015e647476afb14b81b.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_15d4b0d84c982341701e5d9b12eb92f3a627abe4.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_faac6454dced417934824da67444394505cc1e08.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_be14a251d256efcc80aa6f98fca5d40169073e49.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_502c4d484b9b4ba5b006a21a967c77b43582474d.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_9c9662fac1d5ede653022d1de13664bb16cacfc0.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_33e004590e037a1747ebacefc7497af7ba30fb90.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_fa08e1ee3a47c4c9b763f6d6dce45d7e6f9a3bf3.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_0a3cf58922362bd9c03e80244d32df284da8fa3a.1920x1080.jpg?t=1652425286,https://cdn.akamai.steamstatic.com/steam/apps/1864530/ss_d9abe6ac140244b3a321f901e72e657345b1e830.1920x1080.jpg?t=1652425286",
    "Slug": "succubi-s-trap-dungeon-of-seduction",
    "Meta Title": "Succubi's Trap Dungeon of Seduction: May 13, 2022, ドライドリー...",
    "Meta Description": "Looking for information on Succubi's Trap Dungeon of Seduction? Check out the release date (May 13, 2022), developer insights from ドライドリーム, and a comple...",
    "Alt Text Image": "Official header image for Succubi's Trap Dungeon of Seduction game - Steam 1864530",
    "Canonical URL": "https://gusku.site/game/succubi-s-trap-dungeon-of-seduction",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Succubi's Trap Dungeon of Seduction\", \"description\": \"Looking for information on Succubi's Trap Dungeon of Seduction? Check out the release date (May 13, 2022), developer insights from \\u30c9\\u30e9\\u30a4\\u30c9\\u30ea\\u30fc\\u30e0, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u30c9\\u30e9\\u30a4\\u30c9\\u30ea\\u30fc\\u30e0\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"WASABI entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1864530/header.jpg?t=1652425286\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}