{
    "AppID": 610740,
    "Name": "SuperCluster: Void",
    "Release date": "May 15, 2017",
    "About the game": "SuperCluster: Void is a space adventure RPG. You can explore a massive randomly generated galaxy, Interact with alien factions, Battle massive enemy fleets and even take command of a fleet yourself. Resources can be collected throughout the galaxy to upgrade your ship and its abilities. The story is lighthearted yet dark, filled with plenty of lovable characters and genocide. There are also many secrets in the galaxy of SuperCluster: Void, all waiting to be uncovered by one valiant adventurer who has nothing left to lose. Fight for your people, explore the galaxy, and fulfill your destiny, in SuperCluster: Void. Quests and Exploration SuperCluster: Void allows you to explore your own randomly generated galaxy. There are hundreds of different solar systems for you to explore with their own planets and moons which can be explored to complete quests or gather resources to upgrade your ship. Some of these planets are common and contain common resources such as copper or steel. Others are rare and contain valuable resources such as diamond or uranium. Resources and Crafting Resources you collect can be used to upgrade different parts for your ship or buy a new ship entirely. You can craft weapons, armor, thrusters, and many other upgrades for your ship. Combat and Abilities SuperCluster: Void has many unique alien factions to interact with. Some of these factions will be hostile and attack you while others will work with you and assist you on your quest. Your primary weapon is your ship's guns. These have infinite ammunition and a high rate of fire but relatively low damage. Your ship has a limited number of missiles as new missiles must be crafted from resources you have collected. These missiles have high damage and seek out enemy ships. Finally, your ship has certain upgradable abilities. These abilities are very powerful but have long cooldowns. A few of these abilities include Radial Burst, Quick Regen, and Rapid Fire. These abilities can be bought and upgraded through the use of 'Science' which can be collected by completing quests and leveling up. Commanding your Fleet SuperCluster: Void allows you to command your own fleet of starships. Adding a ship to your fleet will cause it to follow you around wherever you go and fight with you. You can upgrade these ships to increase their shield, hull, and damage or rename the ships in your fleet to whatever you want.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/610740/header.jpg?t=1494872876",
    "Price": 4.99,
    "Developers": "Logan McClure",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_de6a29aabc7207a01cc9618675ad24b51e6418d7.1920x1080.jpg?t=1494872876,https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_0a5e588d61fc3a88dc15fd5546e385a4dffefd4a.1920x1080.jpg?t=1494872876,https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_23fcc12cfeaebfbaf90b944384e6a7073f596f3a.1920x1080.jpg?t=1494872876,https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_8a3a8100baedb66fda60dae72bfe6d701692ad7d.1920x1080.jpg?t=1494872876,https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_2c1123a55f5afa216609703cbe662a923d0e25d1.1920x1080.jpg?t=1494872876,https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_c6950d9885539166e1755fa3c11e2a57ab3086fd.1920x1080.jpg?t=1494872876,https://cdn.akamai.steamstatic.com/steam/apps/610740/ss_fc20a02ba1321f738a8baf72ff55039022193f06.1920x1080.jpg?t=1494872876",
    "Slug": "supercluster-void",
    "Meta Title": "SuperCluster: Void: May 15, 2017, Logan McClure and Full ...",
    "Meta Description": "Looking for information on SuperCluster: Void? Check out the release date (May 15, 2017), developer insights from Logan McClure, and a complete game sum...",
    "Alt Text Image": "Official header image for SuperCluster: Void game - Steam 610740",
    "Canonical URL": "https://gusku.site/game/supercluster-void",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SuperCluster: Void\", \"description\": \"Looking for information on SuperCluster: Void? Check out the release date (May 15, 2017), developer insights from Logan McClure, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Logan McClure\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/610740/header.jpg?t=1494872876\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}