{
    "AppID": 1336060,
    "Name": "TAISHO x ALICE episode 2",
    "Release date": "Sep 17, 2020",
    "About the game": "DUALICE(TAISHO x ALICE episode II) is a fairytale visual novel in which YOU must save your Prince Charming! The game is fully voiced in Japanese (excluding the main character). As you progress through the story, you will be asked to make choices at key points that will lead you to different endings. You will take on the role of the fairytale heroine in order to rehabilitate your chosen love interest and guide him to his 'happily ever after'! At the end of the prologue, you will choose your prince and enter the Looking-Glass World. Each love interest has his own standalone story set in an alternate universe where the relationships between the characters will vary. *Episode 2 features two love interests: Kaguya and Gretel. [Content Warning] Please be advised that this game deals with mature themes including mental illness, self-harm, suicidal ideation, and sexual assault. [STORY] Once upon a time, in a topsy-turvy world... In the beginning, you find yourself lost within a world of utter darkness. Your memories are gone; even your name is a mystery. But just when the bitter loneliness threatens to break your spirit, you meet Alice—a blond-haired, blue-eyed young man who promptly christens you 'Arisu.' Like you, Alice cannot remember anything beyond his own name. Ignoring his protests, you drag him along with you through the darkness... until you happen upon a massive mirror made of crystal. You stumble through the glass and into the Looking-Glass World, an antiquated fairytale dreamscape that feels oddly familiar... There, amid a colorful cast of gender-swapped fairytale characters, you take on the role of the heroine and join them in their twisted tales. How will the story end? It's up to you! ONCE UPON A TIME, a dramatic breakup unfolds at the cafe where you work. Everyone is scandalized—but then the guy turns to you and says, 'Fancy going out with me?' So obviously, you say yes! His name is Kaguya, and he's your new boyfriend. He's everything you could possibly want: sweet, caring, and... HOMELESS?! Day 1 of the relationship, and you're already living together! Where will it go from here?! ONCE UPON A TIME, you awaken to find yourself in a strange, unfamiliar log cabin. But don't worry! Here you have food, clothing, and everything else you need to survive. Only one small problem: you're tied up on the bed... 'We're going to live here from now on, where it's safe.' So begins a life of confinement with your younger brother Gretel. What inspired him to take you captive? What is his true objective? And can you make it out alive?! 【VOICE】 CINDERELLA -- Daisuke Hirakawa RED RIDING HOOD -- Tomoaki Maeno KAGUYA -- Toshiki Masuda GRETEL -- Takuya Eguchi SNOW WHITE -- Syouta Aoi WIZARD -- Wataru Hatano ALICE -- Yoshitugu Matsuoka WOLF -- Natsuki Hanae HUNTSMAN -- Tomohisa Hashizume",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1336060/header.jpg?t=1655957053",
    "Price": 9.99,
    "Developers": "Primula",
    "Publishers": "pencil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_6123952e1d1f59f6243757c4bb0abc25ff756826.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_c6103baeb1362efc3b953649a6ce72953f51820c.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_fa6a16d96d905bd930ca4e77e7a79427c2f6e58a.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_1dd4bbe260a6c5430647adc157dc9aee0ed05861.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_7707da4bc882e82c7ea4e03bb22413c5df5cad92.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_927bf21b6f67d0d0aa7d288c165da32046f9ed48.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_2f6084190b093eeae1f440a4e17fc5b319908360.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_03333acc1e1895aad445a5486f26c16c3f35901e.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_c1cf5639849c03072fb062ec928b4332618920cc.1920x1080.jpg?t=1655957053,https://cdn.akamai.steamstatic.com/steam/apps/1336060/ss_a557fcf871731bb7fb4b06c90bd7b0a88e040697.1920x1080.jpg?t=1655957053",
    "Slug": "taisho-x-alice-episode-2",
    "Meta Title": "TAISHO x ALICE episode 2: Sep 17, 2020, Primula and Full ...",
    "Meta Description": "Looking for information on TAISHO x ALICE episode 2? Check out the release date (Sep 17, 2020), developer insights from Primula, and a complete game sum...",
    "Alt Text Image": "Official header image for TAISHO x ALICE episode 2 game - Steam 1336060",
    "Canonical URL": "https://gusku.site/game/taisho-x-alice-episode-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TAISHO x ALICE episode 2\", \"description\": \"Looking for information on TAISHO x ALICE episode 2? Check out the release date (Sep 17, 2020), developer insights from Primula, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Primula\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"pencil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1336060/header.jpg?t=1655957053\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}