{
    "AppID": 322300,
    "Name": "The Repopulation",
    "Release date": "Dec 22, 2014",
    "About the game": "The Repopulation was re-launched in February 2017 in the same state that it was taken down, in December 2015. The new development team is fixing and patching all elements in order to improve gameplay and reduce the amount of crashing. This has also resulted in a delay of patches, so game updates may be slow-going at first as we are doing a very large overhaul of back end systems. The Repopulation is a science fiction sandbox MMORPG which is currently in Early Access and early alpha testing. You should only consider purchasing the Early Access for this title if you are okay with bugs, crashes, possible interruptions of service, and in some cases fluctuating features, as well as to support the development of the game and help up us build it. The Repopulation is about player's choices in the way they play: being able to do Player vs Player or avoid it altogether, the ability to do Crafting and concentrate on it, or build your own home, having the freedom to advance your characters in a number of ways and not just through combat. Key Features Currently Available In Early Access Sandbox-driven gameplay which never forces you down a specific path. Skills-based advancement with over 75 skills including combat-oriented, diplomatic, rogue, entertainment, trade skill, pet, survival, and other advanced skills. Advanced trade skill systems which allow for a high degree of customization in crafted goods. Players can switch between RPG Mode or Action Mode combat at any time. Action Mode controls like a shooter, but is built on top of RPG mechanics. Create homes and build cities complete with vendors, props and defensive units. Dynamically-generated content which will change based on how players react to the world. Unique three-faction PvP system, where the third faction is allowed to set its alliances on a nation by nation basis. PvP is entirely optional with much of the world being protected from it and players being able to progress entirely without ever getting involved in PvP. Advanced generated mission system provides a never-ending stream of missions which are customized for your character. They are purely optional. Social-oriented features which provide bonus rewards when grouping or working together with other players. Vehicle system allows you to upgrade and custom tailor your vehicles, even adding abilities such as Shielding, Mines, Turbo Boost, or Combat abilities. Three different pet systems: Genetic Engineering, Taming, and Robotics. Engagement system which is similar to a mutating form of Public Quests. Persistent Seamless World. Key Upcoming Features DirectX 11 Support. Hardcore server ruleset. Re-integration of the Siege system. Underground levels for player-created cities. Audio improvements as we move some systems from placeholder to final. Ease of use features to make the game easier to grasp for new players. Host Player Created Tournaments in your cities. Raid Interface. Microtransaction support for cosmetic and fun items. City Perks system. Graphical improvements, performance optimizations, additional FX, and general polish. Balance, feature refinement, bug fixes and content. Engine upgrades to take advantage of the most recent versions of Hero Engine. Server Availability Being an MMORPG the only way to play the game is online. We currently provide both US and EU servers and they are available as long as there is no scheduled maintenance or unforeseen issues that do arise during development and testing. We strive to keep the servers up and running as much as possible, but, as with any MMO, patching is needed and will require the servers to be down during the process. There might be other times when the servers are undergoing maintenance and will require downtime; we will try to effectively communicate this as much as possible. There are no current plans for player ran servers or single player options. 3rd Party Account This game requires a 3rd party account to play. A key will be given to you by Steam to activate the account so you can see the list of available servers to play. Please be sure after you purchase the game to create your account and register the key. A Stand-Alone client will also be available for purchase via the game’s website in the near future. Packages All package options are subject to change Currently we have a single package option available: Silver Package - Includes Name Reservation*, 1 Repop Token**, Early Access and Access to City Council and Nation Leadership options. Eventually we will be opening up 2 more package options: Gold Package - Includes Silver membership, a total of 2 Repop Tokens**, 1-day Head Start and Ability to become a city mayor and run a player city. Platinum Package - Includes Silver and Gold membership, a total of 3 Repop Tokens**, a total of 2 days of Head Start and Ability to create a new nation. *Name Reservation is the ability to reserve 1 in-game character name tied to your account, across all servers. **Repop Tokens will be exchangeable for in-game items as a thank you for supporting us. Instead of giving specific ones at each level we will offer you tokens and you will have a choice of different options, with some costing more than 1 token. These items will be cosmetic in nature only and will not give you any additional functionality or power over other players. Examples of what you can expect are: equip-able shell items such as armor, weapons, and clothing, a special edition vehicle, and trinkets and even special buildings for your housing and nation. You may upgrade your package options when other packages are available. At some point before release the Silver, Gold and Platinum memberships will be enabled in-game and offer the following: Additional Character Slots, Inventory Slots, Bank Slots, Shared Bank Slots, Mission Slots, and Auction Slots. The exact quantity of these slots are still being determined based on usage and feedback. In the future we will be enabling microtransactions in-game for cosmetic and fun items.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/322300/header.jpg?t=1622904401",
    "Price": 19.99,
    "Developers": "TGS Tech",
    "Publishers": "Idea Fabrik",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_0e93be95ccc80b6d434c6ae80ab7110889a62387.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_8e56e2a217a00a685effdfd6e9ae607a67b1effe.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_1db02841457b21c01408d51289a0bf7e883e3d92.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_718e8ebc654bcbacf384fad997b298e5a488cc57.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_050ab32e6e8cd0773d38a4ab596213fa33f4e439.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_bf683e76720caeffee26dc3223511c2e767d3851.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_a724371efb45d55426440d46a89fce025a6009a2.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_595492fa96ad9311c474e4c16561fa7062a34937.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_c3fbeac680a973c088097130304c6202e65a02d8.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_2fb0090ed7d26e81eea59371bab396bd98548b5e.1920x1080.jpg?t=1622904401,https://cdn.akamai.steamstatic.com/steam/apps/322300/ss_8b7241e0e572f21ab4ab29b578c0ea5cc3e26c67.1920x1080.jpg?t=1622904401",
    "Slug": "the-repopulation",
    "Meta Title": "The Repopulation: Dec 22, 2014, TGS Tech and Full Overview",
    "Meta Description": "Looking for information on The Repopulation? Check out the release date (Dec 22, 2014), developer insights from TGS Tech, and a complete game summary.",
    "Alt Text Image": "Official header image for The Repopulation game - Steam 322300",
    "Canonical URL": "https://gusku.site/game/the-repopulation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Repopulation\", \"description\": \"Looking for information on The Repopulation? Check out the release date (Dec 22, 2014), developer insights from TGS Tech, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"TGS Tech\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Idea Fabrik\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/322300/header.jpg?t=1622904401\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}