{
    "AppID": 1162400,
    "Name": "The Climate Trail",
    "Release date": "Dec 16, 2019",
    "About the game": "Survive and stay alive as climate change ravages the earth! Escape to a more hospitable location with the limited resources you have and increasing heat scorch your homeland. Do you have the necessary survival skills to reach your destination before your time and resources run out? Join us in this thrilling, RPG adventure now! What is climate change and how does it happen? How does climate change affect the world, especially in America? You can learn all about it while playing this RPG adventure game. You can learn the devastation that is caused by climate change and how it turns an area that was once green into inhabitable places for humans. Wildfires are getting wilder, the land is completely dry, and there is no water to be found. Your entire home and the surrounding area has become a wasteland. It feels like it’s apocalypse now! It might even be the last day on Earth. Your only hope is to flee to Canada where the land is still lush and green. === FEATURES OF CLIMATE TRAIL: === ● 100% FREE and NO ADS! Our aim is to educate people while telling a compelling storyline and engage you in an addictive RPG adventure game. That’s why this game is totally FREE and without ADS! Immerse yourself in this post-apocalyptic world with no distraction. ● IMMERSIVE STORY AND GAMEPLAY Experience what it feels like to be one of the few survivors in a very inhospitable environment. Learn how to survive in the most dire situations. Know how to use very limited resources to stay alive and make the journey to your destination. You will feel every desperation, urgentness as your resources grow less and less. and joy when you successfully face the challenges on the way. You will also feel and learn about how climate change will affect every last human being on the planet. ● GREAT CHALLENGES Maybe you’ve played a lot of survival and shelter building games. Even if you are a seasoned player, you will still need to think and strategize to be able to make it alive in this game. If you are a beginner in survival games, don’t worry. It will be a great way to learn tactics, strategies, and exploring all possibilities. Climate Trail is a great game to train your problem-solving skills. ● EDUCATIONAL GAME Our mission is to educate everyone about the cause and the effects of climate change. You will learn the scientific facts about what’s currently happening to our earth. Then, we hope you use the knowledge to change your habits and lifestyle to prevent the condition becomes worse much faster. ● GREAT GRAPHICS AND GAME DESIGN Climate Trail is created by an industry veteran who was the technical producer on such classics as 'The Return To Zork,' 'The Pyramid of Peril,' and some of the first mobile games. We worked hard to make sure this game has a great graphic and enjoyable to play. So, what are you waiting for? Are you ready to play as a climate refugee and survive all the obstacles? Download and play Climate Trail NOW!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1162400/header.jpg?t=1576561249",
    "Price": 0.0,
    "Developers": "William Volk",
    "Publishers": "Deep State Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_a450664ca8f1cd505a4c1fa336afea1acb37d03b.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_58817efea67146e9842181d2b4fab8e8f178db80.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_1a68f372f027b2e5db7c79db380153ef926ead5b.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_bfd15f025b371b3f2a4f26dc9334184ff93af749.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_3a209d3c2f6d6e81cc55a1faf08e21f31fae68de.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_42c1f14f4c5092620b7b71314a3f17106c771d53.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_67a6be701ea3947d7afbc9e8a78330296d2d7f61.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_688f1188b4f02a04e1cf14dfed2e32e524bf5ca2.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_77d4a2c2e1e078c5711419e0c10be3549a5d9aa9.1920x1080.jpg?t=1576561249,https://cdn.akamai.steamstatic.com/steam/apps/1162400/ss_9264912d3157a0a628451268a3a26322a9b033d3.1920x1080.jpg?t=1576561249",
    "Slug": "the-climate-trail",
    "Meta Title": "The Climate Trail: Dec 16, 2019, William Volk and Full Ov...",
    "Meta Description": "Looking for information on The Climate Trail? Check out the release date (Dec 16, 2019), developer insights from William Volk, and a complete game summary.",
    "Alt Text Image": "Official header image for The Climate Trail game - Steam 1162400",
    "Canonical URL": "https://gusku.site/game/the-climate-trail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Climate Trail\", \"description\": \"Looking for information on The Climate Trail? Check out the release date (Dec 16, 2019), developer insights from William Volk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"William Volk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep State Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1162400/header.jpg?t=1576561249\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}