{
    "AppID": 1811780,
    "Name": "Throne And Crown",
    "Release date": "Dec 7, 2021",
    "About the game": "Throne and Crown: A 2d action oriented RPG with ambitious plans. It will starts out as your standard overland combat game with RPG elements. It is both hardcore and casual because the hardcore can push themselves, but casual can just chill and still progress. Progression happens for everyone. If you push at it, you'll power up eventually and get strong! This makes it both fun for everyone, but also encourages people to try and never give up in life. I'm an oldschool hardcore gamer. I appreciate watching my skill increase, but those old NES and Atari2600 games, you started with nothing if you lost. In Throne and Crown, every bit of experience, you retain! This means even if you play badly for a while, you'll still get your character stronger. The mix of you gaining in game power + your real video game skill growing(even if you don't notice), means everyone can progress. You gotta just not give up! Just like life. Features: Critically Acclaimed music sound track(People love this game, but the sound track is a banger hit even for top AAA games) Random Rares Bosses that thinking helps but is not required to win vs Statistics Leveling up To train skills, you must find the trainer. There are hidden secret trainers, and even dark arts trainers Cut Scenes that aren't long, but fun Wide variety of zones to adventure through Puzzles which can be brute forced if you're strong enough Nature and calming - I have adrenal fatigue and playing this game is soooo chill. Good for kids or those with stressful lifestyle. Kid Friendly &amp; awesome for hardcore gamers. I have 150,000 hours gaming. I'm a soul gamer, trust me on this one. Choices in game determine your path of your character's progression. Not all statistics are easily seen. Not all things that are seen are real. And not all things that are real are seen. Future update hopes: Random dungeons, fortress defense, pets, and maybe eventually have you command an army of up to 1000 entities. Some people get bored with RPGs because once you have nearly the best equipment, you're no longer upgrading your character often. When you have a 1000 people in an army, even medium caliber rares could be used by someone on your team. I plan on making the power curve keep advancing with no maximum or level cap. Experience needed to gain a level is in a Fibonacci sequence. Random rares will have the chance to get outrageous values, but only with outrageous rolls. The game will eventually be multiplayer so you can trade lewt and fight along side each other. I don't want to give away too much though. If you've played the Angband, Zangband, and other silly bands, you've seen weird situations that aren't popular to gaming, but are fun. Many roguelikes aren't popular because they're text based gaming instead of having graphics. When these games go to big publishers and get fancy graphics, the play style often gets dumbed down so they're really easy and boring. I plan on having the agility of a single developer vs a corporate suit game designer. I have a team of artists and they're helping get me the tools to succeed. I also have over 2000 hours of code in this 2d action engine!!! This game will be released in episodes. The first episode will have you washed up on a shore by a monastery. I won't give anything out past that. I don't want to give spoilers. The second episode should have pets that can fight with you and maybe random rares. The third episode might have a deep random dungeon or a fortress to defend. The fourth episode will have multiplayer. Each episode will have new features. This way the game is playable asap instead of having one of those classic too long development cycles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1811780/header.jpg?t=1638878353",
    "Price": 0.99,
    "Developers": "James Sager,Brian Mclendon,Tuomo Untinen,Team Don Corgi,Yamillian,Garrett Wessner,Rob Somerfield,Jacob Wilkins,Janet Banerjee,SithJester",
    "Publishers": "James Sager",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_7b3b26b9116cbf74ef84fda47d74f90870767b59.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_f9a35c145af8e30c8a2ebbf4591cfa120f4c301f.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_0253904798521bfe01231299d1dec36e392a0003.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_a5fe65125dc7f31ddd2aa5b287610fa66c969223.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_519afc6b0a7b483386ed48a8803246644c6b9871.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_8276ce59bef6c789c7898cdf12031fbae81ba170.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_50f2ff7d7ec20901a41fb336cf6541a4261806d1.1920x1080.jpg?t=1638878353,https://cdn.akamai.steamstatic.com/steam/apps/1811780/ss_f25ffaed4ff27d0df89a879dd2cec1e0dcbd5abf.1920x1080.jpg?t=1638878353",
    "Slug": "throne-and-crown",
    "Meta Title": "Throne And Crown: Dec 7, 2021, James Sager,Brian Mclendon...",
    "Meta Description": "Looking for information on Throne And Crown? Check out the release date (Dec 7, 2021), developer insights from James Sager,Brian Mclendon,Tuomo Untinen,...",
    "Alt Text Image": "Official header image for Throne And Crown game - Steam 1811780",
    "Canonical URL": "https://gusku.site/game/throne-and-crown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Throne And Crown\", \"description\": \"Looking for information on Throne And Crown? Check out the release date (Dec 7, 2021), developer insights from James Sager,Brian Mclendon,Tuomo Untinen,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"James Sager,Brian Mclendon,Tuomo Untinen,Team Don Corgi,Yamillian,Garrett Wessner,Rob Somerfield,Jacob Wilkins,Janet Banerjee,SithJester\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"James Sager\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1811780/header.jpg?t=1638878353\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}