{
    "AppID": 1097770,
    "Name": "Aeolis Tournament",
    "Release date": "Jul 16, 2020",
    "About the game": "What is Aeolis Tournament? Aeolis Tournament is a 3D party action game where up to 8 players compete in various game modes based on a simple one-button mechanic. Characters use an air cannon to control the power of the wind and affect their surroundings. It features physics-based gameplay, a tournament mode and local and online multiplayer play. The core of the gameplay is based on a simple one-button mechanic. Characters hold an air cannon that allows them to vacuum air in and release it as a blast. It can be used in various ways: pushing an opponent, grabbing, holding and throwing items as projectiles, navigating on slippery surfaces by giving yourself a push, etc... That mechanic is creatively used in each game mode and helped design games with a fresh feel despite being relatively familiar premises. It adds a depth layer to seemingly simple games. Meant as a friendly competitive experience, everyone will be able to enjoy themselves playing Aeolis Tournament. However, skills matter. Games are skill-based, varied and deep enough so that while the main mechanic is shared between each modes, the skills and strategy required are wildly different. Team game modes even add some cooperation elements to the mix! The difficulty curve is so that the game is as enjoyable for a family with young children who want a simple fun game and experienced gamer friends hanging out who want a friendly (or high-stakes) competition. The heart of the game is the tournament mode where players will compete in a succession of games earning tournament ranking points after each of them. Whoever has the most points after the set number of games wins the Tournament. And bragging rights. Even when cooperation is asked of you during team games, you'll probably want to be the team MVP so you can earn more points so... even more competition! Progression and customization: By completing in-game achievements, the player will be rewarded currency to use to unlock in-game content. Character skins, game customization settings, an additional game mode, accessories for characters to wear and more! A configurable experience, local or online: Solo against our AI, on the couch against friends, online against players all around the world or with a bunch of friends against strangers online! Different chaos events in each game modes: Storm with thunder strikes, mudslides, lava geysers, falling meteors, air-dropping crates and blizzards will spice up gameplay and ensure that every game is different. Destructible and interactive environment: Physics-based gameplay means that with enough force, you'll be able to break decor elements to reduce them to rubble! You can then pick up the pieces and use them as projectiles. Power-ups: Power-ups spawn in each environment allowing you to get temporary effects like Speed Up, Force Up or Range Up to give you the crucial advantage to win the game! Stats: Game stats are shown at the end of each game. For each game modes, 3 stats are registered. Vast controller support on PC: Use of the Rewired plug-in for Unity and some in-house work means you'll be able to play on PC with most controller you can get your hands on.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1097770/header.jpg?t=1595508848",
    "Price": 14.99,
    "Developers": "Beyond Fun Studio",
    "Publishers": "Beyond Fun Studio,NA Publishing Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_11abe98b9f892af00dd18639e00db33cca7c54d5.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_c5f3571783249f1f125740588b5d7fd08d30ea5e.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_fee9c645511c584267d8c29897c13b095781066f.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_b5377724887753fb49a9ca581fa257349ce7f902.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_42251bcce0e845f0a4413a486dfe412ecd5eacba.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_e482d9099844fcf8491273d8d2e7a63f824b4529.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_7e2d8aa506652120ca5c3b6d31531edf93e7d643.1920x1080.jpg?t=1595508848,https://cdn.akamai.steamstatic.com/steam/apps/1097770/ss_9be63ebc4d02239eab0d63fe4978c2078fb5d58e.1920x1080.jpg?t=1595508848",
    "Slug": "aeolis-tournament",
    "Meta Title": "Aeolis Tournament: Jul 16, 2020, Beyond Fun Studio and Fu...",
    "Meta Description": "Looking for information on Aeolis Tournament? Check out the release date (Jul 16, 2020), developer insights from Beyond Fun Studio, and a complete game ...",
    "Alt Text Image": "Official header image for Aeolis Tournament game - Steam 1097770",
    "Canonical URL": "https://gusku.site/game/aeolis-tournament",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aeolis Tournament\", \"description\": \"Looking for information on Aeolis Tournament? Check out the release date (Jul 16, 2020), developer insights from Beyond Fun Studio, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beyond Fun Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beyond Fun Studio,NA Publishing Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1097770/header.jpg?t=1595508848\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}