{
    "AppID": 863290,
    "Name": "Balance of Soccer",
    "Release date": "Dec 11, 2018",
    "About the game": "This is a soccer strategy simulation game with 3D scenes and real-time control. You can win by controlling the player ,or defeat the opponent by setting a reasonable team tactic. ---------------------------------- Basic game process ------------------------------- ● After entering the game, the player will automatically play through AI thinking, you need not do anything, just observe the two teams. ● You can take over the AI at any time and perform complete control on the team members, such as dribbling, passing, shooting, tackle, or any teammate's running. ● You can also set up formations, tactics in the game like a coach, you can also pause the game and make a tactical board-like instant placement. In general, as a gamer you can switch between the coach and the player's character freely. ------------------------------------ Game mode -------------------------------------- ● 2020 European Cup schedule. ● 2018 World Cup schedule. Contains the complete 2018 World Cup 32 Finals. 22 teams that not entered the finals, including Italy, the Netherlands, the United States, and China, can also be selected to reach the final through a round of Wild Card games. ● Online battle , adopting a unique mechanism for simultaneous home and away games. During the game, your team's ability, formation, and tactics will be synchronized to the opponent's away game, the opponent competes with your AI team; also you are also against the opponent's AI team at home. The formation and tactical adjustments in the game will be sent to the opponent's game immediately. The result of the match is determined by the combined scores of the two games at home and away. ------------------------------------ Features --------------------------------------- ●Classic realistic style 3D stadium and players, player AI behavior and the game process as close to reality as possible. Completive football elements such as throw in, corner kick, offside, foul, free kick and penalty kick. There will be extra time and penalty shootout in the knockout stage! ●Players Players have 10 types of abilities (eg, ball, pass, shot, speed, physical strength). Each player's ability value consists of two parts: basic ability and team promotion ability. The base ability value can be upgraded for players; Through the unique team's ability promotion and distribution mechanism, the ability value can be freely assigned to any player in the team. Players can also customize the attributes including name, height, etc., so you can build the player you want! ● Team There are over 50 regular or unconventional formations (such as 4-2-4) available for free selection. Provides 10 of the most intuitive tactical options, each of which may change the style of the team and the performance of the player's AI. The formation and tactics will take effect in real time after being modified in the game. It will be synchronized in online battles. ●Unique and convenient operation No need for a joystick, one-click and swipe to complete real-time control of the entire team. Mode 1, click the 4 buttons at the bottom of the screen, like the field coach sends instructions to the players to pass, shoot, tackle, etc. Mode 2, by directly clicking and swiping on the court, you can accurately pass and move. Ball holder: Dribble according to the direction of dragging on the field; Click on the field to pass the ball to the click position . Teammates: Run according to the route of dragging; While in defense, clicking on the field will make one player to run to the click position. In this way, you can precisely control multiple players at the same time, so that you can organize attacks or defenses according to your own ideas. ●Pause The pause button in the lower right corner of the game can suspend the game, so that the player's actions can be precisely controlled. ●Skill System After the skill points below increase over time during the game, you can use the corresponding skills There will be no repetition of any matches! We hope you can have fun with soccer!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/863290/header.jpg?t=1596251945",
    "Price": 4.99,
    "Developers": "Stepiral Studio",
    "Publishers": "Stepiral Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/863290/ss_39a4d9d81e2edf87b804d140b61044688c4850ed.1920x1080.jpg?t=1596251945,https://cdn.akamai.steamstatic.com/steam/apps/863290/ss_f2dc65d12c1725e8214f933fd2e0b3ea40e704e6.1920x1080.jpg?t=1596251945,https://cdn.akamai.steamstatic.com/steam/apps/863290/ss_9fbb996ef9aa0f681969ba63cc371fe368e2cebe.1920x1080.jpg?t=1596251945,https://cdn.akamai.steamstatic.com/steam/apps/863290/ss_a8f590695568c52a1545eb2cc6bd39d35f09bccb.1920x1080.jpg?t=1596251945,https://cdn.akamai.steamstatic.com/steam/apps/863290/ss_dc3c9bc621bd8428945f1f44a9196658cefd8a67.1920x1080.jpg?t=1596251945,https://cdn.akamai.steamstatic.com/steam/apps/863290/ss_8ef11ebe8f1e2500e12714d8022b085ab3b5ed20.1920x1080.jpg?t=1596251945",
    "Slug": "balance-of-soccer",
    "Meta Title": "Balance of Soccer: Dec 11, 2018, Stepiral Studio and Full...",
    "Meta Description": "Looking for information on Balance of Soccer? Check out the release date (Dec 11, 2018), developer insights from Stepiral Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Balance of Soccer game - Steam 863290",
    "Canonical URL": "https://gusku.site/game/balance-of-soccer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Balance of Soccer\", \"description\": \"Looking for information on Balance of Soccer? Check out the release date (Dec 11, 2018), developer insights from Stepiral Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stepiral Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stepiral Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/863290/header.jpg?t=1596251945\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}