{
    "AppID": 813020,
    "Name": "Broken Ties",
    "Release date": "Apr 13, 2018",
    "About the game": "Viscordia. In this world, peace never lasts. Humans are a chaotic race, with ever changing leaders who have no reason to honor their predecessor's word. In the north, there lies the town of Frost. Brokering a deal with humans, the town grew quickly. It was the perfect place for the new King Kalavant to start his plans to eradicate all of the other races. You have been forced to flee from your home, and must seek out others to help you stop the eradication of the world at the hands of The New Order. In your journey you will travel across Viscordia, meet interesting allies, and perhaps even find romance when your journey comes to an end. Features Low Numbers System Put off by extremely high numbers? I've revamped the RPGMaker system to create a low number system for easier stat management. Realistic Monster Hunting Your everyday creatures doesn't carry sacks of money around in its claws, around its fuzzy waist, or in its pincers. Take the tastiest and shiniest parts and eat them, sell them, or even find an alchemist to turn them into useful supplies. Three Classes Be the Archer: Use quick speed and high chance of critical hits to take out weaker opponents in combat! Be the Soldier: The tank of the adventuring party, take a defensive stance or deal high damage! Be the Sage; Take your time and learn the weaknesses of Viscordias monsters. Attack with the right elements to do massive damage! Unique Skills 75 Available Skills All Allies in the game have their own classes and unique skills, but to truly find power above the rest, you will need to find techniques locked away in ancient artifacts. Five Continents Each presents its own style of environment and enemy types, from the icy vistas of the Arctic Elves, to the maze-like crags of the Dwarven mountains. Extra Features Turn the goo of your slimy enemies into delicious health potions. Feeling tired? Bored? Nap through all those long scenes of dialogue. Everyone needs their beauty sleep. Grind for 40 Health Potions before you even leave the first act. Pay a mercenary gang to deal with a boss fight for you. Hey, you earned that money after all! Listen to the banter of your party members! Not everyone always gets along. Controls Press ALT+ENTER to shift the game into fullscreen. Hold down Shift to run. Press Enter to interact with people and containers. When naming your character, hit X to backspace!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/813020/header.jpg?t=1599093959",
    "Price": 2.99,
    "Developers": "Tninja1337",
    "Publishers": "Tninja1337",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/813020/ss_935baab7527de57d1e92f11709cc8502230a3383.1920x1080.jpg?t=1599093959,https://cdn.akamai.steamstatic.com/steam/apps/813020/ss_5395bcc487084553020fdf6612428a5cccd14e38.1920x1080.jpg?t=1599093959,https://cdn.akamai.steamstatic.com/steam/apps/813020/ss_1f1b54fdf432b91d6c0e5552b736b1f64ffb4044.1920x1080.jpg?t=1599093959,https://cdn.akamai.steamstatic.com/steam/apps/813020/ss_aa3b957563b404519d4d3e52ca202b0c670919c9.1920x1080.jpg?t=1599093959,https://cdn.akamai.steamstatic.com/steam/apps/813020/ss_2994d8b055743c4627966f8da65f5bcecb8abd4a.1920x1080.jpg?t=1599093959,https://cdn.akamai.steamstatic.com/steam/apps/813020/ss_524f466bf9859c794c8e11aad1e4465c1191b743.1920x1080.jpg?t=1599093959",
    "Slug": "broken-ties",
    "Meta Title": "Broken Ties: Apr 13, 2018, Tninja1337 and Full Overview",
    "Meta Description": "Looking for information on Broken Ties? Check out the release date (Apr 13, 2018), developer insights from Tninja1337, and a complete game summary.",
    "Alt Text Image": "Official header image for Broken Ties game - Steam 813020",
    "Canonical URL": "https://gusku.site/game/broken-ties",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Broken Ties\", \"description\": \"Looking for information on Broken Ties? Check out the release date (Apr 13, 2018), developer insights from Tninja1337, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tninja1337\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tninja1337\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/813020/header.jpg?t=1599093959\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}