{
    "AppID": 789660,
    "Name": "Buggos",
    "Release date": "Mar 17, 2022",
    "About the game": "CONTROL THE BUGGOS SWARM! Buggos is an RTS Auto Battler where you evolve your army into the perfect bug fighting force. You control a young hive mind bent on world domination, and your swarm will mostly listen to your every beck and call. Guide your swarms evolutionary path and breed your best bugs for world domination! The humans who occupy the planet will try their best to stop you, and they too will gain new technology and grow stronger. However they are probably no much for your evolutionary strengths and willingness to send wave after wave of Buggos to their death, and take what's yours. FULLY CUSTOMIZE YOUR SWARM! Evolve stronger legs for your Swarmers, thicker armor for your Warriors, or even better brains for your Builder Bugs so they will listen to your commands! With over 90 evolutions to choose from, you can truly customize your swarm! WHY ARE WE MURDERING THE HUMANS?! Life as a murder loving bug hive mind is tough, especially when your parental figure wont let you conquer your own planet. Not to worry however, as you escape from the clutches of your over baring life giver and reach out on your own to take a planet for yourself. Unfortunately there are dirty disgusting humans infesting the fresh ball of dirt you land on, and they will have to be dealt with! HOW MUCH GAME IS IN THIS GAME?! Work you way through the six part campaign gaining evolution points while you slowly take over the human home world! Low stakes strategy, no micro required, meant to be played while leaning back in your chair. That does not take away from the strategy required to assemble, evolve, and manage a Buggo swarm. Over 36 missions of increasing difficulty through 6 different areas As you work your way deeper into the humans resistance they will get stronger and more aggressive, trying desperately to defend their homeland. They will bring their best forces to bare against you, and it’s your job to stomp out all life and take their world for your own. Wave Survival Mode Survival mode where you try to last as long as possible while the humans relentlessly throw wave after wave of forces against you. Gain an evolution point each wave and evolve your swarm to withstand the pressure! Level Editor In game Level Editor for sandboxing and creating your own maps. (Steam workshop functionality currently being built out) WHAT IS PLANNED FOR THE FUTURE? Version 1.2 - New Campaign (Free DLC) Join the discord if you have any questions or feedback for the developer Discord:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/789660/header.jpg?t=1650902161",
    "Price": 14.99,
    "Developers": "Intrepid Marmot",
    "Publishers": "Intrepid Marmot",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_8230fc9a832f673326d380a987568b882f4bd562.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_1b55879b661302d7db66fffbdd333f5dc1f36b94.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_62c9584b27723961d29b14905f6d89877641ced7.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_251e4e3e0473d7648c9abd5c6630076bc69009b2.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_ceb56a37cc4ed552926ca2cb9da207dada4aa549.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_95c974bff6eebfbb8908837c8861da728195554e.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_f9d07e9880c29c9d07e5943fbebc255e6853cc15.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_4fdfdbd742700b05f6081a4ea0c44a802b41b427.1920x1080.jpg?t=1650902161,https://cdn.akamai.steamstatic.com/steam/apps/789660/ss_288f4f83067237d92d5d3bf62317769be7f0fce5.1920x1080.jpg?t=1650902161",
    "Slug": "buggos",
    "Meta Title": "Buggos: Mar 17, 2022, Intrepid Marmot and Full Overview",
    "Meta Description": "Looking for information on Buggos? Check out the release date (Mar 17, 2022), developer insights from Intrepid Marmot, and a complete game summary.",
    "Alt Text Image": "Official header image for Buggos game - Steam 789660",
    "Canonical URL": "https://gusku.site/game/buggos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Buggos\", \"description\": \"Looking for information on Buggos? Check out the release date (Mar 17, 2022), developer insights from Intrepid Marmot, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Intrepid Marmot\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Intrepid Marmot\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/789660/header.jpg?t=1650902161\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}