{
    "AppID": 562540,
    "Name": "Cabals: Card Blitz",
    "Release date": "Feb 8, 2017",
    "About the game": "BUILD THE PERFECT DECK TO WIN FAST, AUTOMATED CARD BATTLES Cabals: Card Blitz is a free-to-play deck-building collectible card game in which you: • Focus on pure, pristine deck-building • Fight super fast 30-second auto-battles • Choose your own path through a non-linear PvE map • Fight in PvP matches without ever waiting for enemies • Fuse existing cards to entirely new ones that can’t be bought • Conquer strongholds and defend them against attackers In Cabals: Card Blitz you pass an inter-dimensional portal to the world of Aea, a strange land of occult magic and steampunk-inspired technology. Your task is to discover powerful cards, build your deck and enter battle with the sinister creatures of Aea. During your adventure, you will engage in a challenging loop of battling new enemies, developing fresh tactics, evolving your cards and re-tuning your decks to achieve victory. DECK BUILDING AND BATTLES Skillful deck building is crucial in Cabals: Card Blitz . The game features a wide array of stunning, HAND PAINTED CARDS to collect, each with their own unique powers and abilities. You’ll need to choose the right combination of cards to defeat different opponents, who all have their own battle strategies. In battle, your cards are drawn automatically and face off against the enemy cards, introducing an exciting chance factor into a skill-based game. After a first battle, you’ll know your enemy’s deck. What’s the probability you should beat it with the correct combination of cards? How many battles should it take you to win? Thanks to the speed slider in battle, you’re in control of how quickly the action happens. Crank it up to maximum for SUPER-FAST 30 SECOND BATTLES, or take it slower to focus on the abilities of your opponent. If you lose a battle, it’s back to the Deck Editor to re-tune your deck for a different strategy, and then leap back into the action. As you collect more cards you’ll use the Anvil to evolve them, creating more powerful versions of your cards. And once you’ve unlocked CARD FUSION, your options expand dramatically, with super powerful new cards to be forged. SINGLE PLAYER AND MULTIPLAYER MODES Cabals: Card Blitz features a rich, single-player adventure mode alongside an instant multiplayer mode. Whether you want to focus on exploring Aea and discovering new cards or on taking on other players in PvP battles is entirely up to you. In the single player mode, you will explore a map of the alternate world of Aea, a vast realm of scorching deserts, icy plains and lethal rain forests. You choose your own path through this world, unlocking new regions by completing battles. You can also conquer strongholds, which will generate daily rewards for you in the form of gold, new cards, and valuable gems. As you proceed through Aea the battles become progressively tougher, ensuring you always have a challenge to face. The player versus player mode sits right alongside single player, so your deck and characters can be used in both. PvP mode in Cabals: Card Blitz is designed to guarantee you always have opponents to face, as you can play against offline rivals. This means NO WAITING around in lobbies for invitations to be accepted, or disappointment if other players drop out of battle halfway through. PvP mode is a great way to test out your deck, earn gold, and climb the leaderboard. And, if another player challenges your deck and you win, you pick up rewards as well! WHO IS THE GAME FOR? • CCG PLAYERS who enjoy the challenge of learning about card abilities and building powerful decks • RPG PLAYERS who relish levelling up their characters and fighting weird creatures • ADVENTURE GAMERS who love exploring unique universes and appreciate beautiful artwork • MULTITASKERS! The fastest CCG in the world is the perfect filler/side game for busy players. • YOUR DOG. Everyone knows dogs love CCGs. THE FUTURE OF CABALS: CARD BLITZ Cabals: Card Blitz is the latest game from Finnish developers Kyy Games and is a follow-up to their critically-acclaimed 2009 release Cabals: Magic &amp; Battle Cards , which earned a hardcore following of CCG fans. Although set in the same universe, the gameplay is very different, with Cabals: Card Blitz leaning far more into deck building strategy and exploration. As a well-established games developer, Kyy are committed to the long-term future of Cabals: Card Blitz and will regularly add new cards, heroes, map regions, events and other features. We’re excited about welcoming the Steam Community into the world of Cabals: Card Blitz . We hope you enjoy this fresh and entirely new take on CCG gaming!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/562540/header.jpg?t=1630348715",
    "Price": 0.0,
    "Developers": "Kyy Games",
    "Publishers": "BISBOG SA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/562540/ss_9d168981329128696770f65b80dc11373533c963.1920x1080.jpg?t=1630348715,https://cdn.akamai.steamstatic.com/steam/apps/562540/ss_c876a9499f9a9c79328768d32a43eb586703baab.1920x1080.jpg?t=1630348715,https://cdn.akamai.steamstatic.com/steam/apps/562540/ss_073e358365a01dc105e1a8110e13e7e820882e85.1920x1080.jpg?t=1630348715,https://cdn.akamai.steamstatic.com/steam/apps/562540/ss_f3f14d0228e6eedf8280321845aa6ae8ee603898.1920x1080.jpg?t=1630348715,https://cdn.akamai.steamstatic.com/steam/apps/562540/ss_a714321efd833c3887927d13c1ef34836de8fa23.1920x1080.jpg?t=1630348715",
    "Slug": "cabals-card-blitz",
    "Meta Title": "Cabals: Card Blitz: Feb 8, 2017, Kyy Games and Full Overview",
    "Meta Description": "Looking for information on Cabals: Card Blitz? Check out the release date (Feb 8, 2017), developer insights from Kyy Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Cabals: Card Blitz game - Steam 562540",
    "Canonical URL": "https://gusku.site/game/cabals-card-blitz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cabals: Card Blitz\", \"description\": \"Looking for information on Cabals: Card Blitz? Check out the release date (Feb 8, 2017), developer insights from Kyy Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kyy Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BISBOG SA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/562540/header.jpg?t=1630348715\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}