{
    "AppID": 1359970,
    "Name": "Citadale - The Awakened Spirit",
    "Release date": "Aug 21, 2020",
    "About the game": "Citadale - Episode 5 - The Awakened Spirit The lands are at peace, after ARION DORLEAC defeated the dark lord Rhogul and his right hand demon, the Incubus, in battle four years ago. During these times of plenty, Arion found himself a feisty young woman to fall in love with - somebody he considers to be his equal and best friend alike. She is also his type, that helps, too. As they prepare for their vows, their wedding is overshadowed by dark clouds as the Succubus, sister of the Incubus and mistress of Rhogul arrives from Citadale island, taunting Arion and forcing him to head to CItadale island and face her in battle, as she thirsts for revenge. Thus, Arion must pick up the Shadow Blade, the legendary weapon that once vanquished the evil Rhogul from these lands and head out into danger once more. Little does he know that there is something much darker at play... Citadale: The Awakened Spirit is the direct sequel to the previous title (The Ancestral Strain) and further moves the series away from conventions and inspirations of the past into new territory. A mix between an action game and an adventure game, you will explore Citadale island as you please, finding items and fighting enemies. You shall search for entrance doors into the various stages - those are linear, hard, action styled levels capped by a powerfull boss monster. Only after you defeated these beasts will the true way into the castle open. But beware: although Citadale island is an open exploration environment, the stages within are hard, long and exhausting. Just the way the Succubus likes it! ------------------------------- Arbitrary List of Features: Bigger, better, bloodier - Citadale at its finest An actiongame with a large serving of Adventure Revamped level mechanics make each stage unique Adjusted and refined player speed and attack range The new checkpoint system helps you on your way - for a price! Tackle the segments in any order you like - or discover Brand new music, stages, enemies and bosses await Still not a Metroidvania ------------------------------- Controller Information: Due to limitations with the engine, some controllers, for example 8bitdo gamepads, may not work properly. There is, unfortunately, nothing I can do about that. Should you have any trouble with your gamepad, maybe try another gamepad or use the keyboard. I apologize for the inconvenience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1359970/header.jpg?t=1638713304",
    "Price": 9.99,
    "Developers": "ERMedia",
    "Publishers": "Plug In Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1359970/ss_ad1d5c985a44334e6d7b8a1bb65d70694cbd376a.1920x1080.jpg?t=1638713304,https://cdn.akamai.steamstatic.com/steam/apps/1359970/ss_7fbc4f654d1bd9885c6c6d9188a5eb1de7326372.1920x1080.jpg?t=1638713304,https://cdn.akamai.steamstatic.com/steam/apps/1359970/ss_8acf672ec49152bb0549712a1d68f3a2e6e05db3.1920x1080.jpg?t=1638713304,https://cdn.akamai.steamstatic.com/steam/apps/1359970/ss_c229369a3d46b4ddc4432b5b440bca057c5c5b65.1920x1080.jpg?t=1638713304,https://cdn.akamai.steamstatic.com/steam/apps/1359970/ss_3161849dd28746dba0e0d6c90baa3a8b545ef37b.1920x1080.jpg?t=1638713304,https://cdn.akamai.steamstatic.com/steam/apps/1359970/ss_1044318f8e617420640f1a0d89cbd7805b12dd75.1920x1080.jpg?t=1638713304",
    "Slug": "citadale-the-awakened-spirit",
    "Meta Title": "Citadale - The Awakened Spirit: Aug 21, 2020, ERMedia and...",
    "Meta Description": "Looking for information on Citadale - The Awakened Spirit? Check out the release date (Aug 21, 2020), developer insights from ERMedia, and a complete ga...",
    "Alt Text Image": "Official header image for Citadale - The Awakened Spirit game - Steam 1359970",
    "Canonical URL": "https://gusku.site/game/citadale-the-awakened-spirit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Citadale - The Awakened Spirit\", \"description\": \"Looking for information on Citadale - The Awakened Spirit? Check out the release date (Aug 21, 2020), developer insights from ERMedia, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ERMedia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Plug In Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1359970/header.jpg?t=1638713304\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}