{
    "AppID": 1597580,
    "Name": "Clid The Snail",
    "Release date": "Dec 15, 2021",
    "About the game": "In a world where only the distant memory of human existence still lingers, you play as Clid, a troublemaking, eccentric snail who has just been exiled from his home citadel. Joined by a faithful and talkative firefly, Belu, you will meet a peculiar gang of outcasts and find a place to call home. Among this new group of friends, you will discover a newfound purpose: Exterminating the mysterious slug plague that is ravaging the land. Clid The Snail is a unique top-down shooter where character-driven narrative and mindful combat take the center stage. Through Clid, you’ll experience a story about exile, friendship, and betrayal, and live the adventures of a troublesome, unruly snail that doesn’t belong. Explore a treacherous world full of threats and challenges, where strategic positioning, precise gunplay, and enemy behavior are paramount to your survival. Discover the truth behind the slug plague corrupting the world and save the land from ultimate ruin. Get creative with your guns, grenades, and unique snail shells to outsmart your enemies. Use the environment to your advantage and learn to position yourself to emerge victorious. A shy hedgehog, a shaman turtle, a mute bat, a ninja frog, and a one-eyed chameleon: these are the members of Alastor. Return home after each quest to rest, stock up on resources, upgrade equipment, and develop friendships. Get to know these unique characters and unravel their past to find out the key to the story. Swamps, desserts, mountains, islands... Each quest will take you to a new location waiting to be discovered. Help the local residents fight off the slug threat and become their hero! And don’t forget to keep a keen eye: Explore every level in search for extra goodies. Powerful threats await you at the end of each mission. You will need to study their behavior, pay attention to detail, and choose your weapons wisely to survive these dangerous encounters. Shooting isn´t always the answer. Use your weapons and intellect to solve puzzles, find secrets, and progress through the story. Sometimes, the answers are hidden in plain sight…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1597580/header.jpg?t=1639583318",
    "Price": 19.99,
    "Developers": "Weird Beluga Studio S.L.",
    "Publishers": "Koch Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1597580/ss_c0f50aae5a24b0b3c48803929e1e96a75891ad94.1920x1080.jpg?t=1639583318,https://cdn.akamai.steamstatic.com/steam/apps/1597580/ss_7f2be08f40d9e1f878be6805df143bff9de2685b.1920x1080.jpg?t=1639583318,https://cdn.akamai.steamstatic.com/steam/apps/1597580/ss_1be306f552b576e0f98c46796c818a9d2360bfcb.1920x1080.jpg?t=1639583318,https://cdn.akamai.steamstatic.com/steam/apps/1597580/ss_301688b66105a992d623f065b7b3315660812e52.1920x1080.jpg?t=1639583318,https://cdn.akamai.steamstatic.com/steam/apps/1597580/ss_a8bcad45a88ddbf49463559ee3498b287689d8de.1920x1080.jpg?t=1639583318",
    "Slug": "clid-the-snail",
    "Meta Title": "Clid The Snail: Dec 15, 2021, Weird Beluga Studio S.L. an...",
    "Meta Description": "Looking for information on Clid The Snail? Check out the release date (Dec 15, 2021), developer insights from Weird Beluga Studio S.L., and a complete g...",
    "Alt Text Image": "Official header image for Clid The Snail game - Steam 1597580",
    "Canonical URL": "https://gusku.site/game/clid-the-snail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Clid The Snail\", \"description\": \"Looking for information on Clid The Snail? Check out the release date (Dec 15, 2021), developer insights from Weird Beluga Studio S.L., and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Weird Beluga Studio S.L.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Koch Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1597580/header.jpg?t=1639583318\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}