{
    "AppID": 1192020,
    "Name": "Cyber Fight Challenge",
    "Release date": "Sep 10, 2020",
    "About the game": "Dear friends! We have prepared a Christmas update of our game! In the new version: rebuild the interface for better responsiveness changed the duration of the match: match lasts two rounds of two minutes add the Shop, where you can buy shorts, gloves and boots for your boxer added the ability to take part in 4 types of tournaments: round robin qualifiers, Olympic - playoffs; Swiss qualifier, Olympic playoffs; easy round robin; Simply Swiss. Every day we plan to hold 2 tournaments for boxers of the Lightweight category. Tournament start time 12:00 and 19:00 (GMT+1) For 12:00 a.m. (GMT+1) tournaments: The participation fee is 50 silver coins The prize fund is formed from the coins paid for participation in the tournament. In such tournaments the winners are divided into 3 places and receive: for 1st place 50% silver coins for 2nd place 35% silver coins for 3rd place 15% silver coins of the collected prize pool For 7:00 p.m. (GMT+1) tournaments: The participation fee is 100 silver coins. The prize pool is determined by the tournament organizer before the start of this tournament. In such tournaments the winners are divided into 3 places and receive: for 1st place 50% golden coins for 2nd place 35% golden coins for 3rd place 15% golden coins of the registered prize pool Before you take part in the tournament, please, read the tournament rules carefully. Round Robin Number of participants: min. 4 players max. 20 players. If less than the minimum number of players have registered for a tournament, such a tournament is canceled. In this tournament, each participant of the tournament must meet each other during the fight. The order of players' participation will be determined by the time of registration to the tournament. According to the results of each fight the participant is awarded a certain number of points. The participant who scored the greatest number of points as a result of all matches is considered the winner. In case of equality of points between two or several participants, the winner is determined in accordance with the regulations on the tournament. For the distribution of places in case of equal number of points, the additional Berger coefficient is applied. Olympic system In this tournament system, the participant leaves the tournament after the first loss of one match. In tournaments of this system an even number of players takes part. In the first round all boxers are ordered by rating. If the rating is the same, the next sign is the number of victories, then the alphabet. Pairs are composed according to the principle: the first from the upper half of the table with the first from the lower half, the second - with the second, and so on. In each round of participants are made up pairs playing among themselves. The participant who won the final bout, becomes the winner. Draw in games of this system is impossible. Winning is determined by the referee's account. If the score is equal, the following conditions apply: - the winner is determined by the last blow (who struck, he won), - in case there are no hits at all, the victory is awarded randomly without rating. 'Swiss system' Number of participants: min. 7 players max. 1024 players. If less than the minimum number of players have registered for a tournament, such a tournament is canceled. The tournament is held without drop out. In each round, starting with the second one, pairs of opponents are selected so that participants who have scored an equal number of points meet each other. In the first round, all boxers are ordered by rating. Pairs are formed according to the principle: the first from the upper half of the table with the first from the lower half, the second - with the second, and so on. If the number of players is odd, the player with the last number gets a point without playing. In the following rounds, all players shall be divided into groups with the same number of points scored. Thus, after the first round of groups will be three: winners, losers and draws. If the group has an odd number of players, one player shall be transferred to the next point group. Opponents for the next round are made up of one point group in the same way as in the first round, the rating principle (the best boxer from the upper half of the group if possible meets with the best boxer from the lower half of this group). At the same time, however, it is not allowed that the same pair participates in the tournament more than one match. With an odd number of opponents, a boxer who has the last number in the last point group (from those who have not yet received a point for a pass), gets a point without a fight. Places in the tournament are distributed according to the accumulated number of points. The participants with the equal number of points are distributed according to the Buchholz's coefficient, which is determined as a sum of points, gained by all competitors of the given player in the tournament. For all types of Tournaments in case of the same result: In the case where the boxers have the same number of points and used other protocols for assigning places for an equal result, the organizer has the right to determine the stronger player himself. ------------------------------- Cyber Fight Challenge Nordville company created a boxing simulator for PC which is capable of traversing gamers to a captivating boxing universe. This simulator allows both to participate in contests in Sit&amp;Go mode and participate in online tournaments in a real boxing ambience and get prizes. If you are a new one in boxing we offer a free and comprehensive boxing training and education. Experienced players will have the chance to play with real players online. We also provide the opportunity to participate in online tournaments with prizes from organizer. The menu for creating your own tournaments is also availabvle in CFC simulator, so it can be used for creating your own cyber-sporting tournaments. Each User has it's own account where User sets the appearence of the boxer, make him unique and one of a kind.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1192020/header.jpg?t=1608837181",
    "Price": 9.99,
    "Developers": "Nordville Technology LTD",
    "Publishers": "Nordville Technology LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1192020/ss_216ef589ee31839d55d81f466ae266b6ddbf2522.1920x1080.jpg?t=1608837181,https://cdn.akamai.steamstatic.com/steam/apps/1192020/ss_e993dd0f841cd745fc3f1fe46413f60f8e5d36b0.1920x1080.jpg?t=1608837181,https://cdn.akamai.steamstatic.com/steam/apps/1192020/ss_04891eb1d1fb6c8f5e15c07f8e03814da01be807.1920x1080.jpg?t=1608837181,https://cdn.akamai.steamstatic.com/steam/apps/1192020/ss_b8243df5e81698bb63f6d381b297d8596995cc1a.1920x1080.jpg?t=1608837181,https://cdn.akamai.steamstatic.com/steam/apps/1192020/ss_4f8b199ebb8ed800fe27fb5615ecbab459c4dc16.1920x1080.jpg?t=1608837181",
    "Slug": "cyber-fight-challenge",
    "Meta Title": "Cyber Fight Challenge: Sep 10, 2020, Nordville Technology...",
    "Meta Description": "Looking for information on Cyber Fight Challenge? Check out the release date (Sep 10, 2020), developer insights from Nordville Technology LTD, and a com...",
    "Alt Text Image": "Official header image for Cyber Fight Challenge game - Steam 1192020",
    "Canonical URL": "https://gusku.site/game/cyber-fight-challenge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyber Fight Challenge\", \"description\": \"Looking for information on Cyber Fight Challenge? Check out the release date (Sep 10, 2020), developer insights from Nordville Technology LTD, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nordville Technology LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nordville Technology LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1192020/header.jpg?t=1608837181\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}