{
    "AppID": 688170,
    "Name": "Denki Gaka's Bombshell",
    "Release date": "Aug 16, 2017",
    "About the game": "Bombshell is a modern take on the classic minesweeper puzzle game. It features both the classic 'Puzzle Mode' and a new 'Panic Mode' where opening empty squares starts a countdown fuse that will detonate the bombs when it runs out unless you mark all the exposed bombs correctly. Bombshell also allows you to choose between the classic game board with a square grid or the new hex grid style board which can be easier for new players. You may also choose from three difficulty levels in all the modes and styles for a total of twelve different game types to choose from. One of the great improvements in Bombshell is the innovative touch/mouse interface. You can still touch quickly or click to open a grid location or long press or right click to mark it as a bomb or with a question mark, but clicking on the numbers can often be much faster and easier. When you touch or click a number next to the proper number of marked bombs it will open the surrounding spaces. More importantly, touching or clicking a number that matches the number of unmarked grid locations surrounding it will mark those spaces as bombs for you all at once. Don't worry, the interface is smart and will prevent you from making mistakes and let's you know when you are attempting to do something that won't work. All of this leads to an improved user experience and much faster game play. Speaking of faster game play, each of the twelve modes supports three different types of leader boards: World Records, Daily Records, and Local Records. World Records are kept on our server and track the three best times ever for that particular combination of play mode, grid type, and difficulty. Daily Records are the top three times each day from around the world. Local Records are the three best times ever on your individual device. And the records are shared among all device types, so, you will be competing with the best minesweepers from around the world on PC's and mobile devices of all kinds. And your score is recorded anonymously, so there is no need to register with any kind of player service to participate. Reading the global records and writing you new best time when you beat one is the only information we pass to and from our server. Your privacy is assured and the leader boards are anonymous and family-friendly! (Daily Records are reset each day at approximately midnight Eastern Standard Time.) Another great feature in Bombshell is our animated 3D board. The numbers that still need bombs identified next to them will slowly bounce up and down. Numbers with the correct number of bombs marked will stop moving. If you mark too many bombs, the numbers with the incorrect number of bombs marked next to them will jiggle wildly to show you your error before you make a fatal mistake! And if you accidentally click a bomb, when it explodes it will trigger the surrounding bombs in an outward cascade. Each of these animated features can be individually turned on or off from the options panel. The options panel also lets you choose which types of sounds you would like to hear so you can customize your experience to be perfect for you. Bombshell is great on desktops, laptops, and tablets! It supports both mouse and touch screen play. Devices with smaller screens will enjoy the ability to zoom and pan on the levels with larger grids. Our goal was to create the best minesweeper game ever, and we are pretty proud of how Bombshell turned out. Let us know what you think in the comments or forums, and feel free to contact our support team if you encounter any difficulties. We want you to love our games!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/688170/header.jpg?t=1502906102",
    "Price": 2.99,
    "Developers": "Denki Gaka",
    "Publishers": "Denki Gaka",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_0eeadbff5e7efc1532c864eb524fc251b31e1203.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_874536493f3c5acb30ebad732ab41bb9dcc2877b.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_61c7d6f4a3b34a8c68721e68803908adc7df5dc6.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_c4082365fe3707b8d5d64296bc574982e14c958c.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_cdb8c894a9cfd5fbb92c6decbb4c131e191f2fd4.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_b6b970358e2f7889191d34844754a19519f066e2.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_4cb7cadbc3d1d2cfe90d2751cd5889265685c4c6.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_23b5584ceadcd70d67fa0973023eea27cff5a8a7.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_9c73bf6c004d70517f0326d476ff1f8ab8c9de75.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_b7d986c30e737263a8a30004b4f1d7c693b4a397.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_8569306a3aa4b1ff3b67191ab527c9714dd61c3b.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_dd5cd4ede6b4182c57208c5e989bedfb025bc7a3.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_031ca6cc543e5bc1c752e98aea5e1e858c25fe12.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_f5ab22d43842138e433c13d120f05122400b4822.1920x1080.jpg?t=1502906102,https://cdn.akamai.steamstatic.com/steam/apps/688170/ss_7caf74f2d635f8a9bbc39b537733162dff50bc8f.1920x1080.jpg?t=1502906102",
    "Slug": "denki-gaka-s-bombshell",
    "Meta Title": "Denki Gaka's Bombshell: Aug 16, 2017, Denki Gaka and Full...",
    "Meta Description": "Looking for information on Denki Gaka's Bombshell? Check out the release date (Aug 16, 2017), developer insights from Denki Gaka, and a complete game su...",
    "Alt Text Image": "Official header image for Denki Gaka's Bombshell game - Steam 688170",
    "Canonical URL": "https://gusku.site/game/denki-gaka-s-bombshell",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Denki Gaka's Bombshell\", \"description\": \"Looking for information on Denki Gaka's Bombshell? Check out the release date (Aug 16, 2017), developer insights from Denki Gaka, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Denki Gaka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denki Gaka\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/688170/header.jpg?t=1502906102\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}