{
    "AppID": 731600,
    "Name": "Heckpoint",
    "Release date": "Apr 9, 2018",
    "About the game": "Part bullet hell, part hack 'n' slash, part rogue-lite action packed insanity with over 70 perks to unlock, 6 worlds to destroy and 7 unique characters, set to a completely original soundtrack, HECKPOINT takes place in the not too distant future. A shadowy organization developing new fuels from dark energy has accidentally ripped a hole in our dimension. The incident caused a ripple effect, creating splintered, glitched versions of Earth. Something else took notice, and interdimensional conquerors began to invade our reality. They use the splintered worlds as gateways, and will stop at nothing until our world is under their control. Fight back the hordes, unlock powerful and devastating weapons. Customize your load-out and head out into the glitch for heart pounding brutal action. Destroy the world, your enemies, everything. Find the obelisk. Can you reach the HECKPOINT? KEY FEATURES Cut a path through eight procedurally generated worlds, destroying the environment and every enemy in sight. Soar the skies, or engage in up-close combat. Defeat the final boss and activate the obelisk to unlock the next world, or hone your skills in Spooky World or T Day! 12 characters with unique personalities, weapons, and abilities 70+ upgrades to stats, weapons, and abilities, unlockable by collecting and trading strange matter found in-game. Hundreds of possible combinations to build in your load-out! Permanently upgrade stats at the Gene Works Destroy grenades and reflect enemy lasers with your melee attacks. Instant karma! Dive out of the sky with a powerful melee attack to smash ground based enemies A frozen world with a treacherous surface. Apocalyptic worlds that naturally rain meteors Elite versions of enemies with increased health and damage who drop more strange matter Try to fly too long above the battlefield and watch as the game punishes you for cowardice with a hailstorm of meteors A mini-boss and unique final boss who guards the path to the obelisk in each level Customize your load-out with up to 8 slots of possible combinations of the 70+ weapons, specials, or stat enhancements to tailor your approach to battle. Four ways to play: three challenging runs, and one endless stream of annihilation. NORMAL - The most accessible way to practice and play. No flying enemies, no deadly glitch field, and only a handful of elites after the miniboss let you get to grips with the game. The catch? Loot isn't quite as valuable. ENDLESS - The battle goes on forever here. There is no obelisk to reach, it is only you against the unstoppable horde. How far can you go? ONSLAUGHT - The number of elite enemies increases. Harder foes and a midpoint mini-boss join the battle and deep in the world rests the obelisk, a strange artifact that destroys and resets the world. WARPATH - The game pushes forward for an even more frantic battle. There is no time to stop and think. Behind you, the glitch field eats up the world. Your skills will be pushed to the limit! An original and expanding soundtrack from Two Iron Fists",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/731600/header.jpg?t=1523427994",
    "Price": 9.99,
    "Developers": "Nodacoy Games,Jadan Bliss",
    "Publishers": "Rooster Republic LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/731600/ss_03c4095464ca09d87cece0c12abd4ac0900b1a40.1920x1080.jpg?t=1523427994,https://cdn.akamai.steamstatic.com/steam/apps/731600/ss_ffb637c2ce3dad4f2ecbf828bb39e191252d6a53.1920x1080.jpg?t=1523427994,https://cdn.akamai.steamstatic.com/steam/apps/731600/ss_671b0965391e5de8f167adeff9151d442c238539.1920x1080.jpg?t=1523427994,https://cdn.akamai.steamstatic.com/steam/apps/731600/ss_c1fea2edb79f2b1fe5e3470081d11337b381d628.1920x1080.jpg?t=1523427994,https://cdn.akamai.steamstatic.com/steam/apps/731600/ss_cd1a3d253e20d658cf86c88fdf4c70182bdecf29.1920x1080.jpg?t=1523427994,https://cdn.akamai.steamstatic.com/steam/apps/731600/ss_d4bc18a9a9ed870102d585cb87dddf13464ef996.1920x1080.jpg?t=1523427994",
    "Slug": "heckpoint",
    "Meta Title": "Heckpoint: Apr 9, 2018, Nodacoy Games,Jadan Bliss and Ful...",
    "Meta Description": "Looking for information on Heckpoint? Check out the release date (Apr 9, 2018), developer insights from Nodacoy Games,Jadan Bliss, and a complete game s...",
    "Alt Text Image": "Official header image for Heckpoint game - Steam 731600",
    "Canonical URL": "https://gusku.site/game/heckpoint",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heckpoint\", \"description\": \"Looking for information on Heckpoint? Check out the release date (Apr 9, 2018), developer insights from Nodacoy Games,Jadan Bliss, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nodacoy Games,Jadan Bliss\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rooster Republic LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/731600/header.jpg?t=1523427994\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}