{
    "AppID": 1489970,
    "Name": "Highrise City",
    "Release date": "Mar 24, 2022",
    "About the game": "About the Team &amp; Game Obviously, you as a player will compare Highrise City with other games. If you are comparing the game with other city builders, keep in mind that the focus of Highrise City are the production chains - the results of these will lead to an ever growing city. The game is more than a traditional city builder and has a strong influence of economy simulations. It was developed by a small team as a passion project during the last 8 years while 7 years the game was a one man project. Let's grow a city! Highrise City offers a new spin on City Simulations &amp; Tycoon games expanding the economy and resource management aspect. Experience a modern take on the genre enriched with a complex resource based economy system. Highrise City combines two genres in new and interesting ways: City Builders and traditional Economy &amp; Resource Management Simulations. Highrise City offers you challenging gameplay and gives you all the possibilities and tools you need to create a living and breathing city. Take care of your city and make it grow and flourish into a giant Metropolis! Plan your Megacity In Highrise City you do not only build a city, you also actively manage it by handling the economical supply for it. Organize and build supply chains in an efficient way and make sure your economy is well balanced to guarantee a steady growth. By doing so you will be able to create true megacities. Features More than one million inhabitants per city 5 different population classes More than 250 base buildings 50 different resources More than 30.000 buildings per city More than 5.000 cars and vehicles per scene (and more than 20.000 per city simulated) More than 20.000 people per scene (and more than 1 million per city simulated) 196 sq km possible playground per map Adjustable difficulty levels for beginners and advanced players Improve the city with laws and technology researches Resource trading to balance your economy Building Editor Enjoy your work Once you managed to create a prosperous and growing city, time has come for fine-tuning and further growth. But in the meantime, you should also take a break and just enjoy what you have created. Watch the people filling the streets and minding their business. In Highrise City you can see thousands and thousands of people and cars in the same scene filling your city with life. Micro animations hidden everywhere will brighten up your day and create the feeling of a miniature world. Mod support and Steam Workshop integration You want to implement your own buildings? Your own skyscrapers? Change the whole balancing, include your own types of streets? That's what we are aiming for with Highrise City as well. The integrated building editor allows you to easily develop and implement an individual look for your custom city. Sharing your creativity with the community via Steam Workshop will also be a given.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1489970/header.jpg?t=1655220651",
    "Price": 24.99,
    "Developers": "Fourexo Entertainment",
    "Publishers": "Deck13",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_dab58aa8f1877921dcc0a5dbc7dc47fa3c8e6e4c.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_1a173face09f0cef420705ce79d06425611b978d.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_80488d95982cddace93ee1aeae5ec824dfec7b0b.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_ac2139d1c8ebb55089a23899dfb473ba9bc13b4e.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_6547240cad9ede252980aba5572ff5eaa4d2834d.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_84d974953446bcccf038a74a3cb2d72d70f87430.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_0dbacda6e748e40b1fe7f17da3d06a79892d9361.1920x1080.jpg?t=1655220651,https://cdn.akamai.steamstatic.com/steam/apps/1489970/ss_e0f209419b1397116257f134dfef174daf4bfb80.1920x1080.jpg?t=1655220651",
    "Slug": "highrise-city",
    "Meta Title": "Highrise City: Mar 24, 2022, Fourexo Entertainment and Fu...",
    "Meta Description": "Looking for information on Highrise City? Check out the release date (Mar 24, 2022), developer insights from Fourexo Entertainment, and a complete game ...",
    "Alt Text Image": "Official header image for Highrise City game - Steam 1489970",
    "Canonical URL": "https://gusku.site/game/highrise-city",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Highrise City\", \"description\": \"Looking for information on Highrise City? Check out the release date (Mar 24, 2022), developer insights from Fourexo Entertainment, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fourexo Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deck13\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1489970/header.jpg?t=1655220651\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}