{
    "AppID": 1114990,
    "Name": "It Pays To Be A Winner",
    "Release date": "Sep 24, 2019",
    "About the game": "Strategy At the Core It Pays To Be A Winner is meant to be a strategy game. When I hear strategy, that means no bs, just cold hard logic, tactics, and creativity and that's what this game offers. To achieve this goal there is virtually no RNG bs in the game, the only case being the generation of the map(We've gotta keep it a little interesting). This means that combat can be planned, and your battle plans can be thought of in terms of facts and not praying on rolls. Every unit will do it's precise amount of damage, and every unit will take it's precise amount of damage. There are no excuses to loss in this game, if you lose, it means you got outplayed. $ave Dat Money This game doesn't feature Fetty Wap, but it does feature an in-game economy. In order to get units, buildings, and upgrades you'll have manage your in game economy and buy them. This means you'll have to be smart in considering what units or buildings to buy, when to buy them, and sometimes making a hard choice between two options. Each player starts each game with the same income-per-turn, but it can be increased with the purchase of Supply Pads. But you better defend them well, because it's just as easy for your enemy to destroy them as for you to build them. Build Your Military There are 6 units in It Pays to Be A Winner , and each serves a unique and important purpose. Infantry your righteous cannon fodder Tanks your heavy hitters APCs your party buses Artillery your building destruction Helicopters your glass cannons Special Forces your ghostly operatives Build Your Defences There are also 4 buildings in the game, each serving specific roles. Pillboxes to rain bullets Artillery Platforms to rain shells SAM Sites to hunt birds Supply Pads to increase your income and heal your units Get Iced Out Each unit and building in the game has it's own upgrade tree, some leading to important but boring upgrades, while others lead to game changing improvements. These don't come cheap though, so it's important to consider whether it's worth it to develop your units, or put more on the field. Also, upgrades don't magically apply to all your things on the field, only new ones bought from that point onward silly goose.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1114990/header.jpg?t=1571607790",
    "Price": 4.99,
    "Developers": "Alan Goff",
    "Publishers": "Alan Goff",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_3c20f05d830bf6a2a58ca027c4e665b5a9d38ff0.1920x1080.jpg?t=1571607790,https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_c5d0c3466c6709bc4fe7f0b71dbd42902df0ce47.1920x1080.jpg?t=1571607790,https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_5a79498c7c93e96e2f0c3a23145c0d8ae08752fe.1920x1080.jpg?t=1571607790,https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_84eadeda8a66d149e1c7882ecd2d307053c8cb95.1920x1080.jpg?t=1571607790,https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_f8129404fc966339bbb1be60a9681b938fa876dd.1920x1080.jpg?t=1571607790,https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_00294d69a2aae86a07b7e4242cf2d465bd194c6e.1920x1080.jpg?t=1571607790,https://cdn.akamai.steamstatic.com/steam/apps/1114990/ss_f43e2a9d0b013178da9e8300eafbae40214b4dbc.1920x1080.jpg?t=1571607790",
    "Slug": "it-pays-to-be-a-winner",
    "Meta Title": "It Pays To Be A Winner: Sep 24, 2019, Alan Goff and Full ...",
    "Meta Description": "Looking for information on It Pays To Be A Winner? Check out the release date (Sep 24, 2019), developer insights from Alan Goff, and a complete game sum...",
    "Alt Text Image": "Official header image for It Pays To Be A Winner game - Steam 1114990",
    "Canonical URL": "https://gusku.site/game/it-pays-to-be-a-winner",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"It Pays To Be A Winner\", \"description\": \"Looking for information on It Pays To Be A Winner? Check out the release date (Sep 24, 2019), developer insights from Alan Goff, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 24, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alan Goff\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alan Goff\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1114990/header.jpg?t=1571607790\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}