{
    "AppID": 1574670,
    "Name": "Kaboom!",
    "Release date": "Jul 30, 2021",
    "About the game": "Kaboom! is a game about blowing up your friends! Play in head-to-head battle with up to 8 players. An online battle arena where you try to outwit your opponents with quick thinking, planning, and sometimes just a bit of luck. Get power ups to improve your abilities and rain fire (sometimes literally!) down on those who would try to best you. A multitude of arenas provide fun and unique challenges with map specific set-pieces and obstacles to keep you on your toes. Play the game your way with custom lobbies and your own insane game rules, or take part in ranked tournaments and climb the ladder to greatness! See who is the last robot standing in free-for-all mode, or play as a team in team-battles. Local and Online Multiplayer Games like this are meant to be played together, which is why in addition to standard online modes - we will also be making it possible for you to host local LAN games to play with your friends, and split-screen modes to play with up to 4 local players with multiple controllers (4x XInput compatible gamepads required, or 3 if someone uses the keyboard). We appreciate that this is a rare feature in modern games, so we're going to make it happen. Right now during the current part of early-access only standard online is available, but local and split screen modes will be available before the final release. Gameplay Modes Elimination Classic It's winner-takes-all in this classic arena mode for 2 to 8 players. You get a single life in the match. Be the last player standing to claim the crown and win the match! Ran out the timer? Whoever got the most kills wins! Team Battle Strategy and wit reign here in this single-life mode. Play as either 2 or 4 teams (4 teams of 2, or 2 teams of 2-4) to take the other teams down. Last team to have at least one player standing wins. Deathmatch Respawn again-and-again (losing your powers as you do!) and try to rack up as many kills as you can! Take down the current kill leader, and gain all their powers and abilities to use against them! Also available in team based variants. King-Of-The-Hill Every 30 seconds a new section of the map will become the 'Hill' - you or your team must try to hold onto that position for as long as possible. The player or team with the highest accumulated total hill time wins! Capture the Flag Pick up the flag and take it back to your home base, but there's a catch! You can't place bombs, so you must rely on your teammates to clear the way for you to score. Boss Fight! Absolute mayhem - This asymmetric mode pits one mega-player with outrageous powers and abilities v.s. 3 to 7 opponents in a short, timed match. Take down the boss before the timer runs out to win!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1574670/header.jpg?t=1627671618",
    "Price": 6.99,
    "Developers": "CubeCoders Limited",
    "Publishers": "CubeCoders Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_b0a974431760366916621fc42f0a0a4d13e43e8a.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_5509454a1b111e67f5efdde90dbd5381bb84143c.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_4fb7ef294a6b029fdeaaf84ce1f305e0e81de023.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_58df313ed80203df71780c367c15c4e86d678d46.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_337a17e5d6c60e6e04bda6da32a90cf01d83bb58.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_067d7791bd66281734b5bf60838ceca11e27e52b.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_58df313ed80203df71780c367c15c4e86d678d46.1920x1080.jpg?t=1627671618,https://cdn.akamai.steamstatic.com/steam/apps/1574670/ss_54e508f05e7e7923631e6fad7aea0ce42d77e0f7.1920x1080.jpg?t=1627671618",
    "Slug": "kaboom",
    "Meta Title": "Kaboom!: Jul 30, 2021, CubeCoders Limited and Full Overview",
    "Meta Description": "Looking for information on Kaboom!? Check out the release date (Jul 30, 2021), developer insights from CubeCoders Limited, and a complete game summary.",
    "Alt Text Image": "Official header image for Kaboom! game - Steam 1574670",
    "Canonical URL": "https://gusku.site/game/kaboom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kaboom!\", \"description\": \"Looking for information on Kaboom!? Check out the release date (Jul 30, 2021), developer insights from CubeCoders Limited, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CubeCoders Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CubeCoders Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1574670/header.jpg?t=1627671618\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}