{
    "AppID": 804860,
    "Name": "Klotzen! Panzer Battles",
    "Release date": "Apr 27, 2022",
    "About the game": "Klotzen! Panzer Battles, is a World War 2 turn based operational strategy game set in Europe and North Africa. Made with passion by strategy gamers, it was designed with replayability and challenge in mind. Intuitive and easy to start, it offers a classic gameplay experience for Panzer General lovers. Execute enveloping maneuvers by taking key towns and cutting off roads and railroads to disable large groups of enemy units quickly using our unique supply system. Just remember that this is a double-edged sword which AI will use expertly against you. Flexible AI that leaves room for mistakes in lower settings and detects local and strategic mistakes and exploits them on highest difficulties. Learn to protect your exposed units, objectives and supply or let AI help you remember. Use your air force as never before – bomb enemy supply and vital bridges, mount air offensives by attacking airfields to achieve quick air superiority, or swarm the skies and strafe exposed enemy ground units during their move. Dig fortifications and lay minefields, blow up bridges or repair them using dedicated engineering units. Offering large branching campaign, random events for campaign and each scenario, massive customization options both for the whole army and each unit individually, it gives the best replayability in the genre. Lead your core units through historical operations, unexpected events taking you to new battles and what-if maps in a massive branching campaign with over 60 scenarios. delay Barbarossa by one year to deal with the UK in the Mediterranean defend in Normandy and beyond in 1943 be late for the party in Norway with UK already securely dug-in fight off allied invasion of Spain take factories of Ural in one final stroke fight great tank battles of Ukraine in 1941 protect eastern borders after Kursk invade UK and USA …and more Customize each unit’s commander by choosing from over 100 skills, traits and flaws to match your play style. Trade favors with high command to get access to better equipment, veteran troops and more capable commanders. Speed up development of advanced jets and Tiger tanks, and sell unused units and personnel. Lead separate core unit groups in east and west. Create unique generals to lead them by choosing between four personality types, each with unique flaws and skills. Customize your generals to brown-nose their way to cheap equipment, or shape them into inspiring leaders or careful ready-for-anything planners. Experience the thrill of each hit in naval battles. See mighty battleships blow up after being hit in the magazine or sit helplessly in the water after having a rudder disabled with our new naval combat system. Use superior morale to gain the advantage over disheartened enemy. Choose from over 700 unique beautifully rendered unit types. Create your own scenarios using included editor. Play with a friend on our servers or at home in hotseat mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/804860/header.jpg?t=1656331174",
    "Price": 39.99,
    "Developers": "Maxim Games",
    "Publishers": "Maxim Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_cd602c05c0791d9be2d90ff2c759440aaeff3239.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_bf4d0e32bc128f6af62dce411677260f409d478b.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_185263382020957d085f847ea996dc4360a75e5a.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_8459077be0e9bd9b28c09686d7e4140ad331e44d.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_95019ca905c1fda92287e8e89e7392ee9fc78fe6.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_7dbc2514dda1dbb7c65bc1ed29a1e554c547d8be.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_85784971ad299bb0a75b8a843a8a54ec5441f654.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_7763ce208893bbcead9377dd33b395c30cfa7136.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_59b464425671ff59a883daaece6177224bcc6bcd.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_25f0cf29d256136dc416178f9a18d278c30d60b5.1920x1080.jpg?t=1656331174,https://cdn.akamai.steamstatic.com/steam/apps/804860/ss_68808d51edf958e122eadaa53926c37cb38e1444.1920x1080.jpg?t=1656331174",
    "Slug": "klotzen-panzer-battles",
    "Meta Title": "Klotzen! Panzer Battles: Apr 27, 2022, Maxim Games and Fu...",
    "Meta Description": "Looking for information on Klotzen! Panzer Battles? Check out the release date (Apr 27, 2022), developer insights from Maxim Games, and a complete game ...",
    "Alt Text Image": "Official header image for Klotzen! Panzer Battles game - Steam 804860",
    "Canonical URL": "https://gusku.site/game/klotzen-panzer-battles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Klotzen! Panzer Battles\", \"description\": \"Looking for information on Klotzen! Panzer Battles? Check out the release date (Apr 27, 2022), developer insights from Maxim Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maxim Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Maxim Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/804860/header.jpg?t=1656331174\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}