{
    "AppID": 835430,
    "Name": "La-Mulana 2",
    "Release date": "Jul 30, 2018",
    "About the game": "La-Mulana 2 features sprawling ancient ruins, mind-boggling mysteries, untold numbers of items, and terrible enemies combining to form what is possibly the perfect Metroidvania-style 'archaeological ruin exploration action game'. In La-Mulana 2, you take on the role of Lumisa Kosugi - daughter of the previous title’s hero - as she explores the ancient ruins of La-Mulana, said to be the cradle of human civilization. Desperate to find the cause of the numerous recent appearances of monsters from the ruins, Lumisa heads to the 'other' La-Mulana: the ruins known as Eg-Lana. Explore the vast ruins comprising multiple field maps, solve mysteries and riddles using the stone tablets and messages you discover along the way, and take out huge monsters known as 'Guardians' as you make your way to the deepest depths of the ruins. You won’t believe the awesome mystery of Eg-Lana awaiting you at the end of your journey... La-Mulana was known as a 'Metroidvania'-style game (a 2D action platformer with an emphasis on non-linear exploration). That said, the real core of the game is in deciphering the riddles scattered throughout the game, and solving the puzzles that exist as part of the ruins. A classic experience : As with its predecessor, La-Mulana 2 will not feature a tutorial or a long-winded sidekick. As a seasoned explorer, it's up to you to discover the secrets hidden within the ruins and find the truth on your own. Explore at your own pace : By deciphering cryptic text on the monuments scattered throughout the ruins, you will gradually unravel the mystery of the ruins. Which parts of the sprawling underground you tackle, and in what order, is up to you. Sometimes you will need to use changes in backgrounds, mysterious sounds, the strength of enemies, or the sneakiness of traps to detect subtle changes in your surroundings. A colossal adventure : We have designed a variety of zones, and have created a mystery deep enough to encompass a gigantic cave system. This is a very large-scale indie title. We predict newcomers to the series will probably be able to clear the game in 20 to 30 hours. Because of the non-linear nature of Eg-Lana, La-Mulana 2 will have plenty of replayability. New horrors, new weapons : Plenty of ferocious and terrifying monsters and guardians stand in your way in the depths of this new underground network. Fortunately, you will also have an arsenal of tools and weapons at your disposal to help you on your journey. Widescreen support : The first La-Mulana was a remake of a retro-style game that ran in a 4:3 aspect ratio, which made widescreen support impossible. For La-Mulana 2, the various maps and rooms are designed to be 16:9-compatible, making it perfect for widescreen TVs and monitors. The question we’ve asked ourselves throughout development is: 'How can we make an old-school 2D game take advantage of advancements in present-day technology?' Become an adventurer and explore sprawling ancient ruins Gather hints to solve the various mysteries of the ruins Dive into the action as you fight off tough enemies seeking to impede your progress A detailed and beautifully dot-rendered world Seven main weapons and over ten sub-weapons Over 60 items of various types to help you explore the ruins Over 20 apps to install on your trusty adventurer’s tablet, the 'Mobile Super X3' Includes reference book with over 200 monsters and other characters in the game Lumisa Kosugi (21 years old; fourth-generation Japanese; the game's protagonist) Some say she is Lemeza's wife's daughter from a previous marriage, while others believe she's Professor Shawn's illegitimate child. Either way, she is a Kosugi; that much is clear. She travels to La-Mulana to make her archaeological debut after accepting Xelpud's request to search the ruins. Lemeza Kosugi (36 years old; the previous game's protagonist) Tales of his exploits in the ruins of La-Mulana may be known worldwide, but he was also responsible for the ruins' destruction, and has gone into hiding as a result. His love of exploration has not faded, however, and he still finds time to go spelunking in secret. Shawn Kosugi (67 years old) After revealing the 'Treasure of All Life' he brought back from the ruins of La-Mulana, he returned to a hermetic life once more. Although he technically retired after finishing his research on the 'Cradle of All Civilization', he finds himself slowly drawn back into the world of archaeology. Elder Xelpud (Age unknown) Upon the collapse of the La-Mulana ruins, his life as a 7th Child came to an end. He's been spending his time running the 'La-Mulana Ruins Tourist Spot' in hopes of finding purpose in life once again. As a result, he's become quite wealthy, and now lives a life of luxury full of beautiful women and fast cars. Mulbruk (3024 years old; looks/hopes to look about 24) Since her release from the ruins, Mulbruk has been happily living aboveground, pretending to be a 'normal' young woman. Using her amazing knowledge of history, she has become a treasure hunter. She's also become quite fashionable.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/835430/header.jpg?t=1646127569",
    "Price": 24.99,
    "Developers": "NIGORO",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_d1f2d2166a8175e564e7f6cb75b5abc18a337225.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_746855dfa2aad4effbb0bb2ef08b3790733b7ddc.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_471d58f3c4095fd4495d5b6480f0a6720a5b0ede.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_0a3683d849e21e46404137c973cad4f2af69b883.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_c83f9321500459a5e35f06cca06438c3a8f6aa9d.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_472fe6b91111fc24e828ecfd7b1c7e15e245c0cb.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_1ba313434575841fa9447bd0a51d0b873f7b68cb.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_a1e636de1f0e4b6935f2c9abf70fd35e853e3338.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_967a002cba9c05e735927c2e2f3856e6698cbae1.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_3332c3517abc7e5579c815a29bfe41f5ad7a6dbf.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_fef6bb50ba6c7d9d5643b65f3a58f925462960d6.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_38c262d1900865676e0e521cbce2bcd4461f008a.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_ee57640b9f9739810e73a02fc01a1a6f2a38cda0.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_d5894fd228ba3e743aa2fbb6777ac2bf8c71c5d0.1920x1080.jpg?t=1646127569,https://cdn.akamai.steamstatic.com/steam/apps/835430/ss_75b819ed408890df9f14bc9d3957726438ddb45f.1920x1080.jpg?t=1646127569",
    "Slug": "la-mulana-2",
    "Meta Title": "La-Mulana 2: Jul 30, 2018, NIGORO and Full Overview",
    "Meta Description": "Looking for information on La-Mulana 2? Check out the release date (Jul 30, 2018), developer insights from NIGORO, and a complete game summary.",
    "Alt Text Image": "Official header image for La-Mulana 2 game - Steam 835430",
    "Canonical URL": "https://gusku.site/game/la-mulana-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"La-Mulana 2\", \"description\": \"Looking for information on La-Mulana 2? Check out the release date (Jul 30, 2018), developer insights from NIGORO, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"NIGORO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/835430/header.jpg?t=1646127569\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}