{
    "AppID": 781110,
    "Name": "Later On",
    "Release date": "Jan 26, 2018",
    "About the game": "Later On is a game about guilt and coping. You play as David, a discouraged young man, living his mediocre life. When his best friend goes missing David searches after him, makes new friends along the way and they encounter strange events together. With the help of Prea and Luna, David realizes what it is he really seeks after. In the end, instead of finding Nico, David finds his own demons. Characters: David is our protagonist. He is a quiet guy, usually minds his own business. He prefers to stay at home reading and drinking coffee. When his friend Nico disappears, he feels responsible and commits himself to find him. Prea lives in a small cabin in the woods. She works at the hospital and likes to help people. When she learns that David’s friend is missing she decides to help him to find Nico. Luna is a werewolf. She is a good person who wants to help people, but when she turns into a wolf she has no control over her actions. Nico is David’s best friend. They work at the same office. One day he wakes up and realizes that he has a tail. Not knowing what to do, he asks for David’s help, only to disappear after a couple of hours later. Gameplay: Later On is a 2D top-down adventure game with absurd puzzles and text-based fights. Basically, you collect some items and use them from your inventory at correct locations to progress in the game. It takes about 1,5-2 hours to finish the game. Here's a walkthrough of the game in case you get stuck: -on-walkthrough.html Controls: - Arrow keys and WASD to walk around - Shift to run (only at possible locations) - X/ESC to cancel/opening menu - Z or Space to action - F5 and F6 to change screen size - I for inventory - M or Tab for Map You can view controls inside the game by pressing 'C' key. Developer's Note: This project had started in 2016. The main goal was to tell a story about 'getting out' of a situation which makes you feel like 'you are stuck'. After countless brainstorming sessions, we decided that 'a change of self' is needed in order the change the setting. With that in mind, my best friend and I started to make this game. I hope you guys like it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/781110/header.jpg?t=1522258744",
    "Price": 1.99,
    "Developers": "Penumbra Games",
    "Publishers": "Penumbra Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/781110/ss_c847e8df366284ea96d2513403ad3a4a454fdf44.1920x1080.jpg?t=1522258744,https://cdn.akamai.steamstatic.com/steam/apps/781110/ss_81feed715d71bbbd9dc5beaec8321c81656673e2.1920x1080.jpg?t=1522258744,https://cdn.akamai.steamstatic.com/steam/apps/781110/ss_7403b8cfc44251bf37322d505047dca2cc2d51b9.1920x1080.jpg?t=1522258744,https://cdn.akamai.steamstatic.com/steam/apps/781110/ss_a835ca3a8d3ee8b2654bd763504d3e08f34b316c.1920x1080.jpg?t=1522258744,https://cdn.akamai.steamstatic.com/steam/apps/781110/ss_d3a3f636053b9aa45b723c5795c1273a18c63e10.1920x1080.jpg?t=1522258744",
    "Slug": "later-on",
    "Meta Title": "Later On: Jan 26, 2018, Penumbra Games and Full Overview",
    "Meta Description": "Looking for information on Later On? Check out the release date (Jan 26, 2018), developer insights from Penumbra Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Later On game - Steam 781110",
    "Canonical URL": "https://gusku.site/game/later-on",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Later On\", \"description\": \"Looking for information on Later On? Check out the release date (Jan 26, 2018), developer insights from Penumbra Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Penumbra Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Penumbra Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/781110/header.jpg?t=1522258744\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}