{
    "AppID": 1882420,
    "Name": "Learn Programming: Python - Remake",
    "Release date": "Feb 21, 2022",
    "About the game": "Welcome to Learn Programming: Python - Remake ! The goal of this game (more of an interactive course) is to introduce beginners to the wonders of the world of Computer Science! The game has have two core components: Lessons : An interactive course to teach you how to think computationally, how to write programs in Python, and how to design classes using the principles of Object-Oriented Programming (OOP). Challenges : Multiple choice, short answer, and math problems to test your understanding of Python, computational thinking, and OOP. These challenges are embedded throughout the Lessons, so you can practice your understanding of concepts in real-time under an Active Learning framework. This game assumes absolutely zero prerequisite background . We hope you will join us as we explore the wonders of Programming in Python! Game developed by Niema Moshiri Lesson content developed by Sabeel Mansuri Table of Contents Chapter 1 - Introduction: The Nuts &amp; Bolts Chapter 2 - Conditionals: Ice Cream Isn't for Breakfast Chapter 3 - Loops: Breakfast, Lunch, Dinner, Breakfast, Lunch, Din... Chapter 4 - Data Structures: I'll Have Combo #3, Please! Chapter 5 - Functions: How Do I Stop Rewriting Code? Chapter 6 - Recursion: Give Me a Minute, I'm Getting a Call from Myself Chapter 7 - Objects: Python, Have a Burger Chapter 8 - Exceptions: You Can't Eat an Empty Bag of Chips Chapter 9 - File I/O: Here's a Recipe, Make Me Some Macarons Chapter 10 - Libraries: Hasn't Someone Done This Before? Chapter 11 - Epilogue: What Now? Frequently Asked Questions (FAQs) How do I adjust the settings of the game? All game settings can be adjusted via the 'Preferences' section of the Main Menu, which can be accessed at any time by pressing 'Escape' (keyboard) or 'Start' (controller) How is 'Learn Programming: Python - Remake' different from the original 'Learn Programming: Python - Retro' ? The game engine behind 'Learn Programming: Python - Retro' was built from scratch by the developers purely out of interest, and as such, it lacked many technical features of modern game engines 'Learn Programming: Python - Remake' is a ground-up remake of the game using the Ren'Py game engine, which is commonly used to create visual novel games There were some lesson text/images that were omitted from 'Learn Programming: Python - Retro' due to technical limitations of the game engine which have been readded to 'Learn Programming: Python - Remake', but the lesson text is very largely the same The key new features in 'Learn Programming: Python - Remake' are the following: Cleaner modern user interface (e.g. support for up to 4K resolution, nice fonts, images, ambient background music, etc.) Steam Achievements Ability to skip challenges and track progress Support for Steam Community Overlay Support for the Steam Link app Support for Steam Remote Play Because of how it was packaged, 'Learn Programming: Python - Retro' had an issue with false positive antivirus flags (see the 'Learn Programming: Python - Retro' Store Page FAQs for more info); this is completely fixed in 'Learn Programming: Python - Remake' because of its use of Ren'Py",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1882420/header.jpg?t=1645481931",
    "Price": 2.99,
    "Developers": "Niema Moshiri",
    "Publishers": "Niema Moshiri",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1882420/ss_f33d7c4a74ede04fec283a0ff7cdf27274d162d4.1920x1080.jpg?t=1645481931,https://cdn.akamai.steamstatic.com/steam/apps/1882420/ss_b2d024e271ca5f31974e8fcee6b385fbec9d1491.1920x1080.jpg?t=1645481931,https://cdn.akamai.steamstatic.com/steam/apps/1882420/ss_91fc90f973e3533499425b1d1603e0d93439abcd.1920x1080.jpg?t=1645481931,https://cdn.akamai.steamstatic.com/steam/apps/1882420/ss_b271c82a6cd5de4a847b4d782b4847d8e515e0be.1920x1080.jpg?t=1645481931,https://cdn.akamai.steamstatic.com/steam/apps/1882420/ss_4107e0fee9d66687499bbff101e8d799c1ab1d5b.1920x1080.jpg?t=1645481931",
    "Slug": "learn-programming-python-remake",
    "Meta Title": "Learn Programming: Python - Remake: Feb 21, 2022, Niema M...",
    "Meta Description": "Looking for information on Learn Programming: Python - Remake? Check out the release date (Feb 21, 2022), developer insights from Niema Moshiri, and a c...",
    "Alt Text Image": "Official header image for Learn Programming: Python - Remake game - Steam 1882420",
    "Canonical URL": "https://gusku.site/game/learn-programming-python-remake",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Learn Programming: Python - Remake\", \"description\": \"Looking for information on Learn Programming: Python - Remake? Check out the release date (Feb 21, 2022), developer insights from Niema Moshiri, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Niema Moshiri\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Niema Moshiri\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1882420/header.jpg?t=1645481931\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}