{
    "AppID": 733540,
    "Name": "LOGistICAL: Brazil",
    "Release date": "Jun 14, 2018",
    "About the game": "LOGistICAL: Brazil is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. LOGistICAL: Brazil has no town consumption (similar to Xmas 2017) which makes it a subtly different game-play to the other LOGistICAL modules. It gets easier as you play. Brazil is huge. Larger in land mass than contiguous United States (ie not including Alaska and Hawaii). * No town consumption * No competitive high score values * Upgrade some roads * Lots of initial money (spend wisely) * Supply and finish many large cities * Work your way through the long complex maze of road enhancements to finally allow all your large trucks access across the country * Many, many other small and large puzzles and situations to complete. LOGistICAL: Brazil brings you all the fun and puzzling of LOGistICAL with even more towns, more puzzles and much more to do. THIS GAME DOES NOT REQUIRE THE ORIGINAL LOGISTICAL GAME TO PLAY. Over 2000 towns to complete. LOGistICAL: Brazil game covers the country of Brazil including cities like Brasilia, Rio de Janeiro, Sao Paulo, Salvador, Belo Horizonte and many, many more. There are many new obstacles and deliveries to make. ... LOGistICAL: Brazil is an independent, standalone game independent from the main LOGistICAL game (and other add-ons). It has its own money, trucks and of course, challenges. ... LOGistICAL is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. The whole game is a huge puzzle while each town is its own little piece of puzzling. There are over 1,000 towns to complete. Plenty of towns are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing regions and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Pimp up your trucks with bonuses. Last truck delivering gets the bonus. The towns and map are to scale. Current or historical industry placement. You could even say that playing is educational. There is plenty more to keep you on your toes. Towns consume the cargoes you are trying to get to completion. Big trucks are great for moving lots of stuff, but can't travel everywhere. There are lots of broken roads that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. What! I can't take my big trucks across the water on a ferry. ... and what is with those quarantine checkpoints? Complete towns, roads, industries, contracts, regions and states for lots of in-game and Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/733540/header.jpg?t=1560223075",
    "Price": 9.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_14dc6338637507cdfb650ac01e015412c75d301a.1920x1080.jpg?t=1560223075,https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_901c9631f237c698b3c863aaff77666ad5462a42.1920x1080.jpg?t=1560223075,https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_fe135c5fed3e202653cd6ce9944430b17f56523d.1920x1080.jpg?t=1560223075,https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_4864302db7a73637c9687be921a3d9e85b2a9ef0.1920x1080.jpg?t=1560223075,https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_a906ac0fe8c38628219a32003adf1d5fd51ccab6.1920x1080.jpg?t=1560223075,https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_db0583d72170bf45401709bb6a7f7de4870eb9e3.1920x1080.jpg?t=1560223075,https://cdn.akamai.steamstatic.com/steam/apps/733540/ss_ca8c3c057c5f8707c700d17ed5f8acc0524b3798.1920x1080.jpg?t=1560223075",
    "Slug": "logistical-brazil",
    "Meta Title": "LOGistICAL: Brazil: Jun 14, 2018, Sacada and Full Overview",
    "Meta Description": "Looking for information on LOGistICAL: Brazil? Check out the release date (Jun 14, 2018), developer insights from Sacada, and a complete game summary.",
    "Alt Text Image": "Official header image for LOGistICAL: Brazil game - Steam 733540",
    "Canonical URL": "https://gusku.site/game/logistical-brazil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL: Brazil\", \"description\": \"Looking for information on LOGistICAL: Brazil? Check out the release date (Jun 14, 2018), developer insights from Sacada, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/733540/header.jpg?t=1560223075\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}