{
    "AppID": 1022230,
    "Name": "Magic Borderless",
    "Release date": "Feb 11, 2019",
    "About the game": "Experience the responsive windowed gaming ON FULLSCREEN SIZE without the ugly borders! Magic Borderless is an application to help gamers play games on fullscreen windowed without the ugly borders. Windowed mode gaming lets gamers instantly switch to other windows in the same computer while they are dead (because they suck) or waiting on loading screens, without having to see Windows go ape nuts when alt-tabbing. Some games even crash when alt-tabbed, but Magic Borderless is here to prevent that as well! The app tries to help you be as lazy as possible and do the work for you as much as possible... for free*! *(Well, after you pay for the app.) Extra helpful features are also added to assist gamers when it comes to managing windows on their monitors, such as Ninja Mode where it allows you to hide and mute a window for... um, science! Automatic Game Detection When you run your game on windowed or fullscreen mode, Magic Borderless can detect it without you ever have to manually add them every time. If this feature is enabled, it will ask you if you wish to apply the borderless magic. When the magic is applied for the first time, all you have to do is set your game to run on windowed mode once. Magic Borderless will take care of the rest automatically every time the game launches. You can also set to apply default configurations to all detected games without ever asking you! Improved Borderless Algorithm There are different ways to make a window borderless, but all of them often has trouble resizing window properly or suffer from graphical errors. Magic Borderless has improved code to combat these issues for you and will work on even more games! It has the highest compatibility list of all borderless software available! Customizable Additional Magic Besides making your favorite games borderless, you can also set the game to run on a specific window size or simply maximize to your monitor's resolution. If you wish to keep your Taskbar up, you can also toggle it to make sure the window does not hide the Taskbar. Some also prefer their borderless windowed mode to behave like real fullscreen apps (minimize the window on alt-tab). For those weirdos, you can set the Alt+Tab behavior to minimize the window. Ninja Mode: Instant Hide and Mute By pressing [Alt] + [X], you can activate Ninja Mode on your currently active window. This will not only completely hide them from taskbar and among opened windows, it will also mute that particular window only! This feature is also available to Alt+Tab behaviors for any games you configured! Cursor Lock Some noob developers forgot to add cursor lock to their games on windowed mode (or they believed it is how they should behave). If you don't like this behavior, no worries! Magic Borderless can lock your cursor to that window OR the monitor (for our beloved multi-monitor users). Muti-monitor Assistance Magic Borderless can stretch a game window across all of your monitors so you can it big! The program also provides additional tools like mouse cursor centering and Window-Escape feature to assist you on multitasking! Volume Manager Instead of going through a number of clicks to adjust the volume of your apps, Magic Borderless can help you adjust them reliably through its own UI. You can also change the background volume so when they are not being used their audio volume can be either reduced or muted completely!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1022230/header.jpg?t=1564691972",
    "Price": 2.99,
    "Developers": "Studio Christmas",
    "Publishers": "Studio Christmas",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_6c40a9f7e9e10182c2d834027c7ae10124648e2e.1920x1080.jpg?t=1564691972,https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_efcf15333c9225c18c15dcac18b2431e5eaa6ffe.1920x1080.jpg?t=1564691972,https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_1f427e1f2dc4b3cf949ffd8223c51b20efe2396e.1920x1080.jpg?t=1564691972,https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_04f09aebdef6c975b1410cf2c7eab3e8b183e531.1920x1080.jpg?t=1564691972,https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_64ef22ae493310aa1963167a9af95d11fecbd918.1920x1080.jpg?t=1564691972,https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_bd2bfdd3bd0e76f7307238e9cfe54ff83b313231.1920x1080.jpg?t=1564691972,https://cdn.akamai.steamstatic.com/steam/apps/1022230/ss_aeea3ba2e28fd9db70214bf97171196f00fa2fc9.1920x1080.jpg?t=1564691972",
    "Slug": "magic-borderless",
    "Meta Title": "Magic Borderless: Feb 11, 2019, Studio Christmas and Full...",
    "Meta Description": "Looking for information on Magic Borderless? Check out the release date (Feb 11, 2019), developer insights from Studio Christmas, and a complete game su...",
    "Alt Text Image": "Official header image for Magic Borderless game - Steam 1022230",
    "Canonical URL": "https://gusku.site/game/magic-borderless",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magic Borderless\", \"description\": \"Looking for information on Magic Borderless? Check out the release date (Feb 11, 2019), developer insights from Studio Christmas, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Christmas\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Christmas\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1022230/header.jpg?t=1564691972\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}