{
    "AppID": 1285180,
    "Name": "Maneuver Warfare",
    "Release date": "May 25, 2020",
    "About the game": "1. This unique war game lets you command a mix of maneuver and combat support units that you can assemble into combined-arms battle groups. Build these around a core of infantry and armor, and reinforce them with combat support elements like anti-tank or engineer platoons. Then command them across battlefields where you must synchronize maneuver and fire, and plan for ammunition replenishment, in order to defeat an enemy who fights according to tactically-sound battle plans. Fight historical scenarios or use an editor to design your own offensive or defensive battles where you can go for an easy day by crushing a mass of early-war light tanks with King Tigers, or challenge yourself to stop a flood of Soviet armor with nothing but infantry and anti-tank guns. 2. Your selection of units includes: a. motorized and mechanized infantry companies; b. StuG assault gun companies; c. tank companies ranging from the early Panzer IID to the heavy King Tigers; d. batteries of field artillery and multiple rocket launchers that support you with indirect fire and lay smoke screens; e. combat engineer platoons that can lay and breach minefields; f. reconnaissance detachments; g. anti-tank gun platoons; h. tank destroyer platoons that range from the very first Panzerjagers to the massive Jagdtigers; i. forward air controllers who can call in reconnaissance and strike aircraft as well as fighters to protect you from enemy air attack; and j. platoons of deadly 88mm Flak guns to defeat the enemy's heaviest tanks. 3. Face off against a selection of 159 British, French, German, Polish, and Soviet unit types. 4. Choose from 8 short campaigns or custom-assemble these to create a Grand Campaign. a. 1939: Poland b. 1940: Belgium and France c. 1941: Operation Barbarossa d. 1941: Operation Typhoon e. 1942: Advance into the Caucasus f. 1943: The Battle of Kursk g. 1944: Defensive battles during the withdrawal across Poland h. 1945: The final German coutneroffensive in Pomerania and fighting at the line of the Oder river. 5. Choose from 24 individual missions that include some of the key battles of the war. These are: a. Wielun, 1939 – the initial German advance into Poland; b. Piotrkow, 1939 – clash with Polish reserves, including their armored units, barring the road to Warsaw; c. 1st Battle of Tomaszow Lubelski, 1939 – a defensive battle where you try to stop a break-out by surrounded Polish forces; d. Hannut, 1940 – the battle where German panzers faced French armored forces in Belgium; e. Meuse, 1940 – defeat a French counterattack aiming to crush a bridgehead across the Meuse; f. Across the Bug, 1941 – the initial advance into the Soviet Union; g. Brody, 1941 – possibly the biggest armored battle of Operation Barbarossa; h. Kiev, 1941 – close the Kiev cauldron so Soviet armies trapped around that city can be destroyed; i. Advance on Moscow, 1941 – punch through the Soviet defensive lines blocking the road to Moscow; j. Southern attack on Moscow, 1941 – encircle the Soviet capital from the south; k. The withdrawal from Moscow, 1941 – stop the Soviet counterattack outside Moscow; l. Budyonnovsk, 1942 – advance towards the Caucasus during Operation Blue; m. Clash in the Steppe, 1942 – defend German lines of communications in the steppe against Soviet raids, n. Opening the Road, 1942 – destroy Soviet Forces trying to block the German withdrawal from the Caucasus; o. Kursk, 1943 – punch through the first two Soviet defensive lines during the battle of Kursk; p. Kursk – Prokhorovka, 1943 – fight through the massive armored clash at Prokhorovka during the Battle of Kursk; q. Bug, 1944 – delay the Soviet advance towards the Bug river. r. Radzymin, 1944 – counterattack the Soviet armored spearheads advancing on Warsaw and then cover the German withdrawal from this battle; s. Stargard, 1945 – advance against the Soviets in the last German offensive in Pomerania and then cover their withdrawal from this operation; t. Oder, 1945 – counterattack the Soviet forces that had just penetrated across the Oder River north of Berlin.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1285180/header.jpg?t=1649371287",
    "Price": 19.99,
    "Developers": "Decisive Action Games",
    "Publishers": "Decisive Action Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_1d6d9db41f3bfe2e2d86ba8f3afd0f944d1c0406.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_c092a85bc32c3ae25233a52c2aed23a504c188b0.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_06ff40044fcb7e4ff5e7c77ced331f0cb36ca088.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_77b175ddeaee36be8180ba0fc0fd03f29500a971.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_2d4315126a6879d0597774c1327a966671ceecaa.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_5da098d95e4aa327d1ff589f97033da31fa3c2c6.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_c0af9a98e599234da289a3a7f0381c23d49b9bf2.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_eb81237b5714ae9d8c05439625cc52d6ac49ac49.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_402832ed055ea9207c2c3cd41045beb8e9252681.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_76fafa448b865249e28a3b5f1de1b44422c09ae5.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_f22ff14db8634ff741a16257867488b5c9546acf.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_56c268a92a6c58597294bc6599f5ffe75a50b57f.1920x1080.jpg?t=1649371287,https://cdn.akamai.steamstatic.com/steam/apps/1285180/ss_129579438e6596faf0a2605870b6548da97614ae.1920x1080.jpg?t=1649371287",
    "Slug": "maneuver-warfare",
    "Meta Title": "Maneuver Warfare: May 25, 2020, Decisive Action Games and...",
    "Meta Description": "Looking for information on Maneuver Warfare? Check out the release date (May 25, 2020), developer insights from Decisive Action Games, and a complete ga...",
    "Alt Text Image": "Official header image for Maneuver Warfare game - Steam 1285180",
    "Canonical URL": "https://gusku.site/game/maneuver-warfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Maneuver Warfare\", \"description\": \"Looking for information on Maneuver Warfare? Check out the release date (May 25, 2020), developer insights from Decisive Action Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Decisive Action Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Decisive Action Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1285180/header.jpg?t=1649371287\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}