{
    "AppID": 621850,
    "Name": "Maze Bandit",
    "Release date": "Jul 6, 2017",
    "About the game": "Build, defend and plunder! Create your own dungeon labyrinth using dozens of deadly traps and devices. Compete against other Bandits by mastering their mazes and stealing their princesses. Loot your enemies’ treasure and use the money to upgrade your castle and build the best dungeon in the realm. CREATE YOUR DUNGEON HERO To save the princesses from your enemies’ dungeons you need a worthy champion. With over 150 customization options to choose from there are countless unique heroes to create! BUILD YOUR DUNGEON To defend your princess you’ll need to build your own impenetrable dungeon. Using dozens of deadly traps and terrifying monsters as your dungeon defense, the aim is to build a maze so challenging that no other bandit can complete it and steal your princess. SAVE THE PRINCESSES (AND GET RICH) Whether you’re battling through single player mode or crawling through player made dungeons in PvP mode, you’ll have to navigate the deadly mazes to find and rescue the sleeping princess. What’s that? Of course we’re getting paid! You’ll find plenty of chests and coins to loot as you raid enemy dungeons – it’s yours to spend. UPGRADE YOUR CASTLE Spend your hard earned – no, stolen – money on upgrading your castle and dungeon maze. Gain access to more options and upgrade your tricky traps and deadly constructions to make your maze even more difficult for other players to clear. BECOME AWESOME Watch replays of how other players beat your maze. Identify flaws in your defense and improve your dungeon, then get sweet revenge on the person who beat you! Compete against your Facebook friends and top the leaderboards to become the best Maze Bandit in the kingdom. MAZE BANDIT – FEATURES  - Progress through 90 single player levels set in 6 unique kingdoms. - Challenge other players by designing and upgrading tricky constructions and traps in your own maze.  - Customize your hero. Change his clothes and appearance.  - Grow rich by discovering and plundering rival Bandit mazes and take over their sleeping beauties.  - Develop your castle and gain access to more possibilities.  - Use powerful boosts to help you beat the most challenging mazes.  - Be the best in daily, weekly and global leaderboards. - Watch replays to see how other players beat your Maze.  - Revenge and show who’s the boss.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/621850/header.jpg?t=1499334232",
    "Price": 2.99,
    "Developers": "Gamestone Studio",
    "Publishers": "Gamestone Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/621850/ss_dcad3c5e3ef41dc936b330bf39a41fd231e25315.1920x1080.jpg?t=1499334232,https://cdn.akamai.steamstatic.com/steam/apps/621850/ss_7dea8432d8738bed0f4ff35f80d58f513e705c4e.1920x1080.jpg?t=1499334232,https://cdn.akamai.steamstatic.com/steam/apps/621850/ss_371d8e02a6f7b7361c66394d0f1181a9ecca0e01.1920x1080.jpg?t=1499334232,https://cdn.akamai.steamstatic.com/steam/apps/621850/ss_51a4794cf92305f89faa085ba463f7fa2e5968e8.1920x1080.jpg?t=1499334232,https://cdn.akamai.steamstatic.com/steam/apps/621850/ss_aeffc3eacfeef55caa8383aeced634f35739c63c.1920x1080.jpg?t=1499334232",
    "Slug": "maze-bandit",
    "Meta Title": "Maze Bandit: Jul 6, 2017, Gamestone Studio and Full Overview",
    "Meta Description": "Looking for information on Maze Bandit? Check out the release date (Jul 6, 2017), developer insights from Gamestone Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Maze Bandit game - Steam 621850",
    "Canonical URL": "https://gusku.site/game/maze-bandit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Maze Bandit\", \"description\": \"Looking for information on Maze Bandit? Check out the release date (Jul 6, 2017), developer insights from Gamestone Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gamestone Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamestone Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/621850/header.jpg?t=1499334232\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}