{
    "AppID": 956060,
    "Name": "Mittelborg: City of Mages",
    "Release date": "Jun 20, 2019",
    "About the game": "⠀⠀⠀⠀You try on a crown of the immortal Chancellor in Mittelborg. There is the Ancient Order of mages, protecting and watching for the Tree of Order since the beginning of time in the city. The Tree of Order shows the balance of all existing powers in the Universe. ⠀⠀⠀⠀If the Tree flourishes, it gives mages aether to prevent the chaos in the world of magic. As the last chancellor disappeared in a expedition, the Tree of Order keeps fading away. It leads to the massive imbalance of sacred source of powers and outbreaks of mysterious mortal tempests. ⠀⠀⠀⠀The new Chancellor has a power of rebirth. After death all memories and skills are saved. But this power is a heavy burden. The scent of chaos hangs heavy in the air of Mittelborg. Your goal is to investigate the reason for the upcoming chaos. Build your unique tactic to survive and discover the ending, where all secrets of Mittelborg are revealed. Will the Chancellor save the magic? You are the one to decide.  Protect the city! Mittelborg is the heart of this world and thousands of swords are aimed at it. Monsters, nomads, mercenaries, living deads and rebellious spirits — Chaos does not sleep and besieges the Universe. Collect resources, get ready for tempests, keep guards on the walls and mages at the towers. While lots of blood are spilt, remember what is at stake. It is better to shed a gallon of blood than lose a single leaf from the Tree of Order.  Think and rule! Mittelborg claims for your unfaltering watch, Chancellor! Different events enforce you to make hard decisions all the time. Whom will you sacrifice: a warrior or a mage? Do you execute or pardon? Spend aether on the repairs or upgrades of weapons? Power is a heavy burden. Will you protect the most sacred, or will you drench it in blood...  Fight, die, fight again! Human life is worth nothing where waves of Chaos swamp the shores of Order. It is so easy to die here, and no one worries about tomorrow. No one but you! You are the immortal one. Each reborn is new knowledge. You hone the strategy and save all previous experience, and it will help you endure a little bit longer this time.  The world is huge. You start a long and dangerous adventure. There will be dozens of worlds and hostile races, hundreds of unique events, thousands of intertwined destinies and stories ... and you have to take all the risks and make the right choices.  Music — a powerful magic! Sire, your rule is accompanied by 10 original orchestral soundtracks. Together with music you are bound to succeed!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/956060/header.jpg?t=1577634418",
    "Price": 14.99,
    "Developers": "Armatur Games",
    "Publishers": "Asterion Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/956060/ss_619661d828a76d85673f5819c2b1d30609fda1e9.1920x1080.jpg?t=1577634418,https://cdn.akamai.steamstatic.com/steam/apps/956060/ss_eb7ca12029fd46cddf3bd7c4a52ff417dae4a132.1920x1080.jpg?t=1577634418,https://cdn.akamai.steamstatic.com/steam/apps/956060/ss_fb92cb390e9e83932d146a07533bea47959df2ca.1920x1080.jpg?t=1577634418,https://cdn.akamai.steamstatic.com/steam/apps/956060/ss_285bb911e9a7d8383159d979bf0c99689e61198b.1920x1080.jpg?t=1577634418",
    "Slug": "mittelborg-city-of-mages",
    "Meta Title": "Mittelborg: City of Mages: Jun 20, 2019, Armatur Games an...",
    "Meta Description": "Looking for information on Mittelborg: City of Mages? Check out the release date (Jun 20, 2019), developer insights from Armatur Games, and a complete g...",
    "Alt Text Image": "Official header image for Mittelborg: City of Mages game - Steam 956060",
    "Canonical URL": "https://gusku.site/game/mittelborg-city-of-mages",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mittelborg: City of Mages\", \"description\": \"Looking for information on Mittelborg: City of Mages? Check out the release date (Jun 20, 2019), developer insights from Armatur Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Armatur Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Asterion Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/956060/header.jpg?t=1577634418\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}