{
    "AppID": 1446780,
    "Name": "MONSTER HUNTER RISE",
    "Release date": "Jan 12, 2022",
    "About the game": "Rise to the challenge and join the hunt! In Monster Hunter Rise, the latest installment in the award-winning and top-selling Monster Hunter series, you’ll become a hunter, explore brand new maps and use a variety of weapons to take down fearsome monsters as part of an all-new storyline. The PC release also comes packed with a number of additional visual and performance enhancing optimizations. Ferocious monsters with unique ecologies Hunt down a plethora of monsters with distinct behaviors and deadly ferocity. From classic returning monsters to all-new creatures inspired by Japanese folklore, including the flagship wyvern Magnamalo, you’ll need to think on your feet and master their unique tendencies if you hope to reap any of the rewards! Choose your weapon and show your skills Wield 14 different weapon types that offer unique gameplay styles, both up-close and from long range. Charge up and hit hard with the devastating Great Sword; dispatch monsters in style using the elegant Long Sword; become a deadly maelstrom of blades with the speedy Dual Blades; charge forth with the punishing Lance; or take aim from a distance with the Bow and Bowguns. These are just a few of the weapon types available in the game, meaning you’re sure to find the play style that suits you best. Hunt, gather and craft your way to the top of the food chain Each monster you hunt will provide materials that allow you to craft new weapons and armor and upgrade your existing gear. Go back out on the field and hunt even fiercer monsters and earn even better rewards! You can change your weapon at any of the Equipment Boxes any time, so the possibilities are limitless! Hunt solo or team up to take monsters down The Hunter Hub offers multiplayer quests where up to four players can team up to take on targets together. Difficulty scaling ensures that whether you go solo or hit the hunt as a full four-person squad, it’s always a fair fight. Stunning visuals, unlocked framerate and other PC optimizations Enjoy beautiful graphics at up 4K resolution, HDR with support for features including ultrawide monitors and an unlocked frame rate make to make this a truly immersive monster-hunting experience. Hunters will also get immediate access to a number of free title updates that include new monsters, quests, gear and more. Enjoy an exciting new storyline set in Kamura Village This serene locale is inhabited by a colorful cast of villagers who have long lived in fear of the Rampage - a catastrophic event where countless monsters attack the village all at once. 50 years after the last Rampage, you must work together with the villagers to face this trial. Experience new hunting actions with the Wirebug Wirebugs are an integral part of your hunter’s toolkit. The special silk they shoot out can be used to zip up walls and across maps, and can even be used to pull off special attacks unique to each of the 14 weapon types in the game. Buddies are here to help The Palico Felyne friends you already know and love from previous Monster Hunter adventures are joined by the brand new Palamute Canyne companions! Wreak havoc by controlling monsters Control raging monsters using Wyvern Riding and dish out massive damage to your targets! Fend off hordes of monsters in The Rampage Protect Kamura Village from hordes of monsters in an all-new quest type! Prepare for monster hunting on a scale like never before!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1446780/header.jpg?t=1656665891",
    "Price": 59.99,
    "Developers": "CAPCOM Co., Ltd.",
    "Publishers": "CAPCOM Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1446780/ss_f8249da14987e3c2d10fd4024736f28774c713da.1920x1080.jpg?t=1656665891,https://cdn.akamai.steamstatic.com/steam/apps/1446780/ss_25686086b61ca88a859bc20d588682be92ab4d63.1920x1080.jpg?t=1656665891,https://cdn.akamai.steamstatic.com/steam/apps/1446780/ss_d8d96313f1049c800d37a3fc521f06f926fca3ac.1920x1080.jpg?t=1656665891,https://cdn.akamai.steamstatic.com/steam/apps/1446780/ss_961c552a99c5c64689bebf0e272b13c80947f644.1920x1080.jpg?t=1656665891,https://cdn.akamai.steamstatic.com/steam/apps/1446780/ss_3f1a758231a78ab3cdd76c2f8f04d5bbec45faeb.1920x1080.jpg?t=1656665891,https://cdn.akamai.steamstatic.com/steam/apps/1446780/ss_5a601d6ecee22fcd0cb6142aec5ff7de1e1de091.1920x1080.jpg?t=1656665891",
    "Slug": "monster-hunter-rise",
    "Meta Title": "MONSTER HUNTER RISE: Jan 12, 2022, CAPCOM Co., Ltd. and F...",
    "Meta Description": "Looking for information on MONSTER HUNTER RISE? Check out the release date (Jan 12, 2022), developer insights from CAPCOM Co., Ltd., and a complete game...",
    "Alt Text Image": "Official header image for MONSTER HUNTER RISE game - Steam 1446780",
    "Canonical URL": "https://gusku.site/game/monster-hunter-rise",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MONSTER HUNTER RISE\", \"description\": \"Looking for information on MONSTER HUNTER RISE? Check out the release date (Jan 12, 2022), developer insights from CAPCOM Co., Ltd., and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CAPCOM Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CAPCOM Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1446780/header.jpg?t=1656665891\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}