{
    "AppID": 839910,
    "Name": "Mythgard",
    "Release date": "Sep 18, 2020",
    "About the game": "Mythgard is set in a modern world where mythical creatures and gods roam among mere mortals. A world where winged beasts battle commercial jets for dominance of the skies and magic rivals the everyday use of technology. Harnessing these powers and utilizing the unique mechanics of Mythgard is the only way to prove your worth and claim your mark among the legends of Mythgard. Mythgard is a game built from the ground up with gameplay and board interactions in mind. The unique mana-burn system puts you in control of your resources while adding a strategic depth yet to be seen in any other CCG. The process is simple, burn a card to create a mana gem of that color, the burnt card is then cycled back into your deck and cannot be burnt again, but can be played. The battle board is broken up into seven lanes, which allows for even more player ownership in a match. Casting spells, placing creatures and positioning your magical enchantments are all decisions you’ll face every turn. The sheer amount of both versatility and player agency opens Mythgard up for some of the most tense match-ups you’ll play in any CCG. Lore and story are at the very heart of Mythgard, from the game’s chapter-based campaign to the flavor text on the cards, even the different abilities are built with lore in mind. The world of Mythgard is unhinged from any previous existing world. It’s a modern dark-fantasy dystopia where the game is free to go any route it chooses. Every faction in Mythgard is inspired by a real-world culture. From Eastern Europe to South America. The focus on fusing real-world cultures, traditions, and events within the world of Mythgard offers endless possibilities going forward with the game’s content. Rings of Immortality, the first expansion in Mythgard, brought the summer games into this dark world. Offering a platform for gods, vampire lords, and even some determined axolotls to stand toe-to-toe. Future expansions will continue the story of the game, pushing events and tribal archetypes in new and unexpected directions. No CCG would be complete without a host of features to support both your play style and help you progress in the game. Almost any feature you can think of is in Mythgard, don’t believe us, here’s a detailed list: -2v2 - The ultimate Mythgard co-op challenge, grab a friend, optimize your decks and looks to be the best team in the Mythgard universe! -Story campaign - Chapter 1 of the story not only introduces you to the dark world of Mythgard but also acts as the perfect starting point for new players. -Draft - No CCG would be complete without a limited game mode. Mythgard offers both PvE and PvP draft options as well synchronous and asynchronous drafting. -In-game deck tracker - Easily check which cards you’ve seen, burned, and played with the deck tracker built right in! -Live spectating - Jump into any match currently being played on ladder and check out some gameplay. -Replay system - Want to see where you misplayed? Jump into any one of your previous 100 matches to watch a full replay. -In-game tournament system - Host or compete in community and official tournaments in the game client, from $1k community Opens to private draft parties with friends. -Challenging puzzles - Tired of always winning on ladder? In-game puzzles offer some of the most challenging lines of play in the game. Can you complete them all? -Featured decks - New to the game and not sure what to play? The featured decks rotate weekly and offer everyone a set of optimized deck to play in any game mode. -Full cross-play with PC and mobile devices Everything in Mythgard can be earned without spending any money and without requiring endless grinding. Players starting their Mythgard journey will be able to capitalize on the Faction Missions, which offer the equivalent of over 25 card packs and 40 wild cards. Every mode you play in Mythgard will reward you with both progress and coins (in-game currency). Every week you’re able to open the weekly chest to have a chance to earn up to an additional 12,000 coins. Mythgard respects your time as a player and rewards you for ‘just playing’. Be sure to keep an eye out for additional in-game rewards by joining our Discord.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/839910/header.jpg?t=1645721920",
    "Price": 0.0,
    "Developers": "Monumental, LLC",
    "Publishers": "Monumental, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_ecca53d34e8d96e6689a5b3dfdbd93ba7e7bf820.1920x1080.jpg?t=1645721920,https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_45210936b4a4ecafdca7b82c144957c0c20ad28a.1920x1080.jpg?t=1645721920,https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_0d2a0ce48e7d255de1319d021d30dba7b35f9159.1920x1080.jpg?t=1645721920,https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_b3875a9984611f3fc8b984332d5b4944200aba63.1920x1080.jpg?t=1645721920,https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_1c3dd6c1cc6d1ab8ed41687d95f3ee61ee6543fa.1920x1080.jpg?t=1645721920,https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_a0b6ca71b0aad046d72ccb7a4da1388ae7f93918.1920x1080.jpg?t=1645721920,https://cdn.akamai.steamstatic.com/steam/apps/839910/ss_278199cc52091647ae141da9ffc0a4db018bddda.1920x1080.jpg?t=1645721920",
    "Slug": "mythgard",
    "Meta Title": "Mythgard: Sep 18, 2020, Monumental, LLC and Full Overview",
    "Meta Description": "Looking for information on Mythgard? Check out the release date (Sep 18, 2020), developer insights from Monumental, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Mythgard game - Steam 839910",
    "Canonical URL": "https://gusku.site/game/mythgard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mythgard\", \"description\": \"Looking for information on Mythgard? Check out the release date (Sep 18, 2020), developer insights from Monumental, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Monumental, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Monumental, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/839910/header.jpg?t=1645721920\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}