{
    "AppID": 650820,
    "Name": "Psychic Isolation",
    "Release date": "Aug 15, 2017",
    "About the game": "Project is back in development! This will take some time, but everythin is being redone from scratch. The game will receive a visual upgrade and a complete overhaul in 2022. Follow @Psychic_Isolation on twitter for weekly updates! [Download the free demo for the full game containing one out of two story paths before buying! Buying the Early access version will grant you access to the second story path and all future content earlier and for free!] “See you next week!” Those were the last words of your mother's note before you left for Spain. They kept running through your mind as the plane landed in Germany. Had it only been a week? It felt like longer, and you were really starting to miss them. They both work a lot, so they couldn't say goodbye when you left. But you would see them again soon anyways , wouldn't you? You see a huge crowd as you leave the plane and head towards the baggage claim to grab your luggage. Many of them look exhausted, and you spot a few propped up on their luggage trying to catch some sleep. Others look exhausted more emotionally than physically, crying from a desparate attempt to make sense of the world. After fighting your way through the crowd you find a reasonably comfortable place to sit on the opposite platform of the nearby train station and wait. And wait. And wait. It never arrives. Luckily a group of people headed the same direction offers you a ride. They drop you off at a bus stop near your home. It was a long journey so far, and you were tired from the long flight to begin with. Unfortunately, the busses don't run this late, so you have to make the last few kilometers yourself. As you near your home you realize your parents haven't tried to call you the entire way home. It's taken you much longer than you thought it would, and usually they would call to make sure you're all right. It's four o'clock in the morning when you see your home in the distance, and after all the mess at the airport, you are hoping to finally get some rest... Rest you weren't meant to get this night... Psychic Isolation is a narrative survival horror game with a story revolving around the antagonists of the game. As you are hiding from those who are trying to kill you, you get to know their emotions, their feelings and the hell they have gone through over the last few days - which ultimately led to them to starting to see their friends as enemies. If you don't like being scared, it's okay we've got you covered - the game's scares can be disabled. This allows anyone to experience the strong story and narration Psychic Isolation has to offer. Players can freely roam the map and read about their history as they progress through the story without having to worry, hide or escape from a murderer. The game features two unique paths, letting you experience two different stories depending on your choices. Episode one, determines which of the two paths you will play. Early Access Psychic Isolation will be in early access for as long as it takes to complete the first two episodes, which will be included in the final release. Early access purchasers will get the first two episodes for a discounted price and all future content for free, in addition to early previews of each episode while they are in development. More content will be added to early access as it becomes available, but in the meantime feel free to play the demo before deciding whether you would like to purchase early access.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/650820/header.jpg?t=1637173781",
    "Price": 1.29,
    "Developers": "thiefbug,Nocthulus",
    "Publishers": "thiefbug",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/650820/ss_0808dd287691ecf1aef152fb958966f5f4a8db66.1920x1080.jpg?t=1637173781,https://cdn.akamai.steamstatic.com/steam/apps/650820/ss_f65a899dda8b3f6c8b423b5b78703b7b07b83264.1920x1080.jpg?t=1637173781,https://cdn.akamai.steamstatic.com/steam/apps/650820/ss_aa4cb024e909d2cf59e99e48bb0d1bcd0f110bec.1920x1080.jpg?t=1637173781,https://cdn.akamai.steamstatic.com/steam/apps/650820/ss_e3bab4ec852b829fa59ffd120c83d8a67c156287.1920x1080.jpg?t=1637173781,https://cdn.akamai.steamstatic.com/steam/apps/650820/ss_07f64ba56c8b0673d31dd8709391218687a7e830.1920x1080.jpg?t=1637173781,https://cdn.akamai.steamstatic.com/steam/apps/650820/ss_c8d23156f53fb8b103cad07ce2a104c0f11d4819.1920x1080.jpg?t=1637173781",
    "Slug": "psychic-isolation",
    "Meta Title": "Psychic Isolation: Aug 15, 2017, thiefbug,Nocthulus and F...",
    "Meta Description": "Looking for information on Psychic Isolation? Check out the release date (Aug 15, 2017), developer insights from thiefbug,Nocthulus, and a complete game...",
    "Alt Text Image": "Official header image for Psychic Isolation game - Steam 650820",
    "Canonical URL": "https://gusku.site/game/psychic-isolation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Psychic Isolation\", \"description\": \"Looking for information on Psychic Isolation? Check out the release date (Aug 15, 2017), developer insights from thiefbug,Nocthulus, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"thiefbug,Nocthulus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"thiefbug\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/650820/header.jpg?t=1637173781\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}