{
    "AppID": 404580,
    "Name": "Relive",
    "Release date": "Oct 15, 2015",
    "About the game": "Relive is a game about cardiopulmonary resuscitation, but it is also an adventure game. The main purpose is to increase the awareness about this topic and push people, especially teenagers and young adults, to take a CPR classes and be prepared to intervene in case of need. While the topic is serious, we tried to create a fun and entertaining game, a SCI-FI opera where players can enjoy their gaming experience while the CPR concept slips through the game. To move forward in the story and complete successfully Relive, you will need to learn the bases of CPR, in an interesting and non-invasive way. To keep the CPR skills razor sharp a tournament mode encourages group play. Family, schools and friends will be able to organize fast and fun CPR challenges and see who will be able to beat the best score. Why CPR? In Europe every day 1.000 people die of cardiac arrest. If immediate CPR is performed, the chances of survival remarkably increase. In more than 70% of instances, cardiac arrest is witnessed and CPR could be initiated by bystanders. As of today, in Europe only in 15% of cases witnesses perform CPR (European average). Taking a CPR class is the best way to rise this 15% of bystanders and save lives with no additional risk. Is Relive really free? Yes, Relive is completely free. The development of this game was made possible thanks to Future of Health Award, which purpose is to “bring serious gaming and healthcare together in order to contribute to more advanced healthcare across Europe“. Project Coordinator Federico Semeraro, Italian Resuscitation Council, Bologna Scientific Supervision - Italian Resuscitation Council, Bologna Erga Cerchiari, Past-President Giuseppe Ristagno, Scientific Committee Tracking engine - Istituto di Tecnologie della Comunicazione, dell’Informazione e della Percezione, Scuola Superiore Sant’Anna, Pisa Antonio Frisoli, Associate Professor Claudio Loconsole, Post-Doc Research Fellow Fabio Stroppa, Scholarship Holder Nicola Mastronicola, Scholarship Holder Game developement - Studio Evil Dutch translation - Kirsten Eijkelenboom Relive team is the winner of the Future of Health Award 2012. The award is a joint initiative of CZ healthcare insurance and Games for Health Europe",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/404580/header.jpg?t=1478100911",
    "Price": 0.0,
    "Developers": "Studio Evil",
    "Publishers": "Studio Evil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/404580/ss_4dfa3e337a2b59fd5a09a18bf55c394f5fe7095e.1920x1080.jpg?t=1478100911,https://cdn.akamai.steamstatic.com/steam/apps/404580/ss_8457dd514871d252594d3efe6e476d03c8b81bd5.1920x1080.jpg?t=1478100911,https://cdn.akamai.steamstatic.com/steam/apps/404580/ss_81ce164a775f0cd6eb565e7f5984f5431cf4d19b.1920x1080.jpg?t=1478100911,https://cdn.akamai.steamstatic.com/steam/apps/404580/ss_22c13dab49e69393c9e8c59a7700588d853d4b85.1920x1080.jpg?t=1478100911,https://cdn.akamai.steamstatic.com/steam/apps/404580/ss_2cd50e44ea9763694ff166e25d89ecca1f6ad1b3.1920x1080.jpg?t=1478100911,https://cdn.akamai.steamstatic.com/steam/apps/404580/ss_d4ed080cc7cb05b48f661d0946d0d5a44b028532.1920x1080.jpg?t=1478100911",
    "Slug": "relive",
    "Meta Title": "Relive: Oct 15, 2015, Studio Evil and Full Overview",
    "Meta Description": "Looking for information on Relive? Check out the release date (Oct 15, 2015), developer insights from Studio Evil, and a complete game summary.",
    "Alt Text Image": "Official header image for Relive game - Steam 404580",
    "Canonical URL": "https://gusku.site/game/relive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Relive\", \"description\": \"Looking for information on Relive? Check out the release date (Oct 15, 2015), developer insights from Studio Evil, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Evil\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Evil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/404580/header.jpg?t=1478100911\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}