{
    "AppID": 845490,
    "Name": "RESEQUENCED",
    "Release date": "Apr 23, 2020",
    "About the game": "While investigating the mysterious disappearance of her parents, a college student's DNA is modified. RE*SEQUENCED is a 3D open-world adventure game focused on story, exploration and combat. You play as Lux Hart, a college student who travels to her parents' rural home during summer break, only to find them missing. While investigating their disappearance, she uncovers their connection with the mysterious underground agency The Redaction Commission. Using alien tech acquired by the Commission, her DNA is edited and resequenced, arming her with extraordinary abilities. Here are some of the mechanics and features of the game: * Lux can fight with DNA mods, which are essentially superpowers that are grouped into four classes: Incinerate, Freeze, Shock and Invoke. * She can also use guns. At present, there are eight gun types defined. * Guns can be upgraded using weapon parts, which can be looted from fallen enemies, and found in crates placed throughout the game. Six weapon attributes can be upgraded, including damage, reload speed, range, etc. * Lux gains skill points as she levels up. These can be spent to customise her abilities; e.g. permanently increase her overall health, reduce the cooldown time of her DNA mods, etc. * Lux’s outfits (and hair) can be changed. There are over 800 different clothing and hair items in the game, so it's easy to customise Lux to a unique look. * Collectibles are scattered across each level. There are almost 100 collectible items in the game, such as documents, audio files, etc. In addition, consumable items such as medkits and shield energy packs can be found near combat areas. * Each level contains tasks (e.g. 'remove propaganda posters') which can be used to earn XP. Lux can also earn XP by completing challenges (e.g. 'kill 10 enemies with the sniper rifle'). * There are a huge variety of enemies. We won’t spoil the journey here, but once you get into the story, you’ll understand why there are so many different creatures from mythology, urban legends and horror that actually exist in the game. * The game has 12 distinctly different environments, including a deserted nuclear testing facility, a derelict Chinese spacecraft, a post-apocalyptic town, a middle Eastern desert, underground caves, snowfields, and more. All of the above features are already implemented and running in the game right now. We have a lot of ideas about what we’d like to add, but we’d love to get feedback from the gaming community! RE*SEQUENCED is available now on Windows and Mac.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/845490/header.jpg?t=1598241391",
    "Price": 4.99,
    "Developers": "Based On The Play",
    "Publishers": "Based On The Play",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_0d4533895b206ebc536e09c81e79c6571053e137.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_0538f50655eeef895b88dc062c62ae3be868dd17.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_fb24c02793bbc39ea7e0971bb7a6d5791ab9298a.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_6ef2acab5a52e5e9e1fb41c2eeecc6cf2e15ff30.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_ef97cc4797b27b344f1200cc1071aca646b76b3c.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_37afc5955b599f8024a479c7ab7695ab9c7b2c29.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_a68c8ea20c382b6afc7c64f2cfe68f6d0695abfb.1920x1080.jpg?t=1598241391,https://cdn.akamai.steamstatic.com/steam/apps/845490/ss_96f2df8d7699b27f170478f6c6e5e64db18e601d.1920x1080.jpg?t=1598241391",
    "Slug": "resequenced",
    "Meta Title": "RESEQUENCED: Apr 23, 2020, Based On The Play and Full Ove...",
    "Meta Description": "Looking for information on RESEQUENCED? Check out the release date (Apr 23, 2020), developer insights from Based On The Play, and a complete game summary.",
    "Alt Text Image": "Official header image for RESEQUENCED game - Steam 845490",
    "Canonical URL": "https://gusku.site/game/resequenced",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RESEQUENCED\", \"description\": \"Looking for information on RESEQUENCED? Check out the release date (Apr 23, 2020), developer insights from Based On The Play, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Based On The Play\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Based On The Play\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/845490/header.jpg?t=1598241391\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}