{
    "AppID": 1064050,
    "Name": "Rick Rack",
    "Release date": "Jul 31, 2019",
    "About the game": "Have you ever wondered that if you had taken the other option in life, how life would be different ? Rick Rack uses time loop very delicately, each day all drivers drive out to their destinations at the same time. They all need to reach their destinations quickly and safely. Player will be driving all characters at the same time but also not at the same time. Each day the decision making citizen must reach its destination safely, if not stop the accident from occurring. Choices and Decisions all will be remembered and have repercussions and will lead to solving the mystery on the end day or leading to the town's doom. Rick Rack is inspired from the movie Donnie Darko, takes place in 1960s-70s within a small European town of Times-Ville, which gets affected by a major event. That major event causes a Time Ripple and creates an Alternate Timeline, looping 31 days. All of the citizens of Times-Ville are affected, most affected are 15 specific citizens who had taken some choices during these days which directly and indirectly cause the change in the Major Event in play. About the Game Rick Rack is city driving game, in 1960-70s European town where the player takes control of 15 different people and their lives to change their destiny and resume their lives in the Main Timeline by exiting this Alternate Timeline. It will be a chain of events that help exit the Alternate Timeline. Can you make those decisions ? Features One Big planned town of Times-Ville based on old European towns. 18 different cars to drive. Ranging from Sports, Muscle, Trucks to Vintage cars. Time Rewinding. Rewind time to set yours and other path correctly. Avoid accidents and wrong Decisions. Story based Choices. Ranging from zero importance to life depending choices need to be made, all on the shoulders of the player. Arcade style Driving. The driving is arcade style i.e. Fast and Smooth. Drive around Town Rick Rack has a beautifully crafted European town from the 60s-70s era, with Gothic architecture style. Within town Player gets to control 15 different citizens, who have their own life problems at hand. The game follows the lines of the Butterfly effect, small decisions create big impacts on the timeline. Few correct decisions of the citizens will avert the Big Disaster that takes place in the town. That is the goal. Rewind The Town of Times-Ville is stuck in a Time Loop, which allows the player to Rewind Time. Rewinding Time rewinds the time for the complete town, trees, birds, litter, flying envelopes &amp; all the citizens in perspective of the current citizen. Driving into a citizen disables them to do their daily chores which can hinder in the corrective form that needs to be in place to re-unite the Timelines. Choices Rick Rack has 15 citizens who have taken some critical decisions between these 30 days. Small decisions sometimes cause big implications. To re-unite the Alternate Timeline into the Main one. Correct decisions and patterns need to be followed.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1064050/header.jpg?t=1627217922",
    "Price": 8.99,
    "Developers": "Mayawi software",
    "Publishers": "Mayawi software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_bd1f6a5a8b16057652904f5cde7b25f207f00dfe.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_d5d5a0135ba2b7456155e76279ba40edc3c6aa92.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_c80e68ddceef2401705fbee0272abc24a751ca1e.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_15fcb5dbf533f75defd4dbacfaaa2029581b1db1.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_ec68983559b78c86b809e1bf29a6bbfc113363ff.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_5ad8c8c37523bb36f5a20c8b42aeccaff5733139.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_d9bef4f6185434d0f0f6ea1bd0e53ebe6dea0fb0.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_db62161abcd7729c9010b5ddbc9e354073283c18.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_d495d5cbf712ab0319634a53ccf68924a089709a.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_dcf75e3bf1b30eb67c93537240955b3783e23141.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_f784a1461da1a541fe597245f50c98cce4520c4d.1920x1080.jpg?t=1627217922,https://cdn.akamai.steamstatic.com/steam/apps/1064050/ss_b956fc23b28ff4bb1b013f419ebca1b289729736.1920x1080.jpg?t=1627217922",
    "Slug": "rick-rack",
    "Meta Title": "Rick Rack: Jul 31, 2019, Mayawi software and Full Overview",
    "Meta Description": "Looking for information on Rick Rack? Check out the release date (Jul 31, 2019), developer insights from Mayawi software, and a complete game summary.",
    "Alt Text Image": "Official header image for Rick Rack game - Steam 1064050",
    "Canonical URL": "https://gusku.site/game/rick-rack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rick Rack\", \"description\": \"Looking for information on Rick Rack? Check out the release date (Jul 31, 2019), developer insights from Mayawi software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mayawi software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mayawi software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1064050/header.jpg?t=1627217922\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}