{
    "AppID": 328080,
    "Name": "Rise to Ruins",
    "Release date": "Oct 14, 2019",
    "About the game": "Rise to Ruins is at heart a godlike village simulator , but it also throws in plenty of familiar game play mechanics from classic real-time strategy and resource management games like Black and White, Settlers, ActRaiser and many others. It also throws in some twists by melding in some tower defense and survival elements in an attempt to create a new kind of godlike village simulator. The goal is to try to bridge the gap between the depth and complexity of traditional village simulators, the fun of godlikes and tower defense, with the simplicity of real-time strategy games. Build A Village, and Die Trying! A major part of the game is village management, and trying to discover new and creative ways to use the tools at your disposal to keep yourself alive as long as possible while you defend your village at night from the raging hoard of monsters, and try to expand in the day time. In this game, you will lose frequently, but with every failure you learn a little bit more about how to survive and apply that knowledge to your next attempt. Frequent 100% Free Content Patches! Like getting new content and not having to pay for it? Well, this is the game for you. For years Rise to Ruins had gotten frequent and completely free content patches, expanding the base game regularly! Several Game Modes Survival is the game the way it was meant to be played, as a brutal survival style village sim, you will probably die often trying to figure out the best way to survive, but that's half the fun right?! Traditional is very similar to Survival, but it's balanced much like a traditional village simulator with some godlike and RTS elements sprinkled on top. The monster spawn rates are much lower, and the main focus is keeping your village happy and fed. It's a very easy mode, designed for casual players, or players just wanting to experiment. Nightmare makes survival mode look like it's for carebears. Mostly, it's just like survival mode, but difficulty levels are ramped up through the roof. This is the masochist's mode. Peaceful is the mode for you if you want to play a more laid back, classic village management game. There are no monsters what so ever, and no need to defend people. Just chill out and try to keep your villagers alive. Sandbox , like the name implies, is a mode where you can play around with the game mechanics. Change the time of day, weather, spawn monsters or villagers, or even edit the map while you're playing on it. This is the ultimate 'Screw around' mode for players wanting to play with the game mechanics. Custom allows you to make up your own mode. You can adjust day length, how many days in a season, how many monsters spawn, and all sorts of other things. If you don't like the game's default settings, make your own up!. Godlike Elements Not only can you manage your village, but you also have many godlike abilities at your disposal. You can alter the terrain, blast enemies from afar, pick up objects or creatures, heal your villagers, speed up resource growth and all sorts of other fun godly stuff. You're part of this world just as much as your villagers are. Tower Defense Elements This isn't a tower defense game, but you'll still be getting some tower defense vibes from it! Use classic tower defense mechanics to defend your village at night, creating walls of towers behind maze walls to help keep your little villagers alive as long as possible, and if tower defense isn't your thing. That's ok! You can also raise an army of golems and recruit guards to defend the village. World Maps and Regions! The game has tons of hand made maps for you to select from (You can also make your own if you like!) Every biome follows a certain theme (Forest, Desert, Drylands, etc). Start your village anywhere you like, and slowly conquer the whole world! (Well, try to anyway, you'll probably just die.) The Soundtrack! A full original soundtrack, made by Bibiki Garcia that blends orchestral instruments in a way fans of old 1990s era PC gaming will love and remember! SixtyGig Games is a DRM free independent game developer! Rise to Ruins will not now or ever in the future have any sort of DRM! Piracy protection only hurts you guys, the loyal paying players. So you rest assured knowing that once you buy yourself a copy of Rise to Ruins you'll never again have to concern yourself with nagging questions about if you can continue playing the game down the road due to something like always-online logins, lost registration codes or because you bought a new computer and you're only licensed to put the game on one. All I ask from you is to be reasonable and responsible, you can buy the game and play it as much as you like, wherever you like. Just tell your friends to support my DRM-Free philosophy and buy their own copy! Free Content Patches, no paid-DLC I don't believe in paying for Downloaded Content. If you buy Rise to Ruins you will have access to the entire game and all the content I'll ever create for it, forever! I believe DLC is greedy, and you deserve to have the full gaming experience from day 1, right out of the (figurative) box!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/328080/header.jpg?t=1644638210",
    "Price": 14.99,
    "Developers": "Raymond Doerr",
    "Publishers": "SixtyGig Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_5c87844580091796814583e9408ce62a468c5392.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_20a099e9de89ca00f4cee6c060753065dfd57f23.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_ca30ef5b4cee617bd36017da2953777f19b151c2.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_b9451ef13da675084783e87af293def31637bb12.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_0dfe4550cd5f2daad2faa43aedad4059eaf8db1f.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_6ec7e87a6abb974c4ae2d2ff3f7fef8321e5f3e5.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_116ddf5c19815f83c40ca9034355fdfbbdbe937d.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_bd07002cbce15a5081ed50434df57b3ff6d2cb3e.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_13f50720ad32c2c71797bd3c7630e9c3052d4fb8.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_95d84cf50114203d1643de7a428b0aae73f5cdb4.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_a8bbc17ed709012b677e3a509ff94d3f3e99aad9.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_190382f18be96ee4bd7706afc791a622bb19e5ba.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_17ba3c46b8c62ec81d709499a1fa3e3f4afd9de3.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_17e3463915a667dfb165d410c59168b559fdfe63.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_df089ac9fa6fccb822292613eb759a7104561de5.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_f16f4197535e37a1c04794e5af0f843fed38b92a.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_4fe1e488109fa6225d49ad799ab270f9921ec6f0.1920x1080.jpg?t=1644638210,https://cdn.akamai.steamstatic.com/steam/apps/328080/ss_e4e3aa29f3848fed2d49dcc50f0c81a3e4e2f67e.1920x1080.jpg?t=1644638210",
    "Slug": "rise-to-ruins",
    "Meta Title": "Rise to Ruins: Oct 14, 2019, Raymond Doerr and Full Overview",
    "Meta Description": "Looking for information on Rise to Ruins? Check out the release date (Oct 14, 2019), developer insights from Raymond Doerr, and a complete game summary.",
    "Alt Text Image": "Official header image for Rise to Ruins game - Steam 328080",
    "Canonical URL": "https://gusku.site/game/rise-to-ruins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rise to Ruins\", \"description\": \"Looking for information on Rise to Ruins? Check out the release date (Oct 14, 2019), developer insights from Raymond Doerr, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Raymond Doerr\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SixtyGig Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/328080/header.jpg?t=1644638210\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}