{
    "AppID": 555880,
    "Name": "Sairento VR",
    "Release date": "Feb 6, 2018",
    "About the game": "Sairento VR is best described as a VR cyber ninja simulator. Since its launch, Sairento VR has been gaining fans worldwide with its unique locomotion system. It is the one game in VR that allows you to experience the iconic 'bullet-time' scenes from The Matrix, blended with the slow-motion mayhem of the Max Payne game series, all while looking and feeling as badass as the Bride from Kill Bill. In Sairento VR, you play a cyber ninja. Perform triple jumps, wall runs, power slides, back flips and slow down time while blasting away at a foe before landing to deliver a lethal strike on another. Kit yourself with your weapons of choice - katanas, firearms, bows, throwing glaives - they are all at your disposal. Popular gamers like Node call it their ‘favourite VR game’ and Nathie, Cix Liv, JoshDub, TimDotTV and more all give it a thumbs up. Sairento VR was designed to be easy to pick up, but tough to master. The more time you spend with Sairento VR, the better you will perform the moves in the game and the more you will be rewarded with the unparalleled feeling of being the action hero of a big budget move production. - GET TRANSFORMED INTO A DEADLY CYBER NINJA - Sairento VR is a mission-driven, VR action role-playing game set in a re imagined Japan in the near future. In Sairento, you play as a member of the Silent Ones - a righteous but covert organization of seemingly ordinary people who practice the long forsaken code and martial arts of the ancient samurais and ninjas. Crafted painstakingly to provide an engaging and visually stunning first-person sword-fighting and gunplay - expect awesome weaponry, intuitive controls, challenging levels, menacing enemies and beautiful environments in your fight to restore order to the world. Get transformed into a mighty ninja warrior with an arsenal of ancient weapons with a futuristic twist and engage an endless horde of enemies across different locations. - GAME FEATURES - Chosen to be a Silent One for your outstanding character and trained by a sensei skilled in the art of ancient Japanese martial arts and modern fighting, you not only wield a mean katana, but are also skillful with guns and projectile weapons. Built for non-stop slash and shoot action, Sairento aims to set a new standard in VR games in terms of excitement and engagement. • Traverse a reimagined futuristic Japan and battle through 25 unique maps. • Gain mastery of 24 different weapons to unleash your inner ninja. • Have fun slashing and shooting away by yourself in single-player Missions or Campaign Mode, or go head-to-head against others in multiplayer 4v4 PVP and PVE modes. • A complete locomotion system - Walk or run, leap 15 feet into the air, perform multiple jumps, run across walls, power slide across the floor and perform back flips like only a true action super star could. • Engage enemies using our innovative combat system, allowing you to fight in slow motion and parry incoming projectiles like a boss. • Cut your enemies down with blade beams from your katana or simply do it the old fashioned way. Blast them to smithereens with good old fashioned guns. Demolish them with explosive arrows. Take them down with kunais and shurikens or slaughter them with a glaive. It's entirely up to you. • Keep upgrading your abilities and weapons as you accumulate experience from completing missions. Become the true ninja warrior hero you've always wanted to be. • Soak yourself in blood-pumping, exhilarating music as you become God in your own action movie. - SINGLE PLAYER MODE - • Have fun slashing and shooting away as a solo hero in single-player Missions or Campaign Mode. - ENDLESS MODE - • Go on an endless killing rampage. The difficulty increases over time but so do the rewards. - MULTI-PLAYER MODE - • Go head-to-head against others in multiplayer 4v4 PVP and PVE modes. - HARDWARE SUPPORT- • Compatible with HTC Vive, Oculus Rift and Windows MR HMD • Compatible with bHaptics Tactsuit, full body haptic suit for VR • Compatible with Hardlight VR's haptic suit • Compatible with TPCast • Compatible with KAT Walk",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/555880/header.jpg?t=1657760694",
    "Price": 29.99,
    "Developers": "Mixed Realms Pte Ltd,Swag Soft Holdings Pte Ltd",
    "Publishers": "Mixed Realms Pte Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_6b88a7463e7a9335f56ffe46a8b2635a895dd4f1.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_62aafbf75cfd05618adeeef6cc82d896f4938f67.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_d4a2b4d4bd337f3a71885a50f41f5e4e1753931b.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_0f88feae8c3d51d22153689cc0d9370125dbc738.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_8953364de73b34dc58f2c84571f41c03d71c6645.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_e3e51217a13f2f400cd501f2d614b86b348ea377.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_5f4952b57a162ce66daf1be303451450cf2e1269.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_a4440cd8ce73fe97544bca3e502ea1c8431bb558.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_c689f5038ab6d1bae06892b3b551dde5e5ac7664.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_50de9de7bb481f8273e7f4556d7d2100fee684aa.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_b670faade7e4f731e43364fdee5960382030f60f.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_67dbe3bfbd926ad046f1fd2ceccad1c65e64ea3c.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_0179d3dbe743d7ab335f20c34fabf679481f1e41.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_8b8c9b80ced48ae52b0b96566c870e2d3a4343a4.1920x1080.jpg?t=1657760694,https://cdn.akamai.steamstatic.com/steam/apps/555880/ss_62db2de5bd0436bc72ea4cb288e4168ff4aee02a.1920x1080.jpg?t=1657760694",
    "Slug": "sairento-vr",
    "Meta Title": "Sairento VR: Feb 6, 2018, Mixed Realms Pte Ltd,Swag Soft ...",
    "Meta Description": "Looking for information on Sairento VR? Check out the release date (Feb 6, 2018), developer insights from Mixed Realms Pte Ltd,Swag Soft Holdings Pte Lt...",
    "Alt Text Image": "Official header image for Sairento VR game - Steam 555880",
    "Canonical URL": "https://gusku.site/game/sairento-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sairento VR\", \"description\": \"Looking for information on Sairento VR? Check out the release date (Feb 6, 2018), developer insights from Mixed Realms Pte Ltd,Swag Soft Holdings Pte Lt...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mixed Realms Pte Ltd,Swag Soft Holdings Pte Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mixed Realms Pte Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/555880/header.jpg?t=1657760694\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}