{
    "AppID": 518190,
    "Name": "Sky Jac",
    "Release date": "Oct 24, 2016",
    "About the game": "Features: Flying Exploration Climbing Platforming Immersive Story Fighting Bosses Quirky Characters Secrets The current Early Access version of this game is exactly the same as the demo. It has no additional content. By purchasing the early access version of this game, you are helping support us as developers and you are securing access to all additional content at an incredibly low price. A legion of merciless robots have destroyed your home world. It is your job to take it back. Armed with future technology that grants you the ability to fly, traverse your way through a VR platforming experience unlike any other as you make your descent back to your home world. Travel through a world filled with incredible environments that tower above and below. Experience scale on a whole new level while flying, physically climbing and exploring strange and exotic places. You won't be alone on this grand adventure, prepare to encounter quirky characters around every sharp corner, precarious ledge, or twisted path as an immersive story unfolds around you, making it difficult to determine who you can trust. Will you gain allies or will you make enemies? Your journey won't be easy and it won't be peaceful. Shoot and dodge your way through hordes of dangerous robotic foes with only one purpose: human annihilation. Boss fights will pit you against the greatest of the robot ranks, giant towering machines that will make you question your fighting skills, flying abilities and self-confidence. Flying in Sky Jac is an awe inspiring experience. We have carefully designed the flying aspect of this game to minimize what is commonly referred to VR motion sickness. If you are prone to VR motion sickness, flying may take a little getting used to. Playing in small doses will help you gain your VR legs but you might find it difficult to stop playing once you have started because flying quickly becomes fun and addictive. We don't throw you into a flying scenario where you face ridiculous speeds in the beginning of the game. Flying is introduced slowly and gradually giving you time to get comfortable with this locomotion mechanic. If you do start to feel nausea, that is a good indicator that it is time to take a break. Don't worry, the Sky Jac world is not going anywhere! For those of you who don't experience VR motion sickness, prepare to have your mind blown.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/518190/header.jpg?t=1492095239",
    "Price": 4.99,
    "Developers": "Team of Light Media LLC",
    "Publishers": "Team of Light Media LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/518190/ss_8a4fad75bd3126ef179db31bd56b0fbcbc1a88e2.1920x1080.jpg?t=1492095239,https://cdn.akamai.steamstatic.com/steam/apps/518190/ss_775b543883fb270ae6dd5f424b986c8bebf85276.1920x1080.jpg?t=1492095239,https://cdn.akamai.steamstatic.com/steam/apps/518190/ss_eb117222e11f9b277756c55e4a0f57ffc95bbd42.1920x1080.jpg?t=1492095239,https://cdn.akamai.steamstatic.com/steam/apps/518190/ss_251c3f10548a1e273b86fca72a073a5be262b81f.1920x1080.jpg?t=1492095239,https://cdn.akamai.steamstatic.com/steam/apps/518190/ss_5140915738323d60d0dc921137097a29c3d3cfec.1920x1080.jpg?t=1492095239",
    "Slug": "sky-jac",
    "Meta Title": "Sky Jac: Oct 24, 2016, Team of Light Media LLC and Full O...",
    "Meta Description": "Looking for information on Sky Jac? Check out the release date (Oct 24, 2016), developer insights from Team of Light Media LLC, and a complete game summ...",
    "Alt Text Image": "Official header image for Sky Jac game - Steam 518190",
    "Canonical URL": "https://gusku.site/game/sky-jac",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sky Jac\", \"description\": \"Looking for information on Sky Jac? Check out the release date (Oct 24, 2016), developer insights from Team of Light Media LLC, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 24, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team of Light Media LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team of Light Media LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/518190/header.jpg?t=1492095239\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}