{
    "AppID": 670260,
    "Name": "Solace Crafting",
    "Release date": "Jan 16, 2018",
    "About the game": "Solace Crafting is a relaxed open-world RPG allowing infinite travel in all directions. As you explore, monsters and resources will increase their difficulty at a rate of one level per kilometer (0.6 miles) from the start. You'll need a base with refining and crafting facilities to craft proper equipment to push into increasingly difficult content, build your own fast travel network, and seek out rare materials. Exploration Traversing an infinite fantasy realm is not intended to be difficult. Player built teleporters can fling you off into unknown territory, and player built solaces can travel freely to and from any other solace in your world. With a visible range of over 48 kilometers (30 miles) you can plot a route to whatever biome suits your needs. Resource scanners can be setup to help locate rare materials from distant locations, and the map will draw points of interest within a generous range around places you've visited. Adventuring With no 'starting classes', you're free to build your own adventuring class from 240 skill nodes. Four Archetype skill trees branch into eight Job skill trees complimenting a wide variety of play styles. Mix and match skill trees and assign your attribute points however you see fit. Harvesting Major resources increase in tier once every 5 levels producing stronger and stronger equipment. Rare resources can be spotted from afar, especially at night, by the colored sparkle they give off. Other more complicated resources will require you to build towns to gather them, or require you attain magical underwear to delve into both the hottest and the coldest places in order to find them. Ctrl+F engages auto-harvesting for when you're just starting out, but level up your harvesting skills and soon enough you'll be one-shotting resource nodes like a pro. Crafting Recipes in Solace Crafting are not predefined. A boots recipe creates boots, but the level, tier, rarity, material, and color are up to you to define, limited only by your resources, facilities, and skills. As you push further and find increasingly powerful materials, upgrading your equipment is paramount to survival. Attain schematics from monsters to create extraordinary gear. Unlock powerful enchants to socket into your equipment. Building Our unique building system is faster than any other letting you use the WASD keys along with the spacebar to rapidly place floors and walls even if you can't see or reach them. For more complicated designs you can switch into free placement mode and control building part positioning and rotation down to the centimeter with no collision restrictions. Build staircases to reach gems on cave ceilings, or ladders to climb tower ruins and other procedural points of interest. Towns Town buildings can be placed within the upgradable power range of a solace, allowing you to summon villagers of various professions. Harvesters can harvest resources over time including several town specific resources important to upgrading your materials. Crafters can teach you new recipes and craft special materials required for upgrading your towns. Multiplayer Network code can be a beast, but multiplayer now successfully supports 95% of the content single-player does. Dedicated servers are highly recommended over player hosting, though work continues to improve the player hosting experience as well. Big Kitty Games runs a public server and two community servers have long been running strong to help support both beta development and live patches alike. Developed by a gamer After being repeatedly let down by big franchises I grew up on, I decided that I need to do my part to make better games for the world. It's been a long, hard journey to get this far, but I'm going to make games for the rest of my life, and I hope that Solace Crafting serves as a great first impression on what someone with a lot of passion for fun can do, even if unfortunately solo. I chose to not go with a publisher in hopes of creating my own sustainable, moral game studio, not bound by crunch schedules and share holders. It makes my life much more difficult, but from day one I have sworn off all of the monetization tactics that have ruined so many franchises I once loved: No pay-to-win No loot boxes No gamble mechanics Other things I strive to uphold for Solace Crafting (open-world RPG) specifically include: No forced balance (some classes may be harder than others) Unlimited player and content levels (progress doesn't stop once you hit 50) Completely open physics-based world, no off-limits No 'realistic' building physics that destroy everything when things go wrong Freedom to move characters in and out of different worlds Character customization Background My name is Kyle Postlewait. I am self-taught and I make mistakes. In the four+ years I've spent developing Solace Crafting, at the time of writing this, I have grown immensely as a developer. There are some systems I could have designed better, and there are a lot of systems I have redesigned over time as I grew, but there is charm in the imperfections of a game like this, and I aim to take it out of early access in the near future. I've worked hard to create a great fantasy survival RPG despite the tremendous challenge that is game development. Please don't buy my game expecting a ten million dollar budget, fully polished, AAA game and then give it a bad review. I've spent all the money I've ever made to make this, and I look forward to the day when I can hire on others to work alongside me. First and foremost I will always work to secure financial longevity and legal stability for my games and my company, and I promise to make sure that this game is never abandoned. Thank you and happy gaming!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/670260/header.jpg?t=1657502011",
    "Price": 14.99,
    "Developers": "Big Kitty Games",
    "Publishers": "Big Kitty Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_f18659e701b3365d0510d4fc13795496e3b2bb7c.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_c15926933dfc3fd45225ad6507081ff721a44433.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_eb36aace4d50cee85870246a5cfb9b378b44da96.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_6d2d661272391e704ab9fff315993548a63973a3.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_d26a151be608ce648b4fa29afc542599dabded99.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_00a334be316b891dffb6fc09cf43a5eae6fa72a7.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_8ae242fc15ccc5df2b0d1b33d8e490972a58bdea.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_48fffe289f7878cbacc8714288b381cd39667193.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_fff0a8b7894c1955608640b8958f3e4eb0c613e6.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_6d53edf5a9ab6df319e994bed5cfd7ee10eb46ef.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_6d0564fe6b4531b22e3a7b9171945cb65aca2431.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_38442ca1e463a9632582b3afe6cdd0825e897e51.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_d321d0ebc7a70792ca201d89c55a9fe57be2bdf5.1920x1080.jpg?t=1657502011,https://cdn.akamai.steamstatic.com/steam/apps/670260/ss_35542a5c562e7c726efbe334e22fef335b4f06d4.1920x1080.jpg?t=1657502011",
    "Slug": "solace-crafting",
    "Meta Title": "Solace Crafting: Jan 16, 2018, Big Kitty Games and Full O...",
    "Meta Description": "Looking for information on Solace Crafting? Check out the release date (Jan 16, 2018), developer insights from Big Kitty Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Solace Crafting game - Steam 670260",
    "Canonical URL": "https://gusku.site/game/solace-crafting",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solace Crafting\", \"description\": \"Looking for information on Solace Crafting? Check out the release date (Jan 16, 2018), developer insights from Big Kitty Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Big Kitty Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Big Kitty Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/670260/header.jpg?t=1657502011\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}