{
    "AppID": 1335300,
    "Name": "The Warlin of Heroes",
    "Release date": "Sep 6, 2020",
    "About the game": "“The Warlin of Heroes” is a martial arts card game with rogue-like elements. As players climb the tower to level up, they will collect martial arts techniques that can be used to form unique and flashy card combos. Will you use the mighty Descending Dragon Palm into an elegant Leap of 1000 Li? Or will you use the unrivaled Solitary Sword with supreme Taiji Boxing? The choice is in your hands. Characteristics The game contains an in-depth and extensive martial arts system with 48 external techniques, 20 internal techniques, and 19 Qigong techniques. In total, there are 87 martial arts techniques with their own unique effects and skills. Each technique can be combined for all new exciting gameplay! Gameplay The game is a classic tower climbing game with each level presenting a random variety of choices to the player, such as: combat, events, shops, meditation, recovery, and rewards. Choose wisely to increase your strength and take on challenges accordingly to clear levels and beat the bosses. Combat The game’s combat is based on the strengths and weaknesses of the five elements in a guessing game against your opponent. Each element is strong against two elements, but weak to two as well. Combine the special effects of skills with your ultimate in intense simulated martial arts combat. Story The story takes place in a martial arts world with four new schools established by the masters Liang, Jin, Gu, and Wen. The heroes of Warlin will retell their tales in an all new adventure! Here is our plan for the following updates. Any changes or immediate bug fixes will be specified in the current update log. Version[B1.1.0.ST] 1. Update character voices and non-combat related sound effects, such as: in-combat button presses, leveling up, opening chests, etc. 2. Fix Settings content and add a volume bar. 3. Add a notification at the beginning of combat. 4. Fix the skip button for the tutorial. 5. Fix the English translation for the tutorial. Version[B1.1.1.ST] 1. Opened up the Steam achievement system. 2. Updated English voice acting for the enemies. 3. Updated English translation for events. 4. Changed calculation of gaining/losing money from events. 5． Updated fight rewards to events and added a cancelation feature. 6. Updated character save data. Version[B1.1.2.ST] 1.Optimize the tower climbing mode and update boss combat. 2.Optimize the Chinese and English explanations for techniques. Version[B1.1.3.ST] 1.Update combat, reprogram combat calculation, optimize combat rules, and fix combat bugs. 2.Add combat sound effects. 3.Improve the tutorial and add help notifications. [h]Version[B2.0.4.ST] 1.Update battle animations to better differentiate between different attacks. 2.Add 4 new characters. [/h] Version[B2.1.0.ST] 1.Improve Adventure Mode to become a martial arts RPG. 2.Add 50 new martial arts techniques. Version[B2.2.0.ST] 1. Improve Versus Mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1335300/header.jpg?t=1640421299",
    "Price": 6.99,
    "Developers": "NJDZ",
    "Publishers": "NJDZ",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_7d0e488fc9f0d7df0bade85642e4db7c4269866b.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_965a89443f62cbcc0bbdf0f84fcb7520eb3bd00c.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_59078a5f1b7e8c4883044cfd6b95a0f5f020c0a6.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_cc7a1313517f9955d0ed89b3fce6eddad33cd59b.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_9574265e85a57eeec43a3c62f3dcf84a5c940d3a.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_aa3b6f8a4bff9165538f9435685885435c993a3a.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_38cdc51082acf1d985121158d57ae49f1df203d2.1920x1080.jpg?t=1640421299,https://cdn.akamai.steamstatic.com/steam/apps/1335300/ss_d517763df6bba5a8f5fc7c8bbe14b65008af66e9.1920x1080.jpg?t=1640421299",
    "Slug": "the-warlin-of-heroes",
    "Meta Title": "The Warlin of Heroes: Sep 6, 2020, NJDZ and Full Overview",
    "Meta Description": "Looking for information on The Warlin of Heroes? Check out the release date (Sep 6, 2020), developer insights from NJDZ, and a complete game summary.",
    "Alt Text Image": "Official header image for The Warlin of Heroes game - Steam 1335300",
    "Canonical URL": "https://gusku.site/game/the-warlin-of-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Warlin of Heroes\", \"description\": \"Looking for information on The Warlin of Heroes? Check out the release date (Sep 6, 2020), developer insights from NJDZ, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"NJDZ\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NJDZ\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1335300/header.jpg?t=1640421299\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}