{
    "AppID": 504280,
    "Name": "The Cold War Era",
    "Release date": "Sep 9, 2016",
    "About the game": "The Cold War Era isn't over, it's just beginning Military might, stealthy spies, blatant propaganda, and high-tech Space Race marvels are all at war game lovers' fingertips when they choose to play as the U.S.A. or the U.S.S.R. and rewrite history in The Cold War Era. TCWE is a single player RTS strategy game based on the epic conflict between the Americans and the Soviets spanning the 1950s through the 1990s. Within one hour of gameplay players will course through four decades of contention, paranoia, secrecy, and the overarching the 'us vs. them' mentality. Game Features - Immerse yourself in a realistic atmosphere that recreates the true Cold War. - Choose your side and play as either the Americans or the Soviets to rewrite Cold War history. - Install military units to prop up the local Allied government or transform rebels into revolutionaries in Opposing countries. - Establish spy networks to support government propaganda campaigns or shake loose the Opposition's stronghold. - Launch rockets, satellites and astronauts into space to shock and amaze the world and win their alliances. - Devise your own strategies and tactics, forcing your opponent to play by your rules. - Initiate pro-government parades or incite riots to plunge countries into chaos. - Use time to your advantage -- each Cold War Era matchup only takes 1 hour to play, start to finish. - Keep on top of the game's goings-on by watching TCWE's unique in-game TV stream ( free video mod dlc ). This TV stream consists of real-life news footage shot during the Cold War era, edited to represent the players' in-game activities. Relying on a clean and simple map-based game interface, TCWE is easy to play for gamers of all age and skill levels. Easy-to-read menus tell players about... -The point and click -- easy-to-understand map and menus guide you through the gameplay. -The players' Influence in each country and worldwide. -Their Opponent's Influence in Influenced, Neutral and Opposing countries. -The number of military units stationed in each country. -The spy network status and propaganda campaign success. -The remaining budget, which determines what initiatives can be launched. -The Space Race Milestone achievements, which help win global Influence. -Each country's score value, which is used to calculate a player's Budget. -Their Total Score as game events unfold.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/504280/header.jpg?t=1653525851",
    "Price": 4.99,
    "Developers": "Alina Digital",
    "Publishers": "Alina Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_7e1b9385f560535693a2107e974587f96b01df6a.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_cb0d4fe903a91907d9910f4105163abf96c1f267.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_66278e642e7be3bbd09507bfab526ad894399d2b.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_d6422c646e6c10454a890a8dca09e2db806b4128.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_661e56f63b13c45be0a6a1f5806add4c76b1e66b.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_91390540e1216a18e965b34e715259b65527e420.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_8381124c1792f08cf7aa4c462697832d5c49b13e.1920x1080.jpg?t=1653525851,https://cdn.akamai.steamstatic.com/steam/apps/504280/ss_23504c9bd0c46c8851fdf9522db30be31a626239.1920x1080.jpg?t=1653525851",
    "Slug": "the-cold-war-era",
    "Meta Title": "The Cold War Era: Sep 9, 2016, Alina Digital and Full Ove...",
    "Meta Description": "Looking for information on The Cold War Era? Check out the release date (Sep 9, 2016), developer insights from Alina Digital, and a complete game summary.",
    "Alt Text Image": "Official header image for The Cold War Era game - Steam 504280",
    "Canonical URL": "https://gusku.site/game/the-cold-war-era",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Cold War Era\", \"description\": \"Looking for information on The Cold War Era? Check out the release date (Sep 9, 2016), developer insights from Alina Digital, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alina Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alina Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/504280/header.jpg?t=1653525851\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}