{
    "AppID": 779340,
    "Name": "Total War: THREE KINGDOMS",
    "Release date": "May 23, 2019",
    "About the game": "Total War: THREE KINGDOMS is the first in the multi award-winning strategy series to recreate epic conflict across ancient China. Combining a gripping turn-based campaign game of empire-building, statecraft and conquest with stunning real-time battles, Total War: THREE KINGDOMS redefines the series in an age of heroes and legends. China in 190CE Welcome to a new era of legendary conquest. This beautiful but fractured land calls out for a new emperor and a new way of life. Unite China under your rule, forge the next great dynasty, and build a legacy that will last through the ages. Choose from a cast of 12 legendary Warlords and conquer the realm. Recruit heroic characters to aide your cause and dominate your enemies on military, technological, political, and economic fronts. Will you build powerful friendships, form brotherly alliances, and earn the respect of your many foes? Or would you rather commit acts of treachery, inflict heart-wrenching betrayals, and become a master of grand political intrigue? Your legend is yet to be written, but one thing is certain: glorious conquest awaits. ANCIENT CHINA RECREATED Discover Three Kingdoms China, a land of breath-taking natural beauty. Battle across lush subtropics, arid deserts and snow-capped mountains. Marvel at legendary landmarks like the Great Wall of China and the Yangtze River. Explore the length and breadth of ancient China as you restore harmony to its embattled landscape. CHINA’S GREATEST LEGENDS Forge a new empire as one of 12 legendary Warlords drawn from China’s celebrated historical epic, the Romance of the Three Kingdoms. Peerless commanders, powerful warriors and eminent statesmen, these characters each have a unique playstyle and objectives. Recruit an epic supporting cast of heroes to command your armies, govern your provinces and strengthen your growing empire. Characters are the beating heart of the game, and China’s very future will be shaped by its champions. GUANXI SYSTEM Modelled on Guanxi, the Chinese concept of dynamic inter-relationships, Total War: THREE KINGDOMS takes a paradigm-shifting approach to character agency, with iconic, larger-than-life heroes and their relationships defining the future of ancient China. Each of these characters is brought to life with their own unique personality, motivations, and likes/dislikes. They also form their own deep relationships with each other, both positive and negative, that shape how your story plays out. ARTISTIC PURITY With stunning visuals and flamboyant Wushu combat, THREE KINGDOMS is the art of war. With beautiful UI, vibrant vistas and authentic Chinese-inspired artwork, this reimagining of ancient China is a visual feast. REAL-TIME &amp; TURN-BASED HARMONY The turn-based campaign and real-time battles of Total War: THREE KINGDOMS are more interconnected than ever before. Actions in battle now have much greater consequences, affecting your Heroes’ relationship towards you, as well as the friendships and rivalries they develop with other characters. In a world where powerful allies are one of the keys to success, this adds a brand-new element to how victory is achieved.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/779340/header.jpg?t=1653315123",
    "Price": 59.99,
    "Developers": "CREATIVE ASSEMBLY,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Publishers": "SEGA,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_b367c99f566ecfc3def17673e9015c80e7e3a8d3.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_fe3108d8affd7a9f7e72959602e49cb5fa105910.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_16346541350f29271399420bffda0da34c8d5ea1.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_82b431d0e99eff54583fb4abe17bf805d1fa1a03.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_ced0e321ac9262d29dc0a4e4fe4b91d3144ed2e6.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_15164c8bb033b1c570865ab264ccaaab8131f564.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_28c87c4d21ad066b22c823484d8d4a4b1ad4baef.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_87965bbf0f820468817d690a77d623da491aa1f1.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_1704c59def00896435add8c140e6e6980ae534d4.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_b6f8b370506ba4fdfa8f0cdb012b27675a4174d2.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_37f12b05302c5d75bd2b0b0aaed635472662a757.1920x1080.jpg?t=1653315123,https://cdn.akamai.steamstatic.com/steam/apps/779340/ss_2c75b7b68ec1b908fbdeabf97fc505e1833abf17.1920x1080.jpg?t=1653315123",
    "Slug": "total-war-three-kingdoms",
    "Meta Title": "Total War: THREE KINGDOMS: May 23, 2019, CREATIVE ASSEMBL...",
    "Meta Description": "Looking for information on Total War: THREE KINGDOMS? Check out the release date (May 23, 2019), developer insights from CREATIVE ASSEMBLY,Feral Interac...",
    "Alt Text Image": "Official header image for Total War: THREE KINGDOMS game - Steam 779340",
    "Canonical URL": "https://gusku.site/game/total-war-three-kingdoms",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Total War: THREE KINGDOMS\", \"description\": \"Looking for information on Total War: THREE KINGDOMS? Check out the release date (May 23, 2019), developer insights from CREATIVE ASSEMBLY,Feral Interac...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"CREATIVE ASSEMBLY,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/779340/header.jpg?t=1653315123\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}