{
    "AppID": 1100140,
    "Name": "Touhou Fuujinroku ~ Mountain of Faith.",
    "Release date": "Jun 5, 2020",
    "About the game": "基本ゲームシステム 人間を操作し、ショットで敵を倒します。 敵や弾、レーザーなどに当たるとミスとなってしまいます。 残機が０の時に、ミスをするとゲームオーバーです。 画面上部に移動すると画面内のアイテムを全て集める事が出来ます。 （＊今回は、常に行う事が出来ます（重要）） また、低速移動時は、自機の近くのアイテムを引き寄せることが出来ます 頑張ってください。 操作方法 ■キーボードでの操作 ■カーソルキー or テンキー　 自機の上下左右の移動、カーソルの上下左右の移動 ■Ｚキー　　　　　　　　　　ショット、決定 ■Ｘキー　　　　　　　　　　霊撃発動、キャンセル ■Ｓｈｉｆｔキー　　　　　　低速移動します ■ＥＳＣキー　　　　　　　　ポーズ、ポーズ解除 ■Ｃｔｒｌキー　　　　　　　メッセージのスキップ、リプレイの早送り ■パッドでの操作（キーコンフィグできます） ■レバー　　　　　　　　　　自機の上下左右の移動、カーソルの上下左右の移動 ■ボタン１　　　　　　　　　ショット、決定 ■ボタン２　　　　　　　　　霊撃発動、キャンセル ■ボタン３　　　　　　　　　低速移動します ■ボタン４　　　　　　　　　メッセージのスキップ、リプレイの早送り ■ボタン５　　　　　　　　　ポーズ、ポーズ解除 バックストーリー 博麗神社。幻想郷の東の境界にある寂れた神社である。 　里居を忘れた妖怪がここを寝床にしているかの様に、いつも人間以外の 生き物で賑やかであった。 　妖怪の多い神社に人間の参拝客など居る筈もなく、神社におわす神様は 信仰心不足に悩んでいた。 　そんな神社にも転機が訪れたのである。 　神社の巫女、博麗霊夢（はくれいれいむ）は、悩んでいた。 　　霊夢　「どうしたら妖怪達を追い返せるのかなぁ。 　　　　　　どうしたら人間の信仰を集める事が出来るのかなぁ」 　　？？？「おう。美味しそうな団子だな」 　　霊夢　「あ、魔理沙。 　　　　　　うーん」 　　魔理沙「悩み事か？」 　　霊夢　「この間、ちょっと変な来客があってねぇ」 　　魔理沙「この神社、変な来客だらけじゃないか」 　神様は自分に対しての信仰心が力となる。 　参拝客の少ない博麗神社は、その力を徐々に落とし、今では八百万はい ると言われる神様同士の会合で意見が無視されてしまう程である。 　幻想郷には神社は一つしか無いと言われているが、外の世界に幾つも神 社を構えている神様に比べると信仰心不足なのは否めず、博麗神社の地位 は下がる一方であった。 　　霊夢　「妖怪も変な来客だけどさ。 　　　　　　この間、変な人間が来てさぁ」 　　魔理沙「人間の来客？　それはまた珍しいな」 　　霊夢　「そいつに神社の営業停止命令を出されてね」 　　魔理沙「って、この神社は営業してたのか……」 　博麗神社は、神様の住処としての役割の他に、幻想郷には無くてはなら ない役割がある。その為霊夢は、どんなに信仰心を失ってしまっても、営 業停止はあり得ない事だと鷹を括っていた。 　無くてはならない役割とは、幻想郷と外の世界を隔てる境界を守る事で あるのだが……。 　　魔理沙「神社が営業停止か、おかしな話だな。 　　　　　　それで停止後の神社はどうしろと？」 　　霊夢　「潰してしまうか、それか、山の上におわす神様に譲渡しろって」 　　魔理沙「うーん。二重に妙だな」 　　霊夢　「その時の人間が何者なのか判らないけど…… 　　　　　　どう考えても、普通の神様の言う事じゃないでしょ？」 　　魔理沙「そうだな。まぁその人間にも興味があるが…… 　　　　　　それでどうするんだよ。 　　　　　　まさかその言葉をまともに受け取って、謎の神様に神社を譲る 　　　　　　つもりじゃないんだろ？」 　　霊夢　「山の上におわす神様の方が、今より信仰心を集められるのなら、 　　　　　　それも有りなのかなぁと。 　　　　　　妖怪も追い返せるし、何より神社らしくなるでしょう？」 　　魔理沙「そうか。 　　　　　　神社にいる神様が変っても、霊夢にとっては余り影響はないのか」 　　霊夢　「ただねぇ。どう考えてもその話は胡散臭いわ。 　　　　　　元から居る神様を追いだして、乗っ取ろうとするなんておかしい。 　　　　　　その人間だって、力はありそうだったけど……全く見た事ない 　　　　　　顔だったし。 　　　　　　絶対に妖怪かなんかの偽物か、邪神かなんかよ！」 　散々悩んだ結果、霊夢は山の上にいるという神様に会いに行くことにした。 　山に立ち入る事は意図的に避けてきた霊夢だが、いよいよ持って信仰心の 失われた神社の事も真面目に考えようと思い、一大決心をしたのである。 　この時はまだ、戦う事になるとは思ってもいなかったのだ。 　　　　　　　　　　------------------------- 　　　　　　　　　　　　雲上に光が満ちた。 　　　遠くで機械の音が聞こえてくる。天狗の工場が目覚めたのだろうか。 　　　　　　　ここは里の人間が立ち入る事の出来ない世界。 　　　　　　　　　　　　　木で出来た建物。 　　　　　　時季外れの蛙の鳴き声。夥しい数の蛇の抜け殻。 　　　　　　　彼女はそこに居た。この場で見ていた。 　　　　　　　　　　　　一人の人間と共に。 タイトル画面 ■タイトルメニュー Ｓｔａｒｔ 通常のゲームを開始します この後、難易度、プレイヤー、使用武器の順に選択します ＥｘｔｒａＳｔａｒｔ エキストラステージを開始します（条件を満たしていないと選択できません） ＰｒａｃｔｉｃｅＳｔａｒｔ プラクティスモードを開始します プラクティスモードは１ステージだけをプレイするモードです。 その難易度、キャラ、武器で一度クリアしたステージまで選択できます（コンティニューしても可） 各ステージのスコアが記録されますので、スコアアタックも出来ます 初期プレイヤー数９で固定され、コンティニューは出来ません ＊キーボードの数字キーを押しながらステージを選ぶと初期プレイヤー数を変更できます 一機限定で遊びたい場合とか（あるのか？）活用してください。 Ｒｅｐｌａｙ 保存したリプレイを再生するモードです ＰｌａｙｅｒＤａｔａ スコア、御札戦歴、その他の情報を見るモードです ＭｕｓｉｃＲｏｏｍ 音楽室に入ります Ｏｐｔｉｏｎ オプションモードに入ります Ｑｕｉｔ ゲームを終了します システム　攻撃システム ●通常ショット 御札とか針とかを、何故か無限に撃つ事が出来ます。 ●霊撃 オプションを一つ使用して、敵弾を消す攻撃をする事が出来ます。 霊夢の霊撃は、範囲が広いが余り前方に進みません。 魔理沙の霊撃は、かなり前方までの敵弾を消せますが、範囲は狭いです。 でも、使用中は完全無敵なのでピンチの時は使ってみましょう。 パワー５（ＭＡＸ）の時は、オプションを失わずに一回だけ霊撃を使えます。 ●オプション 力強いお供です。 今回はパワーアップしても主人公のショットは強化されません。 その代わり、オプションの数が増えます。 パワー０～４　……　０～４個のオプション パワー５　　　……　４個のオプション（ＭＡＸ） 高速移動時と低速移動時のオプションの配置が大きく違う装備もあります。 霊撃を使うと、パワーが一つ減ってしまいますが、パワーアップ アイテムは沢山出ますので、危なくなる前に使っていきましょう。 システム　アイテム ●アイテム 敵を倒したりするとアイテムが出現する事があります。 パワーアップアイテム Powerを 0.05 増やします。5.0 で最大。 最大時は、このアイテムの代わりに信仰アイテム（小）が出ます。 パワーアップアイテム大 Powerを 1.0 増やします。5.0 で最大。 最大時は、このアイテムの代わりに信仰アイテム（小）が出ます。 得点アイテム 得点が入ります。画面上部であればあるほど得点が高く、 最高で画面左下に書かれた信仰ポイントだけ入ります。 得点アイテム（大） 画面の何処で取っても最高点が入ります。 ボス戦でパワーが最大（5.0)の時に、段階を進めると落とします。 通常時、これを落とす敵はいません。 エクステンドアイテム プレイヤーが一人増えます。 信仰アイテム（大） 信仰ポイントが上昇します。 信仰アイテム（小） 信仰ポイントが僅かに上昇します。 ●アイテム蒐集 画面上部に自キャラを移動させると、画面上のアイテムを全て回収ことが出来ます。 常に行う事が可能です。 システム　信仰ポイント ●信仰ポイント 画面左下に出ている数値が信仰ポイント（どれだけ信仰を集めているか）です。 このポイントが得点アイテムの点数となるので、稼ぐ場合はこのポイントに注目しなければいけません。 信仰ポイントは、緑色のアイテムを取る事で増加します。それ以外に増加する手段はありません。 得点アイテムは、信仰ポイントを高めてから取ることで、大きな得点となります。 出来る限り、緑→青の順番でアイテムを取りましょう。 ●信仰心の減少と維持 信仰は時間と共にどんどんと失われていきます。 緑のアイテムを取って僅かに信仰を増やしても、あっという間に無くなってしまいます。 この信仰ポイントの減少を、一旦停止させる手段があります。 それは、アイテムを取る、敵を倒す等の行動をすることです。 行動した直後、僅かな時間の間は信仰ポイントは減少しません。 この間に別のアイテムを取ったり敵を倒したりすれば、信仰を高いまま維持できます。 （減少停止の僅かな時間は、信仰ポイントの下部に表示されているバーの長さで確認できます） また、ボス戦や会話中などは信仰ポイントは下がりませんが、ミスをすると大幅に減少します。 ●スペルカードボーナス ボス敵がスペルカードアタックという特殊な攻撃を仕掛けてくることがあります。 この攻撃の間は、ミスもせず、霊撃も使わずにボスを撃破するとスペルカードボーナスが入ります。 スペルカードボーナスは信仰ポイントの１０倍から始まり、時間と共に減少しますので、 早めに撃破しましょう。 また、スペルカードアタック中は、霊撃を使用しても敵弾は信仰ポイントにはなりません。 ●稼ぎのヒント ・得点アイテムは画面の上側に近づいて吸い寄せて取ること（基本） ・緑の点と青の点が同時に出た場合、先に緑の点を取るようにすること。 ・信仰ポイントが減少しないように、敵やアイテムのない間を作らないこと。 ・霊撃は敵弾を緑の光の弾に変えます。敵弾の多い所で霊撃を使うのも手です。 　ただし、パワーが落ちるのでむやみに使って苦労しても知りません。 　（ただし敵のスペルカード発動中は、霊撃を撃っても敵弾は緑の光の弾に変わりません） ・敵を倒せなくても、固い敵にショットを撃ち込んでいる間は、減少の速度が 　遅くなります。 ・フルパワーアップ状態では、パワーアイテムの代わりに緑の点が出ます。 システム　エクステンド ●エクステンド 通常ステージは得点が 2000万、4000万、8000万、15000万でエクステンドします エキストラステージは得点が 3000万、10000万でエクステンドします システム　小ネタ ●小ネタ ・Ｐキーを押すと、画面のスナップショットを取ります ・ポーズ中にＱを押すとタイトル画面に戻ります ・ポーズ中にＲを押すと一面からやり直します ・リプレイ中にCtrlを押すと早送り出来ます ・１面やエキストラステージでゲームオーバーになってコンティニューしても、 コンティニュー扱いにはなりません ・プラクティスモードでステージを選択するときに、 キーボードの数字を押しっぱなしにしているとその残機数で始められます ・Alt + F4 でゲームを終了できます ・オールクリア時に入るボーナスは以下の通りです イージー　　： 残機数×2000万　パワー×20万　信仰ポイント×100 ノーマル　　： 残機数×2500万　パワー×20万　信仰ポイント×100 ハード　　　： 残機数×3500万　パワー×40万　信仰ポイント×100 ルナティック： 残機数×4000万　パワー×60万　信仰ポイント×100 エキストラ　： 残機数×4000万　パワー×80万　信仰ポイント×100",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1100140/header.jpg?t=1591411797",
    "Price": 14.99,
    "Developers": "上海アリス幻樂団",
    "Publishers": "Mediascape Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1100140/ss_5e5c5c391b19cba132b6de14a172b8c8f11b5825.1920x1080.jpg?t=1591411797,https://cdn.akamai.steamstatic.com/steam/apps/1100140/ss_604fe3fb7f889c7b44619a7d500d8c8fb55fd4b2.1920x1080.jpg?t=1591411797,https://cdn.akamai.steamstatic.com/steam/apps/1100140/ss_3842a82ec910509ab892900b91c4f2af57881063.1920x1080.jpg?t=1591411797,https://cdn.akamai.steamstatic.com/steam/apps/1100140/ss_749960334e5267bd0231831c479a612838c17a7e.1920x1080.jpg?t=1591411797,https://cdn.akamai.steamstatic.com/steam/apps/1100140/ss_55603a7736256989f46342154cb2848dc07491b5.1920x1080.jpg?t=1591411797",
    "Slug": "touhou-fuujinroku-mountain-of-faith",
    "Meta Title": "Touhou Fuujinroku ~ Mountain of Faith.: Jun 5, 2020, 上海アリ...",
    "Meta Description": "Looking for information on Touhou Fuujinroku ~ Mountain of Faith.? Check out the release date (Jun 5, 2020), developer insights from 上海アリス幻樂団, and a com...",
    "Alt Text Image": "Official header image for Touhou Fuujinroku ~ Mountain of Faith. game - Steam 1100140",
    "Canonical URL": "https://gusku.site/game/touhou-fuujinroku-mountain-of-faith",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Touhou Fuujinroku ~ Mountain of Faith.\", \"description\": \"Looking for information on Touhou Fuujinroku ~ Mountain of Faith.? Check out the release date (Jun 5, 2020), developer insights from \\u4e0a\\u6d77\\u30a2\\u30ea\\u30b9\\u5e7b\\u6a02\\u56e3, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e0a\\u6d77\\u30a2\\u30ea\\u30b9\\u5e7b\\u6a02\\u56e3\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mediascape Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1100140/header.jpg?t=1591411797\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}