{
    "AppID": 1110780,
    "Name": "Tractage aux Portes 2: Mob à la Cafétéria",
    "Release date": "Jul 24, 2019",
    "About the game": "Tracter une cafétéria Quelques mois sont passés depuis les évènements de Tractage aux portes: le jeu vidéo. La mobilisation va bien, il y a eu quorum à l'assemblée générale et la mobbeuse a un nouvel objectif. En effet, son association étudiante a adopté une campagne sur l'environnement, et suite à une escalade des moyens de pression, il est temps de mobiliser pour une journée de grève! De la mob aux tables Dans Tractage aux portes 2: Mob à la cafétéria , vous saisissez de nouveau votre pile de tracts pour cette fois, aller faire de la mobilisation one on one . Allez vous asseoir et discutez avec des étudiantes et des étudiants pour les convaincre de venir à leur assemblée générale de grève et de se voter en faveur de celle-ci! Chaque personne dans la cafétéria a des opinions différentes sur la campagne et sur la grève. Vous devrez savoir gager les groupes, et trouver les arguments qui réussiront à les mobiliser. Toutefois, faites attention. La mobbeuse n'est pas la seule à faire son retour en force dans ce jeu: Capitaine Douchebag et Sergent CAQ sont eux aussi dans la caféteria, et auront certainement envie de faire entendre leur opinion, si la mobbeuse décide de venir parler à leur groupe! Un outil d'apprentissage « C'est en mobbant qu'on devient un mobbeux ou une mobbeuse. » - Proverbe militant Faire de la mobilisation, c'est plutôt facile, mais intimidant quand on n'en a jamais fait. Le meilleur moyen de devenir bon ou bonne à faire de la mobilisation, c'est de saisir une pile de tracts ou de journaux et d'aller les distribuer aux tables de la cafétéria. Ce jeu a pour objectif de simuler une séance de mobilisation, mais pas de la remplacer! Questions et réponses Pourquoi ce jeu existe-t-il? Pourquoi pas? Plus sérieusement, Tractage aux Portes: Le Jeu Vidéo a marqué l’imaginaire militant étudiant. Au cours des mois qui ont suivi sa diffusion initiale, une pluie de commentaires et suggestions a été reçue pour améliorer ce jeu. Lorsqu’est venu le temps de développer un nouveau jeu, il a été décidé de prendre toutes ces suggestions, sans exception, et les utiliser comme base pour un nouveau jeu, et d’aller plus loin encore. Est-ce que ce jeu comporte des formules de “loot boxes”? Vous voulez dire des ballots d’Ultimatums ? Non, malheureusement, les Ultimatums et les Argumentaires ne feront pas leur réapparition dans Mob à la Cafétéria . Est-ce que c’est un simulateur de mobilisation? Le terme “Jeu de rôle non linéaire en monde ouvert” est préféré, où le joueur ou la joueuse incarne la même mobbeuse que lors de Tractage aux portes: Le jeu vidéo , et où le monde ouvert est de la taille d’une petite cafétéria. Il ou elle peut décider d’aller mobiliser les tables de son choix, dans l’ordre de son choix. Ça doit être rapidement répétitif non? Pour augmenter la rejouabilité et la diversité du jeu, il a été déterminé dès le départ qu’une grande partie du jeu sera généré aléatoirement et dynamiquement avant le début de chaque partie. Il en est de même pour les opinions et points de vue de chaque personne dans la cafétéria. Les dialogues ne sont d’ailleurs pas construits en “arbre”, mais par “thèmes”, pour se rapprocher davantage de l’expérience de mobilisation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1110780/header.jpg?t=1649701466",
    "Price": 0.0,
    "Developers": "ABC d'la Mob",
    "Publishers": "ABC d'la Mob",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1110780/ss_6b68214fe69e0a2dc30dbcb299519fa7ce04dfd3.1920x1080.jpg?t=1649701466,https://cdn.akamai.steamstatic.com/steam/apps/1110780/ss_5fd7aedc750ad2497c09d334e93c242ebd529e15.1920x1080.jpg?t=1649701466,https://cdn.akamai.steamstatic.com/steam/apps/1110780/ss_08223356ea3d77cf6e22edd2b9c0f9187d4b4eb9.1920x1080.jpg?t=1649701466,https://cdn.akamai.steamstatic.com/steam/apps/1110780/ss_039d587f4915f818618cde669d4c71ef223858da.1920x1080.jpg?t=1649701466,https://cdn.akamai.steamstatic.com/steam/apps/1110780/ss_6a94fd9ac9fab78e31941d70ceb2d2ed26291c24.1920x1080.jpg?t=1649701466",
    "Slug": "tractage-aux-portes-2-mob-la-caftria",
    "Meta Title": "Tractage aux Portes 2: Mob à la Cafétéria: Jul 24, 2019, ...",
    "Meta Description": "Looking for information on Tractage aux Portes 2: Mob à la Cafétéria? Check out the release date (Jul 24, 2019), developer insights from ABC d'la Mob, a...",
    "Alt Text Image": "Official header image for Tractage aux Portes 2: Mob à la Cafétéria game - Steam 1110780",
    "Canonical URL": "https://gusku.site/game/tractage-aux-portes-2-mob-la-caftria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tractage aux Portes 2: Mob \\u00e0 la Caf\\u00e9t\\u00e9ria\", \"description\": \"Looking for information on Tractage aux Portes 2: Mob \\u00e0 la Caf\\u00e9t\\u00e9ria? Check out the release date (Jul 24, 2019), developer insights from ABC d'la Mob, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"ABC d'la Mob\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ABC d'la Mob\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1110780/header.jpg?t=1649701466\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}