{
    "AppID": 898440,
    "Name": "Turing Tumble VR",
    "Release date": "Aug 1, 2018",
    "About the game": "Turing Tumble is a mechanical computer driven by marbles. Invented by Prof. Paul Boswell, who used to teach at the University of Minnesota, this great idea is designed to expose what's hidden in the silicon core of microprocessors, making it possible to witness at a big scale and slow pace what electrons do a billion times each second in the micrometric junctions of a computer chip. Playing with it, you'll understand all the underlying basis of computer programming , how just connecting switches in clever ways can do amazingly smart things, and above all, you'll see it happen, and will get a feel of it. What do you mean by mechanical computer? Turing Tumble materially consists in a board, blue and red marbles, and 6 types of mechanical parts you can add onto the board to build computing machines. The set of parts is Turing complete, which means that Turing Tumble can do anything a computer can do - or at least it could if the board were big enough. But even at it actual size, it already allows to add, divide, exponentiate, compare, count, do logic, produce patterns and a lot more. Recreated in VR, the board is as big as a small building, and 59 challenges have been implemented for the puzzle mode. Solving them will make you recreate nearly all the functions of a microprocessor, and don't be fooled by the first ones : they start easy but become soon enough quite difficult and then extremely challenging. Last ones will be tough even for an expert programmer. Can I play if I know NOTHING about computer engineering? Sure! Puzzles become challenging as you progress, but the game can be played from the age of 8, and gives a strong notion of what computers and code are about to young kids, without having to previously teach them about complicated mathematical concepts. From experiencing with the actual game, kids 8-12 manage to solve the 20 to 30 first puzzles. Adults get addicted by puzzle 27, and their brain melt steadily after puzzle 35. Younger kids enjoy the first 10 challenges and building their own computers. In short : if you learn something it will be by playing, there's nothing you have to know beforehand. What kind of life expectancy has this game? Definitely not a 10 minutes experience, TuringTumbleVR is already a dozens of hours long game if you only want to puzzle every challenge out. And note that there is no answer written anywhere : for each puzzle, any machine you build that produces the required behavior will be validated. Developing and testing the game, I found myself replaying already solved challenges for the sake of inventing a more beautiful or elegant solution! As you'll make your way through puzzles, you'll unlock additional features to be used in both puzzle mode and free play, offering you even more possibilities. As of free playing, you can invent and run millions of machines. Your creativity and willingness to implement more and more complex functions are the only measurable limit. Please also keep in mind this is an Early Access release, and that, for entertaining and/or fun and/or challenging they are, the 59 puzzles provided are only the 59 first puzzles. You're the next step! Please give us feedbacks through the community page : further development are already on the making, but from now the future of TTVR is mainly what you'll shape it! Share your experience and suggestions! Experiment, be creative, learn and above all have fun with TTVR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/898440/header.jpg?t=1533139153",
    "Price": 7.99,
    "Developers": "Dreamflake",
    "Publishers": "Dreamflake",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_c6476a79f178614ea635090188cb12329ec36ae3.1920x1080.jpg?t=1533139153,https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_55d334bf7ecb0bca0f1aa4354c9686e4340c8a0b.1920x1080.jpg?t=1533139153,https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_84e68b2734129e688748b222996d77fdc3da3645.1920x1080.jpg?t=1533139153,https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_1934fb69522b7bb1f2171f370ee30f80c45d009a.1920x1080.jpg?t=1533139153,https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_cb8eefb69d8f92bcc8709afec426af7c330493e4.1920x1080.jpg?t=1533139153,https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_148dd396d8899812876fd8ca927a3125ab811bd4.1920x1080.jpg?t=1533139153,https://cdn.akamai.steamstatic.com/steam/apps/898440/ss_63fa8a7fb90cb852bf38aa2e4375107ec01d5432.1920x1080.jpg?t=1533139153",
    "Slug": "turing-tumble-vr",
    "Meta Title": "Turing Tumble VR: Aug 1, 2018, Dreamflake and Full Overview",
    "Meta Description": "Looking for information on Turing Tumble VR? Check out the release date (Aug 1, 2018), developer insights from Dreamflake, and a complete game summary.",
    "Alt Text Image": "Official header image for Turing Tumble VR game - Steam 898440",
    "Canonical URL": "https://gusku.site/game/turing-tumble-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Turing Tumble VR\", \"description\": \"Looking for information on Turing Tumble VR? Check out the release date (Aug 1, 2018), developer insights from Dreamflake, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dreamflake\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dreamflake\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/898440/header.jpg?t=1533139153\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}