{
    "AppID": 1076020,
    "Name": "Viro Move",
    "Release date": "Oct 20, 2021",
    "About the game": "VIRO MOVE was specifically designed to provoke natural and healthy physical fitness movements across the whole body while having fun, by completing more demanding game levels and climbing to the top of the global leaderboards. VIRO MOVE not only effectively brings results of training in the gym or a fitness club, but most importantly it does so in a fun and engaging way. Whether you prefer to call it a game or a fitness workout, you’re a fitness fan or a couch potato, or whether you simply love gaming but have no time for workouts - VIRO MOVE will adapt to your specific fitness needs, abilities and current shape, over time making you healthier, stronger, fitter and ultimately happier! Lacking the motivation to exercise but love to play games? Good! Most probably you won’t even recognize it’s a workout. You’ll dodge, crouch, squat,, step, punch, swipe, beat, slice, fire and perform many other endurance moves while being immersed in the gaming experience. All to the rhythm of one of the coolest soundtracks in VR games. Change your fighting style on the fly Choose Mixed Weapons mode and switch between boxing, swords and shooting on the go during dynamic workout gameplay. Achieve extraordinary results and observe how this seemingly difficult task becomes a piece of cake as you progress. Stats, it’s all about the stats! We agree, as easy as you can track the gameplay stats you can also track, manage and challenge your fitness goals. We enable you to track your calorie output and compete to be the best you can be. I need someone to compete with. We’ve got you covered. Join our VIRO MOVE Challenges, compete against players from all over the world, climb the VIRO leaderboards. Play harder and take the VIRO Move Challenge! We will motivate you to train harder than you ever imagined possible. When you participate in a challenge you will fight harder and longer to become a VR fitness champion and you will love every minute of it. You will engage stamina, endurance, movement as you compete against the world’s best VIRO Ninjas. Watch those calories burn As you play, every move is being tracked and analyzed using our advanced algorithm to report the number of calories burned after every game. This way your progress in the game is your real progress. Your calorie output is being calculated and analyzed by our advanced algorithm every step of the way. Your progress is available for you to manage and compare as you advance towards your fitness goals. VIRO MOVE • Sharing is caring Meeting friends? Throwing a house warming party? Share the burn in our awesome hot seat mode and check who’s the fittest, fastest and healthiest. • If you do your workout, do it right Getting fit never was so easy with approval of VIRO MOVE as a serious fitness tool from more than 1000 FIBO and IRSA sports professionals. • Forget about boring gym routines Choose between swords, fists or guns to stay motivated and constantly challenge yourself. • Customize your VIRO MOVE experience Earn and unlock skins as you progress through unique and unrestricted gameplay. • Train like a beast – look and feel like a beauty We will deliver regular challenges that will help you get visible results. • Mix it up If you want extraordinary results, master our mix-mode, where you can change weapons during dynamic workout gameplay. • Easy to start – hard to master Whether you are a beginner or a workout junkie you’ll fit right it. Start slow with a tutorial or jump straight to the hardest levels. It’s you who decides. • Workout arenas Choose from 5 different and gloriously immersive environments to stay focused and in the zone. • Beat it, just beat it! Feel the beat. Let it pass through you. Experience true immersion and perfect soundtrack beat synchronization while smashing through high-quality obstacles, drones, and other targets. Supported Headsets HTC VIVE HTC VIVE PRO HTC VIVE COSMOS VALVE INDEX Oculus RIFT CV1 Oculus RIFT S HP REVERB VR WINDOWS MIXED REALITY",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1076020/header.jpg?t=1640222348",
    "Price": 24.99,
    "Developers": "FIT REALITY",
    "Publishers": "FIT REALITY",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_daebaff2b955ec6fc4a55a950898a761ab24d9ad.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_a5722640785a1dd22d6fb6f68d2e28bde04e8602.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_f5096fc567038e19a82c9ad1c3b64e9a97e167df.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_5d3f890842eab8f5e8a0f201f9673e8d014bea5b.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_8d608a9be963c18793c9845804f845ab4e86ef28.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_7439d65294b49a812be8c1b07500b5c089203e2f.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_b09971016cec36c6b5151cca477fe00b34a619c8.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_a4a613d368ffed9f63c80ed725e0c3825ee9f6a0.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_de7d9450642355c790941b389618be042c76e0ec.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_e4159a2a9275f6d926dfc4b9a0582c22b702d0a5.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_025ce7156924feba432da2b17185384e94a305ec.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_445d6e8385b651d00098cefb77fdc0fb0b672b2c.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_e95bb139132604a19a273af6818c4c9da6857b98.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_aa4c424e667154d79534ba124673a3fa8feb72ba.1920x1080.jpg?t=1640222348,https://cdn.akamai.steamstatic.com/steam/apps/1076020/ss_52d48d495835a8ca60ccfefc705f105d429fd4e7.1920x1080.jpg?t=1640222348",
    "Slug": "viro-move",
    "Meta Title": "Viro Move: Oct 20, 2021, FIT REALITY and Full Overview",
    "Meta Description": "Looking for information on Viro Move? Check out the release date (Oct 20, 2021), developer insights from FIT REALITY, and a complete game summary.",
    "Alt Text Image": "Official header image for Viro Move game - Steam 1076020",
    "Canonical URL": "https://gusku.site/game/viro-move",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Viro Move\", \"description\": \"Looking for information on Viro Move? Check out the release date (Oct 20, 2021), developer insights from FIT REALITY, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"FIT REALITY\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FIT REALITY\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1076020/header.jpg?t=1640222348\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}