{
    "AppID": 1150500,
    "Name": "Voidspace",
    "Release date": "Jul 10, 2020",
    "About the game": "This highly experimental 2D top-down SCIFI MMORPG is attempting to model the human experience in a society. This game isn't just about you and your journey, it's a about how all players progress technology, society, and infrastructure in a virtual environment, together. Every man-made object you come across is crafted by a real player. The crafting/invention system is central to the game. Players can prototype a new version of a weapon or piece of equipment in the hopes of getting a better version that they can use or sell to other players. Once a new item is prototyped, the player can repeat the skill to make that item as much as they want as long as they have the required materials. The skill can then be taught to other players, charging a fee or otherwise. Free to play (soon!) While the game is in Early Access, we have to charge a fee allow players to gain access to the test. This is to limit the number of players we have in the test while we are scaling the servers and polishing the client. We plan on making the game entirely free-to-play monetizing on a premium membership and on cosmetics (no pay to win). If you wish to donate to help support our development efforts, we also offer a series of Kickstarter-like perks with details on our website. Effectively infinite, completely seamless game world TWITCH-BASED GAMEPLAY Voidspace aims to finally bring a limitless multiplayer experience. No 'zones' or seams of any kind, just one enormous game world; everyone is playing together in the same server. Discover other player outposts and possibly join another group in order to maintain your own security. Find ancient abandoned player-made civilizations that you can research and study, acquire, or disassemble and recycle. For those who would rather have a more solo/singleplayer experience, the game world is effectively infinite so you will be able to choose to spawn 'in the middle of nowhere' in order to limit the possibility of seeing anyone. The centerpiece: Invention and Crafting As players go about regular activities in the game, their character will come up with an 'idea' for a new skill or invention. This will happen at random along with a number of other influential factors such as: The character's intelligence A need that the character has been tagged with internally The availability of the materials required for the skill or invention, or the character's knowledge and experience with these materials Other skills or inventions that the character has available to him However for the most part, the best ideas come from more focused research which the character can engage in using a lab or research facility. Generalized experimentation with materials is the first step, and once the character has a certain level of understanding of various materials, he will start to get ideas for actual working inventions that use those materials. Once a character has an idea, he can use the lab to try to create a prototype. The prototype stage is the stage in which the character is trying to turn an idea into a reproducible invention or skill. It may take many tries to get something working, and the difficulty of coming up with a working invention will depend on the following factors: the character's intelligence the knowledge level of the category the invention falls within the level of knowledge the character has of the materials being used the general complexity of the skill Once the character has successfully produced a skill or invention, he will be able to create or perform it at will. For objects or skills that are executed by the character himself (not by some completely automated, mechanical process) the result of the skill or invention will vary somewhat, and the character will get better at producing better and more consistent results through practice. For example, if a character is hacking a certain type of equipment, he will get faster and more accurate, and have fewer failures as he continues to perform that particular skill. The player can then choose to create another prototype in order to get a better end product, by going through the very same process and hoping for a better result. For the most part, the resulting attributes of a skill or invention are random, but they will also be influenced by the 4 factors listed previously. Ideas, skills, and inventions can all be shared freely or sold between characters. In addition to skills and inventions, characters will be able to research concepts in order to open up to them more skills and inventions to be discovered. For example, The Void is a place where physics are different from the natural universe. Characters can use a lab in a research facility to concentrate their research on The Void itself in order to unlock certain concepts that allow for inventions that make use the discoveries made. Generally everything is made by players Since there are no NPCs, there is also no supporting infrastructure in Voidspace. Players will need to create their own infrastructure in order to facilitate their own growth and progression in the game. Players will be able to build and manufacture their own buildings, outposts, bases, cities, ships, ship upgrades and equipment, and even ammunition. Certain large scale projects will also require multiple characters contributing to it's construction. There is no centralized auction house which means the might a player possesses is really relative to his local area. One area might be lacking in ammunition production, so a player can take advantage of that and create the factories required to meet that local need. The alternative would be to have players trade ammunition brought in from the nearest manufacturing plant, which would raise the price of that commodity in the area. Gamers are used to things like 'manufacturing plant' being an item/building you can build. However in Voidspace these concepts don't exist explicitly. Instead a player can build a structure, put the required equipment inside the structure, give it some way of generating or acquiring power, and then use the structure's inventory space to build things. The game gives tools to the player, but what the player does with those tools is up to them. We, the developers, aren't explicitly making 'carriers' or 'businesses' for the player, instead we're giving the player a generic set of tools (like the ability to create objects, the ability to share ideas...etc) and it is up to them to create a business out of it. Due to this, there are so many businesses that can be created, so here are some examples to spur your imagination: Allow players to rent your infrastructure to build their inventions. Sell your services as a defence contractor. Act as a maintenance crew for a base/outpost while players are away. Give other players rides from one place to another if they're without a ship or if you can offer a safer passage. Ferry smaller ships inside of larger carriers for a fee. Store offline players, their ships, and/or their equipment in protected facilities for peace of mind while they're offline. Offer your services as a guard or patrol. Offer your service as an intelligence agent and spy for weaknesses in other players bases. Start a package delivery service that delivers sealed containers with goods. Start a telecom company that delivers messages over a network of long distance communication nodes. Start a bank that secures in-game currencies. Provide loans and credit with interest. Offer insurance for aspects within the game. Voidspace will allow for all of these types of businesses, and many many more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1150500/header.jpg?t=1616773924",
    "Price": 12.99,
    "Developers": "Universe Projects Inc.",
    "Publishers": "Universe Projects Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_5508944e8c0d7b27cc31dfa381f589f49cc7aeb7.1920x1080.jpg?t=1616773924,https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_c37426e39eceeab476c4e478216c3caaa3acdc29.1920x1080.jpg?t=1616773924,https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_e5107c9a20fb4156959b51d2ff1f781371d18274.1920x1080.jpg?t=1616773924,https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_397b8981c34ff97777299a583352154feb222d24.1920x1080.jpg?t=1616773924,https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_ae2c203349b7a34e5c8927209c4cd748f83ab959.1920x1080.jpg?t=1616773924,https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_3ac9bfc58305511ef5cf7977cc70ce1d014881a3.1920x1080.jpg?t=1616773924,https://cdn.akamai.steamstatic.com/steam/apps/1150500/ss_9c5ac55669591db1e017d206170f4c3be362b4d6.1920x1080.jpg?t=1616773924",
    "Slug": "voidspace",
    "Meta Title": "Voidspace: Jul 10, 2020, Universe Projects Inc. and Full ...",
    "Meta Description": "Looking for information on Voidspace? Check out the release date (Jul 10, 2020), developer insights from Universe Projects Inc., and a complete game sum...",
    "Alt Text Image": "Official header image for Voidspace game - Steam 1150500",
    "Canonical URL": "https://gusku.site/game/voidspace",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voidspace\", \"description\": \"Looking for information on Voidspace? Check out the release date (Jul 10, 2020), developer insights from Universe Projects Inc., and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 10, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Universe Projects Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Universe Projects Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1150500/header.jpg?t=1616773924\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}