{
    "AppID": 1258560,
    "Name": "VR Mummy Girl",
    "Release date": "Mar 20, 2020",
    "About the game": "2021/06/23 Big update ver.2.00 has been released! 'VRM loading function' is added, and you can now play the game with your own avatar. In addition, the 'third-person viewpoint camera function' makes it possible to film from various viewpoints during live games! We have also added a 'fitness mode' that makes full use of high knee and squats! In addition, the quality of the stage background and character model has improved and various adjustments have been made. -------------------------- A mummy girl who has been asleep deep inside a pyramid for more than 1000 years wakes up. She doesn’t know what era is it is, who she is, or the reason she's there. She keeps walking, trying to find the exit. Swing your arms down to stretch the bandage, grab the gimmick with the bandage and jump. The realistic VR and high-speed movement are exhilarating and it feels good. Once you get the hang of it, you will come to know the fun of the game. ◆Stretching bandage You are a mummy girl wrapped with bandage. By swinging the controller down, you can stretch the bandage from your arm and release the bandage in the direction you aim at. You can put out the fire of the torch and grab a gimmick with the bandage. ◆High speed jump movement After grabbing the gimmick with the bandage, pull the controller toward you. In this way, you can jump yourself towards that gimmick. Walking speed is slow in this game, however you can move refreshingly by this high-speed jump. ◆Climbing the wall / Trapeze The gimmicks that you can grab are not only on the floor. You can climb the wall by grabbing gimmicks that are placed on the wall and jumping again and again. Grabbing a gimmick that are placed on the ceiling lets you fly in the air like a trapeze in the circus. ◆Trap that blocks the way There are various traps that block your way. For example, there are cliffs that you need to jump over, moving floor, moving walls,and thorn traps that can be damaged when hit. Sometimes it's like a puzzle. ◆Various game stages There are eight stages in this game. It starts with a tutorial, a straightforward simple stage, a three-dimensional complicated stage, a stage climbing up the tower, and a battle with the boss. A variety of stages are waiting for you. ◆The rank of clearing the stage Each stage has a result when you clear it. The rank S, A, B, and C will be announced according to the clearing time, the number of game overs, and the number of items obtained along the way. If you still want to play after clearing all stages, let's try getting rank S for all of them. ◆VRM loading function (New in ver.2.00) During the game (except the title screen), it is possible to load the VRM file from 'Menu screen&gt; Avatar&gt; VRM'. You can play the game with your own avatar. Please be sure to use within the scope of the terms of each VRM. In a circumstance that can be seen by many and unspecified number of people, especially live stream, please check in advance how it will appear. Also, a window will open on the desktop, and the folder name and file name may appear. Please be carefull when you do a live stream. ◆Hide the costume when you release the bandage (New in ver.2.00) There is a function of 'Hide the costume when you release the bandage', although it is limited to VRM made by Vroid. When the bandage is released, the texture of the costume is hidden and the texture of the bare skin can be seen as it is. Swimsuit etc. drawn on the texture on the bare skin. Please make sure that it does not violate public order and morals when you use it. In a circumstance that can be seen by many and unspecified number of people, especially live stream, please check in advance how it will appear. ◆Bandages floating around the avatar (New in ver.2.00) If you enable 'Floating Bandages Around the Avatar' when loading the VRM, a decorative bandage will appear around the avatar. This decoration does not affect the game. You can enable / disable it as you like. It will take some processing load, so turn it off if the spec of your device is not good enough. ◆Third person viewpoint camera function (New in ver.2.00) When you place the cursor on the screen on the desktop side during the game (except the title screen), the '+' button will show up. Click here to add a sub-window and you will get the the image from the third-person viewpoint camera. You can adjust the size of the sub-window and the height of the viewpoint as you like. It is possible to launch multiple sub-windows, but please note that it will consume processing load. ◆Fitness mode (New in ver.2.00) During the game (except the title screen), you can switch to fitness mode by 'Menu screen&gt; Fitness mode' In this mode, you can move forward with a high knee and jump with a squat. It is hard on your body, so please stretch enough before and after playing. You should wear trackers on your hips and legs. This mode is not available, if you don't have a tracker This is a bonus mode. We recommend that you get used to the the normal game in advance before turning this mode on. ------*Notices*------ You may have a blurry screen depending on the playing environment. It seems that the post-effect is applied more strongly than expected depending on the environment. In that case, you can improve by turning off the post effect as follows. Menu button &gt; Option &gt; POST EFFECT &gt; OFF (Added in 2020/08/01 ver 1.02. For previous versions, you can turn off the post effects by using 'Low spec mode') -------------------------- In 2020/08/01 ver 1.02, we changed the algorithm for releasing the bandage to make it easier to release the bandage toward the gimmick that you aimed. --------------------------",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1258560/header.jpg?t=1635942009",
    "Price": 4.99,
    "Developers": "まこちゃんといっしょ",
    "Publishers": "まこちゃんといっしょ",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1258560/ss_799cc0a1871771dd6d14342f141878bc563c81ad.1920x1080.jpg?t=1635942009,https://cdn.akamai.steamstatic.com/steam/apps/1258560/ss_d01a0638bbca49bf256e91dafb9d65604d5f512c.1920x1080.jpg?t=1635942009,https://cdn.akamai.steamstatic.com/steam/apps/1258560/ss_923ec7d8590312fa2c00d8f07f24b539fe79dd2a.1920x1080.jpg?t=1635942009,https://cdn.akamai.steamstatic.com/steam/apps/1258560/ss_a49373a082ecd94e762cd47755744cfb1bbf46c2.1920x1080.jpg?t=1635942009,https://cdn.akamai.steamstatic.com/steam/apps/1258560/ss_e17e6a4cb059747e46807d0ec25e90de93a39cc1.1920x1080.jpg?t=1635942009,https://cdn.akamai.steamstatic.com/steam/apps/1258560/ss_eb65e3b0adf5cdb5a3d7196aa889fd8d6e796bc8.1920x1080.jpg?t=1635942009",
    "Slug": "vr-mummy-girl",
    "Meta Title": "VR Mummy Girl: Mar 20, 2020, まこちゃんといっしょ and Full Overview",
    "Meta Description": "Looking for information on VR Mummy Girl? Check out the release date (Mar 20, 2020), developer insights from まこちゃんといっしょ, and a complete game summary.",
    "Alt Text Image": "Official header image for VR Mummy Girl game - Steam 1258560",
    "Canonical URL": "https://gusku.site/game/vr-mummy-girl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Mummy Girl\", \"description\": \"Looking for information on VR Mummy Girl? Check out the release date (Mar 20, 2020), developer insights from \\u307e\\u3053\\u3061\\u3083\\u3093\\u3068\\u3044\\u3063\\u3057\\u3087, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u307e\\u3053\\u3061\\u3083\\u3093\\u3068\\u3044\\u3063\\u3057\\u3087\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u307e\\u3053\\u3061\\u3083\\u3093\\u3068\\u3044\\u3063\\u3057\\u3087\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1258560/header.jpg?t=1635942009\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}