{
    "AppID": 1737050,
    "Name": "War and Empires: 4X RTS Battle",
    "Release date": "Jan 24, 2022",
    "About the game": "War and Empires is a war strategy game set in the Middle Ages. It tells a story about the ferocious barbarians continued to expand into the empire's territory and occupied the holy city symbolizing imperial power in the dark ages! In order to eliminate the barbarians and regain the imperial power, the lords of various territories established alliances and launched a decisive battle against the barbarians. You will play as one of the lords in the alliance, recruit famous officers to lead, train powerful troops, and unite all the rebellious alliances of the empire to eliminate the invaders, finally achieve world peace by establishing a strong Guild, regain the holy city and reshape the glory of the empire! ✨Game features✨ 1. Freely Troops Marching System The game breaks through the traditional SLG control method and adopts the most advanced free marching system that allows players to command multiple troops on the big map battlefield, freely to march, garrison, roundabout, and flanking at will. Even without a strong troop, you can prevail and win the final victroy relying on your excellent leadership and strategies! 2.Vivid War Strategy Topography The game uses 3D high-resolution image quality and reproduces a variety of real topography. Grasslands, snowfields, deserts, oceans, and abundant landforms allow your strategic talents to be better utilized. Plus, we have simulated wild monsters of famous war on the big map: Wild orcs, Boar Riders, Trolls, Wizards, Treants, Giants, and Dragons, which aim to bring you back to magical era when legends emerged! 3. Multiplayer Combat on Same Screen Virtual monsters are certainly powerful, but fighting againist real players is more complicated. Personal strength can only be king for a while. There is not only one opponent you will face, it could be an entire Guild, or even more. But global players interact in real time. Find like-minded friends to build alliance and have a hearty multiplayer field battle! 4.Reproduce Legendary Hero Using the next-gen high-precision modeling to reproduce the shape of historical characters. The unlimited potential of heroes can be stimulated through a variety of training and strengthening mechanisms. You can choose different civilization at the beginning. The combat units unique to each country are all famous war machines that served the countries throughout history. Great heroes remembered by history are waiting for your recruitment! King Arthur! Caesar! Attila! You can lead the army of the legendary hero in the game, and launch attacks on your enemies! Millions of players have joined this battlefield to defend the holy city. Show off your strategic talents and seize the supreme imperial power, and conquer this land!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1737050/header.jpg?t=1643084447",
    "Price": 0.0,
    "Developers": "DOWNJOY HK",
    "Publishers": "DOWNJOY HK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_0568102b344c1fc9cfc1413069169873976aa134.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_8a2a9b28b3e54626730b504bed034a4f47615bec.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_9c5d7aad19a9064f7c53a936c9e32d6cc14c14fe.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_9b9a0b42910d9a8dd91c3f6edd189de04eaeacd3.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_acc64fa4db8216f9b09c5f911bfdc5918d0a5221.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_cde14cf393de93ca6689bef3e1f31d9bdeca37d5.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_bf569e1859d561fe2e9d2793dc7cb4fa5a27c436.1920x1080.jpg?t=1643084447,https://cdn.akamai.steamstatic.com/steam/apps/1737050/ss_4d3d7149a4bafad9b6e4a08da2b3f37954a7d6bb.1920x1080.jpg?t=1643084447",
    "Slug": "war-and-empires-4x-rts-battle",
    "Meta Title": "War and Empires: 4X RTS Battle: Jan 24, 2022, DOWNJOY HK ...",
    "Meta Description": "Looking for information on War and Empires: 4X RTS Battle? Check out the release date (Jan 24, 2022), developer insights from DOWNJOY HK, and a complete...",
    "Alt Text Image": "Official header image for War and Empires: 4X RTS Battle game - Steam 1737050",
    "Canonical URL": "https://gusku.site/game/war-and-empires-4x-rts-battle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"War and Empires: 4X RTS Battle\", \"description\": \"Looking for information on War and Empires: 4X RTS Battle? Check out the release date (Jan 24, 2022), developer insights from DOWNJOY HK, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DOWNJOY HK\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DOWNJOY HK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1737050/header.jpg?t=1643084447\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}