{
    "AppID": 325630,
    "Name": "Arms Dealer",
    "Release date": "Mar 26, 2015",
    "About the game": "'If you are looking for an easy romp full of action and guns this is not the game for you. ' -JP Huskie ARMS DEALER No one said it would be easy, taking over your father's smuggling empire. It's 2025 and the good years seem long past. So you start with what's left--a barely seaworthy yacht, a few million dollars and the last of your father's business connections who will still speak to you. It would help if the old man prepared you for this day. But after a childhood of boarding schools around the globe, you hardly knew the man or his business. Now he's gone, and most of his fortune has vanished with him. To make matters worse, he disappeared owing millions to the kind people who approach debts with deadly seriousness. They say you have two years to pay up or... it's best not to think about that. Let's get down to business. Two Game Modes and an Editor The game features a campaign mode, with a rich story that explains the world of Arms Dealer in 2025. After one game in the campaign mode, you can play in the sandbox mode, with a variety of custom settings to suit your own playstyle. If you find the game just doesn't suit your ideal environment, you can use the editor to create your own goods to sell, change values, rules, the map and soon much more! Eventually, you can make a total conversion to the game with a powerful set of tools in our editor suite. A Trading Game Trade more than 250 real-life weapons with 160 countries around the globe. Start with one small yacht and if you play your cards right, you can eventually control a fleet of boats, trucks and aircraft to carry your goods. A Diplomacy Game For an Arms Dealer, everything depends on relationships. To win, you'll have to initiate and foster relationships with suppliers to get the best prices and the most coveted weapons. On the other end, you have to create lasting relationships with your customers to get them to pay higher prices and to purchase larger quantities from you. Those relationships can grow through proven loyalty, by completing special request missions, or by supplying their friends while denying weapons to their enemies. At times, good relationships are all that will save you from your enemies. A Strategy Game You must carefully choose the route you take from country to country to reach your destinations. A variety of map filters will help you plan the safest and most profitable routes across the globe. Along your journey, three agencies hound you and try to impose their agendas on you. Competitors also pose a constant threat. Ten of the world's top Arms Dealers are also vying for the most profitable deals and valuable auctions. You can ally with them, track their movements or even try to take them out. Your real nemesis is the APA, an agency whose sole aim is to hunt you down, shut off your access to trading partners and put you out of business. Only by maintaining strategic allies around the globe to protect your passage can you last long enough to raise the money you need to win. A Collector's Dream Arms Dealer features more than 250 weapons to collect, with more than 40 ultra-rare prototypes and historical oddities. It will take dozens of hours and dozens of games to find all of them. And your personal collection carries over from game to game. In the game, you will also find a rich perk system of gameplay advantages awarded for various accomplishments. Each one gives you a valuable edge in your battle for success, and survival. WARNING: Arms Dealer is a true indie game made by a small studio. As such it has rough edges. We are currently working to remake the game with a more intuitive UI and with content more suitable to the average gamer. It was originally designed for a niche group of gamers who relish extreme complexity and very little direction in simulation games. The remake will have two options- the new mode which will be much less obtuse to new users and those who do not wish to spend hours learning a new type of game and it will also feature the original content in a classic mode but with the benefit of the new UI. This remake will be free to all who already own Arms Dealer. We expect it to be finished later this summer, 2016. If you do enjoy figuring out how to manipulate a complex economy and relationship system within the confines of an Arms Dealer simulator, you very well may enjoy the current game as many before have. If you are looking for an easy romp full of action and guns this is not the game for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/325630/header.jpg?t=1533860372",
    "Price": 0.0,
    "Developers": "Case in Point Studios, LLC",
    "Publishers": "Case in Point Studios, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_b98cb316d19712b5642d0133f013b2d240814b7a.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_87b5936eb973e66db892c2e7e09df1d816a2067a.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_5df11a53a4a31c20f53f79ec9efcd46bddb5d185.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_f8ee4cbfad9f8a4dce971f7c9c3dbb648ea9c3f8.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_005935230f62c2c4a1cf31448163553db0f838c8.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_2c14f54953f04af8e7402b51e3f7012e3c997398.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_a666aa5699c6fa5d6607b5bd584044664153a11b.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_008d7696d83a7856b3dc2bcdf5984bcafe028d07.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_87b5936eb973e66db892c2e7e09df1d816a2067a.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_b98cb316d19712b5642d0133f013b2d240814b7a.1920x1080.jpg?t=1533860372,https://cdn.akamai.steamstatic.com/steam/apps/325630/ss_5df11a53a4a31c20f53f79ec9efcd46bddb5d185.1920x1080.jpg?t=1533860372",
    "Slug": "arms-dealer",
    "Meta Title": "Arms Dealer: Mar 26, 2015, Case in Point Studios, LLC and...",
    "Meta Description": "Looking for information on Arms Dealer? Check out the release date (Mar 26, 2015), developer insights from Case in Point Studios, LLC, and a complete ga...",
    "Alt Text Image": "Official header image for Arms Dealer game - Steam 325630",
    "Canonical URL": "https://gusku.site/game/arms-dealer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arms Dealer\", \"description\": \"Looking for information on Arms Dealer? Check out the release date (Mar 26, 2015), developer insights from Case in Point Studios, LLC, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Case in Point Studios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Case in Point Studios, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/325630/header.jpg?t=1533860372\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}