{
    "AppID": 1213780,
    "Name": "Basic Warfare",
    "Release date": "Jan 15, 2020",
    "About the game": "One technological advance, from a past age of rapid scientific growth, was BASIC Form which was capable of compiling tangible binaries. Since it required very little natural resource for operation, with it one could produce matter at incredible rates limited only by the compiler used. Due to the nature of its power it was concealed from the public resulting in very few knowing the war that was waged during its existence. The time has come for its legacy to be revealed... Basic Warfare is a combination of RTS and Action genres featuring realtime multiplayer action combat and strategic economic simulation. Not only can you order your units to destroy your enemies but also join in the fray. Basic Warfare also features a unique energy mechanic for units. In the event your energy depletes your units will begin to fail. Use this to your advantage by targeting enemy energy sources. Core Gameplay Advancement: The game features technological advancement in the form of compiler ages. Starting in the 'Assembly Age' players must gather resources and expand their economy to advance to the 'QuickBASIC' and 'FreeBASIC' ages all while fending off opponent's attacks. Assembly Age: 25% structure recycle value. Up to 2 working hangers. QuickBASIC Age: 50% structure recycle value. Up to 5 working hangers. FreeBASIC Age: 75% structure recycle value. Up to 9 working hangers. The Game's Resources Resource: This is your raw material. It is used for construction of buildings and units as well as advancing research. It is found scattered on the map and to increase your economic advantage it is best to control as many as possible. Note that only 8 scavengers can gather from one resource at a time. Energy: This is your power, sourced from your surroundings via nuclear, hydro or solar powers. It is used to power units while gathering resources, fighting or moving across the map. It is also used automatically to repair damaged buildings. It is important to keep this above zero to keep your units functional. The Game's Units Utility Units Scavenger: An important ASM Age unit, Scavengers are used to gather resources on the map. It is vital strategy to protect them as they cannot defend themselves. Heavy Scavenger: A sturdier unit to replace your ASM scavenger with in late game. Offering faster gather rates, with them you can more effectively gather from the map's limited resources. Offensive Units Patrol: An ASM Age unit for exploration with limited attack capabilities. Light Attack: Offers much better combat performance than Patrol units with very little cost increase. Bomber: Though somewhat slow, Bombers are capable of destroying enemy structures making them vital for victory over your opponent. Fast Attack: An expensive but sturdy and fast unit far superior to other attack units. The Game's Structures Watch Tower: Inexpensive assembly age building for expanding DOV. Because they are easily destroyed they should be replaced in later ages. Compiler: Your only means of obtaining offensive and defensive units. As you advance to later ages it will be able to compile more. Solar Power: An inexpensive and small structure, the Solar Power is useful in early game but as you advance becomes cost ineffective as well as vulnerable. Hydro Power: A cost effective source of energy that must be built in the water. It's also fairly strong making it difficult to destroy. Research Center: Expensive, but the only means of advancing to BASIC ages which without you will find impossible to keep up with your opponent. Energy Cell: Increases the max amount of energy that you can have at any given moment. Small Resource Repository: Increases the max amount of resources that you can store and are necessary for obtaining more expensive items. Large Resource Repository: Increases the max amount of resources that you can store and are necessary for obtaining more expensive items. Hanger: Increases the max amount of units that you can build by 10. Up to 30 in ASM age, 60 in QB age and 100 in FB age. Repair Tower: Reverts damage afflicted to up to 5 units by 2 as long as they are in range of its DOV. Turret: Damages up to 10 enemy units by 2 in range of its DOV by targeting them with invisible electro-magnetic pulses. Fast Repair Tower: Reverts damage afflicted to up to 20 units by 5 as long as they are in range of its DOV. Heavy Turret: Damages up to 25 enemy units by 5 in range of its DOV by targeting them with invisible electro-magnetic pulses. Nuclear Reactor: A very cost effective source of energy. It's somewhat large but also strong. An ideal energy unit for late game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1213780/header.jpg?t=1579107757",
    "Price": 3.99,
    "Developers": "Bog Iron Games",
    "Publishers": "Bog Iron Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1213780/ss_d1de7ce6136f58c2472ff3caa71e4ff88298384c.1920x1080.jpg?t=1579107757,https://cdn.akamai.steamstatic.com/steam/apps/1213780/ss_451ab45490cdf3d5888d1c4c8e00887f8513e162.1920x1080.jpg?t=1579107757,https://cdn.akamai.steamstatic.com/steam/apps/1213780/ss_ed97568da47da7d44a01c526a7d29e261a7d5afe.1920x1080.jpg?t=1579107757,https://cdn.akamai.steamstatic.com/steam/apps/1213780/ss_e9d55dd46b3338d7f5fd2f6d47295933fbfef33c.1920x1080.jpg?t=1579107757,https://cdn.akamai.steamstatic.com/steam/apps/1213780/ss_8ca87603fbb66d5774a7c6aed2aa557e8719db7b.1920x1080.jpg?t=1579107757",
    "Slug": "basic-warfare",
    "Meta Title": "Basic Warfare: Jan 15, 2020, Bog Iron Games and Full Over...",
    "Meta Description": "Looking for information on Basic Warfare? Check out the release date (Jan 15, 2020), developer insights from Bog Iron Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Basic Warfare game - Steam 1213780",
    "Canonical URL": "https://gusku.site/game/basic-warfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Basic Warfare\", \"description\": \"Looking for information on Basic Warfare? Check out the release date (Jan 15, 2020), developer insights from Bog Iron Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bog Iron Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bog Iron Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1213780/header.jpg?t=1579107757\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}