{
    "AppID": 1181820,
    "Name": "Colossal Saga",
    "Release date": "Jul 1, 2020",
    "About the game": "Master a variety of unique characters with layers of depth! From the once peaceful town of Celestia, gather a team of friends and take on a horde of enigmatic evils and bosses in dungeon crawls, survival rounds, racing against the fate of time, or battle it out among yourselves to claim the top hero spot! Challenge yourself with the many modes and take back the corrupt lands of Celestia taken over by the colossals! What is Colossal Saga? Colossal Saga is a local multiplayer (1 to 4 players) action-fighting game with unique, dynamic characters available to play on several well-known classic game modes. The skill-based mechanics-driven combat is easy to pick up for a group of friends trying the game for the first time, and difficult to master, greatly rewarding players with experience and practice. Learn and explore the creative skill designs vastly different from character to character Take on your friends in Versus mode (1v1, 2v2, 4-way death match, etc.) Gather your gang to clear the unique range of dungeon tracks in Dungeon mode Stay close and work together to last long in the challenging Survival mode Design a clever team to outwit and defeat your opponents in Capture the Flag Game Features Interactive character/map selection: choose your character in the stadium of heroes Tight, precise and fluid combat mechanics to translate your skill onto screen Balanced and easy-to-understand gameplay allows for a warm welcome to newcomers, and an old embrace for experts Plug-in and use keyboard, PS4 controllers and XBOX controllers with no driver installation or re-mapping controls hassle 10 classes/characters each with their own distinct set of skills to learn and master. Choose a main to flaunt your talent, or practice them all to become an impressive jack-of-all-trades player! 5 unique game modes to show off your aptitude and conquer your friends! Dungeon maps with randomized objectives and enemies allow for high replay value, each round with a different assortment of loot, rare weapons, enemies and an ending final boss! Over 10 dynamic maps to explore and fight in Experience the game in the same scene with a dynamic action camera",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1181820/header.jpg?t=1597810075",
    "Price": 15.99,
    "Developers": "Paraverse Games",
    "Publishers": "Paraverse Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1181820/ss_f4271f8a22c1b854a642fe561527c18f8c79d8c1.1920x1080.jpg?t=1597810075,https://cdn.akamai.steamstatic.com/steam/apps/1181820/ss_32e17ff551b0629919cdcbc7dcd06e9e1da930fa.1920x1080.jpg?t=1597810075,https://cdn.akamai.steamstatic.com/steam/apps/1181820/ss_50357928a1fa699fd7eb0bd3d8f98244cfbae1b2.1920x1080.jpg?t=1597810075,https://cdn.akamai.steamstatic.com/steam/apps/1181820/ss_7d2146bae6955890d82c70724cd5c7cb4db0f132.1920x1080.jpg?t=1597810075,https://cdn.akamai.steamstatic.com/steam/apps/1181820/ss_2553a76d79902583d3f67f20fe6ebcadbf529d75.1920x1080.jpg?t=1597810075",
    "Slug": "colossal-saga",
    "Meta Title": "Colossal Saga: Jul 1, 2020, Paraverse Games and Full Over...",
    "Meta Description": "Looking for information on Colossal Saga? Check out the release date (Jul 1, 2020), developer insights from Paraverse Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Colossal Saga game - Steam 1181820",
    "Canonical URL": "https://gusku.site/game/colossal-saga",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Colossal Saga\", \"description\": \"Looking for information on Colossal Saga? Check out the release date (Jul 1, 2020), developer insights from Paraverse Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paraverse Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Paraverse Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1181820/header.jpg?t=1597810075\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}