{
    "AppID": 521800,
    "Name": "Command Ops 2 Core Game",
    "Release date": "Feb 15, 2017",
    "About the game": "Assess, Plan, Order, and React – The Decisions are Yours! Command Ops 2 is a wargame engine that lets you assess, plan, order and react at the operational level just like a real Corps, Division and Brigade commander. What sets Command Ops 2 apart from the competition is the most advanced and realistic model of command decision-making implemented to date in a commercial wargame. It is based on: * Hi-fidelity modeling of continuous-time and space; * Realistic command structure and process; * Macro management; and * Orders delay. For that, Command Ops 2 is different than any other simulation wargame: no hexes, no turns, no micromanagement, no click fests. That is why it is in a way simpler and more fun to play but at the same time more challenging, because it makes you command as Commanders do. Command Ops sports some of the most advanced and impressive AI ever devised in an operational-level wargame. It is your choice whether to manage every detail of your army or have the friendly AI manage the war on a lower level while you plan the larger scale maneuvers designed to make short work of your enemy. Just as a historical commander, you can choose where you need to step in and when you need to stand back and let your subordinates do their jobs. The enemy AI will use its skill to launch well-timed and coordinated strikes as it probes your lines for weakness while realistically reacting to your movements! In addition, for the enthusiastic mod community awaiting Command Ops, powerful tools like MapMaker and ScenMaker allow for the creation of maps and scenarios further adding to already near-limitless replayability. Command Ops 2 game application has a new user interface (UI) and enhanced artificial intelligence (AI). The smartest and most realistic operational level wargame just got a whole lot better. Command like a real commander in this pausable, continuous-time simulation of WW2 operational warfare, where the emphasis is on planning, anticipating and reacting to enemy developments. This is not a click-fest, and you don’t have to issue orders to every unit. The world’s smartest operational level AI can be trusted to do a reasonable job of managing your forces. Also included are the editors ( MapMaker, EstabMaker, EstabEditor, and ScenMaker ) for modifying or developing your own scenarios. The Core comes with three scenarios, including the tutorial Return to St Vith, Manhay Crossroads, and Greyhound Dash, all focussed on the Epic 1944 Battle of the Bulge. * Realistic command decision-making at the operational level * Assess, plan, order and react just like a real Corps, Division, and Brigade Commander * No hexes, no turns, no micromanagement, no click fests * One of the most advanced commercial AI opponents ever developed * A contender for the best AI in any wargame * The AI can manage subordinate commanders and handle micromanagement * Automated bridge building * Advanced force allocation algorithms to keep your army balanced and sharp * Multiple force group structures to enable cross attachments and different ways of displaying the order of battle * Reaction and reassessment code for smarter responses from both the enemy and friendly AI * Scheduling code to better manage the sequencing of tasks * Multiple route-finding algorithms so units can rush to battle but become exposed, avoid enemy firepower, stick to covered terrain or take a safe but slow route * Formation movement code, including phase lines * Enhanced sighting code * Enhanced basing code * Intuitive powerful interface * Configurable Interface layout. Just drag dialogs to where you want them and it remembers the layout for next time. * Multiple Screen Support so you can position your dialogs on your second monitor. * Clear and concise tutorial movie to get you up to speed * Order options give you more control including attacks, bypasses, ambushes, stragglers, basing, retaking of position, avoiding friendlies, rest at night, etc. * Automate units and let the cutting edge AI manage smaller units while you concentrate on the big picture * Order timing controls to coordinate tasks * Order supply level settings so you can set resupply priorities * Order of battle display to help you organize your forces * Estab Data views to access weapon and vehicle performance data * Plan dialog so you can see all your orders at a glance * Fire Support dialog so you can manage your heavy hitters (artillery) * Reinforcement dialog so you can manage your new arrivals * Supply Arrival dialog so you can see what resupply you are getting * Filtered Message Log * AutoSave * Interactive Recordings that you can replay and, at any point, change your orders to try out new courses of action * Map patterns now change with the weather * Pathing tools provide an estimate of the duration * Tons of Replayability - many scenario options, including multiple random reinforcement schedules * Extensive unit, vehicle, and weapon estabs, including German, American, British and Italian forces * Full construction set includes editors to create units, equipment, ammo and formations (EstabEditor); maps (MapMaker) and scenarios (ScenMaker) for any battle. * An Estab Editor to modify or create Forces, Equipment, Ammo, Formations, etc. * Mod various aspects of the game, including map patterns and victory messages. * Utilize a big range of force lists for rapid scenario creation * Situation Awareness Maps for easy scenario selection. * And many other features.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/521800/header.jpg?t=1640939619",
    "Price": 0.0,
    "Developers": "Panther Games",
    "Publishers": "Lock 'n Load Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/521800/ss_7e2a40ca88dc5ef5d618a521a7a97a89852c9c50.1920x1080.jpg?t=1640939619,https://cdn.akamai.steamstatic.com/steam/apps/521800/ss_71407cddf1aa4d59edad9ac0d322637ee749d435.1920x1080.jpg?t=1640939619,https://cdn.akamai.steamstatic.com/steam/apps/521800/ss_7dadd12db2e576765832ca705992641b0c38644b.1920x1080.jpg?t=1640939619,https://cdn.akamai.steamstatic.com/steam/apps/521800/ss_408665580231471f10dda39f16864a20b71ed8fe.1920x1080.jpg?t=1640939619,https://cdn.akamai.steamstatic.com/steam/apps/521800/ss_a5e9e345c56ec92d10ffef55de4c9ee662618912.1920x1080.jpg?t=1640939619",
    "Slug": "command-ops-2-core-game",
    "Meta Title": "Command Ops 2 Core Game: Feb 15, 2017, Panther Games and ...",
    "Meta Description": "Looking for information on Command Ops 2 Core Game? Check out the release date (Feb 15, 2017), developer insights from Panther Games, and a complete gam...",
    "Alt Text Image": "Official header image for Command Ops 2 Core Game game - Steam 521800",
    "Canonical URL": "https://gusku.site/game/command-ops-2-core-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Command Ops 2 Core Game\", \"description\": \"Looking for information on Command Ops 2 Core Game? Check out the release date (Feb 15, 2017), developer insights from Panther Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Panther Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lock 'n Load Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/521800/header.jpg?t=1640939619\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}