{
    "AppID": 1949720,
    "Name": "Dandi World",
    "Release date": "Apr 18, 2022",
    "About the game": "The world of the arts has been invaded by a villain who hates artistic expressions and wants to destroy them. Embark on this adventure to save the world of the arts and rescue the Danditos from the clutches of Dr. Hate! Dandi, our main character lives in the world of arts, which was invaded by Dr. Hate, destroying part of these worlds and locking the Danditos in crystals, in this game you will have to overcome levels of great difficulty. This game is intended for people who appreciate art, where you can see how different arts are captured, such as: painting, music, film and literature in a video game. Dandi World is a platform game of medium-high difficulty, where you will have to pay attention to the patterns of the levels and adapt quickly to overcome them. If you want to appreciate the art find a safe place and enjoy the music with the visual effect. Jump on different types of platforms such as: bouncing, rotating, that are destroyed, with thorns and overcome them to get all the coins and rescue the danditos, shoot your power to defeat enemies, paint objects that have been faded by enemies or Flip switches to open doors. At Trialis Studios we always seek to be honest with the community, when you buy this game you are buying between 10 to 30 min, you will probably find that it is short, but this income will be used to finance a more ambitious project called Genimas: Life reborn. The objectives to finance it, is to obtain a number of sales over 100,000 copies, with this we achieve enough traction to attract the attention of a large Publisher. This is the link of the game Genimas: Life reborn: -life-reborn.xsollasitebuilder.com/ Think of this purchase as a kind of pre-Crowdfunding, where you receive a game in exchange for your contribution to develop Genimas: Life reborn. Follow the Trialis Studios page on steam if you want to play Genimas: life reborn in the future: -Trialis-Studios/",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1949720/header.jpg?t=1656899314",
    "Price": 1.99,
    "Developers": "Ruken Games",
    "Publishers": "Trialis Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1949720/ss_9a8a0b553eb51a9aa0db707d81ad58752d00ef41.1920x1080.jpg?t=1656899314,https://cdn.akamai.steamstatic.com/steam/apps/1949720/ss_f8d8ecec52d1038f96b7f84e1163da02da84d9d2.1920x1080.jpg?t=1656899314,https://cdn.akamai.steamstatic.com/steam/apps/1949720/ss_e338ac3e9b7a8f0968d6b167e623deb286886def.1920x1080.jpg?t=1656899314,https://cdn.akamai.steamstatic.com/steam/apps/1949720/ss_6819817f138691e9d24a36b76c2e8603e047ccfe.1920x1080.jpg?t=1656899314,https://cdn.akamai.steamstatic.com/steam/apps/1949720/ss_89fca4987f7b0ff6251611e5e3d554f55cf05125.1920x1080.jpg?t=1656899314",
    "Slug": "dandi-world",
    "Meta Title": "Dandi World: Apr 18, 2022, Ruken Games and Full Overview",
    "Meta Description": "Looking for information on Dandi World? Check out the release date (Apr 18, 2022), developer insights from Ruken Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Dandi World game - Steam 1949720",
    "Canonical URL": "https://gusku.site/game/dandi-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dandi World\", \"description\": \"Looking for information on Dandi World? Check out the release date (Apr 18, 2022), developer insights from Ruken Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ruken Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Trialis Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1949720/header.jpg?t=1656899314\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}