{
    "AppID": 352370,
    "Name": "Defect",
    "Release date": "Jul 28, 2016",
    "About the game": "As a lowly captain on a dead-end planet, you must build a ship, complete a mission and wave it goodbye when your crew defects to the other side. Then design a new ship to hunt down those mutinous traitors in an endless cycle of punishment and revenge. Don't make your designs too good, because odds are you'll be fighting them pretty soon. Unprecedented freedom of creation - Create the most powerful ship in the galaxy piece by piece, with more than 180 components available and many more to come. Exploit your designs - Create the perfect design to complete the mission, but remember to build in a weakness you can exploit later when your crew inevitably turns against you. Epic scale - Unlimited combinations available from tiny fighters up to battle stations the size of a small moon. Fight your friends' ships - Upload your successful ships and take on the best designs the community has to offer. Dynamic Music System - Compose a distinct musical theme for your ship based on the components used to build it. Shipyard The game has two phases: Construction and combat. The construction phase involves placing a power core that determines the size of the ship that can be built, and then adding a selection of ship components. These can be placed, scaled and rotated in any arrangement and will operate according to game rules/physics, affording you a high degree of creativity. Ship components have a range of stats and behaviors based on their main function. There are three main visual styles; TriStage components are very industrial and mass produced, SSN is a streamlined vision of the future and 2255 is a retro throwback to the days of pulp magazines and the space race. New styles and themes are planned and will be based on feedback from our community. Build your dream space craft from key components: Core - Install the power source of a ship and also the ultimate weak point. Weapons - Choose from lasers, blasters, missiles, torpedoes, mines, rail guns, turrets, flak guns, point defense guns and much more. Crew - They're just going to turn against you and chuck you into space, but sadly, you still need crew to run your ship. Hull - This is where a ship gets most of its armor from. Wings - Despite what 'scientists' will tell you, space dynamics is a real thing and wings will help you to design a much more agile and maneuverable ship. Engines - The real difference between a good ship and floating space garbage. Special - Certain components will boost or specialize the abilities of your ship. Fighter decks, shields, radar, heat sinks, exhaust ports, ion intakes, flares and counter measures can all be used to give you an edge, but can also leave you vulnerable if you can't protect them. The combat phase involves you controlling your ship from a top-down 2D perspective and taking on enemy ships. If victorious, you move on to the next mission. If you fail it's back to the drawing board to design a new ship that might fare better. You will cycle between the construction and combat phases, creating and fighting in a continual progression through better and bigger ships as the missions and the story progress. After each mission, however, you will lose your ship to defection and will be forced to defeat your former crew in the following mission. This creates an Achilles heel conundrum for the player. Build the perfect ship, but build in fatal flaws you can exploit later. Campaign Planet Asbestos - Fighting has broken out between corporations, governments, pirates and private citizens over the rights to prospect for a theoretical particle that exists in only one place in the universe. Theoretically, that's planet Asbestos. The research and mining costs have already bankrupted several planets, thus inflating the value of the probably-nonexistent particle and creating a stock bubble that supports the entire economy of the galaxy. Your job - Defend the planet for the Suppressed Systems Navy. Your crew has been drafted from prison, which is turning out to be a less enticing policy than was promised. Morale is low. Mutiny is inevitable. Missions - Consist of a primary objective, after which your mutinous crew will turn up in your previous ship and try to finish you off. Primary objectives include a wide range of scenarios, including taking on simple waves of fighters, capturing space stations, evacuating passengers off a burning cruise ship, and building a ship that looks enough like an enemy ship that you can fool your way past their shields and drop a nuke on their stupid face. Challenge Mode Challenge mode gives you the ability to fight against ships designed by other players, be it friends or anyone in the community. It’s not direct multiplayer, as the opposing ship will be AI controlled. The missions can be quick skirmishes based on core size or a chosen enemy, or fight for survival against waves of enemies, or complete one of the campaign missions with no scrap limitations.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/352370/header.jpg?t=1478563935",
    "Price": 5.99,
    "Developers": "Three Phase Interactive Pty Ltd",
    "Publishers": "Three Phase Interactive Pty Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_0e6700969e13c77030c1ee3985c299dd9defacd7.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_861bd6d2f25fd9696d5846e598906da34f37c04a.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_63335860cbbd8c0294b0cfc77f88a60516affa55.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_afd05384d58486c59c67c3c0015b9754b26c2fe8.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_f2726e4f90857f170c7eebd8bfa7105a7ca12e89.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_c8f1c8a7c94370e56a38b2d0bafec24d13574b15.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_8d4c00ee88c4dfed7d7b07fc050e8956e9ccd437.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_be9399fa0edf73e5218647e1f54b6ac95f9d9b4e.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_579facf565d17675fddd60c79112eb811573b7cc.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_424a4ddc3298a0d2342998a4b9778698db5b3e2e.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_c2943a1a64d2e6fc218a7ec276db6801d81a1109.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_eb107f2f7001b9956fe72665548af90533e09bfa.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_31bbe4eb3be3ea8ae981f48814eb811256f3b9c3.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_3524d911ff33f494ed438db9a25e0694bbd351eb.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_bf8dfe47dfdfbcd7669fecb3c9cc83f9c41ff42a.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_f632c2352e8e6f8d356d09dcd781a6b5c6c1cf52.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_a66e8ea8366a1176b7f1e70a20e7ec7fa9a5cd16.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_e01caa76f6715da70c649cd531b5ebd68e8c2b01.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_42b6867d193e19732aa8ab906f750a00727fe4d9.1920x1080.jpg?t=1478563935,https://cdn.akamai.steamstatic.com/steam/apps/352370/ss_dba3d6f134b6851b44e9ee798eb77e6d5852b628.1920x1080.jpg?t=1478563935",
    "Slug": "defect",
    "Meta Title": "Defect: Jul 28, 2016, Three Phase Interactive Pty Ltd and...",
    "Meta Description": "Looking for information on Defect? Check out the release date (Jul 28, 2016), developer insights from Three Phase Interactive Pty Ltd, and a complete ga...",
    "Alt Text Image": "Official header image for Defect game - Steam 352370",
    "Canonical URL": "https://gusku.site/game/defect",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Defect\", \"description\": \"Looking for information on Defect? Check out the release date (Jul 28, 2016), developer insights from Three Phase Interactive Pty Ltd, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Three Phase Interactive Pty Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Three Phase Interactive Pty Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/352370/header.jpg?t=1478563935\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}