{
    "AppID": 1831630,
    "Name": "建筑吧公司",
    "Release date": "Apr 27, 2022",
    "About the game": "'Construction Bar Company' is a game that simulates running a construction company. The producer independently completed the production and design of this game, and before making this game, he was an architect. The game is both serious and witty, and the serious gameplay design is matched with witty expressions. The game art uses 'blue and white' to create a 'blueprint' temperament; plus red 'notes' and 'imprints', the overall project is full of flavor. Although the game looks 'simple', it is very rich in content. You can simulate all aspects of opening a construction company, such as taking orders, arranging work, team building with employees, PUA your employees, etc.; unlike most simulation business games, This work has a lot of writing on the employment, development and scheduling of staff. -The process of the game is more realistic: you must first accept the project, and at the same time hire the designer, and then let the designer complete the project as soon as possible within the limited period, and finally get the benefits... But in the simple process, the player will Experienced: [project selection], [project bidding], [resume screening], [Party A Yingzhou], [recovery of design fees], [payment of wages] and a series of troubles. One of the most troublesome is the scheduling of manpower. -Manpower is the highlight of the game: when the project is tense, employees should be arranged to work overtime, and overtime will accumulate more wages; if the employees are physically exhausted due to frequent overtime, they will need to arrange a [vacation], which will reduce productivity; potential employees should Only through training and learning can their grades grow faster; employees have different [grades], [occupational orientation], and [good content], all of which bring many different possibilities to work arrangements; in addition, some employees have [qualifications] Certificate], some employees have [Party A background], whether it is [loyalty] or [cohesion], there are too many interesting points in human resources waiting for players to discover. -[Party A] in the game needs public relations; the [technical paper] in the game is an important prop; the most cruel thing is when the salary is paid at the end of each month...hey...it's not easy to be a leader, if you want to achieve To maximize the operating efficiency, it really needs to strategize. (It's a big deal to be in arrears with wages -_-). -In addition, our game is still evolving, you will experience it one after another (the following is the direction of development content in the past 2-3 months): 1. The influence of employees' family attributes, personality attributes, work irritability, etc. on taking leave and resigning; 2. Fund transfers between players (brothers lent me 500,000 turnover, no money to pay wages!); 3. Participate in the game ranking list (Architectural Design Forbes_Let companies know their height); 4. Players dig employees from each other (management is also a kind of rivers and lakes, and all the bamboo shoots on the mountain have been taken away); 5. Players leave messages to each other; 6. Hidden god-level staff appear; 7. Project outsourcing and cooperation; 8. The endless level of conscience. 9. Modifications of small systems: (consumption of love to stimulate creativity, staff drinking and entertainment, appointment of studio director, etc.); 10. Make every effort to beautify the UI and make the vision more enjoyable (hehe); There are many more. . . . . All in all, thank you for playing our game! We will continue to update the content, if you have good ideas, you are welcome to contact us in various ways!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1831630/header.jpg?t=1654576427",
    "Price": 3.64,
    "Developers": "北村群童工作室",
    "Publishers": "BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_e10442d78bf28afd8a44ba03ddee6642502645df.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_962b2f68c31371c88ffe4ca22e70d1172d0ac119.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_f3dbffd2755abbaef68b90d249a5ba77821ebcea.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_0436f85e5a6d9c3a1569f6abc9391bb67ee5dd77.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_a5f50fcaf6390b1ffff37a43e50845bbdf12c4fb.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_f04b05f4ddbcc15ca705b73f844e6f78548c1fb7.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_7338871d86dac09a6ebc8c9ddfdd48bda78738b9.1920x1080.jpg?t=1654576427,https://cdn.akamai.steamstatic.com/steam/apps/1831630/ss_15d3468ef5930450195021669fb6ff7d90df695a.1920x1080.jpg?t=1654576427",
    "Slug": "",
    "Meta Title": "建筑吧公司: Apr 27, 2022, 北村群童工作室 and Full Overview",
    "Meta Description": "Looking for information on 建筑吧公司? Check out the release date (Apr 27, 2022), developer insights from 北村群童工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for 建筑吧公司 game - Steam 1831630",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5efa\\u7b51\\u5427\\u516c\\u53f8\", \"description\": \"Looking for information on \\u5efa\\u7b51\\u5427\\u516c\\u53f8? Check out the release date (Apr 27, 2022), developer insights from \\u5317\\u6751\\u7fa4\\u7ae5\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5317\\u6751\\u7fa4\\u7ae5\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1831630/header.jpg?t=1654576427\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.64, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}