{
    "AppID": 938860,
    "Name": "Get In The Car, Loser!",
    "Release date": "Sep 21, 2021",
    "About the game": "She said 'GET IN THE CAR, LOSER! I know you're not up to anything this summer, I've got the Sword of Fate, and there's an ancient evil that needs to be sealed away.' Everyone knows the story of how the great hero of legend Agi of Roses fought the Machine Devil and used the Sword of Fate to seal him away for a thousand years. Now, hateful Machine Devil cultist edgelords are spreading terror in order to summon him again, and the Divine Order that rules over our world claims that fighting them before it's too late would be 'just as bad as them.' Obviously that won't stand, and that's why three young attendees of the local Academy of Order and one renegade angel from the Divine Order are heading off on a road trip to take the fight to the Machine Devil and his cultists. Will Sam Anon succeed in her mission to seal away evil for another thousand years, hit every diner along the road on the way, AND make it through a single conversation without blushing over her beautiful companions? The toughest challenges she's ever faced in her life lie ahead!​ A lesbian road trip RPG by the co-creator of Ladykiller in a Bind about fighting for love and justice in the face of indifference, and 'discovering yourself,' whatever that means. Introducing... Sam Anon Battle Specialty: Support/Ravage she/her The protagonist of the story, your new goth girlfriend, and the titular loser. She has no idea how she got roped into this trip (it's because she is a lesbian disaster who would do anything a pretty girl told her to) but is going to try her best anyway. The healer of the party. Catch her hollering at the Machine Devil about how the void belongs to everyone.   Grace Morningstar Battle Specialty: Exploit/Destruction she/her Solid A student/queen bitch of the Academy, and the current wielder of the Sword of Fate (100% stolen). She fights for what's right and isn't afraid to drop some BIG DAMAGE to back that up. You should be excited and grateful to have had the chance to have admired her before she becomes the new hero of legend renowned throughout the land.   Valentin Vaillante Battle Specialty: Exploit/Tank they/them Grace's cool boyfriend who actually knows how to drive. A former TA at the Academy of Order, currently taking a break to spend the summer smiling in the face of danger. Normally quiet and reserved, but is capable of projecting when it's time to tank in battle for the entire team... or when they come up with a dumb joke.   Angela Battle Specialty: Exploit/Ravage she/her She big. The Thirty-Second Arm of the Divine Order and an actual literal angel, who has decided she can no longer idly stand by like the rest of the order. She's not sure if it's possible for a being operating on her plane of existence to truly relate to humans, but it seems like it would be fun to try. A completely average fighter by intent, since it would disrupt the divine cosmology if she ever unleashed her true power while fighting alongside mortals, even against the Machine Devil. Features Active time battle system inspired by classic and modern JRPGs—fight strategically and take advantage of each party member's complementary abilities in order to keep momentum on your side and make it through the gauntlet of fights the road throws at you. Equipment-based character progression system: each item offers different abilities based off what character you give it to, and can be rearranged on the fly at any time between fights to create completely different party builds. Genre-defying pop soundtrack by Christa Lee, because how can you say it's battle music if it doesn't even bang? Visual novel inspired dialogue system allows for optimal 'shoving your foot in your mouth while shooting the shit in the backseat' experience. No sidequests, no maps, no codex entries. Who's got time for that when the world is in peril?! Girls. Just... girls... you know...??? They're great The Disaster Lesbian Representation We Need By LOVE CONQUERS ALL GAMES: writing/programming/design by Christine Love (Ladykiller in a Bind), concept art by Isaac Robin (Witch Trade), pixel art by August Cartland, music by Christa Lee (Welcome to the Fantasy Zone), vocals by Jami Lynne. Content note Get in the Car, Loser! is first and foremost a fun adventure story about self-discovery and triumphing over evil in the face of cosmic indifference. But it's also about fighting a reactionary death cult that's sexist, homophobic, racist, transphobic, including domestic abusers and murderers. Sam will have to face evil on her journey, but she will also have to confront her own internal gender anxieties and self-image doubt. There's nothing wrong with stepping back from a fight until you're emotionally prepared for it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/938860/header.jpg?t=1655242941",
    "Price": 9.99,
    "Developers": "Love Conquers All Games",
    "Publishers": "Love Conquers All Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_76008fd5255a24f113412ccbfe049ba535bad8ee.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_400a8c69f16da4bd39e35b4ae87c53ac783fb85c.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_6b303d55233c6e6fa85164ac9d119ec6955e5bf2.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_b5b709ba96eb84f12baf08b10b5670dcebb0ef1c.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_67a7869ba4c74d20149cb5b2369a7e31d3ef3d36.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_a49b0045038644c3344d471ce72d57e42320ff11.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_ac5e006490c0d6e7fbfab1cf65ddc625b22b7b26.1920x1080.jpg?t=1655242941,https://cdn.akamai.steamstatic.com/steam/apps/938860/ss_dee68de3cded321a612e33ab534d61d5c7c587d5.1920x1080.jpg?t=1655242941",
    "Slug": "get-in-the-car-loser",
    "Meta Title": "Get In The Car, Loser!: Sep 21, 2021, Love Conquers All G...",
    "Meta Description": "Looking for information on Get In The Car, Loser!? Check out the release date (Sep 21, 2021), developer insights from Love Conquers All Games, and a com...",
    "Alt Text Image": "Official header image for Get In The Car, Loser! game - Steam 938860",
    "Canonical URL": "https://gusku.site/game/get-in-the-car-loser",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Get In The Car, Loser!\", \"description\": \"Looking for information on Get In The Car, Loser!? Check out the release date (Sep 21, 2021), developer insights from Love Conquers All Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Love Conquers All Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Love Conquers All Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/938860/header.jpg?t=1655242941\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}