{
    "AppID": 1398280,
    "Name": "Great Lakes Simulator",
    "Release date": "Dec 15, 2021",
    "About the game": "Live your dream of driving legendary lake freighters on The Great Lakes with this revolutionary new PC simulator that will take you to another level! Great Lakes Simulator puts you in the Captain's seat of a massive lake freighter underway on the Great Lakes. Head downbound from Lake Superior thru Whitefish Bay and the St. Mary's River to Lake Huron and back in a 1-to-1 scale re-creation of the most famous fresh-water waterway in the world.. The Great Lakes. Simulating a journey thru the Great Lakes allows you to gain an understanding of what to expect on the real journey. After a journey through Great Lakes Simulator you will be graced with the knowledge a seasoned mariner would need in order to approach such a journey with confidence. Great Lakes Simulator can accurately teach you the designated shipping lanes, dredged channels, anchorages and port locations, and the accurate locations of range lights, buoys, and lighthouses. You can set sail anytime you like. A LITTLE HISTORY The Great Lakes is a system of giant freshwater seas along the U.S. and Canada border connected by both natural and artificial channels and huge locks which enable navigation by large ships. The Soo Locks between Lake Huron and Lake Superior and dredged channels in the St. Mary’s River, the Detroit River, Lake St. Clair and the St. Clair River between Lake Huron and Lake Erie allow passage of huge lake freighters most years from late Spring through early Winter. The Great Lakes are prone to sudden and severe storms, in particular in the autumn, from late October until early December. Thousands of ships have met their end on the lakes. The first ship to sail the Great Lakes, and the first ship to sink in the lakes, was Le Griffon. Caught in a 1679 storm while trading furs between Green Bay and Michilimacinac, she was lost with all hands aboard. The largest freighter ever wrecked on the lakes is the Edmund Fitzgerald, which sank near Whitefish Point in a violent storm on its last run of the 1975 season, taking all 29 aboard to the bottom of Lake Superior. The greatest concentration of shipwrecks lies near Thunder Bay, Michigan, beneath Lake Huron, near the point where eastbound and westbound shipping lanes converge. The Lake Superior shipwreck coast from Grand Marais, Michigan to Whitefish Point is known as the 'Graveyard of the Great Lakes.' More vessels have been lost in the Whitefish Point area than any other part of Lake Superior. The Whitefish Point Underwater Preserve serves as an underwater museum to protect the many shipwrecks in this area. In Great Lakes Simulator, you will travel through both of these dangerous zones. THE JOURNEY Start at the Ore Docks in Duluth and head downbound across 1-to-1 scale Lake Superior, past the Apostle Islands, Copper Harbor, and Manitou Island and down into Whitefish Bay and the St. Mary's River. Not far downriver you will pass through the Soo Locks which will lower your ship 22 feet to the level of Lake Huron. A few miles later the river makes a sharp right turn into a narrow dredged channel comprised of a number of ranges marked by special range lights set out in pairs to keep a ship aligned in the channel. Each set of range lights has a name which you can toggle onto the display using the F6 key. At Ninemile Point Light, the upbound and downbound channels split and follow separate paths around Neebish Island coming back together just before Hay Point. Along the way, the Oak Ridge Range Lights and the Rock Cut and Moon Island Leading Lights guide your ship through some of the tightest and narrowest parts of all of the Great Lakes. Soon the lake widens before taking you past the town of DeTour, Michigan and into Lake Huron. As Lake Huron opens up in front of you, an empty horizon reappears and suddenly you are back in the middle of empty sea. Travel downbound thru Lake Huron past Presque Isle, Thunder Bay, and Harbor Beach before arriving in Port Huron, your destination for a downbound journey. The upbound journey from Port Huron to Duluth is just as intense. Great Lakes Simulator was built to accurately simulate the distances and times involved in transiting the lakes. At over 750 miles end-to-end, one complete round-trip journey will take almost 100 hours to complete. All of the included journeys total well over 500 hours, and it's 100% moddable so advanced users can add their own mods, create their own journeys, and change anything they like for a fully-customized world and an infinite combination of possibilities. Check out more great simulators from this developer.. Suez Canal available now! THE LIGHTHOUSES The highlight of any journey thru the Great Lakes is the spectacular light show put on by the seemingly endless array of lighthouses and red, white, green, and yellow range lights, buoys, beacons, and light towers. Marvel as you sail past some of the most legendary lighthouses of the lakes including Detour Reef, Whitefish Bay Light Station, Manitou Island, Gull Island, the New Presque Isle Light, Fort Gratiot Lighthouse, and the Thunder Bay Light. And depend on the range lights and buoys of the St. Mary's River as they guide your ship through the narrow dredged channels. Nautical charts and Digital Elevation Model data were utilized to accurately recreate this dream world to an unbelievable level. Accurate latitudes, longitudes, elevations, and distances make this one of the most prototypical 1:1 scale digital environments possible. Many have pondered life aboard a Great Lakes freighter - this is your chance to simulate the journeys you would take in real time and in full scale. Sixteen miles an hour has never felt so sweet. A SPECTACULAR PC SIMULATOR Take the long approach and spend some time in open sea as you look for land and lights. Choose your time of day. Transit the lakes at night using nothing but the lights. Accelerate time or immerse yourself in a real-time simulation of a days-long transit and dozens of hours at open sea. Journey thru blinding snow and intense thunderstorms. Drive a massive cargo ship to real destinations. Meet ships along the way and take care to avoid collisions. Watch for traffic and lighthouses or watch the sun rise and set over Lake Huron and Lake Superior. With buttery-smooth physics, rich vivid graphics, and ultra-realistic atmosphere and lighting, Great Lakes Simulator will set the standard for PC simulator games for years to come. Experience one of the most famous and important waterways in the world.. the Great Lakes!.. Add Great Lakes Simulator to your Steam library today and set sail tonite!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1398280/header.jpg?t=1651794350",
    "Price": 24.99,
    "Developers": "Digital Light",
    "Publishers": "Digital Light",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_766f1abb6cb3f24ff50635e413446f8b960b101e.1920x1080.jpg?t=1651794350,https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_2328c6aa277fdb29bef0c6e28efa31ab9bd710f9.1920x1080.jpg?t=1651794350,https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_ac0d0bc46ce98654463da74a8799a3d95126adaa.1920x1080.jpg?t=1651794350,https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_0dbeb1f796dd73795f31debb0c3809362dab7c46.1920x1080.jpg?t=1651794350,https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_77d3a5046336c9e409fdb79bcd3562cd828248f0.1920x1080.jpg?t=1651794350,https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_6c459444f526fcf8eb2b579d362e8ce26d7558e5.1920x1080.jpg?t=1651794350,https://cdn.akamai.steamstatic.com/steam/apps/1398280/ss_111f62d334474a08e8d21bc1fd7676c939eb9370.1920x1080.jpg?t=1651794350",
    "Slug": "great-lakes-simulator",
    "Meta Title": "Great Lakes Simulator: Dec 15, 2021, Digital Light and Fu...",
    "Meta Description": "Looking for information on Great Lakes Simulator? Check out the release date (Dec 15, 2021), developer insights from Digital Light, and a complete game ...",
    "Alt Text Image": "Official header image for Great Lakes Simulator game - Steam 1398280",
    "Canonical URL": "https://gusku.site/game/great-lakes-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Great Lakes Simulator\", \"description\": \"Looking for information on Great Lakes Simulator? Check out the release date (Dec 15, 2021), developer insights from Digital Light, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Digital Light\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Digital Light\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1398280/header.jpg?t=1651794350\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}