{
    "AppID": 1191570,
    "Name": "Hero Soul: I want to be a Hero!",
    "Release date": "Nov 16, 2020",
    "About the game": "Taken from the banned texts in the Imperial Library Long ago, on the small continent of Altaria, two races mastered the art of magic. The first were the elves mastering the magics of life known as astral magic. The second were the demons mastering the magics of death known as umbral magic. The elves, fearing umbral magic, banded with the the other races on a crusade to wipe out the demon race. The crusade was all too successful, leading to the extinction of the demon race. The elves no longer contested, ruled Altaria forming the Altarian Empire. Present Day Knowledge of the demon race and umbral magic have all been forgotton. The elves rule over Altaria and occupy the nobility of the empire, while the humans and beastmen that helped them remain commoners in the empire. Cecilia Grey is your less than average human commoner. Her father is a member of a civilian organization known as the adventurer guild, and unlike many girls her age, she wants to join the guild to follow in his footsteps. How will her adventure unfold? Mixing Roguelite and JRPG Genres! Ever wonder what would happen if a story driven JRPG mixed with a rouge-lite? Does that even work? Hero Soul started as an experimental project to explore this concept where I tried smashing the two together, and the result... well you'll have to judge for yourself. What can I expect? Hero Soul is a 2D pixel ARPG, which incorporates traditional RPG/JRPG gameplay with rogue-lite elements. Like traditional rogue-lites, gameplay is broken into runs or small sessions. Each session will be similar but not the same as the last. The story will progress as you do more runs and Cecilia will grow stronger as well! Features - Procedurally generated levels The landscape of Altaria is always shifting, and no two levels will be alike. Experience increased replay-ability with procedurally generated levels, quests, and monsters! No level or run will be exactly the same and no story will be either! - Customizable spell system In Hero Soul you can cast spells in addition to your normal attacks. As you play you will discover spell cards to add to your collection. You may then pick and choose which spell cards to use. Spell effects vary so experiment to find which cards suit your play style. - Modular skill trees While the game's name is Hero Soul, the Hero Soul also refers to the modular talent tree system that handles your character's skills and talents. This system allows you to mix and match different hero archetypes to create your ideal hero. Heroes are are discovered randomly as you progress thorough the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1191570/header.jpg?t=1610557882",
    "Price": 9.99,
    "Developers": "Ryan Su Games",
    "Publishers": "Ryan Su Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1191570/ss_c07eb6232ff71cb3c902c1f01f7e14831471a4f8.1920x1080.jpg?t=1610557882,https://cdn.akamai.steamstatic.com/steam/apps/1191570/ss_567d65cfeef4844d311f1b6cb30fc1c19f3d7c4a.1920x1080.jpg?t=1610557882,https://cdn.akamai.steamstatic.com/steam/apps/1191570/ss_7dc7ec51180032bca647ca36d3fcb787ee5a7f46.1920x1080.jpg?t=1610557882,https://cdn.akamai.steamstatic.com/steam/apps/1191570/ss_05bd908f31aa623c3009778c0f0e641708f9110d.1920x1080.jpg?t=1610557882,https://cdn.akamai.steamstatic.com/steam/apps/1191570/ss_c6d86ebd162864a66968960d03b35ece8c35b421.1920x1080.jpg?t=1610557882",
    "Slug": "hero-soul-i-want-to-be-a-hero",
    "Meta Title": "Hero Soul: I want to be a Hero!: Nov 16, 2020, Ryan Su Ga...",
    "Meta Description": "Looking for information on Hero Soul: I want to be a Hero!? Check out the release date (Nov 16, 2020), developer insights from Ryan Su Games, and a comp...",
    "Alt Text Image": "Official header image for Hero Soul: I want to be a Hero! game - Steam 1191570",
    "Canonical URL": "https://gusku.site/game/hero-soul-i-want-to-be-a-hero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hero Soul: I want to be a Hero!\", \"description\": \"Looking for information on Hero Soul: I want to be a Hero!? Check out the release date (Nov 16, 2020), developer insights from Ryan Su Games, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ryan Su Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ryan Su Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1191570/header.jpg?t=1610557882\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}