{
    "AppID": 1520390,
    "Name": "Hotel Paris",
    "Release date": "Jul 15, 2021",
    "About the game": "The summer air is often filled with romance in the city of love. When one of the major universities announces a language and culture course for the entirety of the summer, many wealthy students from abroad jump on the chance to go abroad. What about you? You're just there to clean their rooms... but why are they so interested in you? A brand-new, 30k word long Otome Visual Novel Choose between 3 different romantic interests, or pursue your happiness on your own 4 different endings Original Soundtrack of 10 tracks! 2560x1440 HD graphic with more than 200 images MEET THE CAST! Elizabeth Faucade Elizabeth is the Main Character of the story. She Is a student in Paris. The only way for her to work there is to be able to support herself without the help of her parents. This means that she has to work a lot during the summer – and study and work during the year as well. During the year she stays with a wealthy family and watches their kids for her rent and food money, but it's barely enough. Even though she is struggling, she is thrilled to be in the city of love. During the summer she is working long hours as a cleaner / 'maid' and this time she is working in the dormitories where all the wealthy kids are. Doesn't like the job she has for most of the year but doesn't mind cleaning, however she wouldn't be able to support herself if she had to work full time just to pay rent and study, etc. Has a blog that blew up on the internet but doesn't earn her any money. She just wants to survive summer, but these boys have different ideas! Matthew White Is already a pretty famous football player and comes from a wealthy family, so he's used to getting what he wants. This, weirdly enough, made him a little naive, goofy but has a huge heart. Wants to protect Elizabeth from harm's way He Is a little 'simple' (so his jokes are pretty basic), but he is sweet to most people Likes Elizabeth because she is very good at helping sort his mess out (he's often in when she's cleaning) and is helpful, teaching him how to do things he doesn't know how to do. Actually is an avid reader of her blog (and has offered money many times but she thought it was a scam...) Jeremy Yates Son of a CEO, he's cold on the outside, but a gentleman. Doesn't want to be just 'his father, the second', wants to earn because of himself and thus he doesn't accept unfair treatment. Doesn't look like it but he is actually happy to be on holiday, as he's the type to enjoy simple things (and sweets). Not a morning person, people often see him eating something sweet. Very intelligent, but also very lazy, he is actually on pretty good terms with his parents who just want the best for him. His French is probably the most fluent out of many of the students. A lot of the girls they study with have crushes on him but he ignores them for the most part. Takeda Kimura Currently training to be an idol but comes from an incredibly wealthy family in Osaka. He is in Paris to learn the language and socialization (some suspect he's there to create his fame even before debut). The truth: he is a painfully shy person that needs to learn how to speak with others (but for some reason he is great in front of the camera!) He grew up sheltered and trained to be a singer so he doesn't know much about others be he is willing to learn. Is fascinated by going out to have fun, deep down wants to travel more before debut (but worries his parents won't agree). Takeda is fascinated by how you can have fun even without spending any money.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1520390/header.jpg?t=1626349508",
    "Price": 12.99,
    "Developers": "Bruni Multimedia",
    "Publishers": "Bruni Multimedia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_69aab5a15117771fbb3841eea0c7276c1ec09632.1920x1080.jpg?t=1626349508,https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_7d85b2c8ca4e793bbaa25e242ecff9fdf0d2af8d.1920x1080.jpg?t=1626349508,https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_f125dd1add3450f332b5025c4f41ecf894d4adf0.1920x1080.jpg?t=1626349508,https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_5cb5e8b6a8efc4950803f8f99f8104f4c670e881.1920x1080.jpg?t=1626349508,https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_54f2e7647fd9784d51f226273009232ed8428c46.1920x1080.jpg?t=1626349508,https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_9a1c9c458612daf25a881ffd158a0622f3cfdfb6.1920x1080.jpg?t=1626349508,https://cdn.akamai.steamstatic.com/steam/apps/1520390/ss_8df44260c159270875395893647900815b66a692.1920x1080.jpg?t=1626349508",
    "Slug": "hotel-paris",
    "Meta Title": "Hotel Paris: Jul 15, 2021, Bruni Multimedia and Full Over...",
    "Meta Description": "Looking for information on Hotel Paris? Check out the release date (Jul 15, 2021), developer insights from Bruni Multimedia, and a complete game summary.",
    "Alt Text Image": "Official header image for Hotel Paris game - Steam 1520390",
    "Canonical URL": "https://gusku.site/game/hotel-paris",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hotel Paris\", \"description\": \"Looking for information on Hotel Paris? Check out the release date (Jul 15, 2021), developer insights from Bruni Multimedia, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bruni Multimedia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bruni Multimedia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1520390/header.jpg?t=1626349508\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}