{
    "AppID": 680480,
    "Name": "ICY: Frostbite Edition",
    "Release date": "Aug 11, 2017",
    "About the game": "SURVIVE THE WHITE WASTELAND ICY is a narrative-driven post-apocalyptic survival RPG set in a new Ice Age, where your life and the lives of your followers depend on every decision you make. Create your own character, using a detailed stat system that influences your abilities to hunt, travel, scavenge, communicate and lead, then begin a journey of survival across the White Wasteland. It is up to you to take on the responsibilities of leadership and guide your newfound nomad family in their fight for survival. Do not take your role lightly, for each decision you make, each word you speak, ripples through the life of your community. Take heed, for you and your clan are not alone in this frozen world. In addition to the elements and the wildlife you encounter, there will be loners and bands of miscreants to deal with. Decide carefully on whom to trust and how to react or the snow covered landscape will become your icy tomb. FEATURES Experience an intense story of survival in a unique post-apocalyptic new ice age setting. Influence the plot with your choices, with numerous shades of morality that lead to multiple endings. Lead a group of survivors, each one with different needs, values and ideals. Scavenge for items and hunt for food while facing the challenges of starvation, illness, harsh elements and other bands of survivors. More than 400 pieces of detailed hand-drawn artwork that portray the bleak and dire landscape of the frozen world. Customize your character by choosing how to distribute attribute points among 9 different skills that affect your abilities and experience through the entire game. Enjoy the new combat system offering a mix between a classic turn based combat system and a trading card game. A COMPLETELY REMASTERED EXPERIENCE After nearly two years since the original release of ICY, Inner Void Interactive and Digital Tribe Games are proud to release ICY: Frostbite Edition, a completely remastered edition of the game. We worked to improve every lacking feature of the original ICY, recreating the game from scratch in Unity 5. Thanks to the exhaustive feedback received from our community and the experience we gained from the original game, we have improved ICY’s formula in many different ways to let it offer a real survival RPG experience in a cold post-apocalyptic world. A new combat system was developed: deeper, more exciting and more challenging than the original one. The survival experience was overhauled in order to offer more variety. A crafting system was introduced, allowing the player to create new items. The original plot was improved and new quests and characters have been added to create a longer and more satisfying experience. The UI was completely reworked to be clearer and better looking.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/680480/header.jpg?t=1531257093",
    "Price": 12.99,
    "Developers": "Inner Void",
    "Publishers": "Digital Tribe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_a654d772e15d8ec4464629e8f18bfc7bc2e1fb46.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_90d3c7fa238ad5b2a64546da53b3859dc88dd31c.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_7d607473917be325bbcae0c5a8834bbee63188b1.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_da9ac3e44ee9c849f68814d390f0264b6b983450.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_a0fdb760a60a4c853e868110d65ada04ab27fd00.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_304702ed4a8e3bac2d61b98f4ce2549618c73d7b.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_446ee4dbbb540d1d38fa822143d8bafc2497e323.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_80a212cebf50aef22e90c96dd3bf58f1798cea49.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_25da9cdb193261c7cfd094ea8419a3f808f1c328.1920x1080.jpg?t=1531257093,https://cdn.akamai.steamstatic.com/steam/apps/680480/ss_3dd89b43e9c0889888695f9351cc0105e128d413.1920x1080.jpg?t=1531257093",
    "Slug": "icy-frostbite-edition",
    "Meta Title": "ICY: Frostbite Edition: Aug 11, 2017, Inner Void and Full...",
    "Meta Description": "Looking for information on ICY: Frostbite Edition? Check out the release date (Aug 11, 2017), developer insights from Inner Void, and a complete game su...",
    "Alt Text Image": "Official header image for ICY: Frostbite Edition game - Steam 680480",
    "Canonical URL": "https://gusku.site/game/icy-frostbite-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ICY: Frostbite Edition\", \"description\": \"Looking for information on ICY: Frostbite Edition? Check out the release date (Aug 11, 2017), developer insights from Inner Void, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 11, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Inner Void\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Digital Tribe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/680480/header.jpg?t=1531257093\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}