{
    "AppID": 1969410,
    "Name": "戦乙女 ikusaotome",
    "Release date": "May 13, 2022",
    "About the game": "In 戦乙女 ikusaotome we can fly with five Valkyries and choose between three game variants. Key features: The direction of the flight is determined by the head movement On the left (VR) hand there are several buttons to interact with the gameplay. We can do so by using the right forefinger Main &amp; hand menu is flagged with icons By gathering points, you can unlock new outfits or upgrade health or weapons. Upgrades can be refunded Player is synchronized (not by hands) with a full view Avatar (can be hidden) We can customize wings, nails, eyes, hair, clothing color and change the name of the player It is designed for fun, but you can adjust the challenge mode. Also, you can grab &amp; use items without interrupting flying, but it needs some practice Any change or progress in this game will be automatically saved. You can reset it in main menu next to the statistic via the bin Day and night background How to start: We start in main menu – on the left next to the statistic there is a terminal for gameplay setup: On the bottom you can set the game variant. White is for quest for spirit, red for competition and blue for fly race. On the left-hand side you can change the degree of difficulty; blue is easy and black is hard. By grabbing the sphere, we can activate or deactivate the special modus. On the right-hand side players can be added or removed (max. is 5) and team assignment can be done (max. 5 teams are possible). We are always player one; the other characters will be randomized but determined by the team setup. Next to the statistic you can choose a level by grabbing one of the boxes on the counter – the level will start after you release your choice. In main menu we initially can’t fly until we visit the question mark (introductions) at the shrine gate. Optional, manually reset/adjust camera view via pushing the left menu button. Game variants: In quest for spirit – we can search for spirits, try to find as many as possible. They are partly or completely hidden by obstacles. Remove obstacles with your sword or fly through them. If all spirits have been found the level is over. In competition everyone has HP points. A character is KO if HP points equals 0; then this character will fly into the five-sided figure on the ground. Level is finished once either all opponents have passed the gate, or your HP is 0. Level could also be finished if you found and toggled three switchers and fly into the five-sided figure in the sky. In fly race – we should try to fly through as many check points as possible. The start and end checkpoint are flagged with an icon. To finish this mode, start with the arrow check point and complete by the check point with the checkered flag. Flying &amp; walking: To fly - put both hands up. The direction of the flight is determined by the head movement. Faster rotations will be done via left or right grip button. To fly faster – put hands forward; interrupt flying via trigger button. On platforms we can walk by teleporting. Using teleporting when flying allows shooting without stopping. Using Oculus: To fly - push the left button Y. To fly faster – push the right button B. (Valve Index is temporary not available – will coming soon) Hand menu: By using the right forefinger, we can act with the hand menu. So, you can show or hide the player or team allocation. Decide weather, obstacles block the fly, or you like to fly through them. Change the actual music or view of your player. And pause the game – if the game is paused use right menu button to continue. Optional adjust camera to player by left menu button. Made with Unreal ( + Marketplace) &amp; Reallusion",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1969410/header.jpg?t=1657886770",
    "Price": 4.99,
    "Developers": "Maets2011",
    "Publishers": "Maets2011",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_da2a0fbfb0f6881093fd2c6b782a1af720b33336.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_3a6ff2a0b5ccfebcba59e550c416253d8f93cf0d.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_3da9d5773f38e3a71328f697e7d4f41b9a2adb16.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_a5c230860bb33b49e6f35b3744bea698bf97d857.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_3f88a461d2d4c21374d10af09957208fa2e22d11.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_2d83fe3aa93dde2b9890603c379dd6ec2c491b75.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_d535134e1d340284a0cbe4718d19e5cb3c17004a.1920x1080.jpg?t=1657886770,https://cdn.akamai.steamstatic.com/steam/apps/1969410/ss_75620b86253fbcf9d56cd270f8064599634e7fd0.1920x1080.jpg?t=1657886770",
    "Slug": "ikusaotome",
    "Meta Title": "戦乙女 ikusaotome: May 13, 2022, Maets2011 and Full Overview",
    "Meta Description": "Looking for information on 戦乙女 ikusaotome? Check out the release date (May 13, 2022), developer insights from Maets2011, and a complete game summary.",
    "Alt Text Image": "Official header image for 戦乙女 ikusaotome game - Steam 1969410",
    "Canonical URL": "https://gusku.site/game/ikusaotome",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6226\\u4e59\\u5973 ikusaotome\", \"description\": \"Looking for information on \\u6226\\u4e59\\u5973 ikusaotome? Check out the release date (May 13, 2022), developer insights from Maets2011, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maets2011\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Maets2011\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1969410/header.jpg?t=1657886770\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}