{
    "AppID": 257730,
    "Name": "Infinity Wars: Animated Trading Card Game",
    "Release date": "Sep 5, 2014",
    "About the game": "Welcome to Infinity Wars Classic. Infinity Wars is a unique trading card game that blends rich lore and artwork with innovative gameplay mechanics that are both simple to learn, and hard to master. With fully animated artwork, eight unique factions to play and master, and constant updates as the game is actively developed, Infinity Wars Classic is an experience you will only find here! Unrivaled Strategic Depth - Outmaneuver your opponents with defensive and offensive posturing. With the simultaneous-turn mechanic, foresight and cunning will prove the difference between victory and defeat. Fully Animated Artwork - Breath life into your trading card experience with 3D battlefields and over 800 beautifully animated cards. (Note: Current implemented number is 600+) Active Dev Team - Our team is working closely with our most passionate players over on Discord, where anyone and everyone is invited to share their experiences and shape the game’s development, design and future! Join us now using this link: The Following features existed in the original Infinity Wars 1, and are confirmed to be in production for Infinity Wars Classic. Rich PvP Game Modes - Craft your deck and take to the battlefield in ranked and casual play; draft decks and join Rift Runs to score epics rewards; battle opponents with curated decks to explore new cards and ensure a level playing field for newer PvP players. Unlimited Card Trading - Build your decks with precision and engage the community with an unlimited card trading system. There is also the aim to let players put their cards on the Steam Marketplace, however this requires more work to confirm it as possible. A Full Free to play experience - While our game is currently in Pre-Alpha and requires Patreon access to play the full game, the full release version will be free to play for all users, with access to trading, crafting, and obtaining cards for free by playing. In 2014, Infinity Wars released on Steam, seeing instant popularity due to the unique structure of simultaneous turns never having been tackled by a TCG as expertly before. The game was supported for many years with 6 full brand new sets of cards being released over time. However, the developers Lightmare Studios were a very small, young studio. There were a lot of industry standard practices that the team just didn’t know about. Zero commenting was left on the code, zero documentation on coding standards was made, and each and every card was hard coded with it’s effects, creating massive amounts of redundancy, and what experts would refer to as “spaghetti code”. This lead to increasingly severe technical difficulties, and the team was tunnel visioned on chasing features and new set releases, exacerbating problems. With no way to fix the problem, we signed our game over to our Publisher to let them handle it, however the problems were much too severe to be fixed even by them, and even small bug fixes became monumental tasks. It wasn’t long before the game was left as it was, with the servers being hosted, but no significant support. And in 2019, Lightmare took back the servers to prevent them from being shut down. Despite the game significantly draining resources, it was kept online or a further year as a service to the few players who remained, before we finally had to put the servers on ice. Shortly after, we finally broke news that we were working on Infinity Wars Classic - a technical remaster built from the ground up using the Infinity Card Engine (born through Infinity Heroes’ early development) to be a much more technically functional version of the game our fans had enjoyed playing for years. In October 2020, we released our Pre-alpha version 0.01 of IWC, which featured only 49 cards. By the end of June 2021, we’re now at Pre-Alpha 0.34, which not only has 650+ animated cards, but also includes a slew of features such as Discord integration, a brand new deckbuilder, 3D battlefields returning, and very recently, a free Demo experience you can play yourself by installing the game today. We want to do right by our oldest players, so one of the biggest things I want to highlight is that players from Infinity Wars 1’s time can import their IW1 collections into IWC. That means your old collections you spent time and money on are going to be yours eventually. This will likely be happening much later in the process, close to when we’re releasing as a free to play title, but this will take time in order to create a system that will work seamlessly for us. Stay tuned for more information when it’s available. Infinity Wars Classic is a patreon exclusive title, and during the pre-alpha, players are given access to full playsets of all cards, to play whatever they want. They also get a huge number of other benefits, including exclusive cosmetic packs, card packs equal to or exceeding the value of their patreon tier, access to patreon exclusive content and events, and much more. For full information, check out infinitywarsclassic.com Infinity Heroes is our cross-platform sister product to Infinity Wars, with a much more simplified and streamlined gameplay style, making it easier for casual gamers to enjoy simultaneous turn strategy card games without diving into the deep end of an immensely large skill cap game like Infinity Wars. It will eventually release as a free to play title across Mobile and Steam, and will work with all Infinity accounts, meaning your items, currencies and progress is tracked between all of our games. You can add the game to your wishlist to get alerted when it goes free to play, or purchase it now for a slew of beta-exclusive goodies, and get into the game before everybody else does. / Infinity Wars 2 is a title in pre-development and prototyping, and will be the game that releases as a sequel to Infinity Wars, with a completely fresh style of game, built on the experiences of developing Infinity Wars 1, and creating something that has potential to feel like a AAA trading card game. However, it’s not receiving much active attention internally as our focus is on IWC and IH. However, we’re currently in discussions with partners, providers and publishers so you can help us make Infinity Wars 2 a reality by heading to the Steam Store and adding the game to your wishlist. You’ll also be the first to hear about any progress being made on the game’s development or status. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/257730/header.jpg?t=1657778469",
    "Price": 0.0,
    "Developers": "Lightmare Studios",
    "Publishers": "Lightmare Studios,Yodo1 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_5070e6f23e31b94a2d76152b440398ec32b49052.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_27f926d5ed698e7ee684c23dce30c338e1aec20f.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_1e7bb21cb7fe4ce66917470d1f2b90edec04fe5c.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_f314fecdb9aec28609d66f836c2e7f74a2f45932.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_d9339cf9741952ae47bb271a6bca9a63da2e710f.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_cec56284ad2a3eb97fed565c2c4423689b104e6f.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_7cf2de559da522ff225e6f065bc9888f1d66d54b.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_7e1acd3650e86031852b15bf2b7a3766d444a8d2.1920x1080.jpg?t=1657778469,https://cdn.akamai.steamstatic.com/steam/apps/257730/ss_13e42e1ab9c54d02ea11246eaadc6c3ac73aa9cc.1920x1080.jpg?t=1657778469",
    "Slug": "infinity-wars-animated-trading-card-game",
    "Meta Title": "Infinity Wars: Animated Trading Card Game: Sep 5, 2014, L...",
    "Meta Description": "Looking for information on Infinity Wars: Animated Trading Card Game? Check out the release date (Sep 5, 2014), developer insights from Lightmare Studio...",
    "Alt Text Image": "Official header image for Infinity Wars: Animated Trading Card Game game - Steam 257730",
    "Canonical URL": "https://gusku.site/game/infinity-wars-animated-trading-card-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Infinity Wars: Animated Trading Card Game\", \"description\": \"Looking for information on Infinity Wars: Animated Trading Card Game? Check out the release date (Sep 5, 2014), developer insights from Lightmare Studio...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lightmare Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lightmare Studios,Yodo1 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/257730/header.jpg?t=1657778469\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}