{
    "AppID": 1522260,
    "Name": "Iragon: Prologue 18+",
    "Release date": "Jul 27, 2021",
    "About the game": "About the Game Iragon: Prologue is the beginning of a story-driven adventure RPG that draws inspiration from anime series like Fullmetal Alchemist, Attack on Titan, and Berserk. It is set in a fantasy world filled with monstrous creatures and merciless soldiers as well as beautiful women who are eager to show you a good time and rock your world. In this prologue, you play as the aspiring knight Darick, thrown into the middle of a war between two nations by a mysterious young woman in need of his help. Iragon: Prologue allows you to experience living out a high fantasy adventure where you are in control of your destiny! It is best experienced in VR, but we've dedicated an equal amount of care and time to make sure that playing without a VR headset packs just as much of a punch. Story You play as Darick, a poor kid from a small village, who won't let anything stand in the way of his dream of becoming a knight and a hero. Everything changes when you meet a young woman who gets ambushed by soldiers of the Empire. You must learn to use your magic and journey into a dangerous world on your quest to bring her home safe. Along the way, you will battle enemy soldiers, undead skeletons, and perhaps cross paths with seductive creatures of the frozen land while you unlock new erotic adventures. Be the hero, live the story, and go on the adventure of a lifetime while immersing yourself fully in the world of Iragon: Prologue. The story is delivered with motion-captured animations and full voice acting from a professional cast. For those who prefer to just get on with slaying witches and laying bitches, we have also made all the cutscenes and interactions skippable. Features Whether you play in VR or not, you can expect us to deliver: A beautiful love interest Interactive experiences with your love interest Different outfits for the love interest Voice acting Motion captured animations A dynamic combat system that features both magic and melee Destructible environments A dialogue choice system that influences the response you get Gameplay This is not just a story with pretty girls. It's an adventure! Fight your way through tough enemies, master the elements with your magic, collect loot, upgrade your powers, go on quests, interact with whoever catches your eye. Immerse yourself fully in the world, the characters, and the story of a full-fledged fantasy adventure RPG.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1522260/header.jpg?t=1655804080",
    "Price": 0.0,
    "Developers": "Repulse",
    "Publishers": "SZH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_6d1acab19add451c204353a535cc7e1a1293027b.1920x1080.jpg?t=1655804080,https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_fabd9a24e2aedf8c648fb4915fc5abf42178d719.1920x1080.jpg?t=1655804080,https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_9348e53a027a17ee125cb611e1e18f09e547fbe0.1920x1080.jpg?t=1655804080,https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_f5758256f5ce25f69526839b4a23998f86bba867.1920x1080.jpg?t=1655804080,https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_afb7e6831abc61e8b41b64246497371ba02fdd21.1920x1080.jpg?t=1655804080,https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_8b28903fe3ca3fe1d10450f8450f073b19a86893.1920x1080.jpg?t=1655804080,https://cdn.akamai.steamstatic.com/steam/apps/1522260/ss_2803ffc5ffc7b0e477549732c671d2c2dc11d1cf.1920x1080.jpg?t=1655804080",
    "Slug": "iragon-prologue-18",
    "Meta Title": "Iragon: Prologue 18+: Jul 27, 2021, Repulse and Full Over...",
    "Meta Description": "Looking for information on Iragon: Prologue 18+? Check out the release date (Jul 27, 2021), developer insights from Repulse, and a complete game summary.",
    "Alt Text Image": "Official header image for Iragon: Prologue 18+ game - Steam 1522260",
    "Canonical URL": "https://gusku.site/game/iragon-prologue-18",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Iragon: Prologue 18+\", \"description\": \"Looking for information on Iragon: Prologue 18+? Check out the release date (Jul 27, 2021), developer insights from Repulse, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Repulse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SZH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1522260/header.jpg?t=1655804080\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}