{
    "AppID": 555640,
    "Name": "Japanese School Life",
    "Release date": "Nov 22, 2016",
    "About the game": "Welcomed by the fluttering of cherry blossom, the main character, Brian, starts a new high school life in Japan. Brian soon starts to get along with two girls in the same class after they start to talk to him. With their help, Brian gradually learns Japanese culture and customs. He deepens his friendships with each girl as they teach him how to study and spend time together after school. He gradually is able to survive through the commuter rush, May sickness, the rainy season, and more as he experiences Japanese culture for the first time. Summer After a particularly unpleasant rainy season, summer vacation starts at last. Brian gets to experience a lot of fun things, including a beach trip with the girls in their swimsuits and summer festivals in yukata. He also experiences popular Japanese summer activities, such as suikawari (watermelon splitting) and summer festival food stalls. And what he looks forward to more than anything is the most popular otaku event in the world, held twice a year– Comic Market. He goes to the venue with his heart racing with excitement, having long dreamt of experiencing his first Comiket. What he sees there is……a battlefield, just as rumored!? Fall The destination of the annual school trip is Japan’s most famous ancient city, Kyoto. The three enjoy sightseeing among the old streets and alleys, and experience the traditional culture of Japan to the fullest. Back at school, Brian gets to experience an actual cultural festival, which he has seen a lot in anime. He is ecstatic when he gets to help run the maid cafe booth. He also enjoys cosplaying for Halloween, which has rapidly developed in Japan in the last few years. With the beautiful colors of autumn in Japan, he deepens his understanding of Japanese culture further. Winter After experiencing a Japanese-style Christmas party, Winter Comic Market has arrived! This time, he doesn’t just go, but actually participates as a circle!? With the coming of the new year, he goes to experience Hatsumode. Setsubun and Valentine’s Day arrive and makes him start to realize that soon it will be time to say good bye. Just like when he first met her, cherry blossom buds are about to bloom. What enters Brian’s mind is her smile. Along with those parting words, he embraces a new resolve… Features: -See the characters come to life through the power of the e-mote system! -In-game text available in both English and Japanese -An in-game accessible tips glossary with Japanese cultural and otaku terminology to enhance your game experience -Nekomimi Mode! because everything is better with cat ears. Voice Cast: -Honda Chiyoko (CV: Taneda Risa) -Suzuki Arisa (CV: Takada Hatsumi)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/555640/header.jpg?t=1580429182",
    "Price": 9.99,
    "Developers": "code:jp",
    "Publishers": "Sekai Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/555640/ss_95cd9c7805b243f7d4adacaf76c0b12f0585a193.1920x1080.jpg?t=1580429182,https://cdn.akamai.steamstatic.com/steam/apps/555640/ss_79773680edf9ffeef48681a967edf067f4340706.1920x1080.jpg?t=1580429182,https://cdn.akamai.steamstatic.com/steam/apps/555640/ss_595397cc27124cfdd603862c2d4383185ede7271.1920x1080.jpg?t=1580429182,https://cdn.akamai.steamstatic.com/steam/apps/555640/ss_1ca7b4441aeae8fe57fcfde57dabde816831ed85.1920x1080.jpg?t=1580429182,https://cdn.akamai.steamstatic.com/steam/apps/555640/ss_610815f0753c9cc58f4b51b97e8536f0ae69a4d3.1920x1080.jpg?t=1580429182",
    "Slug": "japanese-school-life",
    "Meta Title": "Japanese School Life: Nov 22, 2016, code:jp and Full Over...",
    "Meta Description": "Looking for information on Japanese School Life? Check out the release date (Nov 22, 2016), developer insights from code:jp, and a complete game summary.",
    "Alt Text Image": "Official header image for Japanese School Life game - Steam 555640",
    "Canonical URL": "https://gusku.site/game/japanese-school-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Japanese School Life\", \"description\": \"Looking for information on Japanese School Life? Check out the release date (Nov 22, 2016), developer insights from code:jp, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"code:jp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/555640/header.jpg?t=1580429182\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}