{
    "AppID": 1933140,
    "Name": "Jeu de Tarot",
    "Release date": "May 3, 2022",
    "About the game": "This game is a French game. Very popular in France, but only played in this country. So it hasn't been translated in English. When starting the game, wait for the Main page to load, then hit the 'Jouer' button ('Jouer' means 'Play') and then select a game mode to start a game. Description of Tarot cards: A tarot deck is made up of 56 cards with a value from Ace to King like a traditional deck (clubs, hearts, diamonds, spades). The particularity lies in the fact that an additional card 'The knight' is located between the jack and the queen. The trumps are 21 in number (from 1 to 21). They allow during the game to cut any colors to win the trick, knowing that their value corresponds to their number. The last card is The Excuse and functions much like a joker. It has great value for end-game scoring but does not win a trick. The goal of the tarot deck: The principle of the tarot game is based on the bet to achieve a certain number of points for the player who takes. For this he can get help from the Oudlers. The more the player who has taken has at the end of the game, the fewer points he will have to make to win his bet. No Oudlers, he must make 56 points With 1 Oudlers, he must make 51 points With 2 Oudlers, he must make 41 points With 3 Oudlers, he must make 36 points. The Oudlers: There are 3 oudlers: The 21 of trumps. It is the strongest card in the game. The 1 of trump also called 'The small'. Vulnerable card, it must be kept given its value. The excuse. Impregnable card, it is necessary the player judiciously to let slip an unimportant fold. Each Oudler is automatically worth 5 points. That's why if you have all 3, you already have 15 points and only 21 points (36 – 15) to win. Tarot bets (or auctions): When one of the players decides to take, he must bet his victory by taking more or less risk depending on the level of bidding chosen. Namely that all bets are worth 25 points automatically. A small. The bet pays no more than the 25 points. A guard. The bet is multiplied by 2 in case of victory or defeat. A guard without the dog (the one who takes does not look at the dog and guards it). The bet is multiplied by 4 in case of victory or defeat. A guard against the dog (the dog returns to the team). The bet is multiplied by 6 in case of victory or defeat. If no one decides to take, the dealer then redistributes the cards. The course of the game: At the end of the betting of one of the players, the dog made up of 6 cards is then returned to the view of all (in the case of a small or a guard) and given to the taker. He chooses 6 cards of his choice (except the king and the oudlers) and places them in front of him without showing them. The 3 other players then form a team for the duration of this game to try to prevent the taker from succeeding in his bet. The player to the left of the dealer always starts the game. He plays a color and the other players have the obligation to provide the requested color if of course they have the cards. If they don't have one, they can ruff. The winner of the trick is the one who opens the next trick. Regarding trumps, players have the obligation to go up to trumps, that is to say, to play a higher trump card than the one previously played. If a player has no more trumps or cards of the requested color, he can play any card from his deck. The excuse is always kept by the player who owns it. The player cannot win the trick since it has no direct value when played. This one must then when the turn is finished give a worthless card that he chooses in exchange in the previous tricks to complete the trick. The excuse cannot be played on the last turn under penalty of losing it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1933140/header.jpg?t=1651580209",
    "Price": 11.99,
    "Developers": "Net-assembly",
    "Publishers": "Net-assembly",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1933140/ss_77e4af1c424eb8ed5c2a0d271848bf25e8a245e2.1920x1080.jpg?t=1651580209,https://cdn.akamai.steamstatic.com/steam/apps/1933140/ss_d3a10c644ba6114089941da49aa9d0f387efd02c.1920x1080.jpg?t=1651580209,https://cdn.akamai.steamstatic.com/steam/apps/1933140/ss_8332a3e6f8d8a2a2a087ed34cd141f376ecfe031.1920x1080.jpg?t=1651580209,https://cdn.akamai.steamstatic.com/steam/apps/1933140/ss_9967efba3351378df3e323f32d6d8faf8fb1b057.1920x1080.jpg?t=1651580209,https://cdn.akamai.steamstatic.com/steam/apps/1933140/ss_843d4f5fc27753e52fd967950a3c7e92cd65258d.1920x1080.jpg?t=1651580209,https://cdn.akamai.steamstatic.com/steam/apps/1933140/ss_0f2117e329e5a5f3bc1cfc29832ddeab0415b801.1920x1080.jpg?t=1651580209",
    "Slug": "jeu-de-tarot",
    "Meta Title": "Jeu de Tarot: May 3, 2022, Net-assembly and Full Overview",
    "Meta Description": "Looking for information on Jeu de Tarot? Check out the release date (May 3, 2022), developer insights from Net-assembly, and a complete game summary.",
    "Alt Text Image": "Official header image for Jeu de Tarot game - Steam 1933140",
    "Canonical URL": "https://gusku.site/game/jeu-de-tarot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jeu de Tarot\", \"description\": \"Looking for information on Jeu de Tarot? Check out the release date (May 3, 2022), developer insights from Net-assembly, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Net-assembly\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Net-assembly\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1933140/header.jpg?t=1651580209\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}