{
    "AppID": 1422620,
    "Name": "Lazarus Trials: Trial 101",
    "Release date": "Oct 22, 2020",
    "About the game": "Narrative You wake up and immediately feel something is wrong. You don’t know where you are or how you got here. The more you try to piece things together, the more you can’t remember. You can't seem to move your head, but you glance down and see a body that isn't your own. Suddenly a voice begins to speak. It has run countless experiments, and its latest subject is you. You don’t remember signing up for anything like this! But before you say a word, you realize, maybe the voice has answers to the millions of questions running through your mind. So you decide to play along, but will you survive the ordeal that lies ahead? Motivation Compared to books, many modern games are like War and Peace or Finnegans wake; incredibly rich masterpieces but hardly the best starting place for someone learning to read. “Lazarus Trials” is a series of games designed to teach game literacy, the art/skill of being able to consume the media form of video games. It’s the perfect starting point for someone looking to get into gaming as a hobby, but has been incredibly overwhelmed by everything out on the market. Gameplay Trial 101 aims to teach: Navigation through a 3D space using mouse/keyboard or gamepad controller. Coordination between moving and looking around. Advanced movement (i.e jumping) by requiring more than one key/button press at a time. The basics of puzzle solving in games Identifying the target/objective of the puzzle Distinguish between game objects and environment. What can be interacted with and what can’t? Game logic and “out of the box thinking” Testing limits of controls Using the basic controls/mechanics explained to experiment and find different movement capabilities. Comprehension of narrative and instruction through dialog Understanding game hints and instructions through dialog Understanding underlying narrative through dialog Will you be able to survive the Lazarus Trials? Really? Prove it. TIPS Use the settings menu to customize aspects of the game itself, use the detect optimal settings button to quickly get a configuration that would work for you. You will need to manually adjust the resolution to your screen size. 1920 x 1080 at fullscreen typically works for most people. Practice, Practice, Practice. Just like with reading the more you do of it the better you get at it. Perseverance is key! Always try new things! Never be afraid to try something out to see if it works. You may discover some interesting abilities/quirks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1422620/header.jpg?t=1605206693",
    "Price": 4.99,
    "Developers": "Zeitware Studios",
    "Publishers": "Zeitware Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1422620/ss_cd65341cf0304f2668dccc72dc187dd78bec28cd.1920x1080.jpg?t=1605206693,https://cdn.akamai.steamstatic.com/steam/apps/1422620/ss_275686d9f99a5179c07dea8e6c1174ea974645c9.1920x1080.jpg?t=1605206693,https://cdn.akamai.steamstatic.com/steam/apps/1422620/ss_471e1f27d48b1ee7b95129d3d302251c3db58ed0.1920x1080.jpg?t=1605206693,https://cdn.akamai.steamstatic.com/steam/apps/1422620/ss_1d95d8c05f14de35280c56d2a64a76e0884e3f54.1920x1080.jpg?t=1605206693,https://cdn.akamai.steamstatic.com/steam/apps/1422620/ss_4b8fc4aa65b7de42c8afa57113c2f2705b15b72d.1920x1080.jpg?t=1605206693",
    "Slug": "lazarus-trials-trial-101",
    "Meta Title": "Lazarus Trials: Trial 101: Oct 22, 2020, Zeitware Studios...",
    "Meta Description": "Looking for information on Lazarus Trials: Trial 101? Check out the release date (Oct 22, 2020), developer insights from Zeitware Studios, and a complet...",
    "Alt Text Image": "Official header image for Lazarus Trials: Trial 101 game - Steam 1422620",
    "Canonical URL": "https://gusku.site/game/lazarus-trials-trial-101",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lazarus Trials: Trial 101\", \"description\": \"Looking for information on Lazarus Trials: Trial 101? Check out the release date (Oct 22, 2020), developer insights from Zeitware Studios, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zeitware Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zeitware Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1422620/header.jpg?t=1605206693\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}