{
    "AppID": 1576950,
    "Name": "Legend of Heroes : Eternal Arena",
    "Release date": "Jun 16, 2021",
    "About the game": "3D real-time combat, micro-manipulation + on-hook dual gameplay. This is a full 3D real-time battle card strategy RPG. It adopts the classic MOBA operation of point-and-floor position and an automatic battle dual-play system. You can choose to become a technical master or a casual player. Full 3D dark wind battle scenes, Western magical Q version characters, a strong sense of strike, gorgeous skills and special effects, and over 1,000 combinations of heroes, bringing you a cool and immersive experience! A variety of PVP gameplays. Do not accept to fight. 10S online real-time matching, 3 minutes of fast battle, compete with global players, and rule this legendary world. Personal battle: -Arena: You can compete on the same stage with players from all over the world anytime, anywhere -Glory Battlefield: Match online players from all over the world in real time and win the highest honor by strength. -Mine situation: You can grab resources of other players by plundering, or you can defeat other players to occupy the veins by occupying Team battle: -World BOSS: Challenge the evil big devil with players from all over the world and earn rich rewards. -Guild BOSS: Join the guild and join forces with guild members to kill powerful guild bosses. -Guild Wars: Fight against other guilds with all guild members to become the strongest demon hunting team. -Arena: Match teammates and opponents online in real time to start a 2V2 team battle. A variety of PVE gameplay, upgrades and leisure are not missed. Nearly 30 main plots, more than 400 level designs, come and cultivate a strong hunting team! -Mainline Dungeon: Divided into ordinary and elite versions, different copies of customs clearance can get rewards of different values. -Material Dungeon: You can obtain different props and resources for hero growth by challenging guild dungeons, hero trials, guild dungeons, devil treasures, and ancient relics. No liver, no krypton super health, you can get rewards when you go online. Becoming stronger is the core goal of all players. You can improve your hero's combat power through various methods such as equipment upgrade, equipment enhancement, skill enhancement, talent awakening, and artifact training. By matching heroes and strengthening team skills, you can also create multiple legendary teams! There are more than 1,000 combinations of heroes to choose from. Who is the strongest combination? Tired and sleepy, no time? Then hang up! No matter where you are, your hero will always fight for you as always! When you wake up, you can go online to collect huge loot, and you will be in a super beautiful mood all day long! 10S real-time matching, a battle in 3 minutes, over 1000 combinations of heroes, are you ready to fight? If you encounter any problems in the game, you can contact us at any time~~~~",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1576950/header.jpg?t=1624527800",
    "Price": 0.0,
    "Developers": "MoyeGames",
    "Publishers": "MoyeGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_79375dcc46a79058daddd481372791b48f4d2337.1920x1080.jpg?t=1624527800,https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_8066761fc9cdbf417350430bfcdf88bc1c261b98.1920x1080.jpg?t=1624527800,https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_817a876a7c7e8c909055c14f801514c893d3ccda.1920x1080.jpg?t=1624527800,https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_1869c6de8bfe863269a0af68df2cc9db28e40c3a.1920x1080.jpg?t=1624527800,https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_151f098eff04c3e3678b9cfc41ce839fd1be40cc.1920x1080.jpg?t=1624527800,https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_8681a14d99f5e9c0f62c78435a0820ee94cf4d2a.1920x1080.jpg?t=1624527800,https://cdn.akamai.steamstatic.com/steam/apps/1576950/ss_94b250bf5540ead5c32ad74533ea817ee060e425.1920x1080.jpg?t=1624527800",
    "Slug": "legend-of-heroes-eternal-arena",
    "Meta Title": "Legend of Heroes : Eternal Arena: Jun 16, 2021, MoyeGames...",
    "Meta Description": "Looking for information on Legend of Heroes : Eternal Arena? Check out the release date (Jun 16, 2021), developer insights from MoyeGames, and a complet...",
    "Alt Text Image": "Official header image for Legend of Heroes : Eternal Arena game - Steam 1576950",
    "Canonical URL": "https://gusku.site/game/legend-of-heroes-eternal-arena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Legend of Heroes : Eternal Arena\", \"description\": \"Looking for information on Legend of Heroes : Eternal Arena? Check out the release date (Jun 16, 2021), developer insights from MoyeGames, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MoyeGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MoyeGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1576950/header.jpg?t=1624527800\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}