{
    "AppID": 1026560,
    "Name": "LOGistICAL 2: USA - Nevada",
    "Release date": "Feb 22, 2019",
    "About the game": "Package includes: LOGistICAL 2: Nevada USA LOGistICAL 2: Tuvalu (FREE L2 tutorial) LOGistICAL 2: Suriname (FREE) LOGistICAL: Tutorial LOGistICAL: Isle of Man (FREE) LOGistICAL: Xmas 2017 (FREE) LOGistICAL: ABC Islands (FREE) LOGistICAL 2: USA - Nevada is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns and businesses throughout the state. ... including Casinos, Golf Courses, Ghost Towns, UFOs, Hoover Dam and a Gigafactory. Each LOGistICAL module has many unique things to do. In LOGistICAL 2: USA - Nevada you can: Fix roads to towns, businesses and throughout the complex road system. Upgrade minor roads to enable 8 ton, 20 ton and much larger trucks to traverse. Roads to towns and businesses are all of the highest quality, so don't need upgrading. Find some of the industries throughout the map. Upgrade them so you can build your own. Complete enough businesses and they will build industries for you with the 'Business Industry Cycle' (BIC). Incomplete towns will allow an industry to be built. Once the town is complete you can build more. Buy a gold mine and then complete casino businesses to play the mini-games within the casinos. Change surplus cash into truck boosts. Over 150 industry types. Over 50 business types. Businesses don't consume resources. Unlock towns by completing surrounding businesses. Businesses now have a static score this is not based on trucks sizes or amounts. Complete businesses to gain truck boosts. Truck boosts include a super speed multiplier. Module includes contracts to complete for those not knowing just where to start. Discover UFOs, Ghost towns, a Gigafactory, Hoover Dam, Burning Man, ++ LOGistICAL Summary The whole game is a huge puzzle while each town is its own little piece of puzzling. There are thousands of town and businesses to complete. Plenty of towns are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing regions and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Boost up your trucks with bonuses. Last truck delivering gets the bonus. The towns, roads and map are to scale. Current or historical industry placement. It is very educational as well as entertaining. There Is Plenty More to Keep You On Your toes. Towns consume the cargoes you are trying to get to completion. Big trucks are great for moving lots of stuff, but can't travel everywhere. There are lots of broken roads that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. What! I can't take my big trucks across the water on a ferry. ... and what is with those quarantine checkpoints? Complete towns, roads, industries, contracts, regions and states for lots of in-game and Steam achievements. LOGistICAL 2: USA - Nevada continues version 2 of the LOGistICAL puzzle family. The map has been enhanced and the towns are everywhere plus many other new functions. Many new LOGistICAL 2 updates will also be backward compatible for LOGistICAL 1 modules. New road mapping Thousands of mini towns to complete with many different resource requirements Hundreds of towns and thousands of businesses and other places to complete Supply and finish many large cities Work your way through the long complex maze of road enhancements to finally allow all your large trucks access across the state or country Road upgrading Many, many other small and large puzzles and situations to complete. LOGistICAL 2 brings you all the fun and puzzling of LOGistICAL with even more towns, more puzzles and much more to do. This LOGistICAL 2: USA - Nevada module brings you... Over 100 towns and 5,000 businesses to complete. There are 50 types of business to discover. LOGistICAL 2: USA - Nevada game covers the state of Nevada, USA including cities like Las Vega, Reno, Carson City, Death Valley and many, many more. There are many new obstacles and deliveries to make.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1026560/header.jpg?t=1563834300",
    "Price": 9.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_8d1d77485f344dbc0f1ed9cc5d5b54bba01f30a6.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_bfa23b0a3a9e893a6ac69c8c190fadaf50ab1b84.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_28a83eb5a9f5729ebfac1b48d2d43b0ccbc7e1f6.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_d8daa667520859d71961ca981cdb73e4026e1d0f.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_23068ea8358fa3644eaa50b466620c78c79b406a.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_a4f4f9de599b64407026ba339750bfc68a259863.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_24410f30c92588e87866752fd5c5b54d1ce7e347.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_3af394f3db1cd406b5479f4c052e715038d68ffb.1920x1080.jpg?t=1563834300,https://cdn.akamai.steamstatic.com/steam/apps/1026560/ss_9a12ab1d015c8eb6d7ee4dc5d5054a9bc2683aa5.1920x1080.jpg?t=1563834300",
    "Slug": "logistical-2-usa-nevada",
    "Meta Title": "LOGistICAL 2: USA - Nevada: Feb 22, 2019, Sacada and Full...",
    "Meta Description": "Looking for information on LOGistICAL 2: USA - Nevada? Check out the release date (Feb 22, 2019), developer insights from Sacada, and a complete game su...",
    "Alt Text Image": "Official header image for LOGistICAL 2: USA - Nevada game - Steam 1026560",
    "Canonical URL": "https://gusku.site/game/logistical-2-usa-nevada",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL 2: USA - Nevada\", \"description\": \"Looking for information on LOGistICAL 2: USA - Nevada? Check out the release date (Feb 22, 2019), developer insights from Sacada, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1026560/header.jpg?t=1563834300\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}