{
    "AppID": 990230,
    "Name": "Mind Massaging Machine",
    "Release date": "Dec 20, 2018",
    "About the game": "Is your mind tired? Do you want to feel your mind fresh and healthy again? Give your mind a relaxing massage or use self-help hypnosis. The new mindfulness app combines the power of virtual reality and brain wave synchronization to help you find balance or improve yourself. VR Mind Massage Listen to relaxing sounds or customize your massage sounds as you like in this exceptional mind massage app. Customize it to your personal preferences, choose which audio-visual enhancement effects to use. Let life-changing positivity flow again with the help of technology and that too in virtual reality if you like. Features Designed for VR Get mind massaging sessions, do self-hypnosis, mindfulness in Virtual reality for a more close, real-life, natural sessions Spatial Audio Sound is carefully positioned in 3D space to improve the immersion of the experience. Brainwave Synch through different approaches Brainwave synchronization is the attempt to use external stimuli to change the main frequency of the brain. Please use your favorite search engine to find information, research material, and effects of certain frequencies. Strobe light The screen emulates a strobe light effect, overlaying the rest of the view. This effect is easy enough on the eyes to be comfortably viewed with open eyes and not very distracting from the other visuals. The Strobe Light has the desired brainwave frequency. Binaural beats Each ear gets a tone played to, defined by the value set in Base Tone. Both tones get modified so that the difference in Hertz equals the desired brainwave frequency. This can be used for meditation, mindfulness, relaxing, and calm. Isochronic tones Each ear gets a tone played to, defined by the value set in Base Tone. These tones are modulated in volume to create a pulse. This pulse has the desired brainwave frequency. A growing library of hypnosis and mind massage sessions: These hypnosis and mind massage sessions are designed to calm your mind, help you meditate, have useful mindfulness sessions for more focus and stress relief. Beautifully handcrafted visual focus environments Beautiful visual focus environments provide for a conducive headspace while you meditate or have a head massage. Support for regular 2D displays Easily conduct your meditation or hypnosis sessions even on 2D displays. Add custom sessions made by yourself or a trusted friend or your therapist Have your hypnosis therapy sessions, or meditation or mindfulness sessions easily designed with the help of a therapist, friend, or yourself. To create your own sessions you can use the 'SessionMaker' tool, it's included. Find or create custom sessions on mindfulness, stress management, and anxiety relief. They are all designed to help you stress less, focus more, and feel better.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/990230/header.jpg?t=1592325085",
    "Price": 14.99,
    "Developers": "Heptamind",
    "Publishers": "Heptamind",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/990230/ss_4a1e097ec30924bed1c1bbe5f899ac82b7e03d18.1920x1080.jpg?t=1592325085,https://cdn.akamai.steamstatic.com/steam/apps/990230/ss_b55f6adfb25e7e56fdd5c4adaea9e5774eaf8eaf.1920x1080.jpg?t=1592325085,https://cdn.akamai.steamstatic.com/steam/apps/990230/ss_d3cb599c8f8264e6a1127d43f859595b4b7722b3.1920x1080.jpg?t=1592325085,https://cdn.akamai.steamstatic.com/steam/apps/990230/ss_f06048239519799b128dbaa33dafef99c4986257.1920x1080.jpg?t=1592325085,https://cdn.akamai.steamstatic.com/steam/apps/990230/ss_c3746932e86dc22bf0c8f93205f2ad6d866bc4eb.1920x1080.jpg?t=1592325085",
    "Slug": "mind-massaging-machine",
    "Meta Title": "Mind Massaging Machine: Dec 20, 2018, Heptamind and Full ...",
    "Meta Description": "Looking for information on Mind Massaging Machine? Check out the release date (Dec 20, 2018), developer insights from Heptamind, and a complete game sum...",
    "Alt Text Image": "Official header image for Mind Massaging Machine game - Steam 990230",
    "Canonical URL": "https://gusku.site/game/mind-massaging-machine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mind Massaging Machine\", \"description\": \"Looking for information on Mind Massaging Machine? Check out the release date (Dec 20, 2018), developer insights from Heptamind, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heptamind\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heptamind\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/990230/header.jpg?t=1592325085\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}