{
    "AppID": 809870,
    "Name": "Ninjin: Clash of Carrots",
    "Release date": "Sep 4, 2018",
    "About the game": "Ninjin: Clash of Carrots is an anime-inspired beat-‘em-up with a gaggle of varied enemies, deep customization…and ninjas! Play through side-scrolling worlds consisting of multiple stages and collect carrots stolen by the evil Shogun Moe! Carrots act as currency which can be redeemed in the Corgi Store for new equipment, or the Shady Shop for special weapons, masks and other customization items. Grab a friend to join you in 2-player online or local co-op. Be a Ninja. Play as either Ninjin, the charismatic rabbit, or Akai, the ninja fox, and fight across a feudal Japan to defeat the evil Shogun Moe and retrieve the carrots he’s stolen! Engaging Storyline. Follow a robust Story Mode, meet a diverse cast of characters, and play through multiple stages in a crazy universe. Fast and Furious Combat. Dodge rockets, blast through throngs of incoming enemies and battle bosses in frenzied, fast-paced action! Stylish Visuals. Play through unique environments with anime-inspired HD pixel art graphics. Deep Customization. Choose from a huge variety of equipment with more than 150 weapons and items, including masks, swords, projectiles, and more. Equip your character to better defeat rivals. Slash, Smash and Bash with Friends! Join your friends in 2-player local or online co-op as you progress through the game’s story. Oni TV Show. Compete in a “Live TV Show” survival mode, solo or with a friend, to see who can get the furthest without dying, as wave after wave of enemies attack from all angles. Rack up special rewards when you successfully finish each challenging stage! Carrot Collecting Co-Op Action! Armory fit for a Ninja! Featuring over 150 weapons, projectiles, upgrades, and more to modify the experience to each player’s preference, Ninjin: Clash of Carrots is an action-packed thrill-fest with a unique and immersive storyline, stylish environments, and exciting and frenetic gameplay! Ninjin also features a unique survival mode called “Oni TV Show” where players will fight endless waves of enemies for rare rewards. This mode also supports local and online co-op.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/809870/header.jpg?t=1600452231",
    "Price": 9.99,
    "Developers": "Pocket Trap",
    "Publishers": "Modus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/809870/ss_13836af8907aff6ed265ca5662884e36e13435bb.1920x1080.jpg?t=1600452231,https://cdn.akamai.steamstatic.com/steam/apps/809870/ss_1b6609d59e5e364a5c373178aa4c48099c577a02.1920x1080.jpg?t=1600452231,https://cdn.akamai.steamstatic.com/steam/apps/809870/ss_e9c5038be2a07d1abd138a2302f92cc87ab0c71f.1920x1080.jpg?t=1600452231,https://cdn.akamai.steamstatic.com/steam/apps/809870/ss_1b23291b8d2419aa759bb45aa79c54ca0328a2a6.1920x1080.jpg?t=1600452231,https://cdn.akamai.steamstatic.com/steam/apps/809870/ss_f83ab8bca1a6aa36508a4053e161cab9aca745dd.1920x1080.jpg?t=1600452231,https://cdn.akamai.steamstatic.com/steam/apps/809870/ss_8891aac0fc2cc722daf881060c0d808a8c1b8db9.1920x1080.jpg?t=1600452231",
    "Slug": "ninjin-clash-of-carrots",
    "Meta Title": "Ninjin: Clash of Carrots: Sep 4, 2018, Pocket Trap and Fu...",
    "Meta Description": "Looking for information on Ninjin: Clash of Carrots? Check out the release date (Sep 4, 2018), developer insights from Pocket Trap, and a complete game ...",
    "Alt Text Image": "Official header image for Ninjin: Clash of Carrots game - Steam 809870",
    "Canonical URL": "https://gusku.site/game/ninjin-clash-of-carrots",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ninjin: Clash of Carrots\", \"description\": \"Looking for information on Ninjin: Clash of Carrots? Check out the release date (Sep 4, 2018), developer insights from Pocket Trap, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pocket Trap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Modus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/809870/header.jpg?t=1600452231\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}