{
    "AppID": 747790,
    "Name": "Olson's Boxing Challenge",
    "Release date": "Nov 20, 2017",
    "About the game": "Olson’s Boxing Challenge is a top down game that features 7 different modes and local multiplayer features. Have fun on the couch with your friends and kick back and have some fun with some good old boxing competition. If no friends are available, have fun in the single player or our endless challenge mode! There is much to enjoy for everyone in the boxing ring. Full controller and keyboard support are present and both allow for easy control of your fighter. Impartial Studios is a one man operation ran by a second year college student named Jake Olson. Hence the name, “Olson’s Boxing Challenge”. The game has a lot of value for the one dollar that it costs and I promise you’ll get a lot of bang for your buck! Continued support is planned to come to Olson’s boxing challenge in the form of new game modes in the future! I’m always looking for positive and negative feedback in order to make the product better. Don’t hesitate to shoot me an email on the Impartial Studios website. Barebones: A classic punch out mode that tests player's abilities to punch fast and block blows at the right moments. Arcade: Power ups litter the ring and change up the game play. Stamina boosts, bear traps, health boosts, and fireballs are available for the players to find in the ring. Ice Skates: Player speed has increased and deceleration has been set to zero! Slip n' slide around the ring in the fast paced mode. Flame Thrower: Your fists now can throw fireballs! Don't get burnt in this hot game mode. Aldo K.O.: A knockout game mode that will test the player's ability to gauge distance and understand timing in the ring. One solid punch will knockout your opponent! Chaos: The game mode that combines all modes into one. The players who have mastered each rule set will be successful! - Easy to understand fighting mechanics - Intuitive orientation of characters - Singleplayer - Same Screen Local Multiplayer - 7 different game modes - 1 Challenge Mode - Full Keyboard Support - Full Controller Support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/747790/header.jpg?t=1514013261",
    "Price": 2.99,
    "Developers": "Jake Olson",
    "Publishers": "Impartial Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/747790/ss_7279ee84f44f160d992b096749b9084070fa437b.1920x1080.jpg?t=1514013261,https://cdn.akamai.steamstatic.com/steam/apps/747790/ss_1c2204cdda6484ad8af0a416f34df6ef655a6552.1920x1080.jpg?t=1514013261,https://cdn.akamai.steamstatic.com/steam/apps/747790/ss_31ff505fa27e1352eb443a5848b783e861ec6d69.1920x1080.jpg?t=1514013261,https://cdn.akamai.steamstatic.com/steam/apps/747790/ss_1be7674b67b1d5c07cdc99344f503a43f2e9d64f.1920x1080.jpg?t=1514013261,https://cdn.akamai.steamstatic.com/steam/apps/747790/ss_f313d43d9a693ed66f91c447d9fa832cc9d512e4.1920x1080.jpg?t=1514013261",
    "Slug": "olson-s-boxing-challenge",
    "Meta Title": "Olson's Boxing Challenge: Nov 20, 2017, Jake Olson and Fu...",
    "Meta Description": "Looking for information on Olson's Boxing Challenge? Check out the release date (Nov 20, 2017), developer insights from Jake Olson, and a complete game ...",
    "Alt Text Image": "Official header image for Olson's Boxing Challenge game - Steam 747790",
    "Canonical URL": "https://gusku.site/game/olson-s-boxing-challenge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Olson's Boxing Challenge\", \"description\": \"Looking for information on Olson's Boxing Challenge? Check out the release date (Nov 20, 2017), developer insights from Jake Olson, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jake Olson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Impartial Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/747790/header.jpg?t=1514013261\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}