{
    "AppID": 1254130,
    "Name": "Phobies",
    "Release date": "Mar 7, 2022",
    "About the game": "⠀⠀⠀⠀⠀⠀⠀⠀⠀ From the industry veterans who brought you Company of Heroes and Age of Empires: Castle Siege, comes Phobies, Smoking Gun Interactive's new terrifying collectible card game! Summon your worst fears and use their abilities to seize control of perilous environments. Wield a masterful strategy and outsmart all players who dare challenge you in an asynchronous battle and arena. Collect over 120 powerful and mischievous Phobies inspired by your most irrational fears. Evolve your strategies as you unlock new fears and abilities. Level up your Phobies to give them an added edge in battle. Watch your fears come to life in the whimsical world inspired by your subconscious. Traverse hazardous tiles and use the environment to stem the tide in your favor. Unlock weekly and seasonal rewards while ascending the Mount Ego leaderboards. Play solo challenge modes, battle your friends, or faceoff against millions of players worldwide! Join the community of fellow Phobie enthusiasts, eager to unlock their deepest fears. Are you brave enough to face your fears? FEATURES: COLLECT FEARSOME PHOBIES: Overpower your opponents by unlocking and upgrading your favorite Phobies. With an army of terrifying Phobies at your beck and call you are sure to win any battle. MASTER TACTICAL GAMEPLAY: Plan your strategy around hex-based environments. Utilize tactical positioning across spine-chilling terrains to gain an upper hand on your opponents. REFINE YOUR STRATEGY: Utilize the practice mode to test out and further refine your strategies before using them on your unsuspecting victims. TEST YOUR WITS IN CHALLENGE MODE: In need of a quick brainteaser? Try out the PvE challenge mode containing various puzzles and objectives to sharpen your wits. PLAY WITH YOUR FRENEMIES: Add and duel your friends in asynchronous PvP battles. That is one way to put them in their place! EXPERIENCE ASYNCHRONOUS BATTLE: Take your horror show to the masses by engaging in PvP battles with players worldwide. The turn-based mechanics of asynchronous battles allow players to play multiple matches simultaneously. Enjoy the never-ending terror and fun. COMPETE IN ARENA MODE: Feeling a bit antsy with competitive tendencies? Then experience the real-time mayhem of the arena mode. Assert dominance through strategic superiority in real-time battle. Why wait when you can win? PLAY WHEREVER YOU WANT: Take your worst fears with you wherever you go through cross-platform capabilities. Whether you prefer to dominate via PC or on the go through your mobile: play the game your way. JOIN OUR DISCORD SERVER ⠀⠀⠀        ⠀⠀⠀        Meet other Phobies Wranglers in our Discord Server ! You'll get to share your tips and tricks, learn new strategies from other players, get to ask our devs questions, share your feedback and suggestions with us, or get support from our amazing moderators and SGI staff!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1254130/header.jpg?t=1656438998",
    "Price": 0.0,
    "Developers": "Smoking Gun Interactive Inc.",
    "Publishers": "Smoking Gun Interactive Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_4d23126df057372ca84aedac92739e808d5de359.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_6a4c811a6c0c688d237beb60d39605db5813d64c.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_d7fdc2f5926d1ce5401cc4e51e31ba0652411bd6.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_94eae5ac48030d738e2e8aaf621a0eb95a736eff.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_8aced0567988cc6e402d9a54574958820c8f84d3.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_e89958a65c2be82d6da30ad1526713fe9ea85701.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_a13a613dba5008c9bcdbaa16f6dbc9175a6c0d2f.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_885678686c69bbf95a235d2e3d6a4ba88c19f18e.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_84f012b04f2135cdae7d130db4bd6eac59f377f9.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_455314209157e09ec86dadb5af152fcb0959037c.1920x1080.jpg?t=1656438998,https://cdn.akamai.steamstatic.com/steam/apps/1254130/ss_6079f958094d827151daf28a7efa9b35106a9630.1920x1080.jpg?t=1656438998",
    "Slug": "phobies",
    "Meta Title": "Phobies: Mar 7, 2022, Smoking Gun Interactive Inc. and Fu...",
    "Meta Description": "Looking for information on Phobies? Check out the release date (Mar 7, 2022), developer insights from Smoking Gun Interactive Inc., and a complete game ...",
    "Alt Text Image": "Official header image for Phobies game - Steam 1254130",
    "Canonical URL": "https://gusku.site/game/phobies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Phobies\", \"description\": \"Looking for information on Phobies? Check out the release date (Mar 7, 2022), developer insights from Smoking Gun Interactive Inc., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Smoking Gun Interactive Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Smoking Gun Interactive Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1254130/header.jpg?t=1656438998\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}