{
    "AppID": 1398470,
    "Name": "Pop up Blaster",
    "Release date": "Sep 5, 2020",
    "About the game": "Pop up Blaster is a game that allows you to shoot popups with guns, and has various options that allow you to change everything from how hard the game is, to how the game looks and sounds. In total, there are seven different settings, if you include difficulty. ----- How to play ----- ----- starting a round ----- With the cursor, left click the power button on the in game computer. To instantly end a round, you can left click on the power button again, if your score is at least higher than the lowest high score, it will be saved When you start a round, you will only have access to a hand gun, however as you gain points from shooting pop ups, you will be able to upgrade it to an auto hand gun, and then to a machine gun. You can also unlock a shot gun as well as explosives, the explosives will destroy all the pop ups on the screen at the same time, with the upgrade being a faster reload time. ----- Attacking ----- When you move the cursor far enough into the in game screen, your current weapon will appear, left click anywhere in the screen to use your current weapon. Each weapon has a different rate that it can constantly fire at, with the slowest being the shot gun, and the fastest being the machine gun. You can hold down the left mouse button to fire continuously, or press and release it to fire a single shot. The grenade and dynamite work differently than the other weapons, both have a delay between the time that you use the weapon, and the time that the weapon detonates. You can switch to another weapon and shoot popups while they are flying through the air. ----- reloading ----- For the exception of the grenade and dynamite, each weapon has a maximum amount of ammo, when they run out you have to reload them. When they run out of ammo, their icon will change to 'reload weapon', and 'reload weapon' will appear above the in game screen. Left click on the 'reload weapon' icon and a reload animation will start. When the animation completes, the weapon will be reloaded. You can switch your current weapon while you wait for the weapon to reload. When the weapon is reloaded you can switch back to it, or use your current weapon until it runs out of ammo, and then reload it and switch back. You can not switch to a weapon that needs to be reloaded, nor can you upgrade the weapon, even if you have enough points to do so. The grenade and dynamite are both one shot weapons and have to be reloaded every time that you use them. (The reason being that if you throw the grenade you are holding, you are therefore, no longer holding a grenade) ----- unlocking and upgrading ----- When the round starts, you will only have access to a hand gun, to unlock the other weapons, click the unlock weapon button that is next to their icon. To upgrade a weapon, click the upgrade weapon button that is next to its icon. For the exception of the grenade and dynamite, when you unlock, or upgrade a weapon, you will automatically switch to that weapon. When a weapon can no longer be upgraded, the upgrade button for that weapon will be crossed out. When the cursor is hovering over an upgrade button, it will become highlighted to show that it can be activated. ----- switching weapons ----- The weapon icons as well as the unlock and upgrade buttons are to the right of the in game screen. You can switch to a weapon as long as it is unlocked, and does not need to be reloaded. To switch to a weapon, left click on its icon with the cursor. When the cursor is hovering over a weapon icon, it will become highlighted to show that it can be selected. ----- options and pause menu ----- To access the pause menu, click on the pause button on the desk below the in game screen. The pause screen has three main tabs, 'information and credits', 'sound and visualization', and 'Technician log' to switch between the tabs, click on them with the cursor. to return to the game, click on the 'click to return' button. All the buttons in the pause menu will highlight when the curser hovers over them, and are activated by left clicking, for the exception of the volume and cursor option, which can also be changed by scrolling the mouse wheel. All of the game options are found in the 'sound and visualization' tab of the pause menu, for the exception of the difficulty setting, which is found in the 'information and credits tab'. All of the options can be saved and the game will load them from one session to the next. All of the options are in the order that follows: Gun visual - (realistic or cartoonish) Sounds - (realistic or cartoonish) Weapon volume - (0 - 5) which is scaled so that 5 Represents 100% Target - (visible or hidden) Attack radius - (visible or hidden) Mouse style - (1 - 6) the visual style of the cursor) ----- Round Over ----- The current round will end if the health of the CPU falls to 0, If the score is at least higher than the lowest score on the high score table, it will be saved. The High score table is available in the pause menu, and the game does not instantly take you there so you an quickly start the next round if you want to. The high scores are saved every time a round ends, if you want, you can reset all the high scores to 0. I miss the Game Maker 7 high score table feature... oh well, at least I go to use it when I could.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1398470/header.jpg?t=1601080174",
    "Price": 5.99,
    "Developers": "Jason Dale Swisher",
    "Publishers": "Jason Dale Swisher",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_afcafe946abc577d1bc897158bc0d71c92dd7e2e.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_c7c103ff7c1478386f0095fe993862ba98cf44ea.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_402eab5252fd3fbe93a48577875e440a300b749c.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_70157c6bec0a9f2fc552b93fea84ac428fb8adae.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_d95a2f96a4423f04d027f32927f4fe8abae0faaa.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_a6e1c686b32e0b8df834f182eadf397c7f0c7ff2.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_607415e843adaecdbb68eb840ab238e88dd46fc3.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_ff49abd5fc9e33516b91c35510a87b98aa3fb7de.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_695a387053d4b48b50bc9550b5938848ea1ad249.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_05f41497d0e700f884a992e26a5a3fe34c256cb0.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_91b3ca61cca15bfeea37f4757d741aee787e2762.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_35cbbafa253ef160ac8881ec4ab734a5372648fd.1920x1080.jpg?t=1601080174,https://cdn.akamai.steamstatic.com/steam/apps/1398470/ss_026898e733b8d3380d3b759e571dea577b0ea51c.1920x1080.jpg?t=1601080174",
    "Slug": "pop-up-blaster",
    "Meta Title": "Pop up Blaster: Sep 5, 2020, Jason Dale Swisher and Full ...",
    "Meta Description": "Looking for information on Pop up Blaster? Check out the release date (Sep 5, 2020), developer insights from Jason Dale Swisher, and a complete game sum...",
    "Alt Text Image": "Official header image for Pop up Blaster game - Steam 1398470",
    "Canonical URL": "https://gusku.site/game/pop-up-blaster",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pop up Blaster\", \"description\": \"Looking for information on Pop up Blaster? Check out the release date (Sep 5, 2020), developer insights from Jason Dale Swisher, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jason Dale Swisher\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jason Dale Swisher\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1398470/header.jpg?t=1601080174\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}