{
    "AppID": 810500,
    "Name": "PowerBeatsVR - VR Fitness",
    "Release date": "Nov 18, 2020",
    "About the game": "The game requires a playspace of at least 6'6''x4'11'' (2x1.5m). Awards Winner of the 'DIVR Award 2019 - Special Category Sports' 3x Finalist in the 'VR Fitness Insider Awards 2019' 2x Finalist in the 'VR Fitness Insider Awards 2020' in the categories: Best VR Fitness Game of the Year Best Cardio VR Fitness Game of the Year PowerBeatsVR is an action-packed, rhythm-based VR fitness game that trains your entire body like no other. Move with the beat as you punch, duck, and dodge your way through challenging obstacle courses in several virtual arenas. Shatter incoming boulders into pieces and see those calories burn with ease. The more you move and the stronger you hit, the higher your score. Have fun while training your stamina, strength, and reflexes. Experience intense VR workouts on higher levels of difficulty. Or choose the easier modes, and just enjoy smashing stuff to the beat of a diverse and energetic soundtrack. In any case, there is a leaderboard waiting for you. Want to use your own music? Just do it. Let the game auto-generate everything the way you like it or get creative and build workouts for your custom songs with the intelligent editor. Are you ready? Huge Choice of Workouts Over 50 Professionally Designed Workouts: Everything perfectly fits the underlying rhythm of two official music packs with 24 songs and a wide variety of music genres. Generator for Your Own Music: Play with any music you like and how you like it (MP3, OGG, WAV, and FLAC). Want less squatting and more dodging? Just change the settings. 3 Difficulties: No matter your skill or fitness level, there is a suitable challenge. Work your way up or directly launch the Expert mode and handle an insane amount of targets and obstacles. Customizable Experience Playlists: Create your own playlists for extended workouts. Use the endurance mode to play without any rest between songs or try the endless mode until exhaustion. Easy-To-Use &amp; Intelligent Editor: Get creative and create entire challenges from scratch within VR in just a few minutes or modify auto-generated workouts to suit your needs. Custom Environments: Enjoy countless additional workout surroundings with the 'Custom Environments' DLC . It comes with 8 beautiful built-in skybox environments and the option to load any 360° panorama image – even from Google Street View. Fitness Check Leaderboards: Compete with others and fight your way to the top. Calorie Tracking &amp; Fitness Metrics: Check your training duration, squats, and calories you have burnt during your VR gym time. Receive real-time metrics and performance summaries that push you further. Heart Rate Monitoring Support: See your heart rate in-game with our unique integration of ANT+ or Bluetooth HRMs . Fun 4 Unique Weapons: Start with your fists and unlock further weapons (hammer, shield, and powerfist) as you play. Avatar System: Showcase your performance with built-in avatars or LIV. Flexible For Any Player Height: The game adapts all workouts to your height – whether you are 3ft (1m) or 7.2ft (2.2m) tall, you will get the same effective workout as everyone else! Highly Adjustable: Having knee problems? Deactivate obstacles that are too demanding. Want to experience the maximum HIIT workout? Just play with the modifiers and increase speed, required range, strength, and precision. One More Note From the Developers We want to make PowerBeatsVR the most enjoyable and effective VR fitness game available. Thus, we continuously improve the game and add new content and features based on your feedback. So, feel free to contact us if you have ideas, questions, or issues with the game. Also, let us know if you enjoyed the game in the review section below because that would make our day and help other players! Mixed Reality Support The game fully supports LIV and the regular SteamVR quadrant view for Mixed Reality. Arcades PowerBeatsVR is available via the Steam Arcade program, SpringboardVR, and SynthesisVR. See Our Players in Action And some more",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/810500/header.jpg?t=1658697701",
    "Price": 12.99,
    "Developers": "Five Mind Creations",
    "Publishers": "Five Mind Creations",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_5fa44bfb93cf26ad1834732f56291469fc82d278.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_166b8ce922d9cb157be085276b1506a39e89ec83.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_2f951d0d792ce8d0f458cb345c44e19085a51dd9.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_615ed417f702deb3061e6640dc2b5c330c4f804b.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_45e0c56e022038a4e9fba62708773f10aefedb86.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_dc4c4662696034cc352ac4d03f9267bf8c47d7ee.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_ea0b39ac6c43de7e3d5cef29d816b34dd0682942.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_0bdba231ab3ef91a92b5075fb50d3d0fe2662ed2.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_e53d0d9139fcbb6592d06bd6b4290d21bc741874.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_d31eb3074cdb2654a268a1e63b8b446afc5b34f8.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_a73258b011be893ee163f34b09c9fba2d91874c6.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_9f6e6d5bc9baef32785b0f6719d5d91e5d4999d7.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_2a9220090e84ea3658af697458218dbe7de708fd.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_6b251659db345b64f7893866417f18332710a90a.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_24298e7cefb13490ca0552b9f0221a492e8b69c0.1920x1080.jpg?t=1658697701,https://cdn.akamai.steamstatic.com/steam/apps/810500/ss_3c839bf42876e752409a77c69b4dfed916e7117a.1920x1080.jpg?t=1658697701",
    "Slug": "powerbeatsvr-vr-fitness",
    "Meta Title": "PowerBeatsVR - VR Fitness: Nov 18, 2020, Five Mind Creati...",
    "Meta Description": "Looking for information on PowerBeatsVR - VR Fitness? Check out the release date (Nov 18, 2020), developer insights from Five Mind Creations, and a comp...",
    "Alt Text Image": "Official header image for PowerBeatsVR - VR Fitness game - Steam 810500",
    "Canonical URL": "https://gusku.site/game/powerbeatsvr-vr-fitness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PowerBeatsVR - VR Fitness\", \"description\": \"Looking for information on PowerBeatsVR - VR Fitness? Check out the release date (Nov 18, 2020), developer insights from Five Mind Creations, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Five Mind Creations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Five Mind Creations\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/810500/header.jpg?t=1658697701\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}