{
    "AppID": 517270,
    "Name": "Pro Farm Manager",
    "Release date": "Nov 20, 2017",
    "About the game": "Create your farm from top to bottom ! Build, grow, manage and become a virtual competent and reknown farmer. Explore wild territories, create and develop a fantastic agricultural land. Each new game comes with its own unique features (landscaping, vegetation, rivers, and soil composition); you develop it according to your wants, needs and strategic goals. You choose where to place your buildings, build roads, locate your plots, and so on… Raise one or several animal species (several breeds per type) : Cow Pig Goat Sheep Poultry You job is to feed/water the animals, add litter, remove the manure, all for their happiness and well-being. And also to avoid disease, or worse, deaths. In return, they will give you milk, eggs, as well as meat when you’re selling them to the slaughterhouse. Thanks to genetics and reproduction, you can expand your herds and improve animal’s genes and quality. Create your plots , grow and harvest them to feed your animals. No animals? Not a problem, sell your production directly to the cooperative, or to another player (multiplayer mode). How about storing it and selling it later when the market prices are higher? A good harvest means planting with the right season, and using adequate farm equipments to work your land. You’ll also have to deal with weather conditions (sunshine, rainfall, various temperatures…), and to be reactive if your crops become diseased. Your success will depend on you’re making the right decisions at the right time. Access a selection of more than 30 different types of equipment , with more than a 100 accurate 3D models, which you can customise (colours, accessories) to your preference. You choose the equipment according to your needs; if the investment is too heavy, you can always buy second-hand or buy with other players (using farm grouping). With this equipment, you’ll be able to work effectively on your plots of land, and grow your livestock. Select one, choose an action, and intuitively manage all your work in your virtual farm! Game mode : Single player : You play on your own, the world is not perpetual (time stops whenever you save and quit the game). You can fast forward time. In short : The combination of realistic environmental simulations and in-depth management of farming strategies. Life-like animations for various animals, farming equipment and the environment. The ability to develop a unique farm every time you play, choose to settle in many different regions in more than 5 countries. A personal playing space of more than 600 hectares to construct buildings, develop cultures, care for animals, and use farming equipment. Nearly 100 life-like 3D models of agricultural equipment. 5 animal species (cattle, pigs, goats, sheep, poultry) to produce eggs, milk and meat. 15 differents cultures to place on your customizable plots. A novel genetic system, each animal has its own characteristics (Health, Reproduction, Age, and Weight). Work in progress (not available in Early Access version): The final version of the game gives access to extra options with english version of the game , as well as Multiplayers mode. In the Multiplayers mode, you have access to : Play in a perpetual world (e.g., the world keeps existing, whether all players are connected or not). In that game mode, 1 day is 6 hours – real time (time runs a 4 times faster). In that way, a month in the game is 28 virtual days (7 days – real time): it starts on Monday (at 0:00 am) to end on Sunday (at midnight). Buying/selling farm equipment, livestock, goods among players (vs. computer) Buying farm equipment with others players (group purchasing) Challenge other players in genetic competitions with your top animals Exchange with other players through the mailbox",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/517270/header.jpg?t=1521540116",
    "Price": 19.99,
    "Developers": "Aslak Studio",
    "Publishers": "Expone",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_632610ee8435e612523e3d7bee2359ee53132956.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_31a3346f87109035b0df911ff2e72131caa2b36a.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_8f6d41c94ef25642b79ea1cb3d99e83fc52a29ae.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_a6678a6f8c6822aaf35e163d7b96345e7d1d2a8f.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_5e7d1eda72125482ad9ad34bd59710a79dd3bb0d.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_9ed5c1928f069e659cb52837d7cdc834e3fc40c3.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_2dfdbb54f187352a16d810678af03f0d63fb4115.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_c4eaab96722b604c02b3215e4106b9ffd76825c1.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_16ac8f0e95928096f77711eea0b84aa9b8c41c7c.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_1f51dbcdcba43a04366ba7d0c857a1cdcf28e671.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_e8e8e2890d7cdee9b6b9fce05b8a53726e035791.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_dea3e89c4dfb285c7023c4650fb85027698e7724.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_41b4a3722831338fdfd02037badfe8eb7a949ec5.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_0822d574f95847ce34daca88bbbd0ce89e2a607f.1920x1080.jpg?t=1521540116,https://cdn.akamai.steamstatic.com/steam/apps/517270/ss_581cbe633dae7f2a26d28effd9b32dc70888b210.1920x1080.jpg?t=1521540116",
    "Slug": "pro-farm-manager",
    "Meta Title": "Pro Farm Manager: Nov 20, 2017, Aslak Studio and Full Ove...",
    "Meta Description": "Looking for information on Pro Farm Manager? Check out the release date (Nov 20, 2017), developer insights from Aslak Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Pro Farm Manager game - Steam 517270",
    "Canonical URL": "https://gusku.site/game/pro-farm-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pro Farm Manager\", \"description\": \"Looking for information on Pro Farm Manager? Check out the release date (Nov 20, 2017), developer insights from Aslak Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aslak Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Expone\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/517270/header.jpg?t=1521540116\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}