{
    "AppID": 1961390,
    "Name": "Sakura Succubus 6",
    "Release date": "Jul 11, 2022",
    "About the game": "This Visual Novel picks up where Sakura Sucubus 5 left off, Ogasawara Hiroki finds himself in Astoria: a small European country with a chilly climate, where it often snows. Hiroki went to Astoria as Hifumi’s plus one, after the famous actress and reigning karuta queen was invited to stay in the royal palace at Princess Stephania’s behest. Stephania originally intended to challenge Hifumi to another karuta match, after previously losing to her – but, upon meeting Hiroki, Stephania soon falls for him. Hiroki is already one of the most envied men in Japan (if not, the world), owing to the recently publicized news of his relationship with Yamamoto Hifumi, not to mention his ongoing affairs with the famous businesswoman Wakatsuki Marina, and the tennis star Hazel Williams, but now he finds himself presented with yet another adoring woman. Hiroki used to be average, but now his life is anything but! Will Hiroki’s relationship with Stephania work out? Will the pair of them be able to stay together, even when Hiroki returns to Japan – and, perhaps more worryingly, will Hiroki be able to withstand the hatred of his co-workers? It’s hard being so popular! Hifumi is an actress who has appeared in a slew of popular movies over the last decade. She tends to appear in a lot of period dramas, and most of her roles are of demure, refined women. In her private life, Hifumi is fairly traditional herself, what with her fondness for traditional Japanese clothes and for traditional Japanese sports, but she isn’t quite as reserved as people tend to think. Hifumi is, in fact, a succubus, and she’s not shy about making the moves on Hiroki – or about letting him know just how much she adores him. Successful businesswoman by day, succubus by night, Marina is one of the oldest members of Hiroki’s harem. Fabulously wealthy, but also level-headed, it often falls upon Marina to keep the younger succubi in line: Ayu and Cosmos in particular. Marina likes to take charge, both in the boardroom and the bedroom, but she has a gentle side, too. She’s more compassionate than she looks, and she loves Hiroki and her silly succubus sisters a good deal – even if they annoy her. Hazel is a tennis star whose quick serves and inexhaustible energy have taken the sporting world by storm. There’s nothing Hazel loves more than the thrill of facing off against a tough opponent – apart, perhaps, from seducing pretty girls (receptionists with flower-themed names in particular). Hazel is so perpetually cheerful it borders on aggressive, and she talks so much, it can be hard to get a word in edgeways around her. Still, she’s a lot of fun to be with, and it’s easy to relax and unwind around her – when she’s not trying to force people to go jogging at 05:00 AM. Stephania is the young princess of Astoria. Born into a life of luxury, Stephania nonetheless grew up lonely, as her over-protective parents rarely allowed her to leave the palace. Stephania is polite and softly-spoken, but she has a passionate side which comes bursting out whenever she plays karuta. She might seem sweet and innocent, but she also has something of a mischievous streak, and, as a child, one of her dearest wishes was to run away from home and join the circus. Now, however, she dreams about being Hiroki’s girlfriend. Elizabeth is Stephania’s maid, who is intensely devoted to her young mistress. She’s incredibly talented, and can cook, clean, sew, and – in short – do absolutely anything that’s expected of her. She can even give kissing lessons, should the need arise. Elizabeth is aware that Stephania has feelings for Hiroki, and she seems determined to pair the two of them together. Selfless to a fault, she only wants to see Stephania smile – but how does Elizabeth feel about Hiroki herself?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1961390/header.jpg?t=1657559280",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_1cc8484a0fec4f1de2c9791a4cc1791d5323a220.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_4167a3ce682821923685620b4eb427f88d431c29.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_6f9d8afba1d8f8f7899db0e30f3feb505a93aa42.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_afb9c3be6e3c029f5f17cbcee9ad5ae0dab0c92d.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_17658ec4e737075120d45e57dfafc8033c46e296.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_e466e98d09c3ea78f80cc87e33682772fe22f1dc.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_315f1af3b6f2f6f89f3afb3d36e689be4bcf920c.1920x1080.jpg?t=1657559280,https://cdn.akamai.steamstatic.com/steam/apps/1961390/ss_66efb650285cebc29bc90195dd10a567b25d07b3.1920x1080.jpg?t=1657559280",
    "Slug": "sakura-succubus-6",
    "Meta Title": "Sakura Succubus 6: Jul 11, 2022, Winged Cloud and Full Ov...",
    "Meta Description": "Looking for information on Sakura Succubus 6? Check out the release date (Jul 11, 2022), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Succubus 6 game - Steam 1961390",
    "Canonical URL": "https://gusku.site/game/sakura-succubus-6",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Succubus 6\", \"description\": \"Looking for information on Sakura Succubus 6? Check out the release date (Jul 11, 2022), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1961390/header.jpg?t=1657559280\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}