{
    "AppID": 1987490,
    "Name": "Save All Monsters!",
    "Release date": "May 26, 2022",
    "About the game": "The game Save All Monsters! is a puzzle game where you have to place all the monsters in safe squares before the time ends! Analyze the chess-like attack patterns of weapons to avoid danger. Use resistant monsters to protect normal monsters from ranged attacks! Keep social distancing with bomb monsters! Discover and save all the monsters! This game is a mixture of elements from traditional games like chess or minesweeper, with the fast-paced strategical thinking imposed by the time limit, along with managing an inventory of characters with different abilities When playing a level, analyze the weapons (and their influence area), the free squares, and the monsters in your inventory. To beat a level, all monsters need to be safely placed in the level before the time ends. If any monster is defeated or is not placed when time ends, you lose. While normal monsters can't stand a single hit, spiky monsters can resist as many attacks as spikes they have. Use them to protect other monsters from attacks that cover multiple squares. As you advance in the game you will unlock additional types of monsters, such as the bomb monster, whose blast can neutralize anything nearby, including monsters! A safer alternative to disable nearby weapons is the inhibitor monster. Also be careful with thief monsters, since they remove the special abilities of monsters nearby! The game includes 3 worlds with 8 levels each, with increasing difficulty and size. Each level has multiple grid rotations to make it more replayable and emplace recurring players to keep thinking logically instead of memorizing key spots. You will start avoiding boxing gloves, to later face the threat of flamethrowers, beam turrets and electric weapons! Development story The gameplay concept of Save All Monsters! (placing characters in a grid with weapons that can attack them before the time ends, with the presence of multiple character types like resistant ones) dates back to 2014, and was conceived by the author of this game, Albert Espín. He started implementing a game based on this concept but eventually moved to another project. In 2016 he proposed this idea to develop a small 2D Android game (at that time though, the characters were robots, not monsters, with simpler 2D graphics) at university. Albert and other students made that robots game, which was praised by early testers due to its engaging gameplay, and obtained the maximum score of the course. Nevertheless, it was never released for Android, although in 2017 Pau Sanchez made a web version of it. In 2021, Albert decided to create a new game based on the original game mechanics conceived in 2014, but this time using 3D graphics and Unreal Engine, instead of Android-specific tools, and monsters instead of robots. The resulting game is Save All Monsters! While Albert programmed and designed this game alone, some ideas are based on Pau's web version of the robots game (such as a character ability that insipired the thief ability, or the usage of different level grid rotations). Thanks to Pau's consent to the usage of those ideas here, the current game was made more engaging. Enjoy playing the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1987490/header.jpg?t=1653585866",
    "Price": 4.99,
    "Developers": "Albert Espín",
    "Publishers": "Albert Espín",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1987490/ss_a29a03a41e4fada4d1d615c7fd0fc1106ff63400.1920x1080.jpg?t=1653585866,https://cdn.akamai.steamstatic.com/steam/apps/1987490/ss_5a31b8a812f8345484ed3b86f7f036f75722c4f8.1920x1080.jpg?t=1653585866,https://cdn.akamai.steamstatic.com/steam/apps/1987490/ss_d0081047e04d78661e52fc36e39bd526c7214377.1920x1080.jpg?t=1653585866,https://cdn.akamai.steamstatic.com/steam/apps/1987490/ss_8550cdf4aee20adaa0ece1c2dec136d48421a02d.1920x1080.jpg?t=1653585866,https://cdn.akamai.steamstatic.com/steam/apps/1987490/ss_5d081ae25633cac73944a3f7d233699c289c1fcd.1920x1080.jpg?t=1653585866",
    "Slug": "save-all-monsters",
    "Meta Title": "Save All Monsters!: May 26, 2022, Albert Espín and Full O...",
    "Meta Description": "Looking for information on Save All Monsters!? Check out the release date (May 26, 2022), developer insights from Albert Espín, and a complete game summ...",
    "Alt Text Image": "Official header image for Save All Monsters! game - Steam 1987490",
    "Canonical URL": "https://gusku.site/game/save-all-monsters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Save All Monsters!\", \"description\": \"Looking for information on Save All Monsters!? Check out the release date (May 26, 2022), developer insights from Albert Esp\\u00edn, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Albert Esp\\u00edn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Albert Esp\\u00edn\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1987490/header.jpg?t=1653585866\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}