{
    "AppID": 757730,
    "Name": "Shadowcrawl: The Dark Pilgrimage",
    "Release date": "Aug 8, 2018",
    "About the game": "Every night you are haunted by visions of your death in ancient ruins to hordes of nightmare creatures . The NEXUS, a Hyper-Dimensional Holy Ruin , barrages Dreamers with such visions for years until the nightmares drive them into a mad frenzy . Seeking to avoid this fate and having learned of these stories, you've hunted down an entrance to the ruins; a rift into the back-stage of reality from which there is no return . However you've also learned of another story. It is said that from The NEXUS one can access Transcendental Planes of Reality, and that a pilgrimage to the Gods would grant you the ancient secrets of these ruins. It feels like like you've stood here among the ruins before, all those battles in your dreams... preparing you for the real challenge ahead. The time is now to steel yourself and ENTER THE NEXUS! Your Experience Points and Skills are not the only things that survive beyond death in Shadowcrawl. Elements of your game world can also be changed in permanent ways that will persist between playthroughs, and some of them even between save files! Completing quests permanently adds new weapons, armor, and enemies to the game . Unleashing secret mini-bosses and allowing increasingly powerful loot to appear in Gold Chests. Some quests even replace entire groups of enemies with stronger overpowered ones for the ultimate difficulty spike. Aid Miya the Blood Knight in exterminating the Goblins and you will only succeed in unleashing their true form as all Goblins in your game world are forever replaced by the mighty Orcs! This can be done with every enemy set in the game. Shadowcrawl is not your standard Roguelike, with quests, cults, factions, multiple endings, unlockable enemies, hidden game modes, secret levels &amp; more! We've taken the classic 80's 'Free-Turn' roguelike formula and updated it with modern game design lessons to add layers of depth as well as shift the gameplay focus towards player skill. Because of this, Shadowcrawl is less about luck or collecting loot than it is about strategy. As you accumulate perks and abilities your character will take on traits that let them adapt more effectively to different features of the maze generator. Forcing you at all times to use spatial awareness of your environment so you can manage the massive swarms of enemies that hunt you in the NEXUS and overcome impossible odds. STEALTH Some characters even have the ability to move through the shadows carefully in order to avoid detection. In low to minimal lighting conditions the Shadowmeld Perk makes players much harder to detect and even undetectable if standing quietly in total darkness. Combine with the Assassin Perk to reap devastating attack bonuses from stealth attacks, or the Maze-Master Perk to keep enemies on their toes. Shadowcrawl takes place in a dynamic world that is driven by Dark Gods and Occult Forces, all of which can be tampered with. Should a player find and kill the Goddess that governs the Health mechanic, then all characters (enemy and player alike) across all save files (even new characters) will be forever turned into living piles of undead meat! Thrust into a new health based economy they must steal meat from others while protecting their own to survive. LUNAR CALENDAR This is just one of the Gods and corresponding Forces in Shadowcrawl. That being said Shadowcrawl also has a functioning Lunar Calendar that detects the current actual phases of the moon! During periods of high lunar energy various in-game characters will attempt to harness this power for their own means. In the best cases this causes in-game events to occur, however some enemies will attempt to enact dangerous, game altering rituals that make Shadowcrawl actually risky to play on nights of high lunar energy! PAGAN WHEEL OF THE YEAR Shadowcrawl also celebrates the entire yearly Pagan calendar with special events running every 2-4 weeks. These events reveal hidden features of the game and add special enemies, quests, cults and much more as the balance of power between the Gods ebbs and flows. You can even alter the course of the Wheel by tampering with the natural forces. CULTS In Shadowcrawl, various Gods and other powerful entities can be worshipped by the player for massive bonuses. Join cults to gain new perks and powers as well as to access new faction specific quests, enemies &amp; loot. You can even worship some beings in secret without violating existing pacts, if you don't get caught. CORRUPTION Betraying the game-world mechanics can release terrifying secret enemies into your game. Things like killing the Omnipotent, collapsing dimensions in on themselves, or just generally warping space-time will unleash the deadly 'Glitch' enemies into your game. Unlike normal enemies, the 'Glitches' can jump between your save files and show up in any universe for any character. Worshipping powerful Glitches can even invoke the “Age of Glitches” which affects all save files everywhere and thrusts you into a twisted world of glitched and overpowered enemies. The “Glitches” can potentially be stopped however,. Killing 'Glitches' you have freed will kill them for good, until you unleash some more. If you have freed too many however you might have to seek the aid of a God who can fight the Corruption.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/757730/header.jpg?t=1602264075",
    "Price": 5.99,
    "Developers": "Wicked Cake Games",
    "Publishers": "Wicked Cake Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_7c25ff4ae887bc0bb867ec205d39bc5bb740ea13.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_3f4367ab63f596354ec2d4a10bc24d6a094c4094.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_004611c89e6eb5df557f521a752223c884e9b8bf.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_f498f3ba097d7181b4877d9aa8a4961481e8af00.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_0df0d84f76dfdd74dc0ecfebda4c778702fc9a91.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_9e31f0f3ba45535446d4aa1207c17125faa98c2b.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_c81312bc671a833fdd333f7ddb0a84ce423d6413.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_e3564fdc6bd37fa675ee4a54144c704c9aff949b.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_e42673b70bbce9a60f3885a7700dfd9c5bce8299.1920x1080.jpg?t=1602264075,https://cdn.akamai.steamstatic.com/steam/apps/757730/ss_6c849a2507ac634f22110387ae2e4d2bbb437058.1920x1080.jpg?t=1602264075",
    "Slug": "shadowcrawl-the-dark-pilgrimage",
    "Meta Title": "Shadowcrawl: The Dark Pilgrimage: Aug 8, 2018, Wicked Cak...",
    "Meta Description": "Looking for information on Shadowcrawl: The Dark Pilgrimage? Check out the release date (Aug 8, 2018), developer insights from Wicked Cake Games, and a ...",
    "Alt Text Image": "Official header image for Shadowcrawl: The Dark Pilgrimage game - Steam 757730",
    "Canonical URL": "https://gusku.site/game/shadowcrawl-the-dark-pilgrimage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadowcrawl: The Dark Pilgrimage\", \"description\": \"Looking for information on Shadowcrawl: The Dark Pilgrimage? Check out the release date (Aug 8, 2018), developer insights from Wicked Cake Games, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wicked Cake Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wicked Cake Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/757730/header.jpg?t=1602264075\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}