{
    "AppID": 603880,
    "Name": "Sounds of Her Love",
    "Release date": "Mar 9, 2017",
    "About the game": "Story In the midst of their hearts, something is blossoming between two students. Both of whom go about their daily lives at an international school in Tokyo. Just what is flowering? Of course, it's love. Starting your new life after transferring into an international school, you find yourself dismayed when it turns out to be the same as any other. Except for one thing... or person, rather. As your newly founded relationship increasingly tightens with the girl you just met, find out what there is to learn about each other as your lives intertwine with one another, discovering things about her stashed away behind a veil of timidity. Characters Ceridwen Erwood (CV: Amber Barile) Ceri, a student of the Welsh International School of Japan (WISJ) is a warm-hearted girl, prone to being found immersed in the pages of a novel or the strings of a classical celtic harp. She has a desire to study literature, though she had been known to have had a large period of time away from school due to an illness. As stated by her. Of Welsh origin herself, Ceri's a lot more readable than her language. Or so it might seem. Timid and docile on the outside, nobody can really tell what surprises she might have in store. As you get to know her however, the truth about her becomes much more clear to you. Learn about her past, be with her in the present, and join her in the future. That is, if she opens up to you. She's an extremely shy person, so getting her to open up isn't going to be easy. Protagonist (Player Named) You 'play' as a half Japanese, half English transfer to the WISJ. His second week at an international school has just started. Many students seem to be pompous in his eyes. It costs a lot of money to attend, after all. Within his first week, he has managed to make a grand total of zero friends. Socialising isn't easy, at least that's what he thinks. Unlike his father, a well-regarded owner of a publishing company, he wastes his time daily doing nothing productive. Things change however, when he meets 'someone' who piques his interest. Features 1920 x 1080 resolution. Cinematic CGs. 3 Endings Roughly 40,000 words. Rating: 13+ Mild use of language and provocative content. Team Story, Programming and GUI: ds-sans Backgrounds Art: Kimagure After, Mugenjohncel Character Sprites: Jun Project CGs: Joko JMC/jmc5221, Ezekuro Ceri CV: Amber Barile Frequent updates on the project can be found on twitter @dssansVN",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/603880/header.jpg?t=1626372426",
    "Price": 0.0,
    "Developers": "ds-sans",
    "Publishers": "ds-sans",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/603880/ss_f992568e867b2a28a0bc3d1d5f143f4997356880.1920x1080.jpg?t=1626372426,https://cdn.akamai.steamstatic.com/steam/apps/603880/ss_8372db8c29f16cae154c2bd0283afb6aedebc3cf.1920x1080.jpg?t=1626372426,https://cdn.akamai.steamstatic.com/steam/apps/603880/ss_62511b8a090bc2a4eac6705f08d0f7d5520a573e.1920x1080.jpg?t=1626372426,https://cdn.akamai.steamstatic.com/steam/apps/603880/ss_f099a59650555389c50090014c735aaf2a8e5610.1920x1080.jpg?t=1626372426,https://cdn.akamai.steamstatic.com/steam/apps/603880/ss_3af3e30cd70070871cbb227371cf405c0abf8a86.1920x1080.jpg?t=1626372426,https://cdn.akamai.steamstatic.com/steam/apps/603880/ss_93cac532022725e7829d677bb9344b13d481b152.1920x1080.jpg?t=1626372426",
    "Slug": "sounds-of-her-love",
    "Meta Title": "Sounds of Her Love: Mar 9, 2017, ds-sans and Full Overview",
    "Meta Description": "Looking for information on Sounds of Her Love? Check out the release date (Mar 9, 2017), developer insights from ds-sans, and a complete game summary.",
    "Alt Text Image": "Official header image for Sounds of Her Love game - Steam 603880",
    "Canonical URL": "https://gusku.site/game/sounds-of-her-love",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sounds of Her Love\", \"description\": \"Looking for information on Sounds of Her Love? Check out the release date (Mar 9, 2017), developer insights from ds-sans, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ds-sans\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ds-sans\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/603880/header.jpg?t=1626372426\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}