{
    "AppID": 269170,
    "Name": "Sports Bar VR",
    "Release date": "Jun 1, 2016",
    "About the game": "'Numerous comments exploded the web all talking the same thing, that this might be the biggest game released on VR by far…” VR Headsets 3D 'Though the HTC Vive is incredible early in its life-cycle, it already has its first “killer-app.” Hooked Gamer Bringing the virtual pub experience to your living room, SportsBar VR has a major social experience update cross-play now available in version 2.0. Featuring an awesome set of bar games and an incredible pool simulation including 8 Ball, 9 Ball, 3 Ball, &amp; Killer. SportsBar VR is the best place to digitally play and practice billiards, darts, or ramp ball anywhere! Join up with 8 of your friends to hangout and play some air hockey, throw a few rounds of darts or build an insane dominoes setup using books, chairs and bottles. Play with friends online or offline against the AI, earn and spend tickets to unlock a wide array of collectible hats, pool cues, table skin decals and fun objects! Whether you're a budding Ramp Ball champion, a serious pool player or just want take part in the time-honored pastime of throwing empty beer bottles against the wall, there's no wrong way to hangout in SportsBar VR. Key Features! Play Real Pool - Delight your senses with an immersive and accurate representation of the sport using motion control and real pool physics (be careful not to lean on the table, it's not really there). Choose from several variations of pool with popular rule sets and new game modes, or just hang out and hit some balls in free play. No Consequences - Enjoy the pleasure of throwing a bottle at your opponent or breaking one against the wall. Aggressively throw things around the bar without the worry of being arrested or thrown out! We won't make you clean-up in VR. A full bar of fun - Play improved air hockey, rampball, chess, checkers, shuffleboard, extra toys + minigames, and competitive challenge modes with and against your friends. Compete daily - Take on daily challenges, earn daily login bonuses, and earn tickets from the new ticket economy to spend on cool new pool cues, table skin decals, and collectable hats. Customize Your Game - Dress up your multiplayer avatar, customize your pool cue and controllers, decorate your table top and even the environment around you with tons of unlock-able goodies. Online and Offline Opponents - Play against the AI or with up to 8 players globally in online crossplay, including voice chat so you can really talk some smack! Kill Some Time - Play VR darts while waiting for your turn on the table, change the music or just explore the bar. Go Crazy - Grab, stack, and smash objects in the world. Create a tower of bottles, stack them high and launch a pool ball at it. Enjoy a Polished VR Experience - Years of VR / AR know how help provide a fun and comfortable VR space to hang out with your mates from the comfort of your own home. SportsBar VR is compatible with the HTC Vive and Oculus Rift w/ Touch Available for Arcades on SpringboardVR",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/269170/header.jpg?t=1525982190",
    "Price": 19.99,
    "Developers": "Cherry Pop Games,Perilous Orbit",
    "Publishers": "Perilous Orbit",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_2c1d878bfca36cacabf55c57dd3e60af6bbc9e01.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_cc707c4dc8638842d5c4924e13a86195536389ee.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_ec78587d076c61275789d9118b31c4d0b271ad4d.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_b98630247610dd0a32c37977990e02851a60107d.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_1e831e10a827e999699c471c693fc80eb17c6f6c.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_6f8efe246272f9fa858facbb95787d2c190c840b.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_b1a69858f94b614127ca3377327abfe0007dec2e.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_f1627ea9978f67b1b507efd349b7fb12b4a9750d.1920x1080.jpg?t=1525982190,https://cdn.akamai.steamstatic.com/steam/apps/269170/ss_befe3aecbce410c801538448f2509b540bb78eb6.1920x1080.jpg?t=1525982190",
    "Slug": "sports-bar-vr",
    "Meta Title": "Sports Bar VR: Jun 1, 2016, Cherry Pop Games,Perilous Orb...",
    "Meta Description": "Looking for information on Sports Bar VR? Check out the release date (Jun 1, 2016), developer insights from Cherry Pop Games,Perilous Orbit, and a compl...",
    "Alt Text Image": "Official header image for Sports Bar VR game - Steam 269170",
    "Canonical URL": "https://gusku.site/game/sports-bar-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sports Bar VR\", \"description\": \"Looking for information on Sports Bar VR? Check out the release date (Jun 1, 2016), developer insights from Cherry Pop Games,Perilous Orbit, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 1, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cherry Pop Games,Perilous Orbit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Perilous Orbit\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/269170/header.jpg?t=1525982190\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}