{
    "AppID": 833360,
    "Name": "Star Valor",
    "Release date": "Jul 13, 2018",
    "About the game": "Star Valor is a Space Action RPG game that puts you in control of your own spaceship and destiny. Explore a vast open-world procedurally generated galaxy as you make your way from being a nobody to becoming the biggest name in the galaxy. But in a universe where the last of humanity are ruled by the alien beings that very nearly made them extinct, wealth and power doesn’t come easy. In Star Valor, you are in full control of how you progress and what you ultimately end up becoming. Throughout your journey you will get to choose which factions you join changing who sees you as friend and foe. Alternatively, you can choose to be independent, and find your own way in the universe and your own allies and foes. Build your way up by earning credits through a variety of activities such as mining asteroids for valuable materials and minerals, completing various missions, trading goods, salvaging ship wrecks, crafting your own weapons, claiming bounties on pirates or even embark on a path of piracy yourself. What you do and how you make your fame and fortune is entirely your choice. Throughout your journey you gain experience allowing you to level up unlocking new options when starting a new game along with skill points for to you spend how you see fit, creating the play style that best suits you. Anything is possible and you are in complete control of how you play. Open World Exploration in a Procedurally Generated Galaxy – Each new game is completely different from the last with players getting to choose how big or small a galaxy is. Dynamic and Easy to Learn Combat System – Engage in head to head dogfights or massive fleet battles. Craft Your Own Weapons – Craft weapons using materials found from ship wrecks and mining asteroids and add your own modifiers to create unique weapons that cater to your needs. Over 160 Different Pieces of Ship Equipment – A vast selection of varying ship equipment to allow you to customize your ship how you see fit and give it the perfect loadout. Over 80 Different Ships – Over 80 different ships across various classes and roles to choose from, ranging from small Fighters to big Battleships. Choose New Character Abilities as You Level Up – As you level up, you gain skill points which can be allocated to the skills and skill trees of your choice to create the character of your play style. Hire a Crew to Improve your Ship and Gunners to Operate Turrets – As you grow and you gain a bigger ship you will need to hire a crew to help run it along with gunners to operate turrets. Make allies or Hire Mercenaries to Help You – Become a fleet commander and assign allies to your fleet to help you in combat or alternatively you can hire mercenaries to help out… for a price. Unlock Perks to Open New Play Styles – Complete specific tasks or make particular choices to unlock new perks granting different and various new play styles. Story and Procedural Quest System – Embark on a story that spans throughout the galaxy or take on a large variety of quests with a procedural quest system. Seven Factions to Interact With – Interact with seven different factions each with their own agendas. Allying yourself with one may make others your enemy. Wars Between Factions – Become apart of wars and conflicts between factions as they struggle for power. Arena Mode for Combat Focused Challenges – An additional arena mode for you to test your combat abilities as you face off against waves of enemies that grow in power as you progress.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/833360/header.jpg?t=1658341278",
    "Price": 14.99,
    "Developers": "Rafael Burgos",
    "Publishers": "Rafael Burgos",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_4412326436de60a6348609bac9d9ede4ee20455e.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_13cf46cf05c9c0ee3f7f94baf2f54c4be14c4b7b.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_60f33e67fd3fae5f0d454d702b06aca1a31c0daf.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_927c700c37090c78aa32017fa041eabbace3c2bb.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_8d810507bc1fe439943bf9d6ddf280964286a016.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_c01cfaea140482cbdb27a2823edbb71272d949b5.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_13112ebd6294a9c097dba1686080061536ac83fb.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_6f2de195633281e2209665d9f64362d3d83283c3.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_f11ef6ad79505c4f9e6178af204c58a873a0f9cc.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_4ef986a5d381b04edef653bf3abf124c7215753b.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_1c93edd9aa384772b3cfbeb214d78e7027fc7c7b.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_634be5abc416944fd3baff1a14ab1ff291ad9206.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_2ad67bd27da0c68d3885a07f982f5b8a1c1fa2a2.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_192ba8ea05d783b0f61a16f4d48b3a00a252c808.1920x1080.jpg?t=1658341278,https://cdn.akamai.steamstatic.com/steam/apps/833360/ss_2a2ed0d9fa45efbd55ca2d84c818780ddf406de0.1920x1080.jpg?t=1658341278",
    "Slug": "star-valor",
    "Meta Title": "Star Valor: Jul 13, 2018, Rafael Burgos and Full Overview",
    "Meta Description": "Looking for information on Star Valor? Check out the release date (Jul 13, 2018), developer insights from Rafael Burgos, and a complete game summary.",
    "Alt Text Image": "Official header image for Star Valor game - Steam 833360",
    "Canonical URL": "https://gusku.site/game/star-valor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Star Valor\", \"description\": \"Looking for information on Star Valor? Check out the release date (Jul 13, 2018), developer insights from Rafael Burgos, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rafael Burgos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rafael Burgos\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/833360/header.jpg?t=1658341278\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}