{
    "AppID": 1966130,
    "Name": "Strategic Command: American Civil War",
    "Release date": "Jul 14, 2022",
    "About the game": "For the first time in the series’ history, Strategic Command will be taking you to the 19th century battlefields of the American Civil War. In this turn-based strategy game, you will control the armies, research, production and diplomatic policy of either the Union or the Confederacy during a time of great innovation and dramatic battles. Your decisions will determine whether the United States leaves this conflict as one nation or two. What are your orders, Mr President? A BRAND NEW BATTLEFIELD Strategic Command: American Civil War comes with a massive 66,000 hex map, covering all of North America from Canada and New Mexico to the Caribbean at a 15km/9mi scale. This is the largest hex-based map ever offered by the Strategic Command series! COMMAND YOUR ARMIES With few professional soldiers ready to fight at the beginning of 1861, building an army will be just as important as ordering your men into battle. Thousands of volunteers are enlisting, and you will need to organise them into Brigades, Divisions and eventually Corps. Research will have to be undertaken to improve their weaponry and fighting skills. Once their training is complete, you will be able to choose from a variety of famous Generals to lead them, including Lee, Jackson, Grant, McClellan, Beauregard and Sherman. With the fate of entire armies hinging on single battles, the appointment of talented Generals may well be the difference between victory and defeat. RIVER WARFARE The great rivers of North America, including the Mississippi, Ohio and Cumberland, can now be navigated by all-new river warships, with inland ports offering the opportunity for rapid movement, and their waters bringing the danger of amphibious attack. THE AGE OF THE IRONCLAD The war on the high seas has also been expanded, with ships now divided into rivercraft, coastal and sea-going vessels, and wooden and ironclad construction. With the most diverse roster of warships ever offered by a Strategic Command game, your admirals will have more opportunities than ever before to achieve victory at sea. RECONNAISSANCE REWORKED The fog of war has never been more important in shaping your success on the battlefield, as the lack of radio communications means that cavalry will be essential to locating enemy armies and avoiding ambush. Infantry scout detachments, partisan rangers and armoured trains can also be trained to expand the recon capabilities of your armies, while Generals willing to use experimental technology will have the opportunity to use observation balloons, taking the war to the skies. EUROPEAN INTERVENTION Diplomatic action, battlefield success and decision events such as the sale of the Confederate Cotton Stockpile or the Emancipation Proclamation will determine whether the European Great Powers intervene in the Civil War. The UK, France and Spain can all be persuaded to support the Confederate cause, and their entry could greatly alter the war’s outcome. WAR IN MEXICO As the Civil War divides the United States, the French Emperor Napoleon III is engaged in another battle for control of Mexico. The front lines in America’s southern neighbour will be constantly changing, and if France should enter the war, players will be able to take up the flag of the Republic or the Empire as the Civil War grows into a conflict to determine the fate of all of North America! ...AND MUCH MORE! Using an enhanced version of the engine used by our WWI and WWII games, American Civil War also incorporates all of the much-loved features from previous titles in the series, ensuring that a great gaming experience awaits series veterans and new recruits alike! FEATURES 6 campaigns covering the Civil War from first shot to last: 1861 Blue and Gray 1861 Manassas to Appomattox 1862 Scott’s Great Snake 1862 Trent War (Alternate History: What if the UK recognized the Confederacy?) 1863 Lee Rides North 1864 Make Georgia Howl New unit types, including Balloons, Rangers, Monitors, River Gunboats and many more! New technologies, including Naval Engines, Ironclads, Skirmishers and the Field Telegraph. Riverine warfare is now possible, with waterways that can be navigated by 3 types of river vessel. Official mods have been included with the game, allowing players to choose between two brand new map styles and the 'classic' style used in our previous games. The game also comes with an Editor that will enable you to make your own campaigns or mods. Coastal and inland fortress defences play a much greater role in Civil War strategy, guarding many key ports and waterways. Built before the war, their locations are known to both sides. Deactivating Partisan scripts, historical event popups and the European intervention mechanic now requires only a single event to be disabled.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1966130/header.jpg?t=1657874772",
    "Price": 39.99,
    "Developers": "Fury Software",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_2ab18db4c04b8a526caa7313dcb60e1aebf79054.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_09485a5022d3072e452116102afd7f4c7244a8a0.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_5a7935fdee2b716170bb20bc196d14f4e7c5fbf0.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_5fe3cb075d88542b02be267892866d657e37cf79.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_40950009b16adaface9b066fea8bd1271ec46374.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_d2e68017b0ee4c6b4b646a507e88a0842efe76ad.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_11e78d2819f136d10f5b54642b4943a3791bc536.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_4cd6df2e36978bbf9b49afb4e49d14921e917a84.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_aa671179236d45505da3cefd54ddca75d0d15980.1920x1080.jpg?t=1657874772,https://cdn.akamai.steamstatic.com/steam/apps/1966130/ss_5e9a218ca4ff10dbd1f6b2f7df261c6c11873490.1920x1080.jpg?t=1657874772",
    "Slug": "strategic-command-american-civil-war",
    "Meta Title": "Strategic Command: American Civil War: Jul 14, 2022, Fury...",
    "Meta Description": "Looking for information on Strategic Command: American Civil War? Check out the release date (Jul 14, 2022), developer insights from Fury Software, and ...",
    "Alt Text Image": "Official header image for Strategic Command: American Civil War game - Steam 1966130",
    "Canonical URL": "https://gusku.site/game/strategic-command-american-civil-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strategic Command: American Civil War\", \"description\": \"Looking for information on Strategic Command: American Civil War? Check out the release date (Jul 14, 2022), developer insights from Fury Software, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fury Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1966130/header.jpg?t=1657874772\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}