{
    "AppID": 1152050,
    "Name": "Sword of the Slayer",
    "Release date": "Sep 12, 2019",
    "About the game": "Fight monsters and free the ancient city with your enchanted talking sword! You’re a common orphan scraping a living on the streets of Targas Adur—a city older than memory, full of dark corners and darker magics, ruled by a merciless Sorcerer King, Demorgon. While exploring one of those dark corners, you stumble upon...the sword, an ancient weapon of power. And it can talk, in a voice only you can hear. Sword of the Slayer is 185,000-word interactive fantasy novel by S. Andrew Swann, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. Dark creatures do as Demorgon bids, and his royal guard keeps order with an iron fist. All gods and temples are suppressed except for his own Dark Tabernacle. But with the re-emergence of the sword, Demorgon’s power may be waning. Evil monsters invade the city, and sections of Targas Adur have fallen to their influence. It’s up to you to slay them. You must train yourself in sword-fighting to protect the ones you love, as you battle the demons of Targas Adur, including the dread White Wyrm. Thrust into the role of monster-slayer, you find yourself the focus of decadent nobles who want to return to power, devoted monks who want to see the gods return to the city, and—most troubling—you now have the attention of the Sorcerer King himself. Will you become a foe of the monsters, a threat to Sorcerer King’s regime, or a hope for the forces trying to bring down his rule? Or will you give yourself over to the sword, losing control of your mind and body? Play as male, female, or non-binary; gay, straight, bi, or asexual Rise from the gutter to the highest level of power Support the gods, the nobles, or a rival sorcerer for the rule of the ancient city Bring back the gods or fight the Great White Wyrm when you enter the Dark Tabernacle Make allies in your quest to free the city Protect your childhood friend, and your swordsman trainer from capture and death Face monsters of all sorts, up to the Sorcerer King himself Save your place before a chapter and you can return to that point after the story’s end and try a different set of choices An enchanted sword. An ancient evil. A hero waits.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1152050/header.jpg?t=1568397962",
    "Price": 4.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1152050/ss_6e97cddd37ee570a7d80c3fdad4e4cc472e5b214.1920x1080.jpg?t=1568397962,https://cdn.akamai.steamstatic.com/steam/apps/1152050/ss_83824d49340abfa5f576c23438dfc69529de047e.1920x1080.jpg?t=1568397962,https://cdn.akamai.steamstatic.com/steam/apps/1152050/ss_5e26862374cde1844c52c936aac6db92033e6f52.1920x1080.jpg?t=1568397962,https://cdn.akamai.steamstatic.com/steam/apps/1152050/ss_faa16648b63c846960781eef472eefdc341e8f29.1920x1080.jpg?t=1568397962,https://cdn.akamai.steamstatic.com/steam/apps/1152050/ss_222b10f77d06e2c68894eb669e4e026383e91ecf.1920x1080.jpg?t=1568397962",
    "Slug": "sword-of-the-slayer",
    "Meta Title": "Sword of the Slayer: Sep 12, 2019, Choice of Games and Fu...",
    "Meta Description": "Looking for information on Sword of the Slayer? Check out the release date (Sep 12, 2019), developer insights from Choice of Games, and a complete game ...",
    "Alt Text Image": "Official header image for Sword of the Slayer game - Steam 1152050",
    "Canonical URL": "https://gusku.site/game/sword-of-the-slayer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sword of the Slayer\", \"description\": \"Looking for information on Sword of the Slayer? Check out the release date (Sep 12, 2019), developer insights from Choice of Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1152050/header.jpg?t=1568397962\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}