{
    "AppID": 597120,
    "Name": "The Filmmaker - A Text Adventure",
    "Release date": "Mar 7, 2017",
    "About the game": "Relive the days of classic gaming with The Filmmaker , a puzzle-filled text adventure that pays tribute to the classic, cheesy Hollywood B-Movie! About The Filmmaker combines the best elements of interactive fiction, visual novels, and gamebooks with a graphic user interface that emulates the look of early 1990s text adventures. It features beautiful artwork and cinematic music. In place of a text parser is a context-specific multiple choice menu. A compass allows you to travel from room to room, and separate inventory, map, journal, and character screens are available at the push of a button. It plays like an interactive novel. You make choices that determine what happens next in the story. But unlike in traditional gamebooks and visual novels, The Filmmaker also features more advanced adventure-based game mechanics, including locations to explore, items to interact with, characters to meet, and puzzles to solve. Story The Carson Stiles Gateway Theater was once the hotspot of town, featuring its own series of low-budget B-movies produced by renowned filmmaker Claude Ferucil. Unfortunately, the theater closed several months ago after a series of gruesome murders. This came as a huge disappointment to Brianna, a young B-movie buff who faithfully attended every new showing with her recently-passed father. Imagine Brianna’s surprise then, when she received a letter in the mail inviting her to the theater’s grand re-opening. Little did she realize, however, that she was in for a bit more than she bargained for... Features EXPLORE a haunted theater ENTER five distinct black-and-white films DISCOVER the terrifying link behind a series of gruesome murders HELP Brianna overcome the loss of her father SOLVE a multitude of challenging puzzles ENJOY over 400 pieces of original artwork and an hour-long soundtrack EXPERIENCE two different endings, depending on your actions in the game UNLOCK 25 achievements to view a special post-game bonus scene PLAY 6+ hours of content--a true “B-movie” experience! The Films You'll go inside five distinct black-and-white B-movie films, each of which features unique exploration, visuals, music, and puzzles! These include: ​A DETECTIVE STORY - A film noir tale about a down-on-his-luck detective THE COUNT - A horror story about a young maiden captured by an evil vampire THE FUZZIES - A cartoon about a small village of rabbit-like creatures ALIENS FROM MARS! - A sci-fi epic about a war with the Martians PRIMAL ATMOSFEAR - An action thriller about a new man-eating predator",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/597120/header.jpg?t=1581812075",
    "Price": 2.99,
    "Developers": "Storycentric Worlds",
    "Publishers": "Unimatrix Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/597120/ss_3247849a6ba38e4ece569dcb1e304895f996d242.1920x1080.jpg?t=1581812075,https://cdn.akamai.steamstatic.com/steam/apps/597120/ss_3bd61d656d2f0c4219eeae85a374128d8013958f.1920x1080.jpg?t=1581812075,https://cdn.akamai.steamstatic.com/steam/apps/597120/ss_b3657cbb647ce667a35155c7d4bd4ac7c83c041c.1920x1080.jpg?t=1581812075,https://cdn.akamai.steamstatic.com/steam/apps/597120/ss_b5feb529eeb2ab5d69e749056d55caa397f1c0e4.1920x1080.jpg?t=1581812075,https://cdn.akamai.steamstatic.com/steam/apps/597120/ss_a9d05414520955c5d5774db704041ab2a77513dc.1920x1080.jpg?t=1581812075",
    "Slug": "the-filmmaker-a-text-adventure",
    "Meta Title": "The Filmmaker - A Text Adventure: Mar 7, 2017, Storycentr...",
    "Meta Description": "Looking for information on The Filmmaker - A Text Adventure? Check out the release date (Mar 7, 2017), developer insights from Storycentric Worlds, and ...",
    "Alt Text Image": "Official header image for The Filmmaker - A Text Adventure game - Steam 597120",
    "Canonical URL": "https://gusku.site/game/the-filmmaker-a-text-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Filmmaker - A Text Adventure\", \"description\": \"Looking for information on The Filmmaker - A Text Adventure? Check out the release date (Mar 7, 2017), developer insights from Storycentric Worlds, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Storycentric Worlds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unimatrix Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/597120/header.jpg?t=1581812075\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}