{
    "AppID": 865720,
    "Name": "Torn Tales: Rebound Edition",
    "Release date": "Sep 6, 2018",
    "About the game": "Torn Tales: Rebound Edition is a much expanded version of the original Torn Tales, based upon the classic story. Check out co-op play, more custom loot items, gem crafting, new quests and new arenas. The original version of Torn Tales is not required, Rebound Edition will work as a standalone game. You will wield the powers of Robin Hood, Snow White and Dr Jekyll &amp; Mr Hyde as they fight together in the dark landscape assembled by the evil Bookbinder. He has bound enemies from across the fabled lands to stop you, so be ready for the unexpected. Lead your party of 3 heroes on their quest to repair the torn pages of folklore. Evil has destroyed the tales you love. Hack monsters and slash enemies throughout the Torn Tales in this real time squad based RPG. With Rebound Edition you can finally party up with friends and play your way with the heavily requested shared screen co-op and controller support! Master a rich tree of abilities to upgrade your characters. Choose load-outs that maximise your team’s total fighting potential. Swap lead character in combat to battle harder. Explore the lands of lore &amp; fable, collecting loot with a vast array of variations from Geppetto’s Gold Ring of Shielding to Ahab’s Amulet of Fury. Rebound Edition has more loot variations than ever before. Pick the perfect item for your party’s strategy; launch explosive barrels, leave a trail of poison berries, support the whole party with a healing totem and many, many more. Hone your skills and try out new ability combos in the endless Arena mode, with 3 brand new maps in Rebound Edition. See how you compare to the best players in the world through the global leaderboards. The new missions mode allows you to focus on your favourites with solo and party missions for every combination of characters with a special build. Completing each mission will unlock a unique item that can be found in the main quest. Test your skills with 10 brand new quests, each with a special twist that will make you rethink your Torn Tales strategy. Can you do glorious battle whilst being bombarded by cannon fire? Can you loot the undead treasure trove before the whole place caves in? Can you take on the biggest beasts of each realm all in a row?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/865720/header.jpg?t=1611412311",
    "Price": 14.99,
    "Developers": "Twistplay",
    "Publishers": "Chilled Mouse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/865720/ss_12f1938945eacf267290b6063f2b27eb7703ccc1.1920x1080.jpg?t=1611412311,https://cdn.akamai.steamstatic.com/steam/apps/865720/ss_4b7671d5b7e01cbc9b5ad045091217f7cbf16d27.1920x1080.jpg?t=1611412311,https://cdn.akamai.steamstatic.com/steam/apps/865720/ss_87f443df4776cfe992778ace0cee74e8175065b8.1920x1080.jpg?t=1611412311,https://cdn.akamai.steamstatic.com/steam/apps/865720/ss_99328220f3e38b0a6e8872a51c6cc68264fb7943.1920x1080.jpg?t=1611412311,https://cdn.akamai.steamstatic.com/steam/apps/865720/ss_e937573d17f94b5aa782339c43b908e84388c510.1920x1080.jpg?t=1611412311,https://cdn.akamai.steamstatic.com/steam/apps/865720/ss_97a598ac4eb731765b22a826e9f44ae892184190.1920x1080.jpg?t=1611412311",
    "Slug": "torn-tales-rebound-edition",
    "Meta Title": "Torn Tales: Rebound Edition: Sep 6, 2018, Twistplay and F...",
    "Meta Description": "Looking for information on Torn Tales: Rebound Edition? Check out the release date (Sep 6, 2018), developer insights from Twistplay, and a complete game...",
    "Alt Text Image": "Official header image for Torn Tales: Rebound Edition game - Steam 865720",
    "Canonical URL": "https://gusku.site/game/torn-tales-rebound-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Torn Tales: Rebound Edition\", \"description\": \"Looking for information on Torn Tales: Rebound Edition? Check out the release date (Sep 6, 2018), developer insights from Twistplay, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Twistplay\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chilled Mouse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/865720/header.jpg?t=1611412311\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}