{
    "AppID": 262120,
    "Name": "Toy Soldiers: Complete",
    "Release date": "Feb 17, 2016",
    "About the game": "The award-winning smash hit returns with Toy Soldiers: Complete ! Bring your toys back to life with the original Toy Soldiers and Toy Soldiers: Cold War , now bundled together with all DLC packs: Kaiser's Battle, Invasion! , Napalm and Evil Empire . That's both Toy Soldiers games and all DLC in one $45-value bundle! Key Features Great Value: Enjoy over 60 original missions from Toy Soldiers , Toy Soldiers: Cold War , with accompanying DLC packs in Toy Soldiers: Complete . Multiplayer: Lead your toy soldiers to victory against friends! Engage in head-to-head battles across both games in Toy Soldiers: Complete . That’s right: you can now pit Commando against Kaiser in “historic” multiplayer action. An Arsenal of Weapons: Take direct control of over 50 units including machine guns, howitzers, tanks, fighter planes and bombers to defeat over 57 different enemy units. DLC is free!: Enjoy the content of the original Toy Soldiers , Toy Soldiers: Cold War , The Kaiser’s Battle , Invasion! , Evil Empire and Napalm DLC packs, absolutely free. Endless Action: Over 60 hours of intense combat combined with addictive, action strategy gameplay. Toy Soldiers One of the top 10 best-selling Xbox LIVE® Arcade games of all time, Toy Soldiers is a unique, action-packed strategy-based game in which players command antique WWI toy soldiers vying for control of the trench-filled battlefields of Europe. Deploy an exciting arsenal that includes tanks, cavalry, biplanes, and flamethrowers in vintage WWI toy dioramas. Position your defenses and take direct control of your artillery to bomb the enemy positions, pilot your bi-plane against the enemy trench, or maneuver your tanks across No-Man’s Land and lead your Toy Soldiers to victory! Kaiser's Battle DLC Enjoy all new French inspired content with THE KAISER'S BATTLE! Enter the fray as the French Army and battle into the midnight hours in new multiplayer and Survival Mode maps. Take on the new experimental boss, the fearsome K-Wagen! Invasion! DLC The British are bringing brand new secret weapons of tiny toy mayhem in 'Invasion!,' the second add-on to Toy Soldiers from Signal Studios! Put on your Kaiser’s helmet and command the German Army against a mad menagerie of new antagonistic toys, including flying saucers, chivalrous knights, and the “Rolls Royce of the Sky,” the WWII Mustang. Defend Germany in a new Mini-campaign topped by the most calculating, head-strong boss of all (batteries not included)! Raise your saber, soldier, and lead the charge against… is that a spaceman? The Invasion has begun! Toy Soldiers: Cold War The Cold War ignites when '80s era action toys come alive and wage war! Toy Soldiers: Cold War delivers hours of intense combat combined with addictive action strategy gameplay. Superpowers collide in this playful homage to '80s action toys and films. Command the powerful Cold War arsenals of the USA or USSR armies! Control base turrets, modern combat vehicles, fighter jets, attack helicopters, and commando action figures. Whether lighting up the Toy Box alone or jumping into the fray with your friends, battle in campaign, co-op, or competitive modes. Fight for the high score in the addictive mini-games, and while you're at it, don't forget to BLOW EVERYTHING UP! Evil Empire DLC It’s time to step into the boots of our Russian comrades and fight back as the Evil Empire! Deploy turrets, modern combat vehicles, attack helicopters and a slew of new tricks to destroy your capitalist foes—all while enjoying expanded single player, online co-op, and online competitive modes. Napalm DLC Eager to return to your freedom-fighting American army? Turn up the heat and invade a harsh new world in the jungle-themed Napalm; the final expansion for Toy Soldiers: Cold War. With challenges focused on torching your enemies, additional weapons at your disposal, a brand-new vehicle, and expanded single-player, online co-op, and online competitive modes, Napalm is sure to set a new standard for startling authenticity and intense action.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/262120/header.jpg?t=1657238025",
    "Price": 8.99,
    "Developers": "Signal Studios,Krome Studios",
    "Publishers": "Signal Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_d21a5dc62be8e8f3004c86ecc992cb9db9fdca4a.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_ee08f7f48390956ed886121f4ba9381048c20a51.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_00c1e81686421eddd25bee516a03a6e822ff10f6.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_ec99d49542dbc44ffd3bdbd188190db56d606364.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_bbd3e2f971b3bc033d7a0bb631454c050cb3021d.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_61cbdd69192d0be5725ecf60cca74ba954de15da.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_02eaaf437315a0546dac62e83b37ca2b14951e15.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_ee86af0d323f81c5cdd3ad40ba02a3b34fe615d6.1920x1080.jpg?t=1657238025,https://cdn.akamai.steamstatic.com/steam/apps/262120/ss_1264dc2a702dac123fab921dda2818e1e193fb07.1920x1080.jpg?t=1657238025",
    "Slug": "toy-soldiers-complete",
    "Meta Title": "Toy Soldiers: Complete: Feb 17, 2016, Signal Studios,Krom...",
    "Meta Description": "Looking for information on Toy Soldiers: Complete? Check out the release date (Feb 17, 2016), developer insights from Signal Studios,Krome Studios, and ...",
    "Alt Text Image": "Official header image for Toy Soldiers: Complete game - Steam 262120",
    "Canonical URL": "https://gusku.site/game/toy-soldiers-complete",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Toy Soldiers: Complete\", \"description\": \"Looking for information on Toy Soldiers: Complete? Check out the release date (Feb 17, 2016), developer insights from Signal Studios,Krome Studios, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 17, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Signal Studios,Krome Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Signal Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/262120/header.jpg?t=1657238025\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}