{
    "AppID": 1069660,
    "Name": "Ultimate Admiral: Dreadnoughts",
    "Release date": "Dec 10, 2021",
    "About the game": "Ultimate Admiral: Dreadnoughts aims to be the first game of its kind - a true naval warfare game - which offers a unique opportunity to design and build countless variations of realistic looking warships combined with an extremely in-depth and realistic combat model. We are absolutely excited with what we are making and we hope everyone who is interested about the dreadnought era and naval warfare, will join our ambitious project and support us. FEATURES BUILD THE BATTLESHIPS THE WAY YOU WANT Become the architect of powerful warships, from small torpedo boats to mighty Battleships! Recreate famous ships such as the HMS Dreadnought and countless speculative designs. Pick turret layout, armor scheme, funnel placement, tower variations making each ship look and feel unique. Their hull characteristics, internal upgrade selection and weight distribution not only modifies their speed and maneuverability but also their weapon effectiveness. Every design detail of your warships has a significant effect on the combat capability of your ships. STRONG AI Naval combat becomes immersive and feels even more realistic when your opponent is able to react to your actions with a human-like and unexpected behavior. The AI evaluates the optimal engagement distance, using principles of the “Immunity Zone” and comparing its own firepower versus your ships. The AI uses ammunition wisely, holding fire when necessary or switching shell types according to the armor protection of the target. Unless there is a special mission directive, the AI will not act suicidally and will attempt to withdraw, if its fleet becomes heavily damaged or it is much weaker than yours. NAVAL ACADEMY &amp; CUSTOM BATTLES The Custom Battle system allows you to experiment and enjoy naval battles utilizing endless combinations of ship designs in technology eras between the years 1890 and 1940 for ten different nations. Additionally, there is the “Naval Academy” which currently includes 56 battle scenarios, where you will have to design a ship or a squadron to fulfill a certain combat tactical task. These numerous missions will allow you to practice and enjoy the many innovative design and combat aspects of the game. THE CAMPAIGN (Continuously updated during Early Access) You can fully design your fleet, immerse yourself in epic naval battles and make crucial strategic decisions on the map with a single goal to defeat your opponent by annihilating his fleets and strangling his economy. The campaign will be improved during Early access with new content added in every patch. Current Playable Nations British Empire French Empire German Empire Italian Empire Austro-Hungarian Empire Forthcoming Nations United States Russian Empire Empire of Japan Spanish Empire Chinese Empire Current Functionality of Campaign The Europe map, including North Sea, English Channel, Baltic Sea and Mediterranean Initial years for starting a campaign are from 1890 to 1940 (unlocked until the full release). No peacetime, the game starts at war against two alliances. Technology aspects about 80% ready. Standard Economy options to be enhanced further. Refit of old warships with newer technologies. Full ship movement between ports and everywhere at Sea with Task Forces. Via the Task Force meetings or via a Mission Generator system, battles are created, which you can play in real-time. Campaign is won when you fully defeat your opponents by controlling their seas and struggling their economy. Future Campaign Features Full Global Map including important regions and colonies. Diplomacy options. Various political and economic events that will enrich the gameplay. Campaigns will last from 1890 up to 1940+. Technology tree improvements for ship design options, crew &amp; officers. Additional warfare options including submarines and minelaying. New map mechanics will allow many more strategic options for your fleets. Other features based on your feedback. “Early Access” Ship Options - Over 327 Hull Variants that use over 1386 different ship parts and thousands of different weapons in various sizes and tech levels. - Among the many ship models there are 33 extra detailed, which can faithfully recreate the following historical ships: USS Monitor CSS Virginia Brandenburg-class battleship (1890) HMS Renown battleship (1893) Kaiser Friedrich III-class battleship (1895) Massena-class battleship (1895) Bouvet-class battleship (1896) Gazelle-class cruiser (1897) Cressy-class cruiser (1898) Formidable-class battleship (1898) Tsesarevich-class battleship (1899) Borodino-class battleship (1899) Warrior-class cruiser (1903) Lord Nelson-class battleship (1905) HMS Dreadnought (1905) Invincible-class battlecruiser (1906) SMS Von der Tann (1907) South Carolina-class battleship (1908) Emden-class cruiser (1908) Fuso-class battleship (1915-1944) HMS Hood battlecruiser (1920) Trento-class cruiser (1925-1929) Deutschland-class cruiser (1929) Mogami-class cruiser (1931) Zara-class cruiser (“Pola” 1932) Richelieu-class battleship (1935) Yamato-class battleship (1937) Sovetsky Soyuz-class battleship (1938+ plan) King George-class battleship (1939) Akizuki-class destroyer (1940) Bismarck-class battleship (1940) Littorio-class battleship (1940) Iowa-class battleship (1940) Upcoming Ship Models French battleship Danton More hull variants TBA.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1069660/header.jpg?t=1650992145",
    "Price": 34.99,
    "Developers": "Game-Labs",
    "Publishers": "Game-Labs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_1c666f5c0a40276f4b8bc9659b49421696cca88a.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_fe0821deb8e127ca17960215ebebf6328dcaa5c7.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_83dc5334688f00e3f794f0220029eabeadfcaff4.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_c19662345cb808b0ee01cbdcf9dc260a48e642df.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_6c4648f5c06d56b3c321f469cb56a4ea9fa13f9c.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_a5b1d923db2a4f96ab421abada4db09606dd0392.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_a5e5246576a7d925345ffa2737b5be68b06fd8c3.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_cb73ecc7a2819680493809e306caa437c60804c4.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_e4d11f4b49d4d51b20a406f7d8d4523eef55672f.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_a2e809d940bec22d69eb671386ff4501d1e74cb6.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_01598dea59333db3cef76b65d874fbfbdb3cfa1b.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_98a42c5514c6f86dbd1909e6da95b3887ef46869.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_5f50502eca5cac053f815324c09b3735a5d0def4.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_0fc842abf6c3fc6d6e53c61ef8aa95d684e70c08.1920x1080.jpg?t=1650992145,https://cdn.akamai.steamstatic.com/steam/apps/1069660/ss_a6b96d3d4bd0e3d6bfb80f9cef30ac35b7ab4b90.1920x1080.jpg?t=1650992145",
    "Slug": "ultimate-admiral-dreadnoughts",
    "Meta Title": "Ultimate Admiral: Dreadnoughts: Dec 10, 2021, Game-Labs a...",
    "Meta Description": "Looking for information on Ultimate Admiral: Dreadnoughts? Check out the release date (Dec 10, 2021), developer insights from Game-Labs, and a complete ...",
    "Alt Text Image": "Official header image for Ultimate Admiral: Dreadnoughts game - Steam 1069660",
    "Canonical URL": "https://gusku.site/game/ultimate-admiral-dreadnoughts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ultimate Admiral: Dreadnoughts\", \"description\": \"Looking for information on Ultimate Admiral: Dreadnoughts? Check out the release date (Dec 10, 2021), developer insights from Game-Labs, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game-Labs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game-Labs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1069660/header.jpg?t=1650992145\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}