{
    "AppID": 1570760,
    "Name": "Variables 2",
    "Release date": "Oct 1, 2021",
    "About the game": "联系我们 QQ群：126203854 Two years ago, we combined tower defense games and roguelike games to create a stand-alone tower defense game called Variable /#app_reviews_hash After two years of precipitation, we re-made this variable sequel after thinking about it! Variable 2 is a unique stand-alone tower defense game. We have enriched the building and elements of tower defense, and the experience in the game can be changed according to your ideas! Let's take a look together! Game Features Free route construction. Different from traditional tower defense, in 'Variable 2' you can freely place the core and the location of the strange outlet, and then use the original objects in the road, buildings and the map to pave a road that is beneficial to you. Unlike the previous game, the terrain you will face this time will be more complicated. The recipe and synthesis of the defense tower. In 'Variables 2', we provide you with 5 basic towers and numerous advanced towers. Obtain supplies, extract basic towers, and then synthesize more powerful advanced towers according to the recipe. High-level towers have higher attributes and more powerful characteristics, and use the combination of defensive towers to face various situations. equipment. You can match equipment for the tower. Equipment not only provides basic attributes, but more importantly, equipment has many special mechanisms. Using these mechanisms reasonably, your output will increase explosively. The acquisition of equipment is obtained by accumulating energy values. Each round gives 1 point of energy, and each round increases the value by 1 point. But when you use the supply to extract the base tower, the extra growth will be cleared. Plugins. The plug-in will provide you with some additional help, but you need to accept some small challenges if you want to get this help. Fragmentation group. The acquisition of equipment and plug-ins will be different from the random acquisition of the previous game, but you can use the shard group to arrange the acquisition of your equipment and plug-ins in advance before the game enters. The fragment group is obtained by using the money obtained in the game to extract.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1570760/header.jpg?t=1646214225",
    "Price": 14.99,
    "Developers": "Asteroid Game Studio",
    "Publishers": "Asteroid Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1570760/ss_515182cca03d53fddaf0949e40aa9c76a47667d8.1920x1080.jpg?t=1646214225,https://cdn.akamai.steamstatic.com/steam/apps/1570760/ss_fc45136e30023bdbfba3a2a124c17169f59b30a1.1920x1080.jpg?t=1646214225,https://cdn.akamai.steamstatic.com/steam/apps/1570760/ss_27c16fbf26adcff5f9f9871426c94c99e31073cb.1920x1080.jpg?t=1646214225",
    "Slug": "variables-2",
    "Meta Title": "Variables 2: Oct 1, 2021, Asteroid Game Studio and Full O...",
    "Meta Description": "Looking for information on Variables 2? Check out the release date (Oct 1, 2021), developer insights from Asteroid Game Studio, and a complete game summ...",
    "Alt Text Image": "Official header image for Variables 2 game - Steam 1570760",
    "Canonical URL": "https://gusku.site/game/variables-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Variables 2\", \"description\": \"Looking for information on Variables 2? Check out the release date (Oct 1, 2021), developer insights from Asteroid Game Studio, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Asteroid Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Asteroid Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1570760/header.jpg?t=1646214225\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}