{
    "AppID": 1189440,
    "Name": "VenusBlood FRONTIER International",
    "Release date": "Feb 7, 2020",
    "About the game": "World Setting There once was a great war between the gods and the demons. Known as the Ragnarok War, this war drove humanity to the brink of extinction. Under the protection of the goddesses, the surviving humans were sheltered and continue to live on the Floating Continent of Yggdrasil. Many years later, the protagonist Loki and 4 other royal heirs prepare to invade Yggdrasil, contending for the throne of the Dark Lord. Story ...Gods in heaven, demons on earth, and a giant floating continent inhabited by humans. The continent known as the 'Floating Continent of Yggdrasil' is also considered a floating miniature garden of the gods. It is a place where the human survivors of the great war live, the continent closest to the realm of the gods. The Dark Lord Surt who has his eyes set on that continent said this to his heirs: 'The one who brings me the Heart of Yggdrasil said to be safeguarded by the goddesses on the Floating Continent of Yggdrasil shall be the heir to my throne. As long as you get your hands on the Heart of Yggdrasil, I will not question your methods or your past transgressions. You are free to make alliances between yourselves, sabotage, or even 'remove' your fellow heirs as you would any obstacle. Kill and rampage as you wish, and prove to me your strength and worth!' Hearing those words, Surt's heirs, all having motivations of their own, began their invasion of the Floating Continent of Yggdrasil. Among them, an ostracized member of the demon nobility, Loki, has also decided to participate in the prolonged battle for the throne. To become the Dark Lord means you will stand above and at the very top of every demon. If corrupting the goddesses said to be as beautiful and elegant as a flower in full bloom will be the key that leads to him gaining the throne, he saw no reason not to participate. 5 invading demons, and 5 goddesses fighting back. All the pieces have fallen into place. All that remains is for him to wager his own existence in this battle and fight. In a continent caught in a whirlpool of chaos and ambition, Loki's own ambition burns brightly. Gameplay Features Army Composition Create your own divisions, building armies with unique synergies to overwhelm your foes! Create teams consisting of up to 6 units with varying skillsets into a division, allowing you to freely form teams tailored to your liking. Base Investment Make full use of your conquered lands and develop them! Production of food and procurement of resources are important factors that keep an army running. Build structures on captured territory according to the needs of your army, whether it be facilities that generate more gold, food, magic, resources, or perhaps even a training grounds for your soldiers. Battles Invade the country governed by the goddesses, subjugate their capital city, and capture the goddesses! Build your forces and capture enemy territory before finally launching an assault on the capital city in order to take over the goddess' nation! Intimacy/Corruption Friendship, or domination? Will you befriend the captured goddesses, or will you corrupt them, turning them into loyal servants who answer to your every whim? Corrupt the virtuous, gallant goddesses into depravity, and they will become a stronger and more loyal pawn. If you want a goddess that specializes in battle, you can even break the mind of a goddess, turning them into a mindless doll or even a battle-crazed berserker! Military Preparation &amp; Unit Customisation Outfit your subordinates with equipment, and raise them to become stronger! Forge unique 'medallions' to gain access to more units! The type of medallions you can forge will change depending on the choices you make during the game, which in turn affects what units you can hire! Medallions can also be used to apply titles to your units, which will either boost their status parameters or give them new skills! The higher the rarity of the medallion, the better the effect! Mix and match different titles in order to create the ultimate unit! You can also name any units you hire, allowing you to get creative and give your favourite units cool names! The Routes of Law and Chaos Harmony or Pandemonium? Do the ends justify the means? You decide... Depending on your decisions throughout the game, your Law and Chaos ratings will change. Depending on your choices, how the story progresses could change...As well as the ultimate ending to your ambition. Multiple Endings Virtuous, Corrupted, Mindbroken...Decide, and lead the goddesses towards a new FRONTIER! Both the Law and Chaos routes have unique endings, as well as sub endings for specific heroines! Do you opt to maintain peace, and settling down with your most beloved heroine... Or do you opt to throw the world into chaos, ruling as the new Supreme Ruler and keeping all the women to yourself? Features Immerse yourself in the world of VenusBlood Frontier, with over 50 hours worth of story content, over a million Japanese characters worth of story! On top of that, even more hours will be spent crafting your strategy, preparing your army and taking over the Floating Continent of Yggdrasil! All heroines and side characters are fully voiced, allowing you to better immerse yourself in the world of VenusBlood FRONTIER International! Multiple difficulty options offer a variety of playstyles and challenge tailoured to your liking! For the kind of player who would prefer to focus more on the story aspect of the game, easy mode lets you skip battles with an instant win button, while harder difficulties will be sure to provide a thrilling challenge! The higher the difficulty, the higher the quality of the items you will get from battles! If story isn't really your thing, there is also a battle royale mode available after clearing the game once that cuts out all story content and is just 100% SRPG gameplay! Freedom of Choice The choice to corrupt the goddesses or not... The choice to adopt a more peaceful, lawful approach to this adventure... Or to take a darker, more chaotic approach, paving the path forward in blood... The freedom to hire any unit you want outfitting them before freely organizing them into any of 10 unit divisions available... The freedom to choose the game's difficulty before proceeding with the game, with higher difficulties granting better items... And of course, the freedom to enjoy the story set in a world based loosely on Norse Mythology. Experience the freedom and sheer replayability of VenusBlood FRONTIER International that no linear game can hope to provide!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1189440/header.jpg?t=1639465663",
    "Price": 39.99,
    "Developers": "Ninetail,Dualtail",
    "Publishers": "JAST USA,Kagura Games (Chinese Localization)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_5228b63ea6b1e11cc8dbead1363f52916c28c8ab.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_b0124699ad2bd5a33c2cfbe2638ae128542b91cd.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_f26b73c89e59b144814c2ceafdd6242981c1c8eb.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_9107ae63836a96075e6fca3dd9ed18746d6d5633.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_8eb3e2e003e79de83acc858f62fc5e49715db683.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_bafeb87a89b6b871e57661489e2b2d393ed05583.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_8e35469fdcd49e06d90228b15285081f62be6db3.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_4d73d34ed33b16c6d28c7a89b78146a2250157ce.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_3fbbb1b52dfaeb69b404eebc2487815d87cc1a25.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_3d52ecfa8a9bc64f986cf7befb39bafd72e6a65d.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_b6d75ba552b0e383bab0195c1b47cf46ba3fcbe7.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_523ae215ee713dda496f1779856c0d916ae5f72e.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_621d9353d7a2c88b506d157c455e87cfb35d4707.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_ab675bea827275661ef8b4bb18979b3fc7183b82.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_88e1e76a75ae47a763fd70c457af3443be8dba5d.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_503a5f0cacf1fa50af02d2dc07a5194a7dc960b4.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_c7f5020e7a88390a580e299060caa2aa5e6931ea.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_2bb37a653f164eeef5c7be6cf1a262e4094c34c0.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_9ad9ed7fa744daa3d35248498f6f53564192373e.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_688921dc2eb7916a979009415448ccb9c5c765ea.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_cdea087ed4a6d20a39574882ae93a811d6054b95.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_d5c4c686dd807a92ec59cb1a8219436f0647d8e5.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_548f8f843aa14a7b5601fd473786fe73f0e16284.1920x1080.jpg?t=1639465663,https://cdn.akamai.steamstatic.com/steam/apps/1189440/ss_65c1bc1bc8ed69ecc5ff9a8840e33580ae01ef5f.1920x1080.jpg?t=1639465663",
    "Slug": "venusblood-frontier-international",
    "Meta Title": "VenusBlood FRONTIER International: Feb 7, 2020, Ninetail,...",
    "Meta Description": "Looking for information on VenusBlood FRONTIER International? Check out the release date (Feb 7, 2020), developer insights from Ninetail,Dualtail, and a...",
    "Alt Text Image": "Official header image for VenusBlood FRONTIER International game - Steam 1189440",
    "Canonical URL": "https://gusku.site/game/venusblood-frontier-international",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VenusBlood FRONTIER International\", \"description\": \"Looking for information on VenusBlood FRONTIER International? Check out the release date (Feb 7, 2020), developer insights from Ninetail,Dualtail, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ninetail,Dualtail\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JAST USA,Kagura Games (Chinese Localization)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1189440/header.jpg?t=1639465663\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}