{
    "AppID": 1394060,
    "Name": "Viking Idle",
    "Release date": "Sep 4, 2020",
    "About the game": "Why? This is the first game from the small developer studio Makrogames. Decades of experience and countless computer mice have been sacrificed to create this masterpiece and to refine it to perfection! We see this game as the beginning of a great story. All income will flow into the development of a full-fledged 'Chapter Two', which will have nothing to do with the quality, graphics and gameplay of the first chapter. Actually, we plan to design a completely different game. The concept has been in place for years, but unfortunately you need a lot of credits to realize big dreams. See the game with the same sense of humor as we do and we hope you enjoy it as much as we had. Thank you for supporting our studio! Become part of the people who can say in years: 'Hey, you know, Makrogames started with Viking Idle and see what they create today lol!' Story The valleys of Mightyton is the home of an old magic Viking clan called “Skrombuskin”. Through the use of their sacred Gojiflower, they managed to survive hundreds of years without dying.  Magnus Struggleson, the son of Smithy Bjorn gets banished from his tribe because he could not win the initiation fight against his archenemy Tjǫrvi Ohsonastyson. Magnus seeks revenge and wants to show his father Bjorn Struggleson, that he is worthy as a clanmember and maybe as a Leader of the clan. And ofcourse the best way to get clanleader is by slaughtering the whole clan and taking the lead. How many lifes will past until he is getting powerful enough to challenge his opponent and get judged by the Clanleader Karl Strongsonson? Features Dual Prestige System! Really? Now I don't have to grind my way through a Prestige system only once, but twice? Well, will that be so great? #MouseByeBye Recruiting new brothers in arms! From the idiot next door to the mighty Jarl, you can have them all! #MouseRescueYay Dozens of weapons including changing weapon skins! Actually only the numbers get bigger and you get through the game faster to FINALLY reach the target. But hey, the weapons just get visually cooler over time! # LookOnMyMightySword! Bosses! Click, click, click ... no too slow ... Grind, grind, grind ... BOOYAH the guy is history! #MightyPlayer Idle Clicker with an end! After countless clicks and days of unbelievable gaming fun, you've finally made it and watch the incredibly well-designed *cough* ending! #Epic Countless level designs! Seldom has there been a game that had such incredibly great and passionately designed levels Sound! Included without DLC #Mindblowing",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1394060/header.jpg?t=1599237148",
    "Price": 4.99,
    "Developers": "Makrogames",
    "Publishers": "Makrogames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1394060/ss_0d5ba645e19c0ea1baa2aa15a94c63a66e4606c4.1920x1080.jpg?t=1599237148,https://cdn.akamai.steamstatic.com/steam/apps/1394060/ss_a21946bbbb4540e6462a682cb50de2f2be227532.1920x1080.jpg?t=1599237148,https://cdn.akamai.steamstatic.com/steam/apps/1394060/ss_debaf5ff65600c9860e7c4fc6d1fa5f8843845c4.1920x1080.jpg?t=1599237148,https://cdn.akamai.steamstatic.com/steam/apps/1394060/ss_a690b9fab05afb1c3204045d4fb98e64e4976387.1920x1080.jpg?t=1599237148,https://cdn.akamai.steamstatic.com/steam/apps/1394060/ss_34c3e2e6cfd7ef1e81ad9159e1043e369df3d3d7.1920x1080.jpg?t=1599237148",
    "Slug": "viking-idle",
    "Meta Title": "Viking Idle: Sep 4, 2020, Makrogames and Full Overview",
    "Meta Description": "Looking for information on Viking Idle? Check out the release date (Sep 4, 2020), developer insights from Makrogames, and a complete game summary.",
    "Alt Text Image": "Official header image for Viking Idle game - Steam 1394060",
    "Canonical URL": "https://gusku.site/game/viking-idle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Viking Idle\", \"description\": \"Looking for information on Viking Idle? Check out the release date (Sep 4, 2020), developer insights from Makrogames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Makrogames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Makrogames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1394060/header.jpg?t=1599237148\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}