{
    "AppID": 262410,
    "Name": "World of Guns: Gun Disassembly",
    "Release date": "May 21, 2014",
    "About the game": "Do you know how the insides of a Terminator’s Minigun work? Try World of Guns: the world’s most realistic 3D simulator of firearms (and other things from tanks to DeLorean time machines). Find out what makes legendary pistols, rifles, machine guns and artillery pieces tick… Then disassemble them down to the tiniest part! WHAT IS WORLD OF GUNS? A free-to-play game and an interactive encyclopedia, simulating real firearms in 3D. Here, you can literally climb inside a gun and understand its workings; cut it in half, fire it and bring time to a crawl; and finally, completely disassemble it and put it back again (against the clock if you wish). WoG meticulously recreates historical and modern examples of firearm designer genius — from a tiny Liberator pistol to a 16000-pound FlaK 88 anti-aircraft gun. It has both legendary World War guns and rare models that even museums struggle to find. World of Guns puts 200 years of firearm history into a single, sleek and engaging video game. 211 MODELS AND 26 200 PARTS Here you are guaranteed to find something that catches your fancy: • sleek &amp; modern Glocks, P90s, M4s and Tavors • guns steeped in history like Colt SAAs, Garands and Lee-Enfields • a vast arsenal of Soviet-bloc guns, from various AKs to the rarest VSS Vintorez • a dainty pocket derringer or a fire-breathing M134 Minigun • a .22 sporting Ruger or a mighty .55-caliber Boys Anti-Tank rifle Not only WoG covers most important models in firearm history, but also the most popular screen divas like Desert Eagle and SPAS-12. TONS OF GAME MODES AND FEATURES Every model includes: • modes for learning operation, handling, and field stripping the gun; • the armorer mode where you can completely disassemble the firearm; • timed game modes, including a hardcore mode and a high scores table. See every detail with the fully controllable camera, layered X-Ray feature and a Cutaway mode, along with complete time control including a slow-motion feature down to 50x. You’ll even see the gasses flow inside a gas block! The game also features: • 10 shooting ranges with timed objectives (from Glocks to RPG-7s) • paint mode that lets you create custom weapon skins • minigames and quizzes with XP prizes UNPARALLELED REALISM World of Guns has been used as a learning aid by armorers, law enforcement and military personnel. To create each model, our team spends months poring over actual guns, photos, blueprints and documents. Each part out of hundreds functions in a physically correct way – exactly as it does in a real thing. There are few ways to understand the different firearm actions and systems as clearly. CONSTANT UPDATES Noble Empire releases several new models every month, and improves the older ones. Majority of our models can be unlocked for free by anyone; power players will be able to achieve 100% completion and unlock ALL the gun models without spending a dime. Available models: Pistols Glock 19 CZ75 Colt 1911 SIG P228 Beretta 92FS Desert Eagle .44 S&amp;W Sigma Springfield XDM Browning Hi-Power Makarov (PM) Jericho 941 Welrod MKII Walther PP Smith &amp; Wesson M&amp;P .40 Ruger SR9 GSh-18 HK USP FN Five-seveN Walther P99 APS (Stechkin Automatic Pistol) Beretta PX4 CZ 52 SIG SP2022 MP-443 Grach Remington R51 SIG P210 Steyr M1912 Astra-400 PB silent pistol FN Model 1903 SMG/Assault Pistols MP5 Tec-9 Uzi HK UMP 45 Kel-Tec PLR-16 FN P90 Mac-10 Scorpion vz. 61 B&amp;T MP9 Kriss Vector .45 ACP Sterling MK4 M3 Grease Gun PP-19 'Bizon' Carl Gustaf M/45 Scorpion EVO3 A1 Suomi KP-31 Launchers RPG 7 MGL MK1-L M79 Revolvers Colt Python S&amp;W Model 53 Colt SAA Ruger New Vaquero Chiappa Rhino 200DS Ruger Super Redhawk Ruger Old Army S&amp;W Schofield Webley MKVI Colt Walker 1847 Nagant M1895 Webley Fosbery S&amp;W M500 Historical Colt Hammer Mauser C96 Borchard C93 Maxim Harpers Ferry Lewis Gun Winchester 1873 Mauser 1914 Browning Automatic Rifle Dreyse M1907 Mars Pistol Protector Palm Pistol WWII Tokarev Pistol Luger P08 MP40 Sten MK II M1 Garand Thompson Gun Mauser 98K PPSH Boys Anti-Tank Rifle SKS Rifle Mosin-Nagant DP 27 machinegun Walther P38 Lee Enfiled No.1 Mk III STG/MP44 MG 34 Liberator FP-45 PTRD-41 Nambu Type 14 PTRS-41 MAS-36 Springfield M1903 PPD-40 PPS M1 Carbine Assault rifles AK47 SIG SG552 commando LR 300ML HK G36E FN FAL FAMAS-F1 M-16 TAR-21 M4 Carbine AK-74N AKS-74U AS Val HK G3 FN SCAR-L ArmaLite AR-18 Sa vz.58 Fedorov Avtomat AN-94 FN FNC Rifles SIG SG550S SVD HK SL9SD Barrett M107 M14 M200 CheyTac Steyr Scout VSS Vintorez Remington 700 SVT-40 Type 99 Arisaka OSV-96 Karabiner M1931 AR-7 M1941 Johnson Machine gun M60 M134D 'Minigun' Browning M1919 Browning M2 RPK MG3 DShK 38 M240B Hotchkiss LMG RPD MG34 Madsen LMG M249 SAW Chauchat LMG Compact Guns Ruger LCP Derringer COP 357 AMT Backup Ruger LCR PSS Silent Protector Palm Pistol NRS-2 Scout Firing Knife Shotguns Remington 870 Mossberg 500 Benelli M4 Browning A-5 SPAS-12 Winchester Model 21 Winchester 1897 Daewoo USAS-12 Pancor Jackhammer SAIGA-12k Artillery ZiS divisional field gun 8,8 cm Flak 37 Sport Ruger Mark II Ruger 22 Charger Marlin 336 Rifle Ruger No.1 Beretta CX4 Storm Browning Buck Mark Calico M100 Bonus models Bike Captain America Ducati 916 Cars Custom Hot Rod Lotus Seven AC Cobra DeLorean Military Infantry fighting vehicle BMP-3 HMMWV A2 F4U Corsair T-72 battle tank Skeletons Human Lion Horilla Horse Allosaurus Wolf",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/262410/header.jpg?t=1630429396",
    "Price": 0.0,
    "Developers": "Noble Empire Corp.",
    "Publishers": "Noble Empire Corp.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_32df72fbb8d646419bb22b569264143342727161.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_6fd62f75f2de39ea359561f0b57ae7b5175e22db.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_6001a2d936ca965eecff4d6cc0ac02c14cd2c104.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_55cb8ea001a64c4e5089fde9c395ce65011c1073.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_7146dab93be5379f6a85d9443f6c5296d869254b.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_820088b59f96a3446ef036646e5ed6de4f015e75.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_b4a222921952d3ffe0c375f376fc9f99fe26408c.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_19ab113785a7d7b934ee83da6371d4c8c3b58cde.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_f3677ef1448619ce1d0572f3556c1acb47819ba3.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_de9744dd7d64a50efc6dd90fdf1291747125cb2c.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_3d510d9d3c00f66d66e8acdd537e37ad3c79bab0.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_5545433dcb178f3e3eef89fb6c5ef5aded29e2cf.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_0ca2f943ad1da91402042a0c939d9b9489643edb.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_855472b4e8ebf5b983ba601197fa108b94791f1a.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_6a459729b6940a717b384376acdc931f04f3184d.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_90cf2d7f16aa846a20cef6cc0404f1608c2d6503.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_a6ce7cdf1cc5edb74b9497e0f734b1b918efbc52.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_44c8a73b4824b11f2e3e4b8a8378d6998477ff1a.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_e3fd2edffcb5dd84a51aef35f078412fa8be6450.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_804e18a2d92b91795c642d5aa2bc41283df7dcb3.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_c791a2302dafbcf3b797e47c490e224e1a655ddf.1920x1080.jpg?t=1630429396,https://cdn.akamai.steamstatic.com/steam/apps/262410/ss_db81f55ab8184da7a22ddcb0c47696925446f365.1920x1080.jpg?t=1630429396",
    "Slug": "world-of-guns-gun-disassembly",
    "Meta Title": "World of Guns: Gun Disassembly: May 21, 2014, Noble Empir...",
    "Meta Description": "Looking for information on World of Guns: Gun Disassembly? Check out the release date (May 21, 2014), developer insights from Noble Empire Corp., and a ...",
    "Alt Text Image": "Official header image for World of Guns: Gun Disassembly game - Steam 262410",
    "Canonical URL": "https://gusku.site/game/world-of-guns-gun-disassembly",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World of Guns: Gun Disassembly\", \"description\": \"Looking for information on World of Guns: Gun Disassembly? Check out the release date (May 21, 2014), developer insights from Noble Empire Corp., and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Noble Empire Corp.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Noble Empire Corp.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/262410/header.jpg?t=1630429396\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}