{
    "AppID": 392160,
    "Name": "X4: Foundations",
    "Release date": "Nov 30, 2018",
    "About the game": "X4: Foundations is the latest title in the popular X series of space simulation / sandbox games , played as action games from a first-person perspective in a living breathing universe, with TRADE FIGHT BUILD THINK as the common tag-line. X4: Foundations is unique in its depth, simulating an entire universe of NPC ships and stations, forming a realistic economy . It consists of a huge universe, simulated from the bottom up. Hundreds of stations, and thousands of ships, trade goods among themselves. Prices change based on supply and demand; resources are mined and processed in several stages. This economy is linked directly to the simulation of major conflicts in a universe with dynamically-acting factions. Every player decision can dramatically change the future of the game universe. Step in and live your very own space adventure! X4: Foundations has been significantly enlarged with its 5.00 Update – this is the perfect time for space game enthusiasts to newly discover or revisit the biggest space sandbox this side of the galaxy! The 5.00 update introduces a series of new capital ships. These ships have been re-imagined, and a new fleet of improved models will now be on sale in various shipyards. Several factions in the game will gradually start using these new and improved ships. Start your journey In X4, you can start your journey from a number of different gamestarts and as a number of different characters, each with their own role, set of relationships and different ships and technologies to start with. No matter how you start, you are always free to develop in any other direction . Focus on exploration, make money with illegal trading and theft, command large battle fleets or become the greatest entrepreneur ever. It's all up to you to decide. Fly every ship X4 allows you to fly all ships personally . From small scouts over a wide range of ship classes up to the biggest carrier, everything can be piloted from the cockpit or an external view. A big focus in the development of X4 has been to achieve a seamless and immersive experience when moving between ships . You can leave a ship, climb down a ladder, walk over the dock of a large space station into another ship you may have parked there and replace the pilot that was working for you just by clicking on his chair. Build space stations and upgrade your ships Building space stations and factories has always been a foundation of the X games. After gaining enough money through fighting or trading, most players want to establish their own economy and start influencing the universe on a larger scale . In X4, it is now possible to be completely free and creative . Stations can be constructed from a variety of modules, be it production modules, living sections, docks or many other types of parts. The powerful new map system allows you to drag and connect modules using a connection system to design your own unique creations. Ships also offer a variety of upgrades. Engines, weapons and other equipment can be added in a graphical editor and actually seen on the ship. Experience the most dynamic X universe ever X4 is the first X game to allow our races and factions to freely build and expand their empires ; the same flexibility the player enjoys in creatively designing space stations from modular building blocks is also available to them. Races expand their empire based on supply and demand, which leads to an extremely dynamic universe where every action the player makes can influence the course of the entire universe . Manage your empire with a powerful map Once you have more ships and many NPCs working for you as pilots, crew or station managers, the map will be your preferred method of managing it all. Ships can be ordered with simple clicks and through drag-and-drop operations to set their future path and commands. Graphically plan your trade routes, coordinate attacks with your entire fleet, manage the hierarchy or send ships on remote exploration missions. Dive into the most detailed X economy ever One of the key selling points of X games has always been the realistic, simulated economy . Wares produced by hundreds of stations and transported by thousands of ships are actually traded by NPCs and prices develop based on this simulated economy. This is the foundation of our living and breathing universe. Now with X4, we have taken another, massive step. For the first time in any X game, all parts of the NPC economy are manufactured from resources . Ships, weapons, upgrades, ammo and even stations. You name it. Everything comes out of the simulated economy. Research and teleport The seamless change from ship to ship and from NPCs controlling your empire for you continues on a higher level. Once you own a larger fleet, you will be very interested in researching a technology from your HQ: Teleportation . Once you've unlocked teleportation, you can jump from ship to ship a lot quicker and experience all the critical situations your NPCs encounter first hand. Every order you have given to a ship before turns into a mission objective when you pilot the ship yourself. The moment you leave again, your pilot takes the helm and continues with their previous orders.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/392160/header.jpg?t=1651672910",
    "Price": 49.99,
    "Developers": "Egosoft",
    "Publishers": "Egosoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_48add58f1778ff64a88fc0dc5c8b665c0cecff89.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_5e5f311ea693b673f62cf416ceecc826ca602cbf.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_ff11e93404276dd98d5159c19a30041ab3b3dcfb.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_92ce0e228a374d33b1c27564c35ddca77e7b5705.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_90856a621c6a44d184695f9edc81ca93a5d09a27.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_a8ad176e9247f18818191a156ecfb4a4ef9d320e.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_c97cc60f60fd72c114d785b861656979b8ef200a.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_186574627878c6a596b60fa614639bdfe6155ddf.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_9d444d2a52c738c96d913d8e8b297af8aec168e6.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_1781119fd8a684acb2b14f4a9e397c6d5822856e.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_179ae2441aff59439795fc5d75ade0115a15cf6d.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_73f434cac1f1b12cdba020860f98d2fb8746bbc2.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_3ca3287f38212fd902eff500dcc4540b4d39d66b.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_fe8fe0ec12bd385664a0198d0772badcdd5fd086.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_59903fd12a6894b5f6fc94f3bf68d3139e5c0a58.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_d932e14da41164ff4b85e31314c365b8b01daf6f.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_da2bdbf28c40488164f581458b978a38e431f3ad.1920x1080.jpg?t=1651672910,https://cdn.akamai.steamstatic.com/steam/apps/392160/ss_9d87c8e83778d41fca411243090eea8325ecd9c6.1920x1080.jpg?t=1651672910",
    "Slug": "x4-foundations",
    "Meta Title": "X4: Foundations: Nov 30, 2018, Egosoft and Full Overview",
    "Meta Description": "Looking for information on X4: Foundations? Check out the release date (Nov 30, 2018), developer insights from Egosoft, and a complete game summary.",
    "Alt Text Image": "Official header image for X4: Foundations game - Steam 392160",
    "Canonical URL": "https://gusku.site/game/x4-foundations",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"X4: Foundations\", \"description\": \"Looking for information on X4: Foundations? Check out the release date (Nov 30, 2018), developer insights from Egosoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Egosoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Egosoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/392160/header.jpg?t=1651672910\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}