{
    "AppID": 454170,
    "Name": "XorceD - Sashiro's Laedrum",
    "Release date": "Apr 14, 2016",
    "About the game": "World-line Laedrum: Play as Sashiro Kobata, a World-Peacemaker (WPM) officer with an incredible dual-wielding pistol skill, in an undercover mission! His WPM-group has found out information about a terrorist group that puts the world into disorder. The information: A highschool student is supposed to be the leader of that terrorist group! In order to maintain world-peace and to stop the terrorist group, Sashiro has to identify the leader by transferring to the school as a student. This won't be an easy task for him who has never attended a public school before and is only specialized in combat. He will meet several suspects with their own background story and has to find out more about them. Will he be able to find out the truth? Setting and background This story takes place in the world-line Laedrum in year 2040. The world-line Laedrum was created in year 2017 by a supernatural group that annihilated about three billion humans who had physically harmed other humans; that means criminals were executed, but also children who played tag. The crime rate exponentially decreased and police forces were no longer needed during the the so-called Purge . It lasted for three years and that supernatural group called Xorcerox suddenly disappeared. When those news were spread all over the world, the crime rate increased again; this time without a police. Drastic times require drastic measurements: The World-Peacemakers (WPM) were born. They are the elite of the old special forces from all over the world. Given special rights, such as freedom of act (and thus to kill), they try to maintain world-peace in a humane way. Now, in year 2040, there is a big terrorist group spread around the world. The current main mission of the WPM is to put an end to their terror! Sashiro Kobata Sashiro Kobata is the main character you will play in this visual novel. world-peacemaker officer known as the White Demon who colours his path in red, together with the Black Demon Qi incredible pistol skills with the special ability Reign of Bullets age: 17 has never attended a normal school before and only had private lessons his parents were WPM-officers Concept of the universe In the XorceD universe there are infinite world-lines that are created by decisions and choices. There are main world-lines created by events that drastically change the world, such as Laedrum that was created by the Purge . This concept of world-lines is unknown to the residents of the world including Sashiro; only a few exceptions and the world-line travellers (you, the player) know about this concept. Game features story rich visual novel many unique characters with background story a lot of choices of action unique universe concept beautiful artworks over 20 soundtracks create three different world-lines (three different endings)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/454170/header.jpg?t=1492798522",
    "Price": 12.99,
    "Developers": "Xorcerox",
    "Publishers": "Xorcerox",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_9d5610d4b929cef62dce504784f944423c7b34ec.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_9823f8dd1bb41fc53370f17c6d537c96dcc82b3f.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_a342afb3b54895df9fb2342df18576d4456565a9.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_b335699defb899c1e6225681a33f3cce66534fe8.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_aafe13af3f91579d54f0e5068ca0c98bc967ee7a.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_9caaaa5cd748008130e5c69f0a89c899796da4d5.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_e023b4bcebd98abb563a639a04e86ad333c90469.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_1fa27116d93da47cebe3254a1797dab39a914eff.1920x1080.jpg?t=1492798522,https://cdn.akamai.steamstatic.com/steam/apps/454170/ss_37c539de3f0cf2e8545ac2c52abb93c8cec62cc3.1920x1080.jpg?t=1492798522",
    "Slug": "xorced-sashiro-s-laedrum",
    "Meta Title": "XorceD - Sashiro's Laedrum: Apr 14, 2016, Xorcerox and Fu...",
    "Meta Description": "Looking for information on XorceD - Sashiro's Laedrum? Check out the release date (Apr 14, 2016), developer insights from Xorcerox, and a complete game ...",
    "Alt Text Image": "Official header image for XorceD - Sashiro's Laedrum game - Steam 454170",
    "Canonical URL": "https://gusku.site/game/xorced-sashiro-s-laedrum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"XorceD - Sashiro's Laedrum\", \"description\": \"Looking for information on XorceD - Sashiro's Laedrum? Check out the release date (Apr 14, 2016), developer insights from Xorcerox, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Xorcerox\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Xorcerox\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/454170/header.jpg?t=1492798522\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}