{
    "AppID": 2003870,
    "Name": "YOW",
    "Release date": "Jul 4, 2022",
    "About the game": "One Game - New Every Time 'YOW' stands for 'Ye Olde World' and is a new way of playing with a catapult. Either in single mode as training or as a competition game against each other. And slightly different each time: the walls, houses, castles and objects are procedurally created and react to your projectile slightly differently each game. This is what makes YOW so diverse and exciting. And what's even more exciting - the projectiles destroy the targets in a realistic way. Physically correct. Most of the time. Sometimes there remains an effect we like to call 'ACME' effect. You'll see why. YOW is a 3D game where you can have a lot of fun just in between. You will quickly lose yourself in trying, fiddling, shooting, watching, spinning the catapult. But even more - you also see exactly what your launched projectile does with the fantastic 'fly-with-projectile' camera view. Yay! Every hit gives you points - slightly different every time. Get the goodies - like 'Faster reload', 'More points' or extra projectiles or more - In versus mode you can even earn shields. Always look out for goodies. Projectiles Depending on the game mode, you have unlimited or limited projectiles to choose from. From simple stone chunks to... - No, we won't tell you more. You'll have to see for yourself. But this much is revealed: Sometimes not asking is better. Free movement mode With this you explore the environment and see if hidden obstacles block your goal or simply how your goals are built. Sometimes what you see isn't everything. You can also change the view in catapult mode but this is much more fun if you also change your viewpoint in 'Free Roam Mode' - Master your Onager Your onager (catapult) is realistically simulated. You need to tune your angle, traction and projectile so that you hit the building, wall or tower you are aiming at. Do some target practice in Training Mode before challenging your friends. Try different projectiles for different targets - not all of them are good for everything. Try different strategies Not always the direct way is the goal - or differently: (Almost) every target is shootable in at least two ways. And - sometimes low hits are better than high ones. Games against colleagues (soon) Playing against each other is more fun - who is faster and has the better tactics when firing at the targets? Who takes out the shield faster? Train. Win. Repeat. Missions This is where it gets harder. Your targets defend themselves. Good and accurate. 'I need to break through the defense - but where is it coming from?' - that's what one of our testers thought. He found out. And won gloriously. Others have a less good eye. YOW - YE OLDE WORLD is a beginning of a new gaming era. 3D representation. Physical engine. Different every time. Playing against each other. Catapult. Projectiles of different types. - This makes playing fun.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2003870/header.jpg?t=1657049715",
    "Price": 5.99,
    "Developers": "devpoint GmbH",
    "Publishers": "devpoint GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_9b89ec7eb639ceed62fbfd2c217828b229b47f58.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_47ac75562e1b43a93bf96d5526e802205003fe2e.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_f1e602f3730cd0dabdadb87ef62b6331050a3397.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_b52a7c108c4454a6a3417455c4d5736930225430.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_c1cbb97a5231bcb4018a970834fbb58a7610068c.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_0a0a655853caad799eb824fedca146571cb7b7ad.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_47b06fe377f65d0e6c4162d3673947ce990807ef.1920x1080.jpg?t=1657049715,https://cdn.akamai.steamstatic.com/steam/apps/2003870/ss_3857a8e2917464aea6693b4b4db1040b4a7fb4cd.1920x1080.jpg?t=1657049715",
    "Slug": "yow",
    "Meta Title": "YOW: Jul 4, 2022, devpoint GmbH and Full Overview",
    "Meta Description": "Looking for information on YOW? Check out the release date (Jul 4, 2022), developer insights from devpoint GmbH, and a complete game summary.",
    "Alt Text Image": "Official header image for YOW game - Steam 2003870",
    "Canonical URL": "https://gusku.site/game/yow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"YOW\", \"description\": \"Looking for information on YOW? Check out the release date (Jul 4, 2022), developer insights from devpoint GmbH, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"devpoint GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"devpoint GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2003870/header.jpg?t=1657049715\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}