{
    "AppID": 1193340,
    "Name": "Zelter",
    "Release date": "Oct 22, 2020",
    "About the game": "Here we are: the Zombie Apocalypse has happened. You have been saved by a mysterious group of people and they helped teach you how to survive in this new reality. Though it was tough, they taught you how to fight, craft necessary items, and survive out in the wild. But you should NEVER underestimate a zombie horde. They broke into your home, and though you fought tirelessly, it was hopeless from the start. Now, you are alone once again. But at least you are alive, and with all the knowledge that you have, you can start anew once again. Use your skills to craft tools for both survival and defense, get your own farm going, and go out to scavenge and save lives. Zombies will come for you eventually — all you can do is prepare yourself and your home, so be sure to have your defenses ready and your machine gun turrets fully armed. The zombie apocalypse is a tough thing to overcome even if it happens in a cute pixelated universe, but don’t lose hope just yet! With dozens of crafting options, you can turn your home into an indestructible fortress, set up your own food production systems, and venture out into the zombie infested wilderness to gather valuable loot and survival gear, and save as many people as possible. Survive and build your home mid zombie outbreak Zelter takes resource management systems to a whole new level. At first you simply bang rocks against each other to get a hatchet, but this quickly develops as you craft better tools, before long you will find yourself fully immersed with a complex crafting system that caters to all of your needs, providing you with food, safety, and offensive and defensive power. On your journey you will meet other survivalists. Use this opportunity to rebuild your crew together, after all, saving one's life creates an excellent first impression. Once they are a part of your crew you can direct them to craft essential supplies, guard vital positions, accompany you on your scavenger hunt, and help you to build an impenetrable fortress, ready for the inevitable zombie attacks. It’s not all serious though, through the various interactions you will be shown a funny side as well, giving you a combination of both serene moments of base building and intense action. Survive against the odds in Challenge Mode Prove yourself the ultimate zombie apocalypse hero in Challenge Mode and survive six days of escalating threats! It will be no easy task - you'll need to think on your feet, be smart about your resources and keeping your shelter secure. This is an intense mode of play in which you rescue civilians and risk your life covering their escape. Survive until the evacuation chopper arrives and remember your success is measured in the lives you save. But what’s that deafening roar? Looks like your last day will feature a threat like no other! The cutest zombie-apocalypse that you’ve ever seen Immerse yourself in the cutest post-apocalyptic world there is. A post-apocalyptic world overrun with zombies has never been so funny! What’s more, zombies and the other infected species have never looked so cool, especially when they are being ripped apart by your shotgun. Community-driven development With thousands of fans, the game is set to release in EA to continue gathering players' feedback. The main reason for this stems from the desire to make Zelter a game that will be loved by players all over the world, a goal that would be impossible without a strong and sustainable connection with the audience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1193340/header.jpg?t=1657092356",
    "Price": 19.99,
    "Developers": "G1 Playground",
    "Publishers": "Super.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_1704ff49ad71d8b21a9c839d2bbd70a79be3dad6.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_3cb11b664c312f6c25ef99e2472d679b48bfd956.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_2723740469d38c5e696c95904f9ea3d78ed698f0.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_c8d1da890c6d1109ac4a388a3e789f47c3a916d4.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_5d5343adfe2fe1e113ca6f33d8231f2440a274f4.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_7355ed011364e0aed329fa4f0660a631321a88ab.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_d84b207e735254a9a10b14f8bcb1846a6f6f9396.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_89cf49b931292774d1bdee3ce73c6f16ba488d91.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_a5fb1cf8415fc06e53c0f7738f38c852978e7bfc.1920x1080.jpg?t=1657092356,https://cdn.akamai.steamstatic.com/steam/apps/1193340/ss_4bff1e2bb114813b75dd76d94aa38f214ea5a126.1920x1080.jpg?t=1657092356",
    "Slug": "zelter",
    "Meta Title": "Zelter: Oct 22, 2020, G1 Playground and Full Overview",
    "Meta Description": "Looking for information on Zelter? Check out the release date (Oct 22, 2020), developer insights from G1 Playground, and a complete game summary.",
    "Alt Text Image": "Official header image for Zelter game - Steam 1193340",
    "Canonical URL": "https://gusku.site/game/zelter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zelter\", \"description\": \"Looking for information on Zelter? Check out the release date (Oct 22, 2020), developer insights from G1 Playground, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"G1 Playground\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Super.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1193340/header.jpg?t=1657092356\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}