{
    "AppID": 1922770,
    "Name": "American Catur/Traditional",
    "Release date": "Jun 20, 2022",
    "About the game": "American Catur/Traditional American Catur “Traditional” is the latest Strategy Game that We All have been Waiting for that offers Us Skill and Luck Equally. GAME SKILL PLAYING LEVELS; PAPER SCISSOR ROCK, TIC TAC TOE, CHECKERS, CHESS, WEI QI (GO), AMERICAN CATUR (NEW CHATURANGA) THE HIGHEST LEVEL!!!!!! “You know I'm finished with the old chess because it's all just a lot of books and memorization you know.” “Because I consider the old chess is dying, it really is dead.” Robert James 'Bobby' Fischer (March 9 1943 – January 17 2008) World Chess Champion American Catur is a new Chaturanga game that was designed and focused for young and old gaming players, to give chess lovers and chess haters who are willing to try a brand-new digital sports game. The object of the game is to kill or (threaten with inescapable capture) of the opponent's president. The other way to win is to eliminate all of your opponent pieces leaving the president the only piece standing. This would be called torturing your opponent soul which would be the worst way to lose (GAME OVER). There is NO quitting in American Catur, NO playing for a draw , NO playing for a stalemate in a American Catur. We treat you with a victory ever game! WITH NO tie's if your skillful enough to win. There is nothing quite like the feeling of victory. When we win at something, our body shoots us with dopamine. Like Bobby Fischer was looking to better the game. This game offers skill and luck perfected by technical experts. A new game was born with the principles of controlling each piece mirroring modern day warfare. American catur has a marginally different rule than chess making it even more challenging to play. The addition of combining squares and triangles spaces to the board that supports twice the number of pieces than chess. I want to keep the old catur/chess flavor and add a new savor making it a really interesting type of strategic game. So, we added bombs to the equation. Four different types of bombs used for offensive and defensive aids. These are bombs that are placed on outside perimeter of the board (The inner perimeter is for triangle spaces and the outer perimeter is for the square spaces), With these four types of bombs (Poison &amp; Atomic for triangle spaces, Hydrogen &amp; Biological for the square spaces.) The nuclear bombs kill the piece(s) it lands on and cannot return back to the game and the chemical bombs capture any piece(s) it lands on and becomes a POW. These bombs are cocked and loaded and ready to be launched and guided by the roll of the dice. So, with all these new ideas we made sure that the game didn’t degenerate down to memorization and prearrangement like chess is today. There are only two pieces that remove bombs one is the Navy that removes the bombs by jumping over it on the square space and the other the coast guard that removes bombs by jumping over it on the triangle spaces. Another challenge is to have your Coast Guard who can travel forward and backward and side to side go down to the other side of the board and rescue any captured Prisoner of war (POW). No limit on how many times you can rescue. Coast Guards pieces do not get promoted like chess. More people will be acknowledged, invited and playing because the game is very exciting to battle the (six-star) General of Armies War Machine. The league will be coming soon once we establish a demand for our world community and world support organization. Keep a lookout for sign-up. You have to be a member before you can join the league.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1922770/header.jpg?t=1657148971",
    "Price": 29.99,
    "Developers": "Eric Curtis",
    "Publishers": "American Catur LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_47ad1e186f885698c5fc3f49a69251b7ccd1e9c5.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_b8f5d9b102aefeaa150277611f9f12f63459d568.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_e1d47e567746507fc965453a5b36ac4f26a04839.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_cff078828031e4cdc67b4a448dfe1ff31b0ba56c.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_7428efe1c5c9f8b14837f2170756051d00034c15.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_fc27ad12f8469bea9905a0ff56612aea2e553558.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_d3b700846cbe7a98703f2f5f874def9937195e68.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_414fb0e16001aeccbc3e91ba20201ee5243385a6.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_64a74b6803c1fcf9b017fb3a52dea75a52a222fb.1920x1080.jpg?t=1657148971,https://cdn.akamai.steamstatic.com/steam/apps/1922770/ss_c29f966bc53a85e77fc13cfef85c7479f10aef21.1920x1080.jpg?t=1657148971",
    "Slug": "american-catur-traditional",
    "Meta Title": "American Catur/Traditional: Jun 20, 2022, Eric Curtis and...",
    "Meta Description": "Looking for information on American Catur/Traditional? Check out the release date (Jun 20, 2022), developer insights from Eric Curtis, and a complete ga...",
    "Alt Text Image": "Official header image for American Catur/Traditional game - Steam 1922770",
    "Canonical URL": "https://gusku.site/game/american-catur-traditional",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"American Catur/Traditional\", \"description\": \"Looking for information on American Catur/Traditional? Check out the release date (Jun 20, 2022), developer insights from Eric Curtis, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eric Curtis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"American Catur LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1922770/header.jpg?t=1657148971\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}