{
    "AppID": 652360,
    "Name": "BFF or Die",
    "Release date": "Sep 13, 2018",
    "About the game": "Congratulations! You and your friends are graduating from the prestigious Intergalactic Time Academy. No time for partying though as your first mission awaits! The Orbees are all missing. Yes, those curious little beings made of energy who power our time-tech are nowhere to be fou... no, wait! We have a faint trace on their signal. Are you brave enough to rescue them? Prepare yourself for unknown dangers. If you find some of the Orbees they might equip your Space-Time Machine with new tech. Decide who is in charge of each gadget and combine your abilities to discover the best strategies. Use cunning, comradeship and co-operation to survive and never forget the Academy motto: “BFF or Die!” Best Friends Forever BFF or Die is a game for you if: You want a 2-4 player game to play with your partner/family/friends where you get to do everything as a team. Pure co-operation sounds fun to you as it’s a different feeling when you all work together. You like games that are easy to start playing but then gradually get more challenging. You like games that let you figure things out yourself rather than “hand holding” you too much and telling you what to do. You want a game with a fun, short campaign mode which adds replayability by having difficult trophies to collect and also an unlockable “Infinite” mode. Is There Online Multiplayer? You can play with your friends online by using Steam's new 'Remote Play Together' feature, or by using Parsec. Read our Steam community posts about it to find out more. What to Expect We strongly recommend playing in 2, 3 or 4 player mode as this is when the game is most fun. Playtime will vary depending on your skill level but as a guide: 1-Player story game: 2-3 hours 2-Player story game: 2-3 hours 3-Player story game: 2-3 hours 4-Player story game: 2-3 hours “The Infinite Trials”: 1-999 hours! Or maybe ∞ hours :) Complete as many randomised/procedural levels in a row as you can without losing. Go back to the start if you die. You can either share controllers (two people per controller) or have separate controllers. As a minimum you need the keyboard and one control pad to have a 4-player game. Or you can use four separate control pads, it’s up to you. There’s a story mode with 30 levels followed by an unlockable “Infinite Trials” mode with challenging randomised/procedural levels. The game will feel different depending on how many people play. Levels also change around when the number of players change. The characters’ story text will change depending on which characters you pick. Each mode has a different set of trophies. If you want a complete set you will need to complete all modes. Our Favourite Quotes from (English) Steam Reviews :) “It's cute, fun, challenging, intense, and funny.” - Skaginator “The game is like a physical puzzle game but with action elements to it.” - Spoon Thumb 'Lots of fun! started playing it with friends and once we got started couldnt stop until we finished it! Strongly recommend it if you are looking for a couch co op game!' - CimYwjSiab “A guaranteed good time for a group of friends or family!” - Dr Davient “Similar to games like Overcooked, this is as much about communicating with each other as it is what you are actually doing on the screen” - Pug2980 'If you are looking for a couple of hours of local co-op fun, you cant go wrong here.' - GamingGideon “I can't wait to have a few friends come over for a game, so we can have a go with the local multi-player mode as well.” - gorm '... let's hear it for more games that make our world a better place and make a night gaming with friends end with everyone feeling closer and better.' - Arkade 'BFF or Die has all the good stuff from the couch co-op genre, with some stylish quirks thrown in, including an innovative UX' - One Third Nerd 'It’s the kind of game I’d recommend when you’ve got a few friends over looking for something fun to do!' - Flom 'Definitely a fun game to play with friends. Even though it's short, you won't be short on laughs and good times in this game.' - Tanaka Naoki",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/652360/header.jpg?t=1627048256",
    "Price": 4.99,
    "Developers": "ASA Studio",
    "Publishers": "ASA Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_58247aeb0878ed527eb33f5aa21dd55a7b01b6c2.1920x1080.jpg?t=1627048256,https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_67e1ffd8b24abd0c5b8cd8b227219554bcb899a4.1920x1080.jpg?t=1627048256,https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_994dcb181f468ae9cb6cf01424daf45b304af98f.1920x1080.jpg?t=1627048256,https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_25d78ed20127f745769f3de14527d8b97e53d853.1920x1080.jpg?t=1627048256,https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_c6b7dd484d1d00fe552a8ebfacac3e6358625291.1920x1080.jpg?t=1627048256,https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_b46d715159d952a576e6975bb731a7db76ae9416.1920x1080.jpg?t=1627048256,https://cdn.akamai.steamstatic.com/steam/apps/652360/ss_14f99449cd171e7a767b02cb46d347909c3e5346.1920x1080.jpg?t=1627048256",
    "Slug": "bff-or-die",
    "Meta Title": "BFF or Die: Sep 13, 2018, ASA Studio and Full Overview",
    "Meta Description": "Looking for information on BFF or Die? Check out the release date (Sep 13, 2018), developer insights from ASA Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for BFF or Die game - Steam 652360",
    "Canonical URL": "https://gusku.site/game/bff-or-die",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BFF or Die\", \"description\": \"Looking for information on BFF or Die? Check out the release date (Sep 13, 2018), developer insights from ASA Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ASA Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ASA Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/652360/header.jpg?t=1627048256\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}