{
    "AppID": 887300,
    "Name": "Bleeding Sun",
    "Release date": "Jul 14, 2018",
    "About the game": "Yori Takenaka had a happy childhood with his father Akio and the other members of the Takenaka House. However, everything changed the day that Ichiro showed up to settle old disputes accompanied by a powerful witch named Chiyo. Quickly, Akio and his best friend Kenzou were defeated. When Ichiro was about to kill Yori, the ninja Tsuru showed up and managed to escape with Yori and Kenzou. Unfortunately, it was already too late to save Akio. Knowing that Ichiro would not stop coming after Yori, Tsuru decided to take him far away, where he would be safe. After 15 years have gone by, your adventure starts. Yori has finally come home to fulfill his duty of facing his father's killer. In order to be able to defeat him, Yori will need to improve his fighting skills and to rebuild the Takenaka House, allying himself to the people who once supported his father. CLASSIC TURN-BASED BATTLES. First all attacks are chosen; afterward, they are carried out in sequence. 3 TO 4 HOURS OF CAMPAIGN DIVIDED INTO 6 ACTS. This linear game focuses on Yori’s story and how he and his allies improve in order to defeat Ichiro. 4 CHARACTERS WITH DISTINCT PLAYSTYLE. Each character has their own characteristics and combat limitations. CHOICES AFFECT CHARACTER PROGRESSION. The player choices result in different abilities and attributes. MULTIPLE ENDINGS. There are 6 endings that reflect player's choices during the game. NEW GAME+. In this mode, most battles are removed from the game. This way, it is easier for the player to explore others choices and endings. ITEM MANAGEMENT. Each item counts. The player needs to think before using their items. If the player is not careful, Ichiro wins. CRAFTING. It's very dangerous to use more items than you can craft. Luckily the player can be constantly crafting items. But be alert, crafting takes time. Hi! My name is Jaime Paz Lopes, and I am a Brazilian game developer. After working in this industry for five years, I have decided to create my own games by myself. My hard work and dedication resulted in what I am presenting to you now: Bleeding Sun, my first game. Critics and suggestions are always welcome. I hope you like it and have fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/887300/header.jpg?t=1571232367",
    "Price": 2.99,
    "Developers": "Jaime Paz Lopes",
    "Publishers": "Jaime Paz Lopes",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_bfb121095a47dbeffc1089fe85304a02b207ffa7.1920x1080.jpg?t=1571232367,https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_cab9819ec2275f37289a03957647a9913f6fd56b.1920x1080.jpg?t=1571232367,https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_11c419c55eebeaee00c5a82182ff97a6b9f72592.1920x1080.jpg?t=1571232367,https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_64486afa0b573f6d99f31ac0b3247dd252cf9c7e.1920x1080.jpg?t=1571232367,https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_c45746ab066a7a36066e8e71efed63ab2b269df5.1920x1080.jpg?t=1571232367,https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_88b40c2f2c6fae3e331c801866589d4d944aeff0.1920x1080.jpg?t=1571232367,https://cdn.akamai.steamstatic.com/steam/apps/887300/ss_07c50f6df24c2e93335c6fe8234688c9b6032355.1920x1080.jpg?t=1571232367",
    "Slug": "bleeding-sun",
    "Meta Title": "Bleeding Sun: Jul 14, 2018, Jaime Paz Lopes and Full Over...",
    "Meta Description": "Looking for information on Bleeding Sun? Check out the release date (Jul 14, 2018), developer insights from Jaime Paz Lopes, and a complete game summary.",
    "Alt Text Image": "Official header image for Bleeding Sun game - Steam 887300",
    "Canonical URL": "https://gusku.site/game/bleeding-sun",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bleeding Sun\", \"description\": \"Looking for information on Bleeding Sun? Check out the release date (Jul 14, 2018), developer insights from Jaime Paz Lopes, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jaime Paz Lopes\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jaime Paz Lopes\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/887300/header.jpg?t=1571232367\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}