{
    "AppID": 2020460,
    "Name": "Bring It On!",
    "Release date": "Jun 20, 2022",
    "About the game": "The realm is under siege! Monsters and the denizens of Evil have spread across the land, driving citizens out of their homes and chasing innocent people into hiding! Now it's time for you to take up your sword! ...and your shield! ...and your daggers! ...and your boomerangs... Fine! Take everything! Bristling with weaponry and items, there's just one thing left to say to the forces of Evil: BRING IT ON! Bring It On! is a single-player auto-attacking 'monster'-hell shoot-em-up survival game. Take on MASSIVE hordes of monsters across several locations, earning experience points to level up and acquire new weapons and items. Can you survive long enough to bring out the Mid-boss and Boss of each area? Can you find and recruit all of the other fighters scattered across the land to your cause? Features Lots of unlockable characters with unique talent trees! TONS of weapons and items to find, unlock, and upgrade! Several unique locations - each with its own types of enemies and bosses! Tons and TONS of monsters to fight! Controls Arrow Keys/WASD moves the player and the cursor Enter to make selections in menus. P/Escape to Pause the game Mouse also works for Menu navigation. Gamepad Support EARLY ACCESS Note: This game is in EARLY ACCESS! It is still being actively developed and, as such, the current version does not reflect what the final product may be. The current version contains: 1 Location 1 Unlocked Character (the Knight) 1 Unlockable Character We will be updating the game continuously, and ask that you provide feedback to help us shape this game to be the best that it can be. By supporting the game in Early Access, you are helping support the development of the game, and helping us pay our bills and things. About You may notice a sort of similarity between this game and another popular game. It is true that this game's development was inspired by the game Vampire Survivors. We wanted to see if we could make something similar, but different - to see if we could capture some of the fun elements of that game and then expand on them and see what kinds of challenges and/or obstacles such a project would create, and then overcome them. This game is not intended to be a copy, a rip-off, a reskin, or an attempt to trick people into buying this game instead of the other one. We have dedicated real time, energy, resources, and money into making this the best game we could make, and trying to come up with our own version. That being said, it is understandable and inevitable that we will be compared to that other game. We only hope that this comparison can be seen as the flattery that it is intended and not something nefarious. If you like this game, please consider supporting Vampire Survivors as well - and tell 'em Axol Studio says 'hi' 😉",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2020460/header.jpg?t=1658237514",
    "Price": 2.99,
    "Developers": "Axol Studio, LLC",
    "Publishers": "Axol Studio, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2020460/ss_c07485fae824bb5e59428e224d640b2bb94a8b53.1920x1080.jpg?t=1658237514,https://cdn.akamai.steamstatic.com/steam/apps/2020460/ss_12bba12fde0be5e2558f432977202f857855a9d9.1920x1080.jpg?t=1658237514,https://cdn.akamai.steamstatic.com/steam/apps/2020460/ss_6a2ee8235e53713ac9c6e819361ca2d06a85a7ec.1920x1080.jpg?t=1658237514,https://cdn.akamai.steamstatic.com/steam/apps/2020460/ss_5feffa907e1c1c6e16b81209bf1d2a5563c177fa.1920x1080.jpg?t=1658237514,https://cdn.akamai.steamstatic.com/steam/apps/2020460/ss_10f035b54cdcdb23929d82f1dc59f36398313791.1920x1080.jpg?t=1658237514",
    "Slug": "bring-it-on",
    "Meta Title": "Bring It On!: Jun 20, 2022, Axol Studio, LLC and Full Ove...",
    "Meta Description": "Looking for information on Bring It On!? Check out the release date (Jun 20, 2022), developer insights from Axol Studio, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Bring It On! game - Steam 2020460",
    "Canonical URL": "https://gusku.site/game/bring-it-on",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bring It On!\", \"description\": \"Looking for information on Bring It On!? Check out the release date (Jun 20, 2022), developer insights from Axol Studio, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Axol Studio, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Axol Studio, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2020460/header.jpg?t=1658237514\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}