{
    "AppID": 1061690,
    "Name": "CameraBag Pro",
    "Release date": "May 6, 2019",
    "About the game": "***CameraBag Pro: Professional Editing and Filtering for Photos and Videos*** CameraBag Pro includes all the same great features as CameraBag Photo, but also works on videos and includes LUT file support! The best kept secret in photography (and videography) just got a whole lot better! CameraBag lets you instantly apply one of hundreds of beautiful presets to your photos and videos, and then dive deeper with ultra-intuitive professional adjustments and custom presets. CameraBag’s focus on intuitive tools and workflows isn’t about dumbing down image editing, it’s about making it work better. “A revolution for photo editing.” - Professional Photographer Magazine #2 Mac App of the Year - Apple “I don’t understand why it’s so inexpensive.” - Podfeet With presets specifically designed for portraits, different landscape scenarios, faithful emulation of analog film stock from the past, popular modern photo styles, and more, CameraBag has you covered, even if you don’t yet know how to use all of its powerful tools. CameraBag Pro is particularly great for anyone who needs to apply the same style to both photos and videos - especially with batch processing for large sets of media (including watermarks/branding, resizing, and cropping). For those with professional needs, what really sets CameraBag apart from other photo editors is just how intuitive and powerful its advanced tools are. Unique curve tools, adjustment re-ordering and layering, and large precise controls let you do things you simply can’t do in other popular software. Following are some ways CameraBag is perfect for specific groups of users. Wedding Photography Easy batch filtering and watermarking Use the exact same adjustments and filters on videos and photos Quick comparison tools for large sets of photos Tons of useful presets for wedding photography Social Media Marketing Custom image-based borders for consistent aspect ratios and branding Easily save video frames as image files Super fast filter-finding workflow Batch resizing Portrait Photography Smoother, bigger, better tone curves than in other software Spot heal tool Special portrait-focused presets Extremely natural and adjustable film grain Pro Photographers End-to-end high-bit-depth RAW workflow Fast intuitive file navigation Workflow built for developing a personal style Unique, advanced tools for subtle adjustments",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1061690/header.jpg?t=1589528167",
    "Price": 39.99,
    "Developers": "Nevercenter",
    "Publishers": "Nevercenter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_6da9d24dcb1b19f194c9b0696bba486f6a6f5156.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_00bef8117a20ad4d9ef93f2a8f85f99a6699778a.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_d086ee3433309b7cb4a240bdb1659ca422930257.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_06a796b58287a1af2b08ae5f935e32a9ea41364f.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_a1f703066692e74a3bacf6a13d56bc334f1d34e4.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_75162ea90e8ca7896dd81a67873b881b6e9bb9be.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_adc20c3740744a4c6521122c86206eb9f962f505.1920x1080.jpg?t=1589528167,https://cdn.akamai.steamstatic.com/steam/apps/1061690/ss_9301fc00d4ed3031c8170a45b0a2b903c685fe71.1920x1080.jpg?t=1589528167",
    "Slug": "camerabag-pro",
    "Meta Title": "CameraBag Pro: May 6, 2019, Nevercenter and Full Overview",
    "Meta Description": "Looking for information on CameraBag Pro? Check out the release date (May 6, 2019), developer insights from Nevercenter, and a complete game summary.",
    "Alt Text Image": "Official header image for CameraBag Pro game - Steam 1061690",
    "Canonical URL": "https://gusku.site/game/camerabag-pro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CameraBag Pro\", \"description\": \"Looking for information on CameraBag Pro? Check out the release date (May 6, 2019), developer insights from Nevercenter, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nevercenter\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nevercenter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1061690/header.jpg?t=1589528167\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}