{
    "AppID": 1259530,
    "Name": "Cherry Kisses",
    "Release date": "Apr 23, 2020",
    "About the game": "Cerise the gelbeast is the proprietress of Cherry Kisses, a charming little pink sex shop in one of Dewclaw's 'amorous zones'. She loves to make her customers happy, wink wink . Well, she's not really the type to wink; she'll just ask if you'd like to have sex before you go. It's up to you to play through a week running her shop! Cerise is pretty easy-going, so sleeping with customers isn't very difficult, but what will you do when there are more folks around than you have time to deal with? They won't all stick around forever, and the choices you make will ripple throughout the rest of the week. Or you can just not worry about it — there are no bad endings, and you don't have to make everyone happy. But watch out — someone keeps trying to sneak in and ruin everyone's good times... Cherry Kisses has all the features you'd expect from any triple-D titty. I mean, title. Sorry, don't know how that happened. Sex! Talk to characters and then probably do sex with them. Features a variety of genders and body types and kinks, and is pretty upbeat throughout! Kitten mode! If you prefer, you can play with delightful kittens tastefully censoring all the juicy bits! Good for arguing that the game is now 'technically SFW', or for folks who enjoy raunchy stories but not cartoon animal genitals. The text is still disgraceful , though. Metanarrative puzzle! There's only one way to satisfy everyone in a single playthrough, and finding it is a bit of a puzzle. But there are no bad endings, only slightly fewer sex scenes, so feel free to ignore this entirely! The slow, unrelenting passage of time! A couple hours to read through once; half a day to find everything. Maybe. Hard to say for sure; I spoiled myself ahead of time by writing it. Autosave! Every hour on the hour, so you never lose your place and can't savescum! I wonder if there's a way to unlock text skipping? Secrets! Did you see everything? Are you sure ? Do you think we might be the kind of maniacs who'd put effort into making several entire sex scenes, only to squirrel them away in an entire chain of obscure secrets and then not even give you an achievement for finding them because they should be their own reward? Developer commentary! Somewhere. Or nowhere. In-engine trailer! Run the game with --trailer to play through the trailer! I don't know why you would do this!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1259530/header.jpg?t=1587676398",
    "Price": 6.9,
    "Developers": "Floraverse",
    "Publishers": "Floraverse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1259530/ss_373605908ae82343f5ec9c3299ff6a279c749ba0.1920x1080.jpg?t=1587676398,https://cdn.akamai.steamstatic.com/steam/apps/1259530/ss_f7a72a4499f196465d1ca916dbe96232dc0d0c5c.1920x1080.jpg?t=1587676398,https://cdn.akamai.steamstatic.com/steam/apps/1259530/ss_2c45563413d9e1b7f204806adcf71fbffd60c257.1920x1080.jpg?t=1587676398,https://cdn.akamai.steamstatic.com/steam/apps/1259530/ss_ea1889a704c2afcbf51e74c76f01c9eb16429da1.1920x1080.jpg?t=1587676398,https://cdn.akamai.steamstatic.com/steam/apps/1259530/ss_2b7c2ec3a2003704daa27b36cbc292f6536ba78a.1920x1080.jpg?t=1587676398",
    "Slug": "cherry-kisses",
    "Meta Title": "Cherry Kisses: Apr 23, 2020, Floraverse and Full Overview",
    "Meta Description": "Looking for information on Cherry Kisses? Check out the release date (Apr 23, 2020), developer insights from Floraverse, and a complete game summary.",
    "Alt Text Image": "Official header image for Cherry Kisses game - Steam 1259530",
    "Canonical URL": "https://gusku.site/game/cherry-kisses",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cherry Kisses\", \"description\": \"Looking for information on Cherry Kisses? Check out the release date (Apr 23, 2020), developer insights from Floraverse, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Floraverse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Floraverse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1259530/header.jpg?t=1587676398\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.9, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}