{
    "AppID": 1199450,
    "Name": "Dark Raider",
    "Release date": "Jun 5, 2020",
    "About the game": "Dark Raider is a new retro Action game brought to you by the same team that gave you Tribemen. Raid hundreds of dungeons, hack through waves of enemies, and defeat powerful bosses in this new take to the Hack &amp; Slash action genre. New experience every time with random generated map The game uses random maps. The player needs to explore new areas and fight against different monsters every time, the dungeon will reset upon the player’s death. So the player will never do the same run twice. Multiple heroes available, you can always find one that fits you. For now, there are three different heroes available. They are Warrior, Mage and Barbarian. Each of them has their own play style. Warrior focuses on fast attack speed and quick movement, he is the best choice to deal with fast enemies. Mage focuses on burst damage, she is very squishy but once you catch the right time, she can deal a tons of damage. Barbarian focuses on survive, he has higher defense and more health, but he also has the slowest attack speed, which players will need to predict enemies move to make him in good use. Rogue-like playstyle combined with hardcore hack &amp; slash Your characters will become stronger and unlock more abilities during each run. There are varies combos you can use, and you can decide which combo to use to counter your enemies. For example, you can use air attacks to avoid ground damage, you can use counter attacks deal higher damage or use charge attack to deal huge damage. Warrior Mage Barbarian Dark theme dungeon with a unique art style Dark Raider has a unique art style. It uses the modern way to create a retro feeling. It also uses TFR-ISO to make the dungeon more immerse. The player will have a chance to explore this great fantasy world and enjoy their adventure. Game features You can choose from multiple characters, and each of them has their unique play style. Hardcore action combat, you can use various combos to defeat the enemies. Each run, you will grow stronger, and for each character, there are more than 17 different ways to play. Epic boss fight, there are 23 different bosses waiting for your challenge. The unique art style that creates a great dark theme dungeon. Background story Apocalypse has come. It had been prophesied centuries ago, and people all over the world of Ylkis were expecting it, ready to one day face the wrath of the Gods. There is just one problem: each nation has its own pantheon, and every one of them sent their minions at the same time. Now chaos reigns, and the End of Times seemed inevitable. But the Gods seem to have given us one last chance. The Dungeons have opened and hope has been brought back. It is said that for every Dungeon conquered, the world will live another day, and that humanity may prove its worth to the Gods once again. And so the race against time began. Will you save the world from its impending doom, or will you be the one who brought upon its extinction?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1199450/header.jpg?t=1591343240",
    "Price": 0.99,
    "Developers": "UNREAL DARK STUD",
    "Publishers": "Moment Interactive Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_e307270ff549263ee46961fcff58a14a6b6f7b53.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_5b8f9a1dfc1dcbab5ff4185d029e102ab9027011.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_cc151d4ab45ec8c0de8a685f55bdfbf06a6c5459.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_486d6391ba2fdf26beb85f54f4d6b3485e6b2bae.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_3dc0602785799a4b5626e2234a149bd830f85b69.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_6ccb5d4a4c785e15c13a676a4f318179a1c4a01f.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_58f39cfd6fb106259034cf225dd77daf5e67ddb1.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_970335aea4206869eac5913d59b9f204e4676572.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_0bb882e5dc6119c79c9ce5f9122af0598fac85d7.1920x1080.jpg?t=1591343240,https://cdn.akamai.steamstatic.com/steam/apps/1199450/ss_77cca6e7590c5c21a4844afbe6b175292b9bb6a8.1920x1080.jpg?t=1591343240",
    "Slug": "dark-raider",
    "Meta Title": "Dark Raider: Jun 5, 2020, UNREAL DARK STUD and Full Overview",
    "Meta Description": "Looking for information on Dark Raider? Check out the release date (Jun 5, 2020), developer insights from UNREAL DARK STUD, and a complete game summary.",
    "Alt Text Image": "Official header image for Dark Raider game - Steam 1199450",
    "Canonical URL": "https://gusku.site/game/dark-raider",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dark Raider\", \"description\": \"Looking for information on Dark Raider? Check out the release date (Jun 5, 2020), developer insights from UNREAL DARK STUD, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"UNREAL DARK STUD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Moment Interactive Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1199450/header.jpg?t=1591343240\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}