{
    "AppID": 843900,
    "Name": "Demon's Rise - War for the Deep",
    "Release date": "Apr 29, 2018",
    "About the game": "Enter the depths of the ancient city of Angor and prepare for battle. Form a mercenary party of adventurers, sell swords, rogue sorcerers and assassins and enlist with an army of Dwarves trying to retake their ancient homeland. Fight in a brutal campaign against goblins, undead, ratmen and the demon lords they worship. Demon's Rise is a turn-based tactical game where players must lead a party of six heroes through the bowels of an underground city. Battles are intense affairs where the proper use of terrain and cover is as important as the choice of spell or attack. BATTLES: Fight through 85 grueling levels ... a 35 level linked campaign and 50 patrol missions. CHARACTERS: Choose a band of six heroes from 30 playable character classes. Each class has unique strengths, weaknesses and special abilities. REWARDS: Uncover the treasures of the old kingdom ... find gold or thousands of possible weapons, pieces of armour and artifacts. Equip them to make your heroes stronger or sell them off and buy something more fitting. EXPERIENCE: As your heroes fight, they gain experience, level up and unlock powerful new spells and abilities. COVER / TERRAIN: Position is key to victory. Place your heroes behind cover for protection or next to a magical shrine for extra power. MORALE: Your heroes and their enemies may panic when they see the battle go badly or enter a berserker fury if they see an ally cut down. Form a tight battle line where your stronger heroes can lend courage to the weaker ones and use intimidation as a weapon against your foes. ABILITIES: Wizards can launch fireballs, cast protective wards or summon powerful monsters to their aid. Illusionists can trick their enemies into switching sides or make them panic without reason. Mighty warriors can make powerful weapon strikes, become berserk or heal themselves during battle. All 30 player classes and many of the enemies you will encounter can perform such abilities and can use them to turn defeat into victory. Demon's Rise - War for the Deep is a traditional game with NO IN-APP PURCHASES or unfair 'pay to win' mechanics. Victory is earned through courage, strength and tactics and not additional spending.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/843900/header.jpg?t=1525090482",
    "Price": 6.99,
    "Developers": "Wave Light Games Inc.",
    "Publishers": "Wave Light Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/843900/ss_862adb7a6082723cd83d4f5d29fc19e6a261f805.1920x1080.jpg?t=1525090482,https://cdn.akamai.steamstatic.com/steam/apps/843900/ss_76125f4e659a5d480b30816a15b10803ed03eae1.1920x1080.jpg?t=1525090482,https://cdn.akamai.steamstatic.com/steam/apps/843900/ss_8db49921c2e39abd0c7af813087a4bda22e5238d.1920x1080.jpg?t=1525090482,https://cdn.akamai.steamstatic.com/steam/apps/843900/ss_90812c4726637d2974a7ede9d0103b339ad2c893.1920x1080.jpg?t=1525090482,https://cdn.akamai.steamstatic.com/steam/apps/843900/ss_0219ddf086dedabeffaffe778e16a49283e4f8ed.1920x1080.jpg?t=1525090482,https://cdn.akamai.steamstatic.com/steam/apps/843900/ss_791c3c39b6cfae4838f0998e771d787ab235582c.1920x1080.jpg?t=1525090482",
    "Slug": "demon-s-rise-war-for-the-deep",
    "Meta Title": "Demon's Rise - War for the Deep: Apr 29, 2018, Wave Light...",
    "Meta Description": "Looking for information on Demon's Rise - War for the Deep? Check out the release date (Apr 29, 2018), developer insights from Wave Light Games Inc., an...",
    "Alt Text Image": "Official header image for Demon's Rise - War for the Deep game - Steam 843900",
    "Canonical URL": "https://gusku.site/game/demon-s-rise-war-for-the-deep",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Demon's Rise - War for the Deep\", \"description\": \"Looking for information on Demon's Rise - War for the Deep? Check out the release date (Apr 29, 2018), developer insights from Wave Light Games Inc., an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wave Light Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wave Light Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/843900/header.jpg?t=1525090482\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}