{
    "AppID": 1889870,
    "Name": "Detective Max - Double Clues",
    "Release date": "Jun 23, 2022",
    "About the game": "New chapter of Detective Max Mystery games is available now! New criminal case and mystery adventures of detective Max! More than a year has passed since the first murder investigation of detective Max Mystery at Conor High School. Max enrolled at the Faculty of Engineering, although he always dreamed of a career as a detective, like his father. He dove into studying. Life was just getting better, and Max almost forgot about those little detective games. But, suddenly, another unusual death happened in the town... Victim - Sheila Woods, 39 yo, owner of a real estate agency. Was found without vital signs in her office. Sheila left the most curious message—maybe it will be a crucial clue in this criminal case? Can you solve the mystery of this crime? Become a real detective and find out who is the killer! From now on you are a detective! You are about to join an investigation full of evidence, suspects and of course mystery games with the murderer. The suspects are protecting their secrets and clues that lead to the hidden motives! It will surely be challenging to find all hidden objects and clues, evidence and puzzles. The detective game has begun! Forward to an adventure to figure out—who is the killer! Start your investigation by thoroughly examining the crime scene and collecting the first clues. As you play, unlock new locations full of evidence and mystery. Meet the suspects, study their motives and alibis. Look for clues and hidden objects, study the surroundings to restore the events of this detective game. Take a look under every item, explore all the dark corners, reveal the murder mystery of this criminal case! Learn the story of Sheila Woods and finally catch the murderer! Play new offline games about detective Max Mystery for free. What is it This is an offline detective game about a young guy, Max, who happens to be at the scene of the crime investigation. The mechanics of the offline games series is similar to the genres of 'hidden objects', 'point and click', 'adventure escape room'. Despite the realistic image, Detective Max Mystery: Double Clues is a 2D game. That is, movement is possible along arrows and areas with evidence, as in other escape room games. Get ready for a murder mystery game with lots of clues and puzzles that will uncover the plot of this series of detective games. Why would you like Max Mystery detective games Who doesn't like complex detective stories where you can try on the role of a smart investigator? After all, this is such an unusual job—to look for evidence, interrogate suspects, establish their motives, alibis and opportunities to commit the crime! Detective games are a great idea for a pleasant pastime. But it’s so hard to find a really interesting detective game with lots of tricky puzzles and a well-thought-out realistic plot! We make quality offline games that you will love! You will definitely enjoy Detective Max Mystery if you are a fan of hidden objects games, good old mystery games, escape room genre or detective stories. This story will awaken your detective interest in finding out who is the killer of Sheila Woods, and most importantly—Why and How the murderer committed this crime! The aim of the detective games Detective Max Mystery needs your help in finding hidden objects and clues that will help restore the events of that pivotal day in the murder of Sheila Woods. You have to catch the murderer, but it won't be easy! Get ready to solve dozens of puzzles, use your sharp mind, explore many locations and find evidence that will help you in the search for the truth. Be attentive to the suspects, because one of them is a criminal! The real detective will do everything possible to restore justice and determine who is the killer! We make good offline games. There are only 2 enthusiasts in our team with a great desire to create interesting detective games. Thank you for your support! Jam Games",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1889870/header.jpg?t=1655989264",
    "Price": 9.99,
    "Developers": "Ksenia Kolesnikova,Vadim Solonukhin",
    "Publishers": "Jam Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1889870/ss_d4621c8e2ce5b8c86b09148eab1dab36c99e0fcd.1920x1080.jpg?t=1655989264,https://cdn.akamai.steamstatic.com/steam/apps/1889870/ss_41e1fc029f3ecb4e6f4f9b0ce549995d0543a59b.1920x1080.jpg?t=1655989264,https://cdn.akamai.steamstatic.com/steam/apps/1889870/ss_dd02f705c763469e914d49807a267ccb22632863.1920x1080.jpg?t=1655989264,https://cdn.akamai.steamstatic.com/steam/apps/1889870/ss_0624dbfba8544b6e95bf0f3c8d6e29a894bfbe8c.1920x1080.jpg?t=1655989264,https://cdn.akamai.steamstatic.com/steam/apps/1889870/ss_c48f47f6a668f99077fc91ff6d2d9759648203b0.1920x1080.jpg?t=1655989264",
    "Slug": "detective-max-double-clues",
    "Meta Title": "Detective Max - Double Clues: Jun 23, 2022, Ksenia Kolesn...",
    "Meta Description": "Looking for information on Detective Max - Double Clues? Check out the release date (Jun 23, 2022), developer insights from Ksenia Kolesnikova,Vadim Sol...",
    "Alt Text Image": "Official header image for Detective Max - Double Clues game - Steam 1889870",
    "Canonical URL": "https://gusku.site/game/detective-max-double-clues",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Detective Max - Double Clues\", \"description\": \"Looking for information on Detective Max - Double Clues? Check out the release date (Jun 23, 2022), developer insights from Ksenia Kolesnikova,Vadim Sol...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ksenia Kolesnikova,Vadim Solonukhin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jam Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1889870/header.jpg?t=1655989264\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}