{
    "AppID": 687630,
    "Name": "Epic Cards Battle 2 (TCG)",
    "Release date": "Sep 7, 2018",
    "About the game": "3D Free Fantasy Strategy TCG Online Game that you should not miss！Experience the legendary battles with friends and players all around the world now! Official sequel to the amazing strategy game Epic Cards Battle. Features - Dedicated for TCG fans, players who like strategies, PVP lovers or even casual players who simply like the fascination of fantasy games. - Single global server allows you to meet players everyway on the planet. No individual servers divided by countries or due to the server load. If you are the Top players on leaderboard, you are the Top players of the world. - Real-time match making with players near your skill level. Various PVP modes including Classic Mode, Arena and Ladder Matches. Each mode involves complete different strategy and fun. - Solo campaign and tutorials in game let players get hands on the battle rules from easy to hard progressively. Each quest is carefully designed to be a puzzle waiting for you to challenge - Hundreds of nice crafted cards. 3 kinds of card types: Creature, Spell, Trigger. 6 factions: Shrine Alliance, Nature Force, Hell Legion, Fanstiya Empire, Dynasty Rising, Dragon Descendants. Each card in game is unique and useful. Build up your own cards deck to conquer your opponent. - Free-To-Play: The complete rewarding systems enable players to enjoy the fun without spending a penny. - Well designed game systems. Ladder, leaderboards, daily login rewards, daily missions, cards enhancing, battle replays, friends, chat system and so much more. - Amazing game interface, artworks and legendary sound tracks music inspires you while playing. －－－－－－－－－－－－－－ Additional Features - Completely Free To Play, players can get all fantasy items from game for free through the in-game rewards system. - Players who like fantasy, casual games will definitely enjoy it. - Simplified controls, a game for both boys and girls. - One of the best card games in the store. Epic Cards Battle 1 has millions players. - Lots of game modes for PVP players. New Arena system, fair to every player. - More cards in each update. - Build your own unique decks, beat other players with strategy. - Free game that TCG fans will definately like. - Magic, Spells, Monsters and much more. －－－－－－－－－－－－－－ Cards (Creature) Swordsman, Archer, Rogue, Elemental, Amazon, Knight, Enchantress, Crusader, Priest, Tomb-raiding girl, Assassin, Girl Hunter, Princess, Blade Master, King Arthur, Creator, Archangel, Lord of Templars, Dryad, Bear Warrior, Medusa, Elf, Harpy, Centaur Warrior, Storm, Tauren, Lizardman, Master Druid, Unicorn, Werewolf, Treant, Elven Fairy, Phoenix, Goddess , Demon Huntress, Succubus, Butcher, Skeleton, Cyclops, Black Widow, Hellhounds , Troll, Wolf, Duke, Evil Lich, Succubus Queen, Devil's Daughter, Reaper, Godfather of Demons, Evil Athena, Hero, Sweety Pirate, Loli, Alice, Violent Maid, Kitty Girl, Kendoka Girl, Hot Ninja, Joker, Junior Sorceress, Mermaid, Fox, Santa Girl, Adorable Bunny Girl, Seducer, Orochi, Dragon Slayer, Banshee, Dragon General, Dancer, Moonlight Maiden, Blade Squire, Magic Addict, Mother of Dragons Cards (Spell) Healing, Archangel's Courage, Blizzard, Storm Hammer, Arcane, Blessing, Meteor, Power of Wizards, Elves Seduction, Energy Twister, Path to Graveyard, Death Tower, Hell Fire, Shadow Bolts, Wrath of Bahamut Cards (Trigger) Blade Shield, Trap Detection, Frost Trap, Overpower, Divine Barrier, Magic Overwhelm, Goddess' Favour Vengeance, Shadow Assault, Shadow Shield, Abyss, , Philosophers, Dragon Eggs",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/687630/header.jpg?t=1567675992",
    "Price": 0.0,
    "Developers": "momoStorm Entertainment",
    "Publishers": "momoStorm Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_005b7c8e9557caf731b34afb3715376b8109c4bd.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_86702fe78134aa8f8a5474958daa0acf73690f6e.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_2b5b41b7706af721375c82be771bba922d492855.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_a5ed21713aaf86b1ff527f8e0a3f68482471999b.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_3437a0623df6652c70aba4589e101d9abacf5ada.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_5a53ae7eacaa8eecb1aeeef24fed9e1932b2efc3.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_60c39dd65e24bbbb416085a03ca60ddb127d3695.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_07354b15b2153f4885124caa548d7f91c932bafd.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_38b9b373ebdc7cc7e1dbc2a7c8d6d1576c7e3ec1.1920x1080.jpg?t=1567675992,https://cdn.akamai.steamstatic.com/steam/apps/687630/ss_60e88b281c53c42c2f56cb053ca65b65bc1aa3ef.1920x1080.jpg?t=1567675992",
    "Slug": "epic-cards-battle-2-tcg",
    "Meta Title": "Epic Cards Battle 2 (TCG): Sep 7, 2018, momoStorm Enterta...",
    "Meta Description": "Looking for information on Epic Cards Battle 2 (TCG)? Check out the release date (Sep 7, 2018), developer insights from momoStorm Entertainment, and a c...",
    "Alt Text Image": "Official header image for Epic Cards Battle 2 (TCG) game - Steam 687630",
    "Canonical URL": "https://gusku.site/game/epic-cards-battle-2-tcg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Epic Cards Battle 2 (TCG)\", \"description\": \"Looking for information on Epic Cards Battle 2 (TCG)? Check out the release date (Sep 7, 2018), developer insights from momoStorm Entertainment, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"momoStorm Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"momoStorm Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/687630/header.jpg?t=1567675992\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}