{
    "AppID": 665680,
    "Name": "Fighter Creator",
    "Release date": "Aug 2, 2017",
    "About the game": "VERSION 4.5 SCRIPTING CHANGES The script creation process has been completely redone, allowing you to type in the functions instead of having to click through menus, significantly cutting down the time it takes to program your game. EXAMPLE PROJECT This version of Fighter Creator includes an example project to help you quickly get acclimated to using the engine. Includes: Menus - Title Screen, Options Menu, Character Select Menu, Stage Select Menu, Game Heads Up Display, and Loading Screen. Game Modes - Arcade, Versus, and Practice Mode. One Character - With basic a.i. included. ENGINE DESIGN Fighter Creator utilizes a scripting system that allows users to have complete control over their projects without having to know or learn any programming languages. Basically programming concepts have been wrapped up into easy to understand functions, making the engine more powerful and keeping it easy to use at the same time. Fighter Creator also doesn't have any built-in game systems like character attributes, damage and attacks systems, etc. Because all of these system can be built from scratch to work exactly the way you want and be shared with other users, encouraging new concepts, creativity, and community interactions. DEVELOPMENT TOOLS Fighter Creator provides a series of tools to build your game piece by piece: Media Management Import sprites, audio, and videos, or rip sprites from sprite sheets in the editor for use in your projects. Supported Image Formats - PNG, BMP, JPG, DDS, TGA Supported Audio Formats - OGG, FLAC, WAV, MP3, AIFF Supported Video Formats - AVI, MOV, QT, MPG Data Management Variables are used for storing and retrieving data needed to develop game systems. Whether you are building a stage, designing a cinematic, or setting up a special effect, objects are used to display any sprites on screen. Script Management Scripts add functionality to every aspect of your games. Loading/Unloading resources, creating attacks for characters, and configuring game modes all require scripts to make possible. Predefined Scripts can also be created to work as a template for creating an additional set of scripts, drastically speeding up the process. Menu Editor Design your own title screens, character/stage selection screens, heads up displays, and whatever else you may need for your game. Stage Editor Create large, multi-layered stages for players to fight in. Add hazards, destructible objects, secret areas, and more. Special Effect Editor Setup scripted events to display intros and outros for your characters or progress your game's story. Easily create amazing, detailed explosions that can damage other players or trigger special stage events. Save File System Allows your games to save data so that you could add support for features like unlockable characters and story modes. FEATURES 4K Ultra HD Fighter Creator can scale up or down to any 16:9 display resolution, meaning you can focus on building your games and be assured it will look just they way you want it to at 720p to 4K. You can also setup your games to use different assets depending on the selected resolution. Sprite Upscaling &amp; Detailed Image Manipulation Upscale your game's sprites to higher resolutions without adding unnecessary artifacts and pixilation. You can also change the look of these sprites by using an extensive set of image filters. Post Processing Color Grading and Bloom effects allow you to dramatically alter the way your games looks in real-time. STANDARD EDITION Grants you the ability to export any projects and resources created by you for non-commercial use. Games will also include a Fighter Creator splash screen when they start up.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/665680/header.jpg?t=1536432911",
    "Price": 4.99,
    "Developers": "CSGAMES",
    "Publishers": "CSGAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_f3ad50353500c52efdb896b811182638eccd5783.1920x1080.jpg?t=1536432911,https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_c38fe21ba0b4e943183c1a9b60a221a76bd76333.1920x1080.jpg?t=1536432911,https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_d9c86dd083a4b94fa5242ad1a2c01fec447dae06.1920x1080.jpg?t=1536432911,https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_3305e3523a38b13888177dec7d582ad356785f9d.1920x1080.jpg?t=1536432911,https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_67ceb29573f0806d3e540f3bd07daffd9b41d0c8.1920x1080.jpg?t=1536432911,https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_fb6e7c5dfdf539e0cdce60d9fd365e1dde053f44.1920x1080.jpg?t=1536432911,https://cdn.akamai.steamstatic.com/steam/apps/665680/ss_0a384614714649eff7b61551e608961a94dc2c12.1920x1080.jpg?t=1536432911",
    "Slug": "fighter-creator",
    "Meta Title": "Fighter Creator: Aug 2, 2017, CSGAMES and Full Overview",
    "Meta Description": "Looking for information on Fighter Creator? Check out the release date (Aug 2, 2017), developer insights from CSGAMES, and a complete game summary.",
    "Alt Text Image": "Official header image for Fighter Creator game - Steam 665680",
    "Canonical URL": "https://gusku.site/game/fighter-creator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fighter Creator\", \"description\": \"Looking for information on Fighter Creator? Check out the release date (Aug 2, 2017), developer insights from CSGAMES, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"CSGAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CSGAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/665680/header.jpg?t=1536432911\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}