{
    "AppID": 940800,
    "Name": "Gnomes Garden: Christmas Story",
    "Release date": "Dec 11, 2018",
    "About the game": "All the people of Gnomeland were preparing for a double celebration – Christmas alongside the triumphant coronation of the princess. Preparations marched on day and night in the castle courtyard. A troll lived nearby, and the constant sawing and hammering disturbed his rest. Angered, he and his henchmen stole the Christmas tree. The old gnome Elvenar brought this news to the princess while she was sipping lemonade and redesigning the landscape to make it look more Christmassy. “What do you think, Elvenar, should I redesign the garden, or should I focus more on the main square? On the one hand the townspeople can have picnics with their neighbors in the garden, neighborhood games, walk their dogs, and I’d be able to go there with my pussy cat. On the other hand, the main party will be in the square...” “Your highness, about that – the people are greatly disturbed by the theft of the main Christmas tree and all the gifts from the square!” “What!? Who dared to do that?” Then the princess swore to return what was stolen and set off with her loyal friends in search of the Christmas thieves. Your loyal subjects need your help! Join the heroine and her friends on a new adventure through incredible places: a crystal cave, a village of tribal fishermen and many others! Secrets, mystical creatures, mysterious events – all this awaits you in the exciting casual fantasy strategy Gnome Garden: Christmas Story. A multitude of varied quests, over 40 levels, an intriguing plot, simple and entertaining gameplay and an unusual universe await you right now. Grow tree decorations, manage resources and construct buildings regardless of weather and the mercury level. Feel like a kingdom builder and a Caesar among strategists! Be a pioneer and first settler of magical, incredible lands. Help restore tribal villages and towns after disaster and return the spirit of the holiday to the townspeople in the capital of the Gnome Kingdom. Simple game controls and an easy-to-understand tutorial will help you master the basics of the game. Gnomes Garden: Christmas Story – Help the heroes save the holiday! - An unusual magical world whose source of magic is ancient gardens. - An upbeat plot, colorful comics and memorable characters! - A multitude of varied quests that the princess has never encountered before. - Over 40 unique levels. - Unusual enemies: riding bears, trolls and... living Polynesian statues. - 4 unique locations: a country of gnomes, a tropical beach, an icy island and gypsum caves. - Useful bonuses: speed up work, stop time, run fast. - Simple controls and clear tutorial. - Over 20 hours of exciting gameplay for any age. - Pleasant themed music.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/940800/header.jpg?t=1589794147",
    "Price": 14.99,
    "Developers": "Toyman",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/940800/ss_8a22dfd7000a88f735f0004ba57174388d109c61.1920x1080.jpg?t=1589794147,https://cdn.akamai.steamstatic.com/steam/apps/940800/ss_be682704c218177b91b2d0b6f73ce5f9fd21fe45.1920x1080.jpg?t=1589794147,https://cdn.akamai.steamstatic.com/steam/apps/940800/ss_027770f81c812b7b6d5961cb601ce2d9aa780836.1920x1080.jpg?t=1589794147,https://cdn.akamai.steamstatic.com/steam/apps/940800/ss_3c9d95fb0861d16abc263ec4753a94ebd156c04d.1920x1080.jpg?t=1589794147,https://cdn.akamai.steamstatic.com/steam/apps/940800/ss_36082e204813d28e8686835b7ea1b360ea54fc8e.1920x1080.jpg?t=1589794147",
    "Slug": "gnomes-garden-christmas-story",
    "Meta Title": "Gnomes Garden: Christmas Story: Dec 11, 2018, Toyman and ...",
    "Meta Description": "Looking for information on Gnomes Garden: Christmas Story? Check out the release date (Dec 11, 2018), developer insights from Toyman, and a complete gam...",
    "Alt Text Image": "Official header image for Gnomes Garden: Christmas Story game - Steam 940800",
    "Canonical URL": "https://gusku.site/game/gnomes-garden-christmas-story",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gnomes Garden: Christmas Story\", \"description\": \"Looking for information on Gnomes Garden: Christmas Story? Check out the release date (Dec 11, 2018), developer insights from Toyman, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toyman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/940800/header.jpg?t=1589794147\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}