{
    "AppID": 1870370,
    "Name": "怀旧版三国志Idle RPG",
    "Release date": "May 11, 2022",
    "About the game": "The classic Warring States period as the prototype of the placement of hanging machine class game, the original flavor of the restoration of the Three Kingdoms Warring States period of heroes, skills, magic treasures, heavenly books and enemy troops. The classic cross-board action and placement of hanging machine gameplay combined, you can experience the excitement of the Qing version of the year, but also easy to enjoy the game of leisure. On-line that send V15, tens of thousands of yuan treasure, and 20,000 recharge cards and so on you receive! In the world of the Three Kingdoms reigning in the wind, enjoy all the glory and wealth! ◆Lots of benefits◆ The first thing you need to do is to give away 60,000 yuan, and you will get a lot of yuan to fight in the BOSS, break through the levels, and complete the tasks, totaling over 200,000 yuan! Upgrade and you can receive game recharge bonus, a total of 20,000 yuan of bonus. Gameplay National Forces 1. Players can choose to join any country in Wei, Shu and Wu 2. Can participate in the fight for the king, get a lot of rewards 3. Can participate in killing the king BOSS, the rewards are very rich 4. Participate in the Southern War, according to the ranking of a large number of yuan treasure can receive 5. Reputation store can be exchanged for various elixirs to increase attributes BOSS Battle 1. Personal BOSS: the player's own BOSS, drops ordinary equipment 2. National BOSS: All players can participate in the grabbing BOSS, with a probability of dropping red equipment Copper Bird Terrace 1. The higher the number of levels you pass, the more generous the reward 2. You can get copper coins and resources to upgrade the treasure system One Rider One Thousand 1. Enemies are constantly coming out, and rewards will be given according to the number of waves killed 2. The main output is experience, coins, star souls Seven Capture Meng Huo 1. Open daily from 9:00-22:00 2. Different reincarnation levels correspond to different strengths of Meng Huo 3. After Meng Huo is killed, all players participating in the event will be rewarded. The last hit player will get an extra reward 4. Rewards will be given according to the ranking of the total damage to Meng Huo 5. You can get pieces of divine clothing and peerless precious jade Demon God Lu Bu 1. 3 times a day will open this activity 2. A total of 3 bosses, Lu Bu, the real Lu Bu, the magic god Lu Bu 3. After each BOSS is defeated, players who participate in the event will receive rewards. The last hit player will get extra reward 4. Rewards will be given based on the total damage to Meng Huo 5. You can get a lot of Yuan Bao and other rare resources Longzhong Pair 1. Open daily from 12:00-22:00 2. 20 questions in total, ranked according to the number of correct answers to give rewards 3. You can get resources such as divine skill books Young master escort 1. Open at any time throughout the day 2. You can choose five qualities of the escorted generals, the higher the quality of the reward the more rewarding 3. 3 escort opportunities and 3 opportunities to intercept others every day 4. Can get a lot of resources to improve equipment attributes Xu Tian Roundup 1. Open all day long 2. You can participate 3 times a day, you can also buy additional times 3. After opening the hunt, you will get a fixed number of bows and arrows, each time you shoot a prey, you need to consume a bow and arrow, and you have a chance to get the prize from the prey 4. This place produces various rare mounts' fragment resources Game system ◆General system◆ Whether it's the Five Tiger Generals, the world's best Lu Bu or the wise Zhuge Liang and Sima Yi can be recruited. Each general has its own unique skills and moves. All of them are 100% perfect reproduction of all the moves on the arcade! ◆Skill system◆ Each general has three general skills and one divine skill. The normal skills need to be upgraded by consuming bronze coins, and the divine skills need to be upgraded by consuming special materials. The skill level of all generals will always remain the same, so you don't have to worry about the skill level dropping after the generals are replaced, you can feel free to upgrade your skill level. ◆Forging system◆ The system of strengthening, gems, star-raising and soul-casting are the main ways to improve the player's strength. In the game there will be a large number of resources released for free, a large number of strengthening stones, advanced gems, etc. can be obtained through a variety of benefits. ◆Treasure system◆ As with the arcade version of the Three Kingdoms Warring States, there are a variety of treasures that can be obtained and used in battle. There are various types of treasures that can deal damage, restore blood, restore anger and so on. Players can choose two treasures to carry on their body and use. ◆Tenshu system◆ After equipping the heavenly book, you can get new skills in the battle. There are as many as a dozen types of heavenly books that can be acquired in the game. ◆The divine sword system◆ The acquisition of various divine weapons can give the player's attacks with special damage effects. Currently there are close to 20 divine weapons that can be obtained, including the mythical sword divine weapons such as Ganshang Mo Xie and Tai Ah Chi Xiao.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1870370/header.jpg?t=1654838865",
    "Price": 0.0,
    "Developers": "Three Kingdoms",
    "Publishers": "Three Kingdoms",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_ef28e0779c5cc0609b75d02fa2dd0520c336aac1.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_3b079f4c1c050b21af397e4fc61c7cfa4fcf1e8d.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_f66151c0b913aa03d07cce80c50e43ca174b6bf7.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_c60a2d4ad6016a45dab877a3be468f193b98d456.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_449aaf4604aafbb66fa77ef86b2497ff2c6de0f6.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_cf12b3a863aa70e8f602d5a79102c24a9d073726.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_c17ea792fd9a302111eb6aaf5f919a5fd227d25f.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_1a9c48205921b8f1bedfe1f64670d983d0d63865.1920x1080.jpg?t=1654838865,https://cdn.akamai.steamstatic.com/steam/apps/1870370/ss_86f1f5f9998b5cae85c9ba5f30ee2560ea2cdcc0.1920x1080.jpg?t=1654838865",
    "Slug": "idle-rpg",
    "Meta Title": "怀旧版三国志Idle RPG: May 11, 2022, Three Kingdoms and Full Ove...",
    "Meta Description": "Looking for information on 怀旧版三国志Idle RPG? Check out the release date (May 11, 2022), developer insights from Three Kingdoms, and a complete game summary.",
    "Alt Text Image": "Official header image for 怀旧版三国志Idle RPG game - Steam 1870370",
    "Canonical URL": "https://gusku.site/game/idle-rpg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6000\\u65e7\\u7248\\u4e09\\u56fd\\u5fd7Idle RPG\", \"description\": \"Looking for information on \\u6000\\u65e7\\u7248\\u4e09\\u56fd\\u5fd7Idle RPG? Check out the release date (May 11, 2022), developer insights from Three Kingdoms, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Three Kingdoms\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Three Kingdoms\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1870370/header.jpg?t=1654838865\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}