{
    "AppID": 1372300,
    "Name": "Iwaihime",
    "Release date": "Oct 23, 2020",
    "About the game": "I envy you the privilege of dying. Curse your powerlessness, and leave us. From the pen of hit writer Ryukishi07, the creator of When They Cry , comes a story on the theme of “curses.” Characters brought to life with delicate skill by manga artist and illustrator Kazuharu Kina are set against atmospheric backgrounds from the fantastic mind of environment artist Mocha. This supernatural horror visual novel—a tale of sin, retribution, and penance—is available now for the first time outside Japan. This new international release includes scenario adjustments and CG improvements from the prior console re-releases, bringing to PC the writer's preferred rendition of the tale. Story Each generation, the sons of the Susuhara family strike out on their own when they reach the right age. Self-reliantly they refine their minds and their bodies, until at last they become men. Suzumu has prepared for this day for a long time, learning the skills that he will need. Living alone, he attends Susuda Prefectural High School. He should have joined as a freshman, and not as a transfer—but he was delayed. His days are not only easy but pleasant. In his Class 2-A, everyone is having fun. But there's her. Toé Kurokami. She's... certainly a wonder. How else to describe her? She never lets go of the Japanese doll that she hugs constantly to her chest. There are whispers that its hair grows when nobody is looking. That it's cursed. It's no wonder they whisper. That's one creepy doll. That Suzumu's path crosses hers could be fate... Could be? Not “could be.” It's fate. Characters Suzumu Susuhara Voice: Makoto Furukawa The protagonist. Leaving home to improve himself and learn independence, he moves into an apartment owned by the family of his distant relative Tsubakiko. “...I can't just pretend that I don't see you suffering.” Toé Kurokami Voice: Chinatsu Akasaki The only daughter of Iwaimoto Shrine. Her eyes are often vacant and unfocused, and her teachers and classmates alike treat her with a careful distance. “...Stay back... You're corrupted... You can't understand me...” Tsubakiko Harumiya Voice: Mariko Honda A distant relative and classmate of Suzumu's. Their last meeting was so long ago—before elementary school—that the two barely remember each other. Her dream for the future is to be a beautiful bride. “Well, I'm a girl, you know. I work hard every day to be cute as a cute little button!” Kanae Minobe Voice: Yuka Otsubo Technically a year above the others, although she doesn't give off that impression at all. She's laid-back, soft-mannered, and not much for hard work, but she'll invest effort where she expects returns. “I just wanna have an easy life. Oh, boy... Anybody know how to get rich quick?” Riria Nunokawa Voice: Sarah Emi Bridcutt A year younger than the rest, she moonlights as an active member of the idol unit Flower High School. She can come off as somewhat chilly, but she goes out of her way to give back to her fans. “I wouldn't be a high school idol if I couldn't balance school life and work.” Mayu Hinagata Voice: Ryoko Tanaka The school nurse and health teacher. A kindly elder-sister type—with razor-sharp deductive reasoning skills that make her something of a magician with words. Playing advisor to the LCSC's club activities, she keeps the proceedings nice and mellow. “Do community service→Wow, the LCSC is amazing!→So who's their advisor?→I get showered with love!” Natsuya Atsuta Voice: Yuki Tai Suzumu's classmate and greatest friend. Since a certain event, he respects Suzumu greatly. A hothead who loves to say “great!” “That's the great Susuhara for you!” And so... Suzumu Susuhara strikes out his own, and starts attending school with his distant relative Tsubakiko Harumiya. There he meets the unintimidating upperclassman Kanae Minobe. And the high school idol a year below them—Riria Nunokawa. And Toé Kurokami, the mysterious girl who never lets go of her Japanese doll... These meetings set the long hand of fate into motion. Hajakensho —crush evil, and demonstrate the righteous path. But can a mere fist crush a curse?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1372300/header.jpg?t=1615227010",
    "Price": 29.99,
    "Developers": "DMM GAMES",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_e2a61353b6f8c5ab938602b81de4c85e89950f83.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_0649a089d9129afbb4fea2628820c4ef87911513.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_351c5f9b582f3e2180b0eb4fdb22b57ba9f063ba.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_680581b065118ae8ff4138ecb716f942d2fbdb71.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_bdce6fe4ee61ee488e2813ffa69b05c95dc55a62.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_60c99882b954c151fb2c0003f5dc2012b897dab6.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_f91731d1090c4ce2e44ee0f9ccdf42d4ec0a95c2.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_55ad2f0f7af88ddfee69ed44cb88966852c31bb4.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_d5d494f2c7ad04d7c770277e9a8939bd72b81592.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_2fbcd2fa851c3d7ccfee06a14e546f5511289368.1920x1080.jpg?t=1615227010,https://cdn.akamai.steamstatic.com/steam/apps/1372300/ss_2d6d5a2906c665bc4316dba3e4b4e91c048a0b12.1920x1080.jpg?t=1615227010",
    "Slug": "iwaihime",
    "Meta Title": "Iwaihime: Oct 23, 2020, DMM GAMES and Full Overview",
    "Meta Description": "Looking for information on Iwaihime? Check out the release date (Oct 23, 2020), developer insights from DMM GAMES, and a complete game summary.",
    "Alt Text Image": "Official header image for Iwaihime game - Steam 1372300",
    "Canonical URL": "https://gusku.site/game/iwaihime",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Iwaihime\", \"description\": \"Looking for information on Iwaihime? Check out the release date (Oct 23, 2020), developer insights from DMM GAMES, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"DMM GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1372300/header.jpg?t=1615227010\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}