{
    "AppID": 459520,
    "Name": "Kinacoustic",
    "Release date": "May 4, 2016",
    "About the game": "Kinacoustic is a music composition game and a new musical experience. You can control the elements of music by bouncing melodic Drops onto colored Note Lines that you place. In doing this, you can create basic or complex songs - your own composition or a cover. Kinacoustic is full of features that help you create songs and enjoy the game: Rhythm - Sometimes referred to as beat, the pace at which notes are being played. Control this with the Drop Emitters and the Clock. Pitch - A,B,C,D,E,F and G notes in seven different octaves all with their sharp, flat, and natural variants. Control this with the color of the lines you draw and the length of them. Tone Color - The type of instrument playing the notes. Control this with the type of Drop Emitter you use. In Kinacoustic there is Workshop support (Sound Pack support). So you can add other people's Sound Packs to your game, directly from the Steam Workshop. Or if you are tech savvy you can make your own and upload if you like. Dynamics - The volume at which a particular note is being played. Control this by making the lines thinner and thicker. Sustain - How long a note is being held. Control this by creating a Sustain Orb. Whatever passes through a Sustain Orb has it's Sustain changed to the value on the Sustain Orb. Drag Box Tool - Use this to copy and paste chunks of a song and move it. Global Gravity - Adjust the Rate at which all the drops in the scene fall at. Clock controls - So players can better control Rhythm. PDF Manual - A manual to guide you through all the intricacies of the game. In Game Tutorial - Teaches you the basics while you create the beginning of the popular nursery rhyme Twinkle Twinkle Little Star. Fully Resizeableable Game Window - Great for looking at sheet music and the game simultaneously. Even on cramped screens. Platformer Mode - Tired of composing? Turn on Platformer Mode to run and jump on your placed lines. Even create full 2D platform levels with some of the special lines to add diversity. Steam Workshop Integration - Seamlessly subscribe to user-made content or upload your own to the Steam Workshop for the world to see. Steam Trading Cards - Play the game to unlock cards you can trade on the community market or with friends. So what are you waiting for? Pick up Kinacoustic and start Kina-Composing today.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/459520/header.jpg?t=1600586607",
    "Price": 9.99,
    "Developers": "Maithonis Studios",
    "Publishers": "Maithonis Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/459520/ss_eb293e0a6a91b3e5abfe0fd9f276b8eec882188c.1920x1080.jpg?t=1600586607,https://cdn.akamai.steamstatic.com/steam/apps/459520/ss_6b558dc306589722d2242fe25cd22978fbb5dea3.1920x1080.jpg?t=1600586607,https://cdn.akamai.steamstatic.com/steam/apps/459520/ss_ff240dbb9aeadb9bbaf410f7f6b5e435079cae1a.1920x1080.jpg?t=1600586607,https://cdn.akamai.steamstatic.com/steam/apps/459520/ss_6d404ea86d19b7758b7f82fa7f965c596f461739.1920x1080.jpg?t=1600586607,https://cdn.akamai.steamstatic.com/steam/apps/459520/ss_c1e689b8fc2655d73b481d2d29b6653bb5917b4e.1920x1080.jpg?t=1600586607,https://cdn.akamai.steamstatic.com/steam/apps/459520/ss_092fc6c83cd6abea071b11b28ba263e74f796d62.1920x1080.jpg?t=1600586607",
    "Slug": "kinacoustic",
    "Meta Title": "Kinacoustic: May 4, 2016, Maithonis Studios and Full Over...",
    "Meta Description": "Looking for information on Kinacoustic? Check out the release date (May 4, 2016), developer insights from Maithonis Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Kinacoustic game - Steam 459520",
    "Canonical URL": "https://gusku.site/game/kinacoustic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kinacoustic\", \"description\": \"Looking for information on Kinacoustic? Check out the release date (May 4, 2016), developer insights from Maithonis Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maithonis Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Maithonis Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/459520/header.jpg?t=1600586607\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}