{
    "AppID": 1448220,
    "Name": "KONSAIRI",
    "Release date": "Oct 28, 2020",
    "About the game": "Platformer and adventure game Find a root vegetable, hold it up (KONPSI), eat it, throw it, etc, and move on! Adventure in a big world with PICO-8 specs and cute little dots! KONSAIRI is a huge adventure game two years in the making, inspired by classics such as Goonies 2 on the NES® and Metroidvania®. You play as Ruth in a vast world with 15 areas and 7 dungeons to explore, trying to find your way home. To achieve this, you must outwit a lot of virus monsters, become a master of roots, and avoid getting stuck or trapped as you wake up - and help - inhabitants you meet across your journey. To aid you on your quest, you must collect and utilize a large group of root vegetables that you come across marked by glowing parts on the map. On you discover a root you can yank it from the ground, add it to your inventory and cook up some cool skills. Be sure to replenish your own energy by eating plenty of veggies or throw them against viruses blocking your path. Waking up sleeping inhabitants opens up new areas in addition to restoring critical energy. You can sow seeds and emit skills using items that you collect; BEETs, for example, wakes up NPCs or increases vitality. GARLIC gives you short-term invincibility, POTATOs allow you to reach otherwise inaccessible areas, while PARSNIP makes you move faster and even has the benefit of controlling the direction of the wind. KONSAIRI is more than a platform game, it is also a dungeon crawler. You enter the dungeons about halfway through the game and you will need to discover clues and arrange the order of the bells in a certain way from the inhabitants to discover an exit from each area. Timing is a factor and parts of the map must be unhidden as you play. The dungeon crawler section of the game takes a significant time to complete and is very fun and challenging. KONSAIRI is a clever puzzle adventure and dungeon crawler that is suitable to retro-fans and players of all ages and experience levels. Your key to success is to learn the maps, master the veggies and help NPCs out of their dormant state. In return, they will help you progress! KEY FEATURES Retro-Adventuring Plenty of Veggies Cute &amp; Cuddly Characters 15 Areas to Explore 7 Dungeons to Traverse Story The inhabitants have lost their energy and disease has begun to spread. With the power of INARI, Halma uses the art of rice fertility to trade a special MEDICINE with her neighbors. Halma tried to get Ruth to take over INARI as his successor, but she was unable to do so. The inheritance of INARI was too much for young Ruth to focus on as she was too young to carry the load. Ruth came to her old home to distract herself. However, she is attacked by a virus. Ruth escapes and gets lost, but at the same time she wakes up to the 'KONPSI' . Using the power of the veggie with the 'KONPSI', she begins an adventure to return to her own nest while helping the inhabitants. Please read the instructions on the store page! Or you can use our wiki!(Japanese Site) / There is very little help or guidance in the game. If you proceed through the game without realizing the controls or the effects of the root vegetables, you may get stuck. If you are really stuck, do **REMOVE DATA** on the title screen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1448220/header.jpg?t=1656845193",
    "Price": 4.85,
    "Developers": "bitchunk",
    "Publishers": "bitchunk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1448220/ss_e8cfb9f3f6a5088306cd4f551b9db36f5ff0f675.1920x1080.jpg?t=1656845193,https://cdn.akamai.steamstatic.com/steam/apps/1448220/ss_e023a415b8c580da669804e078628247995728aa.1920x1080.jpg?t=1656845193,https://cdn.akamai.steamstatic.com/steam/apps/1448220/ss_a55770df403d8cb09c4710451e2d85218cc0952c.1920x1080.jpg?t=1656845193,https://cdn.akamai.steamstatic.com/steam/apps/1448220/ss_e9ba727f4b6cd0ffaa7009d174cafa2a14a5bb40.1920x1080.jpg?t=1656845193,https://cdn.akamai.steamstatic.com/steam/apps/1448220/ss_cfbecf3aa3b941eb3f1040bc8b36db83f0fa7818.1920x1080.jpg?t=1656845193",
    "Slug": "konsairi",
    "Meta Title": "KONSAIRI: Oct 28, 2020, bitchunk and Full Overview",
    "Meta Description": "Looking for information on KONSAIRI? Check out the release date (Oct 28, 2020), developer insights from bitchunk, and a complete game summary.",
    "Alt Text Image": "Official header image for KONSAIRI game - Steam 1448220",
    "Canonical URL": "https://gusku.site/game/konsairi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"KONSAIRI\", \"description\": \"Looking for information on KONSAIRI? Check out the release date (Oct 28, 2020), developer insights from bitchunk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"bitchunk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"bitchunk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1448220/header.jpg?t=1656845193\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.85, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}