{
    "AppID": 1551570,
    "Name": "Kung Fu Grand King",
    "Release date": "Apr 8, 2022",
    "About the game": "The beautiful dragon beastfolk, Lan Mei, was once known as the highest-ranking martial artist in the land who served the Emperor, and is the hero who ended the kung fu war two years ago. Afterwards, her master tasked her with starting a dojo and taking on an apprentice of her own. Since then, she has been living a quiet, undisturbed life in a small town with her apprentice, a panda beastfolk. Until one day a request from her old master forces her back into the world of martial arts. An evil organization has been recruiting martial artists across the land to carry out a vile scheme! So now, Lan Mei's mission is to enter a grand tournament, thwart the plans of the Organization, and save the Empire! Play as the kung fu legend Lan Mei and take part in a prestigious tournament, where you will fight a series of weird and powerful foes! Instead of standard JRPG combat, Kung Fu Grand King uses a quick time event based system, where you strike at the pressure points of your enemies. But beware! If you're not fast enough, your foes will retaliate and inflict damage on you instead! Outside the tournament, stroll through the Jade Capital and talk with locals to see what they think about the tournament’s developments. Who knows, maybe Lan Mei will turn into a proper celebrity? But like any public figure, you need to watch what you do, or the paparazzi might be on your tail... literally! Eastern-Themed Fantasy Setting Immerse yourself in a world set in ancient China, the land of mysticism and kung fu! This adventure will surely feel fresh! Unique Combat System Use the quick time event combat to strike at the pressure points of your enemies, beating them swiftly and elegantly! Become a Star Whether it's through Lan Mei's performance in the kung fu tournament or her antics in town, she will become a figure known by all! Save the Empire from Evil Take down the underlings of the evil organization one by one, making your way to the Big Bad Kung Fu Master pulling the strings!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1551570/header.jpg?t=1657291431",
    "Price": 12.99,
    "Developers": "Aburasobabiyori",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1551570/ss_3b4052bcf2bd53a3ca412e27f866ecc7a6cafa8d.1920x1080.jpg?t=1657291431,https://cdn.akamai.steamstatic.com/steam/apps/1551570/ss_db9a59e7269ca04d291353d5dee26f4bc22bd109.1920x1080.jpg?t=1657291431,https://cdn.akamai.steamstatic.com/steam/apps/1551570/ss_a5819b71d660898c33c211b1b0d236f297f47218.1920x1080.jpg?t=1657291431,https://cdn.akamai.steamstatic.com/steam/apps/1551570/ss_474935193387655bdde5635e3ac88027ce006244.1920x1080.jpg?t=1657291431,https://cdn.akamai.steamstatic.com/steam/apps/1551570/ss_6b6cd9f0b2e994d81b2ea4a6f393b32bdd4323ea.1920x1080.jpg?t=1657291431",
    "Slug": "kung-fu-grand-king",
    "Meta Title": "Kung Fu Grand King: Apr 8, 2022, Aburasobabiyori and Full...",
    "Meta Description": "Looking for information on Kung Fu Grand King? Check out the release date (Apr 8, 2022), developer insights from Aburasobabiyori, and a complete game su...",
    "Alt Text Image": "Official header image for Kung Fu Grand King game - Steam 1551570",
    "Canonical URL": "https://gusku.site/game/kung-fu-grand-king",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kung Fu Grand King\", \"description\": \"Looking for information on Kung Fu Grand King? Check out the release date (Apr 8, 2022), developer insights from Aburasobabiyori, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aburasobabiyori\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1551570/header.jpg?t=1657291431\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}