{
    "AppID": 1850400,
    "Name": "LEADING the DEAD",
    "Release date": "Jan 10, 2022",
    "About the game": "Game description Lead the bloodthirsty zombies, smash down the barricades, and take revenge on the foolish people! LEADING the DEAD is a single-player action game where you guide countless zombies with bags full of blood and carrion! Story This is the story of a world that has been overrun by zombies due to a sudden virus outbreak. In order to keep the zombies from invading, the people have built a huge wall that completely covers the city, saving it from extinction. Alex, a researcher who escaped into it, realizes that the virus was created by humans during the development of a therapeutic drug. He announced that the accident had leaked the murder virus and found that the government had taken advantage of the turmoil to wipe it out. ...... But the people don't believe him, and the government banishes him outside the zombie-infested walls as a 'dangerous person who spreads falsehoods and incites the people. Alex despairs at the people's disbelief in his claims and the twisted government, and vows revenge through zombies. ...... Basic Rules Lead the bloodthirsty zombies to smash the barricade that awaits them at the far end of the city and take revenge on the foolish people! But the zombies will attack you without regard. you'll have to avoid their attacks while increasing their numbers and leading them to the goal! Pick up the 'blood bags' that have fallen in the area and throw them at the barricades! The bloodthirsty zombies will attack the barricades and eventually destroy them! Flamethrowers and mobile spinning blades await you in each stage to kill any intruders. Use your determine the timing and avoid them to keep the zombies at bay! Game Flow ～GAME START～ 1.Stroll through the field and collect the 'blood bags'. 2.Use 'flesh' and your own body as bait to bring the zombies to the barricade. Be careful that the zombies don't get killed by the flamethrowers and mobile spinning blades! 3.Throw the collected blood bags at the barricade and let the excited zombies destroy it! 4.The zombies will invade the town and start attacking the inhabitants! ～GAME CLEAR～ Tutorial stage 5-stage tutorial where you can learn how to use each item, how to guide zombies, and how to deal with the special 'tank zombie'! Hone your skills to attack the city with zombies! All 20-stage quest mode This is the end of their peaceful life. Break down the barricades and turn the city into hell by sending an avalanche of zombies!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1850400/header.jpg?t=1644216248",
    "Price": 0.0,
    "Developers": "Owls (国際情報工科自動車大学校)",
    "Publishers": "DATEAPPS 2022",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1850400/ss_2c12398893752df21bc394381fbe90dab67997a6.1920x1080.jpg?t=1644216248,https://cdn.akamai.steamstatic.com/steam/apps/1850400/ss_a7885b538a85c63f4316adf38c5915fedaafb297.1920x1080.jpg?t=1644216248,https://cdn.akamai.steamstatic.com/steam/apps/1850400/ss_f85f55ce305901be8ce6f59402c9bd2c137ff2c0.1920x1080.jpg?t=1644216248,https://cdn.akamai.steamstatic.com/steam/apps/1850400/ss_bf0eb1f3abd31944d195a768298e394f5a3e6ccd.1920x1080.jpg?t=1644216248,https://cdn.akamai.steamstatic.com/steam/apps/1850400/ss_83027dfaa9fafae18c1a5e3592eb41fe185d9b9e.1920x1080.jpg?t=1644216248,https://cdn.akamai.steamstatic.com/steam/apps/1850400/ss_26efe03a893d47c19f3d256dc3a7f2975490ccd5.1920x1080.jpg?t=1644216248",
    "Slug": "leading-the-dead",
    "Meta Title": "LEADING the DEAD: Jan 10, 2022, Owls (国際情報工科自動車大学校) and F...",
    "Meta Description": "Looking for information on LEADING the DEAD? Check out the release date (Jan 10, 2022), developer insights from Owls (国際情報工科自動車大学校), and a complete game...",
    "Alt Text Image": "Official header image for LEADING the DEAD game - Steam 1850400",
    "Canonical URL": "https://gusku.site/game/leading-the-dead",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LEADING the DEAD\", \"description\": \"Looking for information on LEADING the DEAD? Check out the release date (Jan 10, 2022), developer insights from Owls (\\u56fd\\u969b\\u60c5\\u5831\\u5de5\\u79d1\\u81ea\\u52d5\\u8eca\\u5927\\u5b66\\u6821), and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Owls (\\u56fd\\u969b\\u60c5\\u5831\\u5de5\\u79d1\\u81ea\\u52d5\\u8eca\\u5927\\u5b66\\u6821)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DATEAPPS 2022\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1850400/header.jpg?t=1644216248\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}