{
    "AppID": 656690,
    "Name": "Medieval Steve",
    "Release date": "Sep 20, 2018",
    "About the game": "You play as Steve, the wizards apprentice. You have been imbued with abilities and super strength; not bad for a once, rusty pile of armour! You must battle your way through the varying levels, collecting the broken shards of what we once called home. Along the way, you will encounter enemies from other dimensions, that are interested in one thing and one thing only.....to destroy what's left of the world. The world needs a hero. Can you be that hero? Medieval Steve plays like the classic side-scrollers of the past. Simple controls, predictable enemies and collectables galore. You will feel like you are playing on a Master System.....but, the graphics are better......and you have more than 2 buttons.....and....well, OK, it won't be anything like a Master System, but, it's still fun! You control Steve through 5 different worlds, starting with the bread and butter of any side-scroller; the lush, green grass levels, proudly dubbed, 'The Grasslands'. There's traps, loads of enemies, levers to touch, switches to squeeze, everything you would ever want! Throughout the game, there are a number of different collectables; the main one being the blue gems, which are the magic holding the worlds together. Steve must collect these blue gems in order to progress through the levels ahead. Here are the collectables in the game: Blue Gems - required for progression and for acquiring upgrade points (see upgrades) Green Gems - Replenish lost health (only from the main health bar, additional life mods are not replenished) Hand Token - Steve can turn into a hand (yes, I know, I could have chosen a dinosaur, I went with a hand, deal with it!) Secret artefacts - Collect all of these to unlock a secret at the end. I can't tell you what it is, that's the whole point of secrets! Along with the collectable items, Steve will be be awarded with a rating per level. This rating will be given out of 3 stars; Steve can earn 0,1,2 or 3 stars. These stars in turn allow Steve to add upgrades to his abilities. As mentioned above; the better you do in the levels, the more upgrade points you will have to spend on upgrading Steve's abilities. His abilities are: Jump Number - Initially, Steve can only jump once, before landing. This can be upgraded all the way to triple jump! Gem Attraction Radius - When starting out, in order to collect the gems, you will need to hit the very centre of the gem; however, this upgrade creates a collection circle around the gems, making it soooo much easier to collect them. Hand Time - Remember when I said you can turn into a hand? You can only be the hand for a short amount of time. This upgrade, increases the number of seconds you can be the hand Health - Kind of obvious, but, I will explain anyway. You can add more starting health to Steve, taking him from 100% to 200%. Simple. Smash Radius - This is the area in which enemies can be killed by the Super Smash. The more you upgrade this one, the larger the the blast radius is, meaning more damage to more enemies, further away. Nice and simple.....SAVE THE WORLD!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/656690/header.jpg?t=1572340959",
    "Price": 12.99,
    "Developers": "JForth Designs",
    "Publishers": "JForth Designs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_e9449b1713df3723a1048991c1a041fe240b9c6e.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_0d76caeff72a03686ff7e770b3327396381df0a1.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_3626b1e714941a139f32851e88e545d05cada9d6.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_0247fdc71b3cbc39cd306f8ba047de058960936b.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_6cf9e23227dd9b7c8b1df71f42b106d4263121db.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_197af56dce855ce2cb8096776ec2251f8f219137.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_9a31ab24a84fa346b2526d746909562db72ec17a.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_fd6375787a1b70bc29398f12675dac4d779a7cc9.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_566bad54a318396f4c61fac47d440c017d0d0805.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_57052d451dd4a06ebb493da16eade802131989c4.1920x1080.jpg?t=1572340959,https://cdn.akamai.steamstatic.com/steam/apps/656690/ss_3bc90e0b6d9f6e07397328e896bfff56c4779571.1920x1080.jpg?t=1572340959",
    "Slug": "medieval-steve",
    "Meta Title": "Medieval Steve: Sep 20, 2018, JForth Designs and Full Ove...",
    "Meta Description": "Looking for information on Medieval Steve? Check out the release date (Sep 20, 2018), developer insights from JForth Designs, and a complete game summary.",
    "Alt Text Image": "Official header image for Medieval Steve game - Steam 656690",
    "Canonical URL": "https://gusku.site/game/medieval-steve",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Medieval Steve\", \"description\": \"Looking for information on Medieval Steve? Check out the release date (Sep 20, 2018), developer insights from JForth Designs, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"JForth Designs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JForth Designs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/656690/header.jpg?t=1572340959\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}