{
    "AppID": 1946840,
    "Name": "Midway:Sink the Japanese Aircraft Carriers",
    "Release date": "Apr 20, 2022",
    "About the game": "To info: Since you closed the comment, I can only reply to your comment here. 1.Sink the Japanese Aircraft Carriers' is basically a kamikaze pilot simulator. Sure, you might be sinking Japanese Aircraft, but the dive-bomb method is the same. I feel very shocked and disturbed by your comments here. The Kamikaze used their planes as bombs to fly directly into an American aircraft carrier, a very crazy, inhuman form of fascist warfare. And the kamikaze pilots will die. Dive bombers are the normal way bombers drop bombs. The pilot could have survived. I'm sorry you're conflating the Kamikaze with the Americans who fought in world War II. 2.No speed control When you are flying in a dense group of aircraft, it is dangerous to change speed. Because you could totally crash into another plane or get hit by another plane. When you dive, you reach top speed very quickly and you can't go beyond that speed because the pilot can't control a plane that's going too fast. So speed control is not needed. The plane in the game peaked at 115 meters per second, which is very close to the actual historical figure I found: 120 meters per second. 3.No guns The dive bomber's weapon was a 1,600-pound bomb. Trying to hit an aircraft carrier with a gun, the pilot went crazy? 4.It's shallow, pointless and unless you cheat and go your own way it is pretty much impossible to play! I have said in the introduction, the Japanese artillery fire is very fierce, be careful. In fact, the death rate of real dive-bomber pilots is also very high. Just think how dangerous and difficult it must have been to dive at high speed into the face of Japanese anti-aircraft fire, both following the carrier and avoiding it. If you find the game really hard, here's a solution: 1. Turn on the height display; 2. Dodge left or right at all times. Do not fly in a straight line. 3. Drop down to between 800 and 600 meters, pull up your aircraft, fly over the carrier and drop the bomb. Remember: always change your direction of flight, like constantly trying to turn left or right, never fly in a straight line. I really hope you find the above method, or something equally effective, on your own. Isn't that the fun of the game? 5.Add to that there is only one mission My game title and introduction are said, this is a sinking of the Japanese aircraft carrier game. Simple, but fun. 6.no score Drop the bomb on the aircraft carrier, the game will pass a level, give 100 points; If not, give a zero. I don't see the point in giving this grade. Because the game is as simple as failure and success. 7. no replay value at all! The fun of the game is to maneuver your aircraft, dodge the Japanese bullets, fly over the aircraft carrier, drop the bomb and blow it up in fear of being torn to pieces by the Japanese at any moment. I feel bad that you don't like my game. You can ask customer service for a refund, leave your dollars, and go buy your chocolate. That's your right. Please don't hesitate. 8.Do checkout my gameplay video with the sound turned down to 30% of what it is in the game! I'm not sure what you mean. Maybe you thought the explosion was a little loud? Or are there too many explosions that don't mix well enough? Or when you record a video, the audio sample is not high enough and the sound is not clear enough? It doesn't matter. I'll modify the audio of the explosion. A new version will come out soon. The game has five levels. The first scenario is to fight a carrier without the escort of anti-aircraft destroyers, and the rest are to fight a carrier with the escort of one to four anti-aircraft destroyers. As the number of anti-aircraft guns increases, the game becomes more and more difficult.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1946840/header.jpg?t=1650763952",
    "Price": 0.99,
    "Developers": "KL Game Studio",
    "Publishers": "KL Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_3946e327d5be9b438fe9ecde1cdc826db2eea8b3.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_8b1ab7ef306e9a866c5e965c5ae6e40fcaafbc82.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_ddd66e0923b78634ccd67e50288caefeb58ecd78.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_fff9ce54593ccaf1380e9f139e74aebbaf41c6dc.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_48ea83dd11e372c9df9e8a3e63075072e51c7a05.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_a4bf918050007d87d0a7cc469daf93ee6561f4ae.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_daa4bbe1a87aaefcdcd865a1589883b7f6068417.1920x1080.jpg?t=1650763952,https://cdn.akamai.steamstatic.com/steam/apps/1946840/ss_82f9bb95218ecefdf17bcce5d4821629bf06e0cb.1920x1080.jpg?t=1650763952",
    "Slug": "midway-sink-the-japanese-aircraft-carriers",
    "Meta Title": "Midway:Sink the Japanese Aircraft Carriers: Apr 20, 2022,...",
    "Meta Description": "Looking for information on Midway:Sink the Japanese Aircraft Carriers? Check out the release date (Apr 20, 2022), developer insights from KL Game Studio...",
    "Alt Text Image": "Official header image for Midway:Sink the Japanese Aircraft Carriers game - Steam 1946840",
    "Canonical URL": "https://gusku.site/game/midway-sink-the-japanese-aircraft-carriers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Midway:Sink the Japanese Aircraft Carriers\", \"description\": \"Looking for information on Midway:Sink the Japanese Aircraft Carriers? Check out the release date (Apr 20, 2022), developer insights from KL Game Studio...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"KL Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KL Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1946840/header.jpg?t=1650763952\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}