{
    "AppID": 1342740,
    "Name": "Moose Life",
    "Release date": "Aug 13, 2020",
    "About the game": "A trippy, exhilarating voxel arcade shooter specifically engineered to take you to a happy, tranced-out pleasure zone full of deer and mushrooms. Back in 1994 we created one of the first examples of a new genre of arcade gaming: the trance shooter, with 'Tempest 2000' on the Atari Jaguar. Since then we have been creating software - both games and visualisers - with the specific intent to create in its users a euphoric experience, something that players will return to again and again simply because the act of playing feels so good. Memorable milestones along the way include the Virtual Light Machine lightsynths, the Xbox 360 music visualiser, and games such as Space Giraffe, Gridrunner Revolution, Polybius and the Minotaur Arcade games. In recent years we have been bringing these experiences to the world of VR too. Head-mounted displays are in everyone's future, and we now make everything we create playable in or out of VR as a matter of course. Immersion via a VR headset makes the mood-enhancing, euphoric nature of our games even more effective. Moose Life is the latest step on our journey into euphoric trance. Created in the style of an 80s arcade game, but in fully immersive 3D/VR. You'll feel like you are inside the mind of Eugene Jarvis Himself. The contents of Eugene Jarvis' brain in 1983. You'll start playing to see all the levels and chase scores on the leaderboards, but you'll keep returning simply because it feels absolutely excellent to play. Commodore 64-accurate mutant camels are just some of the ungulates you can summon to your cause.. You play as a rainbow voxel deer battling to rescue tiny sheep from enemy spaceships, but that doesn't really matter. What you're here for is the feeling of zooming into the screen like some cervine Space Harrier, grooving to some tasty bleeps as you shred enemies into lovely colourful bits with a variety of enjoyably destructive powerups. Glowing stags will stream past your ears as you deploy the mighty 'Stag Party' weapon that turns entire screensful of enemies into harmless, grateful deer. You'll smile. You might exclaim when a particularly lovely explosion blossoms nearby, or when the trip starts to kick in as you traverse the mushroom-strewn planes. You will feel *lovely*. Stag Party turns all enemies into deer and releases floating bonus points. Want to access that groovy feeling but not that great at shooters? That's fine - enjoy an unlimited romp through the levels using the 'Free Ride' mode. The most important thing is that you get to experience the uplifting effect of gameplay for as long as possible, and if you want to do that without having to deal with the frustration of running out of lives or worrying about whether your score's any good. Summon cervine helpers and shred the enemies into tiny, glowing bits. If you do want some traditional arcade-style challenge mixed into your euphoria, of course that's there too - go ahead and chase scores in two available challenge modes. Ram enemies to turn them into rainbow stags in Purple Moose Mode.. In Normal Mode, use Llamasoft's tried-and-true Restart Best mechanic to dip into any part of the game you've unlocked at any time in order to put together and build upon your best possible score. In Pure Mode, play a single game from the beginning, and see how well you can do. In both challenge modes Steam Leaderboards and Achievements will record your increasing moosely prowess.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1342740/header.jpg?t=1597308394",
    "Price": 6.99,
    "Developers": "Llamasoft Ltd.",
    "Publishers": "Llamasoft Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1342740/ss_143d6bf3461ace658b84858de772af2347caf0e2.1920x1080.jpg?t=1597308394,https://cdn.akamai.steamstatic.com/steam/apps/1342740/ss_8a4f0f9782c40cfbc7f7162218d69f03f9d209c3.1920x1080.jpg?t=1597308394,https://cdn.akamai.steamstatic.com/steam/apps/1342740/ss_13000e5796f129eda6283f0daab68156ab636e5a.1920x1080.jpg?t=1597308394,https://cdn.akamai.steamstatic.com/steam/apps/1342740/ss_75931ac515ffea13f819f7d90ea5fa86bcc60665.1920x1080.jpg?t=1597308394,https://cdn.akamai.steamstatic.com/steam/apps/1342740/ss_5a39c3fc1be31993bedb09093479e06b6bf28d4f.1920x1080.jpg?t=1597308394,https://cdn.akamai.steamstatic.com/steam/apps/1342740/ss_7f9de76298330ccaf29e53e38c8ed10facbf15ba.1920x1080.jpg?t=1597308394",
    "Slug": "moose-life",
    "Meta Title": "Moose Life: Aug 13, 2020, Llamasoft Ltd. and Full Overview",
    "Meta Description": "Looking for information on Moose Life? Check out the release date (Aug 13, 2020), developer insights from Llamasoft Ltd., and a complete game summary.",
    "Alt Text Image": "Official header image for Moose Life game - Steam 1342740",
    "Canonical URL": "https://gusku.site/game/moose-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Moose Life\", \"description\": \"Looking for information on Moose Life? Check out the release date (Aug 13, 2020), developer insights from Llamasoft Ltd., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Llamasoft Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Llamasoft Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1342740/header.jpg?t=1597308394\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}