{
    "AppID": 894000,
    "Name": "Night of the Blood Moon",
    "Release date": "Jan 21, 2019",
    "About the game": "For too long Skeletons have been on the blunt force receiving end. Give them a break and time to recover by embracing the power of the darkness. Night of the Blood Moon is a difficult Rogue-lite with unique weapons, and charming manifestations. Become the Nightmare and grow your power, by conquering many imaginative lands, and defeat bosses who will challenge your strategy along side your skill. The Setting of Night of the Blood Moon The eclipse is coming, and the blood moon is upon us. It is time for the Three Eyed Raven to rise. From Bedrooms to Castles in the Sky you will control a nightmare and it's arsenal of pets, weapons, and skills. In thde land of dreams creatures take on many forms such as; of instruments, wizards, ninjas, and sea monsters, and more. Weapons Night of the Blood Moon's weapons are more than guns with different attributes. They will completely change the way you play the game, by how you position yourself, and which enemies pose the most threat. Hookshots, Boomerangs, and Spellbooks are the beginning of a growing inventory. Learn to utilize each weapon to reach the true-end. The Dreamy Manifestations Enemies in Night of the Blood Moon work on an orthogonal structure. They vary with speed and range on a full spectrum. Each level in the game has unique creatures which test you in their own ways. Things aren't always as they seem in our dreams, especially these critters. Bosses in Night of the Blood Moon are more than just bullet sponges; Each boss has mechanics which can be overcome through trial &amp; error, and understanding. Pets You'll come across assistance in your escapades. These pets will give you increased attributes as well as passive support. Pets are dreams consumed by the darkness including bats, dogs, nests, and more. Dev Note: I plan on adding at least one pet each month of 2019 for Night of the Blood Moon, and am looking forward to getting more creative with more time on my hands. Eclipse Mode This mode lets you start with nothing, and get stronger until you the engine can't keep up. There are currently no limitations. Buy health, ammo, and unleash a flurry of weapons. Eclipse Mode is my way of letting you destroy the game I worked so hard to build whilst having absolute fun. For Non-Ubuntu Linux users: GameMaker (the engine used) only supports 32-bit graphics for some reason (which Ubuntu supports out of box). From what I've come to understand here are the required fixes: install lib32-openssl or openssl:i386 (depend of your system), and Properties -&gt; Set launch options and LD_LIBRARY_PATH=. %command% Night of the Blood Moon is a game I am incredibly proud of, and excited to share with everyone. Above all I hope you are challenged in a fun and enjoyable way. I'm looking forward to seeing you kick Night of the Blood Moon's butt. Good luck, and have fun. -Tyler McDermott, creator and sole developer of Night of the Blood Moon",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/894000/header.jpg?t=1596836800",
    "Price": 4.99,
    "Developers": "Tyler McDermott",
    "Publishers": "Tyler McDermott",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/894000/ss_918caaed6a74682077e6b03acd8fd59f3f105aac.1920x1080.jpg?t=1596836800,https://cdn.akamai.steamstatic.com/steam/apps/894000/ss_14c4cffa715d4a8dc8841c838ff964acb8cd2070.1920x1080.jpg?t=1596836800,https://cdn.akamai.steamstatic.com/steam/apps/894000/ss_ee4604cc6c52ffcb712422674efa3aa31aafc485.1920x1080.jpg?t=1596836800,https://cdn.akamai.steamstatic.com/steam/apps/894000/ss_92056d136945bf409d5be03db28b055d7f883992.1920x1080.jpg?t=1596836800,https://cdn.akamai.steamstatic.com/steam/apps/894000/ss_4d5de85567c1acfae47952a053a3a5d74c714ba4.1920x1080.jpg?t=1596836800,https://cdn.akamai.steamstatic.com/steam/apps/894000/ss_7f43a78da7b05c4b8c541999cf0095b80cd46e86.1920x1080.jpg?t=1596836800",
    "Slug": "night-of-the-blood-moon",
    "Meta Title": "Night of the Blood Moon: Jan 21, 2019, Tyler McDermott an...",
    "Meta Description": "Looking for information on Night of the Blood Moon? Check out the release date (Jan 21, 2019), developer insights from Tyler McDermott, and a complete g...",
    "Alt Text Image": "Official header image for Night of the Blood Moon game - Steam 894000",
    "Canonical URL": "https://gusku.site/game/night-of-the-blood-moon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Night of the Blood Moon\", \"description\": \"Looking for information on Night of the Blood Moon? Check out the release date (Jan 21, 2019), developer insights from Tyler McDermott, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tyler McDermott\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tyler McDermott\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/894000/header.jpg?t=1596836800\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}