{
    "AppID": 1863460,
    "Name": "Pixel Art School - 今から始めるドット絵入門 -",
    "Release date": "Mar 22, 2022",
    "About the game": "For those of you who are just starting to draw pixel art, I've put together a basic knowledge of pixel art. If you're just starting out, I'm sure you'll be able to improve faster after reading this course! I think it explains the material expression in pixel art in an easy to understand way! (This is my personal opinion, but...) ◆ Hard-to-notice operations ◆ Use the ESC key or the select button on the controller to switch between windowed and full screen. Press F1 to access the system settings of Pixel Game Maker MV. If your controller behaves strangely, you can set it here. ◆ CAUTION1 ◆ This game is designed for people who want to start drawing pixel art. Therefore, it basically explains the expressions and techniques of pixel art. It does not explain the three-dimensional effects and expressions of illustration. If you are in need of such information, I recommend you read other books. In addition, for elements that vary depending on the work and the artist, such as color and style, you should seek and find the information yourself. ◆ CAUTION2 ◆ There are some parts of this game that are blurred out without detailed explanation. This is because we want you to find the answers through trial and error. It is not in anyone's interest to give instructions for these parts. I want to work in dot art! I believe that the ability to derive an answer through trial and error is necessary for such people. I hope that you can understand my intention. Now, let's explain each item a little bit. ◇ Before you start drawing Pixel Art. It explains the number of colors, color palettes, and the importance of layers in pixel art. ◇ Let's try to draw clean lines. It explains how to use anti-aliasing and other techniques to draw clean lines. ◇ Let's draw a character. This page explains how to draw the basic body of a character. It introduces the expression of depth and images of characters of various sizes. ◇ Let's make the character run. Learn how to animate with stick figures, how to use patterns to save time, and more. This article explains how to draw running animation easily. ◇ Let's make the character jump! It explains how to draw character jumping animations, including how to bounce objects. ◇ Unassuming but useful technology. It explains the techniques needed to draw pixel art, including rotational animation and techniques to make it appear to move smoothly. ◇ Material representation in Pixel Art. Explains various texture expressions, including how to draw materials commonly found in games and how to use dithering. ◇ Introduction to Tileset. It explains the tile patterns needed to compose a game screen, how to draw floors and walls, and other knowledge that is important to know when drawing tile maps. ◇ Let's try drawing a Tileset. It explains practical techniques such as how to connect tile maps and how to draw borders with other tiles. Sample game 'Trample Mandrake!' It contains an action game where you just keep stomping on the mandrake. It's a great way to take a break from pixel art school. / / /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1863460/header.jpg?t=1647958604",
    "Price": 11.99,
    "Developers": "KoheiGallery",
    "Publishers": "KoheiGallery",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_2d9d41f4fd1b454955ba8702ba0f6b866826eb10.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_a8c4a3c388e776d09bc6372b3bde2531a4bd05e8.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_69e106fb28e80e154af469d7bd23b2f851f314e6.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_ed1d224f658dace289e9b46d4a8291b61c0efe1b.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_40766d2722e3b0aa06107705cc82a0bef9d97723.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_d28259892a84531e08c46a8cb7bded2132a60b28.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_a0d4855a6333704851e3d8f7da4caf217e7ca60d.1920x1080.jpg?t=1647958604,https://cdn.akamai.steamstatic.com/steam/apps/1863460/ss_18db1e5cd873f2d15c31e0296f8e2d2b999371aa.1920x1080.jpg?t=1647958604",
    "Slug": "pixel-art-school",
    "Meta Title": "Pixel Art School - 今から始めるドット絵入門 -: Mar 22, 2022, KoheiGal...",
    "Meta Description": "Looking for information on Pixel Art School - 今から始めるドット絵入門 -? Check out the release date (Mar 22, 2022), developer insights from KoheiGallery, and a com...",
    "Alt Text Image": "Official header image for Pixel Art School - 今から始めるドット絵入門 - game - Steam 1863460",
    "Canonical URL": "https://gusku.site/game/pixel-art-school",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pixel Art School - \\u4eca\\u304b\\u3089\\u59cb\\u3081\\u308b\\u30c9\\u30c3\\u30c8\\u7d75\\u5165\\u9580 -\", \"description\": \"Looking for information on Pixel Art School - \\u4eca\\u304b\\u3089\\u59cb\\u3081\\u308b\\u30c9\\u30c3\\u30c8\\u7d75\\u5165\\u9580 -? Check out the release date (Mar 22, 2022), developer insights from KoheiGallery, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"KoheiGallery\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KoheiGallery\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1863460/header.jpg?t=1647958604\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}