{
    "AppID": 1910130,
    "Name": "Qwilight",
    "Release date": "Jun 11, 2022",
    "About the game": "Qwilight is a free BMS/BMSON rhythm game that supports the most features among other rhythm games. Qwilight is a casual, online game that is not suitable for those who used to use LR2 and Beatoraja. It is recommended that people continue to use LR2 and Beatoraja. Qwilight provides some default songs. But if you want to enjoy more songs, you must have BMS/BMSON files. If you don't have this, just use built-in note file downloader Supports various rhythm game formats. Basically, supports BMS, PMS, BMSON (24/48 keys). Supports wide variety of game mods. It supports 18 game mods and these can be applied simultaneously. Auto turntable Mirror, Line random, Bar random, Half random, Full random, Twist Fade out, Blink Customization of judgments Customization of life guage 4D, U-turn, Compact Remove release judgment of long notes Modify line count Remove long notes or make all notes to long notes Remove shift Play backwards Add more notes Add indirect Miss Limit the number of concurrent notes Make swipe note (for Windows Touch) Copy 1P to 2P (Double Battle Mirror) Make pattern to DJMAX RESPECT style which is optimized to PS4 or XBOX controller Modify music speed Support wide variety of hardware. It supports keyboard, Windows Touch, DirectInput, XInput, Windows.Gaming.Input, MIDI inputs. It supports RAZER Chroma, ASUS Aura Sync, Corsair iCUE, Ducky One2 RGB feature. It supports ASIO v2.0 It supports more than 1000Hz polling rate keyboard (Up to 8000Hz) It supports up to 4K resolution and more than 60Hz refresh rate without any settings. Online ranking, Online Chatting, Multiplay, Spectator, Voice chat, Bundle It supports IR system to register your best score and compete with other players. Chat room and game room is implemented. So, you can chat with other players or enjoy real-time multiplay. You can watch other player's game in real-time. You can do voice chat with other players in same room. Multiplay and spectator needs matches note file. So, it provides a bundle feature that gives 1GB storage to share note files. Interwork with BMS, BMSON editor. It supports interworking with 3rd-party editor such as BMSE, iBMSC, uBMSC, BmsONE editos. Provides BMS downloader You can download BMS, BMSON note files with legal method by built-in note file downloader. BMS is no longer difficult to start. Course play, Achievements It supports course play that plays multiple songs in a row. You can make a custom course. And, it provides prebuilt-in courses to beat achievements. User customized contents Achievements generator and title generator are provided by official Qwilght discord. You can suggest achievements and titles. These will be accepted with minimal testing. etc. More features such as Custom skin, Download BMS diffculty table, Interwork with webcam, A practice mode with improved auto play, Note density visualizer, Favorites are provided.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1910130/header.jpg?t=1657074521",
    "Price": 0.0,
    "Developers": "Taehui",
    "Publishers": "Taehui",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1910130/ss_2c7fe9f93cb988578aee64b913fa12891159d669.1920x1080.jpg?t=1657074521,https://cdn.akamai.steamstatic.com/steam/apps/1910130/ss_8061b738ec1bc3e84de012d1d06df5825606f383.1920x1080.jpg?t=1657074521,https://cdn.akamai.steamstatic.com/steam/apps/1910130/ss_2cc8bb52daf56d927fd52d34e8ecbc81e1924308.1920x1080.jpg?t=1657074521,https://cdn.akamai.steamstatic.com/steam/apps/1910130/ss_a6c31e51bbf3a5d0d1ca5b7850573317f0dd1412.1920x1080.jpg?t=1657074521,https://cdn.akamai.steamstatic.com/steam/apps/1910130/ss_7e231199b2378c7525d42b69fdd4c8c07f7cd794.1920x1080.jpg?t=1657074521",
    "Slug": "qwilight",
    "Meta Title": "Qwilight: Jun 11, 2022, Taehui and Full Overview",
    "Meta Description": "Looking for information on Qwilight? Check out the release date (Jun 11, 2022), developer insights from Taehui, and a complete game summary.",
    "Alt Text Image": "Official header image for Qwilight game - Steam 1910130",
    "Canonical URL": "https://gusku.site/game/qwilight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Qwilight\", \"description\": \"Looking for information on Qwilight? Check out the release date (Jun 11, 2022), developer insights from Taehui, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Taehui\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Taehui\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1910130/header.jpg?t=1657074521\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}