{
    "AppID": 246880,
    "Name": "Recruits",
    "Release date": "Jul 31, 2014",
    "About the game": "Recruits is a brutal fast paced top down shooter that puts the lives of countless amounts of soldiers in your command. Lead your men to victory and see them progress through the ranks, show them defeat and they will be lost forever. Your role as a commander puts you in charge of managing a platoon of soldiers during the war. Take men into battle one squad at a time to accomplish your missions, along the way gaining experience and respect that allows you to better equip and customize your soldiers. Only by keeping your men alive, gaining medals and awards and defeating an overwhelming amount of enemies can you hope to be victorious during this time in history. Recruits is in ALPHA, meaning that is is currently not finished. DO NOT PURCHASE THIS GAME unless you are happy to contribute to the development and play it with bugs and issues. This game is on Steam so that it can reach a wider audience and players can help contribute to the active development of Recruits. Current Features General Gameplay – Full body dismemberment and gore, weather effects, physics and destruction and time of day lighting effects. Variety of Mission Objectives – Including kill all enemies, destroy all buildings, covert operations and survival situations. Soldier Progression – Permanent death, enlisted rank progression, personal attributes and customizable nicknames and load outs. Special Abilities and Weapons – As a Commander, earn respect points to unlock upgraded weaponry and special abilities such as Airstrikes and Cluster Bombs. Squad Orders – A right click command menu in singleplayer gives you the ability to give basic commands to your squad members. Game Modes – Singleplayer campaign missions, online multiplayer death match and team death match. Controllable Vehicles – Helicopters and Tanks with specifically tailored missions and environments for them. Updates – Updates for fixes and feedback from players to improve the game in all aspects. Future Features More Mission Objectives - Rescue prisoners of war, assassinate enemy leaders and base patrols are just a few. In-depth Soldier Progression – Platoon role stat bonuses, visual soldier customization and more. Special Abilities and Weapons – Larger variety of weaponry and more special abilities including Napalm, Mortar Strikes, Airdrops, Chemical Sprays reinforcements and more. Context Sensitive Command Menu – Greater and more precise control over the squad A.I. Soldier Morale – Events in game effecting the mood and effectiveness of your soldiers in battles. More Game Modes – Introduction of online and local co-op, capture the flag and more. Medals and Awards – Earn special stat boosts by performing heroic events in game. Steam Integration – Steam Achievements. Overall Game Improvements – Bugs and fixes, along with making the game easier to play and understand for all users. This game is still being developed and will always be updated to improve the overall usability. Facebook - Twitter - Youtube -",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/246880/header.jpg?t=1566233489",
    "Price": 9.99,
    "Developers": "Commotion Games Pty Ltd",
    "Publishers": "Commotion Games Pty Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_5611624a4c612540da04765d483705e157b89ad4.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_ceeb8be76a7e991b90915976fd8fbb4e4a9fa231.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_7e19eff3dd502b864eb16303e0cd7c93f9d80414.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_57c253ceb3f5c3852a8d93a94d6be6d6a10f410b.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_59b782a41b23e4cb1bf54d59a8889ded474d8f3d.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_fd22864a1de52d8d89572172fa05777db451a7fc.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_8c6a7327b791b509a052a1cd9055df77853c905e.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_1b49c1980e696ac2d84e04f27b2dfdba05ce43ff.1920x1080.jpg?t=1566233489,https://cdn.akamai.steamstatic.com/steam/apps/246880/ss_07a1795096f2afc4dc9a46d209b0a863479b3f06.1920x1080.jpg?t=1566233489",
    "Slug": "recruits",
    "Meta Title": "Recruits: Jul 31, 2014, Commotion Games Pty Ltd and Full ...",
    "Meta Description": "Looking for information on Recruits? Check out the release date (Jul 31, 2014), developer insights from Commotion Games Pty Ltd, and a complete game sum...",
    "Alt Text Image": "Official header image for Recruits game - Steam 246880",
    "Canonical URL": "https://gusku.site/game/recruits",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Recruits\", \"description\": \"Looking for information on Recruits? Check out the release date (Jul 31, 2014), developer insights from Commotion Games Pty Ltd, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Commotion Games Pty Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Commotion Games Pty Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/246880/header.jpg?t=1566233489\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}