{
    "AppID": 1637910,
    "Name": "Red Algorithm",
    "Release date": "Jun 15, 2021",
    "About the game": "Gameplay It's quite simple. Pick a hero, pick a weapon, and go fight the monsters! Level up and choose new perks to become stronger and kill monsters even faster. Look for bonuses on the map and try to survive as long as you can. Features 100+ perks 9 weapons classes 70+ weapons 10+ weapon upgrades 5 types of consumables 10 heroes 15 monsters 7 possible injuries 7 bionic body parts 13 stats to improve with runes 10 skills to train 50+ achievements Stats Perks The RPG system here is not complicated; you get one new perk every new level. There are many of them, you pick 1 out of random 3 in most cases. Many perks have side-effects that can ruin the whole game if picked for the wrong weapon/hero/build. Some perks are very specific and will benefit you only in a particular situation or with a particular setup. This RPG system is simple, yet it provides a lot of freedom in character building. You can make a tanky man, a fast woman with high DPS, a hero that relies on splash, or try to construct a balanced character that is good for every situation. Weapons You can find a weapon box every few minutes and choose a weapon out of 3 offered randomly. There are many different weapons to choose from. Note that unlike in many other game, here you can pick and attempt to use any weapon, but if weapon's level is higher than the current hero level, you will be penalized. So, try to use weapons which level is suitable for your at the moment, and don't switch them too often , as you will loose gained habit. A weapon can belong to 1 of 9 general classes: Pistols Shotguns SMGs Rifles ARs Plasma MGs Gauss Primitive There are some weapons that belong to more than one class. If you are lucky, you can find a weapon upgrade and pick 1 of 3 random improvements for your gun (more damage, range, faster reload, etc.). Monsters You will face 15 monsters on your journey, with a new type every 2 minutes. Monsters appear out of nowhere, and they are also created by spawners, which you should destroy as soon as possible if you don't want to be overwhelmed. Each monster in the game is unique and has different damage resistance. Some are fast, some are healthy, some can shoot, etc. Heroes Choose 1 of 8 heroes, each with a unique bonus, starting perk, weapon, and a set of consumables (drones, grenades, turrets, first aid kits, and barricades). There are 4 free and 4 premium heroes that you can unlock by purchasing DLCs. Premium heroes are the only non-free feature in the game, and they are not stronger than free heroes. By purchasing a DLC you help to support the game, which was created and is managed by just one indie developer. Long-term progression: Runes and Skills In addition to the levelling up in a particular game, gaining weapon habit, etc., there are also systems of long-term progression that will improve a particular hero forever for every game you play. It can be done with runes, and with skills. Runes can be found during the game and after you can invest them to improve one of many stats (damage, range, move speed, and others). Skills are trained automatically when you are using a particular weapon class (like rifles, pistols, etc.). As you play the game more, your hero become stronger and later you'll be ready to try yourself in Hard Mode. Steam Leaderboards Red Algorithm is a single-player game, but it's also a competitive and hard game. That is why there are Steam Leaderboards with the best results players achieved. It's not all about luck, it's also about your skill and game knowledge. Try out to climb to the top of one of the Leaderboards and to survive as long as you can, but note that you will be competing with the best there is. This is NOT an idle game Despite the game's simple look and general expectations from the top-down shooter genre, Red Algorithm is not exactly what you might have thought it is. It is not an easy game where you can just sit back, relax, and enjoy your stress-free time without any thinking. Your weapon going to malfunction and force you to reload. It'll be hard to hit monsters and aim. Even if you aimed perfectly, a monster can still dodge your shot. Wind is going to influence your projectiles, making it even harder to hit with certain weapons. The pause function is limited and not available when you choose weapons, perks, etc. and in Hard Mode. RNG will give you many surprises. You will see bad and useless perks offered to you. Not every cool-looking weapon will make you stronger, often it's going to make you weaker as you are not ready to use it yet. There are more than 10 ways to die in this game, and not just 1 from monsters. You will see things that are confusing at first, which might require you to read guides on the Steam community to understand game mechanics deeper. Playing in Hard Mode and doing achievements is even harder. You don't get achievements just by doing something X times, you have to really earn each one of them. To be good in this game you have to think almost constantly and your decisions matter.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1637910/header.jpg?t=1649881010",
    "Price": 0.0,
    "Developers": "Eugene Andreev",
    "Publishers": "Eugene Andreev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_02e1ca0470a04b1c75cf85b04d2f914d94cf84b2.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_65e58c4e6d5f7240455d60d3399478e2a73a7221.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_229e9f828c0b74a5fa2961bd9ce1ecce93e0f0a4.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_828ba8384c333886deceae4674e0fa9624322680.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_439d0de8e88b50f9c3fd7a9b24198905a80c569c.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_18a8ef27fcf25cb727a1f6cd372ba4e47785e836.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_62583cca3f9d449a71f1ae574dc3f00832294fa2.1920x1080.jpg?t=1649881010,https://cdn.akamai.steamstatic.com/steam/apps/1637910/ss_f0d877a646137629c8090ac19e49d4be5337f32f.1920x1080.jpg?t=1649881010",
    "Slug": "red-algorithm",
    "Meta Title": "Red Algorithm: Jun 15, 2021, Eugene Andreev and Full Over...",
    "Meta Description": "Looking for information on Red Algorithm? Check out the release date (Jun 15, 2021), developer insights from Eugene Andreev, and a complete game summary.",
    "Alt Text Image": "Official header image for Red Algorithm game - Steam 1637910",
    "Canonical URL": "https://gusku.site/game/red-algorithm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Red Algorithm\", \"description\": \"Looking for information on Red Algorithm? Check out the release date (Jun 15, 2021), developer insights from Eugene Andreev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eugene Andreev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eugene Andreev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1637910/header.jpg?t=1649881010\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}