{
    "AppID": 1543020,
    "Name": "Rise 2.0",
    "Release date": "Mar 17, 2021",
    "About the game": "Launch your way to higher and higher scores in this procedurally generated platformer. With calming music at your side, flow past your obstacles and reap the rewards of your rise to the top. Earn unlocks for customization and get achievements that chronicle your ascent. Using physics based movement you can bounce off walls, slide, stick to surfaces, and perform mid-air moves. Use your freedom of movement to dodge dangerous obstacles that can instantly end your run. Make the most of your space with multiple generated paths. Each path has periodic openings that allow you to switch between them, allowing for you to avoid obstacles, get items, or take easier routes. Music Control playing, pausing, going back and forth, changing song orders, shuffling, looping, and settings favorites. Listen to over 30 different tracks from various artists while you play. Multiple Paths As apposed to most infinite runner type games, Rise allows for you to navigate multiple paths during your run. Pick a path at the start of your run and then change paths when you find openings. Making use of the various paths opens up the opportunity for strategy and can drastically improve your run. Items/Pickups Items allow you to enhance your run by providing various improvements like increasing your launch speed, making you invulnerable, or increasing your score multiplier. Every item comes in a rare or normal variety that changes how much they affect you. Unlocks and Achievements The main path of progression in the game. Whenever you are at the starting area (you have less than 10 score) an unlock button is visible. This gives you access to additional content that can be acquired once certain heights or goals are met. Unlocks give a variety of game play bonuses and cosmetics while some achievements can give new songs. Death Every time you die or manually restart, procedural generation is used to configure a new layout for the play space. Each layout can consist of over 50 variations of hand made 'tiles'. Obstacles Obstacles come in the form of stationary, moving and projectile types. Touching any obstacles will instantly send you to the death screen and display information about your run. All obstacles appear as glowing red objects and stand apart from anything else that you see. Walls Walls that you are able to interact with can be standard (white), bouncy (green), friction-less (blue) or sticky (black). Each wall type can drastically affect the effect physics has when you are in contact with it. This may help or hinder you so it is important to understand them well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1543020/header.jpg?t=1616612583",
    "Price": 0.99,
    "Developers": "Baconation",
    "Publishers": "Baconation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1543020/ss_b975a72262683c26d86204adee16745533e5e171.1920x1080.jpg?t=1616612583,https://cdn.akamai.steamstatic.com/steam/apps/1543020/ss_394996d3dd2c59f2b0f282c2788f0f00a813c3b5.1920x1080.jpg?t=1616612583,https://cdn.akamai.steamstatic.com/steam/apps/1543020/ss_8b0c1685d485ff6ab5959d05c3aa31c145cfd27e.1920x1080.jpg?t=1616612583,https://cdn.akamai.steamstatic.com/steam/apps/1543020/ss_3d6c6163f90225346d8928760f23ee28fa2e498e.1920x1080.jpg?t=1616612583,https://cdn.akamai.steamstatic.com/steam/apps/1543020/ss_380cd3d4bc11ffa9750c7e960ce42665e484d972.1920x1080.jpg?t=1616612583",
    "Slug": "rise-2-0",
    "Meta Title": "Rise 2.0: Mar 17, 2021, Baconation and Full Overview",
    "Meta Description": "Looking for information on Rise 2.0? Check out the release date (Mar 17, 2021), developer insights from Baconation, and a complete game summary.",
    "Alt Text Image": "Official header image for Rise 2.0 game - Steam 1543020",
    "Canonical URL": "https://gusku.site/game/rise-2-0",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rise 2.0\", \"description\": \"Looking for information on Rise 2.0? Check out the release date (Mar 17, 2021), developer insights from Baconation, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Baconation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Baconation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1543020/header.jpg?t=1616612583\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}