{
    "AppID": 369390,
    "Name": "Scourge of War: Waterloo",
    "Release date": "Nov 19, 2015",
    "About the game": "Scourge of War: Waterloo follows in the footsteps of its American Civil War predecessors and takes the action to one of the most famous battles in history. It is by far the most detailed game about the final battle of the War of the Seventh Coalition. The game boasts 20 historical scenarios (from the French, Prussian and British perspectives), 3 multiplayer scenarios, unlimited user generated sandbox scenarios, and a sandbox campaign, which adds a campaign layer to the game providing more context for sandbox battles. Gameplay At first glance, the player is tasked with moving huge bodies of troops into position to crush the enemy, be it with sheer numbers or superior tactics. In reality though, there is a whole lot more going on. First of all Scourge of War: Waterloo offers a lot more realism than any similar title on the market, having historical unit names, weapons, formations etc. More importantly, however, is the fact that the game simulates the complete chain of command. Players are not by definition placed on top of this chain (though it is possible), but are often placed somewhere in between. Meaning that during the battle, they get orders from above, interpret them and form a strategy with them, then, they will send out their couriers to deliver their own orders to the units directly under their control. Style Scourge of War: Waterloo has 2D sprites drawn on a 3D terrain and in doing so, is capable of showing far larger armies than most games out there. Players can zoom out to great heights to get the best overview of the battle, or zoom in and get right into the action. All units have historical uniforms and carry historical flags. Leaders stand out well enough to easily find them. Interface The user interface had a major overhaul compared to previous SoW titles. The number of buttons on the screen has been reduced and replaced by a context-sensitive popup menu (optional) and it is now easier than ever to set formations in the desired position and with the preferred facing. Additionally, the new order of battle browser and a host of other new screens make it so that players will only have their own strategies to blame for failure. Features Huge Napoleonic-era armies marching and fighting across enormous historical maps. A great amount of content, including 20 singleplayer scenarios An all new Sandbox campaign mode adding a strategic layer to your tactical battles Tons of engine tweaks and adjustments to suit Napoleonic Warfare- Units can now take cover in buildings! New and improved interface for easier command and control Highly accurate historical battlefield maps and general purpose battle maps. Realistic weather. Courier system for dispatches. Extensively researched historical order of battle for the full Battle of Waterloo Real time combat command of a brigade, division or corps Random play mode to generate battles. Routing server for multiplayer play. Multiplayer online combat in several modes, including: Standard opposite sides, cooperative play versus the AI ,play embedded within historical battle scenarios. Random play mode to generate battles of brigade, division, or corps size on any of the included maps. Extensive option set to tailor the game experience to the players preference and to allow good game performance on a wide range of systems. Full modding support including a moddable AI. Sounds and Smoke effects to bring the battles to life. Multiplayer games that can support as much as 32 players",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/369390/header.jpg?t=1575554183",
    "Price": 49.99,
    "Developers": "NorbSoftDev",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_3495381bca2d3be2829cda247e8c15eedf5910fc.1920x1080.jpg?t=1575554183,https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_9d1ab29687fed9ef2d719c9ddf2bff0ac879ac3b.1920x1080.jpg?t=1575554183,https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_3182301a07bc60635c6cc677ea4bc1bbb5f53f3f.1920x1080.jpg?t=1575554183,https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_022ce78504d97cad470a577853444a2d0368fcb2.1920x1080.jpg?t=1575554183,https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_4912982c4f3069f5da99d5e15e1eeb18a89c331b.1920x1080.jpg?t=1575554183,https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_4afc5f2ebf1f34ad51c8179e9b7b012de1b5aaab.1920x1080.jpg?t=1575554183,https://cdn.akamai.steamstatic.com/steam/apps/369390/ss_f07282985a4c4bd9cc57f1028ea8945f286be06f.1920x1080.jpg?t=1575554183",
    "Slug": "scourge-of-war-waterloo",
    "Meta Title": "Scourge of War: Waterloo: Nov 19, 2015, NorbSoftDev and F...",
    "Meta Description": "Looking for information on Scourge of War: Waterloo? Check out the release date (Nov 19, 2015), developer insights from NorbSoftDev, and a complete game...",
    "Alt Text Image": "Official header image for Scourge of War: Waterloo game - Steam 369390",
    "Canonical URL": "https://gusku.site/game/scourge-of-war-waterloo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Scourge of War: Waterloo\", \"description\": \"Looking for information on Scourge of War: Waterloo? Check out the release date (Nov 19, 2015), developer insights from NorbSoftDev, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"NorbSoftDev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/369390/header.jpg?t=1575554183\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}