{
    "AppID": 1849370,
    "Name": "SGS Pacific D-Day",
    "Release date": "Apr 28, 2022",
    "About the game": "It is a most common knowledge that the battles conducted by the Americans in the Pacific islands against the Japanese during World Ward II had been extremely tough and savage. This operational strategy game purpose is to let players discover five of the most emblematic ones, in a period going from end 1943 to early 1945. Both sides are playable, and you have at your disposal different units, from mobile infantry, tanks and planes to static defenses like bunkers, trenches, tunnels and mines. Your careful play and balance of units mix, plus clever usage of cards (which you receive every turn to assist your strategy) allow you to reach the victory goals: either capture the island without too many losses (on the US side) or hold it till the end while inflicting large casualties to the attacker (when playing Japanese). Pacific D-Day Pacific D-Day It is a most common knowledge that the battles conducted by the Americans in the Pacific islands against the Japanese during World Ward II had been extremely tough and savage. This operational strategy game purpose is to let players discover five of the most emblematic ones, in a period going from end 1943 to early 1945. Both sides are playable, and you have at your disposal different units, from mobile infantry, tanks and planes to static defenses like bunkers, trenches, tunnels and mines. Your careful play and balance of units mix, plus clever usage of cards (which you receive every turn to assist your strategy) allow you to reach the victory goals: either capture the island without too many losses (on the US side) or hold it till the end while inflicting large casualties to the attacker (when playing Japanese). In this game you will fight 5 of the fiercest battles of the United States Marines Corps during the Pacific War between 1943 and 1945. Each of the following key American operations is recreated in this challenging game, allowing you to play both sides: • Operation Galvanic: the Battle of Tarawa, 20 to 23 November, 1943. • Operation Forager : Part 1, the Battle of Saipan, 15 June to 9 July, 1944. • Operation Forager : Part 2, The Battle of Tinian, 24July to 1 August, 1944. • Operation Stalemate II : the Battle of Peleliu, September 15 to November 27, 1944. • Operation Detachment : the Battle of Iwo Jima, 19 February to 26 March 1945. In all those battles, the death toll was incredible and the fighting extremely tense, till the end. Can you do better than history and, as the American commander, take your key objectives in the fastest of time and with minimum loss of men ? Or, as the Imperial Japanese commander, can you fight those doomed battles at a cost that will be intolerable for the enemy? These battles are handled at Battalion or Company scale on both sides (Battalion unit size units for Saipan, Tinian and Tarawa and Company size for Iwo Jima and Peleliu). The air units are usually equivalent to the usual CV air component (two units for CVs, one for CVLs). Fixed units such as bunkers, trenches or mines represent a few assets or buildings. Scenarios vary in length, for 20 to 40 turns, each representing usually between 6 hours (only in the Tarawa scenario) and a day (for all other scenarios). The game will offer you various starting options (more troops, more replacements, more air support, different at start positions) that may alter the historical setup and offer vast replayability potential. Each scenario tells a different story pertaining to the historical battle it covers, but in general players will get the following common points among all scenarios: The Japanese have few mobile troops, armor, artillery and almost no planes, but their fixed defenses are well organized and incredibly tough to break, as they account always for the difficult nature of the various island terrains. Their playing cards and events reflect this, plus the fierce nature of their defense. The American forces are well equipped, backed by a strong air force and impressive naval gunfire support, but their timeline and objectives are always very tight to meet and bound to be set off balance by the various traps and plans of the enemy. Those external constraints, but also various other assets, are covered by the diversity of the cards they have in hands. To be clear, as in history, the final outcome of each battle is inevitable: US forces will eventually clear each island of Japanese forces. But at what price? This is the challenge faced by the player, to make those D-Days much less bloody than they were historically. This game is dedicated to all United States Marines past, present and future. Thank you for your service. Estimated Playtime: 20h00+. Favored Side: none. Hardest to Play: USA. Other games of the SGS collection with similar gameplay / / / / / / / / /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1849370/header.jpg?t=1655138079",
    "Price": 29.99,
    "Developers": "Strategy Game Studio",
    "Publishers": "Avalon Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_6a10a7a27e619e86d7c6554271f90ebee19dcd6f.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_2ee51e5775797f8bae5a1640948f0cb05a0d89cd.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_41dba8392731c294edb50a97775d2ca935afd51d.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_c3db5acc72b168d4ff2a4f090996c4f9284ddc25.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_67d9382db2ff804d9437145992cc5cb403141879.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_82f99e4892df4190620966ac9eeacd860b5d96d4.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_a6a121e2ccb92c07cd3b8578097eccded800d1c6.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_58b4482077e2b2d7d5fc2cfb595d0482baaa33d4.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_f364c12e01bab01c5187b5a605b7a04bf9dc9531.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_d70403f26da883c4c81156b96d6ac8da96f5164f.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_4ec34109f6bc3dc273042fda7c623f190fb539f2.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_13ff7b5b31fae9468f9923aa2d9b6f8d9d040f98.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_da4486ee0b808ddad4d4418d6edbdc6258d10b18.1920x1080.jpg?t=1655138079,https://cdn.akamai.steamstatic.com/steam/apps/1849370/ss_a794b51672a8a62efe0bf31844b63459364a87bb.1920x1080.jpg?t=1655138079",
    "Slug": "sgs-pacific-d-day",
    "Meta Title": "SGS Pacific D-Day: Apr 28, 2022, Strategy Game Studio and...",
    "Meta Description": "Looking for information on SGS Pacific D-Day? Check out the release date (Apr 28, 2022), developer insights from Strategy Game Studio, and a complete ga...",
    "Alt Text Image": "Official header image for SGS Pacific D-Day game - Steam 1849370",
    "Canonical URL": "https://gusku.site/game/sgs-pacific-d-day",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SGS Pacific D-Day\", \"description\": \"Looking for information on SGS Pacific D-Day? Check out the release date (Apr 28, 2022), developer insights from Strategy Game Studio, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strategy Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Avalon Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1849370/header.jpg?t=1655138079\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}