{
    "AppID": 1883530,
    "Name": "SnackHunter",
    "Release date": "Jul 8, 2022",
    "About the game": "SnackHunter is a multiplayer hide-and-seek game full of fun and magic! Join the team of magical Hunters and chase your runaway food or become an enchanted Snack and hide from the hungry mages. Each player, whether Hunter or Snack, has unique abilities to cause as many problems as possible for the other team. * Attention : This is the PC/host version of the game and is necessary for making a lobby! You need this version in order to play SnackHunter!* Google Play Store (Android) / Apple App Store (iOS) Host the game on your PC Create a room with the PC version of the game and let yourself and all your friends join in. In each round the PC screen shows crucial game information and an overview of the game map. Snacks can even see where the Hunters are at any given time. But as a Snack you need to be careful too! The PC screen also shows when you pick up items or use your abilities. With that, even the Hunters can use the screen for their advantage! Your Smartphone as the Controller! The innovative use of your smartphone as a controller lets you participate in the gameplay in a more interactive way. Quickly wipe your screen clean when you're hit by tomato paste or blow into your microphone to get out of fire attacks faster. Free yourself from the Hunter's clutches by shaking your smartphone or move it to look around while you're hidden. By taking a selfie and placing it on your character as a face, you can even become part of the game. This leads to countless hilarious combinations. Different Characters Before each round you'll be able to choose from a number of fun characters with individual abilities and decide with whom you'll enter the action. Hunter As the Hunter, you'll search for the escaped snacks to get them back into the cauldron. Scour all the different rooms and find the hidden Snacks. But watch out! The Snacks will try to free their already captured companions. Try to keep track of them and coordinate with your partners, so they don't get away. Snacks The Snacks are on the run from the hungry Hunters to escape their impending fate as a soup side dish. Enter various hiding places or disguise yourself as a simple food. But it doesn't stop there! To win, you'll have to take photos of Hunters while risking getting caught. With these photos as evidence, you will uncover the Hunters’ misdeeds and show the world their true faces. Features Play online or locally: Only one person needs the game's PC version! No controllers needed: Every player uses their smartphone together with the free SnackHunter app! An easy connection with the room code generator. Create your own rules: Make rounds harder, longer or even more chaotic. Character customization: Design the face of your game characters as you like.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1883530/header.jpg?t=1657299622",
    "Price": 19.99,
    "Developers": "PolyPirates UG (haftungsbeschränkt)",
    "Publishers": "PolyPirates UG (haftungsbeschränkt)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_b723828c847932c93089a43b5defa19700eda012.1920x1080.jpg?t=1657299622,https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_1257c3ac3217328affb2a54d25e42e1195e877b4.1920x1080.jpg?t=1657299622,https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_8ed6bc54810c75ed6f36a67efef7ac9f71376af7.1920x1080.jpg?t=1657299622,https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_39939a4ff677f2262ddc535fca0382c684830f29.1920x1080.jpg?t=1657299622,https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_61a7fae2fdfcd92b08128979db28a2d4e018b157.1920x1080.jpg?t=1657299622,https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_0180f16e0555dbfa206cadaeacd5ca6b3292119b.1920x1080.jpg?t=1657299622,https://cdn.akamai.steamstatic.com/steam/apps/1883530/ss_2ec689958cf3ab211a0b3ab2e02916152c4196de.1920x1080.jpg?t=1657299622",
    "Slug": "snackhunter",
    "Meta Title": "SnackHunter: Jul 8, 2022, PolyPirates UG (haftungsbeschrä...",
    "Meta Description": "Looking for information on SnackHunter? Check out the release date (Jul 8, 2022), developer insights from PolyPirates UG (haftungsbeschränkt), and a com...",
    "Alt Text Image": "Official header image for SnackHunter game - Steam 1883530",
    "Canonical URL": "https://gusku.site/game/snackhunter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SnackHunter\", \"description\": \"Looking for information on SnackHunter? Check out the release date (Jul 8, 2022), developer insights from PolyPirates UG (haftungsbeschr\\u00e4nkt), and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PolyPirates UG (haftungsbeschr\\u00e4nkt)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PolyPirates UG (haftungsbeschr\\u00e4nkt)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1883530/header.jpg?t=1657299622\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}