{
    "AppID": 496730,
    "Name": "Sorcerer King: Rivals",
    "Release date": "Sep 22, 2016",
    "About the game": "Never the same game twice You have risen to lead an up and coming civilization in magical land of Elemental. Your village lives in the shadow of one of the precious shards of magic. It also possesses something unique in all the world -- the Forge of the Overlord. This powerful artifact allows its user to craft magical items and equipment. Armed with the Forge of the Overlord, your people look to you to challenge the malevolent Sorcerer King, a being who has devastated the land and filled it with ruins and minions. Unknownst to him, you have learned the Spell of Ascension that will allow you to channel the magic of the shards and enable you to ascend to a being of nearly unlimited power who can set the world free (or destroy it). But you are not alone. Other civilizations are rising while the Sorcerer King schemes in his distant fortress. They too have their own plans… A rich world to explore Choose from one of eight civilizations to play as including the Endless Night, The Dwarves of the Frozen Realm and the Men of Altar. Discover ancient dungeons, lost temples, haunted villages and more that lead to adventures with danger and treasure Use the included map editor to create your own unique world or let the game randomly generate one for endless replayability A Deep history to expand into Meet other races to ally with or go to war against Put down criminal organizations, liberate oppressed towns and discover new lands to found new cities in Research new spells, learn new skills, and craft new items A vast empire to exploit Use magic to raise mountains or create icy plains Harvest metal, crystal, horses and other resources to build ever more powerful forces Enlist the aid of powerful champions and terrible demigods to do your bidding A myriad of foes to exterminate Use your magic to charge Curgen's Bane to transform you into a god Gather allies and assault the Sorcerer King in his fortress Destroy the demigods of Elemental with your righteous might Beyond the game Construct new worlds with the included map editor to create your own land to conquer Design new quests with the quest editor to create your own story or recreate your favorite RPGs of the past Share your maps and quests with others with the integrated Steam Workshop library.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/496730/header.jpg?t=1637248879",
    "Price": 19.99,
    "Developers": "Stardock Entertainment",
    "Publishers": "Stardock Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/496730/ss_0bf7f91edabbb9c49b687615ee83d3d3e367efcd.1920x1080.jpg?t=1637248879,https://cdn.akamai.steamstatic.com/steam/apps/496730/ss_9d7c9aa2562d7f6c045b668dcbf64d082cb8679f.1920x1080.jpg?t=1637248879,https://cdn.akamai.steamstatic.com/steam/apps/496730/ss_6a334b2c3fd0c6666c99ea2bfaa39128ef16c2d8.1920x1080.jpg?t=1637248879,https://cdn.akamai.steamstatic.com/steam/apps/496730/ss_14e43f3ffbb4d83d2bfdedd36ef9d30f67f6f92c.1920x1080.jpg?t=1637248879,https://cdn.akamai.steamstatic.com/steam/apps/496730/ss_2ca49e6f4318f4d1cbb8f1a5b73278db3a92a8cf.1920x1080.jpg?t=1637248879",
    "Slug": "sorcerer-king-rivals",
    "Meta Title": "Sorcerer King: Rivals: Sep 22, 2016, Stardock Entertainme...",
    "Meta Description": "Looking for information on Sorcerer King: Rivals? Check out the release date (Sep 22, 2016), developer insights from Stardock Entertainment, and a compl...",
    "Alt Text Image": "Official header image for Sorcerer King: Rivals game - Steam 496730",
    "Canonical URL": "https://gusku.site/game/sorcerer-king-rivals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sorcerer King: Rivals\", \"description\": \"Looking for information on Sorcerer King: Rivals? Check out the release date (Sep 22, 2016), developer insights from Stardock Entertainment, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/496730/header.jpg?t=1637248879\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}