{
    "AppID": 1815720,
    "Name": "Split Tactics",
    "Release date": "Dec 30, 2021",
    "About the game": "Split Tactics is a casual game about choices. There are a total of 13 elements in this game. The 6 basic elements are: Fire, Ice, Poison, Dark, Light and Curse. Then there are 7 more that are their combinations: Chaos (Fire+Dark), Reflection (Ice+Light), Toxic Mist (Poison+Dark), Madness (Dark+Curse), Fume Gas (Fire+Poison), Horror Breath (Ice+Dark) and Divine Flame (Light+Fire). Each element basic or not, has its own effects when applied to an enemy. Players should choose spells based on effectiveness to creatures and also to avoid making opponent the next most powerful mage. A good strategic balance is required to overcome opponent and also stay alive for the duration of the game. Start of the Game Each player draws 5 cards from the reward card pile. The first enemy or trap is opened from the explore card pile. Raw Attacks A player can choose to attack based on raw power (their level on the top right corner of the screen) to any explored enemy Elemental Attacks Not so direct and powerful as the raw attacks. However, elemental attacks are your silent power, with tricks and effects that apply over time or add up to the total damage as well as effects that control enemies or make them extremely vulnerable. Recycling Cards A player has the choice to recycle 2 cards from their hand for a new one. Doing so player also gains 3 life points. This is very effective when working against your opponent, discarding valuable cards for them or in search of a better alternative for your plays. Equipments A card from the reward pile can either be cast or used as an equipment. An exception to this rule are the crystal cards. Equipping cards can make a difference as the elemental attacks become stronger. When equipping a card player also draws from the reward pile a new card of the same element type, enabling more combos. Casting Crystals A crystal can also be cast. This can be used for immediate effects as a crystal offers the choice of an AOE attacks that can destroy remaining enemies and allow for quick loot or add up to the total damage. Casting Powerful Spells For each element type there is a special spell that deals a huge amount of damage enemies (such as an explosion) or has a very drastic result to the gameplay. Each of these spells are accompanied with a Visual Effect to showcase the impact. Restrictions Every player can only cast or equip up to 1 card from their hand each turn. Crystals can be cast or used as an equipment in addition to that number but only 1 per turn. Win/Lose Condition A player wins if they reach level 25 or if the opponent had their life points become 0.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1815720/header.jpg?t=1640856346",
    "Price": 3.99,
    "Developers": "Petros Giannopoulos",
    "Publishers": "Petros Giannopoulos",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1815720/ss_2ac6e4af89e45c5287b12b35508ce3cf499c3720.1920x1080.jpg?t=1640856346,https://cdn.akamai.steamstatic.com/steam/apps/1815720/ss_6c985c45c3f0644ba8dde0aae6ec0f0aa4f3f1f6.1920x1080.jpg?t=1640856346,https://cdn.akamai.steamstatic.com/steam/apps/1815720/ss_d8a671ee8a55f317f659c47ac58869ddd1ac8dc4.1920x1080.jpg?t=1640856346,https://cdn.akamai.steamstatic.com/steam/apps/1815720/ss_5aa285624af0ce1db0a8d570a93f62a659c6ce96.1920x1080.jpg?t=1640856346,https://cdn.akamai.steamstatic.com/steam/apps/1815720/ss_4d74265970f926f53d555b0f1b2b5bf695a7c42e.1920x1080.jpg?t=1640856346",
    "Slug": "split-tactics",
    "Meta Title": "Split Tactics: Dec 30, 2021, Petros Giannopoulos and Full...",
    "Meta Description": "Looking for information on Split Tactics? Check out the release date (Dec 30, 2021), developer insights from Petros Giannopoulos, and a complete game su...",
    "Alt Text Image": "Official header image for Split Tactics game - Steam 1815720",
    "Canonical URL": "https://gusku.site/game/split-tactics",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Split Tactics\", \"description\": \"Looking for information on Split Tactics? Check out the release date (Dec 30, 2021), developer insights from Petros Giannopoulos, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Petros Giannopoulos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Petros Giannopoulos\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1815720/header.jpg?t=1640856346\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}