{
    "AppID": 440640,
    "Name": "Sweet F. Cake",
    "Release date": "May 30, 2020",
    "About the game": "An amazing story of a typical Soviet pioneer whose life didn’t go very well. His friend fails the test of time and the girl he’s been in love with since forever sees him as a sister with a male appendage. Everything is going to hell until an old man turns up with an envelope inside which is something that will allow the protagonist to “replay” the state of things and perhaps to multiply previous successes. The only thing that the envelope’s owner is asking for in return is the virginity that the protagonist is trying so hard to be rid of. Whether he should agree or not depends on you. - A game from the author of “Sweet muffin” comics. - After completing it you will need to be urgently hospitalized at the nearest dispensary. - Dialogues are choc-a-bloc full of choices that will allow you to feel like yourself to the max. - More than seven endings! (8!!!) - A game for real men: the author is a master of oral skills and draws on colossal virginal experience. Sparse manly tears guaranteed. - 4 beautiful heroines that you can have a romantic experience with or artfully ditch. - Only this visionary novel features the elite “Lonely hearts club”. - All of Roskomnadzor’s morality police have reserved the Gold Edition. Sergey. The main protagonist. A simple Soviet pioneer who is going through tough days at the time of adolescence. At a certain point, he gets his hands on a magical artifact that allows him to face his mates in a new capacity. Lisa. A mysterious ginger girl who was only recently transferred to the school that the protagonist goes to. This surprising girl tries to convince the hero to become her fictitious boyfriend at the first meet in order to protect her from “fantom” perverts who can’t wait to get under her skirt. The girl is shrewd and has a good sense of humor. Kate. The hero’s childhood friend. A keen student with a temperamental character. She is fanatically loyal to science, full of secrets and sharp comments that wound everyone that picks a fight with her. Serge becomes one of her victims as it turns out his feelings for her are not mutual. Is this a final decision or is there something that won’t let her accept his offer? You’ll have to find out. Matilda. A bright and lively girl. Likes sport, taking pictures, and spreading gossip (i.e. she likes journalism). She is in charge of the school newspaper. She is always in motion and her life is full of events. She is always busy, but nevertheless, she is looking for a good boyfriend, trying to make the protagonist fall in love with her. Alice. A tragic character. A sweet, shy girl in a strange living situation. Serge and Alice have been in the same class since 1st grade but don’t know each other. At some point, the hero notices her and tries to help. Saving the girl is not easy: a terrifying secret comes to light. Legal Disclaimers: All characters are 18 age or older even if specified otherwise This game contains violence, obscene scenes (partially naked girls and flirting scenes with sexual overtones.), Rude humor, blood, scenes that depict smoking, or infrequent use of profanity.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/440640/header.jpg?t=1648338607",
    "Price": 9.95,
    "Developers": "Texic",
    "Publishers": "Bear in the Night",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_967d1368e10895658aff368683c40e421971d07f.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_e91d1a0770d38d1755c71250f2ddcc04a8c317d5.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_08a9760970d07e3deddb5bdafbf1c98d896fbf48.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_d23c831df5ab847c79985acf9f0b9770bb962afd.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_f086ceb88447e4b2f97b10d1389e096188ee90a9.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_ce602b1c4ac2efe230b5e443c83627956617ad89.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_355bcee34d17d4dc1610f8dd416afd81ef0dab7d.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_9212da1951bb5755734185ae7f2d2793aef499c5.1920x1080.jpg?t=1648338607,https://cdn.akamai.steamstatic.com/steam/apps/440640/ss_fc3637ceaf05cd1b4c91dd2e7b26deb70044def0.1920x1080.jpg?t=1648338607",
    "Slug": "sweet-f-cake",
    "Meta Title": "Sweet F. Cake: May 30, 2020, Texic and Full Overview",
    "Meta Description": "Looking for information on Sweet F. Cake? Check out the release date (May 30, 2020), developer insights from Texic, and a complete game summary.",
    "Alt Text Image": "Official header image for Sweet F. Cake game - Steam 440640",
    "Canonical URL": "https://gusku.site/game/sweet-f-cake",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sweet F. Cake\", \"description\": \"Looking for information on Sweet F. Cake? Check out the release date (May 30, 2020), developer insights from Texic, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Texic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bear in the Night\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/440640/header.jpg?t=1648338607\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.95, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}