{
    "AppID": 1611830,
    "Name": "TeamTower",
    "Release date": "Sep 9, 2021",
    "About the game": "Wellcome to T^2! 'Teamtower' is a Rogue-like turn-based card Adventure game. You will become a Prophet, lead a small team, go deep into the mysterious space-time tower, experience the mysterious crisis in the space-time fragment, and finally reach the depths of the hell in the ancient legend. Space-time Tower As a seer of the Secret Church, you will once again face the space-time tower, built because of the hubris of the past and shattered because of the greed for the forbidden. You will step back into it and face the uncontrolled creations of the Church Mages, the old rulers of the Abyss, and the mysterious old memories of the broken time and space. A 'professional' expedition team Recruit a team in the tavern, each with their own characteristics, full of courage and ambition. They may be the hungover gamblers in the tavern, the Paladin who monitor the anomalies of the space-time tower; the necromancers and poisoners from the Hidden Order; and the kingdom witches from neutral organizations, the hidden swordmasters from the Far East and the unknown time travelers ...... Exploring the mysterious tower will require some people with great skills. Special precognitive ability Use the ability of 'Prophet' to anticipate the actions of each team member, and intervene in the actions of each team member through command cards to kill the enemies with the lowest casualties and save strength. Of course, the power of the Prophet is much more than that. Through unique 'events', 'blood pool' rooms, and 'knowledge' and 'traits' that unlock with combat. Your players and cards will receive powerful or interesting enhancements. It's a good idea to take advantage of these changes and gradually optimize your team and deck. The vicious monsters The uncontrolled creations produced by the forbidden research in the space-time tower, the mythical species of ancient legends, the demons and devils in the depths of hell ...... The road ahead will never be easy. Make your choice You will be caught in the space-time turbulence, breaking into a fragment of the old days ...... but you will still be affected and interfered by them, must be careful to make choices. Facing the final fate Dive deep into the bottom of hell, complete your journey, and piece together the clues of old history from only the words. But you will always have to make your own decisions about your destiny. Welcom to our Discord:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1611830/header.jpg?t=1640671987",
    "Price": 19.99,
    "Developers": "pink rabbit",
    "Publishers": "pink rabbit",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_3a09fa232a874d5d6f3bda6019996e015e4a20ca.1920x1080.jpg?t=1640671987,https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_eb1074282a8874e19916c711fb6b719afaf6dce7.1920x1080.jpg?t=1640671987,https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_c0698d224efad04b9eb5d2f289dea6a7ab7f8ad2.1920x1080.jpg?t=1640671987,https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_85fcda49f4053d77d7e58722b2df56869fa68884.1920x1080.jpg?t=1640671987,https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_bf5c296160cb15a07d10a86ea073c34d5d56a057.1920x1080.jpg?t=1640671987,https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_163c8c48434fd91f625d27ef4cab3f66ba2323fc.1920x1080.jpg?t=1640671987,https://cdn.akamai.steamstatic.com/steam/apps/1611830/ss_91edd7943568d3c99a36dab1d2643062c8e97ed3.1920x1080.jpg?t=1640671987",
    "Slug": "teamtower",
    "Meta Title": "TeamTower: Sep 9, 2021, pink rabbit and Full Overview",
    "Meta Description": "Looking for information on TeamTower? Check out the release date (Sep 9, 2021), developer insights from pink rabbit, and a complete game summary.",
    "Alt Text Image": "Official header image for TeamTower game - Steam 1611830",
    "Canonical URL": "https://gusku.site/game/teamtower",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TeamTower\", \"description\": \"Looking for information on TeamTower? Check out the release date (Sep 9, 2021), developer insights from pink rabbit, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"pink rabbit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"pink rabbit\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1611830/header.jpg?t=1640671987\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}