{
    "AppID": 251150,
    "Name": "The Legend of Heroes: Trails in the Sky",
    "Release date": "Jul 29, 2014",
    "About the game": "Modern society owes much to a mystical technology known as “orbal energy.” Fifty years ago, during what’s come to be known as the “Orbal Revolution,” the invention of this technology and the “orbments” developed from it led to a period of rapid human advancement, birthing innovations of all shapes and sizes -- not the least of which was the airliner, or “orbalship” industry. Although the positive impact of this revolution is obvious, every coin has a flipside; for every beneficial device developed with these new materials, so too were advanced weapons and other implements of war. Thus, the land became mired with turmoil, and remains in such a state even now. Enter, the bracers: an organization established to serve as police and intermediaries alike, holding above all else the peace and safety of the lands under their jurisdiction. Whenever a citizen is in need of assistance, he or she may place a request at the local Bracer Guild -- and be it monster extermination, crime prevention or even peace talks among warring nations, the bracers will do whatever they can to resolve the matter cleanly and efficiently. Some matters require a gentler touch than others, however. When an orbalship transporting a legendary 'S-rank' bracer named Cassius Bright suddenly goes missing, said bracer's daughter, Estelle, and adoptive son, Joshua, must join forces in search of him across the entire Kingdom of Liberl. And what they find along the way could change both of their lives forever... Hailed as one of the largest, longest and most meticulously detailed turn-based JRPG series of all time, this first chapter in the ongoing Trails saga sets the stage for what's quickly become Ys developer Nihon Falcom's most popular and best-selling franchise in their entire 30+ year history. Introducing people, places, ideas, events and lore that rival in complexity those of even the most highly-regarded fantasy epics in literature, the care and attention given to each and every NPC, location and historical in-game event is what sets The Legend of Heroes: Trails in the Sky apart from its contemporaries. Come join Estelle, Joshua, Scherazard, Olivier and the rest of the cast as they uncover the secret underbelly of Liberl in their first 50+ hour masterpiece, and see what Japanese gamers have been raving about for over ten years. Key Features: The original version of the first chapter in this historical series, featuring strategic turn-based combat with unmatched customization. Over 50 hours of gameplay on average, with countless side-quests, collectibles and secrets to encourage replay. A vast world where every NPC has a name and personality, every town has its own unique politics and economic concerns, and no detail is ever trivial. Support for a wide variety of fullscreen and widescreen resolutions, including true 1080p HD. Fully adjustable controls supporting virtually any USB gamepad, as well as a standard keyboard and mouse setup. Over two dozen unique Steam Achievements, Steam Cloud support and Steam Trading Cards featuring gorgeous anime-style art from the franchise's original artists. Numerous updates previously seen only in the handheld version, including: - Selectable difficulty level and new game+ features on subsequent playthroughs - Full voice-acting during combat - 'Retry Offset' feature to lower the difficulty of battle with each attempt if desired",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/251150/header.jpg?t=1624575033",
    "Price": 19.99,
    "Developers": "Nihon Falcom",
    "Publishers": "XSEED Games,Marvelous USA, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_8cdb7a4dc5289c6f75ca678bd03486446aae3497.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_2ee548710d945a0d36a036b178b6bdac9ddf4cad.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_e2ff833605e82b8f73107f106a62e6111827b7ef.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_cb1fc0a9161b907484325e17545dc4bbe39cf12f.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_2d091600dbb5b2975618634a130bc7db222b5109.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_e00a412e94961cf12b37a35b98a41990c42a0591.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_15bcde576cf2a3497e052dc8a39c462f88a6e0bb.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_21b11ab8107555daa82fa150958e38b53d9999f2.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_fcd1fa550595321500973b4b0e99d82a5d6718a5.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_eeaa8d858c17668efd008759a87f0697d9465b2f.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_a1917dca41288ad05f3433e89bfb844e862e53fb.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_6f884c4c286c6b4ccd96020a214e3010bc28899c.1920x1080.jpg?t=1624575033,https://cdn.akamai.steamstatic.com/steam/apps/251150/ss_f5e4f480526fc641aa35efa92fff4e7d0c042508.1920x1080.jpg?t=1624575033",
    "Slug": "the-legend-of-heroes-trails-in-the-sky",
    "Meta Title": "The Legend of Heroes: Trails in the Sky: Jul 29, 2014, Ni...",
    "Meta Description": "Looking for information on The Legend of Heroes: Trails in the Sky? Check out the release date (Jul 29, 2014), developer insights from Nihon Falcom, and...",
    "Alt Text Image": "Official header image for The Legend of Heroes: Trails in the Sky game - Steam 251150",
    "Canonical URL": "https://gusku.site/game/the-legend-of-heroes-trails-in-the-sky",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Legend of Heroes: Trails in the Sky\", \"description\": \"Looking for information on The Legend of Heroes: Trails in the Sky? Check out the release date (Jul 29, 2014), developer insights from Nihon Falcom, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nihon Falcom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XSEED Games,Marvelous USA, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/251150/header.jpg?t=1624575033\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}