{
    "AppID": 1414500,
    "Name": "Voyeur",
    "Release date": "Oct 12, 2020",
    "About the game": "Voyeur... don’t get caught! Richard Hawke has it all. Wealth, power, the adoration of millions, and… secrets to protect. This weekend he has gathered his family to discuss his running for presidency of the United States. Lust, revenge and betrayal are all at play in this political thriller. So do you just watch? Or… will you risk getting involved? Will the videotape you make save the country? Or might it cost you your life? As the voyeur , it’s all up to you. * * * Voyeur was first released on the Phillips CD-i back in 1993 and was one of the first big-budget games to take advantage of the console’s FMV – that’s full-motion-video – capabilities. Whereas today we are used to full-screen video in resolutions of 4K or more, the inclusion of ‘real-life’ filmed content within the context of the game was considered a huge step forward… and Voyeur was leading the way. It wasn’t only the game’s technical capabilities that made headlines, however. The ostensibly “adult” content – in fact pretty tame in reality – led to Voyeur joining the Leisure Suit Larry series and Digital Pictures’ Night Trap (among others) in an exclusive club of games which stirred up controversy to such a level that the media – acting as society’s moral guardians – called for them to be banned. In Voyeur , you take on the role of a private investigator hired to collect evidence of wealthy CEO Reed Hawke’s corruption by a member of his family. To keep the game fresh over multiple plays (with multiple endings, again a mechanic well ahead of its time) the family member is chosen at random from those that Reed has gathered together in order to announce his bid for the country’s presidency. Taking control of a video camera located in a building opposite the family’s mansion, your goal is to collect enough video evidence to destroy the would-be-president’s career. You might want to include some danger money in your quote for the weekend though, as if you come to the wrong conclusion after compiling your evidence, you will end up victim of a ruthless assassin! Interestingly, the game’s design was inspired by Alfred Hitchcock’s Rear Window , with the player initially only able to see partial scenes. If they make the wrong decision about where their focus should be, their sense of context for other material may be tainted. More so that any other game before it, Voyeur elevated FMV above the level of a gimmick and made it an integral part of the gameplay. Critically acclaimed for its originality and the quality of the acting – previous efforts had been hopelessly amateur – Voyeur rightly takes its place among a small number of games that were both highly controversial and great fun to play! You too can close the blinds, draw the curtains and hone your skills as a top private dick by keeping a close – a very close – eye on the Hawke family, becoming the ultimate… voyeur .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1414500/header.jpg?t=1602488652",
    "Price": 8.99,
    "Developers": "Philips P.O.V. Entertainment Group",
    "Publishers": "Pixel Games UK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_bd174371f4034ab7fad15513ad8fb3c738619e90.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_692eaa46663580b631d9d6fc75a07fa5f318cba2.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_fab927cc8ebba268aa29c6f30780384fbaff66ad.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_9714953216edd9ca9d570cdbfd3666da26d35d75.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_4ee3e90c5016657a69aa63d84c52d37e00185397.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_cad7fafe4205c695858feb9960f63419106b025f.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_d2ec7316ac241a47e3e33a329e98cbab74323e71.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_c2a0171f0830baf3d7b1e98648901ed80896ee67.1920x1080.jpg?t=1602488652,https://cdn.akamai.steamstatic.com/steam/apps/1414500/ss_97b648a33378f7cf57d7a94bd923c5c4b13d41ea.1920x1080.jpg?t=1602488652",
    "Slug": "voyeur",
    "Meta Title": "Voyeur: Oct 12, 2020, Philips P.O.V. Entertainment Group ...",
    "Meta Description": "Looking for information on Voyeur? Check out the release date (Oct 12, 2020), developer insights from Philips P.O.V. Entertainment Group, and a complete...",
    "Alt Text Image": "Official header image for Voyeur game - Steam 1414500",
    "Canonical URL": "https://gusku.site/game/voyeur",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voyeur\", \"description\": \"Looking for information on Voyeur? Check out the release date (Oct 12, 2020), developer insights from Philips P.O.V. Entertainment Group, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Philips P.O.V. Entertainment Group\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Games UK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1414500/header.jpg?t=1602488652\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}