{
    "AppID": 365620,
    "Name": "WarBirds - World War II Combat Aviation",
    "Release date": "May 5, 2015",
    "About the game": "Fly WarBirds only if you really want to learn to Fly and Fight in a realistic simulation of WWII Combat! The World Famous WarBirds, Combat Flight Simulation, in its 26th year, takes real flying and fighting skills and IS NOT an arcade game. Fly and Fight well and you will survive! Fly badly and you will just be known as “target”. The new WarBirds for 2021 has New Training Options including: 1) CheckOut for new players to get a basic familiarity with WarBirds flying. 2) CheckRide for experienced pilots and virtual pilots from other sims. 3) Fighter Pilot Academy from the WarBirds iOS mobile simulation that allows new players to have some fun and get some kills while they learn the basics of WarBirds. 4) Online Play where all human players are on one side and the enemies are on the other to learn how to control you chosen vehicle, how to navigate and maneuver, and practice how to bomb and strafe with only a small chance to be shot down by the enemies. a. Players can fly Fighters, Bombers, or Command Tanks in multiplayer actions online to learn to operate each type of combat vehicles. WarBirds 2021 also brings brand new terrain buildings and colors, new improved aircraft, target art, and many more updates. Please notice the new runways, Runway Supervisory Units, and the improved Aircraft. The Squadron Select Series has had many great seasons over the last 20 years with the new 2021 season already begun with a Series on the 1940 attempt by the Axis to take control of Malta in the Mediterranean Sea. The S3 series is a series of 5 frames that are played on Sunday nights at 2030 EST in the online arenas of WarBirds. Our S3 events have included the Battle of Britain, Pearl Harbor, Midway, and many more. See a complete list on the TotalSims.com webpage under Community. S3#121 - Fall of Malaysia - Enter the Rising Sun - December 1941 • Frame 1 - Sept 20 • Frame 2 - Sept 27 • Frame 3 - Oct 4 • Frame 4 - Oct 18 • Frame 5 - Oct 25 S3#122 - The North Sea - TNS 1939-1944 • Frame 1 - Nov 15 • Frame 2 - Nov 22 • Frame 3 - Dec 6 • Frame 4 - Dec 11 • Frame 5 - Dec 20 S3#123 - I Have Returned - IHR Phillipines 1944-45 • Frame 1 - March 21 • Frame 2 - March 28 • Frame 3 - April 11 • Frame 4 - April 18 • Frame 5 - April 25 S3#124 FIGHT ABOVE ETNA - REBOOTED SICILY 1943- • Frame 1 - 16 May • Frame 2 - 23 May • Frame 3 - 30 May • Frame 4 - 6 June • Frame 5 - 13 June WarBirds can be played either in single player 'solo' mode with computer-controlled enemies, or online with human and computer-controlled allies and opponents. Single player WarBirds offers over 20 flight training modules, 12 instant action missions from Bomber Ambush to Rear Gunner action, and a Free Flight mode where the player can pick from 5 different combat game modes, from Air to Air, Free Flight, Target Drones, Bomber Ambush, or Ground Attack in one of over 15 geographic terrains and choose to fly one of over 120 aircraft and ground vehicles. Gamers choose one of three levels of pilot expertise: Rookie, Veteran, or the highly skilled Ace. In each air battle the player can score points, build rank, and acquire medals on the road to the coveted title of WGFP, 'Worlds' Greatest Fighter Pilot!' Online WarBirds is free to purchasers of the Steam version of WarBirds, with full access to all 225 faithfully modeled aircraft for one month. After the first month, should you not take a subscription to WarBirds, the sim is still FREE to all with six early war aircraft including the Spitfire 1, early Me-109, a B25, C-47, and a tank. Online you can sign up for personal training with WarBird’s corps of flight instructors, compete in air-to-air action against other real players in online combat and join online squadrons. Players can go on raids with squadron mates and participate in special events that reenactment many of the great battles of World War II. More information about the WarBirds online community is available at . In addition, for no charge, all WarBirds Online players have access to a TeamSpeak 3 server. This allows online players to use voice communication within the game. While WarBirds Online is free, IENT is a business, so of course there are limitations. During the first month online, you have complete access to all features at no charge. After the first month, you can still play free, but you are limited to an early war plane set, which varies from arena to arena. To access the full set of all aircraft in all arenas, Steam players can purchase day, week or month passes, which range from $2.99 to $15.95. If you just want to play in a specific event on a specific day, the Day Pass is best for you. If you want to play with the best planes, against the best players, whenever you want, the Monthly Subscription is your best choice. WarBirds continues to dedicate itself entirely to remarkable historical accuracy and detail. After 26 years it is still one of the most impressive WWII combat flight simulations available. Choose from countless online scenarios, modes and options that give WarBirds a stunningly deep playing experience. Pick from over 225 WWII aircraft and vehicles (even tank battles occur if you want to jump in and lead 4 tanks into battle), each with entirely unique combat characteristic and personality, making each online play a new experience. Salute and Check Six!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/365620/header.jpg?t=1635364492",
    "Price": 14.99,
    "Developers": "iEntertainment Network Inc",
    "Publishers": "iEntertainment Network Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_10cd319f2c956bf9d2c139c7297dce4febe185fc.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_313a0ffe54445f01803bd220d4fb7e0f7ae5c9cc.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_9fa444c610441cba049162f1f2089dcc09200ab8.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_99c4ea804a2456cf0cd5db98204ba6656a663a23.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_2ab123d7204d91b41d1c50a1694bbe9b4d6b2f34.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_c364b3d7dda248116017936593d536f7aab7251f.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_17a9643e97e3443b6c6e4c16f6cfb74f3d9376d0.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_cc45a48c52662f890b1b9e8805f28e8e06a26532.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_16b3ac2f34d387b4e6466c6cc49576101d3a1c22.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_4350a86079b4cbdd9a8a4423e20a0e665c0bc7b6.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_1fa0f2f5bef513d29b349bed42ea370a09f95d86.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_b2dfb86cfb2334bbcbf0f82c79b8166135fd05d3.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_08149de28b9ee11eacec8c5db226c938a32dd768.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_30dfcd4a3af052813a6cad6e844629d21f3fd42f.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_b23992c22dc3460f374ebe01cfc15db91742e5bb.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_58d54be77876578d764b2a69b3666882b8420414.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_3ef19b73d7b41d9e0257c2170ae7b1f2e5b84316.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_b4929690ba7d76c048b299fe4bb8c13877354531.1920x1080.jpg?t=1635364492,https://cdn.akamai.steamstatic.com/steam/apps/365620/ss_62e05d1d13dccee78001ba2448eb0f2202eabbc0.1920x1080.jpg?t=1635364492",
    "Slug": "warbirds-world-war-ii-combat-aviation",
    "Meta Title": "WarBirds - World War II Combat Aviation: May 5, 2015, iEn...",
    "Meta Description": "Looking for information on WarBirds - World War II Combat Aviation? Check out the release date (May 5, 2015), developer insights from iEntertainment Net...",
    "Alt Text Image": "Official header image for WarBirds - World War II Combat Aviation game - Steam 365620",
    "Canonical URL": "https://gusku.site/game/warbirds-world-war-ii-combat-aviation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WarBirds - World War II Combat Aviation\", \"description\": \"Looking for information on WarBirds - World War II Combat Aviation? Check out the release date (May 5, 2015), developer insights from iEntertainment Net...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"iEntertainment Network Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"iEntertainment Network Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/365620/header.jpg?t=1635364492\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}