{
    "AppID": 1517970,
    "Name": "Aeterna Noctis",
    "Release date": "Dec 14, 2021",
    "About the game": "Aeterna Noctis is a challenging 2D hand-drawn action platformer, a Metroidvania with thrilling combat that will keep you on the edge of your seat and heart-stopping platform sections that will put your skills to the  test. Play as the King of Darkness and explore 16 connected areas in an epic journey to regain your powers.  Unnumbered years ago, the supreme god Chaos created the Universe and the world of Aeterna. After populating it with different races and creatures, he appointed powerful rulers to govern them and show them the way. But soon they turned against their Creator, seeking to take the world for themselves; and gathered their subjects in two groups that fought each other -- and thus gave rise to war, death and hatred. The all-powerful Chaos was angered, and in His terrible wrath He cast a terrible curse upon the rebellious leaders. He named them King of Darkness and Queen of Light, and condemned them to keep fighting each other forever, until the end of time. Not even death would free them from this doom, for Chaos granted them the Gift of Immortality -- so that even if one managed to defeat the other, they would be reborn, and regain their powers to continue their eternal war.  Difficulty level The world of Aeterna Noctis features a challenging difficulty system that scales progressively as you the player go through the game and get more experienced with the controls and unlock new skills. It keeps you on the edge of your seat, always offering a challenge with each encounter, but also resulting in a great sense of pride after completing each challenge. If you are a lover of Metroidvania games, in Aeterna Noctis there is a perfect game mode for you, the Aeterna Mode. However, if extreme challenges and platforming are what you want, you are a Noctis Mode player. But do you know what the differences are between these game modes? We explain it to you. - Aeterna Mode (A pure Metroidvania experience) In essence, the game has been completely redesigned to offer you as a player a 100% Metroidvania experience where action and exploration are the protagonists. If it's one of your favorite genres, don't miss the opportunity to get lost in a huge open world with 16 unique areas and hundreds of enemies with unique mechanics. The challenge lies in recovering your power and facing fearsome final bosses that will demand the most of you. - Noctis Mode (Platforms and extreme challenges) We could say that for the first time two genres such as Metroidvania and platform games have been mixed. Playing on this mode, you will not only have to explore and recover your powers, but you will also face constant puzzles, platform sections and challenges only recommended for the most demanding players. If you think this is not for you, we do not recommend playing on Noctis Mode since frustration can ruin the experience. This mode includes all the achievements, so it is also ideal for completionist players or for those who, after beating Aeterna mode, want to enjoy the title again with more difficulty. In Aeterna Mode, the spikes have been removed from the platforms to make it easier to fight the enemy. This way you can slide and lean on the platforms without worrying about environmental hazards. In Aeterna Mode, the chainsaw puzzle is replaced by an enemy encounter. This way the gaming experience is more focused on exploration and action, moving away from more challenging puzzles. In Aeterna Mode, environmental hazards have been removed so navigation through the level is less demanding and doesn't require pinpoint accuracy. In Aeterna Mode, you have more hazard-free space to jump, dodge, and attack enemies. In Noctis Mode, you are required to be more precise with the controls to avoid all environmental hazards, such as spikes. Playing in Noctis Mode you have to pay attention to breakable platforms and time your jumps correctly, while in Aeterna Mode you can move more freely without the need for precise jumps and dashes. What if I started in Noctis mode and the difficulty is too much for me? Or... What if I started in Aeterna mode but want a more challenging experience? The player can switch between one mode or the other at any time without losing progress and reloading the game at the last save point, allowing the Aeterna Noctis experience to be shaped at your will. Fluid gameplay mechanics In a game with such a difficulty curve that scales with progression, Aeterna Noctis features extremely responsive controls, allowing for precise movement and combat. High mobility Intuitive world design allowing the players to exploit the precise movement controls of the character, allowing you to overcome each challenge in a multitude of ways. As you become more skilled in the game, it allows you to get even faster completion times.  Deep, beautiful plot Featuring an immersive and emotional story with incredible moments, filled with unexpected twists that will immerse the players into the rich world of Aeterna Noctis. Traditional 2D Art Worldbuilding in Aeterna Noctis is completed by handcrafting each asset, animation and environmental detail in the game using traditional illustration methods by the art team, giving rise to a vibrant and beautifully assembled world. Freedom of choice Aeterna Noctis features a defined path for the storyline, but allows the player to take whatever path and pacing to navigate the expansive non-linear map featuring 16 different zones, interconnected in a classic metroidvania style.  More than 40 music tracks Aeterna Noctis features over 40 unique tracks each with its own theme. Once the game is made available, the OST will be released with special covers of the main songs as a piano collection",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1517970/header.jpg?t=1658830290",
    "Price": 29.99,
    "Developers": "Aeternum Game Studios S.L",
    "Publishers": "Aeternum Game Studios S.L",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_fca0a81d7a6ab245990b60aa246fb54108fb7a16.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_7450d04fd0357d4c00683270724e2312726784b3.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_6d6790d4aadf2316649943176ec404571c331af8.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_3a1043618acf056a9fbc07aee30c43f1811f80fa.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_ea44ee0b599f3087f01a43e7a9e87bd403eaac47.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_bf914d419167f9e7a711a18b38779860c95a3902.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_615a0d014743f36dc6194195d1419763cff097da.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_94490ec24e5a35d73c83c6912e35e549f7eda707.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_8fb3f9ed863a9913ef7004141fe30156d160c3bf.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_c033a80226a550c36ef21edcd5615c72329ff249.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_be55155527da677382bbd298652e7cb41c48f3c3.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_2f53ba5e90805d24d56375506287f40a4c990222.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_1b896c993a23fe9b5f2a1e4fb4f759f68e3c989d.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_1f72b90274e6073a17a4863ca642cda4c080eaf4.1920x1080.jpg?t=1658830290,https://cdn.akamai.steamstatic.com/steam/apps/1517970/ss_c05d29887db06875837594b000de9de8bbe4cbb2.1920x1080.jpg?t=1658830290",
    "Slug": "aeterna-noctis",
    "Meta Title": "Aeterna Noctis: Dec 14, 2021, Aeternum Game Studios S.L a...",
    "Meta Description": "Looking for information on Aeterna Noctis? Check out the release date (Dec 14, 2021), developer insights from Aeternum Game Studios S.L, and a complete ...",
    "Alt Text Image": "Official header image for Aeterna Noctis game - Steam 1517970",
    "Canonical URL": "https://gusku.site/game/aeterna-noctis",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aeterna Noctis\", \"description\": \"Looking for information on Aeterna Noctis? Check out the release date (Dec 14, 2021), developer insights from Aeternum Game Studios S.L, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aeternum Game Studios S.L\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aeternum Game Studios S.L\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1517970/header.jpg?t=1658830290\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}