{
    "AppID": 877010,
    "Name": "Beyond Contact",
    "Release date": "Sep 21, 2021",
    "About the game": "Beyond Contact is a fiercely formidable survival game, inspired by the art and style of pulp science-fiction comics, the moral dilemmas of contemporary science-fiction films, and the unforgiving gameplay of survival genre classics. Taking place on the often mysterious and always deadly, procedurally-generated, alien world of Ketern, Beyond Contact features exploration and discovery, a robust system of research and crafting, intuitive base building and defense, farming and creature feeding, narrative-driven objectives to save the inhabitants of the planet, and enough flora, fauna, extreme weather, and environmental hazards to kill even the toughest players 1000 times over... and trust us if the planet gets the chance, it will. In the year 2766, Quinn Hicks an elite member of Space Corps, the expeditionary arm of the UWC, is called in to respond to a growing crisis at the edge of known space. The planet of Ketern is breaking apart, a yet unknown energy source emanating from the planet's interior is threatening the civilization that calls Ketern home... Beyond Contact offers Campaign and Endless game modes for both solo and cooperative multiplayer experiences. Can you survive the dynamically diverse, robustly detailed, and unquestionably deadly world of Ketern? Utilize your Space Corps-issued equipment, weapons, and AtmoSuits to explore the diverse alien environments, discover extraordinary creatures and unusual plants, and eventually come face to face with the ancient civilization of Ketern. Scan, collect, mine, and scavenge the planet's exotic materials while utilizing the deep and rewarding research and crafting system to survive and thrive the dying planet and its often aggressive inhabitants. Build, expand, and defend your base of operations, while pushing the unique power grid system to its limits. Collaborate with alien civilizations, discover previously unknown technology, and uncover the truth of the planet's demise along your journey to help the locals. Ripped apart by an onslaught of dark rifts, Ketern's once-thriving biomes are being overtaken by dangerous hazards and chaotic weather fallout. Do you have what it takes to survive?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/877010/header.jpg?t=1651135894",
    "Price": 14.99,
    "Developers": "Playcorp Studios",
    "Publishers": "Deep Silver",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/877010/ss_9c7094cefcf634760ccfb216957cd974c2681156.1920x1080.jpg?t=1651135894,https://cdn.akamai.steamstatic.com/steam/apps/877010/ss_df544a8b934430ae7a5ab07b7fb81c4a0f6bae49.1920x1080.jpg?t=1651135894,https://cdn.akamai.steamstatic.com/steam/apps/877010/ss_e3b52983a82eed2f7d6c17006af7ee93c1ccadf7.1920x1080.jpg?t=1651135894,https://cdn.akamai.steamstatic.com/steam/apps/877010/ss_0d78c6c76402197d5fa448ab00496aa36a8c62de.1920x1080.jpg?t=1651135894,https://cdn.akamai.steamstatic.com/steam/apps/877010/ss_7e77b50ed2f1a212a6b79eecd486258c02f3796b.1920x1080.jpg?t=1651135894,https://cdn.akamai.steamstatic.com/steam/apps/877010/ss_666a7d5dd73d3f227eafe1585ffad7e1fdd8fa90.1920x1080.jpg?t=1651135894",
    "Slug": "beyond-contact",
    "Meta Title": "Beyond Contact: Sep 21, 2021, Playcorp Studios and Full O...",
    "Meta Description": "Looking for information on Beyond Contact? Check out the release date (Sep 21, 2021), developer insights from Playcorp Studios, and a complete game summ...",
    "Alt Text Image": "Official header image for Beyond Contact game - Steam 877010",
    "Canonical URL": "https://gusku.site/game/beyond-contact",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beyond Contact\", \"description\": \"Looking for information on Beyond Contact? Check out the release date (Sep 21, 2021), developer insights from Playcorp Studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Playcorp Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep Silver\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/877010/header.jpg?t=1651135894\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}