{
    "AppID": 623320,
    "Name": "Button Button Up!",
    "Release date": "Aug 9, 2019",
    "About the game": "Button Button Up! is a party adventure game that combines single player, cooperation and battle. In addition to the operations of other platform jump games, we have also added an unusual play mechanism. You can use a series of useful skills at will, including sewing buttons in the air to achieve stagnation, kicking other buttons to avoid or shift, and blocking dangerous lasers of the same color as yourself. Attention! Don‘t touch any laser different from your own color, it will burn you up! Single entry Unique game style and role, buttons of four colors correspond to four different levels respectively, four carefully designed maps, each has very rich game mechanism and decryption levels, each small level can play to another completely different game experience, levels can also collect various small gifts, collect small gifts in the store to exchange your favorite clothing! Double cooperation The abundant content consists of three double checkpoints, each with a boss checkpoint, all kinds of obstacles to build up infinite patterns of checkpoints! Two people play together can get more fun, using the button shape change to cover teammates through many obstacles! Cooperate with your friends and think harder to pass the barrier! Although the game is designed for two people, we have introduced a single challenge mode. You can use the keyboard or the handle to operate two characters to go through customs alone, or you can use the handle to complete a single challenge mode to win a single achievement. Some extremely difficult levels may still call for help from your peers.[/list] Panzer bandit Many weapons! Use weapons such as missiles, mines and traps to eliminate your friends!The four-person local online self-hi mode is easy to use, fast paced and full of joy! Attention! Game support: 1 or 4 handles, multiple keyboards. It’s up to you. Of course, we strongly recommend handle operation: D ( Only 4 players can play at most ) Main features Three different experience game modes Unique retro pixel style The cool cooperation that can’t be missed Hard core game experience All kinds of checkpoints Steam achievements, Cloud Storage, Interchange Cards ( Later ) Interesting hidden levels await your exploration.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/623320/header.jpg?t=1616664510",
    "Price": 11.99,
    "Developers": "Centrosphere Games",
    "Publishers": "Centrosphere Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/623320/ss_10bba0ffabbba5e31810fda78db0f913ae0034ba.1920x1080.jpg?t=1616664510,https://cdn.akamai.steamstatic.com/steam/apps/623320/ss_7d3a3629a61eb7953889299797878c7c5bf06740.1920x1080.jpg?t=1616664510,https://cdn.akamai.steamstatic.com/steam/apps/623320/ss_13e4b2b390ce7a5f8a21b992138b3c541310ba9d.1920x1080.jpg?t=1616664510,https://cdn.akamai.steamstatic.com/steam/apps/623320/ss_36858db902c242809d27b34153f870ce49a1ed1a.1920x1080.jpg?t=1616664510,https://cdn.akamai.steamstatic.com/steam/apps/623320/ss_5b4944bbfe1f7ac2e034e0d6b123094ca80e1c32.1920x1080.jpg?t=1616664510,https://cdn.akamai.steamstatic.com/steam/apps/623320/ss_41e3916f7c4ef5a6d0361cbc3894b8df8f29b310.1920x1080.jpg?t=1616664510",
    "Slug": "button-button-up",
    "Meta Title": "Button Button Up!: Aug 9, 2019, Centrosphere Games and Fu...",
    "Meta Description": "Looking for information on Button Button Up!? Check out the release date (Aug 9, 2019), developer insights from Centrosphere Games, and a complete game ...",
    "Alt Text Image": "Official header image for Button Button Up! game - Steam 623320",
    "Canonical URL": "https://gusku.site/game/button-button-up",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Button Button Up!\", \"description\": \"Looking for information on Button Button Up!? Check out the release date (Aug 9, 2019), developer insights from Centrosphere Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Centrosphere Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Centrosphere Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/623320/header.jpg?t=1616664510\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}