{
    "AppID": 1957070,
    "Name": "Click and Collect",
    "Release date": "Jun 20, 2022",
    "About the game": "Features Arcade high score chasing gameplay Pleasing 3D visuals 16 level campaign with procedural customer orders Endless mode for both small and large level layouts with procedural customer orders 6 randomly occurring hazards to challenge you 8 useful Assists to overcome hazards 3 special level types to add even more challenge and strangeness Catchy original music Click and Collect challenges you to serve as many customers as possible within a time limit to earn the maximum 3 stars on each level and keep your customers happy in your store. It starts off easy enough, you just need to provide customers with their orders, grabbing the boxes from the conveyor belt and passing them to the correct customer. Before long, however, things get more hectic. Electrical malfunctions, fires, puddles, thieves, and your manager are hazards to your efficiency and threaten to ruin your customer service. Help is at hand Click and Collect features 8 Assists you can purchase with in-game currency to help you manage your customer’s orders. A speed boost gives you that extra spring in your step to get to items and customers quicker. Boots allow you to stroll through puddles without slipping and dropping anything you’re carrying. A fire-proof suit grants resistant to fire for you and anything you’re holding. A mechanic can be summoned to keep your conveyor belt running at the correct speed. The manager’s schedule can be utilised to prevent your manager stepping out onto the shopfloor and berating you if you get too close. A security guard can be summoned to scare away any thieves who mean to steal away customer’s orders. A generator can be utilised to keep the lights on during any power cuts. Finally, a special Assist that clears all obstacles can be used when things get tricky. That’s strange… Strange occurrences also threaten to make your quest for customer satisfaction more difficult. Time dilation, random teleportation, bouts of memory loss in customers, these add an extra level of challenge to overcome Unpredictable With procedurally generated customer orders and randomly occurring hazards, Click and Collect is a hectic and compelling arcade, strategy action game that keeps you on your toes throughout the 16 standard levels and 4 Endless levels. Keeping a healthy supply of Assists ready to use, and strategising about what customer orders to prioritise is an engaging challenge.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1957070/header.jpg?t=1655727698",
    "Price": 1.99,
    "Developers": "Greg Giddens",
    "Publishers": "Peacock Pie Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_7c17cb249b735c05d535ddfff4d78184175baefe.1920x1080.jpg?t=1655727698,https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_9ac7658d8337b2cc4de98bd6bfa732a2e55ccb14.1920x1080.jpg?t=1655727698,https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_abddecc4c6532056a9e75964af889f08ecb482d6.1920x1080.jpg?t=1655727698,https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_34148c19b2c71c12bd5adc9ca930d565ca913b13.1920x1080.jpg?t=1655727698,https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_b1f186de4e44bdf11275cd4bcee47e2f875d0823.1920x1080.jpg?t=1655727698,https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_fa5635029cd93e1758de97901293a8b86c046e59.1920x1080.jpg?t=1655727698,https://cdn.akamai.steamstatic.com/steam/apps/1957070/ss_629d0f76e1f4f883818c1e81d2b401f718570cd0.1920x1080.jpg?t=1655727698",
    "Slug": "click-and-collect",
    "Meta Title": "Click and Collect: Jun 20, 2022, Greg Giddens and Full Ov...",
    "Meta Description": "Looking for information on Click and Collect? Check out the release date (Jun 20, 2022), developer insights from Greg Giddens, and a complete game summary.",
    "Alt Text Image": "Official header image for Click and Collect game - Steam 1957070",
    "Canonical URL": "https://gusku.site/game/click-and-collect",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Click and Collect\", \"description\": \"Looking for information on Click and Collect? Check out the release date (Jun 20, 2022), developer insights from Greg Giddens, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Greg Giddens\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Peacock Pie Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1957070/header.jpg?t=1655727698\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}