{
    "AppID": 1866600,
    "Name": "Damsels of Vice",
    "Release date": "Feb 11, 2022",
    "About the game": "Don't become just another damsel in distress! The evil Dr. Adelle “Ada” Vice is about to plunge Infinity City into a kinky crisis, transforming all of the citizens into loyal and horny bimbos made to serve her through her latest breakthrough, BIMBOSIS! Two of the city’s greatest superheroines, Bondgetta and Heatstroke, must stop her before it’s too late… but OH NO! They too have fallen under the erotic effects of “bimbosis” and must not only struggle against evil henchmen, slime creatures and criminal thugs, but also against their own burning desires of love and lust. Damsels of Vice is an erotic RPG that takes action-packed combat and gives it a kinky twist. Fight against various villains as they beat, bind and seduce our two sexy superheroines who will turn into bimbos if they can’t resist their foes. Enemies will cause special status effects called “Perils” that change the rhythm and flow of combat while they struggle to escape! Oh, and if you let your Resistance reach zero, you're f*cked. Literally! Take turn-based combat to the next level with special Action Sequences! These are special button prompts that accommodate most enemy attacks. Press the correct arrow key fast enough to lessen or avoid incoming attacks and mischievous extra effects. Be warned, however, because true villains cheat! Some enemy skills will punish you for succeeding and reward you for failing. Power Up! Your heroines level the way YOU want them to with the dynamic skill system. Use extra Lewda earned from combat and treasure chests to give Bondgetta and Heatstroke access to new skills, powerful passives and extra stat points throughout their journey! With all of the tricky villains and hidden traps, they will need all of the help they can get. Avoid hidden traps and travel to four different dungeons, each one introducing a new Peril! Take combat to the next level with Action Sequences that give enemy attacks special button prompts that give the heroines a chance to alter the end result… If they succeed. Struggle out of Perils such as being bound, getting covered aphrodisiac slime and being sealed in skin-tight latex. Customize the heroine’s skills and stats through the Power Up system! Too easy? Too hard? Never fear! Change the difficulty at any time to slow things down or speed things up. A total of ten achievements to earn in this light-hearted, extra erotic adventure! Controls: Arrow Keys - Move Enter or Z Key - Confirm Esc or X Key - Cancel or Menu (Outside of Battle) Shift Key (Hold) - Sprint/Move Fast Tab Key (Hold) - Fast-forward Dialogue Let's promote sex positivity and stay kinky my lovely perverts!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1866600/header.jpg?t=1644611060",
    "Price": 9.99,
    "Developers": "Overlord Empire LLC",
    "Publishers": "Overlord Empire LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_96e59166e6dbc170ab49476b1f820427b4dd577e.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_60751985ce32ec7bc999cada462bc7cea8915ede.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_667835475e13fac7c1eb73b528c83c91f3e19eb9.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_8c79800c61945347de51ab77db5624df747ac846.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_a4060b29e1c3587de83a7138724368da21af8d9b.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_4b92f9ec623152d93ce0b3945a9d1ce4e15b3c18.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_6841afbfcbb59614e96fe23799c59e54f8192ef0.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_d3f26025c02a51d25bcffbe6ee4e6ca6b6c531b5.1920x1080.jpg?t=1644611060,https://cdn.akamai.steamstatic.com/steam/apps/1866600/ss_43285b8f6587373bcb15d443a4c70d58eb1a1995.1920x1080.jpg?t=1644611060",
    "Slug": "damsels-of-vice",
    "Meta Title": "Damsels of Vice: Feb 11, 2022, Overlord Empire LLC and Fu...",
    "Meta Description": "Looking for information on Damsels of Vice? Check out the release date (Feb 11, 2022), developer insights from Overlord Empire LLC, and a complete game ...",
    "Alt Text Image": "Official header image for Damsels of Vice game - Steam 1866600",
    "Canonical URL": "https://gusku.site/game/damsels-of-vice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Damsels of Vice\", \"description\": \"Looking for information on Damsels of Vice? Check out the release date (Feb 11, 2022), developer insights from Overlord Empire LLC, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Overlord Empire LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Overlord Empire LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1866600/header.jpg?t=1644611060\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}