{
    "AppID": 1619350,
    "Name": "DeepStates [VR]",
    "Release date": "Jun 18, 2021",
    "About the game": "DeepStates [VR] - Experiences designed to calm your mind and drift away. Wind down in compelling natural environments with dense atmospheres. Let the scenery sink in and whenever you are ready activate the DeepGuide, which uses breathing, humming, spatial sounds and entrainment with brightness-, volume- and haptic modulation, as well as binaural beats to get you deep. After a guided session aspects of the environment and mood will have transformed. After choosing one of the (currently six) available environments you can explore it using teleport or smooth locomotion. In each environment you can control certain parameters (e.g. time of day) using your thumbsticks / trackpads. Additional controls for image, sound, locomotion, performance, as well as settings for the DeepGuide (e.g. session length, manual or fixed guided tempo) can be accessed via the radial menu. There you will also find additional information regarding the specific controls for each environment and its modes. The application knows three modes: Default, DeepGuide and Afterglow. What it is NOT Don't expect fast-paced action, gamification/quests, huge open-world levels or complex scene interaction (more interactions with the environment are likely to follow though). Please take a look at the recommended specs and try the demo first to test performance and VR headset/controller compatibility. This application is resource intensive. - Much care is taken to optimize it, while still trying to keep a decent quality. It's a tight-rope walk - especially with VR. The hope is that you don't have to care too much about technical acpects or performance issues and can just enjoy the application. If you encounter any issues or have feedback of any sort, feel invited get in contact via Steam Discussions or Discord before writing a review . There you can also access more infos about known issues and solutions , change-log and roadmap . Developer's note (Marc Zimmermann aka. epicscapes): In DeepStates [VR] I combine my passion for using environments to convey feelings and emotions, with my interest in the manifold realm of altered states of mind. For this application I create places that I personally have a strong longing for and which tend to give me this certain vibe, a mixture of 'the joy to be alive here and now' and a feeling of 'melancholia', since all of it will come to an end eventually. My goal is to create interesting, soothing and deep, meaningful states of being. I dearly hope that these experiences will provide value for you and enrich your palette of being.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1619350/header.jpg?t=1652550354",
    "Price": 11.99,
    "Developers": "Marc Zimmermann",
    "Publishers": "EpicScapes",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1619350/ss_12a9a5370bb39075b14ed9d0409e42680d3baff2.1920x1080.jpg?t=1652550354,https://cdn.akamai.steamstatic.com/steam/apps/1619350/ss_81c55be153828067cb8d3e482243c81ef5b58716.1920x1080.jpg?t=1652550354,https://cdn.akamai.steamstatic.com/steam/apps/1619350/ss_66edaca1f2f15cc90a930fbfcf16e3721a3e4bbf.1920x1080.jpg?t=1652550354,https://cdn.akamai.steamstatic.com/steam/apps/1619350/ss_1260a8c9b0aec010cda404a570805dbbd54b146b.1920x1080.jpg?t=1652550354,https://cdn.akamai.steamstatic.com/steam/apps/1619350/ss_f5127188be7a8692c10c1cf588049b9b72aaeda2.1920x1080.jpg?t=1652550354",
    "Slug": "deepstates-vr",
    "Meta Title": "DeepStates [VR]: Jun 18, 2021, Marc Zimmermann and Full O...",
    "Meta Description": "Looking for information on DeepStates [VR]? Check out the release date (Jun 18, 2021), developer insights from Marc Zimmermann, and a complete game summ...",
    "Alt Text Image": "Official header image for DeepStates [VR] game - Steam 1619350",
    "Canonical URL": "https://gusku.site/game/deepstates-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DeepStates [VR]\", \"description\": \"Looking for information on DeepStates [VR]? Check out the release date (Jun 18, 2021), developer insights from Marc Zimmermann, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marc Zimmermann\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EpicScapes\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1619350/header.jpg?t=1652550354\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}