{
    "AppID": 1568940,
    "Name": "花妖物语/Flower girl",
    "Release date": "Sep 15, 2021",
    "About the game": "The game is FREE PLAY with the First Girl Character. You can try fully experience first, then you will decide to purchase the DLC for other five girls if you like her. Come on. Our sexy flower girls are waiting for you. Let's do it！ [Game Introduction] ' Flower Girl ' is a 'Sexy Flower Elf+ Flower Match-3 game + GALGAME' combination of casual games. You will play a mission as a 'Royal Spirit Master'. In order to save your lover, you will go to the legendary land of flower elf, and encounter all kinds of flower elf on the way. Whether to kill or capture is up to you. [game features] ◆More than 80 delicate CG pictures. ◆Many Japanese Voice Actress's dedication! ◆Full-screen experience with ultra-broadband fish screen resolution! ◆New Match-3 Game experience, feel the Magic of Jet Fighter! ◆Live2D animation upgrade again! The clothes breaking system! Let's Do it! ◆The game will give you sexual pleasure through the multi-way drama. Enjoy the spirit master adventure in the world of Flower Girl! role introduction Clover: Suzu (Ling) Cup size: D Height: 152CM Circumference: 88-70-85 Representative color: Green Flower language: Happiness, Waiting for love to appear Actual age: 109 (flower elf from 100 yrs old. The older the age, the more powerful the magic. Also she will be divided into flower species, four-leaf clover flower elf maximum age is 280 yrs) Special ability: The secretion of flower juice to make human hallucinating to enhance the pleasure. Character Dscription: Naive and lovely, curious. Often observed by humans and imagined pixies in her image. Her duty is to prevent humans from entering the flower domain. Since she is too naive and reckless, she often cannot perform her task well and is assigned to the periphery of the flower domain. Sakura: Sakura (Ying) Cup size: E Height: 161cm Three circumference: 95-75-95 Representative color: Pink Flower language: Love and Hope, Simple and Pure Love Actual age: 117 (flower elf 100 yrs from becoming a elf, the older the age, the more powerful the magic. Also she will be divided into flower species, cherry blossom flower elf maximum age is 300 yrs). Special ability: no fight ability. The training ability，the body as smooth as cherry blossoms；the body will heat up and become pink tinged with red; the body is very soft, touching as into the cotton dough but will be fully squeezed, such as the feeling of gentle hand caress. Character Description: Suzu's best friend, although a non-fighter, but still will try her best for the best friend. She have weak character and willpower. She is easy to cry when encountering difficulties, and is easily persuaded since she is so gentle and submissive. Rose: Rose(Yao) Cup size: F Height: 167cm Three circumference: 108-86-92 Representative color: Red Flower language: Love thoughts / hot love / paranoid love Actual age: 129 (flower elf from 100 yrs to become a elf, the older the age, the more powerful the magic. She will be divided into flower species, the highest age of the rose elf 350 yrs) Special ability: The wounds will auto heal. In lovemaking, the secreted flower juice can delayed cum. Character Description: Same genus of Rose as Sakura, is Sakura's cousin. She has a very strong combat talent, competitive nature. She has trained for years to be very tenacious and refuses to admit defeat easily, but she deeply desires to be loved rather than feared. She is arrogant and poisonous. Tulip: Sleeve (Xiu) Cup size: I Height: 170cm Three circumference: 133-100-120 Representative color: Golden Flower language: Mysterious, Noble, Unique Leadship, Honor of the Crown Actual age: 156 (flower elf 100 yrs from becoming a elf, the older the age, the more powerful the magic. She will be divided into flower species, tulip flower elf maximum age is 460 yrs). Special ability: The fragrance emitted from her body can make humans unconsciously be controlled the mind, then unconsciously love her, and eventually become her captive. The training ability is to share pleasure through fragrance and control each other's sensitive points. Description: A noble branch of the flower elf world. Noble, elegant and sensual, but deeply in her heart she has a strong desire to control, and a sadistic heart under her polite appearance. She is jealous of the intruder's strength and tries to take control of the intruder, but to be conquered instead. Violet: Purple (Zi) Cup：G Height: 158cm Three circumference: 113-88-95 Representative color: Purple Flower language: Eternal beauty and love /Loving in the dream world. Actual age: 190 (flower elf 100 yrs from becoming a elf, the older the age, the more powerful the magic. She also will be divided into flower species, violet flower elf maximum age is 500 yrs) Special ability: Absorb human into the dream. In the dream world, she defeat the enemy. Training skill can use the ability to change a variety of impossible scenarios, role-playing, as well as to do the impossible. There is no refractory period in the dream. Man can infinitely launch and infinitely be hard. Character description: Reckless; No sense of morality; Crazy beauty; Mandalore's loyal followers; Determined to carry out Mandalore's instructions; In order to steal people from Tulip, even sacrifice her own body. She is hard communication and only be herself, as if she is living in a dream. Mandala：Yueh（Yu） Cup size: H Height: 178cm Circumference: 123-95-110 Representative color: Black Flower language: Infinite love, is revenge, unpredictable death Actual age: 999 (flower elf 100 yrs from becoming a elf, the older the age, the more powerful the magic. She will be divided into flower species, mandala flower elf can live forever, but she will encounter a disaster every nine years, and a huge disaster every a thousand years. She can keep living only if she can pass the weakness period. Special ability: Absolute control, making human lose all the ability to resist. Training skill：Let people forget the pain, only retain the pleasure. Can make humans have part of the elf's ability. If you can make her wet by the flower juice, only if touching is the ultimate pleasure. In addition, she also has the ability to make people make a dream. Unlike Purple, her dream is unlimited, but she prefers to let people feel the ultimate pleasure in reality. Character description: One and twins, can switch freely. The white personality is sacrosanct, in charge of commandments, holy and majestic, full of ritual. The black personality rules savage torture, degenerate and lost. As the Queen of flower domain, She rule the flower domain firmly with the two personalities. She is disgusted with human beings, but she make use of human beings to achieve self-evolution. She has been selecting and test suitable human if she is interested.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1568940/header.jpg?t=1658744297",
    "Price": 0.0,
    "Developers": "OHIYOsoft",
    "Publishers": "OHIYOsoft,BVRgames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_0dac7c6f165b374f58342ac07b9b10ac0278e4bf.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_e0897a04a169b74e89c0dd63cb58c4336fc01446.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_db0a5137f8a524f2fa7528280173aefa493db04a.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_27adfa6509653a200ab5d82732ab133a37dd70c6.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_3fc3a383f5752e60a64d95f36098fbc5314dc144.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_eab1d43a6196c5dabfe86c6b7e833c6560a1ce09.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_f75be2a559806c3ea86210bf809e34fc85fed175.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_d077f17b68120a58bf012f66e33b423a82f33e45.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_ebd3be960e0cc9028f80c49a5611ce2b2c1147e6.1920x1080.jpg?t=1658744297,https://cdn.akamai.steamstatic.com/steam/apps/1568940/ss_fb01c2a85bb427d2ccf4b2e3d27716340178a212.1920x1080.jpg?t=1658744297",
    "Slug": "flower-girl",
    "Meta Title": "花妖物语/Flower girl: Sep 15, 2021, OHIYOsoft and Full Overview",
    "Meta Description": "Looking for information on 花妖物语/Flower girl? Check out the release date (Sep 15, 2021), developer insights from OHIYOsoft, and a complete game summary.",
    "Alt Text Image": "Official header image for 花妖物语/Flower girl game - Steam 1568940",
    "Canonical URL": "https://gusku.site/game/flower-girl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u82b1\\u5996\\u7269\\u8bed/Flower girl\", \"description\": \"Looking for information on \\u82b1\\u5996\\u7269\\u8bed/Flower girl? Check out the release date (Sep 15, 2021), developer insights from OHIYOsoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"OHIYOsoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OHIYOsoft,BVRgames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1568940/header.jpg?t=1658744297\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}