{
    "AppID": 1070990,
    "Name": "Flux",
    "Release date": "May 24, 2019",
    "About the game": "FLUX presents a variety of experiences: Interactive fiction and a series of mini-games that challenge you to type, hack-n-slash, organize or fidget to maintain speed, volume and maximize your rewards to earn cosmetic-buying in-game credits. Designed to allow players to alternate between chill and twitch-based game modes, the game provides players with a number of activities to engage with.​ Wanderer, an ex-military courier, spends their nights joy riding/flying through the streets/skies of a sprawling cyberpunk cityscape. Working opposite shifts with their long-distance flame, Mulberry, they exchange messages with one another as one wakes and the other heads to bed. Learn more about the two as they exchange stories, get to know one another better, and reveal mysteries that are left open-ended. ​​​​​​Numerous Genres in One: Fiction, Beat-em-up, Typing, Fidget, Rhythm, Reflective Meditative Minigames: Take on a variety of jobs that assume different genre’s goals and objectives, each with a unique pace. Cosmetics + Cybernetics: Earn credits throughout your experience and spend them on new outfits, helmets, hairstyles and augments for your body. Customizable and Chill Tunes: Listen to the 80s Chillwave groove provided by Quantum Dylan or replace the provided .mp3 files in the install directory and create your own soundscape! Compelling World: Text your girlfriend, listen to the news, interact with your environment and converse with locals to learn more about the game’s characters and world.​​ ​ Built in Flash: Yeah, THAT Flash, which means the file size is small and loading times are nonexistent! Flux's game modes are treated as 'jobs' each day. By participating in one, you shift the game forward in time and engage in one of the game's types of play. Each mode has a Flux value, representing volume/speed, that increases or decreases depending on the mode.​ Freestyle: A fidget style game where you define your own rhythm, reflect and zone out to the beat. Challenge: A typing-oriented game where you are given random letters A-Z to press. This tests your awareness of each letter's position on the keyboard. Spelling: A typing-oriented mode where you are tasked with spelling out entire words to increase your Flux. Glyph: A visual challenge where you must rotate the objects on the right with the arrow keys to match the positions of the objects on the left. Rash+Slash: An action-oriented mode that pits you against incoming enemy robots. Use your trusty katana to cut your way through the enemy! Assault: A beat-em-up mode that throws you into the heat of battle, challening players to survive a gauntlet of robots and enemy soldiers that are armed to the helmet with special attacks, a variety of weapons and keep on coming in waves. Mecha: Like Freestyle, but in the open skies above the city. Reflect, find your groove and enjoy the view. Armament: An action-oriented mode that has you defending the skies with your Mech airship. Take out the incoming robots with your blasters! In order to add your own music you must have the following: an mp3 format music file, the file renamed to 'track1', 'track2', 'track3', 'track4' or 'track5', and finally the file must be added to the game's included Music folder. Once the game is run it'll automatically load up these tracks sequentially as you begin to cruise. If you want to play another song, simply stop cruising and begin again to 'skip' that track!​",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1070990/header.jpg?t=1602704865",
    "Price": 6.99,
    "Developers": "Mars Ashton",
    "Publishers": "Mars Ashton",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_af8e4d8ae2a7046d59fe8d954f27e7d8460d312e.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_5e9dda1092d331af474a3661742b66a96c4f1691.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_467992dec51818c5473fe8b3702d5d8560d9a3ac.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_cf4a997d4a4d32519d7e5afac24b6db33c8e7efc.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_f0a3769b3812d65d92a7e56379c7c63c9d9d9b2d.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_b8cb897025c413660d5c64e1402ec34908dea8ee.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_59d5f4ae15ad05dde01443c52c40dc7eda249630.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_3d27c93feeec8739ba9bec03b3432e7a5a74bb91.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_3c7759a292efdfe88bee33a17e2fdeaa029b055a.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_b394b66dcf440a84c999c80fcdaf6c36dc22d983.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_b5ddb0e8c8e3e67c84c5457070f73d522b222f72.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_d529f4f465c325037cc3e1b7f5e941f21d351fc7.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_f2c4fff4433ea9209d7981098f9f5aafdd3f1441.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_765cec4b6f8a184e4916d18c84536dc77ccca714.1920x1080.jpg?t=1602704865,https://cdn.akamai.steamstatic.com/steam/apps/1070990/ss_f322796ff368d9f4f59a0a23a5a5cdf128696389.1920x1080.jpg?t=1602704865",
    "Slug": "flux",
    "Meta Title": "Flux: May 24, 2019, Mars Ashton and Full Overview",
    "Meta Description": "Looking for information on Flux? Check out the release date (May 24, 2019), developer insights from Mars Ashton, and a complete game summary.",
    "Alt Text Image": "Official header image for Flux game - Steam 1070990",
    "Canonical URL": "https://gusku.site/game/flux",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flux\", \"description\": \"Looking for information on Flux? Check out the release date (May 24, 2019), developer insights from Mars Ashton, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 24, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mars Ashton\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mars Ashton\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1070990/header.jpg?t=1602704865\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}