{
    "AppID": 1283630,
    "Name": "Frog Bath",
    "Release date": "Jun 9, 2020",
    "About the game": "Frog... Bath? In this froggy kingdom, it is every young frog's dream to be able to bathe their Frog King. He's... really not sure why, but he has no complaints; he's getting a free bath after all! In fact, the Frog King has encouraged all frogs to compete against one another in giving him the best bath possible. Every single frog in the land has jumped at the opportunity to shower the Frog King, and the event has turned into a spectacle and - quite honestly - the only thing the frogs even care about now. So get your friends, grab some soap, and prove that you are the best at bathing His Cleanliness! Frog Bath is a multiplayer action platformer with an emphasis on froggy movement. Players fight over bath items by using their different movement abilities in order to deliver it to the Frog King and give him the bath he deserves. By combining their different types of jumps and their sticky tongue, players can move all over the map in order to gain the edge on their amphibian opponents. But watch out! Players can use their tongue to stun you or even steal the bath item from out of your possession! Fight back with the bath item, spit it out from far away, or even just tactically hop around your competitors to secure points and become the best at bathing the Frog King. Froggy Features Timing-based jumping abilities Tongue hook-shot and tongue combat One big ol' AI-driven Frog King 2 cute playable frog characters 3 unique levels fit for a king Customization options for your frog How It All Started Frog Bath is a student-made project from Champlain College, which started development with a team of 5 people. After a couple of months of development, the games being produced for the senior Game Studio program had to go through cuts, meaning only some of them would continue into the next semester. Frog Bath was one of 8 games selected by the faculty, allowing us to absorb members from other teams, increasing our size to 14 people! All of us at Lafterburn Studios have been hard at work at making Frog Bath what it is today, and we hope you enjoy!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1283630/header.jpg?t=1591735449",
    "Price": 0.0,
    "Developers": "Lafterburn Studios",
    "Publishers": "Lafterburn Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1283630/ss_72f8c41d767195b623dc136c87f78482c38674f7.1920x1080.jpg?t=1591735449,https://cdn.akamai.steamstatic.com/steam/apps/1283630/ss_0fd5b91dfb8e7acab671f266310957140509b678.1920x1080.jpg?t=1591735449,https://cdn.akamai.steamstatic.com/steam/apps/1283630/ss_5327e95a6567503fe2d3c994c5d43246db5dfdaa.1920x1080.jpg?t=1591735449,https://cdn.akamai.steamstatic.com/steam/apps/1283630/ss_aff0137186f2fc5b06703da2a8e54e34b901765f.1920x1080.jpg?t=1591735449,https://cdn.akamai.steamstatic.com/steam/apps/1283630/ss_c64d05da609eb82a49e8b3ccfd591db9668e647b.1920x1080.jpg?t=1591735449",
    "Slug": "frog-bath",
    "Meta Title": "Frog Bath: Jun 9, 2020, Lafterburn Studios and Full Overview",
    "Meta Description": "Looking for information on Frog Bath? Check out the release date (Jun 9, 2020), developer insights from Lafterburn Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Frog Bath game - Steam 1283630",
    "Canonical URL": "https://gusku.site/game/frog-bath",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frog Bath\", \"description\": \"Looking for information on Frog Bath? Check out the release date (Jun 9, 2020), developer insights from Lafterburn Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lafterburn Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lafterburn Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1283630/header.jpg?t=1591735449\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}