{
    "AppID": 1499540,
    "Name": "リアルタイムバトル将棋オンライン",
    "Release date": "Nov 2, 2021",
    "About the game": "This is not shogi!? The basic rule of shogi, 'Move pieces alternately' has been blown away! Move as many pieces as you like at any time, and if you get the opponent's king as soon as possible, you win! A brain battle that takes place at extreme speeds. 2P battle is also possible. Enjoy the fun of thinking and the speed of reaction beyond the limits! You can connect online! You can choose from two types of battles: 'Rating game' where the rating points fluctuate depending on the win or loss, and 'Free game' where the win or loss is not related to the rating points. Also, battle life will be consumed during either game. 【Rating game】 Compete with powerful players from all over the country and earn rating points that go up with victory and go down with defeat! Also equipped with a ranking board function that displays rankings! Read your opponent's thoughts, grab the victory and aim for the top of the rankings! 【Free game】 You can have a fun battle with the members who gathered in the room where up to 4 people can participate! You can also set detailed rules. You can watch other people's play in spectator mode. 【Random match】 Feel free to play against randomly selected opponents with fixed rules! The theme of the board and pieces can be changed freely! Super fast battle with 9 characters! Nine characters appear as opponents. Each has three levels of strength. There is a range of strengths, from opponents who can easily win even if they move the pieces appropriately to opponents with intense high-speed thinking that are extremely difficult to win, so you can enjoy a hot battle with your favorite difficulty level! Three people can be selected from the beginning as opponents. Let's collect points in the game and release the character. Can you beat the strongest character? You can also play offline! 2P battle is also possible! There are two types of battle screen settings, one is to play while looking at the screen side by side, and the other is to play against the screen in the same state as the actual board. Read your opponent's keen thoughts and get excited about the non-stop battle of your reflexes! Let's get excited with stamps! In internet games, you can also exchange using stamps! The number of stamps that can be used will increase with each online battle. Let's play bang bang, increase the number of stamps, and get excited by playing online! Burn up in a handicap! It is also possible to use the handicap during cool time in rating games and 2P games! You can choose whether or not to play a handicap in the settings before the game. In the handicap battle in the rating game, the handicap is automatically set according to the rate difference. You can freely set the handicap for the 2P battle handicap. Design change of board and piece! It's not just ordinary shogi boards and pieces! You can also switch to a digital or fantasy style design. There is also a design that depicts the direction of movement of shogi, so even people who do not know shogi are okay! Enjoy with your favorite view of the world!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1499540/header.jpg?t=1635844376",
    "Price": 0.0,
    "Developers": "株式会社シルバースタージャパン",
    "Publishers": "株式会社シルバースタージャパン",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1499540/ss_bbaae97564a8d8910551006884d43799fb722ba8.1920x1080.jpg?t=1635844376,https://cdn.akamai.steamstatic.com/steam/apps/1499540/ss_893c3a7eeacc35534846863cbaea19756ab29cc5.1920x1080.jpg?t=1635844376,https://cdn.akamai.steamstatic.com/steam/apps/1499540/ss_5e57920e629315f027079d0632cd3d02f0e9fe15.1920x1080.jpg?t=1635844376,https://cdn.akamai.steamstatic.com/steam/apps/1499540/ss_7d4bba65c6d19370808c3446209da2e684c17b69.1920x1080.jpg?t=1635844376,https://cdn.akamai.steamstatic.com/steam/apps/1499540/ss_d07f8335e86700b09212c010762fc5950a15525a.1920x1080.jpg?t=1635844376",
    "Slug": "",
    "Meta Title": "リアルタイムバトル将棋オンライン: Nov 2, 2021, 株式会社シルバースタージャパン and Full O...",
    "Meta Description": "Looking for information on リアルタイムバトル将棋オンライン? Check out the release date (Nov 2, 2021), developer insights from 株式会社シルバースタージャパン, and a complete game summ...",
    "Alt Text Image": "Official header image for リアルタイムバトル将棋オンライン game - Steam 1499540",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u30ea\\u30a2\\u30eb\\u30bf\\u30a4\\u30e0\\u30d0\\u30c8\\u30eb\\u5c06\\u68cb\\u30aa\\u30f3\\u30e9\\u30a4\\u30f3\", \"description\": \"Looking for information on \\u30ea\\u30a2\\u30eb\\u30bf\\u30a4\\u30e0\\u30d0\\u30c8\\u30eb\\u5c06\\u68cb\\u30aa\\u30f3\\u30e9\\u30a4\\u30f3? Check out the release date (Nov 2, 2021), developer insights from \\u682a\\u5f0f\\u4f1a\\u793e\\u30b7\\u30eb\\u30d0\\u30fc\\u30b9\\u30bf\\u30fc\\u30b8\\u30e3\\u30d1\\u30f3, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u682a\\u5f0f\\u4f1a\\u793e\\u30b7\\u30eb\\u30d0\\u30fc\\u30b9\\u30bf\\u30fc\\u30b8\\u30e3\\u30d1\\u30f3\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u682a\\u5f0f\\u4f1a\\u793e\\u30b7\\u30eb\\u30d0\\u30fc\\u30b9\\u30bf\\u30fc\\u30b8\\u30e3\\u30d1\\u30f3\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1499540/header.jpg?t=1635844376\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}