{
    "AppID": 1011130,
    "Name": "Life is Pointless",
    "Release date": "Feb 4, 2019",
    "About the game": "Earn points by doing that which is pointless. Based on the designer’s own struggle with depression, Life is Pointless takes the player on a cerebral and stoic adventure as they try to escape their meaningless existence. Deep and contemplative, the player is forced to repeatedly complete the same mundane tasks in this minimalist experience, watching as the days pass endlessly before them. More of a philosophical argument than a game, Life is Pointless will force you to take a closer look at your own daily actions, and determine if you, too, are in the pointless pursuit of points. Features include: • Over .01 hours of exciting gameplay! • Absolutely no multiplayer capabilities! • Vivid color palette of black, white, off-white, and dark-grey! • Painstakingly produced over the span of almost an entire week! • Two endlessly looping tracks of music, each an astonishing six seconds long! • Revolutionary day and night cycle! • Incredibly smooth learning curve! • Points! But the best part about Life is Pointless is that you don’t even need to be actively playing the game to earn points! For the truly devoted player who wants to live the game, rather than play it, they can minimize the application, and perform their daily computer routines. Even if the game loses focus, it will still record the number of key presses you enter, slowly adding them to your score. At the end of the day, you can go back into the game, and see just how many points your normally pointless existence has earned you! “Fantastic!” - Made up game reviewer #1 “5 stars!” - Made up game reviewer #2 “The greatest game ever made!” - Will deManbey ( Game Designer, Life is Pointless ) “Better than Car Theft Auto!” - Will deManbey’s Mom Disclaimer: If you haven’t already guessed from the above description, screenshots, and trailers, there isn’t all that much to this game. It was created from a place of twisted darkness in the designer’s soul, and publishing it was just something he decided to do for fun. He was originally going to make it free, but the same twisted darkness thought it would be hilarious to make people pay for it. That being said, do not purchase this “game” if you do not have a sense of humor. If you’re planning on feeling disappointed, and writing a negative review about it later, then you might as well stop right here. This game was built on negativity and disappointment, so the designer has plenty of it already. Additional Disclaimer: Depression is a real and serious matter, and while this is a work of farce and humor, depression should under no circumstances be taken lightly. It is highly advised that those afflicted should seek professional counselling for depression, rather than express your emotional turmoil in isolation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1011130/header.jpg?t=1564202315",
    "Price": 0.99,
    "Developers": "Will deManbey",
    "Publishers": "Will deManbey",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1011130/ss_b1c5d6cd4c95d47cde4185d120feaca2c90896da.1920x1080.jpg?t=1564202315,https://cdn.akamai.steamstatic.com/steam/apps/1011130/ss_052e35253692e21c408ceaaf7c301d917322d620.1920x1080.jpg?t=1564202315,https://cdn.akamai.steamstatic.com/steam/apps/1011130/ss_93dfdfba698d3eb5d6ddc18b7bff9ff125a4ca7f.1920x1080.jpg?t=1564202315,https://cdn.akamai.steamstatic.com/steam/apps/1011130/ss_5daee7905aa992509ef55545e3527268b7a98d84.1920x1080.jpg?t=1564202315,https://cdn.akamai.steamstatic.com/steam/apps/1011130/ss_98f566d78ddd7cb6b750db6c9803e746fee3ac7c.1920x1080.jpg?t=1564202315",
    "Slug": "life-is-pointless",
    "Meta Title": "Life is Pointless: Feb 4, 2019, Will deManbey and Full Ov...",
    "Meta Description": "Looking for information on Life is Pointless? Check out the release date (Feb 4, 2019), developer insights from Will deManbey, and a complete game summary.",
    "Alt Text Image": "Official header image for Life is Pointless game - Steam 1011130",
    "Canonical URL": "https://gusku.site/game/life-is-pointless",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Life is Pointless\", \"description\": \"Looking for information on Life is Pointless? Check out the release date (Feb 4, 2019), developer insights from Will deManbey, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Will deManbey\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Will deManbey\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1011130/header.jpg?t=1564202315\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}