{
    "AppID": 420520,
    "Name": "Lost Technology",
    "Release date": "Aug 9, 2017",
    "About the game": "Story War... No one knows when or how it started. In the lands controlled by humans, one fights in the name of peace and justice, one battles for no reason other than to fight, one battles out of greed, to gain more land, and like this, they all faded in the fighting. The victor edits history to put them in a favorable light, and removes anything that they deem unflattering... As a result, humanity has lost many things to the wars. Territory, technology, and their true history... Now there's not a single country that’s lasted more than 50 years... Description Lost Technology is a real-time-strategy (RTS) siege game. The game is centred around three major phases: Phase One: Turn-Based War Strategy Recruit units, and build your army. Find those who will fight for you, command their movements and formation to smoothly prepare to assault your enemy’s territories, or being diplomacy to build peaceful and prosperous relations. Phase Two: Real-Time Battle Co-ordinate your army and navigate them through the battle field. With a variety of terrains, attacks and formations, utilize them all to overpower and defeat your enemy. Phase Three: Story Event Play through scenarios, each triggered by special events within the game. Your choices and interactions here will affect your strategy and progression. You must take control of all territories to complete the game. The World At a glance, the world of Lost Technology appears to resemble the Middle Ages, as well as a fantasy setting. However, civilization had once exceeded our current level of scientific advancement. This drastic difference in advancement is due to the decaying effects of ongoing war. What remains in the game is the world experienced by the player. Long ago when the realms were undivided, there existed incredibly advanced technology that we could not even imagine. This technology would be: 'Weaponry', 'Ideology', 'Appliances', 'Theory', 'Manufacture', 'Speech', 'Craft', 'Knowledge', 'Study' and 'Law'... A wide range of fields that were developed over long periods of history. However, most of this has now been lost through the endless wars. The player's mission is to choose a single power and bring an end to the wars, once again creating a world of peace. Game Structure Turn-Based War Strategy Phase Real-Time Battle Phase Story Event Phase War Strategy Phase (Turn-Based) Form your squad Assemble your ideal team of warriors. Attack Once prepared, move to attack the enemy region. Recruit troops Recruit standard troops and strengthen your army. Recruit comrades You can recruit powerful comrades in your region. Diplomacy Deepen your bonds with those you would rather not fight. Battle Phase (Real-Time) Move your army into battle. Command your army into various formations. Lead your solders into battle with a variety of attacks. Many components are automatic, allowing for a good flow and making each engagement short and satisfying. Event phase There are various factors which can trigger the event phase. You increased your territory. You befriended a specific comrade. Your territory borders another country. You destroyed another country. You met a certain comrade on the battlefield. The event will display story text with occasional choices to be made by the player. Features Over 100 comrade units (generals) with their own beautiful illustrations by Agahari! Carefully chosen music samples, as well as compositions from the legendary Cranky! The differences between the Japanese and English versions This is a game has a large amount of story text for each playable faction. Ideally we would like to provide fully localized versions for each respective faction, however, the size and scale of the game meant that a full localization would be extremely difficult to provide all at once, and so only the six factions known as the Reinald Empire, Makan, Álfheim, Kingdom of Gug, Castus and Dragon Knights of Fevnr are included in the English release. It is possible to start with any of the other playable factions, but story events will not occur and only the simulation part of the game may be played. The Japanese version still contains the currently available free version, all of the basic functions without changes, and all factions are included in full right off the bat. (We had to remove some fan content from the build due to the copyright issues though.) However, it will be distributed as a paid title due to adjustments made specifically for Steam and the addition of trading cards, etc. We currently plan to look carefully at how this title sells (including sales within Japan) and will proceed with the localization of the remaining factions in accordance with the sales numbers. The remaining factions are set to be distributed as additional DLC in the future. Please stay tuned for more news regarding further details. With your support, we hope to provide players with Lost Technology in its full glory! Developer's Voice - Developer: CB-SXF6 We’ve finally managed to make our way up to release. We’ve come quite a long way in the two-plus years since PLAYISM first reached out to us on March 16th, 2015. Lost Technology is an appropriation of a game program called Vahrenturga. Vahrenturga was the winner of the 2009 game contest held by the major Japanese free game posting site Freem!, and boasts over 200,000 downloads. I became obsessed with this game and spent an immeasurable amount of time playing it before subsequently becoming obsessed with creating mods, and then finally using the game system to create my own original title. That title is Lost Technology. Therefore, this program wasn’t created by our team, and the cooperation of the creator of the original game “Nanaashi”, was absolutely necessary for us to be able to release Lost Technology overseas. Nanaashi was extremely happy to hear about our plans for an English version, and I myself was a huge fan of Vahrenturga, so I did everything in my power to ensure that this game could be released. In Japanese, kanji characters can be utilized to shorten all sorts of texts, but that’s not possible in English. There are some parts in which the text simply could not be made shorter. Due to this, we often had issues with the game screen requiring tweaking in order to keep all of the necessary text visible and in place. Each time this occurred, Nanaashi helped immensely by accepting our requests for the required tweaks and adjustments. Furthermore, we also had some very serious problems with differences in non-Japanese OS text encoding, and these problems became so serious at one point that we actually came close to giving up on the release altogether. However, Nanaashi was somehow able to figure out and solve the source of these problems, allowing us to finally bring the game to release. I honestly cannot thank Nanaashi enough. To all of our overseas players who enjoy Lost Technology: I would be enthralled if all of you would check out and play Vahrenturga as well since it's game program can be used freely, so as long as you have the various materials in place, you, too, can make your very own original strategy SLG on the same game system. - 'Vahrenturga' developer: Nanaashi Congratulations on the release of the English version of Lost Technology. As the creator of the original, I am truly honored to have Vahrenturga used as the base system for this expansive strategy-simulation title featuring beautiful illustrations, music, and voice work. Thank you very much. - 'Hatoful Boyfriend' developer, and writer for the Kingdom of Gug Scenario: Hato Moa Congratulations on Lost Technology and the English release of the Kingdom of Gug scenario! It’s really deeply moving to think that those funky frogs are setting off out into the world. Since it is, after all, a music-themed scenario, please be sure to check out the awesome original songs, too. Have fun! Frequently Asked Questions See all the questions here.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/420520/header.jpg?t=1592544620",
    "Price": 4.99,
    "Developers": "Studio 4D",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_06b401c6a023931cc52beaf3fa3c17ab3264ff56.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_6d15438232cd40e944cd16b79ee740b892015731.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_83fd2df0edddbbde66f855b7c7e017d704e673a8.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_3b3070c724f7df83a70ed89216fd5d6a31ef491d.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_119a80ac7987c43a3d9f5a1b3e549c9cd2109bb6.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_dcb2291965c9905af77caa1858215e961dc73b3f.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_6137668517649233a3644d763f28fff32e552515.1920x1080.jpg?t=1592544620,https://cdn.akamai.steamstatic.com/steam/apps/420520/ss_e88d50a792d9010739f4e9b656b235bcdf6e2208.1920x1080.jpg?t=1592544620",
    "Slug": "lost-technology",
    "Meta Title": "Lost Technology: Aug 9, 2017, Studio 4D and Full Overview",
    "Meta Description": "Looking for information on Lost Technology? Check out the release date (Aug 9, 2017), developer insights from Studio 4D, and a complete game summary.",
    "Alt Text Image": "Official header image for Lost Technology game - Steam 420520",
    "Canonical URL": "https://gusku.site/game/lost-technology",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost Technology\", \"description\": \"Looking for information on Lost Technology? Check out the release date (Aug 9, 2017), developer insights from Studio 4D, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio 4D\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/420520/header.jpg?t=1592544620\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}