{
    "AppID": 1073320,
    "Name": "Meteorfall: Krumit's Tale",
    "Release date": "Jul 22, 2020",
    "About the game": "Battle the likes of sozzled bearbearians and nuke-addled snotwolves to protect our glowing green world from the sweaty hands of the Uberlich! Krumit's Tale involves the same core deck building mechanics as Meteorfall: Journeys and the same cast of overly optimistic heroes, but expands the ‘swipe’ mechanic into a dynamic grid based system. This means more depth and longevity – our heroes will have to choose perks to complement their deck-building strategy and carefully manage the board if they wish to triumph. Features Unique roguelike gameplay Your hero starts out with a deck of basic cards (items &amp; abilities). At the start of each dungeon, your hero's deck is shuffled into the dungeon deck (monsters) and dealt out in a 3x3 grid. Defeat monsters to earn gold, then use that gold to acquire your items &amp; abilities from the dungeon. Remove a tile from the dungeon and a new one will be dealt out from the dungeon deck. After you clear a dungeon, you'll earn new, powerful cards to add to your deck as well as perks - passive traits that bend the rules of the game. Colorful characters The exciting and colorful cast of Meteorfall: Journeys (iOS &amp; Android) returns in Krumit's Tale. Join your favorite heroes: Bruno, Greybeard, Mischief, Rose and Muldorf as they attempt to defeat the Uberlich in this exciting new adventure. You'll also meet Krumit, a mysterious shop owner who trades in magical artifacts. Why has he summoned you to his shop, and what secrets does he hold? Unlockable heroes and cards When you first visit Krumit, you'll only be able to select Bruno. After each run, you'll earn XP and automatically unlock new characters and cards. Krumit's Tale respects your time - you'll be able to unlock all of the content easily through normal gameplay, and never have to grind. .. and a whole lot more Five heroes, each with their own unique playstyle 50+ perks - passive abilities that change the rules of the game 50+ unique cards per hero, plus a neutral pool of shared cards Ideal for short bursts of play - runs take about 45-60 minutes and autosave allows you to quit at any time and continue later 20+ enemies, each beautifully animated by the talented Evgeny Viitman (artist for Meteorfall: Journeys) Innovative grid-based system gives players opportunity to construct awesome combos and plan ahead Procedurally generated journey - each run, the dungeons you'll encounter vary A whimsical but deeply thought out world, humorous script and diverse cast of characters and NPC's – the Meteorfall Universe grows! Gameplay by Eric Farraro, the designer behind Meteorfall: Journeys Evgeny Viitman’s iconic art and animations Craig Barnes’ compelling musical compositions Intricate tales and item flavor penned by Danny Wadeson Krumit's professionally voice acted by Adrian Vaughan",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1073320/header.jpg?t=1605801657",
    "Price": 14.99,
    "Developers": "Slothwerks",
    "Publishers": "Slothwerks,indienova",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_63b5ffaceee1540441631f40938c30dba6cb7bef.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_2bf4156a3339e88125f62bd938cbeef7a82c7f29.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_b1df67f64d96d2703e306350183b6f7c31e5ea74.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_1d24a2c4173d819d84fc9f3c2263427291aba5e1.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_615b2a73c44ef4e912cedf41cbbdea7ca5f00aa8.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_1f03454d670694a8732285d1fe281a79f7bc4a3f.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_1fc4a72bc157a642eb620feef325968a30b89796.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_9bdd5b024baed2eb076780f67a24bdab23d14c86.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_5e1d12b45ff47708971fabbe00502713818feea4.1920x1080.jpg?t=1605801657,https://cdn.akamai.steamstatic.com/steam/apps/1073320/ss_b9b593c9b41834d43a4211524c946aab29192259.1920x1080.jpg?t=1605801657",
    "Slug": "meteorfall-krumit-s-tale",
    "Meta Title": "Meteorfall: Krumit's Tale: Jul 22, 2020, Slothwerks and F...",
    "Meta Description": "Looking for information on Meteorfall: Krumit's Tale? Check out the release date (Jul 22, 2020), developer insights from Slothwerks, and a complete game...",
    "Alt Text Image": "Official header image for Meteorfall: Krumit's Tale game - Steam 1073320",
    "Canonical URL": "https://gusku.site/game/meteorfall-krumit-s-tale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Meteorfall: Krumit's Tale\", \"description\": \"Looking for information on Meteorfall: Krumit's Tale? Check out the release date (Jul 22, 2020), developer insights from Slothwerks, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Slothwerks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slothwerks,indienova\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1073320/header.jpg?t=1605801657\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}