{
    "AppID": 1335020,
    "Name": "Mind Over Melee Radio",
    "Release date": "Mar 5, 2021",
    "About the game": "Dank Tunes, Dank Memes and everything in-between! A game about striving for your own personal standard of perfection. No hand holding no fake AI to make you feel better than you are. Just a game about progressing your own skills for no other sake than getting good. Play a stupid game, win stupid rewards. It's that simple. Since I am required to fill with more details: Lets start with the prologue. You play as Carlise aka Lil' C. Lil C is a retired video game action star returned back to star in one. last. job. He is tasked with being the lead in a new game Mind Over Melee Radio. In which his role is to continue to force people to get arbitrary numbers up. Only by getting the scores higher and higher can players unlock new game modes and continue to quell the insatiable greed of The Board of Directors. At the end of the call you are digitized and thrust into the MOM Dimension. This is where you make contact with Snowball your liaison between Lil C and the board. Before he even speaks to you you must sign away your life in a NDA and a contract. After the welcoming party you are now playing the tutorial. You will learn to pick up items. You will learn how to attack. But most of all you will LEARN to RAISE those numbers!!! It is imperative that every day the numbers from yesterday are larger than today's. Once all of the important concepts are visualized to the player you will be thrust into phase 1- the infinite grind. The player is expected to grind daily weekly and monthly missions to increase the play through and click through rates to satiate The Board of Directors. Players will be compensated based on their contribution at the end of every month with the reset of the ranked ladder. --- You will play on a procedural generated levels contest against other players in score and time attacks to increase player engagement. At the end of each month the ladder will be reset and a portion of the prize pool will be distributed to the top players on the leader board. More content is purchasable in the shop, but the meat and potatoes is the time trials.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1335020/header.jpg?t=1614989441",
    "Price": 9.99,
    "Developers": "Official Jabe,Mind Over Melee",
    "Publishers": "Hyperfocus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1335020/ss_cdacd79e4864e2c14d2fe4040ea07c010ddb41a0.1920x1080.jpg?t=1614989441,https://cdn.akamai.steamstatic.com/steam/apps/1335020/ss_3d327686c68fbf97bb01d98cd5486cc902ead29e.1920x1080.jpg?t=1614989441,https://cdn.akamai.steamstatic.com/steam/apps/1335020/ss_7c507f2663c4a2ebda643a029fb9d041bdc2c90e.1920x1080.jpg?t=1614989441,https://cdn.akamai.steamstatic.com/steam/apps/1335020/ss_9315637ed5e508ecc6693dd78aadfd3e84dce3c7.1920x1080.jpg?t=1614989441,https://cdn.akamai.steamstatic.com/steam/apps/1335020/ss_b0e7c10a10b875204dce37e2cf2ca594849061ec.1920x1080.jpg?t=1614989441",
    "Slug": "mind-over-melee-radio",
    "Meta Title": "Mind Over Melee Radio: Mar 5, 2021, Official Jabe,Mind Ov...",
    "Meta Description": "Looking for information on Mind Over Melee Radio? Check out the release date (Mar 5, 2021), developer insights from Official Jabe,Mind Over Melee, and a...",
    "Alt Text Image": "Official header image for Mind Over Melee Radio game - Steam 1335020",
    "Canonical URL": "https://gusku.site/game/mind-over-melee-radio",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mind Over Melee Radio\", \"description\": \"Looking for information on Mind Over Melee Radio? Check out the release date (Mar 5, 2021), developer insights from Official Jabe,Mind Over Melee, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Official Jabe,Mind Over Melee\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hyperfocus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1335020/header.jpg?t=1614989441\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}