{
    "AppID": 1183080,
    "Name": "MMA President",
    "Release date": "Dec 6, 2019",
    "About the game": "A Mixed Martial Arts (MMA) sports management game for the PC deskop/laptop. Run any of 25 different MMA companies and compete to become the best in the world. Find the next generation of MMA stars and watch them become legends in the sport. (The game is purely a management sim with the fights being shown in text and statistics, move by move). ***MMA President Version 1.2 is now up which includes scouting, train your fighter character, fighter generator and many more new features and improvements*** **MMA President Version 1.1 updates includes speeding up the game, multi-day advance and a renew fighter contracts page** Features: - 3700+ Fighters over 21 weight divisions. - Up to 63 titles for your company, 3 for each weight division. - Full Mod system so that you can make your own real life or fictional mod game. Enter any fighter you want or even put yourself in the game. Enter pictures and even videos. - Man management system where you can move your fighters between your main company and two feeder companies, for fighter development/appraisal. - Sign and buy fighters. Buying fighters is more expensive than signing free agents but is a fun feature when your company starts making money. - CEO (You)/ Fighter relationships. Keep your best fighters winning or they might want to sign with another company. Also fighters are not too pleased when facing fighters on performance enhancing drugs or those that can't make weight. - Personal relationships. For mod games where you can put in 70 pictures and 20 videos of your favorite fighter and receive this media with messages while playing through the game. - Book multiple events for up to a year in advance. - A massive array of fighter attributes and stats. - CEO rankings, become the best CEO in the business. - MMA Express, read the latest headlines from the MMA world. - Sign staff to help promote your company and its fighters. - Gym: Send fighters to the gym to be trained by your coaches to help develop your next generation of MMA stars. - Fighter rankings: find out who is the best from wins, losses and opponent difficulty. - Retirements and new fighter generation. The game will create new fighters to keep each division filled up so that the game can be played for unlimited seasons. - Company information, see how your competitors are doing. View their rosters, titles and staff. - Weigh-ins, suspensions and injuries. - Easy load/save system, where the game is auto saved with everything you do. Loading another game takes the time of clicking the select button. - All companies, fighters and staff can be edited. - The user will receive both a CEO character and a fighter character. The fighter character can be trained up from low skills to become a great fighter. - Start game from the dawn of MMA in 1995 and generate new fighters. Specifications/Game speeds: The game has been tested on several PC/Laptop computers. With full data and fighters inside the game it takes 4-8 seconds to update between each in-game day using an AMD A8-6600K computer, 8 GB Ram. (5 years old). With an AMD A4 and a Duel Processor Laptop, both 4 GB ram, the game takes about 12-20 seconds between days. (10+ year old computers). New computers should be a lot faster. These updates include millions of pieces of information being updated and other company events being simulated. Installation: Unzip files from MMAPresident.zip, go into the MMA President Folder and double click MMA President.exe. Tutorial/Gameplay Videos: Please check out our Youtube page for game tutorials and how to make a mod for MMA President. Find MMA President Steam Files For Editing/Making Mods You can find the main folder for MMA President by right clicking on the MMA President Icon/Title inside the stream app, select 'Manage' and then click 'Browse Local Files'. Or find it on your hard drive at: C:\\Program Files (x86)\\Steam\\steamapps\\common\\MMA President",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1183080/header.jpg?t=1577205679",
    "Price": 13.99,
    "Developers": "Sim World Games",
    "Publishers": "Sim World Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1183080/ss_149a47f4d308e1ce5de8b197c1fbf426446eaaee.1920x1080.jpg?t=1577205679,https://cdn.akamai.steamstatic.com/steam/apps/1183080/ss_f5db1c9f39a86a556cbb062ccd794eb20fc7c9ad.1920x1080.jpg?t=1577205679,https://cdn.akamai.steamstatic.com/steam/apps/1183080/ss_fdffa45565493e4a1efff14c2a4058487ed9bd03.1920x1080.jpg?t=1577205679,https://cdn.akamai.steamstatic.com/steam/apps/1183080/ss_d26e71dc13bd7fefe99f441a855d6430992d1b00.1920x1080.jpg?t=1577205679,https://cdn.akamai.steamstatic.com/steam/apps/1183080/ss_08b75a055cb9e68f6968f5d34f1be7cb0f47fbde.1920x1080.jpg?t=1577205679,https://cdn.akamai.steamstatic.com/steam/apps/1183080/ss_34840ef9c170e4a31a1cc9ed9f09d547969376a9.1920x1080.jpg?t=1577205679",
    "Slug": "mma-president",
    "Meta Title": "MMA President: Dec 6, 2019, Sim World Games and Full Over...",
    "Meta Description": "Looking for information on MMA President? Check out the release date (Dec 6, 2019), developer insights from Sim World Games, and a complete game summary.",
    "Alt Text Image": "Official header image for MMA President game - Steam 1183080",
    "Canonical URL": "https://gusku.site/game/mma-president",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MMA President\", \"description\": \"Looking for information on MMA President? Check out the release date (Dec 6, 2019), developer insights from Sim World Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sim World Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sim World Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1183080/header.jpg?t=1577205679\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}