{
    "AppID": 1268900,
    "Name": "Nearly Dead",
    "Release date": "Sep 10, 2021",
    "About the game": "Nearly Dead is a 2D open world survival video game. It's about your struggle trying to survive from a brutal situation where demons from a different dimension have turned most of mankind into zombies and inhuman things. You are going to face this apocalypse and make it through a rough time by any means, or you will end up being one of ‘them’. Speaking of method, it‘s not always necessary to mash zombies’ heads. You have to assemble other survivors, establish a settlement, build an apocalypse truck and prepare various supplies for further plans to survive. The battle takes place in real time. And sometimes the limbs are cut off. If you bleed, the blood will naturally get on the wall, and also make a puddle of it on the floor. Sometimes it can overflow. It's all embodied in the game. ND implements the 'line of sight system' and 'visibility mechanics', so you'll have to look around often to see who's behind you, and be wary of who's beyond the corner of the aisle. You should be really careful when you try to get home on a dark night. ND can only control one player character in the early access version, but will also add NPC companions. NPC companions will be made to run on AI through multi-threading. So you will fight against many enemies with your NPC companions. And you will have to deal with a variety of enemies. Zombies are the main force now, but different living creatures like the devil will be added. The main character of the game doesn't have to be human. In ND, an anthropomorphic creature can be a main character or a companion. Wait! Do they have to be humanoid? In fact, ND plans to be designed to give you the ability to play as other living creatures like horses, cows, and mice. Helmet, armor, gloves, shoes, belt. There should be no restrictions on wearing only one piece of equipment in each body part. So, ND is designed to let you wear a variety of equipment. You can put on underwear, a T-shirt on top of it, an armor over it, and complete the look with a duster coat. You can also wear your favorite crocs with socks, but other survivors might kill you first. Weapons? Why should a hero with supernatural powers hold a sledgehammer with both hands? In ND, you can arm these weapons with one hand. Yes, you can hold different rifles in both hands, or you can arm a rifle and a Zweihander. Why are all T-shirts blue, skirts all pink, and duster coats all brown? Changing the color of an image doesn't actually require a difficult coding job. So ND is made to let you freely apply various colors for each item. Did you feel frustrated with games that don't connect regions with regions? Have you ever experienced a lack of space by completely filled up a region with buildings? So did we. And that's why you can play in an ever-expanding world in ND. They're created infinitely and randomly, and they're connected without a separate loading screen. Craft, and build to surviㅍe. Have to eat to survive. And farming is a very good means of producing food. Our last development philosophy is 'Mod Support'.All of our team members were Korean modders of Cataclysm DDA and Unreal World. So ND is basically made to be 'mod-friendly'. From basic item performance figures to images, terrain, and animation clips, everything is mod-friendly. And, all of these mods can be easliy made by using a JSON editor, built on Unity engine. *** Russian, Chinese, and Japanese will be supported soon.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1268900/header.jpg?t=1648090043",
    "Price": 24.99,
    "Developers": "Mono Software, Inc.",
    "Publishers": "Mono Software, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1268900/ss_1c48b0d937b32841c43ce1d0f87f0cc68e3783ad.1920x1080.jpg?t=1648090043,https://cdn.akamai.steamstatic.com/steam/apps/1268900/ss_3ae80f831fe2e843c57210c078ac49429bf019b8.1920x1080.jpg?t=1648090043,https://cdn.akamai.steamstatic.com/steam/apps/1268900/ss_41ba0ed1349c0a67bb97fa34e226d0bf92c49f12.1920x1080.jpg?t=1648090043,https://cdn.akamai.steamstatic.com/steam/apps/1268900/ss_c03bc2ec7627d90c1193606c6dc6a4253c82e57e.1920x1080.jpg?t=1648090043,https://cdn.akamai.steamstatic.com/steam/apps/1268900/ss_3623178e3f39fcc468cf8659f1f963cb336b8963.1920x1080.jpg?t=1648090043,https://cdn.akamai.steamstatic.com/steam/apps/1268900/ss_7c2bba44403461919b7ebd17abe5f14ae24d6b24.1920x1080.jpg?t=1648090043",
    "Slug": "nearly-dead",
    "Meta Title": "Nearly Dead: Sep 10, 2021, Mono Software, Inc. and Full O...",
    "Meta Description": "Looking for information on Nearly Dead? Check out the release date (Sep 10, 2021), developer insights from Mono Software, Inc., and a complete game summ...",
    "Alt Text Image": "Official header image for Nearly Dead game - Steam 1268900",
    "Canonical URL": "https://gusku.site/game/nearly-dead",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nearly Dead\", \"description\": \"Looking for information on Nearly Dead? Check out the release date (Sep 10, 2021), developer insights from Mono Software, Inc., and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mono Software, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mono Software, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1268900/header.jpg?t=1648090043\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}