{
    "AppID": 1101030,
    "Name": "Noara: The Conspiracy",
    "Release date": "Nov 14, 2021",
    "About the game": "MULTIPLAYER ONLINE CHESS ARENA Noara: The Conspiracy revisits the turn-based strategy genre and offers a new experience in an original heroic-fantasy universe. Using a new mechanic in a brand-new genre (MOCA), you play in real time during your opponent's turn in Noara! Even during the defensive phase, you are fully active. You must demonstrate tactical prowess but also speed to effectively counter your opponent's assaults and destroy their stronghold. GAME MODES Strength in numbers - Noara is a competitive team game that will push you and your ally to the limit to reach the top. Navigate the trials and gradually progress, choosing your brother in arms before joining the battlefield in 2 vs 2. Solo adventure - We will also have a single-player mode that teaches you the basics of combat step by step while offering some fun puzzles. We strongly recommend playing and replaying this mode before searching for an online game. A WIDE RANGE OF STRATEGIES Build your army - Choose your battalion carefully as the game progresses and adapt your own strategy. Together with your ally, you can choose the army composition that best suits your style of play and is the most effective against your opponent's strategy! Unlock Caste bonuses - With the Caste system, you can obtain powerful synergies and considerably improve the statistics of your units on the battlefield. There are currently 8 caste types per army, giving you a wide range of possible strategies. Use your stronghold - The game ends when one of the two strongholds has been destroyed. Defend your stronghold at all costs and make good use of its assets to gain an advantage. There are currently over 20 different assets, and using each one wisely can make a big difference to the outcome of a battle. Manage your resources - The first battleground you fight on is on the outskirts of the Crossroads in the Carmine Forest. You will find many objectives here, including harvesting areas. In these areas you can collect resources and exchange them for the currency used in Noara's universe: 'Khina'. Good management and use of your resources will maximize your chances of winning the war. Buy, sell or get out - Djakpa's shop will amaze you with the variety of items it offers. You can buy items to strengthen your units, pay mercenaries, and even take advantage of the many services Djakpa offers, such as the ability to strengthen your stronghold to resist enemy assaults. Don't be fooled: Djakpa may seem very friendly, but he is only interested in your Khina wallet. Fight relentlessly! - Noara combines the careful thinking needed in turn-based strategy games with the speed of real-time games. This unique gameplay mechanic adds significant replay value and makes every battle a true tactical challenge. A DIVERSE AND VIBRANT UNIVERSE Noara is a vast heroic-fantasy universe that extends far beyond the video game. Although two clans are to fight each other in our first game, there are many more people that inhabit the Lands of Noara.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1101030/header.jpg?t=1655127699",
    "Price": 0.0,
    "Developers": "Atypique Studio",
    "Publishers": "Atypique Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1101030/ss_a2f9e069dd26e7ffcd88e3281065983c7841fbc2.1920x1080.jpg?t=1655127699,https://cdn.akamai.steamstatic.com/steam/apps/1101030/ss_e0fb746e9f367e6aa78a0151a23e1ad16fed8cab.1920x1080.jpg?t=1655127699,https://cdn.akamai.steamstatic.com/steam/apps/1101030/ss_cc458913ec8a76b69c9424bfe80910984d17eb6b.1920x1080.jpg?t=1655127699,https://cdn.akamai.steamstatic.com/steam/apps/1101030/ss_2160ee890cd0d279c8ab1b68b0f7e32c8a99b353.1920x1080.jpg?t=1655127699,https://cdn.akamai.steamstatic.com/steam/apps/1101030/ss_ecad956c77bf83433eb5500f408c544fc1c90b43.1920x1080.jpg?t=1655127699,https://cdn.akamai.steamstatic.com/steam/apps/1101030/ss_3408ecaea4b15c5133de6e6fd680de022f841308.1920x1080.jpg?t=1655127699",
    "Slug": "noara-the-conspiracy",
    "Meta Title": "Noara: The Conspiracy: Nov 14, 2021, Atypique Studio and ...",
    "Meta Description": "Looking for information on Noara: The Conspiracy? Check out the release date (Nov 14, 2021), developer insights from Atypique Studio, and a complete gam...",
    "Alt Text Image": "Official header image for Noara: The Conspiracy game - Steam 1101030",
    "Canonical URL": "https://gusku.site/game/noara-the-conspiracy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Noara: The Conspiracy\", \"description\": \"Looking for information on Noara: The Conspiracy? Check out the release date (Nov 14, 2021), developer insights from Atypique Studio, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Atypique Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atypique Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1101030/header.jpg?t=1655127699\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}