{
    "AppID": 955600,
    "Name": "Noble In Exile / 落魄之家",
    "Release date": "Feb 8, 2019",
    "About the game": "In this game, you play the role of a member of a once noble family, and try to build your own town using all you have. You can design every detail of the town from every road to every brick of the floor. You have to build every single store yourself, and be responsible for everything, including determine how much you want to import for each ingredient and what the price of each product is. Your control over the whole town ends at this step, as the market itself will determine how your businesses go. Of course it is known to all that with higher price goes lower sale quantity, but the challenge is how to make most profit out of it. What Will Be Included In the Full Release More industry chains with more buildings More maps with different climates and environments An Ancient Chinese Casino update containing the normal casino building as well as a real ingame Chinese casino that lets players experience some real Chinese gambling mini games using the currency you earn through normal gameplay. If you are good enough, maybe you can even make a living just in the casino. The Family System where you bear the heavy burden of maintaining the honor of your family. You can choose your inheritor, decide what every child practice and learn at their childhood, which will bring different traits to your family when they grow up, or even connect with other families through marriage, which may bring various benefits. The more children you have, the more they will cost, but fewer children brings the higher risk of ending your family line which signals the end of the game. What Is In the Greenlight Page But Will Not Be Included In the Full Release /*The main reason I put this section here is that since I redid the whole models and animations part and most building mechanics after it is selected in Greenlight, some part described in the Greenlight page may not be within my reach due to many factors, mostly limited resources. Here goes the clarification so that the players who saw the Greenlight page, if any, will not be misled, just in case.*/ The multi-city competition mechanics. -- In the Greenlight page it was proposed that there would be multiple cities run by AI and players can compete with them using all sorts of business strategies and diplomatic strategies. However, the AI code for local multi-city competition is too complicated for our team containing only one programmer, namely me. And since the multiplayer design includes asynchronous gameplay, which requires establishing a server to save current game state, it is basically out of the question at this moment for us. What Is More You can always provide your own ideas and suggestions to us, and they will be put into the game if feasible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/955600/header.jpg?t=1550028969",
    "Price": 4.99,
    "Developers": "LemoNeko Software",
    "Publishers": "LemoNeko Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/955600/ss_29074bb53d5ff5f620948931d18a67007c593976.1920x1080.jpg?t=1550028969,https://cdn.akamai.steamstatic.com/steam/apps/955600/ss_c56e90667a12635b6322747f467e12ca44ffc891.1920x1080.jpg?t=1550028969,https://cdn.akamai.steamstatic.com/steam/apps/955600/ss_aeacd9aedbabf8ae04170a5e6d3167dc790350d2.1920x1080.jpg?t=1550028969,https://cdn.akamai.steamstatic.com/steam/apps/955600/ss_1e8560a78183676b86839fedb0d2dbca0819599b.1920x1080.jpg?t=1550028969,https://cdn.akamai.steamstatic.com/steam/apps/955600/ss_7357abae449adc9df81c193ec4a45a2c0d1ac191.1920x1080.jpg?t=1550028969",
    "Slug": "noble-in-exile",
    "Meta Title": "Noble In Exile / 落魄之家: Feb 8, 2019, LemoNeko Software and...",
    "Meta Description": "Looking for information on Noble In Exile / 落魄之家? Check out the release date (Feb 8, 2019), developer insights from LemoNeko Software, and a complete ga...",
    "Alt Text Image": "Official header image for Noble In Exile / 落魄之家 game - Steam 955600",
    "Canonical URL": "https://gusku.site/game/noble-in-exile",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Noble In Exile / \\u843d\\u9b44\\u4e4b\\u5bb6\", \"description\": \"Looking for information on Noble In Exile / \\u843d\\u9b44\\u4e4b\\u5bb6? Check out the release date (Feb 8, 2019), developer insights from LemoNeko Software, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"LemoNeko Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LemoNeko Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/955600/header.jpg?t=1550028969\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}