{
    "AppID": 1416230,
    "Name": "Panzer Knights",
    "Release date": "May 19, 2021",
    "About the game": "We won't lie to you: These campaigns are no cakewalk. War is at hand, and you, among all your comrades, have been chosen for entrance to the Panzertruppenschule I. The army requires more elite tank commanders, 'Steel Knights,' to lead us to victory using the most dominating form of warfare: tanks! Do you have what it takes to join the ranks of the elite? Are you willing to lead a platoon of accomplished, adept men and women across the lands?! Show us what you got! Panzer Knights is a strategic action game where you lead a platoon of charming, yet deadly crewmates to skillfully outmaneuver enemy tanks! Command your platoon from the Battle of France to the Eastern Front! You will work and interact with highly skilled soldiers to defeat your enemies. Fully experience epic and powerful tank combat as you control detailed, fully armed tanks! Feel the heat under enemy fire as you and your platoon fight for supremacy! Choose crewmates whose qualities best appeal to you and form the perfect team! Storied, historical battles 11 main levels with plenty of side missions to satisfy your hunger for battle and prestige. Each battlefield presents unique and challenging mission objectives. Break through defensive lines, protect important field positions, and defeat swarms of enemies as they try to overwhelm your forces! As you unlock more advanced tanks and your crewmates' skills improve, replay missions to demonstrate your might! Get to know your military hardware Unlock over 20 controllable, detailed tanks , from the Panzer 38(t) to the IS-2, each reproduced in a distinct, attractive art style. Upgrade your hardware, unlock new camouflage, and determine the best tank and loadout to accomplish your missions. Encounter over 40 authentic WWII era vehicles and artillery and avoid damage to your tank that could leave you without tracks or a hull full of holes. The command decisions are yours Call bomb raids to destroy larger groups of enemies, signal for resupply airdrops, repair your tank in the field, and alter battlefield tactics on the fly. To successfully complete missions, formulate new strategies and make use of newly acquired technology! Select the perfect crew Choose from 30 eager crewmates to fill out your team of five. Pick who best suits your play style and help them upgrade their skills! Continuous in-game dialog means your crew will help to keep you alert! Your crew will stay in communication with full Japanese audio and 5 supported languages for text dialog! Strategize while taking enemy fire Should you approach an enemy from a sheltered position or go for the long shot across a wide, open field? Is there an enemy tank hiding behind that wall lying in wait? Destroy buildings, ram walls, and perfect your approaches to fighting ! The world of Panzer Knights is fully destructible and expansive in scope. Proper planning will get you far, though something can be said for spur-of-the-moment brute force action.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1416230/header.jpg?t=1657097775",
    "Price": 24.99,
    "Developers": "樂磚Joy Brick",
    "Publishers": "樂磚Joy Brick",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_d985cfd2950e3bf6caaf315bf5f9f4bb77f45352.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_eb85c31df02369221a3c2e702a5e5c5a8a91feaf.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_c0b30da7d181923b1bcb266f5677de74667038da.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_1f45f5e23bc3da02123c02c85f79e2876bc79c76.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_0fb5a23677f0217735ff9afe5a1a0cec879938f9.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_9da8a45c7332e6b8f915ad2e93416ffaf60455e9.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_185b66fdaf4335a2e9ba732559f68eb36b91a136.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_5c30c3f45808efab2fdc011ccd0498c0c22fd572.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_d763cd71704e5d317ad9ff91696f11380c080267.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_016c30415f3e446724194d4bedf4eda71727a45e.1920x1080.jpg?t=1657097775,https://cdn.akamai.steamstatic.com/steam/apps/1416230/ss_6eea13daa056f098a734480d95792c09a3271c4c.1920x1080.jpg?t=1657097775",
    "Slug": "panzer-knights",
    "Meta Title": "Panzer Knights: May 19, 2021, 樂磚Joy Brick and Full Overview",
    "Meta Description": "Looking for information on Panzer Knights? Check out the release date (May 19, 2021), developer insights from 樂磚Joy Brick, and a complete game summary.",
    "Alt Text Image": "Official header image for Panzer Knights game - Steam 1416230",
    "Canonical URL": "https://gusku.site/game/panzer-knights",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Panzer Knights\", \"description\": \"Looking for information on Panzer Knights? Check out the release date (May 19, 2021), developer insights from \\u6a02\\u78daJoy Brick, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a02\\u78daJoy Brick\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a02\\u78daJoy Brick\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1416230/header.jpg?t=1657097775\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}