{
    "AppID": 1640300,
    "Name": "Project Warlock II",
    "Release date": "Jun 10, 2022",
    "About the game": "Welcome to Project Warlock II! Find your reason to fight Project Warlock II picks up right after the events of the first game. Palmer, Urd, and Kirsten, each have their own skills, perks, unique weapons, magic skills to unlock, and personal reasons to confront their old Warlock master. Fight your way through 3 explosive chapters set in distinct settings, encounter a menagerie of deadly monsters, powerful bosses hulking in the darkness, and unleash a bullet hell action that will infuse you with constant adrenaline bursts. Levels Each of the 3 chapters of Project Warlock II consists of 6 huge, sprawling levels up to 10 times bigger than any individual level in the original game. Levels in the game evolved into vertical, three-dimensional, multi-floored structures, platforms, and buildings that literally elevate the gameplay. Filled with enemies, obstacles, secrets, easter eggs, perks, and achievements to unlock, every level in the game can take up to 1 hour to complete. Weapons Palmer, Urd, and Kirsten carry unique arsenals of weapons and magic skills based on their personas that enable different playstyles. Shotguns, machine guns, sniper rifles, grenade launchers, quad barrelled harvesters, swords, staffs, and cannons are just a few examples of weapons available only to Palmer. Tools of destruction can be upgraded resulting in 20+ weapons for each character. Enemies Each chapter of Project Warlock II puts you against new types of enemies. Relentless ghoul hordes, naked imps jumping you from behind, tough knights with rocket launchers, flying machine guns with heads, and massive pigdemons blocking your way are just a few examples of monsters that will jump, run, hold, hop, whirl, and use every attack style at their disposal to turn you into doggie chow. Save yourself The first game had no saving whatsoever. In Project Warlock II we give you quicksaves, manual saves, and even autosaves. If you know any other type of saves we could put in the game, then just call us in the middle of the night, please. KEY FEATURES 3 single-player chapters set in distinct worlds 3 playable characters with their own weapons, spells, and playstyles 20+ weapons and upgrades to unlock for each character Huge vertical levels - up to 10 times bigger than in the first Project Warlock 35+ types of enemies to combat - each with a distinct set of skills and tactics! 3D visuals combined with 2.5D sprites and pixelated effects for a true retro feeling Heavy metal soundtrack, obviously Game saves, game saves everywhere and for everyone",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1640300/header.jpg?t=1657813030",
    "Price": 16.99,
    "Developers": "Buckshot Software",
    "Publishers": "Retrovibe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_53a9eb233aa2e5fb07130770178cfb149b62793b.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_8759fbf4083c15e7b59fbb82fa2da208397658fb.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_693035c169a2eb4db57e3382b1dba639333564bf.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_fa45bfbeea451542d1a28d813598e2cff6661353.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_572716f1eadf2274f0131f42b799a8a851bd7017.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_d644afc19e7064abefcb9d98ffb1714d4640eeb8.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_0fe70ca273f51089b7cc3c808ae2bb5a93338f37.1920x1080.jpg?t=1657813030,https://cdn.akamai.steamstatic.com/steam/apps/1640300/ss_e2ecb9a5e26c5c7187dc63dc4d184b241fbf844d.1920x1080.jpg?t=1657813030",
    "Slug": "project-warlock-ii",
    "Meta Title": "Project Warlock II: Jun 10, 2022, Buckshot Software and F...",
    "Meta Description": "Looking for information on Project Warlock II? Check out the release date (Jun 10, 2022), developer insights from Buckshot Software, and a complete game...",
    "Alt Text Image": "Official header image for Project Warlock II game - Steam 1640300",
    "Canonical URL": "https://gusku.site/game/project-warlock-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Warlock II\", \"description\": \"Looking for information on Project Warlock II? Check out the release date (Jun 10, 2022), developer insights from Buckshot Software, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Buckshot Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Retrovibe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1640300/header.jpg?t=1657813030\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}