{
    "AppID": 1393380,
    "Name": "Reverse Defenders",
    "Release date": "Apr 11, 2022",
    "About the game": "- Many 'one more time' for you. How you prepare your defenses is key to victory in this game. Pair your unit's skills and abilities with items well to turn the tide of battle in your favor. You'll need to know your stuff because the timeline of the world is ever-shifting. All you need to have a good time is careful thought and consideration. In fact, it doesn't take long to clear a run, though a grand adventure awaits if you pursue the perfect run. Either way, this game is sure to satisfy that tower defense itch you've been waiting for! - Flip the Script on Failures Don't let the cute art fool you; this game is chock full of challenging stages. Getting to the end won't be easy. Failures and setbacks will prepare you for the road ahead, so take what you can learn from them to rethink your strategies and try, try again. With a myriad of ways to build your defenses, you are free to devise your own unique way to victory. Reverse Defenders is sure to keep you thinking to the very end. Stick it through, and this game is certain to be a gaming experience that boosts the confidence of both newcomers and veterans alike. Flipsides Bring Potential: In this game, each unit in your defense lineup can have different classes on the front and back 'side' of them. Reverse Defenders brings near limitless possibilities to explore since each front class will be affected by a unit's Flipside class and vice versa. Get in the zone and create brilliant real-time combinations by flipping your units to beat back the hordes of monsters. Strategize and Prepare: On each run, the world resets which gives you ample opportunities to try out different rewards from overworld chests. Finding out which ones you like with every subsequent playthrough is part of the fun. Satisfying Challenges: Every stage has a solution, but sometimes it might not come to you the first time around. There's nothing quite as satisfying as tweaking your defense strategy till you get things just right. Timing is Everything: Each unit needs to be switched between Meditation and Attack modes. Things can get pretty hairy when trying to maximize Meditation gains because you don't want to let enemies get past and wreck your life total. Timing everything to a T will give you a real thrill. Experience Exciting Gameplay: Brute forcing your way through with the same strategy just won't work. Each stage delivers new and interesting challenges. Never a dull moment with the stage variety on offer in Reverse Defenders. A Flipping FUN Game: Reverse Defenders is designed to be as unobtrusive to repeated playthroughs as possible. It is a game, after all, so we made it a breeze to pick up and retry as many times as you like. Brainbusting Challenges: Reverse Defenders will flip your lid and push the boundaries of how you approach situations. After all, mindfully reflecting on failures is an important part of learning. Reverse Defenders is for all ages. It's a game that gets your brain thinking! Don't flip a coin! Give this game a shot. - Sound Sera Mikaru, best known for Airman ga Taosenai, composed the Reverse Defenders soundtrack. He also created the Vocaloid-style voice that you hear upon activating Resonance. - Story Oh no! Sasha Sweetvanilla and Aria Murphy somehow got sucked into the game world. Could there be some evil mastermind behind it all? Only one way to find out. Time to get your game face on! - Video streaming You are free to post and stream videos of this game. It would be helpful if you could include the game title, a link to this page and hashtag. - hashtag #ReverseDefenders #RDstream *Please note that mouse operation is not supported at this time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1393380/header.jpg?t=1650675496",
    "Price": 19.99,
    "Developers": "Libragames",
    "Publishers": "Libragames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_f076b8bf830062c21c6c9bf56d161f03e7c37471.1920x1080.jpg?t=1650675496,https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_8c5f2c8e13afcee08bb16b2da2ac0c12bd0ce866.1920x1080.jpg?t=1650675496,https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_e4a5c96f178dd94d0b647ee1596d1dc1c3474932.1920x1080.jpg?t=1650675496,https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_63ca05344eca142e7759dd72c21d75a41f87833c.1920x1080.jpg?t=1650675496,https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_274499efd1494a09e15c6ef824e9c8cb61d08beb.1920x1080.jpg?t=1650675496,https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_fba75606eb763340eec34de3e66f8e0f2726a4d2.1920x1080.jpg?t=1650675496,https://cdn.akamai.steamstatic.com/steam/apps/1393380/ss_a302f07d6d1d3d46f24d3504cd4b0a24d526937f.1920x1080.jpg?t=1650675496",
    "Slug": "reverse-defenders",
    "Meta Title": "Reverse Defenders: Apr 11, 2022, Libragames and Full Over...",
    "Meta Description": "Looking for information on Reverse Defenders? Check out the release date (Apr 11, 2022), developer insights from Libragames, and a complete game summary.",
    "Alt Text Image": "Official header image for Reverse Defenders game - Steam 1393380",
    "Canonical URL": "https://gusku.site/game/reverse-defenders",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Reverse Defenders\", \"description\": \"Looking for information on Reverse Defenders? Check out the release date (Apr 11, 2022), developer insights from Libragames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Libragames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Libragames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1393380/header.jpg?t=1650675496\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}