{
    "AppID": 1370130,
    "Name": "Rezzil Index / Lite",
    "Release date": "Jan 18, 2021",
    "About the game": "This is the moment it’s all been leading up to. Those years watching your team, idolising the players, collecting the stickers, playing shoot-outs in the park and mud soaked local league games. Never did you think it would come to this, stood in front of the goal with the weight of years of practice, of team-mates, of heartache and pure joy, on your shoulders. This is the moment forged in passion. Rezzil Index Lite, your soccer practice, on demand. Take the kick, connect boot to ball, slam it into the net. Rezzil Index Lite puts you in the soccer boots of elite players. Built with Rezzil’s professional level VR simulation technology used to train pros in clubs around the globe, the game features ‘real world’ drills and challenges. Whether you choose to take on the world or destroy your best friend’s score in local party mode, Rezzil’s pro level simulation will astound you with its authenticity and accuracy - VR soccer just got real. Rezzil Index Lite requires at least 1 Vive Tracker, although we highly recommend 2 for the full experience. Finishing Challenge This is the beautiful game in its purest form. Take your place on the pitch and score as many goals as you can in heated 30, 60 or 90 second rounds. Be fast but be precise and slam those top bins in. Fancy a more casual session? No problem switch to endless mode for a fun crossbar challenge or just play at your own pace. With physics and ball control honed by top clubs, you can smash the ball first time, take a touch or control the ball for more accuracy. You can even freestyle if you like, with every touch of the ball, every action, every kick feels amazingly realistic. Color Combos Upgrade your Rezzil Index Lite experience with ‘Color Combos’, one of Rezzil’s most popular drills used by elite players around the world. Simply hit the correctly colored balls with the side of your boot the game commands. It seems simple but as the pace quickens the pressure ramps up in this rapid-fire test of body and mind. You want harder? You want faster? Then push the limits higher and add modifiers to create a drill that would have the pros gasping for breath! Gear Up Open up your locker to view a variety of genuine Adidas boots and balls available to purchase to enhance your Rezzil Index Lite experience. Why not slip on the latest Predator Mutators and bang in the official Mexico 86 ball? Build up stats for achievements and XP to unlock new in-game kit and bragging rights. Rezzil Index Lite Features: Train like a pro - play with the same VR simulation technology being used to coach elite soccer athletes around the world. FREE Finishing Challenge with 3 time limits - 30, 60 or 90 seconds. FREE Endless mode lets you take on the Finishing Challenge at your own pace or a more casual practice session. Upgrade your Rezzil Index Lite experience with the add on ‘Color Combos’ drill taken straight from the pro level system. Play ‘Color Combos’ with a time limit for an intense mind and body soccer workout. Purchase genuine Adidas balls and boots from your locker. Commercial Licencing A commercial licence includes Color Combos DLC. Adidas, the 3-Bars logo and the 3-Stripes mark are registered trade marks of the adidas Group, used with permission.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1370130/header.jpg?t=1627046480",
    "Price": 0.0,
    "Developers": "Rezzil",
    "Publishers": "Rezzil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_b9a9cc719e1d05f376a8416737ae7c6db789333f.1920x1080.jpg?t=1627046480,https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_08a5c0322095a2bc4c3a399a5e2801ec1f593cdb.1920x1080.jpg?t=1627046480,https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_02655c08030b268aa68d7e7b69ec8700d1917598.1920x1080.jpg?t=1627046480,https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_d0d8f61774c813545a1f0cbd9f699b26478400cd.1920x1080.jpg?t=1627046480,https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_25cfadee38ac2a5fd6749b2f2e50400e428a5574.1920x1080.jpg?t=1627046480,https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_d40a2c19cdc9b77290cf5fc4a6f869fa59866c9c.1920x1080.jpg?t=1627046480,https://cdn.akamai.steamstatic.com/steam/apps/1370130/ss_4cb50a1524d1f9552a80d2d58eebe849a43ffde2.1920x1080.jpg?t=1627046480",
    "Slug": "rezzil-index-lite",
    "Meta Title": "Rezzil Index / Lite: Jan 18, 2021, Rezzil and Full Overview",
    "Meta Description": "Looking for information on Rezzil Index / Lite? Check out the release date (Jan 18, 2021), developer insights from Rezzil, and a complete game summary.",
    "Alt Text Image": "Official header image for Rezzil Index / Lite game - Steam 1370130",
    "Canonical URL": "https://gusku.site/game/rezzil-index-lite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rezzil Index / Lite\", \"description\": \"Looking for information on Rezzil Index / Lite? Check out the release date (Jan 18, 2021), developer insights from Rezzil, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rezzil\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rezzil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1370130/header.jpg?t=1627046480\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}