{
    "AppID": 1702510,
    "Name": "Rising Spire: Prelude",
    "Release date": "Feb 22, 2022",
    "About the game": "Rising Spire: Prelude is a free, 30 minutes demo for the upcoming turn based RPG Rising Spire. You will have the chance to experience the beautiful pixel world, meet some of the key characters in the story, get familiar with some of the core mechanics of the game and find out why did Atlas have to start his journey. Rising Spire follows the story of Atlas, a young Nephilim raised in seclusion by the mysterious Lilith. Their world, however, seems determined to reject and fight anything of godly origins - learn what it takes to survive in these untamed wilds, form unexpected alliances, find the balance between humanity and angelic powers and try to survive the divine army trying to kill you at every step. For now though - get a cup of coffee and enjoy a first glimpse into the story. :) Main Game Features Rising Spire ditches the traditional class system in favor of a weapons switch system. As you progress through the game, you unlock new weapons, each with its unique abilities, runes and style of gameplay. Tweak your build and find the best combination of weapons to fit your style and lead you to victory. You, Atlas, are a Nephilim. Not quite human, not quite Divine, you can walk both worlds the same - you can see a soul and you can also touch it. Use this to your advantage and harness the power of your enemies - store their purified souls inside your amulet and unleash their power to ensure victory in your next battles. The day and night cycle greatly influences your journey and exploration as the environment adapts to the time of day. Some secrets are only revealed in the moonlight, but take caution - while you may see (and avoid) your enemies during the day, the night brings forth random encounters and powerful enemies! Malus is a living world with a rich but dark past. While Rising Spire explores the classic JRPG themes of adventure, growth, and friendship, it also gives you a glimpse into darker themes such as loss, betrayal and revenge. Between unexpected twists and heavy subjects, you can also expect silly and lighthearted events to pop up. It is a real world, after all. The story of Rising Spire is told by those around you, and the relationships you form shape your journey. Each character in Malus is created with a rich and full existence - dreams, fears, quirks and bad days. While you have the liberty to go straight forward and rush to the Spire, the full story can only be uncovered by spending time with those you meet, learning about them, helping them and creating powerful bonds. Complete all Character Arcs for the full experience!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1702510/header.jpg?t=1656375114",
    "Price": 0.0,
    "Developers": "LFB Studios",
    "Publishers": "LFB Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_11a8cc46e9e7c25ab17a5c97df550ed0f7f67cb6.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_76d4c6e703f4bcd89f8b5006202ebdec8cf5434a.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_29bd65b97c7e1a1a7376017fac9fa44360371a53.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_a42b2e08018012bb3567a0ec5e8f3d83aa0c5568.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_e736d61a80205cee53ca7e7228159f944fb54cb1.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_73d203a289f86aed85ffe2bbe4ad32cd23cdb3a5.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_9a1dbcef972e4fc11d18585d87326b3e78e868ec.1920x1080.jpg?t=1656375114,https://cdn.akamai.steamstatic.com/steam/apps/1702510/ss_ee19fbe0a86653489bdfafb10a562be80778943b.1920x1080.jpg?t=1656375114",
    "Slug": "rising-spire-prelude",
    "Meta Title": "Rising Spire: Prelude: Feb 22, 2022, LFB Studios and Full...",
    "Meta Description": "Looking for information on Rising Spire: Prelude? Check out the release date (Feb 22, 2022), developer insights from LFB Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Rising Spire: Prelude game - Steam 1702510",
    "Canonical URL": "https://gusku.site/game/rising-spire-prelude",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rising Spire: Prelude\", \"description\": \"Looking for information on Rising Spire: Prelude? Check out the release date (Feb 22, 2022), developer insights from LFB Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LFB Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LFB Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1702510/header.jpg?t=1656375114\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}