{
    "AppID": 1474940,
    "Name": "Royal Roads 2 The Magic Box",
    "Release date": "Nov 27, 2020",
    "About the game": "A fascinating story about traveling along the kingdom’s roads. Help the princess save the people of the kingdom! Embark on an incredible journey through different countries in a world filled with ancient monuments and mysterious artifacts in the exciting game Royal Roads 2. Many various tasks, 50 game levels, intriguing plot, simple and addictive gameplay, and a magical world – it’s all waiting for you right now! Simple controls and intuitive training will help you easily understand the basics of the game. The world of fantasy opens its magic gate before us again. New mysteries and spells await you. In the game you will meet sorcerers, elves, druids, and even dwarves! Royal Roads 2 is a time management game, in which you set off on a journey along the roads of an enchanted kingdom. The game is set in a world of distant kingdoms, where order and tranquility reigned. A new day came, and a ringing bell signalled an important event for the kingdom. People rang the bells to announce the holiday. Merchants and guests from different lands arrived to visit the reception. As befits, Princess Layna met all the guests. Over the years of her reign, Layna began to gain experience in managing the kingdom. Each guest wanted to attract her kind gaze. One of the merchants said that a magical surprise was inside the central gift. An object worthy of kings was carefully transported in a separate bag with guards. The gift shone with bewitching colors. But in addition to its beauty, this gift was of tremendous power. On the way, Layna meets all kind of evil spirits that climbed out of forests and swamps because they are no longer resisted by humans. She encountered many dangers and hardships on her journey, although sometimes there were pleasant surprises too. Your magical journey begins in the castle after the reception. You need to understand how the gift affected the kingdom. The usual state of affairs in the kingdom is disturbed, and Layna will need to figure out how to get things back to normal. Layna decides to set off on a journey. What awaits her? Who is the sinister sorcerer that sent the mysterious gift? How can she restore order in the kingdom? How does she lift the spell? You will need to solve riddles and witchcraft problems and help Layna and the people of the kingdom restore their old way of life. Help Layna find answers to all the questions and return to the throne of the restored kingdom! In this huge magical kingdom, you will have to choose the path and direction of the roads that Princess Layna will follow, rebuild settlements, help strangers and subjects, and solve puzzles. Embark on an amazing adventure with Layna through the world of fairy tales and magic. Can the princess win against the forces of evil or only the memory of her previous successes and victories against witchcraft will remain? In the game you get: · Fascinating story full of mystical events · Colorful fantasy world · 50 various levels in 4 locations · Unique characters · Gameplay suitable for any age · Game mechanics: quick work, production, movement. · Simple controls and intuitive training. · Cool music Embark on an exciting journey along the Roads of the Kingdom. New adventures in a beautiful world of magic and sorcery await you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1474940/header.jpg?t=1606466948",
    "Price": 1.49,
    "Developers": "Studio Bidon Games",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1474940/ss_e2ab9a00eb590f1426b8be172b7d6db94b51d5b6.1920x1080.jpg?t=1606466948,https://cdn.akamai.steamstatic.com/steam/apps/1474940/ss_8734e640b8b83c8567c9e2b08bb12ae5c8f8fe3e.1920x1080.jpg?t=1606466948,https://cdn.akamai.steamstatic.com/steam/apps/1474940/ss_fd65de35c850e1bcaea5c4640dd69a3d198bbee7.1920x1080.jpg?t=1606466948,https://cdn.akamai.steamstatic.com/steam/apps/1474940/ss_83737e668a9c7ef45808fe3f2d1533f6985a2bc3.1920x1080.jpg?t=1606466948,https://cdn.akamai.steamstatic.com/steam/apps/1474940/ss_4feb08a2fbdc7485ec4e474a520d1a218e45134a.1920x1080.jpg?t=1606466948",
    "Slug": "royal-roads-2-the-magic-box",
    "Meta Title": "Royal Roads 2 The Magic Box: Nov 27, 2020, Studio Bidon G...",
    "Meta Description": "Looking for information on Royal Roads 2 The Magic Box? Check out the release date (Nov 27, 2020), developer insights from Studio Bidon Games, and a com...",
    "Alt Text Image": "Official header image for Royal Roads 2 The Magic Box game - Steam 1474940",
    "Canonical URL": "https://gusku.site/game/royal-roads-2-the-magic-box",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Royal Roads 2 The Magic Box\", \"description\": \"Looking for information on Royal Roads 2 The Magic Box? Check out the release date (Nov 27, 2020), developer insights from Studio Bidon Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Bidon Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1474940/header.jpg?t=1606466948\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}