{
    "AppID": 715510,
    "Name": "Run Zeus Run",
    "Release date": "Oct 11, 2017",
    "About the game": "About 'Run Zeus Run' is an endless runner with modern mechanics of a platformer, funky music, incremental challenge needing a little bit of strategy and addictive game. Try to get the highest score, the highest amount of coins, the highest monster kills and play until you are the best Zeus in the world! Features: Endless Platformer - Run, Jump, Dodge and Attack with thunderbolts. Keep running and increasing your score, collect coins and kill monsters for more score. Challenging Gameplay - This is not just an endless runner. this is not just a platformer either. The game needs strategy, patience and focus. With multitudes of game elements like Jump, Double Jump, Holding Jump and Thunder Attacks, you not only need to keep running on the platform but dodge different kinds of monsters too. Oh, and the game speeds up as you play. How far can you run with the progressive speed change? Leaderboards - You cannot call yourself the best unless you are on top of the Leaderboards. Your high score is instantly updated on the Steam Leaderboards where you can check your score and rank and compare it with other players. Coin Patterns - Even though coins are randomly generated on platforms, we have put time and effort to create some amazing coin patterns and designs. We will even allow our players to submit new coin patterns and add them to the game each week/month. How about sending a message to your special someone through the coins? Multiple Music Tracks - Background Music that keeps changing every time you play. Different types of music tracks for everyone, try to go through the end, where there is no more darkness. Achievements - There are 150+ quality achievements of different types to be unlocked, from Greek Letters and Numerals to specially hand crafted icons, emoticons and even emojis, all of which can be used on your Steam profile. Unlike other achievement hunter games, unlocking all the achievements won't be that easy due to various scenarios and community challenges set as conditions to unlock them. Controls -Left Mouse Button OR Space Bar to Jump -Left Mouse Double Click OR Double Space Bar to Double Jump -Left Mouse Button OR Space Bar hold for variable height Jump -Left Control Key to Zap/Thunder Attack",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/715510/header.jpg?t=1517521693",
    "Price": 0.0,
    "Developers": "GamerzDan",
    "Publishers": "GamerzDan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/715510/ss_3176ac5c1a90bb22d97c2770e6913da85030c72d.1920x1080.jpg?t=1517521693,https://cdn.akamai.steamstatic.com/steam/apps/715510/ss_194439dbec836406c8027159fb3d53e1efdad076.1920x1080.jpg?t=1517521693,https://cdn.akamai.steamstatic.com/steam/apps/715510/ss_2a6d049e66382fae031fb943e986da272403adfe.1920x1080.jpg?t=1517521693,https://cdn.akamai.steamstatic.com/steam/apps/715510/ss_c8b3e05b3cc88d360caa99dd45ebdc6af72c8604.1920x1080.jpg?t=1517521693,https://cdn.akamai.steamstatic.com/steam/apps/715510/ss_e11ad74423ec8e431199749741053df0527f7e5d.1920x1080.jpg?t=1517521693",
    "Slug": "run-zeus-run",
    "Meta Title": "Run Zeus Run: Oct 11, 2017, GamerzDan and Full Overview",
    "Meta Description": "Looking for information on Run Zeus Run? Check out the release date (Oct 11, 2017), developer insights from GamerzDan, and a complete game summary.",
    "Alt Text Image": "Official header image for Run Zeus Run game - Steam 715510",
    "Canonical URL": "https://gusku.site/game/run-zeus-run",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Run Zeus Run\", \"description\": \"Looking for information on Run Zeus Run? Check out the release date (Oct 11, 2017), developer insights from GamerzDan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"GamerzDan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GamerzDan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/715510/header.jpg?t=1517521693\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}