{
    "AppID": 552460,
    "Name": "Serious Sam VR: The Second Encounter",
    "Release date": "Apr 4, 2017",
    "About the game": "Serious Sam VR: The Second Encounter is a sequel to Serious Sam VR: The First Encounter – a frantic arcade action FPS, featuring singleplayer and co-op campaign modes, various multiplayer modes, all presented in glorious VR with Croteam's new Serious Warp movement system. Grab your VR headset and explore Sam's chaotic world of extreme violence and endless fun. KEY FEATURES: Serious Sam Fusion 2017 integration - receive free updates for this game through the central hub. Oh, and play cross-platform with players of the 'flat' version to find out what's the ultimate combo: hi-tech motion controllers or good old keyboard &amp; mouse Moves like Jagger - Serious Sam VR: The Second Encounter features a built-in (blink) teleportation system that allows you to move quickly and avoid charging enemies with the help of Sam's translocator device. You can tweak and adjust the way you move through VR space to best suit your playing style by using our own Serious Warp (TM) locomotion. Feeling much more hardcore than that? Use the smooth trackpad/analog stick movement and go full locomotion. Not another single-weapon game – Keyboards are for typing, so keep your fingers off. Grab a weapon, one for each hand, and boost your stopping power with Sam's new toys: Sniper Rifle, Flamethrower and Chainsaw! Use different weapon combinations or dual-wield two of the same to defeat Mental or use your arsenal in a deathmatch against 'flat peasants'. Old-school, but nice and shiny – Visit South America, ancient Mesopotamia and Medieval Europe, uncover over 130 hidden secrets and lose yourself in one of the most impressive VR experiences yet, all powered by the latest Serious Engine 2017. Steam Workshop Support - where you will be able to submit your content creation or download new player-created modifications. Full blast singleplayer action – Go back through time and use all of the available firepower to go head to head against five new enemies and three nasty bosses. Choose between five difficulty settings that can satisfy everyone - a gentle flower looking for some casual fun or a death machine ready to spread mayhem in virtual reality. Pick your poison - Plunge into chaotic 16-player versus multiplayer modes, some unique and others based on campaign levels, or enjoy the classic co-op action in a 12-level cooperative campaign mode featuring several difficulty settings, increased enemy strength (based on player count), friendly fire/infinite ammo options, and much more. Play the entire co-op campaign in classic 80's arcade style with limited lives. FREE DLC - SSVR: The Second Encounter includes the DLC Legend of the Beast, available for free with the VR version. MULTIPLAYER MODES: Beast Hunt and Team Beast Hunt - Compete against other players, or teams in Team Beast Hunt, hunting down various enemies to see who can get the best score at the end of each campaign level! Survival and Team Survival - Alone or with other team members, fight off endless enemy attacks in a specially designed survival map, and try to survive for as long as possible! Deathmatch and Team Deathmatch - Watch all hell break loose in free-for-all or team based battles with classic deathmatch rules! My Burden - Hold the special item and protect it from others in an attempt to get the highest score and secure your victory! Last Man Standing and Last Team Standing – Use your wits and reflexes to help your team or yourself to be the last man standing in these single-spawn modes. Capture the Flag - Infiltrate the opposing team's base, steal their flag and secure it to get points, while also defending your own. Instant Kill - It's simple - you get hit, you die!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/552460/header.jpg?t=1569336553",
    "Price": 39.99,
    "Developers": "Croteam VR",
    "Publishers": "Devolver Digital,Croteam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_3796939f3835b4e8235ad03c7ec0f0c6d383b792.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_ccc9820415c09ab4431981c9c0c7a599efcebbaa.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_cc2283d3aa0aab544baf9ae398204b3879c9483e.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_77380011b113fa70ed7d362fe373cf0f4efbeb54.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_1cb9189504449fe1674c3cabc4c2c3a1cb4ccf5e.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_a911abaebb32cc3b3d742b8ce03d6d9c9c4447a6.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_c34386692eaa6954e49c6dd6eebcc1b6060bb4c3.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_679948b1636e8b5b98aa3b4265cb29e480a7cf09.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_ccc9820415c09ab4431981c9c0c7a599efcebbaa.1920x1080.jpg?t=1569336553,https://cdn.akamai.steamstatic.com/steam/apps/552460/ss_e4c4152c322815965484623403ed6a96c2fab3e6.1920x1080.jpg?t=1569336553",
    "Slug": "serious-sam-vr-the-second-encounter",
    "Meta Title": "Serious Sam VR: The Second Encounter: Apr 4, 2017, Crotea...",
    "Meta Description": "Looking for information on Serious Sam VR: The Second Encounter? Check out the release date (Apr 4, 2017), developer insights from Croteam VR, and a com...",
    "Alt Text Image": "Official header image for Serious Sam VR: The Second Encounter game - Steam 552460",
    "Canonical URL": "https://gusku.site/game/serious-sam-vr-the-second-encounter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Serious Sam VR: The Second Encounter\", \"description\": \"Looking for information on Serious Sam VR: The Second Encounter? Check out the release date (Apr 4, 2017), developer insights from Croteam VR, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Croteam VR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Devolver Digital,Croteam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/552460/header.jpg?t=1569336553\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}