{
    "AppID": 1283380,
    "Name": "SpinZap",
    "Release date": "May 1, 2020",
    "About the game": "SpinZap is a challenging game in classic arcade style. Use your reflexes, dexterity and boss skills to conquer 81 levels of circle zapping madness. Your task is to steer the spinning circles using various control methods, such as halting, reversing and skipping forward, in order to find a clear path to fire at the plasma ball hiding at the center of the circles. Hit the plasma ball enough times before the time runs out to win the level. Failure to do so results in your cannon being instantly blown up in retaliation. Depending on how quickly and cleanly you finished the job, you are awarded one, two or three stars upon completion of each level. The full version of the game spans nine worlds, each world containing nine levels and its own theme song to set the mood. SpinZap starts off very easy, but grows harder for every world you conquer. In the end, you will need nerves of steel, perfect control and excellent timing to get the highest possible score. Single-player vs co-op mode SpinZap was originally designed as a single-player game, but has turned out to be a lot of fun to play in local co-op mode and in ”Remote Play Together” mode. All controllers are active in parallel, letting each player contribute to the team's successes (or failures) in the best way for each level. Note that there are no differences between the single-player and co-op modes - in fact, they are the same mode. Control options Keyboard and joypad / joystick controls are supported. Only keys or buttons are used to play the game. When playing alone, using the keyboard or an arcade stick is highly recommended. Using a joypad in single player mode is possible, but can be regarded as self-punishment, or the equivalent of a self-chosen difficulty level 'insane'. When playing cooperatively, joypads work verk well since each participating player only has to worry about their part. Resolutions and aspect ratios The game supports a wide range of aspect ratios, making it suitable for ultra-wide and ultra-tall display setups (provided that the GPU and its drivers support such configurations). Demo Remember to try the demo to get a hands-on understanding of what the game is about, and how well it plays on your system and with your controller setup. Warning This game contains circular rotating patterns which may make it unsuitable for people with photosensitive epilepsy or other photosensitive conditions. Player discretion is advised.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1283380/header.jpg?t=1615187651",
    "Price": 6.99,
    "Developers": "Enelingos",
    "Publishers": "Enelingos",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1283380/ss_683352248ff7f874c7494838c44e4392db2e524e.1920x1080.jpg?t=1615187651,https://cdn.akamai.steamstatic.com/steam/apps/1283380/ss_3abffcca39133ff5c9ded886a89046b088dfd258.1920x1080.jpg?t=1615187651,https://cdn.akamai.steamstatic.com/steam/apps/1283380/ss_19740eb99d52415c741f160f15bb46ae3044edd3.1920x1080.jpg?t=1615187651,https://cdn.akamai.steamstatic.com/steam/apps/1283380/ss_ac6cdd4ec32ba3111c40229d0e5a1862dfddd70a.1920x1080.jpg?t=1615187651,https://cdn.akamai.steamstatic.com/steam/apps/1283380/ss_30f9250fe167c39a3f3a88e7389cda400df9a8d4.1920x1080.jpg?t=1615187651,https://cdn.akamai.steamstatic.com/steam/apps/1283380/ss_24c06495fbd4582294f61b06837f97003aa149e6.1920x1080.jpg?t=1615187651",
    "Slug": "spinzap",
    "Meta Title": "SpinZap: May 1, 2020, Enelingos and Full Overview",
    "Meta Description": "Looking for information on SpinZap? Check out the release date (May 1, 2020), developer insights from Enelingos, and a complete game summary.",
    "Alt Text Image": "Official header image for SpinZap game - Steam 1283380",
    "Canonical URL": "https://gusku.site/game/spinzap",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SpinZap\", \"description\": \"Looking for information on SpinZap? Check out the release date (May 1, 2020), developer insights from Enelingos, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enelingos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Enelingos\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1283380/header.jpg?t=1615187651\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}