{
    "AppID": 1840570,
    "Name": "Tales of the Underworld - Legends of Primordial Sea",
    "Release date": "Jan 3, 2022",
    "About the game": "The sky city on the earth will fall with a loud noise, and it will appear like a blue star... What do you think about Elon musk, Jeff bezos, Steve Jobs, Albert Einstein, Stephen Hawking? Men who changed the past and influencing the future? Do you want to play a game while learning the meaning of life? When people act with good deeds, heaven responds with blessings When people commit evil crime, heaven responds with unstoppable disasters If we act against the good and do bad things, bad omens will come from the sky, and the world will suffer from drought and rain, floods, mutiny and civil chaos, and war will begin. Therefore, the ancients attached great importance to the observation of celestial phenomena. You can piece together the hidden fragments of riddle from this graphic novel comic style game... Tales of Terra Ocean Long before the distant past, Earth was an organic whole without form and void. A divine goddess named Pan Gu separated Earth from Heaven to form Terrestrial continents. Once every sixty six thousand six hundred and sixty six year, a disastrous scourge would be brought upon this land. Floods, drought, famines, earthquakes and disease epidemics spread through out Earth. Four Sages walked across the continents and discovered the myth of contrary forces, which were interconnected and interdependent in the dynamic natural cycle. Relying on absorbing the spirits of sun, moon, fire, water, wind and earth, an animating force was formed within stones which could summon the catastrophic destruction brought upon land but also able to preserve the existence of mankind. Weapons were forged with spiritual gemstones, passed down through generations and were called 「Eternal Summoning Weapons of the Ancient」. As the plot progresses throughout this Visual Novel ARPG, readers will be able to browse inside an ordinary youngster’s extraordinary journey, retroactively entering the chronological time warp of paranormal summoning monsters, and witnessing a new era of fantasy stories. This is not a series of Hayao Miyazaki , not Studio Ghibli Animation's Tales from Earthsea or Tales of Earthsea This is not God of War, not GTA, not Call of Duty, not the last of us, not resident evil, not Onimusha, not Devil May Cry This is a story rich Indie game completely made by one person, this Visual Novel Manga style ARPG game guarantees an unprecedented scale in the classical Taiwanese literature. A literature of fantasy moniker Description: Legends of Primordial Sea is a hybrid game of Survival Platform ARPG &amp; Visual Novel inspired &amp; developed by Reed. Players will enter the virtual world to find themselves explored the Underworld and must fight their ways to survive in an unknown land of enemies, to unravel the mythical story behind Jonah's plan. key features: Survive, Strive, and Thrive the Quadra Martial Artist Life: Face aggressive ninjas while taking on unknown enemies in the Underworld. Explore the Ruins of Primordial Sea An interesting story &amp; a hyper-manga style experience that keep you immersed in the fantasy world of Primordial Sea, a rich story is waiting to be discovered. What you can expect -Immerse yourself in a story rich adventure, the saga of two friends trying to enter Limbo against all odds -Immediate to play, accessible, a pause in a busy day, a visual novel game that will make you cry -A solo game that you can also play with a friend, a second player can join or drop out anytime",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1840570/header.jpg?t=1641208352",
    "Price": 14.99,
    "Developers": "Reed",
    "Publishers": "CS Publish",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_12ad9211249f15e3105b2fe07cf5d99a22112bd0.1920x1080.jpg?t=1641208352,https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_bd5e1519a84476d4d52492e1902ca9acb63b2486.1920x1080.jpg?t=1641208352,https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_65358adda6f1b80d34e4bc2196bc887dbb7884dc.1920x1080.jpg?t=1641208352,https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_9be241079f3dab61f9d2631c1d698f720a368a05.1920x1080.jpg?t=1641208352,https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_22989292ef6e44d1b430836ddcfe84b7950513ef.1920x1080.jpg?t=1641208352,https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_4f7cdcea85ce76564fe92404a226c2f97d82747f.1920x1080.jpg?t=1641208352,https://cdn.akamai.steamstatic.com/steam/apps/1840570/ss_64618c790fe2f14c2267ee368f277472520aff17.1920x1080.jpg?t=1641208352",
    "Slug": "tales-of-the-underworld-legends-of-primordial-sea",
    "Meta Title": "Tales of the Underworld - Legends of Primordial Sea: Jan ...",
    "Meta Description": "Looking for information on Tales of the Underworld - Legends of Primordial Sea? Check out the release date (Jan 3, 2022), developer insights from Reed, ...",
    "Alt Text Image": "Official header image for Tales of the Underworld - Legends of Primordial Sea game - Steam 1840570",
    "Canonical URL": "https://gusku.site/game/tales-of-the-underworld-legends-of-primordial-sea",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tales of the Underworld - Legends of Primordial Sea\", \"description\": \"Looking for information on Tales of the Underworld - Legends of Primordial Sea? Check out the release date (Jan 3, 2022), developer insights from Reed, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reed\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CS Publish\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1840570/header.jpg?t=1641208352\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}