{
    "AppID": 1998760,
    "Name": "The Way of the Badass",
    "Release date": "Jun 8, 2022",
    "About the game": "The Way of the Badass is a third-person, 2D shooter that features basic movement controls, a wide spectrum of weaponry, and a heavy emphasis on visual storytelling. Being 2D, most movement is done by going either left or right, with some up and down depending on pathways and efforts to dodge incoming enemy projectiles. An interactive cartoon! Drawn and completely created by Jay Geis himself, he alone single-handedly devised this on a team of none but himself, on a zero dollar budget, and on a part-time schedule. The whole experience should feel like playing through one of his comics (specifically set in the 'Short Bus' franchise on the timeline set 30 years after the original 'Hero Team' stories). Witness what nothing but raw enthusiasm can bring to the table! Female Protagonist! The adventure centers around a 5-year-old girl who's looking for her family - and her father specifically, a retired Colonel and World War III veteran. The story is told through her eyes, those adorable yet mean-spirited eyes. Colorful Characters! From the Duke of Badass named Duke Pope who's humbly serving as Scarlet's lieutenant, to a hobo whose guts and glory aspire to set the world record for 'most swear words in a video game', to a literal Nazi that holds the torch onto the failed ideology of World War II, each of the characters are distinct and memorable for their own no-holding-back attitudes when faced with the seemingly impossible challenge of restoring the artificial order of humanity as the masters of the Earth. Defy the censors, and resist the Thought Police! Such oppression is lurking in this world, even in the formerly Libertarian haven of Las Vegas, Nevada. And it's going to take an absurd crew to break through the conditioning of sappiness. That means ruling over a secret society called the 'Kingdom of Badass'! Learn more about their culture, where punks, Nazis, and American soldiers unite! Explore the lore! Tidbits are hidden throughout various locations that reveal what has happened in this fictional alternate timeline, spanning from the 2010s to the game's present in the 2040s. See what the kids who 'Ride the Short Bus' are taught in their museums and history textbooks. Full Voice Acting! Featuring the debut of Jay's voice talents, witness this single, lonely male perform as a little girl, a Nazi Stormtrooper, a mentally insane homeless person, a grizzled war veteran, a grizzly Viking Berserker, a knife whooshing through the air, and many more! Rock out to an all metal soundtrack! Also introducing the debut of Jay's performance as a GUITAR WARRIOR! From the psychotic noise of Violet, to the viking's roar, and the trippy vibes inside an alien's brain, each song has its own unique identity. Conduct unethical experiments on the invaders and their abominable creations! Don't just kill the tyrants. Torture them with methods including but not limited to: fire and acid, psychological trauma inflicted from school, and COVID! Secrets and Easter Eggs! There are a slew of cute little goodies! Some of them give early access to powerful weapons, and others are there just for fun. Unabridged Dev Diary! If you've ever wanted to pick Jay's brain, there is a way to do that. Get more info than you've ever wanted to know, every step of the creation process, involving not only behind-the-scenes but ALSO behind-the-behind-the-scenes! (That would be in the 'News' feeds and similar announcements pages, not necessarily in the game itself.) Free...not free, asterisk; free, exclamation mark! No external info stealers, no 'in-app purchases' or 'microtransactions', no invasive advertising, no DRM, no fine print, and no horse manure! This is so chock full of potential and equally juxtaposed by obscurity, Jay is giving it away for free! So tell all your family, friends, and pets about the journey of this Patron Saint of Cruel and Unusual Punishment!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1998760/header.jpg?t=1654701976",
    "Price": 0.0,
    "Developers": "Jay Geis",
    "Publishers": "Jay Geis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1998760/ss_bab271960541bcf7122648ad9656a39a33d77cc1.1920x1080.jpg?t=1654701976,https://cdn.akamai.steamstatic.com/steam/apps/1998760/ss_5f808056156f476826dc22d03abf8ebd04327aa1.1920x1080.jpg?t=1654701976,https://cdn.akamai.steamstatic.com/steam/apps/1998760/ss_b6b9a341fae0a29a0593c6a3e84d258ab1fcf96a.1920x1080.jpg?t=1654701976,https://cdn.akamai.steamstatic.com/steam/apps/1998760/ss_690b2396b1c0732ad10810f5863605127b99b225.1920x1080.jpg?t=1654701976,https://cdn.akamai.steamstatic.com/steam/apps/1998760/ss_0c5de036775d002cf1055f01d8e6fbcad2a95742.1920x1080.jpg?t=1654701976",
    "Slug": "the-way-of-the-badass",
    "Meta Title": "The Way of the Badass: Jun 8, 2022, Jay Geis and Full Ove...",
    "Meta Description": "Looking for information on The Way of the Badass? Check out the release date (Jun 8, 2022), developer insights from Jay Geis, and a complete game summary.",
    "Alt Text Image": "Official header image for The Way of the Badass game - Steam 1998760",
    "Canonical URL": "https://gusku.site/game/the-way-of-the-badass",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Way of the Badass\", \"description\": \"Looking for information on The Way of the Badass? Check out the release date (Jun 8, 2022), developer insights from Jay Geis, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jay Geis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jay Geis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1998760/header.jpg?t=1654701976\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}