{
    "AppID": 955700,
    "Name": "TITAN HUNTER",
    "Release date": "Feb 17, 2020",
    "About the game": "TITAN HUNTER - roguelike game where you are forced to wander around the world in search of the TITANS who destroyed your people. You will have to go through the intricate locations filled with aggressive monsters and powerful weapons. Choose your hero arm yourself with powerful weapons and go to a dangerous world. Destroy aggressive monsters and bosses, find funny references and Easter eggs, meet different partners or interesting crooks and interact with them. Go through a hell that you never dreamed of, find the Oldest of the genus TITAN and destroy it thereby freeing his people from their centuries-old supervision filled with horror and fear. Become a hero who will save the world. As you progress through the game you will find weapons: Coming for the destruction of monsters and bosses, using a variety of shells and tactics that are not limited to the size or capabilities they can be like conventional bullets or can be presented in the form of giant red-hot missiles. Also, you will not pass the game without meeting on the way aggressive monsters: Monsters in the game can meet different, some will look like small and harmless animals, and others on the contrary will do everything to destroy you. Also you will meet strangers or just a good companions? In the game you will meet an evil witch who will not mind to treat you to a bottle of freshly baked potion, as well as you can look into the tavern to the greedy trader who despite the difficult times but still sell us a couple of three interesting weapons but keep in mind this is only the beginning and who knows who else can meet you And also during the game you will meet titans : This is a separate type of monsters that have a lot of health and special abilities. Thanks to good protection and a large supply of health to defeat them is not so easy, but with the proper skill and desire everything is possible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/955700/header.jpg?t=1603301085",
    "Price": 1.99,
    "Developers": "Enoops",
    "Publishers": "Enoops",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/955700/ss_4995fce8a32f953e3c4b80f271a9ed7a316f2e56.1920x1080.jpg?t=1603301085,https://cdn.akamai.steamstatic.com/steam/apps/955700/ss_7d5a1551b758805e0ae33b586c9da5ab9bcfe013.1920x1080.jpg?t=1603301085,https://cdn.akamai.steamstatic.com/steam/apps/955700/ss_f3ce1e812670080b3bbc3318307639e7706333b1.1920x1080.jpg?t=1603301085,https://cdn.akamai.steamstatic.com/steam/apps/955700/ss_e8ba76d2aebf36fc29743c650a1f85ee0b512cdb.1920x1080.jpg?t=1603301085,https://cdn.akamai.steamstatic.com/steam/apps/955700/ss_5d1447a8815402856b51bfafc9594296517a6af2.1920x1080.jpg?t=1603301085",
    "Slug": "titan-hunter",
    "Meta Title": "TITAN HUNTER: Feb 17, 2020, Enoops and Full Overview",
    "Meta Description": "Looking for information on TITAN HUNTER? Check out the release date (Feb 17, 2020), developer insights from Enoops, and a complete game summary.",
    "Alt Text Image": "Official header image for TITAN HUNTER game - Steam 955700",
    "Canonical URL": "https://gusku.site/game/titan-hunter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TITAN HUNTER\", \"description\": \"Looking for information on TITAN HUNTER? Check out the release date (Feb 17, 2020), developer insights from Enoops, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enoops\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Enoops\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/955700/header.jpg?t=1603301085\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}