{
    "AppID": 364360,
    "Name": "Total War: WARHAMMER",
    "Release date": "May 24, 2016",
    "About the game": "Total War: WARHAMMER The Old World echoes to the clamour of ceaseless battle. The only constant is WAR! A fantasy strategy game of legendary proportions, Total War: WARHAMMER combines an addictive turn-based campaign of epic empire-building with explosive, colossal, real-time battles. All set in the vivid and incredible world of Warhammer Fantasy Battles. Command five wholly different races: Bretonnia, the Empire, the Dwarfs, the Vampire Counts and the Greenskins, each with their own unique characters, battlefield units and play style. Lead your forces to war with powerful Legendary Lords from the Warhammer Fantasy Battles World, arming them with fabled weapons, armour and deadly battle magic; hard-won in individual quest chains. For the first time in a Total War game, harness storms of magical power to aid you in battle and take to the skies with flying creatures, from ferocious dragons and wyverns to gigantic griffons. Additional Free Content Total War: WARHAMMER launched to critical acclaim in May 2016. Since then, a wealth of free content has been added, including the recent addition of Bretonnia as the fifth playable race in the Old World. As well as this additional race, the rich world of Total War: WARHAMMER has been expanded since release with the inclusion of four new Legendary Lords, brand new units, new Lores of Magic and over 30 bespoke maps for single and multiplayer battle. These updates are available for free to all new and existing players. Hundreds of hours of gameplay await you at the dawn of a new era. Total War: WARHAMMER brings to life a world of legendary heroes, towering monsters, flying creatures, storms of magical power and regiments of nightmarish warriors. Lead Extraordinary Races The Chivalrous knights of Bretonnia, the valiant men of the Empire, the vengeful Dwarfs, the murderous Vampire Counts and the brutal Orcs and Goblins of the Greenskin tribes. Each Race is wholly different with their own unique characters, campaign mechanics, battlefield units and play style. Command Legendary Characters March your forces to war as one of 12 Legendary Lords from the Warhammer Fantasy Battles World, arming them with fabled weapons, armour, mounts and deadly battle magic as you uncover their tales through a series of unique narrative quest chains. Conquer this World The very first Total War game to feature a fantasy setting. In the Old World Campaign, experience incredible depth and the freedom to conquer as you see fit across a gigantic sand-box map. Crafted from a twisted magical landscape and populated with an incredible array of awesome and deadly creatures, this is your chance to experience fantasy strategy on a scale as yet unimagined. Unleash the Monsters The battlefields of Total War: WARHAMMER echo to the swoop and roar of dragons, the bellowing of giants and the thundering hooves of monstrous cavalry. Towering beasts of both earthly and supernatural origin wade into the melee of battle, bringing death to hundreds of lesser creatures at a time. Harness the Winds Of Magic Smite your enemies with magical storms, melt their armour, sap their fighting spirit or bolster your own forces with devastating spells that split the sky and consume the battlefield. Rally wizards, shamans and necromancers to your armies and bend titanic and unpredictable energies to your whim. Watch the Skies Harass your enemies with Dwarfen Gyrocopters, plunge into their front-lines with terrifying Wyverns and achieve air superiority with a stunning array of flying units for the first time in a Total War game. Entirely new tactical possibilities present themselves as you deploy your winged minions in open battles and jaw-dropping sieges. What is more, this title will go on to combine with two future sequels and additional content packs to create the largest Total War experience ever. An epic trilogy of titles that will redefine fantasy strategy gaming.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/364360/header.jpg?t=1632304339",
    "Price": 59.99,
    "Developers": "CREATIVE ASSEMBLY,Feral Interactive (Linux),Feral Interactive (Mac)",
    "Publishers": "SEGA,Feral Interactive (Linux),Feral Interactive (Mac)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_c7940499879bb19cd6a04bccf487a4d33a9499c6.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_1215e2148532f1b6cd49d6f3d25537547bac3cc0.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_8e269324ebfb94e64bd4937a284e1d170f8cfdea.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_2bac98669658d79d19bffa1b4ce3fddb0f96e132.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_d6bdffce07824b72b467d8abe7c1c64371ced823.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_15c102e5ac8823cfd1a8716d8ba99e9f7845bc30.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_2a5a972bd02f30c24065451ff97935f69aa3c678.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_2f2d15b35a306d364c7dbfd8042d5bff1bb33088.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_8f4e833dfab1a5d9a2f2fbee7ec823dc78aa89f3.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_867a0cecae4422b3de4fb3f7c7715193d814336f.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_4c52f06f2a2650ec8fb5e25ef8457668ae84abc5.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_a1e89ee788a8eefbcda9d347c62e249534dbdb45.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_4959f7022568001799bd3fb081a2429c364af83c.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_15b6f0d0039e29d2c200687b92c996526fd5dcdb.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_fa0a5cf935a02fe91f24295b3eba1b139259030e.1920x1080.jpg?t=1632304339,https://cdn.akamai.steamstatic.com/steam/apps/364360/ss_5f63ca59389d935731b20f9b2596040a0d9392fc.1920x1080.jpg?t=1632304339",
    "Slug": "total-war-warhammer",
    "Meta Title": "Total War: WARHAMMER: May 24, 2016, CREATIVE ASSEMBLY,Fer...",
    "Meta Description": "Looking for information on Total War: WARHAMMER? Check out the release date (May 24, 2016), developer insights from CREATIVE ASSEMBLY,Feral Interactive ...",
    "Alt Text Image": "Official header image for Total War: WARHAMMER game - Steam 364360",
    "Canonical URL": "https://gusku.site/game/total-war-warhammer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Total War: WARHAMMER\", \"description\": \"Looking for information on Total War: WARHAMMER? Check out the release date (May 24, 2016), developer insights from CREATIVE ASSEMBLY,Feral Interactive ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 24, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"CREATIVE ASSEMBLY,Feral Interactive (Linux),Feral Interactive (Mac)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA,Feral Interactive (Linux),Feral Interactive (Mac)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/364360/header.jpg?t=1632304339\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}