{
    "AppID": 689790,
    "Name": "VEGAS Pro 15 Edit Steam Edition",
    "Release date": "Sep 5, 2017",
    "About the game": "VEGAS Pro 15 Edit – Steam Edition provides you with state-of-the-art editing tools in a streamlined, logical interface, allowing for full creative freedom for your professional video and audio editing projects. Version 15 is probably the most exciting version yet to have been published. Packed with exactly the right tools for precise project editing in a variety of formats, for creative editing and for immediate distribution. Whether you're working in HD or 4K, version 15 combines everything into a single workflow. Now, you can finish large projects even faster thanks to NVIDIA and Intel QSV hardware acceleration. Highlights Your video projects will gain in sophistication, just like your gameplays. The most important features of VEGAS Pro 15 Edit – Steam Edition: New, innovative and fully customizable user interface Unlimited tracks for video and audio Intuitive drag and drop workflow HEVC file support Picture-in-Picture, Crop and lookup table OFX-plug-ins ACES 1.0 support Optimized hardware acceleration Bézier tool for masking Video and audio production Innovative editing tools Edit your gameplays natively in resolutions of up to 4K using drag-and-drop functionality. The Vegas Pro 15 Edit interface provides an impressive array of innovative tools and thoughtful touches with a fully customizable workspace for accomplishing a wide range of production tasks. Edit an exhilarating gameplay video or drone footage fast, add amazing video and audio effects, then upload it directly to your channel to share experiences with your subscribers. No greenscreen at hand? Use Bézier drawing tools to quickly and easily create rectangular and oval-shaped masks which isolate or mask out portions of your gameplays. Complete creative freedom VEGAS Pro 15 Edit – Steam Edition natively combines many video, audio and image formats on one timeline. The new, individually configurable user interface allows you to set up your own unique work space for ultimate flexibility. Focus completely on your creativity and present your ambitious gameplays in a format to match.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/689790/header.jpg?t=1578001075",
    "Price": 0.0,
    "Developers": "MAGIX Software GmbH",
    "Publishers": "MAGIX Software GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/689790/ss_35ef5dd949575eeaa5aaba9b044240d43b144c53.1920x1080.jpg?t=1578001075,https://cdn.akamai.steamstatic.com/steam/apps/689790/ss_4d15d3a0a8b401927b421445d76329657bc30dfd.1920x1080.jpg?t=1578001075,https://cdn.akamai.steamstatic.com/steam/apps/689790/ss_c91c498f15038ca3487fcfd7cdd0c075c360c29f.1920x1080.jpg?t=1578001075,https://cdn.akamai.steamstatic.com/steam/apps/689790/ss_732b4aab91ceb7439c7437b84e41584e7b2ffc91.1920x1080.jpg?t=1578001075,https://cdn.akamai.steamstatic.com/steam/apps/689790/ss_2891285b0439aec2720b32a903d3b178cf5ebad5.1920x1080.jpg?t=1578001075",
    "Slug": "vegas-pro-15-edit-steam-edition",
    "Meta Title": "VEGAS Pro 15 Edit Steam Edition: Sep 5, 2017, MAGIX Softw...",
    "Meta Description": "Looking for information on VEGAS Pro 15 Edit Steam Edition? Check out the release date (Sep 5, 2017), developer insights from MAGIX Software GmbH, and a...",
    "Alt Text Image": "Official header image for VEGAS Pro 15 Edit Steam Edition game - Steam 689790",
    "Canonical URL": "https://gusku.site/game/vegas-pro-15-edit-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VEGAS Pro 15 Edit Steam Edition\", \"description\": \"Looking for information on VEGAS Pro 15 Edit Steam Edition? Check out the release date (Sep 5, 2017), developer insights from MAGIX Software GmbH, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/689790/header.jpg?t=1578001075\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}