{
    "AppID": 1696900,
    "Name": "Venture Within",
    "Release date": "May 29, 2022",
    "About the game": "Venture Within, a deep-sea roguelite game, takes you inside magically altered, deep-sea hydrothermal vents. As Alice Tharp, daughter of the famous Geomancer Dr. Talia Tharp, you travel to the submarine, Simon, to join your mother’s research expedition. When you arrive, the entire expedition team is missing! To find them, climb your way through vent tower walls, battle magically altered creatures, and avoid natural hazards, while upgrading your skills! Nearly one hundred years ago, the world discovered magic, and everything changed, including the pursuit of scientific research. As the world focused on arcane studies, science was viewed as unnecessary. However, a small group of mages still saw value in science and formed Aeon Academy. Academy researchers use magic and science to address questions about our world. Now, the Academy has sent its first expedition to study deep-sea hydrothermal vents, led by Dr. Talia Tharp aboard the submarine Simon. Excited to join her mother’s expedition aboard the Simon, Alice arrives to find a nearly empty, damaged submarine. Only her mother’s magic rock, Silex, and the submarine’s Mechanist, Fritz Boulder, remain on board. Together, the three must find the lost expedition team. By returning to the hydrothermal vents visited by the expedition, you will unravel this mystery – and, hopefully, find your mother too. SURVIVE Help Alice survive attacks from magically altered creatures based on fauna found in today’s deep-sea hydrothermal ecosystems. Fight off everything from tube worms to animated sulfide minerals. COLLECT AND HARVEST Collect up to 25 minerals and scientific items dropped by the lost geomancers. Activate mineral samples for temporary boosts to your skills and carry scientific items in your field bag to passively increase your skills. Harvest Pyrite to fuel the Simon’s 3D printer and print permanent upgrades. RESEARCH AND UPGRADE Research the items you find and creatures you defeat to gain “research points”. Use these points to unlock up to 16 unique 3D Blueprints for the GeoTech, the Simon’s 3D Printer. LEARN SCIENCE Enjoy a window into the deep-sea marine geology of hydrothermal vents. In game geologic events, scientific items, minerals and rocks, vent types, and the descriptions of hydrothermal circulation are all based on scientific data and practices. What would you expect from a game funded by the United States National Science Foundation? In fact, game development was supported by National Science Foundation grant #OCE-1753354.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1696900/header.jpg?t=1653825097",
    "Price": 0.0,
    "Developers": "Polymorphic Games,Idaho Geodynamics",
    "Publishers": "University of Idaho,Polymorphic Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1696900/ss_828270ad52bd2c679279448800d891bb84256a95.1920x1080.jpg?t=1653825097,https://cdn.akamai.steamstatic.com/steam/apps/1696900/ss_f1186e2e9911ce52f1e3311bc72c621b769d5366.1920x1080.jpg?t=1653825097,https://cdn.akamai.steamstatic.com/steam/apps/1696900/ss_4fe9c74adc6417e5c1da12d04d32f9215dd08d01.1920x1080.jpg?t=1653825097,https://cdn.akamai.steamstatic.com/steam/apps/1696900/ss_ea44fda17aebf5ffc67999b55c02c5674bdf8675.1920x1080.jpg?t=1653825097,https://cdn.akamai.steamstatic.com/steam/apps/1696900/ss_33c8351ec0e5c2d15839f0f8041f34c1464dce88.1920x1080.jpg?t=1653825097,https://cdn.akamai.steamstatic.com/steam/apps/1696900/ss_b9c98a0444b0c4ae71ee1ff50218a0b5107e6844.1920x1080.jpg?t=1653825097",
    "Slug": "venture-within",
    "Meta Title": "Venture Within: May 29, 2022, Polymorphic Games,Idaho Geo...",
    "Meta Description": "Looking for information on Venture Within? Check out the release date (May 29, 2022), developer insights from Polymorphic Games,Idaho Geodynamics, and a...",
    "Alt Text Image": "Official header image for Venture Within game - Steam 1696900",
    "Canonical URL": "https://gusku.site/game/venture-within",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Venture Within\", \"description\": \"Looking for information on Venture Within? Check out the release date (May 29, 2022), developer insights from Polymorphic Games,Idaho Geodynamics, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Polymorphic Games,Idaho Geodynamics\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"University of Idaho,Polymorphic Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1696900/header.jpg?t=1653825097\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}