{
    "AppID": 745750,
    "Name": "Viking Village",
    "Release date": "Apr 24, 2018",
    "About the game": "We love classic RTS games like Age of Empires and Starcraft - Viking Village is our tribute to those timeless games. Viking Village is a minimalist real-time strategy/base defense hybrid game in which you build and defend a village from evil knights. Collect resources, build archer towers at strategic positions and control melee Viking warriors directly to survive. Attack enemy village and destroy their village fire to win. Capture powerful barbarian from the forest to add to your defense. Even control deer directly if you need some extra attack power! Attack pirate camps to get some extra resources. Game Modes: - Adventure: Defeat enemy villages on randomly generated islands. - Rogue Lite: Defeat enemy villages just with your hero + army. Hero gets only one life. - Tower Rush: Destroy all enemy towers on the map. - Survive 20 days: Defend your village for 20 days. - Village Vs Village: Classic RTS mode. Attack enemy Village and destroy their village fire to win the game. - Quick Survival: No buildings and villagers. Just your hero, pet and units defending against constant waves of enemies. - Infinite: Survive as many days as possible. Enemies become stronger each night. - Sandbox: No resource limits. Pure mindless fun! - Build a Ship: Defend the village long enough to build a ship. - Peaceful: No enemies. Just build a peaceful village. Features: - Train Villagers, Warriors and Archers - Create farms, mines and plant trees to gather resources - Take control of deer and attack enemies with them! - Defeat pirates to get resources, or hire them to protect your village - Capture the Barbarian, and he will defend the village and even gathers resources by killing pirates! - Defeat the Pirate Captain, to have a powerful unit to watch over your village. Alternatively, just give some resources to hire him! - Play in top-down view or control a warrior in 3rd person mode - Villagers are completely AI controlled, so that you can focus on building and combat - Beautiful graphics",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/745750/header.jpg?t=1526275529",
    "Price": 4.99,
    "Developers": "Limitless Fun, LLC",
    "Publishers": "Limitless Fun, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/745750/ss_268fdc05b0e88cc25b0e3b4f34f03e70a271c7c2.1920x1080.jpg?t=1526275529,https://cdn.akamai.steamstatic.com/steam/apps/745750/ss_10798f464254c68c36d4ab531ad6ff337813f4a5.1920x1080.jpg?t=1526275529,https://cdn.akamai.steamstatic.com/steam/apps/745750/ss_de43ef085ab00af2b0b54328c400d0dd59b27d61.1920x1080.jpg?t=1526275529,https://cdn.akamai.steamstatic.com/steam/apps/745750/ss_175f5838ac64081647d2ab0bbb7c4504007c30f4.1920x1080.jpg?t=1526275529,https://cdn.akamai.steamstatic.com/steam/apps/745750/ss_433d4026750a021e9b2a9efc451d9d79c58c62f1.1920x1080.jpg?t=1526275529",
    "Slug": "viking-village",
    "Meta Title": "Viking Village: Apr 24, 2018, Limitless Fun, LLC and Full...",
    "Meta Description": "Looking for information on Viking Village? Check out the release date (Apr 24, 2018), developer insights from Limitless Fun, LLC, and a complete game su...",
    "Alt Text Image": "Official header image for Viking Village game - Steam 745750",
    "Canonical URL": "https://gusku.site/game/viking-village",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Viking Village\", \"description\": \"Looking for information on Viking Village? Check out the release date (Apr 24, 2018), developer insights from Limitless Fun, LLC, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Limitless Fun, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Limitless Fun, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/745750/header.jpg?t=1526275529\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}