{
    "AppID": 1001390,
    "Name": "VireFit",
    "Release date": "Mar 25, 2019",
    "About the game": "VireFit is a virtual reality application created for professional trainings, sport skills and active leisures with family. This is a full-fledged fitness center which includes three 'zones': a tennis court, a boxing ring and a basketball court. The Game modes. 'Basketball' . So you have three baskets: yellow, green and red. Your task is to catch the balls and send them to the basket of the desired color. The more hits, the bigger the score. The game develops the technique of throwing, concentration, accuracy, speed of reaction and is suitable for preparatory training. 'Tennis' . You have a big target. Your task is to dodge bombs and hit the balls so that they hit the target exactly. The closer the center of the target, the more points you earn. This is a medium intensity workout that develops accuracy and speed of reaction. 'Boxing' . In front of you is a virtual opponent with advanced artificial intelligence. Your job is to kick him faster than he does. You can dodge, block and strike. Your enemy works quickly and changes tactic, assesses movement and speed of the player. The mode is implemented in the spirit of classic box. This is a high intensity workout that will keep you fit. Game features. Three game modes: 'Boxing', 'Basketball', 'Tennis'; Three levels of difficulty: easy, normal, difficult; Three load levels: 'Basketball' and 'Tennis' modes: 3, 5 and 7 minutes; 'Smart' virtual opponent in boxing; Preservation of statistics about the number, duration and intensity of training; Feedback. Vibrating sensors in your joysticks will work when you hit the target; Virtual trainer. Track your results and adjust your workout time. Thanks to a simple design, the application will set you up for training and help you concentrate on your task, and the most realistic animation will allow you to immerse yourself in the world of professional sports: the opponent in Boxing mode moves like a real boxer, and Basketball helps you build the right throw technique. Rival with artificial intelligence In the 'Boxing' mode you will find smart opponent who will replace the real coach and sparring partner. The opponent will automatically adjust to: your height. Practice strikes on an equal opponent; your training level. A virtual boxer will give odds to a novice and make the pro sweat; your tactics. Your enemy learns from you and makes decision, focusing on your movements, speed and combat technique. A “smart” opponent can keep a distance: comes when you move away and retreats back when you press. A few missed strikes - and the boxer will go on the attack or start to defend. Built-in endurance brings artificial intelligence closer to a real person: after a series of successful attacks from your side, enemy “gets tired”, tries to step back and will attack less often. The virtual boxer makes decisions independently, based on your movements and tactics. The boxer does not use ready-made algorithms and scripts, which means that they cannot be recognized and used. VireFit rated! The application has been tested by more than 50 trainers and several fitness clubs; Corporate package solution installed large sports centers; VireFit won the Cyber Garden hackathon twice. More than sport. More than a game. VireFit is an excellent entertainment for an active family, an interesting sport game for schoolchildren and their parents, a virtual fitness center at home. All you need is virtual reality glasses and some free time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1001390/header.jpg?t=1572340750",
    "Price": 10.99,
    "Developers": "Daemon Cat",
    "Publishers": "Daemon Cat",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1001390/ss_2bfe76091fef8f7d7de1b2a0269ad0bf729780f2.1920x1080.jpg?t=1572340750,https://cdn.akamai.steamstatic.com/steam/apps/1001390/ss_5e5f3644f8e9c4ef9308d4acd13bbf847bc9a8bb.1920x1080.jpg?t=1572340750,https://cdn.akamai.steamstatic.com/steam/apps/1001390/ss_011768f99a9582ea1adecbcf210ec04ea3effa99.1920x1080.jpg?t=1572340750,https://cdn.akamai.steamstatic.com/steam/apps/1001390/ss_43431b95aa049d7a75b468b22a3374f3a30b8ec8.1920x1080.jpg?t=1572340750,https://cdn.akamai.steamstatic.com/steam/apps/1001390/ss_45bf2f7cf74130b991a0051033153beeb2263c2b.1920x1080.jpg?t=1572340750",
    "Slug": "virefit",
    "Meta Title": "VireFit: Mar 25, 2019, Daemon Cat and Full Overview",
    "Meta Description": "Looking for information on VireFit? Check out the release date (Mar 25, 2019), developer insights from Daemon Cat, and a complete game summary.",
    "Alt Text Image": "Official header image for VireFit game - Steam 1001390",
    "Canonical URL": "https://gusku.site/game/virefit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VireFit\", \"description\": \"Looking for information on VireFit? Check out the release date (Mar 25, 2019), developer insights from Daemon Cat, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Daemon Cat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daemon Cat\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1001390/header.jpg?t=1572340750\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}