{
    "AppID": 665040,
    "Name": "Visual Novel Engine",
    "Release date": "Jul 7, 2017",
    "About the game": "The 0m3ga Visual Novel Engine will play visual novels as well as let you create and share them with anyone. No programming experience or scripting language is required! A simple tagging system is used to make the engine as flexible as any other visual novel creator out there. Use Visual Novel Engine to spend less time on the mechanics of your visual novel and more time on writing it. Get your visual novel done fast with test-driven development. FEATURES Create and share your own visual novels! Easy to use drag and drop system that lets you create visual novels without any programming skills. Easy uploading to share and update your visual novels. Download and play visual novels that other people create! Simple list of FREE visual novels that are easy to download Play all your visual novels offline! Save states and load states for saving and loading your progress for each visual novel Multi-Platform / Cross-Platform! The entire engine runs exactly the same on all supported platforms (Windows, Mac, Linux, Android, iOS) All visual novels created on a platform will work on all other platforms seamlessly! Cloud States Save your progress to the cloud and load it on other devices you are logged in to (even mobile!) Export Your Game! Using the 'Export Your Game' DLC, you can export your entire visual novel to a standalone game for Windows / Mac / Linux with just one button Purchasing DLC will support the development of Visual Novel Engine! The standalone game can be shared/distributed by itself without the Visual Novel Engine for anyone to play VNE Translator Using the 'VNE Translator' DLC, you can allow your visual novel to be translated into other languages! Purchasing DLC will support the development of Visual Novel Engine! Using the Translator, you can also help translate other visual novels into a language using a voting system. QUANTIFY YOUR NOVEL Visualize and track your visual novel creation process! WANT A FEATURE ADDED? Simply start a thread or contact the admin directly to see about getting it added!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/665040/header.jpg?t=1540729208",
    "Price": 0.0,
    "Developers": "qberty",
    "Publishers": "The Local Group",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/665040/ss_a0b593fc08c7efbaf83ddddf980e3429a96f90cd.1920x1080.jpg?t=1540729208,https://cdn.akamai.steamstatic.com/steam/apps/665040/ss_e3bf1401c93d4bbbbfdd26fa830e7315a17d48b0.1920x1080.jpg?t=1540729208,https://cdn.akamai.steamstatic.com/steam/apps/665040/ss_ab62b906fd59b1382ae94906b57a3ca77e4379e4.1920x1080.jpg?t=1540729208,https://cdn.akamai.steamstatic.com/steam/apps/665040/ss_231d4d34b516f318ad8ad7d3ad05298d3e0acd43.1920x1080.jpg?t=1540729208,https://cdn.akamai.steamstatic.com/steam/apps/665040/ss_653b3dd02992174655bd4648601c3135edb340e9.1920x1080.jpg?t=1540729208",
    "Slug": "visual-novel-engine",
    "Meta Title": "Visual Novel Engine: Jul 7, 2017, qberty and Full Overview",
    "Meta Description": "Looking for information on Visual Novel Engine? Check out the release date (Jul 7, 2017), developer insights from qberty, and a complete game summary.",
    "Alt Text Image": "Official header image for Visual Novel Engine game - Steam 665040",
    "Canonical URL": "https://gusku.site/game/visual-novel-engine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Visual Novel Engine\", \"description\": \"Looking for information on Visual Novel Engine? Check out the release date (Jul 7, 2017), developer insights from qberty, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"qberty\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Local Group\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/665040/header.jpg?t=1540729208\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}