{
    "AppID": 1078550,
    "Name": "Voltron: Cubes of Olkarion",
    "Release date": "Aug 29, 2019",
    "About the game": "→ Update: Recent update contains Steam Achievements. Take control of the Cubes of Olkarion! Voltron: Cubes of Olkarion is an action-packed, one-on-one, real-time-strategy game where you take on the role of your favorite Paladin to battle AI or other players online. Choose your character and control a base on either side of the map. Then concentrate on building your tower from unique cubes as high and strong as you can. Pay attention to your tower arrangement as each cube has different attack or defense abilities. Some cubes launch projectiles, others are great for defense and even others can spawn units that fly over to attack the other side’s tower. Keep cool, think creatively Keep a cool head, think creatively and make quick decisions during battle, it only takes one mistake for your tower to crumble. Endless combinations The building blocks of Voltron: Cubes of Olkarion are the cubes with different abilities. You can use them in single instances, but also combine them in smart ways to multiply their impact on the opponent player. Build and use unique cubes Experiment with different cubes and their possible combinations with each other! Protect your base If you manage to hit your opponent’s base three times you win the battle. Just don’t let them do the same thing to you, or you will be blown straight to Wozblay! Explore infinite strategies There are infinite strategies to find and experiment with. Different battleground and opponents call for different approaches! Real-time multiplayer action Battle locally on a single screen or join an online multiplayer battle to find out who controls the Cubes of Olkarion the best! Choose different characters Play with a multitude of characters from the Voltron universe. Wondering who’s coming next? Check out our roadmap. Player achievements Unlock a range of achievements that are added to your Steam player profile. Winning game mechanics This game project started as an entry into the Universal GameDev Challenge in 2018. After being selected as the winner, NBCUniversal agreed to license the IP and Gbanga developed and published the Early Access version. NOTE: This Early Access version contains a single-player mode as well as both local and online multi-player.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1078550/header.jpg?t=1607593272",
    "Price": 9.99,
    "Developers": "Gbanga (Millform)",
    "Publishers": "Gbanga (Millform)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1078550/ss_e7cb166783f964808b150ed79294b91fd6f4ddd0.1920x1080.jpg?t=1607593272,https://cdn.akamai.steamstatic.com/steam/apps/1078550/ss_5a253dbf6d69a44b2946fe492883b50c12551927.1920x1080.jpg?t=1607593272,https://cdn.akamai.steamstatic.com/steam/apps/1078550/ss_dab4100e9bf8c56969a8a95304b571d83f1828f0.1920x1080.jpg?t=1607593272,https://cdn.akamai.steamstatic.com/steam/apps/1078550/ss_5dd717eba8d9487f861cfefacba01ae3541e4328.1920x1080.jpg?t=1607593272,https://cdn.akamai.steamstatic.com/steam/apps/1078550/ss_2547040d20d8aecc610334de7f386b306a1b802a.1920x1080.jpg?t=1607593272,https://cdn.akamai.steamstatic.com/steam/apps/1078550/ss_ba1148fbc5d26e83df65b7bbabc5dc9b722f666e.1920x1080.jpg?t=1607593272",
    "Slug": "voltron-cubes-of-olkarion",
    "Meta Title": "Voltron: Cubes of Olkarion: Aug 29, 2019, Gbanga (Millfor...",
    "Meta Description": "Looking for information on Voltron: Cubes of Olkarion? Check out the release date (Aug 29, 2019), developer insights from Gbanga (Millform), and a compl...",
    "Alt Text Image": "Official header image for Voltron: Cubes of Olkarion game - Steam 1078550",
    "Canonical URL": "https://gusku.site/game/voltron-cubes-of-olkarion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voltron: Cubes of Olkarion\", \"description\": \"Looking for information on Voltron: Cubes of Olkarion? Check out the release date (Aug 29, 2019), developer insights from Gbanga (Millform), and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gbanga (Millform)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gbanga (Millform)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1078550/header.jpg?t=1607593272\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}