{
    "AppID": 675480,
    "Name": "Witch Thief",
    "Release date": "Sep 20, 2018",
    "About the game": "Play as the snarky Witch Thief, on her quest to steal all the magic she possibly can! Naturally those who have the magic don't want to give it up so she does what she does best. That is, kicking in the front door and taking it all anyway! Dodge duck and weave through terrifyingly intricate patterns of magical projectiles as you seek the greatest treasure of all. The Ancient and powerful Grimoire! Features: Unique Bullet-Hell Perspective Unlike other Shmups, Witch Thief gives you control of a full 3D camera. Rather than the classic birds eye view, you will witness bullet hell from a whole new perspective! Dodge intricate bullet patterns Terrifyingly intricate storms of bullets will rain down as you journey on your quest. Study, learn and apply your dodging skills to outmaneuver the incoming perils. Touching even one bullet will kill you - so beware! Unlock a range of quirky playable characters Choose to play one of many Witches. Experience fresh new dialogue, different bosses and unique spells to achieve their goals. Each character has unique spells and dialogue, and may encounter different and challenging bosses on their path to the Grimoire. Musical tracks A fully original soundtrack, accompanying you on your perilous journey to the Grimoire. Each character and stage has a unique theme that captures and plays upon their essence. Battle Relentless Bosses Your path is not an easy one. Face insane bosses, wielding great magical power and unleashing torrents of complex bullet patterns. They will stop at nothing to protect the Grimoire. Unravel a world of mystery As you explore and overcome every stage of the game learning more about the world first from the perspective of the Witch Thief, but later as many other unlockable characters you will experience new perspectives of the story. Accessibility options Everyone should be able to have fun and play games. We’re always striving to help people play and include these features into Witch Thief to help out. If there are any features you’d like to see please shoot us an email and we’ll see what we can do! Rebindable keys: Nothing is worse than a control scheme that doesn’t work for you! Witch Thief’s controls can be rebound across keyboard, mouse and controller. Dyslexic font option: We love our stylized fonts, but we want you to know what’s going on. A dyslexic font option is available for all in-game text. Difficulty ranges: Not everyone wants the hardest difficulty. Witch Thief ranges from practically no combat “Chill” mode to the extreme “Insanity” mode which increases both bullet counts and speed. Oh you only get one life there too. Disclaimer: Bright Colours Flashing Lights Camera Shake If you encounter something in Witch Thief that you feel should be in this Disclaimer, please reach out! Check out Cardboard Keeps entire catalog of games for more amazing experiences!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/675480/header.jpg?t=1542150974",
    "Price": 19.99,
    "Developers": "Cardboard Keep",
    "Publishers": "Cardboard Keep",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_3283c06a12844cb861c2ab511ac9edda5dea6e15.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_a1374b2f5d057d06bca5602281c868e1a74bde52.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_29395bfd28753056a96d735af6bc9f3a88700ba7.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_e2c60a5c29267fd406ff262b95ee9693e11606b2.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_ae317efd232910b895dd9f25382fd6bb4ad8e734.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_e7b6c07fcf2b2fcf4e8cfab11bebe0ad8986340d.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_3efaed5dda5499cc94cfc1555a52e0e028dd0648.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_262ffed8bc37eda9e3ba190fba505bce370a1ddf.1920x1080.jpg?t=1542150974,https://cdn.akamai.steamstatic.com/steam/apps/675480/ss_4be5c1f60b6017a3e6bf588835c288d2d26cfc60.1920x1080.jpg?t=1542150974",
    "Slug": "witch-thief",
    "Meta Title": "Witch Thief: Sep 20, 2018, Cardboard Keep and Full Overview",
    "Meta Description": "Looking for information on Witch Thief? Check out the release date (Sep 20, 2018), developer insights from Cardboard Keep, and a complete game summary.",
    "Alt Text Image": "Official header image for Witch Thief game - Steam 675480",
    "Canonical URL": "https://gusku.site/game/witch-thief",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Witch Thief\", \"description\": \"Looking for information on Witch Thief? Check out the release date (Sep 20, 2018), developer insights from Cardboard Keep, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cardboard Keep\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cardboard Keep\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/675480/header.jpg?t=1542150974\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}