{
    "AppID": 327030,
    "Name": "Worms W.M.D",
    "Release date": "Aug 23, 2016",
    "About the game": "The worms are back in their most destructive game yet. With a gorgeous, hand-drawn 2D look, brand new weapons, the introduction of crafting, vehicles and buildings plus the return of some much-loved classic weapons and gameplay, Worms W.M.D is the best worms experience ever. Work your way through 30 campaign levels of increasing difficulty using the huge arsenal of new and classic weapons at your disposal. Use new vehicles to cause chaos amongst the enemy ranks and use buildings to gain the tactical advantage as you try to dominate the battlefield! Take on up to five opponents in hilarious all-out tactical worm warfare with up to eight worms each, either in local or online multiplayer, including ranked play. Flatten your opponents with the Concrete Donkey. Turn them into chunks of worm meat with the Holy Hand Grenade. Rain down hell from above in helicopters or pound them into oblivion with the tank. With 80 weapons and utilities at your fingertips, this is Worms at its chaotic best! Key Features Wonderfully 2D : The best implementation of the Worms formula yet, now with a brand new worm, and gorgeous digitally-painted 2D artwork. Vehicles : Worm warfare gets serious with the introduction of vehicles for the first time in the series. Dominate the landscape in warfare-ready tanks, take to the skies to unleash hell from from above in helicopters and more! Buildings : Keep your head down, and hide out in a building. Buildings provide a tactical advantage by hiding away your worms, and keeping them safe from direct attacks! Crafting : No more waiting around while your opponents take their turns! Grab the crafting crates that drop from the sky during games to make fiendishly upgraded versions of items such as the Electric Sheep, the Bazooka Pie and the Holy Mine Grenade to unleash on your enemies! Classic Worms Physics and Gameplay : Our brand new engine recreates the feel of the fan-favourite entrants in the series; and sees the reintroduction of the much loved Classic Ninja Rope! New and classic weapons : Over 80 weapons and utilities at your fingertips, including many returning classics and a slew of new additions such as the Dodgy Phone Battery, the Unwanted Present and the OMG strike. Mounted Guns : As if over 80 weapons and utilities wasn't already enough! A range of different gun types are placed around the landscape, allowing your warmongering worms to do even MORE damage! Hilarious single player plus online and local multiplayer warfare : Worms W.M.D comes locked and loaded with a huge arsenal of Training Missions, Campaign Missions and Challenges for the solo player. Train up then head online to create havoc in multiplayer modes including ranked play, with room for up to six players with eight worms each on a map!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/327030/header.jpg?t=1652272767",
    "Price": 5.99,
    "Developers": "Team17",
    "Publishers": "Team17",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_5021cda9e53161b5144edefd9242e4c84fc46800.1920x1080.jpg?t=1652272767,https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_1730312f4dc95e0ef7223f61c3caebeca4010fc9.1920x1080.jpg?t=1652272767,https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_3c49d2df239cef058ede59d9889342c90a065d96.1920x1080.jpg?t=1652272767,https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_6bd2321df7ca8c57613bc54d41045879fb3a0171.1920x1080.jpg?t=1652272767,https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_2d215a9692c9bc25db621e124ca0491c4c1c6183.1920x1080.jpg?t=1652272767,https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_fac3d7c247f1d1bbd80fb4d67657c4c325e31354.1920x1080.jpg?t=1652272767,https://cdn.akamai.steamstatic.com/steam/apps/327030/ss_a9181dbf7fc2a79394df08c2f3fbcb110ba8f0b6.1920x1080.jpg?t=1652272767",
    "Slug": "worms-w-m-d",
    "Meta Title": "Worms W.M.D: Aug 23, 2016, Team17 and Full Overview",
    "Meta Description": "Looking for information on Worms W.M.D? Check out the release date (Aug 23, 2016), developer insights from Team17, and a complete game summary.",
    "Alt Text Image": "Official header image for Worms W.M.D game - Steam 327030",
    "Canonical URL": "https://gusku.site/game/worms-w-m-d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Worms W.M.D\", \"description\": \"Looking for information on Worms W.M.D? Check out the release date (Aug 23, 2016), developer insights from Team17, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 23, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team17\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team17\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/327030/header.jpg?t=1652272767\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}