{
    "AppID": 1723420,
    "Name": "Zombie Hunter",
    "Release date": "Oct 4, 2021",
    "About the game": "Feel the action and survive this apocalypse horror in one of the best free zombie sniper shooting games. Enjoy this survival by being a zombie hunter and killing them in a challenging first person shooter (FPS) with 3D graphics. Zombies walk among us! You are one of the few survivors of a pandemic infection. The zombie apocalypse began after a scientist dropped a vial of virus in a secret laboratory. Despite military lockdown, in a few hours the zombie infection outbreak reached the outside and now the living dead are rising, hunting humans to feed themselves. As an elite marksman sniper you have experience in shooting range and you were trained in military strategy for chaos, action and survival war games. This could be your last day on Earth so escaping your shelter and turning into a Zombie Hunter is your only hope for survival in this zombie apocalypse. FPS survival gameplay: In this FPS game you need to choose the best sniper rifle, load bullets, pull the trigger to open fire and hunt down all the zombies in your way. Defend helpless victims in this zombies apocalypse by shooting undeads before they transform too! Stock up your sniper armory and be the best zombie hunter, choose and upgrade weapons from sniper rifles to crossbows, bazookas, shotguns, assault rifles, revolvers or machine guns. Play with your favorite weapons in this FPS zombie apocalypse survival game. Hunt and kill all kinds of zombies: weak crawling undead or strong super zombies that will test your sniper skills of observation, dexterity and marksmanship in this apocalypse shooting mission. Search from hidden spots, find zombies and kill the target before it’s too late! Features: · Kill zombies before time ends. · Upgrade your sniper rifle. · Shoot loot boxes with power ups. · Several missions of apocalypse survival action. · Survive in open apocalypse battlegrounds. · Different guns and weapons. · FPS (1st person shooter) survival game play. · Play offline. Enjoy a zombie apocalypse classic shooter game. FPS action, horror and survival mixed up in a sniper shooting game that will boost your adrenaline by being a zombie hunter. Survive to this zombie apocalypse. Reload your sniper rifle, practice your hunter skills and start shooting for survival. KILL ALL THE ZOMBIES IN YOUR WAY! Scenarios: Can you be the best Zombie Hunter in this Apocalypse? Improve your sniper / hunter skills in a FPS mode, fight in open places and different levels in this apocalypse survival to find out the horror story from Day Zero to 180. · Urban city: Jacksonville · Camping: Caravan of the Dead · Theme Park: Amusement zombie · Coast: Dead Port and Snow: Arctic Z. Survive every time shooting the best sniper rifle and prove your FPS shooter skills. Become a true zombie hunter and kill them all! Enjoy shooting zombies anywhere! One of the best FPS games. Download free Zombie Hunter game to play different missions in open battlegrounds. Zombie Hunter is an online or offline FPS game, you can even play it safe far from the apocalypse or a fallout in an underground bunker! Let the zombie apocalypse shooting begin!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1723420/header.jpg?t=1634197480",
    "Price": 0.0,
    "Developers": "1MB",
    "Publishers": "VIVA STUDIOS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1723420/ss_651443946dcea9acf1b98d53a71fc7495c8c0ef4.1920x1080.jpg?t=1634197480,https://cdn.akamai.steamstatic.com/steam/apps/1723420/ss_5f59c6f1168a492c7a9c6382bbce4e04fe0716eb.1920x1080.jpg?t=1634197480,https://cdn.akamai.steamstatic.com/steam/apps/1723420/ss_6ca685fed5c89c684e50b5b278d6e5f48a66059c.1920x1080.jpg?t=1634197480,https://cdn.akamai.steamstatic.com/steam/apps/1723420/ss_9a6c0d879aa07e0b3474834802ab00736a0a3b2d.1920x1080.jpg?t=1634197480,https://cdn.akamai.steamstatic.com/steam/apps/1723420/ss_0b455bad43bddf32d78c989f1502c70267aca4ad.1920x1080.jpg?t=1634197480",
    "Slug": "zombie-hunter",
    "Meta Title": "Zombie Hunter: Oct 4, 2021, 1MB and Full Overview",
    "Meta Description": "Looking for information on Zombie Hunter? Check out the release date (Oct 4, 2021), developer insights from 1MB, and a complete game summary.",
    "Alt Text Image": "Official header image for Zombie Hunter game - Steam 1723420",
    "Canonical URL": "https://gusku.site/game/zombie-hunter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie Hunter\", \"description\": \"Looking for information on Zombie Hunter? Check out the release date (Oct 4, 2021), developer insights from 1MB, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"1MB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VIVA STUDIOS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1723420/header.jpg?t=1634197480\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}