{
    "AppID": 1860930,
    "Name": "001 Earth",
    "Release date": "Mar 31, 2022",
    "About the game": "001 Earth is a sandbox adventure game where you collect resources, hunt animals, fight monsters, and do everything your heart desires. The game also tells the story of certain characters and the origin of the main character. General Mechanics Collect resources, research recipes, build tools, build buildings, roam biomes, hunt animals, fight monsters. Inventory management: you have to consider the size and weight of the items you carry. Recipe system: you need to learn recipes before you can craft them. Limb conditions: your limbs can be crippled so think through if you are ganna tank an attack. Basic needs: You have to take care of your hunger, thirst, stamina, energy, mana, and other attributes. Unique entities: They rarely spawn on biomes and they have higher attributes compared to normal entities Difficulty: Harmless: Overpowered entities barely spawn in the wild. Entities have a slower reaction time. You have a longer duration of hunger, thirst, stamina, mana, and energy. You build, craft, and break stuff much faster. Casual: Overpowered entities barely spawn in the wild Entities have a slower reaction time Hunger, thirst, stamina, mana, and energy drain at a normal rate. You build, craft, and break stuff at normal speed Impossible: Overpowered entities regularly spawn in the wild. Entities have a normal reaction time. Hunger, thirst, stamina, mana, and energy drain at a normal rate. You build, craft, and break stuff at normal speed. God Mode: Overpowered entities spawn more frequently in the wild. Entities have an instantaneous reaction time. Hunger, thirst, stamina, mana, and\\nenergy drains at a normal rate. You build, craft, and break stuff at normal speed. Modes Adventure Mode: Runic platform exists and you can use them to respawn after you turned into a ghost. You can cure crippled limbs naturally. Hardcore Mode: Runic platforms don't exists hence you cant respawn after you die (you can still roam the world as a ghost). Your world starts with a tent since runic platforms don't exist. Your crippled limbs don't heal naturally but you can still use artificial tools to replace your limbs Creative Mode: access all items in your inventory Fly ability Pass through walls Instant break objects Instant kill entities Invulnerability Biomes Grassland: where the player starts his journey Forest: High number of high-grade trees can be collected here but has a lot of dangerous animals Swamp: Low number of high-grade trees are on this biome but good for hunting small critters Mountain: Good for mining stones, metals, and other minerals. You can also find caves on this biome. Tundra: Cold temperature and almost unhabitable. This biome is good are for hunting animals with thick fur/hide Savanna: High number of prey animals but also home to dangerous animals Desert: Sand??? Realms: Astral Realm: land of the unknown, you can enter this realm after slaying the dragon.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1860930/header.jpg?t=1649579829",
    "Price": 4.99,
    "Developers": "CGNDC",
    "Publishers": "CGNDC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_b57bce0ee9b21f5357bceec57562056450145bf9.1920x1080.jpg?t=1649579829,https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_ad32b8135f5f94b40538c6d20272da7f4de23fa1.1920x1080.jpg?t=1649579829,https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_5877eb6bf761111ee4c54234dd8c7b21bd3d67c5.1920x1080.jpg?t=1649579829,https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_708146281d0c6e280fcfa7ad01f1f34e86f2a391.1920x1080.jpg?t=1649579829,https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_1970b436778cccb930abbce87edd001ed53f8dd1.1920x1080.jpg?t=1649579829,https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_c925f3822c8f8879224de61dd6cee91692b5ed5c.1920x1080.jpg?t=1649579829,https://cdn.akamai.steamstatic.com/steam/apps/1860930/ss_ff92fa007922dce14494382bad5eed4aa139db50.1920x1080.jpg?t=1649579829",
    "Slug": "001-earth",
    "Meta Title": "001 Earth: Mar 31, 2022, CGNDC and Full Overview",
    "Meta Description": "Looking for information on 001 Earth? Check out the release date (Mar 31, 2022), developer insights from CGNDC, and a complete game summary.",
    "Alt Text Image": "Official header image for 001 Earth game - Steam 1860930",
    "Canonical URL": "https://gusku.site/game/001-earth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"001 Earth\", \"description\": \"Looking for information on 001 Earth? Check out the release date (Mar 31, 2022), developer insights from CGNDC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CGNDC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CGNDC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1860930/header.jpg?t=1649579829\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}