{
    "AppID": 1621420,
    "Name": "After Shadows",
    "Release date": "Oct 21, 2021",
    "About the game": "Immerse yourself in the dark history of the distant future. After Shadows is a metroidvania with roguelike elements. You find yourself in a distant post-apocalyptic world, where is nothing left of the former civilization, except for unclear memories, and where humanity has been replaced by bizarre strange creatures. You play as Ana, the half-elf. Dark Monster descended on her village and infected Ana's mother. And now the main character will have to go to the ancient Fortress to find a cure. This Fortress is unexplored and full of dangers. It extends its way beyond the underground — into the terrible primeval darkness. And legend has it that in this darkness a brave adventurer can find both salvation and death. Game feature High complexity There is no room for the weak in the world of the distant future. Explore the Fortress carefully — death is waiting for you with every step. Do you want to run past that cute bird? You'll die. Did you accidently step on the branch? You'll also die. Character development Every death or victory doesn't pass without a trace for you. A large selection of curses and rewards diversify the gameplay. Replayability The darkness that lives in the Fortress wants to stop you and not let you get to the end. And so you will have to burnish the brain: each time of the game session the path changes - sometimes beyond recognition. Because the eternal night is dark and full of horrors. Dark, but attractive world Examine the strange monsters that inhabit the Fortress. Find those who will help you in your progress — whether it's Water Imp or an old metal robot. Just remember that not all creatures wish you well… Charming soundtrack It will be easier to immerse in the world of After Shadows because of the dark, but attractive music. The frightening, meditative, beautiful and enthralling tracks are waiting for you. Attractive graphics Every stone in the game, every creature, and every texture is created manually. After Shadows has an incredible attention to details. Different endings Choose your path, and get the ending you deserve. No playing along on the developers' part — the gameplay is designed so that it adapts to you, but not you to it. The intimacy of the story We are a small indie team, so we are limited in our capabilities. However, we made best efforts to make the game more interesting and significant for a long time. I hope you will be interested in it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1621420/header.jpg?t=1635753620",
    "Price": 14.99,
    "Developers": "Insidious Games",
    "Publishers": "Insidious Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_e6e2291d8663d0230fe8379451e8350c015563e2.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_b51bee451e621b3f8abfcfb03e1b3514ed1feae0.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_953bdb9b3f806fda291f9c1399593270a5e8beb4.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_c5fbaeba79858d34d463253098ac735f3746c07a.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_d84a853ce420743515280025866c57608b985953.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_7d5dae8f23433bfd21ae3c2c91471bd00615a517.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_249d48a2f4308791eb0bff339d1de56dc873b6ec.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_e4a08847576c06cc01372d57bb8c511c0826b670.1920x1080.jpg?t=1635753620,https://cdn.akamai.steamstatic.com/steam/apps/1621420/ss_02e9c161b4e739009ba1efad4dc1badda2612abc.1920x1080.jpg?t=1635753620",
    "Slug": "after-shadows",
    "Meta Title": "After Shadows: Oct 21, 2021, Insidious Games and Full Ove...",
    "Meta Description": "Looking for information on After Shadows? Check out the release date (Oct 21, 2021), developer insights from Insidious Games, and a complete game summary.",
    "Alt Text Image": "Official header image for After Shadows game - Steam 1621420",
    "Canonical URL": "https://gusku.site/game/after-shadows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"After Shadows\", \"description\": \"Looking for information on After Shadows? Check out the release date (Oct 21, 2021), developer insights from Insidious Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Insidious Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Insidious Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1621420/header.jpg?t=1635753620\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}