{
    "AppID": 1832050,
    "Name": "All Quiet Roads",
    "Release date": "Apr 11, 2022",
    "About the game": "Build roads between various neighborhoods. Congested roads turn amber and then red as traffic slows down. Build more roads. Add cloverleafs, ferries, bridges, and tunnels, getting all your vehicular traffic to where it needs to go. The game begins in London. At the commencement of each city there are only a few neighborhoods on the map. You get to decide where to place roads to connect the neighborhoods. Periodically, each neighborhood will spawn vehicles that need to travel to other neighborhoods. As you connect roads between unique neighborhoods the vehicles will transit along your roads to reach their destinations. Vehicles will remain parked in their original neighborhood until a route exists to their desired destination. Over time more neighborhoods will automatically appear on the map. Each neighborhood has an associated type of vehicle that it attracts. Vehicles spawning in other neighborhoods will seek the neighborhood of their destination type. You must add roads to keep the neighborhoods connected. Vehicles will use the roads autonomously when they are available. Roads that have too much traffic will slow down, and visually change to red when the traffic stops. Vehicles will try to route around traffic jams. It often makes sense for you to build multiple roadways so that vehicles can find their ways around traffic jams. Cloverleafs can be used to upgrade intersections. A clover leaf allows traffic on one road to pass over traffic on another road instead of getting stuck waiting for the intersection to become empty. Various other upgrades are useful as well. Cloverleaf -- reduces the congestion at an intersection. Bridge -- allows a road to cross over water. Tunnel -- allows a road to go through a hill. Ferry -- connects two remote shorelines along a shared waterway without the need for a bridge. A vehicle trip is completed when a vehicle reaches its desired destination. Each completed trip adds to your raw score. The raw score is the count of the number of vehicle trips completed. Additionally, your All Quiet Roads score ( AQR ) updates to your current raw score only if there are no roads currently in a red warning state . Your raw score will continue accumulating but it will not become an AQR score until the moment when no roads are red. Red roads can be noisy as motorists honk their horns. All the roads are all quiet only when no roads are red. When each city begins you have a limited number of roads, and maybe some bridges or other items as your initial inventory for that particular city. As your raw score increases you will be given additional inventory of roads. Sometimes you are given freeway pieces, which function just like roads but allow the traffic to move at a faster speed. Should you run out of inventory then you can erase that item from the map to reclaim inventory items. However, you will need to wait for any vehicles that plan to traverse the road before it is removed from the map. A progress bar keeps track of your raw score. The progress bar fills up, and then starts over again as the raw score increases. Each time that your progress bar fills up you are given a choice between a selection of upgrades. Choose wisely based on the needs of your city. You won't get another choice until you fill the progress bar again. While the raw score controls when you get additional inventory your real goal is to increase your AQR . The AQR is the raw score only when no roads are red. Three different achievements are possible in each city based on your AQR score. AQR 527 -- this is the minimum AQR necessary for each city's Quiet Roads achievement. If no road is in a red warning state and your raw score is at least 527 you will earn this achievement. AQR 527 is also the threshold for unlocking any following city that was locked when the game first began. AQR 1581 -- this is the mid level AQR for each city and unlock's the City Flourishes achievement. AQR 4743 -- this is the highest achievement for each city. Once you accomplish AQR 4743 for a city your AQR score for that city will be added to the leaderboard. Each time you replay a city is another chance for you to post a higher AQR score for that city. You can continue playing each city for as long as you like, or until a neighborhood runs out of parking lot space. Each neighborhood has a limit of how many vehicles can be waiting to leave the neighborhood. Vehicles will continue spawning even though other vehicles are waiting. When too many vehicles are waiting in a neighborhood it will turn amber, then red, and finally purple. Purple neighborhoods have maxed-out their parking lot space and cause the game to end. You can try again, but you'll have to start over from a zero score and a fresh city map. From time to time tow trucks are added to your inventory. You can use a tow truck to eliminate individual vehicles on roads. Each tow truck removes one vehicle. This can be handy to temporarily unstick traffic jams and momentarily quiet the roads. Vehicles that are removed by tow truck do not add to your raw score nor your AQR. If the next city was locked when your game began and you received the Quiet Roads achievement by having an AQR of at least 527 then you will have unlocked another city. Initially, only London is unlocked, and all other cities are locked. Here is the list of cities represented in All Quiet Roads : London -- Get on the leaderboard with the ' Domine Dirige Nos ' achievement. (Lord guide us.) New York -- The maximum achievement in New York is ' Excelsior! ' Paris -- If you achieve AQR 4743 in Paris then, très bien , you have received the ' Fluctuat Nec Mergitur ' achievement. (Rocked by the waves but does not sink.) Rio de Janeiro -- ' Recte Rem Publicam Gerere ' is your highest achievement. (Conduct the affairs of the public with righteousness.) Seattle -- The achievement ' City of Flowers ' puts you on Seattle's leaderboard. St Louis -- The ' Gateway to the West ' achievement is awarded for and AQR score of 4743. Sydney -- Completing this final city with AQR 4743 unlocks ' I take but I surrender .' All Quiet Roads is somewhat unique in allowing players to manage traffic on roads that turn red, just like realtime maps we use on real world roads. Red roads are dangerous, because as traffic backs up it will eventually cause neighborhoods to become jammed. When the neighborhood can no longer hold any more newly spawning vehicles the game is over.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1832050/header.jpg?t=1658183816",
    "Price": 9.99,
    "Developers": "Scheme Street",
    "Publishers": "Scheme Street, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_999d95de9b56c727f3198f042fb8bac2343563a5.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_8402b46cd8519260ea1677ed12bc13e9a29dbb4f.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_77a8f2ab8bac83ae38f7f967806af5b455545d11.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_7c143474a3656afd4cc704ca20feae46cf42497a.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_795756794f08543d0282189fd55ad18702fbaf1c.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_6759ebdf0033074337ff25697d99f10e6c0b0902.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_3071477fc5d48ef14fc2224d4dec6efec695c8cc.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_ea1ef17afd4410f9ee563a934c67e0dc4e8147a7.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_6398c771583c392693a7aba80691cbd1d0153909.1920x1080.jpg?t=1658183816,https://cdn.akamai.steamstatic.com/steam/apps/1832050/ss_fc98c2e8eee0721e75419b8fcff98acd5c4da9fa.1920x1080.jpg?t=1658183816",
    "Slug": "all-quiet-roads",
    "Meta Title": "All Quiet Roads: Apr 11, 2022, Scheme Street and Full Ove...",
    "Meta Description": "Looking for information on All Quiet Roads? Check out the release date (Apr 11, 2022), developer insights from Scheme Street, and a complete game summary.",
    "Alt Text Image": "Official header image for All Quiet Roads game - Steam 1832050",
    "Canonical URL": "https://gusku.site/game/all-quiet-roads",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"All Quiet Roads\", \"description\": \"Looking for information on All Quiet Roads? Check out the release date (Apr 11, 2022), developer insights from Scheme Street, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Scheme Street\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Scheme Street, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1832050/header.jpg?t=1658183816\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}