{
    "AppID": 1046400,
    "Name": "Astalon: Tears of the Earth",
    "Release date": "Jun 3, 2021",
    "About the game": "Story Three heroic explorers wander the post-apocalyptic desert on a mission to save their village from despair. They soon find a dark, twisted tower that has risen from the depths of the planet and seemingly holds the key to their survival. In order to ensure their victory, one of them has made a secret pact with the Titan of Death, Epimetheus, allowing them to reincarnate until they have accomplished their mission. But what fate lies in store for the heroes and their village? Death is Only the Beginning Astalon: Tears Of The Earth is an action-platformer set in a dying world where life is cruel, but death can be a stepping stone to victory! Use the unique skills and weapons of Arias the fighter, Kyuli the rogue, and Algus the wizard, to surmount the mysterious tower and find the answers to their survival. Slay terrible monsters, discover powerful artifacts, and solve fiendish puzzles, reaching new heights in the tower with the aid of a Titan. Follow a story about friendship and sacrifice, building up the courage to take down giants to protect the weak and powerless. Strengthen your party and change their fate by embracing death. Discover the countless secrets of the Tower of Serpents! Features Relive the glory days of 8-bit action-adventure through beautifully detailed, authentic pixel art set in a dark, fantastic world! Astalon features the progressive exploration of an interconnected world with the swiftness and quick rhythm of a room-by-room action platformer. Original character design by Ryusuke Mita, creator of world-famous manga Dragon Half! Play at your own pace -- explore thoroughly and build your characters strengths, or use risky methods to slice your way up the tower furiously! Switch between your heroes and utilize the unique abilities of a warrior, archer and wizard to progress through the game. Battle against a large assortment of different enemies, giant monsters, and epic bosses! Choose the right hero to find the weaknesses of the creatures that stand in your way! Upgrade your characters’ abilities and change the course of destiny by making deals with Epimetheus -- the Titan of Death. Collect a variety of incredible artifacts such as the “Sword of Mirrors” that will bestow your characters with new abilities and open new possibilities. Use campfires to save your progress, change characters, and discover details about the heroes’ pasts. Hundreds of rooms to discover -- hours of challenging exploration with a plethora of unlockables and secrets to reward the most inquisitive players! Experience an exciting soundtrack of chiptune music composed by Matt Kap, spanning over 30 pieces of music!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1046400/header.jpg?t=1652457633",
    "Price": 19.99,
    "Developers": "LABS Works",
    "Publishers": "DANGEN Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_e819e080c6e5eb50c53c6ee9c82309006008c2d7.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_8865a6a101a5a5102adfce211704ee367912945b.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_0ee8e322243b6ab8da464a3fc066aa64fd7b0beb.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_f59d7319c3b7e03e5a81434d36c270188849d646.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_f3fe4ded9d4f20165bf31110778f7b3f734eab0c.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_fe7ee835cb95bbbcdd00a0140a67346f979df795.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_5c22fca3d6c4eed267c328bf49afa40e190b829e.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_f1caf39e9c334089ec74035b6ffbafceff2c7884.1920x1080.jpg?t=1652457633,https://cdn.akamai.steamstatic.com/steam/apps/1046400/ss_4b11ac81a9edfdeb5a7e073cd49e24e3a574e477.1920x1080.jpg?t=1652457633",
    "Slug": "astalon-tears-of-the-earth",
    "Meta Title": "Astalon: Tears of the Earth: Jun 3, 2021, LABS Works and ...",
    "Meta Description": "Looking for information on Astalon: Tears of the Earth? Check out the release date (Jun 3, 2021), developer insights from LABS Works, and a complete gam...",
    "Alt Text Image": "Official header image for Astalon: Tears of the Earth game - Steam 1046400",
    "Canonical URL": "https://gusku.site/game/astalon-tears-of-the-earth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Astalon: Tears of the Earth\", \"description\": \"Looking for information on Astalon: Tears of the Earth? Check out the release date (Jun 3, 2021), developer insights from LABS Works, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"LABS Works\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DANGEN Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1046400/header.jpg?t=1652457633\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}