{
    "AppID": 1172460,
    "Name": "Aurum - Control Center Creator",
    "Release date": "Apr 23, 2021",
    "About the game": "Welcome to Aurum! Aurum is a powerful but comfortable 'custom OS flyout menu' designer. It's first of it's kind and slighly experimental. You can create your own overlaying panels, and combine OS commands and links as well as easily to reach widgets like a volume slider, to have a better and more seamless work and gaming experience. It shines when mapped to an extra mouse button, making it possible to reach all your settings and anything with one hand. Convenient creating Aurum makes modifications easy with a visual editor that offers simply dropping anything. While using images you can drop them directly from your browser. OS commands can be selected from a built in presets list. Simply drag and drop game shortcuts from any launcher to Aurum to add the game. Skinning Aurum uses hierarchical skinning, cascading colors and textures from the overlay, to layers and single elements. The same way you can also apply mouse over effects. Use If you want to have a better experience while gaming, an instant audio device switch, volume bar and custom search presets profile as well as links to the games main website's might enhance and ease up your PC experience. If you have a project or resources you often use together you can create a custom visual representation panel. With custom menus you might speed up and make the work you do more personalized and overviewable. FEATURES A visual drag and drop editor Overlaying windows with layers Widgets with settings and system controls, RSS, switch audio device, etc. Hierarchical skinning OS comannd presets to map to buttons Screen edge and hotkey triggers Animated slide-ins and button mouse effects A Build-in sharing library to rate and comment Module for binding global hotkeys to any command Extendable with Addons FAQ Aurum and gaming Aurum greatly improves the feeling while gaming with custom functions to control your PC settings etc. In background, it takes a minimum of your system resrouces, an impact on games was never found. The memory usage is at around 100MB with one overlay, mostly dependent on the images used. Note: For best experience, borderless-windowed game display mode is required. Does Aurum require Steam running? As from January 2022 Aurum also runs without Steam, for a week then you have to start Steam once to refresh. Extending Aurum addons to extend widgets and commands (like audio volume +15) can be easily created. The development is with WPF and C#. Aurum is a project to make handling your PC as struggle-free and customizable as possible. If you are interested visit the forums or get in touch!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1172460/header.jpg?t=1645776283",
    "Price": 9.99,
    "Developers": "Libor Turek",
    "Publishers": "Libor Turek",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_96c1aa56a8c2da3ea3298ddc60b75c2d2a22e355.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_034fbf9b25a1ad8af11fccbc1cea3020afd4f355.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_a276cdc11befd844b14e569bdc9190dddb10c3e4.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_e44bf86fba96c1c6e91ff32cc7a8b9c755ea8692.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_abf26d7663ec06a8fa9a248def701df692f7aa0b.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_337528aae397a3964e91282758471783f519135e.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_f086e519ad0c64c14e89d5e043c0d529ae784d53.1920x1080.jpg?t=1645776283,https://cdn.akamai.steamstatic.com/steam/apps/1172460/ss_b693d0b01b42bfc56052f56490e503e0a362596e.1920x1080.jpg?t=1645776283",
    "Slug": "aurum-control-center-creator",
    "Meta Title": "Aurum - Control Center Creator: Apr 23, 2021, Libor Turek...",
    "Meta Description": "Looking for information on Aurum - Control Center Creator? Check out the release date (Apr 23, 2021), developer insights from Libor Turek, and a complet...",
    "Alt Text Image": "Official header image for Aurum - Control Center Creator game - Steam 1172460",
    "Canonical URL": "https://gusku.site/game/aurum-control-center-creator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aurum - Control Center Creator\", \"description\": \"Looking for information on Aurum - Control Center Creator? Check out the release date (Apr 23, 2021), developer insights from Libor Turek, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Libor Turek\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Libor Turek\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1172460/header.jpg?t=1645776283\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}