{
    "AppID": 1755350,
    "Name": "BBQ Simulator: The Squad",
    "Release date": "May 25, 2022",
    "About the game": "BBQ Simulator allows you to experience what barbecue means with your friends and the game is doing that in very various messy ways just like flying meats. The game gives you a sandbox bbq experience by prepare your own grill and cooking steaks. You can play all the experiences with up to 8 friends in multiplayer mode or single player mode. If you want to have a relaxing barbecue experience, you can play some bbq scenarios in your garden. Or if you want make some serious job there, it doesnt matter either way the things going will be the crazy and most probably meats are start gonna fly. The players are hungry and the clock ticking. All players must be fed before they pass out from hunger. Here you have to work with your friends and cook enough for everyone. You can share tasks with your friends while making funny bbq sessions. While a friend takes care of prepare grill, cooking steaks, others can set the table for the dinner. Please be careful about the natural weather conditions just like rain or snow! Also the hostile flies will try to steal your meat and you have to defend your bbq! - The multiplayer co-op mode allows you to play in a team of up to 8 people to make crazy bbq sessions. There is no specific role requirement within the team, but you are completely free to choose task sharing. - You can totally customize your personal avatar, including male and female avatars, using an incredibly detailed customization system even face details. - Hostile flies will come to steal your meat and you must be prepared for them. - There are so many activities that can be done in the garden in the game. Including soccer ball, lawn mower. If you're the type who wants to hang out while someone else is doing a barbecue you are in right place. - If you seek the kitchen part, you can even find a microwave oven there. The method you choose to feed your friends before they pass out depends on your creativity. Of course, first make sure that the microwave is working and make sure it won't explode. - Meats and steaks are valuable. You have to cook and prepare them without wasting them. Environmental conditions may be hard some times. - Blowtorch and fire extinguisher can be used actively.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1755350/header.jpg?t=1653468038",
    "Price": 2.99,
    "Developers": "CubeCube Sports Ltd.",
    "Publishers": "CubeCube Sports Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_3ac960ed8afb96977456090f74dd5358fcc69ba5.1920x1080.jpg?t=1653468038,https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_fc73f56b69d641886e09b58407a46d52611c19f4.1920x1080.jpg?t=1653468038,https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_beaedba1e0bde4adf42f2053f6993cfebaee18a4.1920x1080.jpg?t=1653468038,https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_fc80a585846a4b3c470367426f0ae6534630eca5.1920x1080.jpg?t=1653468038,https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_4e0929cc2db55e6ec3601c8a36cc41a901a8aae0.1920x1080.jpg?t=1653468038,https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_b6f020958c747d6079cb995bd7c834dc492c2979.1920x1080.jpg?t=1653468038,https://cdn.akamai.steamstatic.com/steam/apps/1755350/ss_70faa553706b401fe5adae3c8b8bbec0b5cec125.1920x1080.jpg?t=1653468038",
    "Slug": "bbq-simulator-the-squad",
    "Meta Title": "BBQ Simulator: The Squad: May 25, 2022, CubeCube Sports L...",
    "Meta Description": "Looking for information on BBQ Simulator: The Squad? Check out the release date (May 25, 2022), developer insights from CubeCube Sports Ltd., and a comp...",
    "Alt Text Image": "Official header image for BBQ Simulator: The Squad game - Steam 1755350",
    "Canonical URL": "https://gusku.site/game/bbq-simulator-the-squad",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BBQ Simulator: The Squad\", \"description\": \"Looking for information on BBQ Simulator: The Squad? Check out the release date (May 25, 2022), developer insights from CubeCube Sports Ltd., and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CubeCube Sports Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CubeCube Sports Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1755350/header.jpg?t=1653468038\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}