{
    "AppID": 1081540,
    "Name": "Crazy Beat's Junction",
    "Release date": "Jun 28, 2019",
    "About the game": "Crazy Beat's Junction is Rhythm Action Game. Press buttons and move cars on the road to the goal. Make the best traffic control. System Press any button to move cars on the road. Notes flows across screen, beat them at the exect timing. Arrow keys manipulates gimmicks on the road. Be carefull to avoid car accidents ! You can select difficulty, Easy mode that you can play at your own pace, Full Throttle Mode that you can feel a fantastic thrill. Not only gamer but also game beginner can enjoy playing ! Feature 1 : Deviation If you press wrong button, you must do ad-lib, called 'Deviation'. Activate gimmicks on the junction, and pass all cars without car crashes! Feature 2 : Groove chance The red colored 'Groove Gauge' that indicated at bottom circle will increase when press button without notes. Groove Chance will start when the gauge filled! The player can beat notes in own rhythm. But monotonous rhythm cause end of Groove Chance. Feature 3 : Dance Hole Time In result of your jockey tricks, anybody rifted up and up... And nobody can't put up with dancing, even the city. Press buttons quick and correctly... Burn up all of your beats! Story Disk arrived in the Crazy Beat City as the new post of 'Junction Jockey'. Is she possible to recover 'Beats' of this city, losing past liveliness. Characters Disk The main character in this game. Transfered to Crazy Beat City (CBC) as a Junction Jockey (JJ). 23 years old, 3 years work as a JJ. She looks young. Active and unmannerly person, and self-willed. She always wears too big jacket, and hotpants. 'With such a sick beat, everyone gets sleepy even a runaway bank robber!' Builder A middle manager of JJ Department in CBC. Long time in CBC. Nobody knows about his JJ skill. He is direct supervisor of Disk and strict towards her, but in fact he is funny nice guy. Bald head and wears suit, and dark glasses. 'Will you pile up damage not only for your watering hole but also your assessment?' Rin Disk's old friend. A police officer, ex-JJ. She behaves mature naturally, but she is in fact her own person. She can't leave those in trouble alone. She care about Disk. 'It's a present for you ... I'll whip your butt !' Mayor The innovative mayor of CBC. Got the job by theoretical public commitment and performance that get a good response from citizon, for 2 years ago. She is hostile to Disk, but her strong determination to make CBC a wonderful city is serious. She is thick-headed, and sometimes go straight on wrong way. She seems think the fancy dress is the most suitable clothes for anywhere. 'You looks out of breath... Don't you go home for a cup of milk?' BB The young man who teaches know-how to work as Junction Jocky. 'Kitten' is his favorite line.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1081540/header.jpg?t=1568035225",
    "Price": 4.99,
    "Developers": "indie-du",
    "Publishers": "indie-du",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1081540/ss_3ee7e20363b1627218737a17915ab95050b266ad.1920x1080.jpg?t=1568035225,https://cdn.akamai.steamstatic.com/steam/apps/1081540/ss_e96402c731a9733bb1a94fbb812e7009efccc8d5.1920x1080.jpg?t=1568035225,https://cdn.akamai.steamstatic.com/steam/apps/1081540/ss_001421fbf0841405fe0ec62ce328426bdd0a893c.1920x1080.jpg?t=1568035225,https://cdn.akamai.steamstatic.com/steam/apps/1081540/ss_7251a32a38026e9ae08f8d602cf9a8f0b5565d56.1920x1080.jpg?t=1568035225,https://cdn.akamai.steamstatic.com/steam/apps/1081540/ss_8e473a14baf98dd12d0ac64a3bd5cf60b21f770d.1920x1080.jpg?t=1568035225",
    "Slug": "crazy-beat-s-junction",
    "Meta Title": "Crazy Beat's Junction: Jun 28, 2019, indie-du and Full Ov...",
    "Meta Description": "Looking for information on Crazy Beat's Junction? Check out the release date (Jun 28, 2019), developer insights from indie-du, and a complete game summary.",
    "Alt Text Image": "Official header image for Crazy Beat's Junction game - Steam 1081540",
    "Canonical URL": "https://gusku.site/game/crazy-beat-s-junction",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crazy Beat's Junction\", \"description\": \"Looking for information on Crazy Beat's Junction? Check out the release date (Jun 28, 2019), developer insights from indie-du, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"indie-du\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"indie-du\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1081540/header.jpg?t=1568035225\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}