{
    "AppID": 450950,
    "Name": "Danmaku Unlimited 3",
    "Release date": "Mar 9, 2017",
    "About the game": "What's it about Inspired by classic Japanese shooting games, Danmaku Unlimited 3 is a lovingly crafted medley of the best aspects of Japanese bullet hell games, all in a polished, accessible package. An old school shoot'em up? Why is it worth my time? Bullet hell style mechanics is having a kind of renaissance with its inclusion in many hit indie games. However if players want to explore more into the world of Bullet Hell a lot of traditional titles can be hard to understand in its mechanics or just plain too difficult to get into as a newcomer. Danmaku Unlimited 3 is designed to be intuitive and accessible to players unfamiliar with the genre, all the while without losing any of the intensity and flashiness that makes the genre so exciting to play. Okay, so how does the game do that? CORE A staple feature in Bullet Hells, only the very center of the player's craft, the core, is vulnerable to enemy fire. GRAZING Get the core close to bullets to just barely 'graze' it will power up the player's craft. Once fully charged it can unleash a powerful rampage that makes you feel like a total boss. SPIRIT/GRAZE SYSTEM Shooting down enemies turns their shots into harmless ghost bullets that the player can safely touch while also powering up the plane. All of this allows the game to be at a level of challenge that is manageable for a wide range of players without reducing the game into a bullet free turkey shoot. I'm good at bullet hell shooters, won't I just breeze though the game then? The game has two unique modes, GRAZE MODE features a differently tuned system (with conditions to trigger the ghost bullets) that offers a higher level of challenge comparable to the toughest traditional bullet hell titles. Is there a story? It is about a guardian, entrusted with Earth, rebelling against her overseers. Shakespeare it isn't, but you are here for the bullets and explosions right? How is the music? A Shmup is nothing without good music! Music is by BLANKFIELD from Japan, who does awesome remixes of Touhou and many other anime/game musics! Anything else? The campaign features 5 stages each ending with an epic multi-stage boss fight. Up to 25 weapon combinations for players to unlock and experiment to find what works best for them. Unique rendering technique that procedurally animate sprites on the fly. TATE support for players that use vertical screens. Or if you like to play lying down on your sides, I'm not going to tell you how to live your life. Okay I'm sold! (Or not, if so then thanks for making it down to here!) TLDR List Authentically crafted Japanese style shoot'em up in High Definition Intuitively designed to be an accessible gateway to the world of Bullet Hell 5 handcrafted stages packed with dynamically rendered sprites Epic multi-phase boss battles with spellbinding bullet patterns Up to 25 unique weapon combinations Turn enemy attacks into your advantage with the SPIRIT/GRAZE system Music by the talented Japanese indie circle BLANKFIELD Multiple modes of difficulty that caters to players of all skill ranges",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/450950/header.jpg?t=1569363262",
    "Price": 9.99,
    "Developers": "Doragon Entertainment",
    "Publishers": "Doragon Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/450950/ss_0e7d20e55d5b3a4abc3b1658899f72b84904228d.1920x1080.jpg?t=1569363262,https://cdn.akamai.steamstatic.com/steam/apps/450950/ss_a335b42bad266f74d8a4cc993cb30c51c21cb28f.1920x1080.jpg?t=1569363262,https://cdn.akamai.steamstatic.com/steam/apps/450950/ss_1a2039deb55ff6f1489dcf240b9b611ddb20ef8c.1920x1080.jpg?t=1569363262,https://cdn.akamai.steamstatic.com/steam/apps/450950/ss_e3eeb3ce329df259f5206ceedca59ae3ca1874f2.1920x1080.jpg?t=1569363262,https://cdn.akamai.steamstatic.com/steam/apps/450950/ss_3705ceb6b626a254c13721cfa0cb436e7c76b8d8.1920x1080.jpg?t=1569363262,https://cdn.akamai.steamstatic.com/steam/apps/450950/ss_54bde363fdd7dcb0e969efe852e21430b53e8e6a.1920x1080.jpg?t=1569363262",
    "Slug": "danmaku-unlimited-3",
    "Meta Title": "Danmaku Unlimited 3: Mar 9, 2017, Doragon Entertainment a...",
    "Meta Description": "Looking for information on Danmaku Unlimited 3? Check out the release date (Mar 9, 2017), developer insights from Doragon Entertainment, and a complete ...",
    "Alt Text Image": "Official header image for Danmaku Unlimited 3 game - Steam 450950",
    "Canonical URL": "https://gusku.site/game/danmaku-unlimited-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Danmaku Unlimited 3\", \"description\": \"Looking for information on Danmaku Unlimited 3? Check out the release date (Mar 9, 2017), developer insights from Doragon Entertainment, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Doragon Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Doragon Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/450950/header.jpg?t=1569363262\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}