{
    "AppID": 1037460,
    "Name": "DEEP 8",
    "Release date": "Jun 17, 2022",
    "About the game": "You can start by playing the free demo (3-4 hours) and if you like it buy the game and transfer your save file. Features 25-30 hours of playtime classic sideview turn-based battle system with a focus on tactics and a modern twist complex skill system high quality artworks rendered in Blender jumping-system with timing, grab and flip-funktion individual gameplay mechanics for every area experimental soundtrack traveling inbetween planets panty looting (yes, you actually collect panties, there is a deeper meaning tho xD) tons of secrets, easter eggs, cameos and sidequests cinematic cutscenes Superbosses Easy Mode Please look at the website for a presskit. Battle System Damage Trigger A central mechanic is what I call the Damage Trigger. You will know a similar mechanic from other RPGs. When you choose to do a normal attack, a bar pops up and you will have to press enter at the right time and hopefully land a bull's eye (maximum damage)! The speed of the trigger depends on the difference of yours and the enemies speed stat. Pressing at the wrong spot or not pressing at all will result in a miss. Don't worry: The mechanic is not all over the system (like in Shadow Hearts for instance) so it still feels dynamic and fluent. And it has some rather less obvious implications: For instance, if a character is confused, he can be cured with a physical hit. And with the Damage Trigger you can sort of manage the damage output and thus – if you do it right - cure the character with a minimum of damage. Modsystem The most important part of battles and maybe one of the more innovative systems of the game is the Modsystem. I've noticed people having a hard time, wrapping their head around that, but I hope I can make this clear. Otherwise don't hesitate to ask in the comments! Mods (modifications) are like weapons, armor and accessoires. Means, there are 3 different types and you can euip one of each type at a time. But then there are 2 big differences: 1. You can change the equipped mods at any time in battle. 2. All mods are useful throughout the the whole game. They are not like weapons that you sell or throw away after you used them in one dungeon. You start easy. Since you only got few mods at the beginning, it's not too complicated. For instance you will have to adept to certain statuses enemies have like 'Flying'. So it's a good idea to learn 'Long-distance attack'. Over time it'll get more complex and interesting interdependencies between the different mods and even characters emerge. Across all characters there are around 80 Mods to choose from! Another interesting one is ' Blitzblow '. It costs some MP but in exchange there is no Damage Trigger and you hit the enemy with regular damage. Useful, if an enemy is super fast and you can't seem to hit them. Also with Blitzblow your normal attack becomes bolt-elemental and you deal double damage to water enemies and those affected by the status wet. Now let's take a look at an interesting combination consisting of all 3 types and a mod of a second character:Ramirez equips: Long-distance attack, Counterattack and DoubleslashChloe equips: Dark Companion Ramirez can now defend and wait till he's hit by a physical attack from a flying enemy. This will result in triggering the Counterattack with 2 hits (Doubleslash). Additionally Dark Companion adds more damage and the dark element to every hit. Very strong for instance against the earth elemental WienerWorm. :D Summons Chloe is the only character who can use summons. They actually also play a roll in her personal backstory. In battle they can use either a big attack that is of course quite MP intense or something called a groupmod. Not much more explanation needed I guess, since groupmods affect the whole party. One for instance enables every character to inflict a status with a normal attack. Another one increases the bull's eye damage significantly. Balancing My philosophy is, that you should be able to make it through most of the battles without grinding much. I don't want to force the player to grind but I do try to encourage them to play wisely and use mods efficiently in order to succeed. It's hard to be objective about this tho. The enemies are designed in a way that they are quite demanding, if you first encounter them. Also every single enemy or group has a certain mechanic that, if you don't watch out, will wipe you out or at least get you in serious trouble. Yet, if you rather like being on the safe side you can fight a few extra battles and will have a bit of an easier time. That surely is possible, but only to a certain extend because after you pass a certain level, expierience will get reduced gradually. Life in dangerous areas is difficult sometimes because you need to watch your resources . But over the time you can make it easier by learning certain skills. For instance 'Hunting' that will result in healing a certain amount of HP after every battle. Also consider the fact, that every level up heals your HP by 50% and unconscious characters get revived automatically and they still get EP! :D I hope this gives you an idea. Story The planets of the DEEP 8 universe are populated by different races like for example the mighty, aggressive Droons, the furry Dominators, also called Summoners and the normally peace loving Dayigons, which are also the race, our protagonist Ramirez belongs to. Ramirez might be the shyest individual, you could ever encounter and he is also bothered by all these thoughts about women. He cannot help thinking about that but when it happens he always forces himself to stop, for some reason. Aside from being a socially awkward boy, he’s a respectable fighter and reliable employee. His female partner Meling however is not a very pleasant companion. She barely talks to him and when she does, she usually does it in an insulting or humiliating manner, which works counteractive to raising his confidence. Meling has long beautiful black hair, soft pale skin and a nice bosom. That at least is what Ramirez is thinking at some moments before prohibiting himself to do so. Aside from being a real fury, Meling wields a gigantic axe in battle, which enables her to crush any enemy she encounters. Ramirez and Meling work for the emperor Vagnus from Antia, which is a big city on planet Lisarya, mostly populated by Dayigons. For some weeks now, the people have been very anxious, because they seem to face an enormous threat. They even have to fear the extinction of their race. The Droons, always known for martial behaviour seem to have set their mind to committing genocide on the Dayigons. They use a weapon called Pluz-Cannon to vaporize several planets and raid others with ground forces. Now they are planning on destroying Lisarya with one big bang as well, but they ran out of the rare mineral Pluz, which fuels their cannon. As soon as they find a new source for it, they will fill their cannon with it and blow up Lisarya within an instant. Millions of Dayigons would turn to dust in seconds. The Dayigons are a race of lower technological standards and they are facing a superior power. But no matter how hopeless the situation might be, they can not give in. They try to think of some kind of defence plan against the Droons. For that purpose the unlikely duo Ramirez and Meling are sent to an abandoned base of the Droons, where they are searching for weapons and other useful stuff. With constant tension between them, many awkward situations and in danger of being extinguished at any given second, the story begins.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1037460/header.jpg?t=1658937508",
    "Price": 17.99,
    "Developers": "IndependentArt",
    "Publishers": "IndependentArt",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_80ea62f3b931aa1b0e4724f44129e04fb9d598d6.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_f818d9f13750ed057d9dce90395253c4c08c6e6e.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_c6682048bcb14dbdfd6a26041bcb20a0955bdcc7.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_75f3e5cc257d5edf54ad734c4f74c97b47520713.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_9d4b721eb8c7f119e179859e307e65d4454781a2.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_538a174dc4583ec0b58167031a318ad246aea0e9.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_ba5031ad86fc340119436a634cd6e6331beafdfa.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_f3fece51618b5aea6b70ac96931925fa4c174624.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_1a89e60ca430d80dc492845b6aa446140d38f60c.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_911d2004c19e07deb3ca9ce9922f6ddf8d9ab0d6.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_f7459a2fdba81a5152bff3334920e1c2e65b828a.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_26de2b3c8f373f80b43c8cc6e131e20f7324ee38.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_32381b9a6097ab053cae8690145bb7f9477555f5.1920x1080.jpg?t=1658937508,https://cdn.akamai.steamstatic.com/steam/apps/1037460/ss_dc05d0b4633c3bd150efc7aa841432557e1994bd.1920x1080.jpg?t=1658937508",
    "Slug": "deep-8",
    "Meta Title": "DEEP 8: Jun 17, 2022, IndependentArt and Full Overview",
    "Meta Description": "Looking for information on DEEP 8? Check out the release date (Jun 17, 2022), developer insights from IndependentArt, and a complete game summary.",
    "Alt Text Image": "Official header image for DEEP 8 game - Steam 1037460",
    "Canonical URL": "https://gusku.site/game/deep-8",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DEEP 8\", \"description\": \"Looking for information on DEEP 8? Check out the release date (Jun 17, 2022), developer insights from IndependentArt, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"IndependentArt\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IndependentArt\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1037460/header.jpg?t=1658937508\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}