{
    "AppID": 723890,
    "Name": "Don't Make Love",
    "Release date": "Oct 26, 2017",
    "About the game": "Will you make love and risk death? Assume the role of a praying mantis in a relationship dilemma. Torn between their mutual love and the instinct to have sex – which could lead to the male mantis’s death – the couple is now on the verge of making a decision. Try to keep their relationship in balance by typing anything you want in response to your partner during this life-changing conversation. Do your best to convey your feelings in a situation without satisfying solution. Feature list Type your responses without any restrictions and watch the conversation unfold A lively character that reacts to you in a meaningful way Play as either male or female Multiple endings and nonlinear playthroughs Hand-drawn art style with a cinematic feel Dynamic soundtrack that changes according to your partner’s mood Games/Media that inspired us: Emily is Away Façade The Green Porno Series A Lover's Discourse: Fragments FAQ Can I really type anything ? Yes, you can, but the interaction depends on what you type. This game puts you in a specific situation: a conversation about a relationship in stalemate. If you don’t take on that role, the game will ignore most of what you type. If you try to “stick to the script” you’ll notice how the game can understand you and respond appropriately. One playthrough is pretty short. Why shouldn’t I get a refund after I finish it? How many times have you put a lot of effort into something but that effort wasn’t acknowledged? It’s often difficult to understand how much time and money goes into what we experience as entertainment, but we’re sure you can see where we’re coming from. That’s why we hope you’ll consider this a fair price for the kind of experience “Don’t Make Love” is. Why is the game only available in English? We would love to cover as many languages as possible but converting the system to support more languages would be a tremendous amount of work. Since we are only three people, it would be too much for us to take on. If the game proves successful, we’ll consider this possibility.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/723890/header.jpg?t=1628852295",
    "Price": 0.0,
    "Developers": "Maggese",
    "Publishers": "Maggese",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/723890/ss_7f7fc20137b0939674fb2b619c136398ad16940d.1920x1080.jpg?t=1628852295,https://cdn.akamai.steamstatic.com/steam/apps/723890/ss_110d677b5ce299948c0dbf0ee3abe4e4c2e1a886.1920x1080.jpg?t=1628852295,https://cdn.akamai.steamstatic.com/steam/apps/723890/ss_5e8c7f5b064e22d74284841ee78cacdfc491856f.1920x1080.jpg?t=1628852295,https://cdn.akamai.steamstatic.com/steam/apps/723890/ss_de6df98bc784ee41510315b670fd20a957db52eb.1920x1080.jpg?t=1628852295,https://cdn.akamai.steamstatic.com/steam/apps/723890/ss_a3ebed0d671abe6aaa643e9c07b393b6e505a907.1920x1080.jpg?t=1628852295",
    "Slug": "don-t-make-love",
    "Meta Title": "Don't Make Love: Oct 26, 2017, Maggese and Full Overview",
    "Meta Description": "Looking for information on Don't Make Love? Check out the release date (Oct 26, 2017), developer insights from Maggese, and a complete game summary.",
    "Alt Text Image": "Official header image for Don't Make Love game - Steam 723890",
    "Canonical URL": "https://gusku.site/game/don-t-make-love",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Don't Make Love\", \"description\": \"Looking for information on Don't Make Love? Check out the release date (Oct 26, 2017), developer insights from Maggese, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maggese\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Maggese\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/723890/header.jpg?t=1628852295\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}