{
    "AppID": 1002300,
    "Name": "Fear & Hunger",
    "Release date": "Jan 21, 2019",
    "About the game": "Fear &amp; Hunger is a horror dungeon crawler set in the dark and hopeless dungeons of fear and hunger. Four misfortuned adventurers dwell deeper and deeper to the darkness and uncover the secrets this ancient fortress holds inside. The fortress works as an ancient nexus for different planes of existence. The depths are in an eternal turmoil as both old and new gods struggle for power, it’s up to the players to choose their position and stance in all of this. The game is a hybrid of survival horror and dungeon crawler genres with its influences ranging from Silent Hill to Nethack. There are roguelike elements to the game as well as a heavy foundation of a j-RPG. Fear &amp; Hunger is heavy on atmosphere and ruthless in its difficulty. Oppressive and relentless atmosphere 4 different character classes and many additional characters to recruit Unforgiving and unique gameplay Randomized elements to keep the game fresh with subsequent playthroughs Turn-based Strategic Dismember Combat System Graphical art style mixing pixel art with digital painting Original ambient soundtrack creating the dreary mood The world of Fear &amp; Hunger is VERY dark. THE GAME IS MEANT ONLY FOR MATURE AUDIENCES! Extreme violence and gore are everyday sights in the dungeons and death is one of the easier ways to go in the game. The game has drug and substance abuse, heavy themes ranging from self-mutilation to sexual violence. None of the themes are taken lightly however. They are all part of the world building and there to create the unique atmosphere where the game measures just how far the player is willing to go in order to survive. Parts of the dungeon layout, events, loot and enemy placements are randomized with few different variations to keep things fresh with subsequent playthroughs. The game is designed with the classic trial and error formula, so you can expect to start the game over and over again. But as long as you learn from your mistakes, you can quickly find yourself at the deeper levels of the dungeon. The combat in Fear &amp; Hunger is turn-based akin to classic role-playing games, but with a twist of it’s own. You can target individual limbs of your enemies to dismember them strategically and thus maximize your chances for survival. However, just the same, enemies can also cut off the arms and the legs of your playable characters if you are not careful. You need to prepare well for every encounter if you wish to stay alive. But don’t forget that running away from threats is often the best solution as well. There are many ways for survival in Fear &amp; Hunger - You can find better equipment, learn different blood and love magic, fuse characters into each other, pray different gods, talk your way out of battles, meet new party members, snipe enemies from distance, use traps to disable them… and so on. The Idea is to use what you got at your disposal and be creative with it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1002300/header.jpg?t=1621853752",
    "Price": 7.99,
    "Developers": "Miro Haverinen",
    "Publishers": "Happy Paintings",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_0566ab26ad33199d08582348f71dd28e7829a4d2.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_49a50b70721906bb4c121a04c90e4c988eda0565.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_9041c1f10d8619f70eebe4701f7682a8477f647e.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_6cbd8b3cc4ea528adc2d4bb09a491cdff03264a2.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_673b04dcbc3f1eb26e3ae8f0aae5520df03f9adf.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_88f12088ab84eda20d23a0064bdd0dc6384a5eda.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_4be0d95e20b6c81b61a72fa9e20842d4ae3ed062.1920x1080.jpg?t=1621853752,https://cdn.akamai.steamstatic.com/steam/apps/1002300/ss_8a8b5fdefd3acefbc6c605b0e5bbc05f4fe4adc0.1920x1080.jpg?t=1621853752",
    "Slug": "fear-hunger",
    "Meta Title": "Fear & Hunger: Jan 21, 2019, Miro Haverinen and Full Over...",
    "Meta Description": "Looking for information on Fear & Hunger? Check out the release date (Jan 21, 2019), developer insights from Miro Haverinen, and a complete game summary.",
    "Alt Text Image": "Official header image for Fear & Hunger game - Steam 1002300",
    "Canonical URL": "https://gusku.site/game/fear-hunger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fear & Hunger\", \"description\": \"Looking for information on Fear & Hunger? Check out the release date (Jan 21, 2019), developer insights from Miro Haverinen, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Miro Haverinen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Happy Paintings\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1002300/header.jpg?t=1621853752\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}