{
    "AppID": 1212860,
    "Name": "Flirt Balls",
    "Release date": "Jan 9, 2020",
    "About the game": "Customized Flirt Psychology Report Get to know the Flirt in you! This game will generate your customized Flirt Psychology report for you based on your choicest flirt moods in your gameplay. The report keeps changing as your Flirt Moods change and you continue playing. Only one of a kind casual game on Steam. Flirt Balls is a full featured Arcade and Strategy game yet seriously Ultra Casual. Single Touch Controls....Fun to play....Hard to master... Your goal is to click and hold to start a fling with the heart which starts beating for you when you come near to it. You loop around the heart by holding and lift and leave at the right time to leave one heart and move in the direction of another. Challenges Flirt in the specifically listed Moods for as many number of times as mentioned under each mood. Become the Invincible Grand Master of the Art of Flirting. Time Trial This is only for the Grand-Master flirts who can race against time. Your every move and every fling should be perfect for you to survive in this unforgiving mode of flirt perfection. You snooze you loose. Endless Climb the leadership board and become the ultimate best Flirt on the planet. Fever Modes If the player completes three consecutive perfect flings, it takes him/her into fever mode. Fever mode keeps getting better 6 perfect consecutive flings, 9 perfect consecutive flings and so on. What Is A Perfect Fling? When you quickly move ahead from the current heart after making a single loop and doesn't spend time looping around the same heart more than once. Collectables On your journey of flirting, you will find some gifts placed around some hearts. If you collect them the gift unlock and its association with people and events will bring their memories back. You can find the details of those events and objects under Collectables section on the main screen. Badass Power You can break a heart by activating Badass power by pressing 'Space'. You can use Badass power only 3 time in a session. Flirt Moods Perfect Fling Loop around a heart once completely but move on before the second loop completes. (Plain Vanilla) Amateur Fling Loop around a heart 2 times or more on the same connection. You loose your fever mode every time you get into this fling. (Turned into an Affair) Loop Infinity Loop around two hearts such that two loops touch or intersect each other. (Two-Timing) Close Call Closest you can swing a heart without crashing or looping around it. (Risky &amp; Rewarding) Close Connect Closest you can loop around a heart without crashing into it. Its going to be fast, so beware of looping around twice. (Beware of Affair) Stylish and Artisanal Connect with 4 heart in a row but each move ahead without completing the loop. (Flirt Art on Display) Attention grabber Idly pass by 4 hearts without connecting or bumping into them. (Vanity Fair) Three Perfect Flings Loop around three hearts completely but move on before the second loop completes. (The Perfectionist) Six Perfect Flings Loop around six hearts completely but move on before the second loop completes. (The Invincible) Nine Perfect Flings Loop around nine hearts completely but move on before the second loop completes. (The Impossible) Fling With Benefits Loop around a heart in such a way that you collect all the coins around it. (Best of both the worlds) Off-limits Loop around a heart such that you go outside the boundary and come back. You need to be connected to the heart to break and go past the wall otherwise you crash. (Foreign Affairs) Heart Breaker You can collect Badass Power on your flirting journey and break a heart when your Badass power is active and you collide with it head-on. You can also break heart by activating Badass power by pressing space. (Fling Misadventure) Love Sick Loop 5 times around a heart to break another heart closest to you.As you continue to loop around closest heart it starts cracking 17 Players to Unlock 160 Gifts to collect 50 Steam Achievements Continue to Make and Break Records. Become the Flirt Balls Champion Of the World. Enjoy !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1212860/header.jpg?t=1588749097",
    "Price": 0.99,
    "Developers": "Enaayah Software Development and Services Private Limited",
    "Publishers": "Enaayah Software Development and Services Private Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1212860/ss_37c93976eaa57e4f0ed607af813ce094f7c8f534.1920x1080.jpg?t=1588749097,https://cdn.akamai.steamstatic.com/steam/apps/1212860/ss_59a7560a48c15f77948e67557d725ea5ddf8840b.1920x1080.jpg?t=1588749097,https://cdn.akamai.steamstatic.com/steam/apps/1212860/ss_8c9b4d2c1d8fd35d903879474e7ed02077ba84a6.1920x1080.jpg?t=1588749097,https://cdn.akamai.steamstatic.com/steam/apps/1212860/ss_43247029841f8d54626cd0bb76584310dde70da8.1920x1080.jpg?t=1588749097,https://cdn.akamai.steamstatic.com/steam/apps/1212860/ss_030fc32e6d02994b05765cf89eebb4823c13206e.1920x1080.jpg?t=1588749097",
    "Slug": "flirt-balls",
    "Meta Title": "Flirt Balls: Jan 9, 2020, Enaayah Software Development an...",
    "Meta Description": "Looking for information on Flirt Balls? Check out the release date (Jan 9, 2020), developer insights from Enaayah Software Development and Services Priv...",
    "Alt Text Image": "Official header image for Flirt Balls game - Steam 1212860",
    "Canonical URL": "https://gusku.site/game/flirt-balls",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flirt Balls\", \"description\": \"Looking for information on Flirt Balls? Check out the release date (Jan 9, 2020), developer insights from Enaayah Software Development and Services Priv...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enaayah Software Development and Services Private Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Enaayah Software Development and Services Private Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1212860/header.jpg?t=1588749097\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}