{
    "AppID": 1101980,
    "Name": "白石洲往事",
    "Release date": "Jul 18, 2019",
    "About the game": "A small and medium-sized open world independent game based on Simulation and plot Q: Is the game an open world game? A: The game is played in full view 3D mode, but it is not an open world of a huge map, but a compact map; There is really only one street in Baishizhou (the geographical knowledge of Baishizhou is explained below); Although Baishizhou is a small place, there are many kinds of shops, everything, and the population density is very high. There are 150000 people living in it! It is in these places that the game unfolds its story Q: Why is the game place Baishizhou A: First, the game author has lived here for more than two years and is very familiar with this place. Second, considering the production cost, it is impossible for individual production to make huge maps like a large team; As for the old reform of Baishizhou, the author approved the project and made it. Someone told me that he knew about the old reform, which is not mentioned in the game at present; Q: Is the game a job simulator? A: There are simulation games in the game, and working is only one part of them. There will be more simulation games in the follow-up update, such as disco (to be launched soon) and hospital (follow-up version). These places can also consume in addition to working. Of course, the current version has no other consumption except diet, but the free update to be launched soon will have other consumption modes Time setting: around 2000 - now Location: Baishizhou, a famous village in Shenzhen, China; Located in Nanshan District, Shenzhen, between the window of the world and the science and Technology Park, it is divided into upper Baishi and lower Baishi by Shennan Avenue; The place set by the game is Xiabaishi. The real Xiabaishi is only one street. Although Baishizhou is small, there are all kinds of shops, with a very high population density. There are 150000 people living in it! The location of the game is the street from Shizhou middle road in Baishizhou to Meilu Jinyuan to Chengzhong Village. Any migrant worker who goes to Shenzhen almost starts from a place like this more or less and starts the dream journey of urban life; As a player, you play the scene of just coming to Baishizhou, a village in the city, and you will start your life and story from this humble rental house. Open world, multiple plots, especially suitable for trying things you dare not do; In the game, you can do many things, such as working, delivering takeout, shopping, packing, renting and buying a house, and so on. You can also trigger all kinds of plots to achieve all kinds of unexpected achievements, or degenerate into not knowing yourself, or sit and eat all day long; In short, this is an open world of simulation + plot.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1101980/header.jpg?t=1657355228",
    "Price": 6.99,
    "Developers": "DRILL Games",
    "Publishers": "DRILL Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1101980/ss_f9092eb8ae193cc511076d0de4ec6f03270cde58.1920x1080.jpg?t=1657355228,https://cdn.akamai.steamstatic.com/steam/apps/1101980/ss_6754cad765aabc6b28d8f7f24d84b44f251688fc.1920x1080.jpg?t=1657355228,https://cdn.akamai.steamstatic.com/steam/apps/1101980/ss_9ae93381098d4d25c567e6df6bc599a113c6550a.1920x1080.jpg?t=1657355228,https://cdn.akamai.steamstatic.com/steam/apps/1101980/ss_b549c19a24fbd9513f8a33758117ad0546614c9e.1920x1080.jpg?t=1657355228,https://cdn.akamai.steamstatic.com/steam/apps/1101980/ss_1410102b2456b8f9a2cd30c2e5b2d759f8f804ce.1920x1080.jpg?t=1657355228",
    "Slug": "",
    "Meta Title": "白石洲往事: Jul 18, 2019, DRILL Games and Full Overview",
    "Meta Description": "Looking for information on 白石洲往事? Check out the release date (Jul 18, 2019), developer insights from DRILL Games, and a complete game summary.",
    "Alt Text Image": "Official header image for 白石洲往事 game - Steam 1101980",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u767d\\u77f3\\u6d32\\u5f80\\u4e8b\", \"description\": \"Looking for information on \\u767d\\u77f3\\u6d32\\u5f80\\u4e8b? Check out the release date (Jul 18, 2019), developer insights from DRILL Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"DRILL Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DRILL Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1101980/header.jpg?t=1657355228\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}