{
    "AppID": 1043260,
    "Name": "Gladiator Guild Manager",
    "Release date": "Oct 13, 2021",
    "About the game": "Form a guild, hire your first gladiators and begin your adventure in this epic fantasy world. Compete in Arena Championships Choose gladiators to enter each fight, position them and instruct their behavior. The deadly battle will play out on its own, showing you the results of your strategy. Beware of your enemy, keep a keen eye on their moves, and figure out how to counter them. Your main goal is to win monthly championships, rise through the ranks, and conquer more and more challenging arenas. Grow Your Guild and Team As you progress you’ll expand your guild, allowing you to hire various new types of gladiators ranging from warriors, rangers, and beasts to mages, creatures, and all in between. Letting you form unique teams. Each gladiator comes with different quirks, either making them very good at something, but expensive, or very bad, yet affordable. Choose and trade your champions wisely at the market, where all kinds of new gladiators will arrive. Unleash your creativity by growing your unique team. Level them up, and equip them with more and more powerful items. All while planning for gladiators whose traits and equipment compliment each other to fight most efficiently. Diverse Battles Between monthly championships you should maximize your guild profit and growth to gain an edge at the next big tournament. Enter weekly Ring of Death arenas that offer a diverse range of challenges. Take advantage of changing weather conditions that affect gladiators to gain the upper hand on your opponents. Quests and World A variety of quest offers will come from different characters in need of your deadly gladiator services outside of the arena. Build reputations with different factions and learn about this world, or even change it. Help out the poor, support the district and the kingdom, or aid the progress of magic, depending on the main allegiance you chose. Or get involved in silly side plots. Once you’re ready to put your gladiator’s power to the ultimate test, accept challenging quests where your team will fight horrifying boss monsters. Replayability Starting each new game randomizes available gladiators, quirks, and items, giving you a challenge to figure out whole new team structures and tactics with what you are given. You can play on easier modes and have a chill and relaxed experience. Or you can tweak the difficulty, making every small decision carry heavy consequences. Once you master the game and want to challenge yourself even further, you can enable time limit, or even permadeath mode, in which you will not be able to resurrect your gladiators once they have fallen in the battle. Community So far the direction of the game development has received huge influence from our community, and we intend to continue that trend. Join us on Discord to chat, tell us your feedback, or just check on the latest progress of upcoming content and features.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1043260/header.jpg?t=1658415637",
    "Price": 7.99,
    "Developers": "Entertainment Forge",
    "Publishers": "GrabTheGames,Gamera Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_b6cf707468eea0b93a2204e02559680ce81f569f.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_5cc4a230bedf41651a93fd6e394b1e3bf5e64741.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_bc244c718f849481f767183499ab21286906f247.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_3b03fea19b6a423e032cf82d4fa951c89503c396.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_82d058083e75dcef61322ecc7e27312a3f8f01ea.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_de6958a879b736bcfd715b4d8fbe0e7ab952c13c.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_e388a74db606ac43b4045ff5a997701876e9b31d.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_f65586393ae167d891217ed2b6d9ed60a274942a.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_cebe2f482f7aac14d014ae5080aac81a50865175.1920x1080.jpg?t=1658415637,https://cdn.akamai.steamstatic.com/steam/apps/1043260/ss_8ae12c3107e74ee6064395464970f5deb15c7f4e.1920x1080.jpg?t=1658415637",
    "Slug": "gladiator-guild-manager",
    "Meta Title": "Gladiator Guild Manager: Oct 13, 2021, Entertainment Forg...",
    "Meta Description": "Looking for information on Gladiator Guild Manager? Check out the release date (Oct 13, 2021), developer insights from Entertainment Forge, and a comple...",
    "Alt Text Image": "Official header image for Gladiator Guild Manager game - Steam 1043260",
    "Canonical URL": "https://gusku.site/game/gladiator-guild-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gladiator Guild Manager\", \"description\": \"Looking for information on Gladiator Guild Manager? Check out the release date (Oct 13, 2021), developer insights from Entertainment Forge, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Entertainment Forge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GrabTheGames,Gamera Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1043260/header.jpg?t=1658415637\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}