{
    "AppID": 823640,
    "Name": "Gnomes Garden Lost King",
    "Release date": "Jun 11, 2018",
    "About the game": "Gnomes Garden is the best game for fans of construction and time management! The princess of our fairytale kingdom grew up and got married long ago. But one day, her beloved husband went hunting and didn’t come back. He disappeared with his entire retinue. When it happened, almost all his subjects were at a puppy show in the castle’s central square. The princess was pouring lemonade and thinking about her beautiful garden. Only a couple of days before, she and her husband had agreed that they would design the garden together. He grumbled a little, of course – he’d rather think of strategies for developing the kingdom or building new villages for settlers – but he quickly agreed. Right at that moment, some lords rode up to her, breathing hard and bearing bad news. “Terrible news, my queen! The king is missing!” “What!? Who dared to do this?” “I don’t know. We were hunting near the castle, next to the woodcutters’ village. The king said that when we returned to the castle, we had to arrange a picnic for you and give you a couple of cute little puppies! But suddenly, there was a noise and a strange crack where the king was. We ran toward where he was, but there was no sign of him – it was as if he’d disappeared into thin air!” “There must be magic involved here. We have to find him as soon as possible. Gather everyone, we’re setting off!” Then the princess swore to find the king and bring him home, and set off with her loyal friends in search of him! Dive into an exciting journey across fantastic worlds in this exciting casual fantasy strategy sequel – Gnomes Garden. Settlers in trouble? Farm stopped bearing fruit? Puppies asking for too much food? Tribes suffering from an invasion of trolls? Play Caesar and use careful resource management and an unusual approach to help everyone! A multitude of quests, over 40 levels in four unique worlds – all this awaits you right now. Restore ancient buildings, collect magical harvests, carefully distribute resources. All this is the key to success. Simple controls and a helpful tutorial will allow you to easily grasp the game’s basics. If you get in a tough spot, don’t forget about the princess’s mighty magic! Gnomes Garden – save the king and return prosperity! - An unusual magical world. Always keep in touch with the help of ancient dovecotes. - An uplifting plot, colorful comics and memorable characters! - A multitude of varied quests that the princess has never encountered before. - New trophies. - Over 40 unique levels. - Treacherous enemies: cave trolls, angry hornets and… sheep.. - A variety of locations and seasons: autumn, a beach, a desert and a swamp. - Useful bonuses: speed up work, stop time and run fast. - Simple controls and a helpful tutorial. - Over 35 hours of exciting gameplay for any age. - Pleasant themed music.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/823640/header.jpg?t=1589794097",
    "Price": 4.99,
    "Developers": "eJaw,Creobit",
    "Publishers": "8Floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_a1dfa2406448202a64aad819a126226914cc0ee8.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_362d3b81bfbe62b276ce3d74caa8b565fa4d0e5e.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_a01f05a692e55320b038523af73224b40e57998b.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_3fcc8abb8a5bcf3ebdcd07d360feab708db6f353.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_ee05af2197402968c30bf1801cca451fcfd22f31.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_6491c5297f1d9c51beb3f78f7eef631ffab49440.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_fb8219ea5c26c66c0001cdc3ce5896ba24d7396e.1920x1080.jpg?t=1589794097,https://cdn.akamai.steamstatic.com/steam/apps/823640/ss_f5d03d88daa3c535808c511b2f89a952af16afed.1920x1080.jpg?t=1589794097",
    "Slug": "gnomes-garden-lost-king",
    "Meta Title": "Gnomes Garden Lost King: Jun 11, 2018, eJaw,Creobit and F...",
    "Meta Description": "Looking for information on Gnomes Garden Lost King? Check out the release date (Jun 11, 2018), developer insights from eJaw,Creobit, and a complete game...",
    "Alt Text Image": "Official header image for Gnomes Garden Lost King game - Steam 823640",
    "Canonical URL": "https://gusku.site/game/gnomes-garden-lost-king",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gnomes Garden Lost King\", \"description\": \"Looking for information on Gnomes Garden Lost King? Check out the release date (Jun 11, 2018), developer insights from eJaw,Creobit, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"eJaw,Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8Floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/823640/header.jpg?t=1589794097\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}