{
    "AppID": 1984110,
    "Name": "Goetia 2",
    "Release date": "May 19, 2022",
    "About the game": "What could happen to two lovers who decided for a short break in Venice, Italy? Among all the possible scenarios, being pulled apart and tricked by a demon is certainly not what Daphné and Luca were expecting. Awakened as a pure soul in a twisted world he doesn’t understand, Luca is trapped in the reality of Buer, a demon with ulterior motives. He will have to find his way back to Daphné and his own fleshy sheath, solving puzzles and using whatever he can to get back to his life: notes, books, spirits he will encounter, decor, and Buer's (partial) information. Goetia as a series is built on one cornerstone: in these point-and-click adventures, you act as a pure (kind of) living soul. And what happens when you do not have pockets? No inventory. Rack your brains and keep an open mind: everything can help, from the notes to the decor. Above all, your actions in some rooms may have consequences elsewhere. And there’s a lot of “elsewheres” in Venice – especially when it’s the demons’ version of it. Explore Venice More than 80 rooms to explore, each with its own atmosphere and challenges, divided into 5 areas to explore. From the old classic venetian mansions to the abandoned islands of the lagoon, you’ll uncover many secrets related to the art of summoning demons. No inventory Luca awakens as a pure spirit. How could he grab objects and keep them for later? Instead of the classic inventory system, Goetia is all about possessing objects to move them around. A wall? What wall? Spirits walk through walls, it is known. As well as ceilings and floors. There’s no place you won’t be able to reach, unless something (someone?) stops you. Or if you wander around possessing an object. Choose your path There are 5 different areas to explore in Goetia. You will start by the archives, and then make your way through various other places in Venice. When all areas are discovered, you can go back to any room, anytime, to solve puzzles, gather more intel or just enjoy your walk freely. Get stronger During your quest, you will find some special capacities that will allow you to understand and see more of this strange Venice. But beware: as appealing as they might be, getting these powers also means you’ll get a bit too comfortable in this world where you don’t belong.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1984110/header.jpg?t=1652971635",
    "Price": 9.99,
    "Developers": "Moeity",
    "Publishers": "Forever Entertainment,Plug In Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1984110/ss_ab34855e9c869360d68f0227c3ce562ba9d2df2e.1920x1080.jpg?t=1652971635,https://cdn.akamai.steamstatic.com/steam/apps/1984110/ss_9121aad1ed1999dbf3da82e9621e7a1881d9badd.1920x1080.jpg?t=1652971635,https://cdn.akamai.steamstatic.com/steam/apps/1984110/ss_311b1214edfd9ad5be27a561efbbad967deb001d.1920x1080.jpg?t=1652971635,https://cdn.akamai.steamstatic.com/steam/apps/1984110/ss_e6a969beaed33a1854f4c7d6d004832580e2f3a5.1920x1080.jpg?t=1652971635,https://cdn.akamai.steamstatic.com/steam/apps/1984110/ss_7d04972470a030bc0f80d0d4af00066f393df525.1920x1080.jpg?t=1652971635,https://cdn.akamai.steamstatic.com/steam/apps/1984110/ss_ace1a721653b8c6c8410ed827c381a211483b588.1920x1080.jpg?t=1652971635",
    "Slug": "goetia-2",
    "Meta Title": "Goetia 2: May 19, 2022, Moeity and Full Overview",
    "Meta Description": "Looking for information on Goetia 2? Check out the release date (May 19, 2022), developer insights from Moeity, and a complete game summary.",
    "Alt Text Image": "Official header image for Goetia 2 game - Steam 1984110",
    "Canonical URL": "https://gusku.site/game/goetia-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Goetia 2\", \"description\": \"Looking for information on Goetia 2? Check out the release date (May 19, 2022), developer insights from Moeity, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Moeity\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Forever Entertainment,Plug In Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1984110/header.jpg?t=1652971635\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}