{
    "AppID": 1095700,
    "Name": "Joyfess Ep1: Martin's Secret Recipe",
    "Release date": "Mar 26, 2020",
    "About the game": "Joyfess Ep1: Martin's Secret Recipe is a revival of the point-and-click adventure genre of the 1990s, featuring traditional animation, full voice acting, rich dialogues and an unpredictable, family-friendly story set in the familiar Caribbean setting. Help extreme adventurer Joyfess Tidesman revitalize his boring life by doing something fresh; away from his kraken-slaying routine. As he stumbles upon a cooking contest due the next day, it would fall upon you to figure out how to become a chef overnight. Work your way through a flow of logical puzzles to obtain a recipe, collect its ingredients and arrive for the cooking contest in time (and in one piece). Back To The Caribbean As A Fearsome... Cook! No, this is not a pirate adventure at all. All our hero wants is to become a cook. Look Up Ingredients In The Cooking Encyclopedia No one can blame you for your ignorance of such widely known ingredients as baktin and the buga fish. However, no ingredient is obscure to you thanks to the cooking encyclopedia! Features A Fresh Kind Of Nostalgia: Experience the familiar Caribbean setting through the fresh perspective of an aspiring cook (formerly a kraken slayer) A Modern, Traditionally Animated Classic: Relive the classic adventure vibe in a modern game where every character is animated frame by frame for the HD screens of today Meet A Funny, Fully Voiced Cast: Explore hundreds of conversation branches constituting 1.5 hours of spoken dialogue. Try some of the optional responses for more of the island's people and history and an occasional joke or two. Consult The Cooking Encyclopedia: Joyfess can't make ice cubes without a recipe. But luckily, no food ingredient or matter is obscure to him with the cooking encyclopedia at hand! Beautiful &amp; Cartoony: Wander an island across 15 locations with colorful and vibrant shades of happiness all over the layout Moderately Challenging: Use deductive logic to solve fun puzzles with indirect hints to keep the game flowing Family-Friendly: Joyfess was made to appeal for adults and children alike What Are You Waiting For? It took us over five years to make Joyfess in this beautiful and nostalgic image. With intellectual challenges, humor and a rich game experience that is second to none, Joyfess is perfect for anyone wanting to discover how good adventure gaming can and should be. Although it's mainly targeted at adults, its light-hearted and funny nature suits the whole family. Give yourself a break from the intense modern games of shoot-em-up, blow-em-up, run-em-over-and-laugh and other competitive games. Relax and have fun.Get Joyfess Now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1095700/header.jpg?t=1585574878",
    "Price": 8.99,
    "Developers": "Sand Wagon Games",
    "Publishers": "Sand Wagon Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1095700/ss_b404f759dcaf00fb5438a46d05bf0200977456dc.1920x1080.jpg?t=1585574878,https://cdn.akamai.steamstatic.com/steam/apps/1095700/ss_bf981667985273ea7632d9c4481cf0cf4f30d481.1920x1080.jpg?t=1585574878,https://cdn.akamai.steamstatic.com/steam/apps/1095700/ss_0ef8f9c5c4773ed1209ad3592905927301edf95f.1920x1080.jpg?t=1585574878,https://cdn.akamai.steamstatic.com/steam/apps/1095700/ss_ff3de79f529354e7db2c6b84d105d3c5148088f2.1920x1080.jpg?t=1585574878,https://cdn.akamai.steamstatic.com/steam/apps/1095700/ss_5dd7df9ae871ccc2c7041ac7c7dba27a1f345d67.1920x1080.jpg?t=1585574878",
    "Slug": "joyfess-ep1-martin-s-secret-recipe",
    "Meta Title": "Joyfess Ep1: Martin's Secret Recipe: Mar 26, 2020, Sand W...",
    "Meta Description": "Looking for information on Joyfess Ep1: Martin's Secret Recipe? Check out the release date (Mar 26, 2020), developer insights from Sand Wagon Games, and...",
    "Alt Text Image": "Official header image for Joyfess Ep1: Martin's Secret Recipe game - Steam 1095700",
    "Canonical URL": "https://gusku.site/game/joyfess-ep1-martin-s-secret-recipe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Joyfess Ep1: Martin's Secret Recipe\", \"description\": \"Looking for information on Joyfess Ep1: Martin's Secret Recipe? Check out the release date (Mar 26, 2020), developer insights from Sand Wagon Games, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sand Wagon Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sand Wagon Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1095700/header.jpg?t=1585574878\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}