{
    "AppID": 382330,
    "Name": "Killers and Thieves",
    "Release date": "May 23, 2017",
    "About the game": "Take the city then take your revenge in Killers and Thieves, the guildmaster adventure from the co-creator of the Banner Saga series. You are the unseen master of a thieves’ guild in the medieval city of Greypool, taking ragged street rats and forging them into master criminals. Assemble and train a team of unique burglars, thieves and cutthroats then send them on daring heists across a sprawling city. Select your team carefully - do you want the agile catburglar, the master lockpicker, or the deadly cutthroat? You can’t always take everyone you need, and the city is full of surprises that will force you to redraw your carefully-laid plans at a moment’s notice. You decide the degree of risk: you could play it safe, but great riches await those bold enough to chase them—but then, so does the hangman’s noose. You are the guildmaster. Send your ragged crew out on daring heists to stake out targets, steal precious things, and even perform assassinations. Think on your feet. Meticulously-planned operations may fall into chaos as surprising emergent events come together in new and unexpected ways. Play your way. Follow a compelling series of story-driven missions, and employ your own initiative to identify high-value targets in a living open world. Keep the gold flowing. Wages must be paid, so make sure the money keeps rolling in. If the coffers are empty when payday comes, there could be trouble. Manage your thieves. Recruit worthless street rats and forge them into master criminals, but remember the risks: even your best might not come home again. An ugly world made beautiful. The sprawling city of Greypool and its seedy residents are brought to life with stunning art and animation inspired by medieval artworks. An acclaimed team. Killers and Thieves was created by Alex Thomas, co-creator of the acclaimed Banner Saga series, and a team of award-winning industry professionals. Killers and Thieves is the creation of Alex Thomas, co-founder of Stoic and Creative Director on The Banner Saga. He created this thieving adventure as an independent project, and it is being published by the Stoic team. Inspired by the question “What if you ran an entire thieves guild?” Alex has collaborated with a team of talented industry professionals to breathe life into a cruel, dangerous world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/382330/header.jpg?t=1495605075",
    "Price": 1.99,
    "Developers": "Alex Thomas",
    "Publishers": "Stoic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_08bbc98237349a4c5586ee7735a1995e9f19e9f4.1920x1080.jpg?t=1495605075,https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_11fc900bbef91c33cf12c71baee75cec10b88087.1920x1080.jpg?t=1495605075,https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_74a84d124e100d55af3ee41e86834fbfd8f31052.1920x1080.jpg?t=1495605075,https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_e8756c9c0cab0005d3f9ea043fe19ea16b1d2df3.1920x1080.jpg?t=1495605075,https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_4f5ae3c00fc635b50a8bd82cd70826e8901d3122.1920x1080.jpg?t=1495605075,https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_e91977a45992a489f944482222a743fd0c4202dd.1920x1080.jpg?t=1495605075,https://cdn.akamai.steamstatic.com/steam/apps/382330/ss_d11dfb2fabb1bdd6d11c6abf2a2044b7bf32102d.1920x1080.jpg?t=1495605075",
    "Slug": "killers-and-thieves",
    "Meta Title": "Killers and Thieves: May 23, 2017, Alex Thomas and Full O...",
    "Meta Description": "Looking for information on Killers and Thieves? Check out the release date (May 23, 2017), developer insights from Alex Thomas, and a complete game summ...",
    "Alt Text Image": "Official header image for Killers and Thieves game - Steam 382330",
    "Canonical URL": "https://gusku.site/game/killers-and-thieves",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Killers and Thieves\", \"description\": \"Looking for information on Killers and Thieves? Check out the release date (May 23, 2017), developer insights from Alex Thomas, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alex Thomas\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stoic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/382330/header.jpg?t=1495605075\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}