{
    "AppID": 1036440,
    "Name": "Kingdom Wars 2: Definitive Edition",
    "Release date": "Jul 9, 2019",
    "About the game": "Kingdom Wars 2: Definitive Edition is an intense real-time strategy game set in a dark fantasy world of Orcs, Elves and Dragons. It combines the best of Zombie survival and long term crafting with complex fast-paced city building. Engage in skirmish siege combat that turns beautiful landscapes into gory blood-soaked battlefields. Completely Redesigned The original Kingdom Wars 2 has been reworked and redesigned from the ground up. With new engine, sweet new graphics, and a total update of presentation, and interface. This is not just a high definition version, but a new gameplay experience. The Great Races The game is focused on the dominant races of Humans, Elves and Orcs with each able to recruit from other races depending on the alliances, techs and buildings they have available. Among the other races you will find scurrying Goblins, lumbering Ogres, mighty Minotaurs, ancient Treants, magical Dragons, crafty Dwarves, and fearsome Skeletal Warriors. Heroes and Wizards Each of the great races can recruit a variety of Heroes each with their own abilities to bolster their allies or decimate their foes. The three Orders of Wizards have also each aligned themselves with one of the great races, and use their vast magical power to shift the course of battle with terrifying Lightning Storms and devastating Blizzards. Story-driven Campaign Play an epic story-driven singleplayer campaign combining engaging cinematic narrative and original gameplay to determine the fate of the three great races as they try to survive in a world engulfed by total war after they fall out of favour with the gods. Skirmish Battle Engage in the complex city building and economy of a fast paced skirmish environment as you gather resources, construct buildings, reinforce walls and train troops before being swept up in field and siege battles with up to four players or AI. Craft the right Techs and Cards, and perfect your strategy and play style to ensure that victory is yours. Survival Mode The dead have risen and are marching towards your settlement with blood-thirsty determination. How long can you survive when your own dead bolster the ranks of the enemy if you don't burn the bodies quickly enough? Go it alone to prove your mettle as you play in solo mode or share in the struggle by inviting a friend to co-op mode. Siege Combat Mechanics Attackers can demolish gates with Battering Rams, scale walls with Ladders and Siege Towers, bombard the defenders and breach walls with Trebuchets and Dwarven Cannons. Meanwhile the defenders can hold the gates with boiling Oil Pots, skewer the advancing hordes with hidden Spike Traps, crush their enemies with Stone Tippers, and more. Set the battlefield ablaze with flame throwing Dragon's Breath machine, cower the moving shield that is the Mantlet, and mow down your enemies with the spinning blades of the Grinder. Complex Crafting System Every battle gives a chance to collect crafting items ranging from the common Tools and Blueprints to the rare Legendary Weapons and Tomes of Magic. Crafting is tied into every aspect of the game, from crafting new deadly siege weapons and units buildings, to creating new game cards, or researching new industrial technologies. Tech Tree Each of the great races has their own Tech Tree to unlock and research using various combinations of crafting items, providing opportunities for management and long-term strategic thinking as you unlock your ideal set of buildings, units and abilities to ensure victory in battle. Strategic Card Game You can build various combinations of playable card decks that you acquire through crafting that you use during battle to give extra resources, provide re-inforcements or call upon magical effects. You will need to think strategically about which cards to take into battle and tactically about when to use them, as playing the right card at the right time can shift the tide of battle. Online Community Use the chat channels to make friends, get help and arrange battles. Join guilds and alliances to show your allegiance and gain extra rewards. Invite your friends to co-op battle together and challenge your enemies to battle.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1036440/header.jpg?t=1643054989",
    "Price": 9.99,
    "Developers": "Reverie World Studios",
    "Publishers": "Reverie World Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_ee5b3cdd213b2bb7f2ccaf7eada8c0eee60058ab.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_3a6b27e0377533964bee8ecb177bec1276b479a5.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_887b28211a76abce30bb12f550400a6897d88ab6.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_718ebfc82746a2bce82219c3b54dec664c2ddbe0.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_20631aeafefd0acf38f72fb093c25300f8a2c2f7.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_e0f8f94c2754401dbd3cfc07ae81f3db74bc3484.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_612bbda727fb32f6687a0f1eec1c125781733ba2.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_66616787b49661d5965ab495a772beacde76a426.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_b4d41d866dbbd778c58e5e3befb05d059e74af82.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_9b5eaadf7a95bc3b9fa15d67c36e8dcd70acd521.1920x1080.jpg?t=1643054989,https://cdn.akamai.steamstatic.com/steam/apps/1036440/ss_05850bb645f500994c4fdbcdeebcd76479598de8.1920x1080.jpg?t=1643054989",
    "Slug": "kingdom-wars-2-definitive-edition",
    "Meta Title": "Kingdom Wars 2: Definitive Edition: Jul 9, 2019, Reverie ...",
    "Meta Description": "Looking for information on Kingdom Wars 2: Definitive Edition? Check out the release date (Jul 9, 2019), developer insights from Reverie World Studios, ...",
    "Alt Text Image": "Official header image for Kingdom Wars 2: Definitive Edition game - Steam 1036440",
    "Canonical URL": "https://gusku.site/game/kingdom-wars-2-definitive-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingdom Wars 2: Definitive Edition\", \"description\": \"Looking for information on Kingdom Wars 2: Definitive Edition? Check out the release date (Jul 9, 2019), developer insights from Reverie World Studios, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 9, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reverie World Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reverie World Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1036440/header.jpg?t=1643054989\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}