{
    "AppID": 1396050,
    "Name": "Kirakira stars idol project Reika",
    "Release date": "Oct 29, 2020",
    "About the game": "★ About★ The E-mote Engine brings character portraits to life with life-like, natural animations. Enjoy the story in English, Japanese, or Chinese (Simplified), with full voice acting from the main characters in the Japanese version. ★Story★ After experiencing joint lessons with DivaFes and Uesugi Produce. Ai and Nobuyuki have taken another step forward as idol producers. What awaits them at the time when they thought their normal life was about to start again is an encounter with new idols. 'I'll take care of you from now on as an idol candidate! Nice to meet you, juniors. It's nice to meet you. A dormant senior idol and a junior idol candidate. Will they bring a new wind to ODA? ★ Character★ Reika Aiba (愛葉 礼華) CV: Rio Minami(美波りお) Height: 162cm Weight: 54.5kg BWH measurements: 96/64/97 She is the senior idol in ODA. She had to take a break from her idol activities for some reason, but Miwako asked her to start her career again. She looks innocent and calm on the outside, but in reality, she is a mischievous, mischievous and mischievous older sister. She is also a cuddler, so she has a tendency to touch girls with her body. Even though she has taken a break, she is still a strong idol. Aine Omiya (近江谷 愛音) CV: Iroha Mizuse(彩葉) Height: 155cm Weight: 44.3kg BWH measurements: 81/59/82 She is an idol candidate who applied to ODA and is Ai's first junior in school. She was attracted to the idols who used to be members of ODA and got into ODA. She is misunderstood for her flamboyant appearance and her sharp-tongued attitude toward everyone, but that doesn't mean she is a 'gal. In her own words, 'That's just how college girls are nowadays. Because of her personality, she was able to open up to Ai and her friends when she first met them. She's more like a friend to Nobuyuki than an idol to the producer. Ai Amane (天音 愛) CV: Yoshino Mizuse(水瀬よしの) Height: 158cm Weight: 49.5kg BWH measurements: 87/60/86 Ai and Nobu were friends when they were kids, but they lost touch after her family moved away. She came to Tokyo for college, and offered a helping hand (and her apartment) to her old friend in his time of need. A young woman who treats everyone she meets with equal kindness, she practically exudes an aura of purity. Sometimes it's hard to tell if she's really just that nice, or maybe a little niave. Smart and athletic, she may seem perfect at first, but she can be surprisingly stubborn at times. She also has a more laid-back, casual side that she only shows in private, and to those she truly trusts. Ai's kind heart can sometimes get her in trouble. She has a habit of throwing her all into helping people, treating their problems as her own, while forgetting to take care of herself. ★ Features ★ -Lifelike, natural character animations courtesy of the E-mote Engine. -Available in English, Simplified Chinese, and Japanese ★ Staff ★ Producer: Saemonsaburo ikura Director: Sho Kannaduki Graphic: Asobinospirits Inc. and others Scenario: HinoRenka Music: Angel Note",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1396050/header.jpg?t=1606360027",
    "Price": 12.99,
    "Developers": "Sushi_soft",
    "Publishers": "Sushi_soft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1396050/ss_bd2cc1fa02990d195b69fe3cc1424ecf3f07b4d7.1920x1080.jpg?t=1606360027,https://cdn.akamai.steamstatic.com/steam/apps/1396050/ss_e1179403d05ebcf4b72ca78542c7ad631ff507c9.1920x1080.jpg?t=1606360027,https://cdn.akamai.steamstatic.com/steam/apps/1396050/ss_e41c87fb1d30971c2ebb6c1f1a75e67d853912d4.1920x1080.jpg?t=1606360027,https://cdn.akamai.steamstatic.com/steam/apps/1396050/ss_773f401f326d2b6d92b96a18c01aa17646a27ae1.1920x1080.jpg?t=1606360027,https://cdn.akamai.steamstatic.com/steam/apps/1396050/ss_339eee781ba6642645f2da1309d07add91b2c306.1920x1080.jpg?t=1606360027,https://cdn.akamai.steamstatic.com/steam/apps/1396050/ss_edb04ff98904045f59208664624f379b5eeb4266.1920x1080.jpg?t=1606360027",
    "Slug": "kirakira-stars-idol-project-reika",
    "Meta Title": "Kirakira stars idol project Reika: Oct 29, 2020, Sushi_so...",
    "Meta Description": "Looking for information on Kirakira stars idol project Reika? Check out the release date (Oct 29, 2020), developer insights from Sushi_soft, and a compl...",
    "Alt Text Image": "Official header image for Kirakira stars idol project Reika game - Steam 1396050",
    "Canonical URL": "https://gusku.site/game/kirakira-stars-idol-project-reika",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kirakira stars idol project Reika\", \"description\": \"Looking for information on Kirakira stars idol project Reika? Check out the release date (Oct 29, 2020), developer insights from Sushi_soft, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sushi_soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sushi_soft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1396050/header.jpg?t=1606360027\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}