{
    "AppID": 1581220,
    "Name": "L.S.D.: Prologue to Lasting Spiritual Derangement",
    "Release date": "Apr 7, 2021",
    "About the game": "DISCORD L.S.D. L.S.D. is a first person shooter set during a hallucinogen trip. It's a dream-like experience, in which things don't seem to make sense. Because they don't. You keep waking up in different, weird open worlds. You have no choice but to explore them, trying to survive and to get back to reality as soon as possible. Suddenly you'll find yourself in magic medieval-like towns, fighting against fire-spitting dragons with a magic sword, then you'll find handguns and rifles to attack fierce giant creatures that come right at you. You keep waking up in mysterious, unexplored places. You're in a loop . You keep living the same moment again and again. It's up to you to decide how you're going to live it. Are you going to slaughter those dragon with your sword, or are you going to let them rip your head off? Will you try to wake up from this nightmare? Or will you take control of your dreams? What you'll find in this game: Giant open worlds; Creatures that try to kill you; A psychotic narration; Magic swords; Very loud rifles; Very loud handguns; More creatures that try to kill you; Things that blow up for no reason: Even UFOs! Maybe. I'm not supposed to talk about it. The game also features original music by Salvatore Palermo. And all of this for about the price of a cheap cinema movie ticket! Keep in mind that L.S.D. is being developed by a solo, but very possionate, indie developer! That's me! If you got this far and you're reading this then it basically means that we're friends, so I'll stop using the third person. L.S.D. is my very first commercial game. I love creating games that feature open worlds and that let me channel my creativity in unusual ways. That's how I came up with the idea for L.S.D. Since I'm all alone, sometimes I use some beautiful pre-made assets created by amazing artists that let their work be licensed online and I try to make the most out of them. If you'd like to get notified about the game (and sales) at launch, make sure to put it in your wishlist! Wishlisting L.S.D. is a great way to support me in creating the game of my dreams in a completely free way. Feel free to contact me for feedback, advice and anything related to the project.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1581220/header.jpg?t=1629288726",
    "Price": 0.0,
    "Developers": "Fabiulous Games",
    "Publishers": "Fabiulous Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1581220/ss_9a3cb2cec8540c0d1ca4c652463b958c60d41409.1920x1080.jpg?t=1629288726,https://cdn.akamai.steamstatic.com/steam/apps/1581220/ss_efbf1eff357867e0cb93dc35d05c307eac9338f1.1920x1080.jpg?t=1629288726,https://cdn.akamai.steamstatic.com/steam/apps/1581220/ss_2e5baf6cfb969a2a43e1791023e82aaea00f160b.1920x1080.jpg?t=1629288726,https://cdn.akamai.steamstatic.com/steam/apps/1581220/ss_0a788085dfcc04649431f85d6b25737afe08b48b.1920x1080.jpg?t=1629288726,https://cdn.akamai.steamstatic.com/steam/apps/1581220/ss_84ef927bacb4b954a7bcd4814cbb5417312fd9b9.1920x1080.jpg?t=1629288726",
    "Slug": "l-s-d-prologue-to-lasting-spiritual-derangement",
    "Meta Title": "L.S.D.: Prologue to Lasting Spiritual Derangement: Apr 7,...",
    "Meta Description": "Looking for information on L.S.D.: Prologue to Lasting Spiritual Derangement? Check out the release date (Apr 7, 2021), developer insights from Fabiulou...",
    "Alt Text Image": "Official header image for L.S.D.: Prologue to Lasting Spiritual Derangement game - Steam 1581220",
    "Canonical URL": "https://gusku.site/game/l-s-d-prologue-to-lasting-spiritual-derangement",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"L.S.D.: Prologue to Lasting Spiritual Derangement\", \"description\": \"Looking for information on L.S.D.: Prologue to Lasting Spiritual Derangement? Check out the release date (Apr 7, 2021), developer insights from Fabiulou...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fabiulous Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fabiulous Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1581220/header.jpg?t=1629288726\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}