{
    "AppID": 1066630,
    "Name": "Master Magistrate",
    "Release date": "Jun 12, 2020",
    "About the game": "Assume the mantle of magistrate to uphold law and order in a town where the cherry trees bloom all year round. Solve crimes and pass judgment with a colorful cast of samurai, detectives, inventors, and brigands in a Japan on the edge of modernization! 150+ event CGs featuring anime-style, chibi, and Japanese brush art! Full instrumental soundtrack featuring over 40 original songs! Four cases totaling 20+ hours of story! Full professional Japanese voice acting! The hit Japanese indie detective game crosses the sea for the first time to make its case! Detective. Lawyer. Jury. Judge. The Magistrate of Nakamachi is responsible for the well-being of everyone under his jurisdiction—and for the lives of those who violate the law. Fortunately, the magistrate doesn't work alone. His helpers' responsibilities include everything from police patrols to firefighting to paperwork. Mountains and mountains of paperwork. Shimei Ooka : The newly-appointed Magistrate of Nakamachi, and the game's main protagonist. A scholar and a bookworm, Shimei knows his business, but will he be able to live up to his father's legacy as magistrate? Rimu Hiraga : The tomboy inventor of the century! Rimu joined the Nakamachi magistrate's office as a junior officer, along with her childhood friend and stalwart companion Shimei. Her best talents, though, lean more to the mechanical. Sakura Toyama : The daughter of the Magistrate of Kitamachi. Brilliant, but headstrong; capable, but intensely jealous of the magistrate's office that should have been hers... Koume Kawai : A mysterious girl held in the magistrate's office jail in connection with a brutal murder. Kind, sweet, and clever—but what is she hiding...? A band of vigilante police, outside of the direct control of the Shogunate—and, by extension, the magistrate—yet always willing to cooperate closely for the safety of the city. Their methods can be tough, but they're scarily effective. Together with the more transparent and accountable activities of the magistrate's office, these battle-hardened samurai are indispensable to the peace. Takeru Kondo : The commander of the Shinsengumi. As long as the magistrate is still a rookie, Kondo will remain the real power behind the Nakamachi magistrate's office, but he's always happy to educate the fledgling officials under his wing. Yamanami Ayaka : Vice-commander of the Shinsengumi. Yamanami is beautiful, charming, and extremely attentive to detail. She acts like a mother-figure to the whole Shinsengumi, keeping the dormitory clean and the day-to-day business running smoothly. Shino Okita : A tight-lipped and laconic ace swordswoman. Absolutely terrifying in a fight, Okita is the perfect enforcer. Underneath the surface, though, could she have a softer side too...? Toshikaze Hijikata : Childhood friend to Rimu and Shimei, and a highly-trusted officer in the Shinsengumi. Sloppy as he is in his private life, he's matured into an extremely reliable man. Enjoy daily life in Oukacho, interacting with the townspeople, and building relationships with your friends and coworkers—until an incident disturbs the peace! Interview witnesses and suspects to collect information and build dossiers, investigate the crime scene for material evidence, and explore the town in pursuit of more clues. When you need a breather, explore your dormitory to get to know your friends better! Once your investigation is complete, hold a hearing with your suspects and key persons of interest to narrow down the possibilities and uncover the truth behind the lies! But don't forget: some mysteries are longer-lived and deeper-rooted than any one case. As the magistrate of Nakamachi, will you have the resolve to do what it takes to uncover the conspiracies at the heart of your city and your life?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1066630/header.jpg?t=1658931234",
    "Price": 29.99,
    "Developers": "IRODORI",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_c388ef99f66909e317e984f7b51d902dd636d77b.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_232f2712baa247674fb8126cc6a46971289cb1b9.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_c89d5fa0110099dddc3a9aed1b9b559339c098b0.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_4f7cdb5907c3e96c51e9d0c1007fad6fe14c7db5.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_c5bbe624ece64fd4a0985a2c7a306d473016dc20.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_75432b38dba2a184c9575a01f3f261105ec05b89.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_c64b3020a994a8931594cf610b31fae52e9b8423.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_a87204f2d8373975b334101fef5de1aa12430776.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_d173e8bfb2fbaf0ec496a79ee572f26191b4bb1c.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_4ee36672403eb687d1288395cff4c10d17c98e7d.1920x1080.jpg?t=1658931234,https://cdn.akamai.steamstatic.com/steam/apps/1066630/ss_92d2efa3fbc4040068a78f0936839cf812c259f9.1920x1080.jpg?t=1658931234",
    "Slug": "master-magistrate",
    "Meta Title": "Master Magistrate: Jun 12, 2020, IRODORI and Full Overview",
    "Meta Description": "Looking for information on Master Magistrate? Check out the release date (Jun 12, 2020), developer insights from IRODORI, and a complete game summary.",
    "Alt Text Image": "Official header image for Master Magistrate game - Steam 1066630",
    "Canonical URL": "https://gusku.site/game/master-magistrate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Master Magistrate\", \"description\": \"Looking for information on Master Magistrate? Check out the release date (Jun 12, 2020), developer insights from IRODORI, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"IRODORI\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1066630/header.jpg?t=1658931234\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}