{
    "AppID": 566690,
    "Name": "Meriwether: An American Epic",
    "Release date": "Dec 4, 2017",
    "About the game": "An Epic American Journey President Thomas Jefferson has commissioned you for a mission that will change the destiny of the United States. Along with your co-captain, William Clark, you are to lead the Corps of Discovery--three dozen intrepid volunteers from the United States Army--from St. Louis to the Pacific Ocean. That's over 3,700 miles of rivers, plains, forests and mountains you will need to cross: and then retrace on the journey home. Meriwether is a single-player, first-person RPG that combines the narrative richness of adventure games with resource management, hunting, and exploration to offer a unique play experience. The game implements the best parts of open-world design and customized content to give you an experience that is driven by your actions, yet remains true to history. The dangers you will face are incalculable. You'll have to draw your own map as you go, for no reliable one exists. You'll have only the supplies you can carry with you to fend off starvation, exposure, disease, and mischance of every variety. Given the difficulty of the journey, you are the only man in America to which the President would entrust this mission: you. And you are Meriwether Lewis. Features The script and story, by award-winning writer Carlos Hernandez, features an innovative dialogue system. Are you more of a Leader, a Diplomat, a Soldier, or a Scientist? Will you be able to keep your Melancholy in check? Your choices will customize the game to your play-style. Historical rigor: noted Lewis and Clark historian Barb Kubik has provided the designers with a thorough cultural understanding of America in the early 1800s, and has fact-checked the game down to the buttons on the uniforms. In addition, some of the leading Lewis and Clark scholars, including XXXXX, have consulted on the game, further deepening its authenticity. Keep death at bay through carefully managing your resources, negotiating well with the Native American nations you encounter, and constantly boosting the morale of your men. Hundreds of plants and animals to discover, all modeled on the actual species Lewis documented on the journey. You are the doctor! Attempt to treat your men's wounds and illnesses by using logic, luck, and mercury-laced laxatives (which are, unfortunately, historically accurate). Hunt: 1804-style. Ever try to shoot an angry grizzly with a flintlock rifle? Better make every shot count. 20+ hours of gameplay for the first playthrough, and five distinct fates for Meriwether Lewis based on your actions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/566690/header.jpg?t=1513877598",
    "Price": 14.99,
    "Developers": "Sortasoft LLC",
    "Publishers": "Sortasoft LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/566690/ss_c8ff2c53f5a8938583db136f92d70523d35ac24a.1920x1080.jpg?t=1513877598,https://cdn.akamai.steamstatic.com/steam/apps/566690/ss_0727af1f773ed1e3d6edd6c528f7c4cd8446203b.1920x1080.jpg?t=1513877598,https://cdn.akamai.steamstatic.com/steam/apps/566690/ss_43e02bf0958e22e2e13d5952e635554aa9292283.1920x1080.jpg?t=1513877598,https://cdn.akamai.steamstatic.com/steam/apps/566690/ss_d93d1e4b8912e6371fe1c9ab15d599c0f1dc26f1.1920x1080.jpg?t=1513877598,https://cdn.akamai.steamstatic.com/steam/apps/566690/ss_cf631a155bbf183e77bdf81225e2003b0ed2b014.1920x1080.jpg?t=1513877598,https://cdn.akamai.steamstatic.com/steam/apps/566690/ss_d4f9a09c5b625b2f416d01cd99ee23e53ecf9326.1920x1080.jpg?t=1513877598",
    "Slug": "meriwether-an-american-epic",
    "Meta Title": "Meriwether: An American Epic: Dec 4, 2017, Sortasoft LLC ...",
    "Meta Description": "Looking for information on Meriwether: An American Epic? Check out the release date (Dec 4, 2017), developer insights from Sortasoft LLC, and a complete...",
    "Alt Text Image": "Official header image for Meriwether: An American Epic game - Steam 566690",
    "Canonical URL": "https://gusku.site/game/meriwether-an-american-epic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Meriwether: An American Epic\", \"description\": \"Looking for information on Meriwether: An American Epic? Check out the release date (Dec 4, 2017), developer insights from Sortasoft LLC, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sortasoft LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sortasoft LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/566690/header.jpg?t=1513877598\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}