{
    "AppID": 1005460,
    "Name": "NationWar2:Chronicle",
    "Release date": "Sep 30, 2020",
    "About the game": "Tip 1.If it fails to load, please select the 'Simple Terrain' option in the setting interface 2.If the game runs lagging, please turn off some graphics options in the settings interface 3.The game will freeze for a while during the loading process, please wait patiently 4.If an error is reported when loading the game (you can unplug the external keyboard and try again) Game guide steamcommunity.com/sharedfiles/filedetails/?id=2231852947 Nationwar1 store.steampowered.com/app/669320/Nation_WarChronicles/ Introduction NationWar 2.0 is a big strategy game based on the theme of the Spring and Autumn and Warring States period. There are more than 60 countries to choose from in the game. The game incorporates historical celebrities during the Spring and Autumn and Warring States Period, a hundred controversies, economic and trade culture, and war strategy. Map 1: 1 restores the mountainous landscapes and rivers of China. Three civilizations (Huaxia, primitive, nomadic), and the competition of eight cultures. Can you rule the world like Qin Shihuang? Game background The game started on the Chinese earth in the eighth century BC. At this time, the once powerful Zhou royal family, due to the faintness of the emperor and the constant civil strife of the royal family, has gradually declined. The most terrible disaster that the royal family will face soon, but everything has not been settled yet. Whether it is the ZTE Zhou Dynasty, rebuilding order, restoring Zhou Li, or competing for the Central Plains, replacing it, or even changing the summer into the Central Plains, all in the hands of players. Rich countries The game contains the vast majority of countries in the Spring and Autumn Period, including their respective arms, characteristics, and culture. A strategic map contains all, players can either raise the perspective to overlook, or pull down the perspective to view the details. Close to history 1. Classic technology tree: After research, the technology tree made according to the development history of Chinese science and technology, each technology has related verses or sentences quoted from Chinese classics. 2. Trade resources: In the Spring and Autumn period, countries traded quite frequently, and businessmen like the 'Jiranjia' genre and Fan Li were born. The game is close to history and specially designed. Players can manipulate trade, appoint businessmen, and collect profits. 3. Hundred schools of contention: Various thinkers appeared frequently during the Spring and Autumn and Warring States Periods. In National War 2.0, doctrine and thought became the core play point of the game, including not only the unique play of various doctrines, but also the need to consider characters when appointing or removing official positions The accompanying doctrine attributes. 4. Character system: Character avatars are randomly generated and will not be repeated. Players can register queens, harem harems, multiple heirs, exchange captives, buy hearts, and suppress dissidents. There are also many historical celebrities in the game that can be recruited by players. 5. Changeable heir system: Players need to register the queen at the right time and set up the prince (which is not suitable too early and too late) to maximize the simulation of historical scenarios. 6. Rich historical events: Players need to make timely and reasonable decisions on some unexpected situations, can you become a Mingjun? 7. Complex battles: including impassable mountains, rivers, strategic locations, military supplies, morale, and mutual restraint of arms, the coordination of various tactics, and the advantages of various arms under different terrains are different. 8. Realistic diplomacy: Players can find allies, marry with other countries to prevent aggression, and can also provoke opponents, far and near attacks, trading materials, cutting land for mercy, and late-game diplomatic talents such as Su Qin and Zhang Yi are available for recruitment.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1005460/header.jpg?t=1655362274",
    "Price": 15.99,
    "Developers": "Yiming",
    "Publishers": "Yiming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_2f50ee365fbac829f9c5356c4c006389292cf6d0.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_1bb31902ab231cd1ecbdb44d01c9742b7f82bd1e.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_d2065aa8b88501ef308933c5c64573e7756de005.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_fd88f2586d47b747fc625cfbac9654a3c190a316.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_59586194c12b7cd9fc8e29465f3d1b28840bab5e.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_983c8eb8bbf843f610151cf181400ce3bb64de79.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_daff945821f4045fac7541a45d0b0ab68ec9a970.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_2aa318541421983afe5a1519e04afcb6965094fc.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_e6190d9ed5b1f75b7688b23018e9f728b49962fb.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_1951352d5d1ace4fddca5e7725569b0e42513469.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_996e15fbc1b2714fc362e743744047ce8a462c1a.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_07a58f7c844e1317f8b105171d0304c2990f2aa9.1920x1080.jpg?t=1655362274,https://cdn.akamai.steamstatic.com/steam/apps/1005460/ss_110a9c118d673ebd48516eb8781d41d69200be82.1920x1080.jpg?t=1655362274",
    "Slug": "nationwar2-chronicle",
    "Meta Title": "NationWar2:Chronicle: Sep 30, 2020, Yiming and Full Overview",
    "Meta Description": "Looking for information on NationWar2:Chronicle? Check out the release date (Sep 30, 2020), developer insights from Yiming, and a complete game summary.",
    "Alt Text Image": "Official header image for NationWar2:Chronicle game - Steam 1005460",
    "Canonical URL": "https://gusku.site/game/nationwar2-chronicle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NationWar2:Chronicle\", \"description\": \"Looking for information on NationWar2:Chronicle? Check out the release date (Sep 30, 2020), developer insights from Yiming, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yiming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yiming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1005460/header.jpg?t=1655362274\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}