{
    "AppID": 1602170,
    "Name": "Need For Conquest",
    "Release date": "Jun 6, 2021",
    "About the game": "Need for Conquest is a turn-based strategy game with a very simple objective - to capture all enemy territories on a map and achieve global domination. If you like RISK® style games but you want to enjoy the freedom of procedurally generated maps and level editor, this game is for you. Ah, and there is no risk of in-game payments ;-) You pay once and it’s all yours with all future updates - fair and square. In Need For Conquest a player can play on both geographical or procedurally generated maps. Geographical maps available up to date: World Europe United States of America Great Britain and Ireland Germany Each of those maps can be customised by a user in a built-in map editor ( Video Tutorial for Map Editor ). The number of procedurally generated maps is practically countless. They are not precomputed but generated at a runtime on the player’s machine. For all practical purposes each one of them is unique. To give the player the ability to save them or modify if needed the most recently generated map is available in a built-in map editor under Default &gt; Procedurally Generated. In Need for Conquest each turn has 3 phases: draft, attack and move. You can draft your armies into territories, launch an attack from a chosen territory to the enemy territory and move your armies from one of your territories to the other. If you are not sure what to do during a given phase, press the “?” button to read the help info. For each territory, there might be assigned a certain number of coins and stones - you can modify it if you wish in our map editor. Total number of coins tells how many armies you can draft at each round. Total number of stones decides the armour of your armies when defending your territories. In Need for Conquest, you can play against advanced AI (up to 11 computer opponents). Up to date, you can choose from 3 levels of difficulty (Monkey AI, Colonel AI and Marshal AI). You can also play against human opponents on the same PC. There are 2 game modes available: Classic: Armies can attack as many times as possible during one round and then one chosen army movement in the move phase. Conquer: A bit slower but more realistic style where given army have only one attack or one move (exclusively) per round. The battle mechanics is a bit improved compared to RISK®. It has a very nice and quite natural property, that the bigger your advantage is, the less total damage statistically your armies will receive while destroying the same defending force. In Need for Conquest you can use a built-in map editor to modify existing maps or test your own strategic ideas by creating completely new maps. To play on your map, edit it in “Map Editor” and then just enter “User Defined” scenario after clicking “New Game” in “Main Menu”. You may define links between territories, amount of coins and stones for any territory, you may choose which territories belong to which player and set the default number of armies for any territory. You can create a practically infinite number of games. There is no risk you will be ever bored with Need for Conquest.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1602170/header.jpg?t=1651531843",
    "Price": 9.99,
    "Developers": "Michal Wojcik",
    "Publishers": "Warp Dynamics Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_a9d07dd2a0be387dc838f693a8de7e7767643838.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_873df0bbc5c7b0a0d1ef50c2858225494733e3b9.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_d0edbf0f92ba2ca4d63f1c36a763e78a3182c305.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_7931ee54a0c19865fb1acf61008817f9e13ccc8a.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_df0b3446024f4c71fc0afd2e4f7fc86e5855a08b.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_d82614c765f57a13e44bc8527837d15e8064c19d.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_bf962511d6e43425af58ddcc365d96ee6c7dbbed.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_98a49c8007e9d4e429306ed0bfdb44f410e1a664.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_a46679d6b04a8e346785c0f093843cfa818ad349.1920x1080.jpg?t=1651531843,https://cdn.akamai.steamstatic.com/steam/apps/1602170/ss_406659509d7163b1a59decf05f211ff3041fbd70.1920x1080.jpg?t=1651531843",
    "Slug": "need-for-conquest",
    "Meta Title": "Need For Conquest: Jun 6, 2021, Michal Wojcik and Full Ov...",
    "Meta Description": "Looking for information on Need For Conquest? Check out the release date (Jun 6, 2021), developer insights from Michal Wojcik, and a complete game summary.",
    "Alt Text Image": "Official header image for Need For Conquest game - Steam 1602170",
    "Canonical URL": "https://gusku.site/game/need-for-conquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Need For Conquest\", \"description\": \"Looking for information on Need For Conquest? Check out the release date (Jun 6, 2021), developer insights from Michal Wojcik, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Michal Wojcik\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Warp Dynamics Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1602170/header.jpg?t=1651531843\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}