{
    "AppID": 793280,
    "Name": "Neon Valley: Revenge",
    "Release date": "Feb 28, 2018",
    "About the game": "The government has won the cyber war. Their grasp chokes the citizens of every country as oppression rules the world. Then a group of hackers carved out an untraceable piece of the cyberspace and created the underground network known as Neon Valley. Since then, it has become a place where both the good and the bad coexist as the last of the free. And such places always attract a need for entertainment, thus the Neon Valley Colosseum was born. An online shooter inspired by retrowave and neo-80s. Neon Valley takes an arcade-like route to the shooter genre. With high score leader boards based on both skill and style. Fast-paced combat akin to Quake and Unreal Tournament. Game modes such as floor is lava, obstacle courses and more. Neon Valley is a place where the best come to attain infamy and carve out their name in the cyberspace. The new frontier Neon Valley. A place free from the grips of the government, a place where humanity indulges. This is where black market trades are done, where secrets are shared and ideas, outlawed by the government, discussed. A world where the good and the bad coexist as the last of the free. At the core of Neon Valley, the Colosseum exists. On the surface, it thrives as an entertainment complex. As challenges for skill junkies. As a platform to notoriety. But the Colosseum fuels this virtual world. It draws in new challengers all over the world and with this comes opportunity. The black market programmers use it to test virtual weapons. Dealers barter and wager on the outcome of battles. Designers display their latest fashion code. Map editors design intricate battlegrounds. At the centre lies you. The user. Will you show the world what you’ve got? This is a place of entertainment where most come to conquer the battlegrounds. To prove their skills above all others in the new frontier and obtain infamy. For some of our ambitions never fade through the ages. However, behind the Colosseum and the city is a network of shadows who control its affairs. Some support the rebellion from the shadows... Others profit off the market and guide its very design. Their whims might be in your benefit. Battle suit Here users compete with Battle Suits. A program interface which a user takes control of, giving them freedom of movement and an assortment of items. Items which they take onto the field for offensive and defensive purposes. Users battle to unlock new gear, increasing their prowess on the battlegrounds, climbing to reach the top of the leaderboards. Movement Your suit has full range of motion using “WASD” inputs. Each suit has the ability of partial air control, adjusting your trajectory mid-air. This also includes sprinting state activated with “Shift”. Crouching state with “C” input, for taking cover behind low objects and a smaller attack profile. Eventually for better shooting accuracy and going under obstacles too. Also, stealth option with the newly added foliage. It’s also the state you enter after performing a slide maneuver. Sliding Talking about slide maneuver, sliding is patched in. Activating crouch whilst in motion will perform a slide. While sprinting the battle suit does a short dash, followed by an extended slide. Sliding in air, it slightly increases user down velocity, to mimic a shinobi air dash move inspired by ninjas. Dashing Expending stamina/energy to dash allows the user to increase directional acceleration of the battle suit using small boosters attached to the lower back. This booster is used to avoid enemy attacks, dashing onto areas just out of reach and general evasion or positioning. Wall jump Increased leg thrust power in the battle suits allow for users to wall jump. Covering further distance and allows for consecutive wall jumps. This is a great utility maneuver to reach higher ground, avoid pursuit and out play opponents. Shields Each battle suit has a force-field as the first layer of defense. Take cover when it breaks to regenerate or risk taking damage to your health. Stamina Yes, stamina is simulated in this virtual world. Something to limit the freedom of movement and create opportunities for entertaining situations. Dashing, sliding, sprinting and wall jumps consume stamina. However, it will regenerate given some cool down time. Character customization Added a range of items for character customization, more are in the works! They are rewards for gladiators who participate and awe the spectators in combat. Inside the Colosseum or the arena. Find the orange card, in a club for champions. Camera controls Each battle suit is fitted with a small drone camera to provide a wider perspective for better spatial awareness. You can activate toggle this camera with Q. Your visor and drone camera are designed with adaptive magnification built in. Allowing the user to freely zoom with or without weapons fitted with scopes. Shoulder switch Use “Z” to switch shoulders in 3rd person. This will move the default shoulder position of the drone camera to the other shoulder. Useful in peeking around corners, better bullet trajectory for tight angles and also for user preference. Alt Hold “Alt” to look around with the camera. In 3rd person this will rotate the camera around the user. Basically, allowing the user to easily surveil their surroundings or to check themselves out. Relay cam When shot, your drone camera deactivates. This switches off the drone camera and reactivates first person view. Pay attention to drone cams peeking around corners, deactivate them and restrict the surveillance utility of your enemies. Combat Users have numerous weapons at their disposal, from pistols to rifles, lasers or ricochet bullets. Numerous gadgets are available too, from gravity modifiers to teleportation tools. Abilities that create shields or grapple hooks. Primary, secondary and Akimbo that replaces primary with a secondary. Equip in the menus or in The Mainframe. They are restricted by the Red multi-pass to access. Winning gets support from anonymous arms dealers unlocking more tools at your disposal. As your victories are not only your own but many of the black market users who bet on your wins and losses. Dual wield The largest change to guns. Secondary weapons can now be equipped dual wield. Even though it replaces the primary weapon slot, the idea is that a dual wielded weapon has the same power and perhaps more versatility than a primary weapon. Giving users this option is part of the game design philosophy of allowing users to fully customize their gear according to a playstyle they wish. Melee weapon - Primary weapon sub-class Added the slide for a reason. To increase the ninja-like game feel, the long awaited Ninjato sword has been added. The first of the melee weapons. Still working out fluidity kinks, motion and better collision detection. Ninjato has a 4 attack types: High &amp; low High attacks, using Left Mouse input, the user dashes towards looking direction and this attack has 3 moves in its combo. Low attacks uses the Right Mouse input and the user performs a slide motion whilst slashing in a 3 move combo too. High and Low attacks can be interchanged to perform different combos. For example, R + L + R will perform a high, low, high attack chain. Attacks have a movement multiplier according to movement input. Holding forward, attacks lunge further as gap closers to reach gun users. When holding backwards, attacks are performed on the spot. Jump The jump attack gives the user a double jump, essentially. At the apex of the double jump the user attacks, reaching targets with the height advantage. Slide While in sliding motion there is a small window to attack, which triggers a slide attack. Shortly dashing the user forward whilst simultaneously slicing vertically, the user can quickly reach an enemy and damages everything along the dashing path. Gadgets Each gadget has a certain utility and mostly defense oriented. Designed by the River dragon these tools are locked behind the blue multi-pass. Various shields for defense, or get creative and use them as platforms. A pulse clear which absorbs all incoming bullets akin to bullet hell games. Lastly, a gravity multiplier which grounds any object in its range and stuns enemies. Apply these limited ammo items in the right situation to triumph. Nades - Gadget sub-class There are four grenades in the users arsenal. Vision distortion, teleportation, explosive and a force push sticky nade. Each has their own advantages. Movement gadget - Gadget sub-class Rapid terrain traversal gadgets, which are perfect for repositioning and moving over obstacles. A booster pack which propels the user where they are aiming, designed to be the most agile of the movement gadgets. The grapple hook moves the user the furthest but at the cost of telegraphing their movements. Lastly, the newly added boost pad. A gadget which can be used offensively as well, setting a trap for enemies and launching them away from you… Or into a vulnerable position. Maps Many battlegrounds are available and each provides their own environmental challenges. Designed to cater to certain play-styles while testing others. Ranging from close quarters to large monolithic structures for vertical gameplay. Numerous new battleground designs are continually being developed, and with successive firmware updates, they will become available. Taiyo A map designed after a Japanese village. Once a trading forum this cyberspace has a village center, tight alley ways and buildings with breakable walls. Surrounded by forests with dense foliage for stealth. Terrain has heightened waterfall for an over view of the village and obscured pathways. Cube The designated training map for gladiators. The blocks are orderly placed to practice ricochet shots and wall jumps. It provides a balanced battle map and segmented into optimal areas for each weapon class. Cube has patrol drones that provide training against the corporations offensive systems. They are designed with sturdier defenses for increased challenge. Monolith A mysterious monolith has crashed into the center of this map. It has interesting gravitational properties which dynamically change the map when the trigger is activated. This map favors long range combat with the long cracks into the terrain made by the impact. Modes The Colosseum battles cycle through various game modes. Designed to challenge gladiators on the battle field with objectives. However, the users are free to battle among themselves, work together and combine your powers against a common enemy. Whatever you chose, do it well and gain points enough to reach the high score leader-boards. Invader Obviously inspired by invaders, this mode challenges the player with an onslaught of various attack drones. Each armed with unique functions to hinder or deal damage. They spawn above the Colosseum in waves, tracking down their target. Lava The terrain turns into lava on selected maps. Firewall inspired lava rises, slowly consuming the map and increases difficulty traversing the map in floor is lava mode. With a rising lava tide you must reach the counter hack objective. This will push back the fire wall lava and give you back valuable ground. Hold the points against spawning fireballs, more players in the zone the more points awarded… However, more fireballs will spawn. When making contact with lava the player will be shot up, like the classics. Scoring when reaching a point with the following multipliers: on survival time, wall jump count and time spent not touching the ground. Bonus points on up to 3 other players who also reach the point, motivating cooperation. More players on the point increases hacking speed. Data This mode is designed after search and destroy… Sort of. Disable the virus before it infects your code, bring it to the quarantine zone to dispose of it. But from the cyberspace breach, where the virus entered from, debris are crashing in and falling across the map. Avoid getting crushed while avoiding opposing players who might be after the prize. Reach the designated quarantine zone and get points. The quarantine zone, according to a timer to avoid viral countermeasures, reaching one of these zones within 15 seconds of it spawning with a virus will give a large multiplier. Avoid obstacles, falling debris from the breach and other players hunting you down. On death the virus will detach and begin finding a new target. Multi-pass system Completing objectives, and reaching the required points will reward the user with a multi-pass. According to the favor of the dragons whom benefit from these matches. Keep an eye out for anonymous rewards from hidden backers each with a stake in your success. Scoring Scoring is done on objective completions or kills… However, there are multipliers designed to reward stylish gameplay. Ricochet kills, gadget combination, consecutive wall jumps, survival count and more. Enemy NPC Attack drone: Fastest of the drones, they shoot tiny high speed projectiles. As they are hard to see, stay in motion to avoid damage! When they reach a certain distance from the player they will begin orbiting while shooting. Make sure to not get surrounded. Roll drone: These drones move about covertly, they roll along the ground hidden among foliage and crevices. When in range of their target a tractor beam is activated which keeps its object in place for the attack drones to finish the job. Their beams can be countered if you manage to reach its edge and resist its gravity. Laser drone: Visually, its most notable feature are its forward shields. Able to deflect most energy weapons. Keep a railgun handy to deal with them… or find a more creative solution. Their laser beams do a high rate of damage per second however their turn speed is limited, presenting a possible weakness. And those are only the invader drones. There are an assortment of other enemies each with their own behaviors, weaknesses and challenges. From a virus that corrupts what it touches to an electric ball that dodges bullets as it hunts you. Each belonging to specific challenges, however there are more yet. Patrol drones which spawn on the Cube map. Designed as training bots, these patrol drones have extra shielding but an exposed vent port on the back. Mainframe The city at the center of Neon Valley. Here one can find a variety of features, however most are locked for gladiators. For security reasons a multi access pass is required. Gladiators can earn these through The Gates. Challenges are designed as minigames, variations on main game modes plus a waypoint race, they are challenges to test the users ability. Training the users for the games ahead.  Access will unlock customization options, sampling new technologies from The Dragons and more. Lets just say, everyone has to earn their way in... One way or another.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/793280/header.jpg?t=1579362880",
    "Price": 14.99,
    "Developers": "Daydream Productions",
    "Publishers": "Daydream Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_e9b88ff01c5debd7965a4476ffd98a4a492e2598.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_cf777b66d81c3301f197d76d4429c72b676d3e27.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_3da3bd7daebf1be132296df3ed0995c7878b7843.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_eba1a1080c8437febe2ed2a37ac71bc418aaf301.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_cecc1026d16c0672c4c5e6f05b3679e705f22873.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_4b303b95a1cb9590bbd49596ab7e24b1d14e4934.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_872a824fdb2f950e8c1c9ae7dc69c3120c12650f.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_c68feac406162f615b90a288420c9295d0962903.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_27272fe2617cb3803439063b2eaf5672ba81911c.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_716aa09b6dbc929ab5dec3fbf0ed629fe6fd00b6.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_e86a06106a280118639d9550f762c6fcfbbd56be.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_3f526f738a68374e6b7069d4bd6ca362713c641e.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_cec76302aee10ebe5f1400332a33a0576d87dbf0.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_e2b4f54ee0048e280ec9ad4fea7040ac80f073ce.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_cb28c8f3456a1f37051a2d2e4d91cdc53464f230.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_1229980e6c12ffbe1ad0a94719598a597dd9fc9e.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_55df5d754d11391196c770ce06ab2375f78aaf72.1920x1080.jpg?t=1579362880,https://cdn.akamai.steamstatic.com/steam/apps/793280/ss_1d09ede36157916b7e69f7528867e94fb2e6523d.1920x1080.jpg?t=1579362880",
    "Slug": "neon-valley-revenge",
    "Meta Title": "Neon Valley: Revenge: Feb 28, 2018, Daydream Productions ...",
    "Meta Description": "Looking for information on Neon Valley: Revenge? Check out the release date (Feb 28, 2018), developer insights from Daydream Productions, and a complete...",
    "Alt Text Image": "Official header image for Neon Valley: Revenge game - Steam 793280",
    "Canonical URL": "https://gusku.site/game/neon-valley-revenge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Neon Valley: Revenge\", \"description\": \"Looking for information on Neon Valley: Revenge? Check out the release date (Feb 28, 2018), developer insights from Daydream Productions, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Daydream Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daydream Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/793280/header.jpg?t=1579362880\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}