{
    "AppID": 1465110,
    "Name": "Nihariely’s Spatial Adventure",
    "Release date": "Dec 3, 2020",
    "About the game": "A unique approach of gameplay that mixes resource management and old school arcade features, explore the asteroid belts in the solar system of Aldebaran. Story In the Aldebaran solar system there are the remains of a civilization fading away, with the survivors barely being alive thanks to prolonged hibernation capsules activated in all of their planet. However, the state of decay will make those eventually fail; Nihariely must awake the survivors before is too late, since no one else has been able to rescue the last memory of a forgotten civilization. Key features You can choose the order of the progression for the main levels. Each main stage has a different arcade or puzzle challenge to solve while the exploration for resources features procedural generation levels of asteroid fields and starships to loot. The exploration part consists of three phases that use a variation of gameplay: 1. Preparing the stats’ strategy of the exploration: Here, Action Points are used to upgrade resources for the ship and for the character; You will get more action points the farther a destination is. 2. Exploring the asteroid belts: This is a 2d top down perspective of an asteroid field, with decent range level of difficulty; the shields protect the starship from collisions and the speed amount makes faster the discovery of all resources in the zone, but at expenses of being more dangerous. 3. Looting an abandoned cargo starship for resources: Once it is found, Nihariely will have to explore it by her own, the movement consumes calories and those are also crafted in the first phase exploration. The more caloric unit she has (water and food units) she will have more range to explore, however, if you miscalculated the strategy she could be trapped inside a doomed starship! A big part it is focused on collecting loot to progress in the game and getting upgrades to make easier the advance in the main campaign; some will help you in the explorations or make certain tasks faster to perform, those are optional too. The best feature The music! the OST took a lot of investment; the price of the game does not represent all the work that went into it. The use of headphones is recommended to capture the audio effects intended. Gameplay structure There Is just one Level of difficulty. The duration of the game is very unclear since it depends on the skill set of the player and the understanding of the game; the media is around 4 hours. The best dev speedrun for this game is 2:29 (using the best paths and combinations). The main puzzle theme for the game is “memory”; a lot of the development is based on memory skills. For example, there is no inventory system as such but limited counting information that usually has to be keeping in mind before plaining an exploration. Game over means that you will lose all unsaved progress and the game does not have auto-save; you will need to collect diskettes or energy to make save files, which is part of the gameplay: If you feel “confident” enough there is no need to do it at all, of that way, the permadeath is relative (depending on if you saved or not). There are no enemies to fight (instead you had to calculate times and making decisions).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1465110/header.jpg?t=1617657503",
    "Price": 4.99,
    "Developers": "Artificer Creator",
    "Publishers": "Artificer Creator",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_436e20c272c6ffda4b6b2c7514810ea10a53dafb.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_0b6d5427e8ed390b79452a545a428a992b8a5375.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_b3f1a57a628a4e4c554f6441a160aede41008892.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_1277f1c457fe9f7fa3d20f75f92fa9a10fde2806.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_e0d26b88156778993e98f839bbb6454f35ec9efc.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_62df007901e780dc35811cf5918623a514e0cc0c.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_369923c88be7ce5424fd53de775b2a5b85c01468.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_006f036e875609eea9208e5ad716ef51abdbccdc.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_d69fb569cc242ddde2699a1d37920aab35e1261a.1920x1080.jpg?t=1617657503,https://cdn.akamai.steamstatic.com/steam/apps/1465110/ss_8794ca1f7bbec2ad5fbbe7871b4eff6982d53989.1920x1080.jpg?t=1617657503",
    "Slug": "niharielys-spatial-adventure",
    "Meta Title": "Nihariely’s Spatial Adventure: Dec 3, 2020, Artificer Cre...",
    "Meta Description": "Looking for information on Nihariely’s Spatial Adventure? Check out the release date (Dec 3, 2020), developer insights from Artificer Creator, and a com...",
    "Alt Text Image": "Official header image for Nihariely’s Spatial Adventure game - Steam 1465110",
    "Canonical URL": "https://gusku.site/game/niharielys-spatial-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nihariely\\u2019s Spatial Adventure\", \"description\": \"Looking for information on Nihariely\\u2019s Spatial Adventure? Check out the release date (Dec 3, 2020), developer insights from Artificer Creator, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artificer Creator\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Artificer Creator\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1465110/header.jpg?t=1617657503\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}