{
    "AppID": 683890,
    "Name": "Operation Sheep Defense",
    "Release date": "Aug 2, 2017",
    "About the game": "Brief Summary Operation Sheep Defense is a tower defense game. Your mission is to protect sheep from enemies. The enemy will try to capture these sheep. Fight off the enemy with defensive turrets. Unique Game Mechanics Each level takes around 6 minutes. Progression is fast and there are no boring moments. The number of enemy units can be huge, later levels can have over 3000 units that enter the level in under 6 minutes. Levels are dynamic, the enemy will use bulldozers to create new roads. Enemy behaviour is not scripted, every unit and bullets is simulated. Gameplay You will need every tactic you can think of, because the enemy can be very intelligent! Instead of simply choosing the shortest path, they will try to avoid towers. They will even build new roads using bulldozers. Every level will require a different approach. The game has over 80 balanced levels. Levels vary from large open areas, levels with multiple entrances, mazes and small fast paced levels. Place your towers at tactical positions in each level. In open areas you can shape the path that the enemy will have to take to get to the sheep. Upgrade towers to make them stronger. If a sheep has been captured, the enemy has to escape with the sheep. You still have some time to take the enemy down. There are seven different towers you can build. Each tower has its own strengths and weaknesses. Build small cannons for early defense. Small cannons are cheap to build but not very effective. Build the gattling gun to fight off stronger enemies. The gattling gun is more effective against all kinds of enemies. The rocket launcher does great damage to larger units and bosses. The fastest enemies can be stopped best using the laser tower. To make all towers more effective, use the slowdown tower to stall enemies. The flame thrower can be used against large enemy groups. Finally, you can use the big gun, which is slow but incredibly powerful and can target almost the entire map. Multiplayer There is local multiplayer which you can play on a single screen or tv. Play the entire campaign in coop mode, or play one of the coop missions. Many levels are adjusted and rebalanced for coop mode. For controls, choose between mouse, keyboard or any connected gamepad. The economy can be shared, individual or reversed between players. Features * Campaign with 80+ Levels * Local Multiplayer Coop * Level Challanges * Level Editor * Advanced AI * Gamepad support * Long Range Weapons * Pause and Fast Forward * 7 Upgradable Towers * 9 Sheep Are you as the commander ready to take on this challenge?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/683890/header.jpg?t=1504297843",
    "Price": 0.99,
    "Developers": "spdr870",
    "Publishers": "spdr870",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/683890/ss_083de0a40e5dd47ae55c58cf5f38d6a5ff5b2750.1920x1080.jpg?t=1504297843,https://cdn.akamai.steamstatic.com/steam/apps/683890/ss_41e87f9357a3315f526c46d1f3e84128294650ce.1920x1080.jpg?t=1504297843,https://cdn.akamai.steamstatic.com/steam/apps/683890/ss_60b42aa323133fc6d601a1acb473a17d7dd4e2d0.1920x1080.jpg?t=1504297843,https://cdn.akamai.steamstatic.com/steam/apps/683890/ss_e397197f87d9dd2b4a0c8a246f7777371dd11d26.1920x1080.jpg?t=1504297843,https://cdn.akamai.steamstatic.com/steam/apps/683890/ss_c777c40e2b2f74b7c94095481ecf8551b8e88d98.1920x1080.jpg?t=1504297843",
    "Slug": "operation-sheep-defense",
    "Meta Title": "Operation Sheep Defense: Aug 2, 2017, spdr870 and Full Ov...",
    "Meta Description": "Looking for information on Operation Sheep Defense? Check out the release date (Aug 2, 2017), developer insights from spdr870, and a complete game summary.",
    "Alt Text Image": "Official header image for Operation Sheep Defense game - Steam 683890",
    "Canonical URL": "https://gusku.site/game/operation-sheep-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Operation Sheep Defense\", \"description\": \"Looking for information on Operation Sheep Defense? Check out the release date (Aug 2, 2017), developer insights from spdr870, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"spdr870\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"spdr870\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/683890/header.jpg?t=1504297843\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}