{
    "AppID": 1905940,
    "Name": "Painting VR",
    "Release date": "Apr 14, 2022",
    "About the game": "So you want to be a virtual artist? Pick your favorite colors, dip in your brush and start creating! Painting VR is a +10.000 square feet virtual painter’s studio with an unlimited supply of paint, inspiring tools, and canvases of all sizes. Once finished, you can share your work with the Painting VR community, or even the world! Play around and feel the relaxing satisfaction of putting bright, fresh paint on a canvas. First, teach yourself the basics of colors, painting, and composition. Then, sharpen your skills by experimenting with the tools and techniques at hand and become part of a new wave of digital artists—all without having to clean up afterward. With a standalone headset, you can take your studio wherever you want! Relax, Get Inspired, Create Painting VR combines inspiring visuals, audio, and haptics to immerse you in a relaxing and satisfying creative experience. We keep the threshold as low as possible to ensure everyone’s painting within seconds. Dive deeper and you’ll find an array of possibilities to develop your painting skills. Thanks to the realism of the painting simulation, your virtual skills also work in the real world. In-Game Web Browser Need guidance and inspiration? The fully functional web browser is your personal trainer and media station in Painting VR. Listen to music while you paint, follow any tutorial on YouTube or join our Discord and look for tips and help there without ever leaving your virtual studio. Customize &amp; Save Your Studio We’re artists ourselves, so we know it’s essential to feel at home, comfortable and inspired. With Painting VR, you can change up your painting set and save it the way that works best for you. Put your favorite images up on the walls and personalize your workplace. It’s your universe, ready for your ideas to come to life, and filled with pieces to be proud of. Easy Paint Mixing Mix your paint on the canvas, a palette, or start experimenting by pouring a bucket of paint into another. There’s a way to experiment with colors for everybody. A Wide Selection of Brushes &amp; Tools Big brushes, fine brushes, precision brushes, splatter brushes, spray cans, paint rollers, we have it all. With a customized drill, you can combine those tools in ways you never imagined possible. Well, they’re possible, theoretically, but the real-life consequences could turn out pretty disastrous. A New Way of Painting Instead of merely simulating what already exists, we combine the ancient art of painting with tools and features that are only possible in the digital realm. Resizing the canvas while painting unlocks new possibilities. Be the master of your tools and adjust the brush settings with an easy slider menu. Best of all: there’s no undo in real life, but there is one in Painting VR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1905940/header.jpg?t=1651492525",
    "Price": 19.99,
    "Developers": "Oisoi",
    "Publishers": "Cybernetic Walrus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_4237d31e1361a095d845eaa94d737aa96fb1b8ad.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_8df65187e7382c0319c922d0f1a58c34700379c2.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_1748426b41df2c571fba5084124ab5d8303a5864.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_714d2a98d0f2e691f3b16f913310ff5efc1050a8.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_dab27b61280a1af8e593d2b3b64e27439d732661.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_973becbde5046bdbc818867b1c5b01db50baf23b.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_5f7c52e2219503702fe5f5323ff8119fe2d69bf5.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_0a11160eda75bd51c6237c8a324727da54aa099a.1920x1080.jpg?t=1651492525,https://cdn.akamai.steamstatic.com/steam/apps/1905940/ss_a887abe03cf014127869debe7a084d97080bb68c.1920x1080.jpg?t=1651492525",
    "Slug": "painting-vr",
    "Meta Title": "Painting VR: Apr 14, 2022, Oisoi and Full Overview",
    "Meta Description": "Looking for information on Painting VR? Check out the release date (Apr 14, 2022), developer insights from Oisoi, and a complete game summary.",
    "Alt Text Image": "Official header image for Painting VR game - Steam 1905940",
    "Canonical URL": "https://gusku.site/game/painting-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Painting VR\", \"description\": \"Looking for information on Painting VR? Check out the release date (Apr 14, 2022), developer insights from Oisoi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oisoi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cybernetic Walrus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1905940/header.jpg?t=1651492525\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}