{
    "AppID": 1102420,
    "Name": "Palette Wizard",
    "Release date": "Nov 14, 2019",
    "About the game": "Easily create or edit color palettes for your projects, replace colors in your images, sprites and designs. If you’re an artist, game developer or web developer and you need to create a color palette for your project quickly or edit one that you already have, then give this tool a try. Palette Wizard allows you to create color palettes from scratch. It will help you find analogous, complementary, and split-complementary colors and others with ease. You can load any image and extract colors from it using the built-in extraction function, then modify the palette as you wish. Use magic pens to create color ramps with no time! You can replace colors in the loaded image with colors created in the project and see the differences in real time. You can also sort and organize colors using various sorting options Supported palette formats: PAL Jasc, GPL Gimp, TXT Paint(dot)net, HEX, GML Game Maker Studio 1&amp;2, ASE Adobe Swatch Exchange Supported Image Formats: Loading: Png, Jpg, Jpeg Saving: Png If you encounter any problems or have a suggestion/request, please describe them on community forum, DM me on Twitter or send me an e-mail. Features: Create color ramps from two colors with ease. You can also slide all colors from ramp towards one of them using slider. Easy create random colors with different properties like (entirely random, randomize hue, randomize saturation, randomize value or random color which is close to current one). Easily create Analogous, Compliment, Split-Compliment, Triadic, Square, Tetriadic, Pentagram colors from existing ones (also works with multiple selected colors). Move colors as you like, select multiple and move multiple colors at once. Copy and paste individual colors or multiple of them. Colors are copied as HEX values so you can also copy/paste them from/to other programs. Duplicate colors (also works with multiple selected colors). Color picking by hand from loaded image or using draw picker. Color extraction from image. You can extract colors from any loaded image and you can set maximum colors to extract (16, 32, 64, 128, 256, 512). You can replace colors in the loaded image with ones created in the project You can save images with replaced colors. Color pickers RGB, HSV, HSL, LAB, HCY's, RGBs, HSVs, HSV/HSL Wheel (s means square) You can load palettes in the following formats: (PAL Jasc, GPL Gimp, TXT Paint(dot)net, HEX, GML Game Maker Studio 1&amp;2), ASE Adobe Swatch Exchange You can save palettes in the following formats: (PAL Jasc, GPL Gimp, TXT Paint(dot)net, HEX, GML Game Maker Studio 1&amp;2, PNG 8 px color squares), ASE Adobe Swatch Exchange Each menu or context menu option has its description on the bottom of the screen so you don't need any manual. You can load/save project to edit it later. Free drawing using Magic Pen Color adjustment pens Multiple color sorting options by hue, saturation, value, lightness, chroma, luminance, red, green, blue Distance based color sorting by RGB*, HSV, HSL, HCY', LAB distances Multiple color adjustments options Undo Color Blindness Emulation Tool (Three major disability types) Color Evolution Using Genetic Algorithm Color Evolution Using Cellular Automaton Magic Brush Trailer music credits: Stock Media provided by AZOVMUSIC / Pond5",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1102420/header.jpg?t=1574935071",
    "Price": 14.99,
    "Developers": "SmallBigSquare",
    "Publishers": "SmallBigSquare",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_8623b78605733f9e2f7f67d9c1f371d17e9a000d.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_9d1c43d0a0647578ae0e5bd67945971b57cb8449.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_aeab329c382c56e19a4505e1119cd8c295fe6367.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_2dd5727a0f872ff78ea2c1e769925f2fc3595135.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_cdada4929223632ab06b60e38de5ab717d83a7a9.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_9bb32b6d758de79cdd99eedbe0becb7f0015e20e.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_8f1718bb76128001c71fe32193e0e93b0ac1d52f.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_d9b6ef84c7ae0391f6823a2c2e9c9e6f0b0d95fd.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_10137bed27154d3ce17980fe4982597f93056655.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_c13e8c672aeea317af7b17103f2bd458db40656d.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_c19154dd7fd0658f76d3e18a11f5c1bd31c67745.1920x1080.jpg?t=1574935071,https://cdn.akamai.steamstatic.com/steam/apps/1102420/ss_e43ee7e848ecbee70e0029b2168ad9a15255faab.1920x1080.jpg?t=1574935071",
    "Slug": "palette-wizard",
    "Meta Title": "Palette Wizard: Nov 14, 2019, SmallBigSquare and Full Ove...",
    "Meta Description": "Looking for information on Palette Wizard? Check out the release date (Nov 14, 2019), developer insights from SmallBigSquare, and a complete game summary.",
    "Alt Text Image": "Official header image for Palette Wizard game - Steam 1102420",
    "Canonical URL": "https://gusku.site/game/palette-wizard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Palette Wizard\", \"description\": \"Looking for information on Palette Wizard? Check out the release date (Nov 14, 2019), developer insights from SmallBigSquare, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"SmallBigSquare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SmallBigSquare\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1102420/header.jpg?t=1574935071\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}