{
    "AppID": 575830,
    "Name": "rooMaze",
    "Release date": "Mar 3, 2017",
    "About the game": "rooMaze is a first person hardcore roguelike with voxel graphics and procedurally generated levels! All of this is powered by Unreal Engine 4. Don't let acute-angled cubes deceive you as behind a simple visual style lies the all-consuming hardcore. Features: Random generation of levels, rooms, objects and everything else. Voxel graphics and the dark dungeon atmosphere. Several branches of character «leveling up». Unusual combat system. Crossbows in each hand – cool! A lot of enemies and items. Deadly traps - watch your steps! Character damage systems: burns, bleedings, fractures – you're in trouble! Many hidden secrets. Barter system - in a dark damp dungeon nobody needs your shiny coins. HardCore. Mushrooms! Though this is our first project and there were only two developers on a team, we did our best to create something special by mixing a good old blend of RPG and Action and adding up some peculiarities: An unexpectedly dark and oppressive atmosphere , where light becomes a useful resource just like mana and health. A randomly generated dungeon , where rooms are not just cells full of enemies - we tried to make all of them meaningful. We managed to get around our least favorite senseless narrow halls which are quite frequent in other video games with randomly generated levels. And we worked hard so the layout of caves doesn't look like a playing field for noughts and crosses. It also goes without saying that caves contain randomly generated visual and practical content like enemies, traps etc. Traps : lots of 'pleasant' surprises are waiting for you in the dark ready to be activated by trip wires or floor press plates. Classical flying darts, whirling axes and maces, rooms rapidly filled with gas. A trap may cause painful holes in your body and there's almost no chance your bones remain safe and sound. Module damage of the main character : a burn on his arm means using it causes pain and a cracked leg will slow him down. A similar system is applied to enemies : while fighting with dungeon inhabitants you have to look for weak spots in their defense. An unusual combat system : you need to charge almost every strike as well as most skills need to be used with a specific type of weapon after its full charge. This system requires a player to get used to it. Though it may look not very dynamic, it allows to carefully adjust every strike. Barter trade : that's because nobody needs your shiny coins in a wet and spooky dungeon! The list of items includes wands, sticks, one-handed and two-handed crossbows, bows, swords, maces, shields and even some fire weapon. Keep in mind that you have to work hard to find all these items as just few things have remained undamaged ever since this place had been inhabited. rooMaze is an indie game; over a period of two years of its development we have only had teabags in our budget. Our experience was insufficient so at some moments we tried too hard in vain or we had to painfully give it up. However, we created that very game we ourselves can play with pleasure. If you're fond of exploring mysterious dark and full of secrets locations, adapting to unfriendly environment and overcoming any kind of difficulties then you may like this game! And remember: 'Mushrooms are close!'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/575830/header.jpg?t=1644244174",
    "Price": 0.0,
    "Developers": "ChairKilling",
    "Publishers": "Sometimes You",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_c5e0927ae8bf46febfc865b9761fa8171e9a0b71.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_2e51b8f3664dcc5510eeb4578b36a2eedc6ec67d.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_65d5f549d9a7622f690bf7c71cce32b131ddfd9e.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_d81f48373d99c039036edbec215ffc961ca3a60c.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_d92f9009b83d312b8958b78da7fc24918ebf109c.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_ac16116d80263fcfdd958ae0fca6e71f22e76d2b.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_5e5fa885519c9e7a30494394de6cf69215b7d513.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_10828ec260b555a65fbc656700279fa1cb84422a.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_a33706300eee569934e3e57cb7c85910d1e93976.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_329d3823241a1e922c26b4f3ac59214ebe9e36ef.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_ad300f0a2de4ed42c0713db0673ccdec3de8b578.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_a3eeb2178b220d7f952af9d6201861136c943f9b.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_db62fe63ae494352fee0abe4f578dcdffc26843e.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_ba3c7270553fdbd977f38d073b5146b64c8c8ce0.1920x1080.jpg?t=1644244174,https://cdn.akamai.steamstatic.com/steam/apps/575830/ss_00edc06d34df2a470e94404b805ff68245377e9a.1920x1080.jpg?t=1644244174",
    "Slug": "roomaze",
    "Meta Title": "rooMaze: Mar 3, 2017, ChairKilling and Full Overview",
    "Meta Description": "Looking for information on rooMaze? Check out the release date (Mar 3, 2017), developer insights from ChairKilling, and a complete game summary.",
    "Alt Text Image": "Official header image for rooMaze game - Steam 575830",
    "Canonical URL": "https://gusku.site/game/roomaze",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"rooMaze\", \"description\": \"Looking for information on rooMaze? Check out the release date (Mar 3, 2017), developer insights from ChairKilling, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ChairKilling\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sometimes You\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/575830/header.jpg?t=1644244174\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}