{
    "AppID": 1050160,
    "Name": "Sacrifice Your Friends",
    "Release date": "Jun 18, 2020",
    "About the game": "A Mad Party Brawler Sacrifice Your Friends is a 1- 4 players fast paced party brawler in a cute cartoon horror style. Use various weapons, battle your friends, grow your cult of the Old Ones and embrace insanity as you try to survive in a chaos of dangerously dynamic environments. A guided tour in the universe of H. P. Lovecraft Chaotic, fast paced, accessible but hard to master, Sacrifice Your Friends presents a fresh take on the H.P. Lovecraft horrific mythos that let you experience its stories with your friends. Take a tour of strange adventures and mysteries inspired by Lovecraft stories: Explore the depths of the Mountain of Madness, escape the fish-folks mob of Innsmouth, find your way through the catacombs of the Nameless City and much more. Grow your Cult and show your devotion Choose a Cult to offer your sacrifices and wake its Elder One. Unlock weapons with unique dynamics for exciting new ways to play. Turn your spoils of victory into silly player customization. Test your friends skills in multiple eldritch game modes and prove yourself the ultimate cultist of the Great Old Ones! Key Features Lovecraftian – Discover the mythos of legendary author H.P. Lovevcraft. Arena mode – Have at it with your friends in exciting arenas for 2 to 4 players. Sheer madness – Embrace madness and unleash devastating powers by transforming into the mighty avatar of a Great Old One. Locations – 16 unique dangerous arenas inspired by Lovecraft’s work. Fun for everyone – With simple controls and goals, everyone can join in. We know: we had our mothers test it out. Mastery – Don’t let the previous point fool you, however: the most competitive players of SYF will find countless ways in which they may fine tune their skills and dominate the arena. Physic based – Hits and explosions can send everyone flying! Couch and Online – Play couch, play online, or mix a little bit of both. Game modes – Deathmatch, Conquest, Tournaments, and more. Solo/Co-op story – The Miskatonic Travel Co. invites you to a selection of tours to explore the universe of H.P. Lovecraft like never before. Player customization – Discover new weapons, characters, accessories, arenas, and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1050160/header.jpg?t=1606865010",
    "Price": 19.99,
    "Developers": "Astrolabe Interactive Inc.",
    "Publishers": "Astrolabe Interactive Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1050160/ss_a2c051ea5ba72793067ca8d87b682b29720ceaea.1920x1080.jpg?t=1606865010,https://cdn.akamai.steamstatic.com/steam/apps/1050160/ss_1d20f36985b88fcf65f03458f6040fe5c2e10901.1920x1080.jpg?t=1606865010,https://cdn.akamai.steamstatic.com/steam/apps/1050160/ss_29bfb326c8153a76d8694137b610020dddad41c2.1920x1080.jpg?t=1606865010,https://cdn.akamai.steamstatic.com/steam/apps/1050160/ss_0c6e0962ff5f1de6ca1ed89f4e5fbab74714161b.1920x1080.jpg?t=1606865010,https://cdn.akamai.steamstatic.com/steam/apps/1050160/ss_4e6f5e62952f456b91f6e1dc8559f3cf25f4cb1a.1920x1080.jpg?t=1606865010",
    "Slug": "sacrifice-your-friends",
    "Meta Title": "Sacrifice Your Friends: Jun 18, 2020, Astrolabe Interacti...",
    "Meta Description": "Looking for information on Sacrifice Your Friends? Check out the release date (Jun 18, 2020), developer insights from Astrolabe Interactive Inc., and a ...",
    "Alt Text Image": "Official header image for Sacrifice Your Friends game - Steam 1050160",
    "Canonical URL": "https://gusku.site/game/sacrifice-your-friends",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sacrifice Your Friends\", \"description\": \"Looking for information on Sacrifice Your Friends? Check out the release date (Jun 18, 2020), developer insights from Astrolabe Interactive Inc., and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Astrolabe Interactive Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Astrolabe Interactive Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1050160/header.jpg?t=1606865010\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}