{
    "AppID": 381120,
    "Name": "Shoppe Keep",
    "Release date": "May 20, 2016",
    "About the game": "If you haven’t played Shoppe Keep yet, why not join nearly 100,000 gamers who are already enjoying this unique business management game, and create your own fantasy retail consortium? Shoppe Keep challenges you to shrewdly set the price of each item and watch the money roll in – but if your stock is too expensive, you will find your supplies shrinking as stealing increases! Stop Thieves quickly, with a swing of your sword or a zap of a lightning spell! (Or maybe both, if you’re really bloodthirsty.) Price your wares competitively and great adventurers will travel from miles away to your one-stop shop to spend their gold – the gold that they probably found conveniently placed on a cave floor! Shoppe Keep delivers deep gameplay mechanics in a memorable, tongue-in-cheek world. Gone are the days of testing the theoretical water – we’re now a fully-fledged, fully-opened store! We even have an inn! This building has been blocked off for some time, and many have speculated that it will be an Inn – well, the sneaky players were right! The Inn is best used at lower levels and a lower gold count. For a small amount of kPoints, you are able to unlock the Inn with a single table for four guests. An inn with a single table? What complete rubbish! Additional tables can be purchased by speaking with the innkeeper, as well as additional upgrades that will help your Inn deliver serious coin. Adventurers traveling through town might want to visit the Inn and enjoy some food and ale – if they haven’t found some randomly laying around on their travels already. We all know that fantasy worlds cater for their heroes – but with Shoppe Keep, you’ll be able to make sure that catering doesn’t equal ‘potato in a toilet’! Various members of four completely original and never before seen character classes will visit your store, including hardened warriors, magical mages, sneaky rogues and wise druids. (As you can tell, we’re taking this description text VERY seriously!) Each of these character types will seek to purchase items relating to their unique skill set - a warrior will be hard-pressed to take a flimsy magical robe into close quarters’ battle, for instance! Mages, however, will be perfectly happy with a wooden stick. It’s ‘magical’, or something ridiculous those absurd mages believe. Will you be able to accommodate for all four classes of customers? You have a completely unreasonable clientele to add pressure to your role as a Shoppe Keeper. After a day of heroism, beating up goblins and even battling the great ol’ Dragonclaw, your customers can be just a little short-fused. This means your displays can be spoilt and your tables may be damaged by angry customers! The renegade ‘heroes’ are not too worried about bringing in dirt from the street either! However, help is at hand! As the owner of the store you’ll be armed with various exciting tools for combating these issues. The mighty wooden broomstick will sweep away dirt brought in from your customers, and the great hammer will repair furniture damaged by these ‘extraordinary’ visitors. A few sweeps and a couple of swings means that your shop will be in tip-top shape. Grow your business, and you can employ an army of ‘Helper Bots’ to take care of this for you – the cutting edge in imaginary technology that totally exists. Set your prices too high and your customers may think twice about investing their hard won (or stolen) gold in your shop. They’ll take the plunge and attempt to steal stock right under your nose! With no CCTV available in ye olde world of Shoppe Keep, you have to rely on your combat skill! A sharp swing of the sword or the zap of a magic spell can make quick work of these pesky Thieves. But be cautious not to hit any innocent bystanders or you’ll suffer a monetary penalty, as well as a life riddled with guilt! Not to mention the hideous moral conundrum of whether or not to tell your family or- look, just don’t kill innocent people. And let’s not forget the ferocious Barbarians! They live on the outskirts of the city, looming like an ancient race of organic-synthetic hybrids that invade the gal- wait, wrong game. Regularly invading the town, Barbarians will cause as much damage and destruction as possible! They will even fight you directly if you try to stop them. Eliminate a few dozen Barbarians and they’ll invite a much… larger friend to come and visit you. But what will you do with all the bodies? Unless you wish to display the corpses as examples to your customers, you monster, you’ll need to use either the broomstick or the grinder. It’s tough running a shop (especially one that may or may not be the venue of a murder-fest); there are not enough hours in the day to go out and procure new items for yourself. Thankfully, you can employ a Champion, unlocked via the skill tree. Select a class, equip the Champion with your finest armour and weapons, and send them out to bring home rare new wares. Despite that awful half-rhyme, some of these items can be sold, some are junk and others can be crafted into more powerful gear. Your Champion will need to gain experience, just like the fantasy heroes you’re familiar with. During their first outing, they may fall in battle (and regret not saving more recently!), and whilst they will not return with any new goods, the experience will have taught them valuable skills that will improve their chances next time. ‘Helper Bots’ are your robotic staff team. The MK III charts the latest iteration of this tech, increasing the artificial intelligence of this mechanical chap. We all knew that true AI technology would be created before CCTV – it was inevitable. The ‘Helper Bot’ has three duties; zapping Thieves who attempt to steal from your shop, picking up items that customers may have thrown to the floor, and restocking items back on the shelves. You can purchase several ‘Helper Bots’ to, well, help run your shop. Make a living for yourself in a tongue-in-cheek fantasy world FEATURES Make a living for yourself in a tongue-in-cheek fantasy world Manage your own Shoppe, from ordering stock to setting prices Design your own Shoppe layout by ordering tables, shelves and weapon racks The world of Shoppe Keep reacts to your every Shoppe decision, including prices and stock quality Unlock new abilities and perks in the skill menu, including alchemy, harvesting, and the capability to own a grinder and a high tier stock. We’ll let you decide what to do with the grinder Use the ‘Helper Bots’ to collect items thrown down in disgust by customers, zap Thieves and restock items Create a Champion, select its class and send them out on grand adventures Arm yourself with a sword and magic spells to defend your Shoppe from cheeky Thieves and destructive Barbarians Maintain your Shoppe by using the hammer to repair furniture and the broom to sweep away dirt, as well as the occasional corpse The world cycles through 4 seasons, each featuring a most wanted item. Frost Resists potions sell best in Winter, for example. Other Titles From Excalibur /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/381120/header.jpg?t=1645007873",
    "Price": 4.99,
    "Developers": "Strange Fire",
    "Publishers": "Excalibur Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_73ee6ab9f4a11e9a4774d9f3a250a58fac797c57.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_808519c7cd2979cd886c335d3f1ebe31adf78808.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_23cc94b27a7257d42aeab334994b031c53afb1c9.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_10a4600de5c081cf1faeb078fa762ae8709ef7a1.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_bdaec31af3e6f75c187f3a628beb09352c786bdf.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_f86e5c55258d9ac1d5a07e9d860729d33099ba44.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_874d52e33a4ffc7e53edb4332267dee6b1e27ffa.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_40fc4c07081a32b307b26e8a9369b3de75a1dbee.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_bc531949d1cc4b75f656bd2e316dfc9401207818.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_8e3335ed4582683244ed5ffe3f0d927df4f3ff0b.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_07e6a89639e85fa3a0b1b35f8fed0c98fce2ea5d.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_dfcebe105ef3f66965c92731175ec34f884c7672.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_d35083ac5062effb3412db046cb8af93b83a3d08.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_4679fa4f01c22b5e3a3242730259ac90eeca6ac7.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_bca6fd98678f7e75af628e9712d93609987d6bce.1920x1080.jpg?t=1645007873,https://cdn.akamai.steamstatic.com/steam/apps/381120/ss_9a5ae1ec08a79fae12f6b8a660878b076090706c.1920x1080.jpg?t=1645007873",
    "Slug": "shoppe-keep",
    "Meta Title": "Shoppe Keep: May 20, 2016, Strange Fire and Full Overview",
    "Meta Description": "Looking for information on Shoppe Keep? Check out the release date (May 20, 2016), developer insights from Strange Fire, and a complete game summary.",
    "Alt Text Image": "Official header image for Shoppe Keep game - Steam 381120",
    "Canonical URL": "https://gusku.site/game/shoppe-keep",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shoppe Keep\", \"description\": \"Looking for information on Shoppe Keep? Check out the release date (May 20, 2016), developer insights from Strange Fire, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strange Fire\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Excalibur Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/381120/header.jpg?t=1645007873\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}