{
    "AppID": 1646560,
    "Name": "Sweet Desire 2",
    "Release date": "Aug 13, 2021",
    "About the game": "Hentai game «Sweet Desire 2» consists of 10 levels! In each level a hot girl with beautiful body is eager to play with you! Click on the picture to earn hearts. Buy improvements (poses on the right) to satisfy your girlfriend and move to the next level. Collect flying bonuses: big heart gives you points, clock increases validity of improvements. When the flask with a level of girl satisfaction is full, then the girl takes off her clothes! «Sweet Desire 2» is created to satisfy all kinds of fantasies! You can undress the following girls inside the game: — Maid. (A master of the house is hiding with a pretty housemaid in a big house while his wife is out. The maid is shy, but she feels happy when the master tries to grab her. The man is persistent and longs for a cute girl. Hurry up to satisfy the maid before the wife finds out!) — Sportswoman. (An athletic girl with a beautiful body came to the gym, where, as she thinks, there is no one. She is so hot and sweaty that she decides to change her clothes right in the gym. Luckily, she can’t see you!) — Geisha. (Beautiful geisha is bored, she is waiting for you to play game of strip. She is a very good player! And if you are good enough, then she will let you touch her. Hope, that luck will be on your side!) — Squaw. (You came to the beach and found a very attractive squaw in national clothes, with tattoos on her body and with feathers in her hair. She is sunbathing, and when she sees you, she starts to smile and be embarrassed. You begin to stare at her and can’t hide your interest in this unusual beautiful girl. The girl seems to have a crush on you too! She winks at you and call you to her. Looks like something spicy is coming!) — Dark skinned girl. (A lonely man is walking near the pool. Suddenly he sees a very attractive girl with dark skin. He has never seen dark skinned girls in his hometown so, he is very curious to at least talk to this unusual girl. The girl is in this city for only one day and, moreover, has never been with a white man. Despite the fact that they are in public space, boy and girl cannot overcome the desire for satisfaction from each other!) — Nun. (A pretty young nun was alone for a long time. Now that no one is around, she decides to satisfy herself on her own. You are sitting in the next room and suddenly you hear inviting sounds and sighs. Trying not to reveal yourself, you hide and spy on the hot girl!) — A girl by the sea. (You look from a cliff to the sea and a passing ship. Suddenly you see that a nice girl is sitting on the shore. She is going to swim, but the girl is so carried away by her body that she even decides to take off her swimsuit. She starts touching herself, and you can't wait to see how it ends!) — University student girl. (A very beautiful student girl is sitting right opposite you in a subway car. She chats with her friends and laughs. She looks around the subway car and you both realize, that you are alone there. This naughty girl wants to show you something underneath her clothes!) — University classmate. (Your classmate asks you to help her prepare for the exam. You feel lonely and agree to study together. After a long time learning together you are both tired, but you finally learned exam material. She is very grateful to you and she wants to get away from the textbooks and have fun. You don’t expect that, but she suddenly lies on your bed and starts to undress. Will you join her?) — Tanned girl. (You come to the beach and want to relax and sunbath. Unexpectedly, a lovely girl with long red hair asks you to cream her body. You help her with a great pleasure, you touch her soft and smooth skin. You want to touch her more, but you need to stop... The girl smiles at you and a spark runs between you. She wants the same, but this girl is not that simple! What a toy does she have in her purse?) You should definitely play the game «Sweet Desire 2» to satisfy your sweet desire and to feel the story of every girl!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1646560/header.jpg?t=1635935033",
    "Price": 2.99,
    "Developers": "SweetGamez",
    "Publishers": "SweetGamez",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_f21dfe5b757ca91ad32ea35e5e1d43753ba497e9.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_19ecbf2bef6387284a5e116057a83affab2c7940.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_6e2126c0e7f4db899cdcc96dcff8b1e3d6347a8e.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_37010ee673a29ed4d0f9409c91ca96f11ecb897f.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_5023796fe37d5d958026d8a775413544dd48636f.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_ff3835ab95a6904f4795119648ab536727a23148.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_12235552784f0342fe835ac2c8c1c243507d10e9.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_2264d07f838628767607f80e6f0e47a1420b4531.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_4b8497299ba3ed7e7d661de190fbde0aec29bfc1.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_f7d00e16a58b2394a96c3a10a234ebb12aa4f96b.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_941a3dfe88958a4a65babc298d5396374daeb281.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_0d395703cae1ff2b2b6da7e627245c4354233854.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_6592cb901f8177c9912dbc6dde0f0fa4a00bf451.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_695fc9fad772031bf503ae452948926c8ec8edb9.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_d7c4d82045eaa3426e548e9b52f62cebc234bb8a.1920x1080.jpg?t=1635935033,https://cdn.akamai.steamstatic.com/steam/apps/1646560/ss_2fe58c917e1ca8d763bdacf93db83120ca864ffb.1920x1080.jpg?t=1635935033",
    "Slug": "sweet-desire-2",
    "Meta Title": "Sweet Desire 2: Aug 13, 2021, SweetGamez and Full Overview",
    "Meta Description": "Looking for information on Sweet Desire 2? Check out the release date (Aug 13, 2021), developer insights from SweetGamez, and a complete game summary.",
    "Alt Text Image": "Official header image for Sweet Desire 2 game - Steam 1646560",
    "Canonical URL": "https://gusku.site/game/sweet-desire-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sweet Desire 2\", \"description\": \"Looking for information on Sweet Desire 2? Check out the release date (Aug 13, 2021), developer insights from SweetGamez, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"SweetGamez\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SweetGamez\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1646560/header.jpg?t=1635935033\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}