{
    "AppID": 1674820,
    "Name": "TFC: The Fertile Crescent",
    "Release date": "Mar 29, 2022",
    "About the game": "TFC is a classic base-building RTS inspired by the struggles of growth, advancement, and conquest in the cradle of civilization. Establish your village near fertile lands, and balance your food surplus against the size of your civilian and military might, as you build your village. Food is responsible for more than just feeding your troops. It determines the rate your population grows, and how quickly you can gain Knowledge Points. Keeping your village fed will ensure your prosperous expansion, but allowing your farms to be compromised can bring even the strongest economies to their knees. Inspired by the real history of the Near East Bronze Age era, TFC utilizes classic RTS elements while offering a unique perspective for the genre. Taking technological limitations and advancements into account, players will need to carefully consider how to spend their precious Knowledge Points, as they explore the Village Improvements that are designed to enable players to quickly counter an opponent’s strategy. Try Different Single Player Modes Learn to set up your economy in the fully voiced tutorial. Settle on the plains of Mesopotamia, and survive the invasions by the mountain nomad tribes in Horde Mode. Battle it out against the AI in Skirmish. All this on different difficulty levels so that you can adjust the challenge to your own preferences. Strategic Options From The Beginning Heavily inspired by the giants of the genre, TFC looks to expand on the mechanics of its contemporaries in interesting ways, giving players multiple strategic actions to explore from the very beginning of a match. There are multiple paths to victory, and players can quickly adapt their strategy to respond to enemy actions. How well players leverage this freedom will determine whether they experience glorious victory, or crushing defeat. Consequential Fertility Mechanic Food is the foundation of every successful village. Locate fertile ground and build your village around it to ensure that there is enough to sustain your growing population. Balancing your food surplus against your villagers and growing military is important, and protecting your farms is critical if you want to keep your village alive. Likewise there’s no better way to demoralize your opponents’ populations than by destroying their farms, and decimating their economy. Advance Your Village Increase the strength of your village as you explore Village Improvements. TFC features a collection of powerful improvements that allow commanders to spend points to quickly react to their enemy’s advancements, or perhaps create a window of opportunity to strike. With various ways to boost your economy and military, your strategic options are always clear to understand, and easy to implement. Play Online With Up To 4 Players An AI can be quite the challenge, but nothing can replace a real player. Available at launch, battle it out with up to three other commanders in order to prove who is the best at managing their village, army and food supplies. Challenge your friends or complete strangers, and visit our Discord to find new rivals. May the most prosperous village win, or perhaps the smarter commander? Everything is in your hands!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1674820/header.jpg?t=1655881379",
    "Price": 14.99,
    "Developers": "Wield Interactive",
    "Publishers": "The Knights of Unity",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1674820/ss_9a06cb4ddc7e5a7c426955e4b54ce6fe2854c287.1920x1080.jpg?t=1655881379,https://cdn.akamai.steamstatic.com/steam/apps/1674820/ss_03d346e97c34be11d9db5aaf46247b0319b528b9.1920x1080.jpg?t=1655881379,https://cdn.akamai.steamstatic.com/steam/apps/1674820/ss_5d346946ea83143d0f6edf6da3f10b990133561e.1920x1080.jpg?t=1655881379,https://cdn.akamai.steamstatic.com/steam/apps/1674820/ss_ef596880577a9a81a3816aa678191202b2fb42ad.1920x1080.jpg?t=1655881379,https://cdn.akamai.steamstatic.com/steam/apps/1674820/ss_fe39388a4b8e800e2465482af99c0ad7ce6efdeb.1920x1080.jpg?t=1655881379,https://cdn.akamai.steamstatic.com/steam/apps/1674820/ss_f742f39836d913a5b6c6ae9e02a783a2e4c6ac5a.1920x1080.jpg?t=1655881379",
    "Slug": "tfc-the-fertile-crescent",
    "Meta Title": "TFC: The Fertile Crescent: Mar 29, 2022, Wield Interactiv...",
    "Meta Description": "Looking for information on TFC: The Fertile Crescent? Check out the release date (Mar 29, 2022), developer insights from Wield Interactive, and a comple...",
    "Alt Text Image": "Official header image for TFC: The Fertile Crescent game - Steam 1674820",
    "Canonical URL": "https://gusku.site/game/tfc-the-fertile-crescent",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TFC: The Fertile Crescent\", \"description\": \"Looking for information on TFC: The Fertile Crescent? Check out the release date (Mar 29, 2022), developer insights from Wield Interactive, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wield Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Knights of Unity\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1674820/header.jpg?t=1655881379\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}