{
    "AppID": 1181830,
    "Name": "Urtuk: The Desolation",
    "Release date": "Feb 27, 2021",
    "About the game": "Urtuk is an open world, tactical turn-based RPG in a low-fantasy setting. Guide your band of adventurers through the ruins of an ancient world. Recruit new followers, loot the corpses of your fallen foes, and do your best to survive in this harsh and unforgiving realm. Features Survival RPG with focus on combat and open-world exploration in a dark fantasy setting Turn-based, tactically rich combat on large maps, with multiple environmental factors and a carefully crafted class/skill system Procedurally generated survival campaign Extract character upgrades directly from your fallen enemies All graphical assets are hand drawn, from characters, monsters and objects, to the world map and battlefields Dynamic battles Ram your enemies onto spikes or over high cliffs! Shield your allies and counterattack your enemies when they strike. Use your archers for ranged support while performing melee attacks. Or execute one of many possible combo attacks ! Ram your enemies into environmental hazards Off you go! Characters Extract skills and traits from fallen enemies and apply them to your units! These custom abilities can totally change a character's role in combat. Extracted abilities include pushing the enemy on a critical hit, retaliating when being hit, avoiding a lethal strike, and performing a lifestealing counterattack against your foe! Your characters also learn new skills when executing specific actions in battles. Pay attention and be rewarded! Story The game world is a place of toil, suffering and darkness. There are no elves, dwarfs, dragons or other classical fantasy creatures. There are some light magical elements, but no overwhelmingly powerful sorcerers either. Many centuries past, Giants roamed the world, living peacefully alongside humans until the war between the two species left the Giants extinct. Some years ago, a cabal of scientists discovered a process to extract the Life Essence of the ancient Giants from their bones. This mystical fluid promised to cure many different diseases, mend grievous wounds, and perhaps even halt the aging process. Unfortunately, instead of improving the health of the subject, very often the serum would have the opposite effect, inflicting a mutation or lethal disease. Until the exact nature of this wondrous medicine can be determined, experiments on unwilling subjects continue. The story begins when the main character, Urtuk, escapes from the Sanatorium, a facility where these experiments are carried out on abducted commoners. Urtuk suffered a severe mutation from his exposure to the Life Essence, and with every passing day his health worsens. Now he wanders the world in search of a cure. Unless he can find a way to counter his evolving mutation, Urtuk must eventually die. For a quick video introduction of Urtuk, please head to the screeenshot/video section and select the second video. It is a quick intro to combat mechanics in the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1181830/header.jpg?t=1632066434",
    "Price": 19.99,
    "Developers": "David Kaleta",
    "Publishers": "David Kaleta",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_b92727c13a5cccbc7a2e0e7d83d240b05ae3d1b0.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_e104dc28382e1c2221399d16613de7e96d5de19e.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_9f34c8e2c50d9aafe29037c3b9e7dcba69dd5039.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_6da1abf532062f721aa01e68af811177f469b44a.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_3c3ad6ee85ea786bf6f795a4ef233886dd427f94.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_b805973242144f21fae4a52286b1f3236f41523b.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_9c294c6a09eafa05d19523ae1a8b66a96614bbb4.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_f10ec297c72450c507096ad66c01549e434da43a.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_8d5d6b78fe6506d21d756c5d7f9c133cd6500242.1920x1080.jpg?t=1632066434,https://cdn.akamai.steamstatic.com/steam/apps/1181830/ss_4549b4411239f52ac3c15a41c5bd66de48e34d0e.1920x1080.jpg?t=1632066434",
    "Slug": "urtuk-the-desolation",
    "Meta Title": "Urtuk: The Desolation: Feb 27, 2021, David Kaleta and Ful...",
    "Meta Description": "Looking for information on Urtuk: The Desolation? Check out the release date (Feb 27, 2021), developer insights from David Kaleta, and a complete game s...",
    "Alt Text Image": "Official header image for Urtuk: The Desolation game - Steam 1181830",
    "Canonical URL": "https://gusku.site/game/urtuk-the-desolation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Urtuk: The Desolation\", \"description\": \"Looking for information on Urtuk: The Desolation? Check out the release date (Feb 27, 2021), developer insights from David Kaleta, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"David Kaleta\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"David Kaleta\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1181830/header.jpg?t=1632066434\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}