{
    "AppID": 767300,
    "Name": "War of Conquest",
    "Release date": "Sep 20, 2018",
    "About the game": "War of Conquest will place you in a single, wide-open world with thousands of other players, to develop your nation, compete for resources, and seek to capture the mysterious Orbs of Power. Along the way you'll be able to choose from a huge variety of technological and magical advances, forge alliances and rivalries, and become part of a community. Imagine open-world tower defense real-time strategy. This game is about founding a nation, developing its resources and abilities, and clashing with other nations over land and treasure. It is massively multiplayer, allowing thousands of players’ nations to occupy the same game world. All nations in War of Conquest co-exist on a single huge game map. To expand your nation or move it from one place to another means going around—or through—your neighbors. War of Conquest was designed around this aspect. A nation’s valuable assets are found not so much in the land it holds and the defenses it’s built, which are liable to be conquered, recaptured, rebuilt, destroyed and relocated over and over—but in the technological advances it’s developed, the resources it’s gathered and the alliances it’s engineered. The goal is to gradually build up your nation’s power, and your own skills, to the point that you are able to capture and defend the Orbs of Power—mysterious artifacts scattered over the landscape, remnants of a former age. As a nation advances it will make its way toward the east, where the most valuable resources can be found, to compete for the ultimate prize: the Orb of Fire. The basics of gameplay are very simple: just click on a square to attack it. But there are many layers of complexity and nuance that unfold gradually. Some examples: How one nation fares in combat against another depends on how their three combat stats compare: tech, bio and psi. These three stats have a rock-paper-scissors relationship, so that a decent tech stat would be very strong against a similar bio stat, but weak against a similar psi stat. With these relationships in mind, you’ll want to choose enemies whose specializations are vulnerable to your own. A large variety of different defensive structures can be developed, built, and upgraded, ranging from simple walls to towers that can launch massive counter-attacks. These can be arranged strategically to defend the Orbs and resources you’ve captured. Mid-level advances allow many of these defenses to be made invisible to your enemies, giving you the opportunity to set up traps and misdirections. Even these invisible defenses can be located, using Minesweeper-like tactics, and some can be disarmed by flanking. As a defender, you’ll want to make this as difficult for your opponents as possible. To attack and defend you’ll need to keep up healthy supplies of the game’s two main resources, manpower and energy. How quickly you generate these resources depends on the advances you’ve developed, and whether you’ve captured special map locations such as Fresh Water, Geothermal Vents and many more. How rapidly you generate the energy needed to sustain defenses also depends on your nation’s ‘geographic efficiency’, a measure of how well consolidated your nation’s territories are. This means you’ll need to balance expanding your nation against spreading yourself too thin. In addition to its holdings on the mainland, each nation also has a home island. Nations can earn XP and more by defending their home island and raiding other nations' islands, in a one-on-one matchmaking mode that is geared toward casual and solo players. War of Conquest is 100% free to play: all features and aspects of the game are open to all players for no charge. The in-game currency (called ‘credits’) can be used to buy temporary power-ups, hasten the building and upgrading of defenses, customize the appearance of your nation, and more. Credits can be obtained through gameplay by completing quests or capturing and holding Orbs, or earned by watching ads and completing surveys.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/767300/header.jpg?t=1586972159",
    "Price": 0.0,
    "Developers": "IronZog",
    "Publishers": "IronZog",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_0d8876a9db3572a1eb0704fdacd7ad7876689039.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_3437077de4906c91824ed38002b2e473ab288fef.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_6133e59d0653739c3d3c3b9007d9bf551980525d.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_79be7a5f8e8bd3cb279b63a6687f220b7a6a5beb.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_6d438e36a81bd00f1bcb2acde1f86c728698ebc1.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_1bea200b1856b536ae00d8f288d41785dea4421b.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_7731a51dbb2d00fa0a2f913045484b3d59b30453.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_71a081ac00f84581dfd8b4dbac2d15fe5371a244.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_808357b590a1330694911fbf36051c7f9df82503.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_a06290d7ffac5ce7f7125a499963f5fe4877fff7.1920x1080.jpg?t=1586972159,https://cdn.akamai.steamstatic.com/steam/apps/767300/ss_1f5a9c2e978c38a4a4a727297f948c853b5fd2c2.1920x1080.jpg?t=1586972159",
    "Slug": "war-of-conquest",
    "Meta Title": "War of Conquest: Sep 20, 2018, IronZog and Full Overview",
    "Meta Description": "Looking for information on War of Conquest? Check out the release date (Sep 20, 2018), developer insights from IronZog, and a complete game summary.",
    "Alt Text Image": "Official header image for War of Conquest game - Steam 767300",
    "Canonical URL": "https://gusku.site/game/war-of-conquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"War of Conquest\", \"description\": \"Looking for information on War of Conquest? Check out the release date (Sep 20, 2018), developer insights from IronZog, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"IronZog\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IronZog\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/767300/header.jpg?t=1586972159\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}