{
    "AppID": 1541710,
    "Name": "Wyvern",
    "Release date": "Mar 9, 2021",
    "About the game": "Wyvern is an Indie, old-school graphical MMO-RPG, inspired by games like Gauntlet, Nethack, and Ultima IV. Wyvern is a huge and diverse world: the game has been around 20+ years and is in continuous development. We are excited to bring the game to Steam, with new features and content. Gameplay The game features a top-down, tiled-based 2D view, with real-time combat and adventuring. An important part of the gameplay is the text output area, on the right. The game tells you in text what's happening, and you can also see chat messages and other information there. The game window also includes views of your spells, your inventory, your stats, custom views for other situations. Wyvern is a command-oriented game: There are hundreds of commands you can type: social commands and emotes, appraising and crafting, inventory management and more. You can bind commands to hotkeys using your entire keyboard. You can even create custom commands using aliases and macros to speed up your gameplay. The command system gives Wyvern unprecedented depth, power, and flexibility. Features Some of Wyvern's rich, exciting features include: 17 unique player races, from humans and elves, to fighting cats, giants, vampires and more Over 50 quests, many of them quite elaborate, with their own unique and powerful rewards A Builder Mode (level editor) that anyone can use to create their own areas A Guild system that allows you to further specialize and fine-tune your character's abilities Over 100 unique spells that can be learned, or used from wands, rods and magic items Hundreds of playable areas, from cities and towns, to crypts, dungeons, ruins, underwater realms, and much more Over 500 monsters that can wield weapons, cast spells, fire missiles, use wands, etc. And your summoned creatures can do all that too! A popular Random Dungeon system that provides endless levels of monsters and loot Player groups, support roles, and adventuring facilities Raid bosses, Live Quests, and other endgame events Custom images: At 25th level, you can upload your own avatars to fully personalize your character A well-established and friendly community of helpful old-timer players It's hard to do justice to the size and scope of Wyvern until you've played it yourself. Physics Even though Wyvern is a 2D tile-based game, it still supports a rich set of physical properties, including: A rich lighting model and a day/night cycle Missiles, projectiles, throwables, and area-of-effect spells Pushable objects, levers and gates, vehicles, mechanical traps, and other active objects Over a dozen damage types with resistances, immunities, and vulnerabilities A built-in side-scroller engine with gravity, friction and other effects, for certain quests and areas A sophisticated camera system that allows scrying, wizard-eye, detect-monsters and much more A realistic body-parts system - e.g., a hydra (naga) player can wear five helmets and five amulets Audio effects and background music The game engine has thousands of different objects to support the game, the economy, quests, missions, guilds, and other features you would expect from a fun MMO. Cross-Platform and Cross-Play Wyvern for Steam currently supports Windows. You can also play on Mac and Linux, but you must download those clients from the Ghost Track website. We expect to support Linux and Mac on Steam in the near future. The Mac and Linux versions support cross-play with the Windows version. Wyvern also runs on Android and iOS, on both phones and tablets. All the supported platforms (Steam/Windows, Mac, Linux, Android, iOS) share the same backend servers. You can hop off your Steam client and onto your mobile client, or vice-versa, without even leaving the game. Your account will work across all devices, including new clients we add in the future. When you play Wyvern from Steam, you can log straight into the game and start creating characters and playing. If you want to play your characters on mobile as well, then you can link a Gmail account to your Steam account, and they will act like a single account. You use the Gmail account for logging into non-Steam Wyvern clients. On iOS we also support Sign in with Apple and Log in with Facebook, but these do not support account linking. Free to Play Wyvern prides itself in NOT being a pay-to-win (p2w) game. The game runs on Cloud servers, which costs us money. We have opted for a free-to-play model, where, if you like, you can purchase Wyvern Crowns as the in-game currency. Many players do this simply to show their support of the game they love so much. But we also offer perks and conveniences if you buy Crowns. Here are some examples: You can get early access to a custom image for your character. You can convert Crowns to gold (based on your experience level) if you find yourself in a cash crunch. VIPs can transfer items between their characters. You can buy a Private Jet that saves you travel time. In general, we do not have unlockable areas, although VIPs who purchase a certain number of Crowns get access to a special lounge, a 20% off store, and a couple of other minor perks. But 99.99% of the game is available to everyone. Our philosophy is pay for convenience , as long as it does not give you an unfair competitive edge. The highest level you can achieve in the game today is Demigod (level 50), and quite a few of them have never spent money on Wyvern. They played completely for free and made it as high as you can go, and in fact they are quite competitive -- because this is not a P2W game. Wyvern is a tiny development team: Just one developer, plus a handful of volunteers. We strongly believe that Wyvern should be free and fair for people who don't want to spend money supporting us. Learning Curve Unfortunately, Wyvern has a steep learning curve. It is a complex game with decades of history. Our getting-started experience needs some love. There is a starting tutorial, and we are working to improve it. But it takes some patience to learn the fundamentals of the game. But we hope you will give it a try! Because once you're over that learning curve, a truly amazing game awaits you. There are active players, some of them online as you are reading this, who have been playing Wyvern since 2002. And plenty of new players who have discovered the joy and challenge and inspiration of Wyvern, which is like almost no other game on Earth.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1541710/header.jpg?t=1615277022",
    "Price": 0.0,
    "Developers": "Ghost Track Inc",
    "Publishers": "Ghost Track Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_f45bbdefaec448b05abc9024fdd9e70555672af4.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_15912f5f1a2140d8ad79b6bb8a3522033bc13825.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_4180ae609a55913d6b7b26d98dbd4b66a93d1843.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_2fcda71fdc598fcdebc56ed9cf92c7e8bdcabfe8.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_0ff04d6954855c090d4453f66a72c052f4140db9.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_876e78c60c42f860b3ee8696fab4711e65beaddd.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_0b5e28f561cedfb3e8cc4af03c38eb692000cb43.1920x1080.jpg?t=1615277022,https://cdn.akamai.steamstatic.com/steam/apps/1541710/ss_6c48f2a9ee55adaa9e3042ec410c9ac7bd605a9f.1920x1080.jpg?t=1615277022",
    "Slug": "wyvern",
    "Meta Title": "Wyvern: Mar 9, 2021, Ghost Track Inc and Full Overview",
    "Meta Description": "Looking for information on Wyvern? Check out the release date (Mar 9, 2021), developer insights from Ghost Track Inc, and a complete game summary.",
    "Alt Text Image": "Official header image for Wyvern game - Steam 1541710",
    "Canonical URL": "https://gusku.site/game/wyvern",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wyvern\", \"description\": \"Looking for information on Wyvern? Check out the release date (Mar 9, 2021), developer insights from Ghost Track Inc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ghost Track Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ghost Track Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1541710/header.jpg?t=1615277022\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}