{
    "AppID": 459640,
    "Name": "You... and who else?",
    "Release date": "Mar 17, 2017",
    "About the game": "Description YOU... and who else? is an addictive Strategy game developed by Aldorlea Games (Asguaard, Moonchild, Dreamscape etc.). Recruit troops, improve your skills, conquer castles and progressively unite the world under one banner. Before entering the battlefield, use awards to enhance the capabilities of your generals, and then select one of them according to their units and skills to face off and defeat an enemy wave. Strategy is a key element. If you choose well, a general can defeat 3-4 enemy waves. But on the other hand, one mistake may have drastic consequences. Are you a good enough tactician to defeat all the enemy waves and conquer the world? Features 10-20 hours of playtime 20 unique leaders with their particular style and troops Up to 80 playable characters with their own strengths and weakness 30+ locations to explore Tons of items to increase the strategic aspect 4 difficulty modes and end rating Explore gorgeous, legendary places as you venture all over the world Basic Gameplay Elements (Summary) Get your favorite Generals to levels 3 and 6 so they can command their 3rd and 4th Troops respectively Choose wisely who will enter the next fight - a defeat means the whole team loses! Defeating the last wave gives the most experience points Be faster than your enemies - a 1 point difference in Speed is enough to guarantee a headstart, unless the enemy is pre-emptive! Pick the anti of each enemy side you face - strategy is crucial to win this game Read below for more detailed information! Know your Troops The more you play the game, the more you can know about your own troops (and your enemy's, since they are identical) but also the monsters. The best strategies come with the greater knowledge of the game. It's important to note that, like your troops, monsters have levels, and can develop new skills and behaviors as they level up. For instance, the rat cannot poison early on, but can at higher levels. The best tactic is to pick a general that will suffer little to no damage against a wave. If you're able to predict how the enemy side will behave, you can emerge victorious! A General gets a 3rd unit at Lv3 and a 4th (and final) unit at Lv6 . Try to have your most important Generals reach these levels as soon as possible by letting them kill the final wave (gives the most experience points) or awarding them with medals that give extra experience points or levels. NB: All achievements in this game can be obtained in Conquest Mode. Basic Troops To know the attributes of a character or troop, look into the equipment menu (WPN TYPE). TALENT(S) indicates what the character is able to do. THE ARCHER: has pre-emptive hits THE DUELLIST: counters hits THE CHAMPION: counters skills THE CRUSADER: has a very strong defense THE WIZARD: is the master of fire magic THE THIEF: can steal a few gold coins every fight THE MUSKETEER: has pre-emptive hits THE PROTECTOR: decreases damage taken by any party member THE MIMIC: gets stronger with more gold THE ACROBAT: can tame the enemy THE BEASTMISTRESS: can tame and seduce the enemy THE LANCER: hits twice THE PRIESTESS: can learn a strong spell against dark enemies THE VAMPIRE: is deadly against humans and can seduce them THE ZOMBIE: is even deadlier against humans and can tear them apart THE SPIDER: hits multiple times THE PUPPET: hits several times and is immune to all ailments THE SUCCUBUS: can seduce most human beings THE DARK KNIGHT: deals crazy damage AND MANY MORE TO DISCOVER!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/459640/header.jpg?t=1630007295",
    "Price": 4.99,
    "Developers": "Aldorlea Games",
    "Publishers": "Aldorlea Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_0209bcce5ebe629b657216341354006ba7905914.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_14b80fd7cb73d0993112386851d23f34e3a407d0.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_fed58fd87ac6ec50c5971c986ea70a89a57e59af.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_9b3bed8dda93abf2ea39b90a3677c39182c8abfb.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_2787e148a9923ffcf7e26bdb7c14461a0340b756.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_a8c6d1334b81417b5c9d983ae7a1a1678907d078.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_cf0f0d4fbffcc6d2d5165058718740f73ef38aa9.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_54a681a4d1ee43739ef5a14243823c9921733830.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_b06c03cebc91911ecb80c81c871f9e037146c498.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_da0594f52158a7bfee6a8a6c07f5a508e32321f4.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_beefc835ffd5d83beb4c7c094ffed15616f88005.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_092033538f8960293d705b4e9c8e021bf5c18b54.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_d2ae0aee829de4c90e242a33230b3fb613725d1d.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_bf9ae1c50a25af7ed09f08685b1c2c62cadbf90f.1920x1080.jpg?t=1630007295,https://cdn.akamai.steamstatic.com/steam/apps/459640/ss_2147cf6329dcc3d131b091e7a6e162ee13479d0c.1920x1080.jpg?t=1630007295",
    "Slug": "you-and-who-else",
    "Meta Title": "You... and who else?: Mar 17, 2017, Aldorlea Games and Fu...",
    "Meta Description": "Looking for information on You... and who else?? Check out the release date (Mar 17, 2017), developer insights from Aldorlea Games, and a complete game ...",
    "Alt Text Image": "Official header image for You... and who else? game - Steam 459640",
    "Canonical URL": "https://gusku.site/game/you-and-who-else",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"You... and who else?\", \"description\": \"Looking for information on You... and who else?? Check out the release date (Mar 17, 2017), developer insights from Aldorlea Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aldorlea Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aldorlea Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/459640/header.jpg?t=1630007295\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}