{
    "AppID": 1331590,
    "Name": "7 summer days: Youth sky",
    "Release date": "Jul 29, 2020",
    "About the game": "7 summer days: Youth Sky — a cycle of visual short stories within the extended universe of “7 summer days”. It tells about the adventures of an Nonamed trainee in the worlds of the Old Road. Includes four games, each with two routes: Youth Sky: Loss Story (a story of Lana and a story of Namiki) Youth Sky: Passion Story (Lera's and Stasya's stories) Youth Sky: Anger Story (Sasha's and Yana's stories) Youth Sky: Road Daemon (a girl from Ildy story and Nonamed Crusade story). Chronologically, each subsequent short story follows the previous one. Inside one story, the narrative style allows you to create some kind of looping, so it does not matter which route to read first. Plot The protagonist of “Youth sky” is a young man of twenty-seven years old, living far from the best conditions (as he himself says, below the poverty line). One December morning he receives a message with a job offer and a promise of golden mountains. Looks like regular spam, doesn't it? But life flips about when he nevertheless agrees to the offer and ... gets on the Old Road. There he becomes a trainee of Zulum and travels through the worlds with his light hand, mastering some skills that are very necessary for the employer. For what purpose? It seems that the reader himself has to find out. The Old Road universe consists of an endless galaxy of worlds, which would be difficult to describe, so the trainee will visit only some of them. A little more about the worlds below, but the reasons why the Trainee will be there, Zulum is firmly kept secret, offering the 'unreasonable monkey' to figure it out on his own. And it depends on the right choice of the Trainee where the story will turn, how it will end, and whether we will finally find out why the odyssey of the nameless Trainee was started at all. Ys worlds World of wanderers The place of the prologue is New Year's Eve in 2019. This is one of the fantasies - the world of tramps, known in Seven Days as the Russian Federation. It is tracing paper from our world and appears as a place uncomfortable and unkind, full of people who have forgotten how to dream, buried in smartphones and tablets. The Trainee flees from there almost by accident, and this becomes the impetus for truly miraculous events. Zeroed Zero reality, familiar to the reader from the “Seven Days of Summer”, this time will show us the parties beyond the camp. Specifically, in the first story, the reader will meet some people, who were announced in passing in 7dl. Acquaintances, relatives, friends and just people who have nothing to do with the heroines already beloved by readers ... Zeroed is the whole world. It has its own rules, distinctive features and special services that put the fantastic properties of the universe at the service of themselves and their state. Tech singularity The world of technical singularity is not at all like paradise, despite what seems to be one. The intern learns what is wrong with this world, helps one girl get home, and at the same time shows her the illusory nature of some things. And bring back her dream. Soft apocalipse(socpunk) In progress Shulgin's world(alternative science) In progress A world of fate-crosses In progress A world of second chances In progress Ildizage A mistery synthetic city-world. Details in a separate article.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1331590/header.jpg?t=1596444498",
    "Price": 0.0,
    "Developers": "Sanati Tales",
    "Publishers": "Sanati Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_2314f40266c240851f76ef9a22cded787287144c.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_9bff7e261bedc2bc9a62c0f264c973f3d895105b.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_6330dcb4a285a84ebfe1e4043073237b7819e002.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_34b2f89ed3cc08fefb65f8acf3e226fc37d7c87e.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_785efc3c5cc4559dfd874c4b8242dba49d501b5d.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_5dc3d628538f4cba58ee61c1137ad4240d6691fe.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_0da3537d83761f9fe2eaf101aa73bee887dc0aaf.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_7adae47ea44d91e02b52215acaa7cb60e6a26cfe.1920x1080.jpg?t=1596444498,https://cdn.akamai.steamstatic.com/steam/apps/1331590/ss_6a60ddb6ef5ba5b46beebdddff0cdfaf1400f503.1920x1080.jpg?t=1596444498",
    "Slug": "7-summer-days-youth-sky",
    "Meta Title": "7 summer days: Youth sky: Jul 29, 2020, Sanati Tales and ...",
    "Meta Description": "Looking for information on 7 summer days: Youth sky? Check out the release date (Jul 29, 2020), developer insights from Sanati Tales, and a complete gam...",
    "Alt Text Image": "Official header image for 7 summer days: Youth sky game - Steam 1331590",
    "Canonical URL": "https://gusku.site/game/7-summer-days-youth-sky",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"7 summer days: Youth sky\", \"description\": \"Looking for information on 7 summer days: Youth sky? Check out the release date (Jul 29, 2020), developer insights from Sanati Tales, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sanati Tales\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sanati Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1331590/header.jpg?t=1596444498\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}