{
    "AppID": 2071060,
    "Name": "Acassia",
    "Release date": "Jul 25, 2022",
    "About the game": "Acassia… is a tank, action and shooting game, where does it start your new adventure in a world of science fiction and interplanetary wars. Imbued with galactic legends, the game will give you the opportunity to have fun using extravagant and truly powerful combat machinery to help, defend and conquer various civilizations... Characteristics Of Acassia Photorealistic graphics. Open war environment. Total freedom of movement (open world style). Infinite replay value, score and credits. Action and Enemies: Tanks and Infantry. 6 heavy tanks equipped with powerful weapons. Unique weapons for each tank. Legend In a faraway place, called Acassia, located in a dimension parallel to our universe, a constant struggle is waged to maintain the balance and survival of various civilizations and galaxies. After the devastating destruction suffered and arisen as a result of the improper manipulation of the Acassia gems, in the struggle to generate unlimited energy, several civilizations were affected by a universal imbalance in the scarcity of planetary resources. And this is where your story begins… use the remaining resources to conquer and rewrite the history of these worlds… The legendary tanks: ZOOD, ESTRADIUM, BESHELL, HEXIUM, CRATEMOHR and TITTAN, are just the beginning and a few among which futures you will discover. Tank Zood With his versatility and adaptability in defense and assault, and is capable of creating miniature black holes and pulverizing his enemies. Tank Estradium Its great attack capacity and its great variety of weaponry allows quick and devastating assaults, making the enemy's defenses futile. Tank Beshell This tank is capable of brutally wearing down the enemy, and its highly resistant armor makes this machine an unstoppable beast. Tank Hexium Is what makes this versatile tank capable of creating photonic, thermal, cryogenic, electrical, and antimatter ammunition out of thin air. Tank Cratemohr Fast, agile and resistant are the qualities that define this expensive combat. Designed for rapid infantry recovery and rescue operations. Tank Tittan Equipped with thermal rocket launchers and an extra machine gun against infantry, this tank offers the army the most devastating power in the entire galaxy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2071060/header.jpg?t=1658769439",
    "Price": 13.99,
    "Developers": "CHAKRA 3D",
    "Publishers": "CHAKRA 3D",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2071060/ss_d50dce6990ed4143514b21fb8a102d302254f6c1.1920x1080.jpg?t=1658769439,https://cdn.akamai.steamstatic.com/steam/apps/2071060/ss_4ec4999accd9abca5e4776520627d3755becdd95.1920x1080.jpg?t=1658769439,https://cdn.akamai.steamstatic.com/steam/apps/2071060/ss_c726a58fa7a5414f0850e28d6d5f7b16d8b8ea35.1920x1080.jpg?t=1658769439,https://cdn.akamai.steamstatic.com/steam/apps/2071060/ss_73f74abb9fd8fb62b11d55a859293082acf76587.1920x1080.jpg?t=1658769439,https://cdn.akamai.steamstatic.com/steam/apps/2071060/ss_f90e41a8030c22aa2753a76f7855540a780c4bbd.1920x1080.jpg?t=1658769439",
    "Slug": "acassia",
    "Meta Title": "Acassia: Jul 25, 2022, CHAKRA 3D and Full Overview",
    "Meta Description": "Looking for information on Acassia? Check out the release date (Jul 25, 2022), developer insights from CHAKRA 3D, and a complete game summary.",
    "Alt Text Image": "Official header image for Acassia game - Steam 2071060",
    "Canonical URL": "https://gusku.site/game/acassia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Acassia\", \"description\": \"Looking for information on Acassia? Check out the release date (Jul 25, 2022), developer insights from CHAKRA 3D, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CHAKRA 3D\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CHAKRA 3D\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2071060/header.jpg?t=1658769439\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}