{
    "AppID": 806490,
    "Name": "As We Know It",
    "Release date": "May 8, 2019",
    "About the game": "When the world gets too hot humanity finds sanctuary underground. After a long waiting list you finally score a spot in the local underground city of Camden, run by Mayor Rick Davidson. You and your mother move in and begin to acclimate to this wonderful new life. As time passes, however, things start to go wrong. Unravel what’s going on, and face some hard choices that will impact your relationships and fate. Get a job, find romance, and meet the other residents of Camden- your new home. Play as Ashlynn Phillips. Ashlynn is suspicious, but desperate to make this new life work. Her life on the surface was hard. She spent most of it fighting for everything and going without. Now she's safe. Her mother is safe. They have food, water, and shelter. Nothing will get in the way of that ever again, if she has anything to say about it. Features: Customize your name and appearance (different skin tones and hair colors). 4 career options with independent story lines. 4 potential love interests that you can befriend or romance. 3 potential friends and several people to interact with. Branching paths from day one, making each play through unique. Every path promises different sides of the story, encouraging replay! Spend time with any- and everyone, no matter who you romance, or which job you pick. 30 unique endings. over 135,000 words total Romance options: Micah Everett A perfectionist with an eloquent way of speaking, and a quiet voice. Insecure from a previous relationship which causes him to appear distant at first. Tries to throw himself into work as much as possible, and as the community’s lead doctor no one tries to stop him Jude Myers You can usually find him at the bar with Sam, the closest thing to family he has left. Or in the greenhouse tending to the plants with loud grunge music from the 1990s shaking the walls. If you see him with any tech, you should probably assume it’s contraband and say nothing Gloria Miller The sweet Community Affairs Supervisor who wants to keep everyone's spirits up in these dark times. Born in Camden she isn't fully aware of the harsh realities of the surface. Bored of living underground she wants to either shake things up or escape. Eva Turner An overly friendly security officer full of charm, and a sad smile. She'll tackle criminals all day, and then sweep you into her arms and sing karaoke with you all night. Or she’ll challenge you to a race, then feel bad that she didn’t let you win. Welcome to Camden! An underground utopia with fresh food, filtered air, and the coldest water you’ll ever taste. Enjoy your spacious living quarters with enough room for the whole family! We have all the amenities you could ever dream of: a gym for your fitness, a library for your mind, and a bar for socializing. Our community center is a hub of activity. Stop by in the mornings for complimentary coffee and a friendly chat with your neighbors. All events and meetings are held there as well! Our massive space is taken up mostly by an impressive collection of greenhouses that provide a wealth of resources for Camden. From clothing to medicine, if we can grow it then it’s here. Never worry about fatal power outages again. We use an advanced Geothermal energy system that is as safe as it is efficient. Our impressive security and medical departments keep us safe and healthy. Camden welcomes you to your new, better life.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/806490/header.jpg?t=1590698459",
    "Price": 14.99,
    "Developers": "Jaime Scribbles Games",
    "Publishers": "Jaime Scribbles Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_1dcbee6ea96745a0cd56e538f5b1e84f9ac2bf44.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_ab53412ce42165130d0e0d3ce8aa004c1a6cd709.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_774de9a7db203b61a83c55d9e3af71b6b60dc107.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_e2303fcc0441b7e1c7ab65f7ccb0ea0d79218d45.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_f9f8a4988541653619a3f173b3509dbd3db548e4.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_e1585318dd92b839cf0f16952d0625ff126d9938.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_27777db61a080b54efbf23c9f834cb1d127e448b.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_424815c02365bd2c6717d2c84d586bc576aee70c.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_17cee156d51e92b846c308aa246b00e898bd2265.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_3eceada864e341baa70f9f992278a6d1614a1c32.1920x1080.jpg?t=1590698459,https://cdn.akamai.steamstatic.com/steam/apps/806490/ss_782caef878ab4df4a47cf1adaa663c8cbaa74a4a.1920x1080.jpg?t=1590698459",
    "Slug": "as-we-know-it",
    "Meta Title": "As We Know It: May 8, 2019, Jaime Scribbles Games and Ful...",
    "Meta Description": "Looking for information on As We Know It? Check out the release date (May 8, 2019), developer insights from Jaime Scribbles Games, and a complete game s...",
    "Alt Text Image": "Official header image for As We Know It game - Steam 806490",
    "Canonical URL": "https://gusku.site/game/as-we-know-it",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"As We Know It\", \"description\": \"Looking for information on As We Know It? Check out the release date (May 8, 2019), developer insights from Jaime Scribbles Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jaime Scribbles Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jaime Scribbles Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/806490/header.jpg?t=1590698459\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}