{
    "AppID": 1077630,
    "Name": "Australian Football Coach 2020",
    "Release date": "Aug 21, 2020",
    "About the game": "Coach your team to the premiership flag! Australian Football Coach is the premier Aussie Rules Football management game, now rewritten from scratch and fully updated for the 2020 season. In Australian Football Coach, you put yourself in the coaches' box for an Australian Rules football team. The 2020 version has been entirely rebuilt from the ground up. With more tactical options, new player management issues such as morale, a brand new user interface designed to make the game as easy to play as possible, and a brand new game engine optimised for speed, AFC2020 is the ultimate footy simulator! Multiple game modes - Whether you want to take your team to the flag, take control of a state league side, develop youth on a U-18 team, redraft the entire league, or start from scratch and set up your own fictional footy world in the custom league designer, the choice is yours in AFC2020! Lose yourself in statistics - History is tracked for every simulated game. Find out the biggest comeback in league history or just check how your fringe players are doing in the state leagues on a game-by-game basis. Watch records change and unfold over time and see your superstars collect multiple awards, from leading goalkicker to team best-and-fairest. New tactical options - take full control of your team's gameplay style with winger width, zone defence type, forward formation structures and more! Manage your best list - Your list manager tells you your superstar key forward wants too much money. A young rookie needs to be promoted to the senior list at the end of the season, but you're up against the cap. The free agent you covet doesn't want to play in your state. Live all the highs and nightmares of a list manager - make trades, sign key free agents, participate in national, rookie, and midseason drafts, and sign zoned players in certain leagues in a sophisticated player movement module which focuses first and foremost on player desires. Tweak anything you'd like - Edit anything you'd like easily from within the game, from team nicknames and stadiums to entire league structures! Add an expansion team or disband your rival, the choice is yours, or create a new scenario from scratch using the game's easily editable database. Optimised for women's football - Create your own women's league, using 16-a-side rules and shorter quarters if you desire, and specialised injury rules which vary by gender.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1077630/header.jpg?t=1600036330",
    "Price": 14.99,
    "Developers": "Statto Software",
    "Publishers": "Statto Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_05bbaeb07475b16b42fcfdcdda0ef6944ab7faf1.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_5526ea7e4430b5a8eac487fdd0a2907c71ad64bf.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_6bbb1fc749d34b309e2f2eb0c3caceef20839d33.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_38c08f8cbb4689e991d9622f8e74786e46f68413.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_ae175ce3a215d6c1044b048d31eac4e247fcc543.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_dfe062f5debe1f099f428b1865ccf7dd17f9d181.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_726df15ea766422b225a6f63e2f65f7f89594971.1920x1080.jpg?t=1600036330,https://cdn.akamai.steamstatic.com/steam/apps/1077630/ss_166e129c7020f9ea2352555120f669c9574fdd36.1920x1080.jpg?t=1600036330",
    "Slug": "australian-football-coach-2020",
    "Meta Title": "Australian Football Coach 2020: Aug 21, 2020, Statto Soft...",
    "Meta Description": "Looking for information on Australian Football Coach 2020? Check out the release date (Aug 21, 2020), developer insights from Statto Software, and a com...",
    "Alt Text Image": "Official header image for Australian Football Coach 2020 game - Steam 1077630",
    "Canonical URL": "https://gusku.site/game/australian-football-coach-2020",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Australian Football Coach 2020\", \"description\": \"Looking for information on Australian Football Coach 2020? Check out the release date (Aug 21, 2020), developer insights from Statto Software, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Statto Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Statto Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1077630/header.jpg?t=1600036330\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}