{
    "AppID": 253370,
    "Name": "Axis Game Factory's AGFPRO v3",
    "Release date": "Nov 19, 2013",
    "About the game": "Axis Game Factory’s AGFPRO v3.0 – for PC, MAC and LINUX We just released version 3.0 of AGFPRO &amp; Premium - there are a TON of new features, assets and functionality that have been added, giving users the ability to create amazing game levels and maps like NEVER BEFORE!! Major features to AGFPRO 3.0 include compatibility with Unity 5 for AGFPRO, Premium, Zombie FPS, Fantasy Side-Scroller, Drone Kombat, BattleMat Multiplayer, and Voxel Sculpt! We have also added new character controls and characters in both the ARPG and Platformer Players! What you will really see is the POWER and SPEED that comes with this update, allowing users to create lush scenes, filled with assets, foliage and other features and functionality. AGFPRO v3.0 is a comprehensive toolset designed to provide game developers and enthusiasts with a powerful and rapid level creation, terrain/vegetation editing, lighting and atmosphere system. AGF is an independent product that empowers users to create game levels and environments for many types of game genres, and the AGFPRO v3.0 PREMIUM version is also designed to work in concert with the Free and Pro versions of the Unity 5 game engine to allow further customization and game publishing. AGF runs on the PC, MAC and LINUX systems. AGF allows developers to rapidly create game maps, sculpt terrain and design levels quickly and easily. With over 1000+ assets pre-stocked in the warehouse, along with 48 pre-set themes and 8 sample maps, developers and enthusiasts can begin creating levels in minutes. AGFPRO v3.0 includes all of the necessary tools to allow users the ability to import AGF scenes into Unity3d Free and Pro 5. Please note that due to Unity's change in business model from free and paid versions to a subscription model, we have been unable to maintain updates to align with our development pipeline and business model. AGFPRO works as a standalone product for hobbyists as well as for developers who work from Unity 5 through January 2018. Be advised that if you plan to use AGFPRO for professional game development, there may be certain features in recent Unity updates that do not work. Creating game levels and maps in AGFPRO is easy and fun - now ANYONE can create their own quality game maps without having to program, model or animate! In order to use AGFPRO Premium (DLC), you must first purchase AGFPRO. KEY FEATURES: AGFPRO v3.0 now Features Nine (9) Key Areas or Apps for Development that Include: AGF Launch Pad AGF World Editor AGF Construct App AGF Browser AGF Packager AGF Scene Loader ARPG Player (Internal &amp; External) Platform Player (Internal &amp; External) FPS Player (External) New v3.0 AGF Launch Pad : This App replaces the AGF editor from the AGF icon in Steam Launches all AGF Apps including the Editor from one toolbar No need to go through the Editor to launch the Players New v3.0 AGF World Editor Features: Redesigned GUI in the Editor Dropdown menu system Collapsing, drag-able windows with easy to see icons 3x Speed increase for terrain sculpting New Smoothing feature for the terrain sculpting has been added to give the user the ability to smooth and soften terrain on their maps New X, Y, Z directional compass added to the Editor Camera automatically changes the atmosphere when users are underwater vs. above water Addition of 'Build Time Clock' that is saved with each scene file every time users work, creating a standing time on how long each level takes to create User-Friendly Project Creation Wizard o Extensive library of pre-set themes for immediate level design o Themes include lighting, atmosphere, terrain, vegetation, &amp; water pre-defined Intuitive User Interface with 'Radial Menu' to expedite workflow Drag and reorganize windows to customize UI On &amp; Off feature quickly hide menus Advanced Terrain Creation System Adjustable: terrain size, splat map &amp; vegetation detail resolution Supports terrains from 200 meters up to 200 meters down max Terrains are now expanded to a maximum terrain of 4,000 meters square 3x Speed increase for terrain sculpting 10 levels of undo for terrain editing Undo Vegetation, Painting and Sculpting independent of each other Paint, Sculpt and Plant vegetation individually or simultaneously Toggle: terrain visibility, painting, sculpting, planting Sophisticated Brush Support Extensive brush library with adjustable brush size, rotation, power, blend Edit the entire Default Brush library for users preference Project specific and default brushes independent of each other Via the new integrated AGF Browser , users can now import their own original: Brushes, Terrain Textures, Terrain Vegetation Textures in PNG. Format Newly added: Custom Images can be both loaded and removed for the Brushes – Terrain and Vegetation Real Time Terrain Deformation and Painting System with Tri-Planar Texturing with Normal Maps Toggle between tri-planar shader &amp; simple Intuitive Terrain 'Snap to Grid Height' to set terrain Numeric input and readout of terrain height at specific locations Tri-Planar Shaders and Texturing Shader automatically maps terrain inclines with user defined texture Over 40 textures included with Normal Maps Terrain Texture Color Tinting Feature Change individual textures or batch Change terrain textures quickly and update in real-time Advanced Vegetation System Adjustable vegetation density &amp; distance, unlimited layers Set vegetation min. width, height &amp; color spectrum Advanced Global Vegetation Editor Globally change vegetation color saturation, value, size, minimum width &amp; height, color spectrums Fully featured lighting and atmosphere configuration allows quick real time and run-time customization Customized Lighting System Key, Fill, Back, and Ambient light sources Set light colors, flares &amp; shadow configurations Extensive Lens Flares to “main” light in lighting rig (over 15) Newly added Underwater Lighting system Fog System Global and simple fog with a variety of parameters: density, falloff, color and distance Set fog haze, density, distance, color, height and falloff Newly added Fog System Skyboxes – Select skybox cube maps with the ability to apply rotation &amp; tint Beautiful water system with sliders for wave direction, speed, intensity, refraction/reflection color and foam properties Geometry Brush System Create unlimited sets of geometry brushes Brushes function as an independent layer to edit Set min/max scale range Randomly rotate X, Y, Z coordinates Align to Normal Spray geometry from camera view direction User-friendly file saving thumbnail generation for scenes when saved Extensive Presets to quickly start scenes (48 included) Create custom presets and share with friends Independent Pre-Fab Mode to create complex collections of assets outside of your scene Fully featured transformation tools include: Select, Multiple-Select, Copy/Paste, Duplicate, Translate, Rotate &amp; Scale Intuitive Grid-Snapping and Collision Detection easily place objects in scene with new enhanced features that include: On screen display of Grid Size On screen display of Grid-Snap Setting There are now reference numbers for both the X or Z Axis, the numbers change dynamically with the scale of the grid Grid Reference Number Scaling and Display Settings can be defined by the user New Construct App Feature: Gone is the old prefab workspace and it has been moved into its very own App Construct is where you go to create your own prefab assets from the always-expanding library of textures and assets (over 1,000+) that are available in the AGFPRO Warehouse Users can launch Construct from the Launchpad or from the Editor Use the “refresh assets” button to load prefabs into the Warehouse library Construct allows users to import their own .OBJ files (objects or assets) as well as .PNG texture files Load your own models, .OBJ files, directly into Construct – USERS NO LONGER HAVE TO IMPORT THEIR OWN ASSETS THROUGH UNITY PRO!!!!! This feature is included in AGFPRO and Premium. Combine several .OBJ files and save them as a Prefab to be used in the World Editor New AGF Browser (file browser) This is a standalone browser that connects the AGF Apps together! The new AGF Browser is designed to be the glue that is used to bring in users custom content. Now users are able to bring in their own Textures and Objects files into AGF creations without the necessity of using Unity Free or Unity Pro… This feature is HUGE as it empowers users the flexibility to create their own custom levels with any supported asset types they choose to bring in with the ability to take their scene files back into Unity to publish their own work New AGF Packager By popular demand – we have added this great feature… AGF DLC users are able to package their games easily and share with anyone! Just do the following: 1) Select the Game Type 2) Select the Project Folder 3) Select the Destination of the New Game onto User’s Machine 4) Give a Name to the Game … And the AGF Packager does the rest… it’s really that easy! Best of all, friends do not need to own AGF to run the packaged game, nor do they need to have a Steam account. The Packaged Game is completely stand-alone, DRM FREE, and redistribution of users game(s) is encouraged. AGF Packager will make a game for the OS that it was packaged on. The AGF packaged games are NOT intended for resale. It’s about creating and sharing with all. As an option, the Packager will automatically zip the game(s) package for easy distribution and no installation is required for the end user to play – no installers are necessary for friends to play – just unzip and have fun! New AGF Scene Loader Features: The AGF Scene Loader loads the AGF Scene Format into Unity Free and Unity Pro Custom Images that are used on terrains now load into Unity with scene(s) created in AGF Any locked assets in an AGF scene are no longer an issue… The AGF/Unity Scene Loader skips any assets that are not supposed to load automatically Any OBJ files that are loaded into AGF will also be loaded into Unity Free and Pro Action Role-Playing Game Player: The ARGP Player provides users with player and camera controls that are genre specific for ARPG game creation Using the Internal Player, creations can be played in real-time to play test map creations The External Player allows users the ability to package and send their levels to others to play Platform Player: The Platform Player provides users with player and camera controls that are genre specific for Platform game level creation The Internal Player allows users to immediately play and test their game maps in real-time The External Player allows users the ability to package and send their levels to others to play First-Person Shooter Player: This Player provides the user with an FPS camera and controller, specific for FPS game level creation and play testing The FPS Player can be used with the AGF Packager to package their game levels to share with others This Player also supports Scene-Linking and allows users to share their AGF FPS game level creations with friends and link their maps together for endless gameplay! FPS Weapon asset packs are also included AGFPRO v3.0 PREMIUM AGFPRO + PREMIUM ASSET Packager – users are able to package their assets in Unity Pro and use in the AGF tool-set Batch Asset Processing Automatic Icon Creation Over 500 Source Art Assets and Samples are included for Premium users More Information on what AGFPRO is and what you can do with AGFPRO Users are able to create game levels and maps using the software and also place characters (provided with the software) to play and explore their levels with multiple player style options (Action Role Playing, Platformer, FPS) Just to be CLEAR – AGFPRO is NOT a game engine. It is literally made using the Unity game engine. AGFPRO is a real-time, RAPID Game Environment Development Toolkit and is made to be used in concert with Unity Free and Pro for level/map creation. – However, AGFPRO does NOT need Unity to run or create levels/maps. The scene files that users create in AGFPRO “Basic” and “Premium” can be imported into Unity5 Free and Pro using our AGF/Unity tools. By using the DLC we have already released for AGFPRO (Fantasy Side-Scroller, Zombie FPS, Drone Kombat, BattleMat Multiplayer &amp; Voxel Sculp), users are able to create playable levels with AGFPRO (only – not viable with Unity) with a variety of characters, assets, gameplay mechanics and special feature, “Scene-Linking” to connect game levels There are limitations to some asset packs “locked (L)” that limit the users from loading these assets into Unity. All unlocked asset packs are free of copyright and can be used via Unity for redistribution per the terms of the EULA :/media.wix.com/ugd/43457c_ee338ac5b4f644eb8b432518a8bb3d79.pdf The redistribution or “sharing” of the games users are able to make using AGF and DLC “Players” is a feature we are working on at this time and will be made available to users at no additional fee Users are also able to create and place specific game play mechanics that are provided in the software Full customization of your levels and maps is possible with AGFPRO Premium and Unity Pro, whereby users are able to bring in their own assets and models to make their games unique and further commercialize, making a complete Stand-Alone game Additional Questions RE: AGFPRO? If you are interested in making a complete Stand-Alone game with unique characters, models, assets and game play mechanics not provided in AGFPRO and commercialize it for sale, you will need AGFPRO Premium and either Unity Free or Pro software If you are a development team using AGFPRO + Premium, you will need one seat per team member using the software, but we do offer studio discounts, so be sure to contact us for special pricing We have many schools all over the globe using AGFPRO to teach game development and design in the classroom, from middle schools to elite Colleges and Universities. We have a basic curriculum available that instructors are able to include in their course curriculum and we provide additional support that includes software updates, access to DLC, non-Steam versions of the software if necessary, user support and special feature integration upon request and based on the terms of the agreement. We offer special pricing for schools and we find that schools love using the software as it allows students the ability to create complete games within the limitation of a semester and is a great introduction to begin to interface with Unity3d, without users having to program, model, animate or script.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/253370/header.jpg?t=1578604957",
    "Price": 9.99,
    "Developers": "Axis Game Factory LLC",
    "Publishers": "Axis Game Factory LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_2822d9bff049ea1bce5f65a37e9b4f5adbbfa8e2.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_6a69f08e39afcba49d0c5d92112fefce2d72d933.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_d5a9bea0bc2c1d49fc74b68e2e5aa31a087ab90b.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_9580da78e6c52e4ecc636c4ac4703351bc4b40d3.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_c946ba7f8ee946592fe680b560e581e94e7a2c4a.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_2de562eabd1882663ec85cd05f4e0ca095d5ee74.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_805ef454e43831b01e009732be76f1e56468400b.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_975b11cd13d8d4168fc90d12f19138519586fcaa.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_ab88ca9fe83ced6b711928e634b0a418d131c341.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_92c85a9ca6bc1d7494a8ca76bfbc808849e33807.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_95b8140cf85eda7bc6f99b9ba9f014ac14d0aaf9.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_4b3a996403e4d2cbbfa2a6f9bb8e8e5b3f3776f8.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_9814135445372344092b987a14f47ad76413b728.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_6e261dfb7d3cbe63aa538d4342f2fd57e43ded56.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_78969b50209488866336c0d44149800ccca381bd.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_076dfbb5090688ff17bc89c45b17ea655dcbcaaf.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_026afc124c385e3a7589939af38e3abe992e86f2.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_8e7a15363796c7bf00847cd79b4b94635272458d.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_1888ca72116cfc148e5902a7ffbeaf9b66c14c3b.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_eb694744a993e09d380e10f180d450c54a80e5af.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_9096194ef2be6452a337d08926b9d62dfefdee30.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_4efa4651a83b923d55c38638b96d892dae8c917a.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_783183c96ece24466c6802f1fd44dec0601f2fc9.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_e6590e305ec9f380a08747b6063fd08165bbf608.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_182fd6a08e75a264ea0a52cf1bc3cccf0ace85af.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_088ae9a6e972514810cec4c3802ec331cad68442.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_73123fbf30aeca4ab84a1e191187aa75a1b9a26a.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_65c6d34f27f63b6c38b726f89dd5decd064c1c65.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_793b796b9b62b06caba35a1101c18c5a0a82f726.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_17899d71eb47106e0b52076f6afb2761e8941196.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_c5e12b14bfb6d45a5ccb22981d96ebdc713dfec9.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_e6bc8b54667ec1acb884ee85257a6a42f04c8720.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_53a37bc7e1249f0534d4352c81db51efb2ae1444.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_5da952f6e0e9f2e70a6155d79787f3cb1eaffa5e.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_b6694b50616800c51f3a5a10ec9e4fe3be9a4b6c.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_c088f56b5c954cff2f557deba24e23096d8ec8b0.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_c5ef933a3aedf7060c3a571707d02f06c732665e.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_5ebede77a0b61aed131aa04d22435da867d41202.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_bb7c23a1135d971ee34f91f6f18711ae7f087f3e.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_0c0e334dccdab22399c56affcf9baee81ecd7481.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_f0a9cb04f325c1cb1910f3149f5d64c115c3e017.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_e7bbbf446aa269c47a7c17e744f142c5a149e1a1.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_0f3c22eff1b6b5c378543b74a830f9a93de830c8.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_881063074ba6e988594f0787eb05bb40dcd6b3ab.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_00b2b89c1b824a12964fadb766056affd3182d58.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_db56efaabe107dbd63adc712655fb01d4569f70a.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_b5873d7d008bca313a0c6400d1c96a533b4bcb9b.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_f0c43dceadf01dac4a95d0a88cb70e3f53c6c1c5.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_768eb792e8d74c28437b022bf2b01948ba51fdb6.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_9ffd7d967899fb15c20842d911574e2b647f740e.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_113c4f99d46c4ac014579b05ccea74ad810d5db2.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_3ee887874e4565de0a78d95a17e40690ca0a4801.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_b4e6b266e33b6e488afff5da1815d0d9863385c6.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_33bfc30175350c91d122f2e55541bea3deb599af.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_08f333a3b1521cb357a72e7f4c3b4bbbe78a6da5.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_18e8c3b3b2647bd8be0e825b0bcbc82d9215c6c4.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_48829bd1c553878ed7876a5034131f46c30e2a7c.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_19d0ef08b8075d22a9e2fd623bfbe0fa4e258cba.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_f53b4dca85385a437fc5156ad4d8311cabf35fef.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_a53da1bd59ce47ab3fe9c66d838510c6089ab4bd.1920x1080.jpg?t=1578604957,https://cdn.akamai.steamstatic.com/steam/apps/253370/ss_c864619db006e67b3f8b4f998536d39a9089924d.1920x1080.jpg?t=1578604957",
    "Slug": "axis-game-factory-s-agfpro-v3",
    "Meta Title": "Axis Game Factory's AGFPRO v3: Nov 19, 2013, Axis Game Fa...",
    "Meta Description": "Looking for information on Axis Game Factory's AGFPRO v3? Check out the release date (Nov 19, 2013), developer insights from Axis Game Factory LLC, and ...",
    "Alt Text Image": "Official header image for Axis Game Factory's AGFPRO v3 game - Steam 253370",
    "Canonical URL": "https://gusku.site/game/axis-game-factory-s-agfpro-v3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Axis Game Factory's AGFPRO v3\", \"description\": \"Looking for information on Axis Game Factory's AGFPRO v3? Check out the release date (Nov 19, 2013), developer insights from Axis Game Factory LLC, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Axis Game Factory LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Axis Game Factory LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/253370/header.jpg?t=1578604957\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}