{
    "AppID": 821490,
    "Name": "BattleCourt",
    "Release date": "Dec 22, 2020",
    "About the game": "BattleCourt is a Casual Horde Survival Looter and Shooter. With a massive selection of weapons at your disposal including: Pulse, Wave, Machine Gun, SMGs, Railguns, Directed Energy Beams, Missile Launchers, Grenade Launchers, Freeze Rays, Confusion Rays, Flamethrowers, Gassers, Shotguns, Flak Launchers, Electric / Electro guns, Crossbows, Joke Guns such as Bass Pulse, Banana Wave, and all variants of. Over 300 Base weapons each which can have millions of combinations of modifiers applied to them depending on rarity. If that isn't enough guns and modifiers, you can also build your own in game. Build some Wacky or truly Over Powered Combinations to help you on your journey. With Gun rarities ranging from Broken to Unique, different modifiers will be applied to the gun along with a randomly generated name seeding from a large pool. You might find a Rare Reinold Shotgun named 'Grandma Lonewolf' which has modifiers applied to it turning the bullets into bouncing, curving, gravity bullets that home in on their target and set them on fire. You might find another gun that freezes on hit, or confuses on hit. You can also choose from a wide range of levels from Fields to Dungeons. Some levels also contain Hazards which can be used to your advantage or disadvantage. Levels also have difficulty, gun challenges, and enemy challenges. The settings you pick will Increase or Decrease the amount of coins you earn for beating the level. Some Difficulties and Challenges are not doable until you upgrade your character. Daily Level Challenges are generated each day with a mixture of Difficulties, Enemy and Gun Modifiers, Start Wave, and End Wave. Completing Daily Level Challenges will give coins. More Levels are being added with future updates. Fight through a mixture of different enemy types from Zombies to Biomancers. Defeat the Bosses to beat Levels. Enemies will come in waves, where each wave lasts around a minute and each with its own musical score assigned. A 20 second break occurs between waves to try to clear up any remaining enemies. Enemies behaviour is also modified by the State they are in. Some Cause Damage over Time like Fire and Poison, others slow or stun Like Lightning and Freeze, while some apply status effects like Weaken. Costumes to collect based on achievements and enemy drops. Costumes dipping into some memes, pop-culture references, and plenty of casual outfits, with more and more added each patch. Some Costumes are selectable by default, some unlocked through enemy drops, and some linked to achievements. Throughout your game, you will earn coins through Winning Levels, Doing the Daily Level Challenge, Collecting Coin Drops, and Scrapping Unwanted guns you find. These coins can be used in a few ways. Permanent Guns can be obtained in Loadout by using your coins. These permanent guns stay with you for all Levels and enable you to customize the Layout. Unlock the 2nd to 4th Gun slots to equip more weapons to start your Levels with. Coins can also be spent on Upgrading your character with useful boosts to a wide range of stats like Health, Loot Chance, Scrap amount, and much more. Early Upgrades are cheaper. Collect Powerups to boost your character temporarily with a range of different effects. Avoid Hazards that appear on some levels, or use them to your advantage. Other than boosting your character with Upgrades, you also complete Challenges as you play the game. Challenges such as Deal Base Damage, Collect Loot, and much more which level up as you play. Each level up to the challenge will increase relevant stats. For example the Deal Base Damage challenge will increase your base damage by 2.5% per level, and the Collect Loot will increate your Loot Drop Chance by 1% per level. Combining Challenges with Upgrades will make for very strong characters the more you play. Full Achievement integration exists in-game and on steam through Steam API for all the achievement hunters. Some achievements are achieved through in game secrets and some through hard yard grinding. Content is continuously added to the game. More Costumes, Weapons, Modifiers, and Levels are added incrementally with each patch.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/821490/header.jpg?t=1656041849",
    "Price": 0.99,
    "Developers": "Luke Parisi",
    "Publishers": "Luke Parisi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_ffc0891ffe23fa87f91b353aa6f27c70fceacae5.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_b1683a27ac946b2c56ac028ca6fd594941082d89.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_641f4a1737559bbd7313d515e6b1d7c7ac92e61f.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_a7851b6bc85a8a02816fb59a4c29bf75c2cd44ab.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_4badc564dbd989de8156e8340e47622c6618fdcb.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_1b9cd21bed4b48426fe56d8c291193923bef303a.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_d4b6f8a877f6117319c1c2d532426923d07fe853.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_d324cc52c7f86bf96d24dce6f690b6410d777e36.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_936bd75172d333c2a948d178560f10d249191e48.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_ad9fae2dbedfafb4d67ece3131932f1188de5429.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_c6e95c82c6f5bb5490de75fda4b58be739357cb5.1920x1080.jpg?t=1656041849,https://cdn.akamai.steamstatic.com/steam/apps/821490/ss_b6b578af9d54495fac4811a8e96f13a90f374533.1920x1080.jpg?t=1656041849",
    "Slug": "battlecourt",
    "Meta Title": "BattleCourt: Dec 22, 2020, Luke Parisi and Full Overview",
    "Meta Description": "Looking for information on BattleCourt? Check out the release date (Dec 22, 2020), developer insights from Luke Parisi, and a complete game summary.",
    "Alt Text Image": "Official header image for BattleCourt game - Steam 821490",
    "Canonical URL": "https://gusku.site/game/battlecourt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BattleCourt\", \"description\": \"Looking for information on BattleCourt? Check out the release date (Dec 22, 2020), developer insights from Luke Parisi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Luke Parisi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Luke Parisi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/821490/header.jpg?t=1656041849\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}