{
    "AppID": 1453950,
    "Name": "Blaze3D",
    "Release date": "Nov 11, 2020",
    "About the game": "The blazingly fast 3D data viewer for Windows and Linux . Blaze3D might be the fastest 3D data viewer currently available. It supports both the visualization of triangle mesh and pointcloud data stored in many file formats. Showcase As you'll notice in the videos below, Blaze3D is very fast and supports many workflows for viewing your files. Running from console You can view your model by calling: blaze3d file.name Or an entire folder via: blaze3d folder Drag&amp;Drop support You can drop any supported model or folder on the already opened window Stream loading Get instant visual feedback even before loading is done Folder traversal You can traverse the currently opened folder with the arrow keys Folder view You can view all models within a folder and use Blaze3D like any other file browser Colored point shading Point data is always shaded colorized. This makes it easy to understand even complex 3D models Camera controls Move, rotate and zoom are fully supported Supported file formats Blaze3D Lite (Steam Demo) and Blaze3D Pro (Steam Buy) .stl both binary and ASCII .xyz .xyzc ignoring colors .xyzn ignoring normals .csv if formatted similar to .xyz .txt if formatted similar to .xyz .obj .gcode Blaze3D Pro (Steam Buy) exclusive .ply both binary and ASCII ignoring colors etc. .off .psl .ptx .las only loading point coordinates .pts .glb basic support (v2.0, index meshes, no colors, no textures ...) .gltf basic support (v2.0, index meshes, no colors, no textures ...) Editions Blaze3D is available as free Lite (Steam Demo) and paid Pro (Steam Buy) edition. The Pro edition supports additional file formats. High efficiency Blaze3D causes no CPU usage when idle and uses very little memory (if double_buffer_data is turned off). Saving power and allowing you to work on other tasks in parallel. Incremental rendering of point clouds is also supported. This makes it possible to render very large point clouds that do not fit into your GPU's memory. Active development Blaze3D is in active development and will further improve in the future. Feature requests and bug reports are very welcome. Used models The following models were used within the videos / images: Voronoi lamp by Markellov Medieval Castle by boldmachines Cute Dragon - more easy printing by Sebastian_v650 Pen Holder by damm301 V29 by jzisa 3DBenchy - The jolly 3D printing torture-test by CreativeTools.se by CreativeTools Digital Sundial by Mojoptix Headphone Stand by MakerBot Modular Mounting System by yyh1002 All In One 3D Printer test by majda107 Parts Tray Drawers by FatalError3141 Venus Box by Prot0typ1cal NUT JOB | Nut, Bolt, Washer and Threaded Rod Factory by mike_mattala Frankenstein Light Switch Plate by LoboCNC Toothpaste Tube Squeezer by ottenjr Parametric Hinge by rohingosling Wireframe Skull Pencil Holder For The Love of Dog by philnelson Curved honeycomb vase by eggnot Voronoi lamp by Markellov Ender 3 Cable Chain by johnniewhiskey Yet ANOTHER Machine Vise by TheGoofy Parametric pulley - lots of tooth profiles by droftarts Clamp fully printable by johann517 Secret Shelf by Tosh Flexing battery holders with integrated spring by enif Fully assembled 3D printable wrench by barspin The T-Rex Skull by MakerBot Raspberry Pi 3 B/B+, Pi 2 B, and Pi 1 B+ case with VESA mounts and more by 0110-M-P Eiffel tower by Newcandle Small items organizer by cruzher Medieval Castle by boldmachines Platform Jack Fully Assembled, No Supports by Intentional3D Flexi Rex with stronger links by DrLex Micro Catapult by LukeTansell Tower of Pi by roman_hegglin DIY Dremel CNC design and parts by NikodemBartnik Stackable Box V4 by Yuan4114 TUSH - The Ultimate Spool Holder by filamentry Sliding Door bolt Print fully assembled by Sagittario Smartphone Photo Studio for #3DBenchy and tiny stuff by CreativeTools Universal Filament Filter and Lubricator by CreativeTools Cute Dragon - more easy printing by Sebastian_v650 Sunglasses Car Sun Visor Clip by drotron Air Raid Siren - hand crank version by MlePh Shopping Bag Handle by walter 2020 / Ender 3 Filament Guide by Filboyt Air Spinner by walter Baby Yoda by MarVin_Miniatures vise by joestraws Jumbo Elephant Cutlery Drainer by aleiovanevcp Phone Stand by GoAftens Resistor Box Stackable &amp; Customizable by STTrife Gear Bearing by emmett Place Iris Box remix by LoboCNC Dragon by Benchy4Life Swiss Army Style SD Holder ExpandableRaspberry adaptors by Dranoweb Sanding Tool by Perinski Baby Yoda by MarVin_Miniatures",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1453950/header.jpg?t=1610729225",
    "Price": 4.99,
    "Developers": "Martin Buck Software",
    "Publishers": "Martin Buck Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1453950/ss_0486fdf1c5746ad7e075b5b3d06833700e0a82e6.1920x1080.jpg?t=1610729225,https://cdn.akamai.steamstatic.com/steam/apps/1453950/ss_cbdbe2ca5146609a6127f5935057ec659f0a6254.1920x1080.jpg?t=1610729225,https://cdn.akamai.steamstatic.com/steam/apps/1453950/ss_49d8b92fd0c0d459ee5aa20401519cccf77e1677.1920x1080.jpg?t=1610729225,https://cdn.akamai.steamstatic.com/steam/apps/1453950/ss_5e3e96c41eb2e73ae953fa27abaf134d38c47cbc.1920x1080.jpg?t=1610729225,https://cdn.akamai.steamstatic.com/steam/apps/1453950/ss_2a4a427e7f8765fc78c63f9b984c6d2c20186214.1920x1080.jpg?t=1610729225,https://cdn.akamai.steamstatic.com/steam/apps/1453950/ss_8f36aee39db0e20f5132f3439a968d34c760c35e.1920x1080.jpg?t=1610729225",
    "Slug": "blaze3d",
    "Meta Title": "Blaze3D: Nov 11, 2020, Martin Buck Software and Full Over...",
    "Meta Description": "Looking for information on Blaze3D? Check out the release date (Nov 11, 2020), developer insights from Martin Buck Software, and a complete game summary.",
    "Alt Text Image": "Official header image for Blaze3D game - Steam 1453950",
    "Canonical URL": "https://gusku.site/game/blaze3d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blaze3D\", \"description\": \"Looking for information on Blaze3D? Check out the release date (Nov 11, 2020), developer insights from Martin Buck Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Martin Buck Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Martin Buck Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1453950/header.jpg?t=1610729225\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}