{
    "AppID": 960090,
    "Name": "Bloons TD 6",
    "Release date": "Dec 17, 2018",
    "About the game": "Craft your perfect defense from a combination of awesome Monkey Towers, upgrades, Heroes, and activated abilities, then pop every last invading Bloon! Join millions of other players who enjoy the massive and ever-expanding features that deliver endless hours of the best strategy gaming available. HUGE CONTENT UPDATES * 4-Player co-op! Play every map and mode with up to 3 other players in public or private games. * Boss Events! Fearsome Boss Bloons will challenge even the strongest defenses. * Odysseys! Battle through a series of 3 to 5 maps connected by their theme, rules, and rewards! * Trophy Store! Earn Trophies to unlock dozens of cosmetic items that let you customize your monkeys, Bloons, animations, music, and much more! * Content Browser! Create your own Challenges and Odysseys, then share them with other players and play the most liked community content! EPIC MONKEY TOWERS &amp; HEROES * 22 powerful Monkey Towers, each with 3 upgrade paths and unique activated abilities * Paragons! Explore the incredible power of the new Paragon upgrades, especially against Boss Bloons! * 13 diverse Heroes with 20 signature upgrades and 2 special abilities, plus unlockable skins and voiceovers ENDLESS AWESOMENESS * Play anywhere - single player offline works even when your wifi doesn't! * 56 handcrafted maps make every game a different tactical challenge * Monkey Knowledge! Over 100 meta-upgrades add power where you need it to tackle difficult maps and higher freeplay rounds * Powers and Insta Monkeys! Earned through gameplay, events, and achievements, these are fun to collect and boost your popping power when you need it! And there's heaps more! We pack as much content and polish into each update as possible, and we'll continue to add new features, content, and challenges in regular updates. We truly respect your time and support, and we hope Bloons TD 6 will be the best strategy game you've ever played. If it's not, please contact us at and tell us what we can do better! Now those Bloons aren't going to pop themselves... sharpen your darts and go play Bloons TD 6! ********** Ninja Kiwi Notes: Please review our Terms of Service and Privacy Policy. You will be prompted in-game to accept these terms in order to cloud save and protect your game progress: Bloons TD 6 contains in-game items that can be purchased with real money. You can disable in-app purchases in your device's settings, or reach us at for help. Your purchases fund our development updates and new games, and we sincerely appreciate every vote of confidence you give us with your purchases. Ninja Kiwi Community: We love hearing from our players, so please get in touch with any feedback, positive or negative, at . Streamers and Video Creators: Ninja Kiwi is actively promoting channel creators on YouTube and Twitch! If you are not already working with us, keep making videos and tell us about your channel at streamers@ninjakiwi.com.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/960090/header.jpg?t=1634303522",
    "Price": 9.99,
    "Developers": "Ninja Kiwi",
    "Publishers": "Ninja Kiwi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_d2f93f02857105d608e928c7bd7556344149e34b.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_b6b18dcde4579eb7be9945a5e74576d7d7e114d6.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_95fbb8514c642ee35c9d1be3088a99f77161bb83.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_a35fc76519036fbf96182927a91e7f03e2e1223e.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_b0fdd7a04a6682726c6a0e51018a5a96e1b2505d.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_c94aa1d81697d82f09de5576df7c7d0dd1255dc6.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_cc8f9282b977ecb2cff2611718ed72b4bcfc6502.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_900d7c00d45ff2a258d4c8d59ee47f7f04854c37.1920x1080.jpg?t=1634303522,https://cdn.akamai.steamstatic.com/steam/apps/960090/ss_d82f8f2022db8c36bb28393434d6e65dea2d9c64.1920x1080.jpg?t=1634303522",
    "Slug": "bloons-td-6",
    "Meta Title": "Bloons TD 6: Dec 17, 2018, Ninja Kiwi and Full Overview",
    "Meta Description": "Looking for information on Bloons TD 6? Check out the release date (Dec 17, 2018), developer insights from Ninja Kiwi, and a complete game summary.",
    "Alt Text Image": "Official header image for Bloons TD 6 game - Steam 960090",
    "Canonical URL": "https://gusku.site/game/bloons-td-6",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bloons TD 6\", \"description\": \"Looking for information on Bloons TD 6? Check out the release date (Dec 17, 2018), developer insights from Ninja Kiwi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ninja Kiwi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ninja Kiwi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/960090/header.jpg?t=1634303522\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}