{
    "AppID": 661660,
    "Name": "Blood Ancestors",
    "Release date": "Aug 16, 2018",
    "About the game": "ABOUT THE GAME Blood Ancestors is a first-person melee combat multiplayer game set in a high fantasy medieval world. Two teams of 5 players fight to capture and control the Relic, an ancient and powerful magical artifact key in the eternal struggle between Light and Darkness. In Blood Ancestors, you create your own hero choosing between 3 factions , 6 characters archetypes , and 18 different classes – and on top of that, you pick 3 skills ( Aggressive, Defensive, Utility ) to create a unique build that fits your playstyle like a glove. With weapon or magic, feed the earth with the blood of your enemies to unleash your powerful ultimate attack, secure the Relic, and decide the fate of the war! CONTROL THE RELIC TO WIN THE MATCH, BECOME THE PAYLOAD! To win a match of Blood Ancestors, you need to take the Relic to your enemies’ spawning portal. For that, it needs to be unlocked first by feeding it with your own lifeforce: it will drink the blood of whoever stands nearby. Once it’s full, whoever snatches it first becomes the Bearer; killing him/her grants control over the Relic. Besides, there are two magical pillars on the map, one of Health, another of Speed. If the Bearer’s team control a pillar, it will increase his/her Health or Speed; if it’s controlled by the enemy team, it will decrease them instead. SETTING Hundreds of years ago, a race of slaves found a way to escape their cruel masters, the Blood Ancestors. They discovered a portal between dimensions that led them from Arham, their homeworld, to the new planet of Vetlan. Feeding the portal with the power of the ancient Relic, a powerful magical artifact created eons ago by the Ancestors, these slaves crossed the portal, and closed it behind them; and calling themselves the Blood Ones, they established in this new home, and lived in peace for generations. But war broke soon in this new planet between two factions, the Light Ones, and the Dark Ones; and the Blood Ones were silent witnesses of a war which ended countless lives, and that threatened to destroy the world of Vetlan itself. One day, they decided that, after having escaped slavery and death, they could not stand idle while the planet was being torn apart by the eternal struggle between Light and Darkness. The Blood Ones opened the portal again and traveled back to Arham to face the Ancestors, claim the Relic and use its power to end the war and pacify both worlds. But Light and Darkness learned of their plans, and followed them to Arham – and war followed them too. Now, the three factions fight for the Relic – and the Blood Ancestors remain silent and hidden, letting everyone fight over it for reasons known only to them. Who knows what are they plotting in their twisted minds, evermore obsessed with power and domination? FACTIONS The Dark Ones are the first native inhabitants of Vetlan. Beings without a physical body, mere shadows full of dark energy, they live in deep caves and crevices honoring Arteis, a feared god of the night and shadow. They wager an endless war against the Light Ones. The Light Ones awakened one day in the dark surface of Vetlan, flourished quickly and spread across the whole world. When they were about to lose the war against the Dark Ones a powerful light exploded in the sky, helping them to drive their enemies back. Since then they adore that light as their goddess and name themselves Humans, the Light Ones. The Blood Ones were once the slaves of the Ancestors. They fled to Vetlan, where they found themselves in the middle of a war between the two native races. After a series of cataclysms, they discovered that the magic used in the war had destabilized the core of the planet, and decided to go back to use the power of the Relic to save Vetlan and stop the war. KEY FEATURES Fast-paced 5v5 multiplayer action High Fantasy medieval world Brutal fights in melée combat Objective based gameplay Choose between 18 characters with different gameplay styles (6 in the Early Access release) Create your own build by choosing 3 styles (offensive, defensive, utility) from a pool of more than 150 varied skills Extreme character customization More than 6 multiplayer maps (3 in the Early Access release) Fight to secure the Relic and unleash a powerful ultimate attack",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/661660/header.jpg?t=1541253486",
    "Price": 0.0,
    "Developers": "Snowpeak Studio",
    "Publishers": "Snowpeak Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_ab792ade6c91d4b87d81bdd5c41d29b8b157ae0d.1920x1080.jpg?t=1541253486,https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_fa11535cf88cedbd5257c1abcc3353d1c31d2040.1920x1080.jpg?t=1541253486,https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_3dccb38f54e85fbb19724a5c567aacb508da1dff.1920x1080.jpg?t=1541253486,https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_61356008ea8142460e234f4e8e74a6330f60f668.1920x1080.jpg?t=1541253486,https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_1f6cff45edc6af25f9c8a0abdf63c5c0f889bf97.1920x1080.jpg?t=1541253486,https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_b90617db013fc17a57df64a835e977cff04d7b14.1920x1080.jpg?t=1541253486,https://cdn.akamai.steamstatic.com/steam/apps/661660/ss_0e0ea4cf0d622c88efdb9c48c341943a33377534.1920x1080.jpg?t=1541253486",
    "Slug": "blood-ancestors",
    "Meta Title": "Blood Ancestors: Aug 16, 2018, Snowpeak Studio and Full O...",
    "Meta Description": "Looking for information on Blood Ancestors? Check out the release date (Aug 16, 2018), developer insights from Snowpeak Studio, and a complete game summ...",
    "Alt Text Image": "Official header image for Blood Ancestors game - Steam 661660",
    "Canonical URL": "https://gusku.site/game/blood-ancestors",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blood Ancestors\", \"description\": \"Looking for information on Blood Ancestors? Check out the release date (Aug 16, 2018), developer insights from Snowpeak Studio, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Snowpeak Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Snowpeak Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/661660/header.jpg?t=1541253486\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}