{
    "AppID": 1782050,
    "Name": "Bloxi: The Word Game",
    "Release date": "Dec 17, 2021",
    "About the game": "Bloxi allows you to exercise your vocabulary and learn new words! Fun and tactical powerups help you avoid the blocks from stacking to the top! Improve your high score and supercharge your word finding prowess in just a few rounds! Three difficulty levels and four play modes keep the game interesting and challenging as you improve. Strive for the perfect combo! Each consecutive block you can make a word with increases your multiplier for huge point bonuses, so keep a close eye on every block, and keep those words flowing! Make Words with the Letters in the Falling Shapes Use Powerups Like the Big Bomb! The Big Bomb clears the blocks around words that you get. Longer Words Clear Extra Blocks and Score More Points! Cause Chain Reactions as You Clear Words!! Increase your odds with the Shockwave Powerup. Features Three difficulties so you can decide your level of challenge Endless Mode - where you can only get each word once and the blocks fall faster and faster Clear Down Mode - where the objective is to clear all the grayed out blocks at the start Daily Challenge Mode - unique challenge each day, a letter is banned and there are indestructible blocks Zen Mode - where you can take all the time you want to make words, but you can only use each word once Saving and Loading lets you start and stop whenever you want Get consecutive words to increase your score multiplier, this will also start giving you free powerups Add a Row powerup helps you keep your streak going when playing in Endless Mode Learn obscure words for the logophiles out there! Is this game for you? First of all, it really is a lot easier than it looks to play (on Easy Difficulty and Zen Mode). On the other hand, Daily Challenge on Hard Difficulty will really test your mettle. Do you like obscure words? If it will be fun for you to see weird and obscure words and learn new words that you'll use in games like Scrabble and the Crossword, this could be a good match. If you like more casual games that you can then master or just play in a chill mode, we think this could be a good fit. Even as you get better you can try to beat each level faster and faster. The gameplay is centered around finding a word with the current block, this is rewarded by building up a multiplier by getting consecutive words too.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1782050/header.jpg?t=1640017201",
    "Price": 4.99,
    "Developers": "Cherry Beam",
    "Publishers": "Cherry Beam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1782050/ss_d8c6a0d658cf80868fb3fa36df08377f56256096.1920x1080.jpg?t=1640017201,https://cdn.akamai.steamstatic.com/steam/apps/1782050/ss_81a3b15cd4414170edadaac7fc892ee28a6925ee.1920x1080.jpg?t=1640017201,https://cdn.akamai.steamstatic.com/steam/apps/1782050/ss_084621cc8ad6dd42ca8708637b395d6df98bd6b5.1920x1080.jpg?t=1640017201,https://cdn.akamai.steamstatic.com/steam/apps/1782050/ss_c8c56b9f10771733bfc030a4a9c8fb9a8fad3880.1920x1080.jpg?t=1640017201,https://cdn.akamai.steamstatic.com/steam/apps/1782050/ss_271c332bc213838570b2644eb82c38a3663d3d1a.1920x1080.jpg?t=1640017201,https://cdn.akamai.steamstatic.com/steam/apps/1782050/ss_c60950afe7bccb809a0f3864eb841556009bc2eb.1920x1080.jpg?t=1640017201",
    "Slug": "bloxi-the-word-game",
    "Meta Title": "Bloxi: The Word Game: Dec 17, 2021, Cherry Beam and Full ...",
    "Meta Description": "Looking for information on Bloxi: The Word Game? Check out the release date (Dec 17, 2021), developer insights from Cherry Beam, and a complete game sum...",
    "Alt Text Image": "Official header image for Bloxi: The Word Game game - Steam 1782050",
    "Canonical URL": "https://gusku.site/game/bloxi-the-word-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bloxi: The Word Game\", \"description\": \"Looking for information on Bloxi: The Word Game? Check out the release date (Dec 17, 2021), developer insights from Cherry Beam, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cherry Beam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cherry Beam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1782050/header.jpg?t=1640017201\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}