{
    "AppID": 440900,
    "Name": "Conan Exiles",
    "Release date": "May 8, 2018",
    "About the game": "Conan Exiles is an online multiplayer survival game, now with mounts and mounted combat, set in the lands of Conan the Barbarian. Enter a vast, open-world sandbox and play together with friends and strangers as you build your own home or even a shared city. Survive freezing cold temperatures, explore loot-filled dungeons, develop your character from a lowly peasant to a mighty barbarian, and fight to dominate your enemies in epic siege wars. Conan Exiles can be played in full single-player, co-op, or persistent online multiplayer. After Conan himself saves your life by cutting you down from the corpse tree, you must quickly learn to survive. Weather scouring sandstorms, shield yourself from intense temperatures and hunt animals for food and resources. Explore a vast and seamless world, from the burning desert in the south to the snow-capped mountains of the north. Forge the legacy of your clan as you fight to reclaim and dominate the Exiled Lands. Use the powerful building system to create anything from a small home to entire cities piece by piece. Wage war using swords, bows, siege weapons, and even take control of giant avatars of the gods to crush the homes of your enemies in epic battles. Ages arrive in Conan Exiles The way Conan Exiles expands is changing. Following Age of Sorcery, each Age will continue to have its own theme, free gameplay updates, and Battle Passes. Ages look to the future, in order to deliver evenly paced content drops and an easy way for any player to support the game’s growth and receive exclusive themed cosmetics. EXPLORE A VAST, OPEN WORLD Journey through a massive and seamless open world. From the rolling sand dunes of the southern desert, through the mysterious eastern swamp and the snow-capped mountains of the frozen north. Climb anywhere and experience full freedom of exploration. BUILD A HOME AND A KINGDOM Harvest resources to craft tools and weapons, then build anything from a small home to entire cities piece by piece using a powerful building system. Place traps, elevators, and defenses, then deck out your creations with furniture, crafting stations, and more. SURVIVE IN A SAVAGE LAND Dress well or light a campfire to stay warm and make sure to cool yourself down in the heat. Hunt, cook, eat, and drink to stay alive. Build a shelter to weather scouring sandstorms. Be careful when exploring darkened ruins or you might become corrupted by foul magic. DOMINATE THE EXILED LANDS Carve out your piece of the Exiled Lands, taking it from other players if you must! Build siege weapons and use explosives to break down the walls of your enemy’s city. Place out traps, recruit thralls, and build defenses to keep your enemies from invading yours. BRUTAL, BLOODY COMBAT Fight vicious monsters and other players using an action-oriented, combo-based combat system. Dodge, block, and learn to master the true art of combat to become the greatest fighter in the Exiled Lands. Slay using bows, daggers, swords, axes, and more. BECOME A TOWERING GOD Alight yourself with one of four deities such as Derketo, the goddess of lust and death. Bring your sacrifices to the altar of your god then summon and take control of their huge, towering avatar. Crush enemies and entire buildings under your avatar’s feet. DEFEND YOUR BASE FROM INVADING MONSTERS Eventually you will attract the attention of monsters and other NPC inhabitants of the Exiled Lands, causing a Purge event. Depending on where you built your home, different types of monsters will attack and try to destroy it. Plan your defenses well! ENSLAVE THRALLS TO DO YOUR BIDDING Enslave the criminals of the Exiled Lands and make them join your cause and defend your territory. Put them through the grueling Wheel of Pain to break their will, then turn them into archers, fighters, crafters, entertainers, and more. DISCOVER THE RUINS OF ANCIENT CIVILIZATIONS From the Black Keep in the north to the Dregs along the southern river, discover the ruins of ancient civilizations and solve their mysteries to gain access to their treasure. Uncover the history of the Exiled Lands you as you explore, uncover lore, and meet NPCs. PLAY TOGETHER OR ALONE Play alone locally or fight for survival and dominance in persistent multiplayer on public servers. You can also host your own server and invite others to join you in a world where you have full control of the rules and settings. Want to play with just handful of friends? Try co-op mode! CONTROL YOUR EXPERIENCE When playing alone locally or on a server you are the administrator of you have access to a range of in-game tools. Change your progression speed, spawn monsters, turn yourself invisible, deactivate avatars, and much more. Be the dungeon master of your own server. PLAY WITH MODS Download Conan Exiles mods directly from the Steam workshop to customize your game experience. You can also download the custom Conan Exiles Unreal Editor and start creating your own. You can discover more than 450 mods right now! Conan Exiles Twitter: Conan Exiles Facebook: / Conan Exiles Reddit: / Official website:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/440900/header.jpg?t=1658346555",
    "Price": 15.99,
    "Developers": "Funcom",
    "Publishers": "Funcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_b614e28bc24bbc785cb0c71dad1ba38cf4b9c02b.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_8611b1fb944043a777b07c49b3edcd22ced6de02.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_c4cc450bc5bbac371d564ca8fabe82c0da680951.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_a2c5a82d0f6dc8cd989deb33fc01b5ece876303a.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_a29811929f0e032f1b312a85b759cc2e9aba8a45.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_2639174c7d765a55e22bcf86186e9ad09a9c9a11.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_b478e382600cb8a4eceef57e001ec190f92ea99d.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_55e95553d8c584a5d75277e0d556e837a97eb350.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_e328373c021340c8df1fcc6b69d86c3cfeb9a6c1.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_d076d7ff278aec13cd6c9352ccf668185ad5754a.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_c16404d381149f390d8d8fd62d63262b0af9babf.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_1b889c47062a9833a32f102067b86354c46b57c1.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_1c0064921d5313a0f379de816f6466e4f624a9ee.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_2bf08a573eb275ee17e6398e626c2710e56e4056.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_e8cc50d0122598638d95632564ea04ed07a2ea82.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_b25b980f92e835b01b402e99da26cc61e09c6f79.1920x1080.jpg?t=1658346555,https://cdn.akamai.steamstatic.com/steam/apps/440900/ss_e9eef5a26326a82b4fe07285a2144932aaed923b.1920x1080.jpg?t=1658346555",
    "Slug": "conan-exiles",
    "Meta Title": "Conan Exiles: May 8, 2018, Funcom and Full Overview",
    "Meta Description": "Looking for information on Conan Exiles? Check out the release date (May 8, 2018), developer insights from Funcom, and a complete game summary.",
    "Alt Text Image": "Official header image for Conan Exiles game - Steam 440900",
    "Canonical URL": "https://gusku.site/game/conan-exiles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Conan Exiles\", \"description\": \"Looking for information on Conan Exiles? Check out the release date (May 8, 2018), developer insights from Funcom, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Funcom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/440900/header.jpg?t=1658346555\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}