{
    "AppID": 1703060,
    "Name": "Conflict in Vietnam",
    "Release date": "Nov 2021",
    "About the game": "Ia Drang, November 1965. The deafening whip of chopper blades indicates that the first large-scale helicopter assault ever attempted is underway. The battle begins with touchdown at LZ X-Ray. It ends five days later and no one is quite sure who has won, or what lessons were learned. Five major battles from the Vietnam War will test your jungle combat command skills, as you harness airmobile forces, artillery and air strikes in a cat and mouse game of guerilla warfare. Battle simulation includes detailed challenges, including a day-night-cycle, weather, terrain, supply lines, formations, unit organization and experience, and more. Conflict in Vietnam is a classic real-time simulation game from the 80s designed by Sid Meier and Ed Bever. The third title in the 'Command Series' of tactical wargames from Microprose, the game begins with the defeat of the French colonial army and ends with the Viet Cong victory over the South Vietnam forces in 1972. Each battle has multiple variables, so you can create “what-if” scenarios, and different levels of difficulty. - Accelerated real-time simulation - Historically accurate scenarios - Different skill levels - Single player campaign - Two-play head-to-head - Choose to lead either side - In-depth historical backgrounds and hints The idea for the Command Series came from observation of actual tabletop military scenario exercises. The games challenge you to manage assets, strategically place and move them around the battlefield map, and try to out maneuver the enemy. Victory requires careful strategic thinking and fast responses to rapidly changing battlefield conditions. Sid Meier, one of the most well-known and prolific strategy game designer-producers, collaborated with historian Ed Bever to make the games incredibly historically accurate.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1703060/header.jpg?t=1643669273",
    "Price": 6.99,
    "Developers": "Microprose",
    "Publishers": "Atari",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1703060/ss_79c33dadb094402e3dcc52676ce738ecf2491da6.1920x1080.jpg?t=1643669273,https://cdn.akamai.steamstatic.com/steam/apps/1703060/ss_57b1ed0723f4f3b165450ffec649ffd24719a846.1920x1080.jpg?t=1643669273,https://cdn.akamai.steamstatic.com/steam/apps/1703060/ss_8c9eb6312e98b8fa785f173dcc08217a6165b3ba.1920x1080.jpg?t=1643669273,https://cdn.akamai.steamstatic.com/steam/apps/1703060/ss_862a6afdf8bbfcbb2bf787582c170de198dea43d.1920x1080.jpg?t=1643669273,https://cdn.akamai.steamstatic.com/steam/apps/1703060/ss_7c9b321d0ab274bcbc8b2e872b8e2ec22565e1c5.1920x1080.jpg?t=1643669273",
    "Slug": "conflict-in-vietnam",
    "Meta Title": "Conflict in Vietnam: Nov 2021, Microprose and Full Overview",
    "Meta Description": "Looking for information on Conflict in Vietnam? Check out the release date (Nov 2021), developer insights from Microprose, and a complete game summary.",
    "Alt Text Image": "Official header image for Conflict in Vietnam game - Steam 1703060",
    "Canonical URL": "https://gusku.site/game/conflict-in-vietnam",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Conflict in Vietnam\", \"description\": \"Looking for information on Conflict in Vietnam? Check out the release date (Nov 2021), developer insights from Microprose, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Microprose\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atari\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1703060/header.jpg?t=1643669273\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}