{
    "AppID": 1506450,
    "Name": "DIY MY LADY IN VR WORLD",
    "Release date": "Feb 10, 2021",
    "About the game": "DIY MY GIRL (VR edition) is a creative game that combines AI and VR technologies. This game unleashes the creativity within players, as it allows them to customize a lovely girl avatar in VR. As tested, this game supports all kinds of HTC VIVE, Oculus Rift, Valve, and Oculus Quest (via Oculus Link) headsets. Different from the existing VR girls on Steam, the girl avatar has an AI soul. Players can tailor-make their girl avatar’s body features and upload a photo from their computer to generate a face of their choice. This creative game has all the following subsystems: (1)Face This game is unique among all simulation games as it allows players to create faces through photos with one click. The AI technology used in this game ensures the complete copy of the photo uploaded by players. Note: The uploaded photo will be immediately reflected on players’ avatar, as shown in the above/below examples. All the head designs customized by the player will be stored in a VR 3D menu. Players can drag any head from this menu to their girl avatar for easy access. All 3D menus offer various options, which players can creatively use to customize their girl avatar. (2)Body shape Players can set their girl avatar’s body features at will. The 3D menu offers diverse options for bust, waist, and hip measurements. They can also choose their girl avatar’s skin tone, leg to butt ratio, and hairstyle as finishing touches. Players can unleash their creativity through the comprehensive and powerful control panel below. (3)Design Actions/Animations Players can choose their girl avatar’s movements. The game offers a library of more than 200 daily actions and 60 sets of dance actions for players to set combinations. (4)Dresses Players can pick the clothes for their girl avatar. You can create/save up to 10 DIY models: (5)Interactions Players can personalize their voice dialogues/interactions with their girl avatar. For example, if a player says “I love you” through the microphone, the girl avatar will react by blowing kisses excitedly and joyfully. Note: Players can personalize their interactions with their girl avatar, as shown in the above example. They can type specific words or phrases through the provided virtual keyboard and then set how their girl avatar reacts to them. By doing so, players will only need to speak these words or phrases via the microphone, and their girl avatar will respond accordingly. (6)Love, hate, and demand (Red bar/Blue bar) The girl avatar can understand some popular voice commands and will respond accordingly. During the game, her mood toward a player will change, and she will behave differently following her liking. For example, the girl avatar will blow a kiss to show her love: By contrast, she will prefer to be alone if she is unhappy. The game is constantly under development to improve the demand functions recognized by the girl avatar. Thus, players can enjoy more demand functions in the future. Currently, the girl avatar can feel thirsty and drink water in some scenes (not all). She also displays excitement about playing with dinosaurs on the Dinosaur Island scene. (7)Dances/Customized Dances (8)Couple tour around the world The current version boasts the following five interactive scenes: 1. The DIY Room, which is the main scene; 2. A pretty club, which includes dancing and carnival scenes; 3. The Dinosaur Island, which shows the beautiful world of dinosaurs; 4. A Sakura park; 5. A luxury villa, which is a perfect place for a couple. Finally, players will enjoy this interactive game for a low cost. They can also expect pretty a lot of further free improvements/updates in the future.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1506450/header.jpg?t=1637056740",
    "Price": 4.99,
    "Developers": "William at Oxford",
    "Publishers": "William at Oxford",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_37fbe834c89c6c1082038cfe8196c5f8fa217408.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_57ac3a4b276a43a93385b2bebd55174b40c1dfc0.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_5c826ab0cb82e28d42709da022fed31dbafd30e4.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_4592c1c3dc200c33dd6948867fa60eb8a25e8a73.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_b75fe2972a9bcf5bf3a30d074f6e7ebfb16b53d8.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_4d0d19551b988dafddfdb240712a482b1f7b4e85.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_541eecf5a457f26b581a00e8028603936de7d3f1.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_779e421fb74dc3d098632df8117a8a85a2f26454.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_df1d3fa51b32fa39f43efc44476845ebe8149655.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_5c064306f21fb820a28ed64728269aa259f81542.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_3483de576a57984e024e8ad6c62f8179121dd357.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_735a798dab05f941be31ccae64bd9d87e5e99858.1920x1080.jpg?t=1637056740,https://cdn.akamai.steamstatic.com/steam/apps/1506450/ss_df0ed6c0f5f515e1673ee5d3f754b0bd397c8fd6.1920x1080.jpg?t=1637056740",
    "Slug": "diy-my-lady-in-vr-world",
    "Meta Title": "DIY MY LADY IN VR WORLD: Feb 10, 2021, William at Oxford ...",
    "Meta Description": "Looking for information on DIY MY LADY IN VR WORLD? Check out the release date (Feb 10, 2021), developer insights from William at Oxford, and a complete...",
    "Alt Text Image": "Official header image for DIY MY LADY IN VR WORLD game - Steam 1506450",
    "Canonical URL": "https://gusku.site/game/diy-my-lady-in-vr-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DIY MY LADY IN VR WORLD\", \"description\": \"Looking for information on DIY MY LADY IN VR WORLD? Check out the release date (Feb 10, 2021), developer insights from William at Oxford, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"William at Oxford\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1506450/header.jpg?t=1637056740\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}