{
    "AppID": 889730,
    "Name": "Downtown Mafia: Gang Wars",
    "Release date": "Jul 25, 2018",
    "About the game": "A legend returns to reclaim his old neighborhood... and this time he is going to take it all. You have Jane (your old flame), Marco (the weapons guy), Luke (he knows his business) and BIG JIM at your disposal to help you take over the neighborhood. Addictive text-based Mafia MMO RPG with GANG WARS, TURF WARS, BOSSES, MERCENARIES, HIT-LIST, CITIES, MISSIONS, FIGHTS, TOURNAMENTS and much more. Cool New Features Downtown Mafia is one of the most feature-rich and diverse mafia RPG ever created. It offers players a unified gaming experience, regardless if you are on an Android device, iOS, Facebook, on your browser, Steam and even on the desktop platform. Manage your mighty mafia empire from anywhere. Explore the story-driven missions, mob up with other players and take the gang war to a whole new level of challenges. The possibilities are endless... Choose a Character Class of your style and build your criminal empire. Master gang MISSIONS (Jobs) in various cities around the world. Become a big-time gangster, FIGHT other mafiosos across other devices and platforms in real time. HIT LIST your enemies for a sweet revenge. Gain experience doing missions, fighting enemy gangs and progress through LEVELS to be the top Elite. Recruit your mob members, BUY new WEAPONS, VEHICLES, ARMOURS and SPECIAL items to arm your team. Earn unique crime REPUTATION (achievements) for reaching specific goals. Earn SKILL POINTS, upgrade your ENERGY, STAMINA and ATTACK/DEFENCE POWER. Rule the streets and build your own crime story. Build up your business empire to expand your gang, maintain your powerful weapons arsenal and unlock other high-tier properties. Add your favorite mob members to your CRIME FAMILY to keep them close and let others know about your partners in crime. RIVAL LIST keeps tab on your enemies and a chance to claim your honor back. CHAT System to communicate with other players in real time. Downtown Mafia - Live to Fight, Fight to Win! Join now and become the biggest gangster in town. (More than 1.5 million downloads on other platforms) Challenge Deadly Rivals for power ! Each city has their own powerful bosses who control everything. Fight and defeat each boss to make them submit to your power and join your gang. Let nothing stand in your way to be the top Mafia Boss! Buy up powerful arsenal to Wage War Each equipment has their own attack and defense rating which will be used by your mob when it comes to War! A right mix of weapons can determine the success or failure in a battle. Over 100+ equipments to choose from. Make sure you grab em as much as you can. Complete ASSIGNMENTS and earn unique REWARDS Assignments are story driven missions which you can fight and complete ! Completing an assignment grants you special items and powerful connections in a world controlled by Gangs. You might not want to miss them !! GANG WAR™ System for all-out war &amp; Endless Multiplayer fun ! Join powerful GANGS and rule the TURFS as a team. Chat with your GANG and equip with powerful GANG ARSENALS Engage in GANG WARS and win exciting war rewards. Earn gang's respect and become the GANG BOSS... Or start your own GANG and recruit members to build a new team Capture other GANG TURFS and assign your own Operator to collect hourly payouts to be sent to all your gang members. Capture other GANG OPERATIONS to collect payouts Join DEATH MATCHES to war with 3 other GANGS simultaneously... the winner takes all the rewards. Send and receive powerful GANG BACKUPS. Find matching gangs with HIT &amp; RUN. Fight BOSS GANGS and win exciting rewards and new GANG ARSENALS. Use FREE HITS to take revenge on your rivals who dare to mess with your gang members. Grow your GANG into Cartels(a team of gangs led by a powerful gang). Take part in weekly TOURNAMENTS and win respect, cash, diamonds in the game for your gang and yourself. REAL POWER IS NEVER GIVEN, ITS TAKEN ! Accounts ✔ Synchronise your account with Facebook, Google and Steam ✔ Custom Avatars with Gravatar ✔ In-game player profile &amp; live comments. ✔ Live leader boards (Mob-level and Global) to see where you stand against the rest of the players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/889730/header.jpg?t=1533830206",
    "Price": 0.0,
    "Developers": "DYNAMICNEXT",
    "Publishers": "DYNAMICNEXT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_8444744ac24a09611a517a32b8d2031dd8816feb.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_703ec35aa3a0cd9d10119ee296aec3060f27d129.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_e0c3398401ef9ac0e9d78f5459fad9dc843d327f.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_a9bb0c3447552be5cdff2e9e04fa1a85fc906943.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_0ac3e1d93b6a7198a52dc7ae84e6a5fdc9ad0e26.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_335d58a74158b8e5c37ced65419911586bd8ec0a.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_48721ac138d58749d0778c859f6fea43fb9dcbcc.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_ec2986d5bb85f743c75e2c7270bdce4a6742d592.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_852530c196f51aff6d7a38b97e67a215a43053f5.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_e8b4a3a566c1c475cf01c044709feb5cbae264fd.1920x1080.jpg?t=1533830206,https://cdn.akamai.steamstatic.com/steam/apps/889730/ss_86eee35285366c24abdf4316e67c0923fe67c78c.1920x1080.jpg?t=1533830206",
    "Slug": "downtown-mafia-gang-wars",
    "Meta Title": "Downtown Mafia: Gang Wars: Jul 25, 2018, DYNAMICNEXT and ...",
    "Meta Description": "Looking for information on Downtown Mafia: Gang Wars? Check out the release date (Jul 25, 2018), developer insights from DYNAMICNEXT, and a complete gam...",
    "Alt Text Image": "Official header image for Downtown Mafia: Gang Wars game - Steam 889730",
    "Canonical URL": "https://gusku.site/game/downtown-mafia-gang-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Downtown Mafia: Gang Wars\", \"description\": \"Looking for information on Downtown Mafia: Gang Wars? Check out the release date (Jul 25, 2018), developer insights from DYNAMICNEXT, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"DYNAMICNEXT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DYNAMICNEXT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/889730/header.jpg?t=1533830206\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}