{
    "AppID": 1105590,
    "Name": "Dream Cycle",
    "Release date": "Sep 7, 2021",
    "About the game": "Enter the world of Dream Cycle, a fully procedural action adventure by Lara Croft’s creator Toby Gard. Take the role of modern-day arcanist Morgan Carter and walk the planes of the Dreamlands, a twisted dimension where the souls of the living are trapped in eternal nightmare. Explore diverse dreams, and by understanding the events that transpired, free the dreamers from their perpetual torment. Using a wide variety of weapons from traditional to modern day, and a grimoire full of powerful spells, define your own play style as you plumb the depths of the infinite dreamlands. Main Gameplay Features A Harrowing Narrative Adventure Designed by veteran game developer Toby Gard, Dream Cycle is heavily inspired by Lovecraftian cosmic horror. You play as Morgan Carter, a modern-day sorceress trapped in a mysterious alternate reality. With her life fading in the waking world, Morgan must free her friend and as many others as she can from the Dreamlands before the Crawling Chaos dooms them all. A Dynamic, Adaptive Style of Gameplay With plenty of weapons, abilities, and powers at your disposal, Dream Cycle lets you truly define the way you play. Pick your favorite weapon, master the arcane, exploit your enemies’ weaknesses and find the best approach to each encounter - whether it’s full-force front assaults or silent but deadly incursions. Vanquish your foes, expand your knowledge, and invest in new skills and abilities that will help you shape the game into a unique experience. An Immersive World to Explore Follow the footsteps of Randolph Carter and Basil Elton across the vast and mysterious Dreamlands. Climb the forbidden peak of Hatheg-Kla in the stony desert, carve your way through the Perfumed Jungles of Kled, and discover forgotten palaces with veined ivory columns that sleep lovely and unbroken under the moon. Fight hideous Ghouls and vast lumbering Gugs, meet exotic tribes, and visit a wide variety of biomes steeped in the lore of the Dreamlands. A Shifting, Endless Experience An unstable realm made up of fragments of the real world, the dreamlands will change every time you visit: roll the dice and watch as the world in front of you reshapes itself. Go back to places you had already explored and face new challenges and new stories for even greater rewards. Dream Cycle is professionally voice-acted and features a completely original soundtrack by the original Tomb Raider composer Nathan McRee that further adds to the game’s uniqueness.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1105590/header.jpg?t=1655468899",
    "Price": 19.99,
    "Developers": "Cathuria Games",
    "Publishers": "Raw Fury",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_d723460fa6f9778a82c60b5c90e0c1aec5c94b1e.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_b206ee69cca3199c1874579c10c054b8c7b4bb75.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_1ff16c51cf8ddb6530a76342342ebdacdbb337fc.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_381f8cce68e5df26d3661fbfc2fd324f3329f2e8.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_fdcfcdd5ee7384d47f597cd76b169c7ddd6c6d8e.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_10f0acb696f2b27b0062d7627e8a473555bf40d2.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_73aaa2dc95e423b5075bc4c24f44d4b163145580.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_7e078cdca6e3eb2fc41b502ed4f3a75eaa3bc1f1.1920x1080.jpg?t=1655468899,https://cdn.akamai.steamstatic.com/steam/apps/1105590/ss_41da7df4d332885d6dc980373250c5866afe629b.1920x1080.jpg?t=1655468899",
    "Slug": "dream-cycle",
    "Meta Title": "Dream Cycle: Sep 7, 2021, Cathuria Games and Full Overview",
    "Meta Description": "Looking for information on Dream Cycle? Check out the release date (Sep 7, 2021), developer insights from Cathuria Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Dream Cycle game - Steam 1105590",
    "Canonical URL": "https://gusku.site/game/dream-cycle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dream Cycle\", \"description\": \"Looking for information on Dream Cycle? Check out the release date (Sep 7, 2021), developer insights from Cathuria Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cathuria Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Raw Fury\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1105590/header.jpg?t=1655468899\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}