{
    "AppID": 835640,
    "Name": "Dust and Salt: The Battle for Murk",
    "Release date": "Jul 11, 2018",
    "About the game": "From the creator of Dust and Salt comes the next tale from its world – The Battle for Murk – an interactive narrative set in a low-powered, gritty medieval world. Play as Corporal Mandrake from the City Watch in a fantasy adventure game. Collect evidence and uncover the truth in time to save your hometown from falling into the enemy’s hands. The city of Murk is under siege by a cruel barbaric leader. On his night patrol, Corporal Mandrake from the City Watch stumbles upon a treacherous conspiracy that seeks to open the city gates for the usurper. Mandrake and his patrol partner have until dawn to uncover the truth and prevent the conspirators’ plan. Explore temple dungeons, rowdy taverns, shady allies, and more. Obtain information from suspects or catch their lies by using your wits. Uncover the truth in a plot full of deception. The game consists of a story text and a city map. On the map you can choose to travel to different locations while the story text builds around the constant choices you have to make. Enjoy the vivid writings of the author Sycamore Bright. Features: A short game (about 1.5 hours) focused on a story. Although the plot is related to Dust and Salt, this can be played as a stand-alone game. For fans of Sorcery!, Fighting Fantasy and Choose Your Own Adventure. Story is king. Rich, non-linear story, reminiscent of D&amp;D. Decisions matter. Your actions define and shape the world you experience. Memorable personalities. Engage with other characters and potential suspects in the city of Murk in well-written interactive dialogues. Art that brings the story to life. Zoom-in on the world map to enjoy the detailed artwork. Immersive soundtrack. Featuring the gorgeous Nordic music by acclaimed artist Mike Olsen, a.k.a. Danheim. Story Flavor: The first sunrays were crawling hesitantly on the serrated city walls. The dark shroud of night was slowly withdrawing. The catapults had been shooting all night. Murk had managed to ward off two assaults from Wayward’s troops – one at the main gate and one by water, near Icewind Quay. Only when the morning light scattered the darkness did we see the price we had paid to survive that night: new cracks and holes in the thick city wall, a destroyed defensive tower, more homes reduced to rubble, and new fires throughout the city. At least a few dozen dead bodies laid scattered in the ashes, debris, and dust. At nightfall, Wayward’s war drums began their rumble once again. The catapults were still silent, but they would undoubtedly start singing their deathly song soon. For nine days, Wayward’s hordes had sieged Murk, and every night the city walls groaned under the volleys of stones and fire hurled at them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/835640/header.jpg?t=1569176698",
    "Price": 3.99,
    "Developers": "Prime Games",
    "Publishers": "Prime Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_c9c397c6751bcb0728872ec8bf4ae02bff464c03.1920x1080.jpg?t=1569176698,https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_9695f3fffef1d7506b3e5a5d1399409633607ea1.1920x1080.jpg?t=1569176698,https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_c4980fbf5abf9566a3e68c210127e269a26aefe3.1920x1080.jpg?t=1569176698,https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_06b73f5e68b47c687e3d68805071e87437036abb.1920x1080.jpg?t=1569176698,https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_959ce6fa59f8a51923342bf2b7bcafb7231d434b.1920x1080.jpg?t=1569176698,https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_2c532fbebcc7ce90faa9bd473d46bb26aed5deb0.1920x1080.jpg?t=1569176698,https://cdn.akamai.steamstatic.com/steam/apps/835640/ss_522befa103949860d96db2cc67c6034e44b0d9fa.1920x1080.jpg?t=1569176698",
    "Slug": "dust-and-salt-the-battle-for-murk",
    "Meta Title": "Dust and Salt: The Battle for Murk: Jul 11, 2018, Prime G...",
    "Meta Description": "Looking for information on Dust and Salt: The Battle for Murk? Check out the release date (Jul 11, 2018), developer insights from Prime Games, and a com...",
    "Alt Text Image": "Official header image for Dust and Salt: The Battle for Murk game - Steam 835640",
    "Canonical URL": "https://gusku.site/game/dust-and-salt-the-battle-for-murk",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dust and Salt: The Battle for Murk\", \"description\": \"Looking for information on Dust and Salt: The Battle for Murk? Check out the release date (Jul 11, 2018), developer insights from Prime Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Prime Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Prime Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/835640/header.jpg?t=1569176698\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}