{
    "AppID": 517720,
    "Name": "Epic Tavern",
    "Release date": "Sep 13, 2017",
    "About the game": "Award Winner: PAX 10 2019 Winner, Momocon 2018 Indie Games Awards 'A fascinating reverse-RPG' - PC Gamer 'A cross between The Sims and a rousing game of Dungeons and Dragons' - Geek &amp; Sundry One of 'The Best New Steam Games You Might Have Missed This Week' - Rock, Paper, Shotgun Epic Tavern is a narrative-focused fantasy-management-RPG where you rule the land from your Tavern. Recruit heroes, send them on quests, and reap the rewards! Build a legendary Tavern to attract Heroes from every corner of a dangerous and magical world. By bringing together courageous parties and sending them off on dangerous (and oftentimes crazy) adventures, every decision you make will alter the destiny of your Epic Tavern ! Player Choice : In Epic Tavern , every quest choice made and every adventurer befriended could unlock new quests, new alliances, or access to characters, items, and tavern building opportunities. The experience grows as you play - your choices will directly steer the fate of your intrepid adventurers! The Tavernmaster : You and your tavern are at the center of a world full of danger, intrigue and unlimited adventure. Your every choice determines the future of your establishment, bringing heroes and stories together in fellowships that will become the stuff of legend. This is where friendships are made, and where great adventures are started. In Epic Tavern , you build the destiny of your world, one drink at a time. The Adventurers : A multitude of characters drawn from 20+ classes and walks of life will visit your tavern. Mages, warriors, assassins, and more will be at your disposal! Befriend them over drinks and learn their secrets. Between quests, take their experience, level them up, and influence the nature of their destiny. The World : You will send your new friends on quests to explore the land of Beor. These quests unfold into an epic storyline unique to your playthrough. Epic Tavern pushes the limits of a player-centric narrative and creates a brand new model of the classic RPG experience. The impact of your choices will inexorably change your adventurers and the World itself! Attract Adventurers : Build a legendary Tavern that draws the greatest heroes in the world. Befriend your patrons by loosening them up with frothy pints and hire the Adventurers whose traits you desire. Unlock Quests : Perk up your ears and listen for whispers and rumors to find the opportunities you'd like your Adventurers to pursue. Assemble your Party : Choose your heroes based on their skills and strengths. Equip them with special weapons and relics, and then send them off to claim victory in their quests. Track their Progress : Follow your party on the map and see in detail how the quest is unfolding. Each encounter could yield treasure and XP, or tragedy and defeat. Sort Out the Results : Use what is earned to boost your Tavern's renown, level-up your victorious Heroes, and prepare for ever more treacherous quests. Not All Challenges are Overcome : Expect to meet failures on your path to glory. Whether or not a quest ends in victory, expect your adventurers to change! Every triumph and every sorrow weave the fabric of your world's unique destiny. The Path of Transformation : Quests will lead to important changes in your characters. What if your decision to send a fatigued and injured character on a quest leads to critical failure that results in a Total Party Kill? It’s not just a matter of who you send, but also of what happens to them on their travels. Grand adventure awaits in the world of Epic Tavern !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/517720/header.jpg?t=1593212099",
    "Price": 24.99,
    "Developers": "Hyperkinetic Studios",
    "Publishers": "Epic Tavern Holdings",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_cab768f2e7d7bc07f7b684638742ae94eeb3ba9e.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_b074f997702d39080a34040fd9129ec6c91346ac.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_c419e7974c3f0ab262310165ff11a4e60d15684d.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_fa351ebcaaab11853a8a6c864870c3a0189921e6.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_9726f01b5625badf2c4b37e07611923c7de501f6.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_b5e140e69a2201e30b7eb56900eaa07dd7f5ac90.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_4d6083048d3118fdb258cbb24d533fa80358988b.1920x1080.jpg?t=1593212099,https://cdn.akamai.steamstatic.com/steam/apps/517720/ss_33f677626316ea0d536a6ea0bfbd4bef1807d71c.1920x1080.jpg?t=1593212099",
    "Slug": "epic-tavern",
    "Meta Title": "Epic Tavern: Sep 13, 2017, Hyperkinetic Studios and Full ...",
    "Meta Description": "Looking for information on Epic Tavern? Check out the release date (Sep 13, 2017), developer insights from Hyperkinetic Studios, and a complete game sum...",
    "Alt Text Image": "Official header image for Epic Tavern game - Steam 517720",
    "Canonical URL": "https://gusku.site/game/epic-tavern",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Epic Tavern\", \"description\": \"Looking for information on Epic Tavern? Check out the release date (Sep 13, 2017), developer insights from Hyperkinetic Studios, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hyperkinetic Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Epic Tavern Holdings\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/517720/header.jpg?t=1593212099\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}