{
    "AppID": 1580800,
    "Name": "Erannorth Chronicles",
    "Release date": "Sep 16, 2021",
    "About the game": "Erannorth is the name of the world setting: an alternative Earth, where every myth and legend is real and set in a post-medieval era ready to transition to an age of enlightenment and steampunk wonders. It's also a fully customizable and moddable Card/RPG game system you can mold with ease to your wishes by editing plain text files. Erannorth Chronicles is an old-school Card Game with tabletop RPG-like progression. A sandbox experience with no main story, designed to give you absolute freedom and endless character customization. You can play any character you want, from a powerful supernatural creature to a low commoner. To succeed In your adventures in Erannorth, you must successfully combine RPG character elements and progression with trading card game mechanics. Unlike traditional Card Games, though, your Cards have meaning and grow in power as you gain additional skill ranks, attributes, and perks like spells and abilities in an RPG game. And unlike traditional RPG games, you will fight your battles using your custom Deck of Cards, which you can change and adapt freely in the middle of the fight. In a sense, Erannorth is the mad scientist's lab and theorycrafter's paradise - or hell, where you can build hundreds, if not thousands, of different decks and character combinations and *make* them work for you. If you see a card, and all you think is: 'hey, that's too weak, and not: 'how could I build a character around that?' - chances are Erannorth is the wrong game for you. Similarly, if having many choices is something you find overwhelming, then you most likely won't enjoy this game at all. Character Customization Freedom. Create your unique Hero by choosing from 13 Organizations, 13 Species (with 50 variants), and 15 Classes (with 74 specializations), each with different Skills, Perks, Starting Decks, and Card Pools. If you feel overwhelmed, jump into the action instantly with one of the 18 pre-generated characters, or roll a random character. Your Skills will affect both your card pool and the effectiveness of your cards, while your Perks will let you increase specific card effects and tailor your cards around your build. There are no weak or strong cards, as cards have no meaning outside your build. No tedious Unlock systems. Play the hero you want, whenever you want. Be a mighty supernatural predator or a lowly human struggling for survival. Deckbuilding Freedom. Build hundreds of different decks and collect over 3500 + cards. Adjust your Deck and Add and Remove the cards you collect at any time. Tactically switch Decks &amp; Equipment during Encounters to gain an advantage or get out of a tough spot. Fetch &amp; Use Consumables from your Backpack. Free Sandbox Exploration. Roam in a giant sandbox world with many different locations, challenges, and treasure hunts. No 'forced story.' Just your imagination (and dozens of multi-branching and randomized events to spice up and make each Adventure feel different). Choose which areas to explore (and when). Adapt your deck and tactics to gain an advantage and overcome the ever-changing leylines. Versatility is the key to life and death. Experiment with different Action card combinations and overcome 400 unique enemies that can level up 'indefinitely.' Enemies have different Damage types, Resistances, Vulnerabilities, Immunities, and a decision-making AI that will react to your Actions. Your build *will* fail. But you have all the tools to bounce back and adapt. Enemies will resist your spells, but you have tricks on your sleeve to overcome them. Full Modding and Steam Workshop Support Single player means 'your game, your rules. And Erannorth lets you do just that. Adapt the game to your skill by making everything harder, more hardcore and rogue-like, or easier, casual, and relaxing. Tweak, Mod, and create your game modes, locations, events, enemies, cards, classes &amp; species, etc. All the software you need is your text editor of choice. Change the card, ally, and enemy artworks by copying/pasting your images into a mod folder. Includes UI-based Game Mode editor to create your modes and custom difficulties easily. Modding a game was never easier!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1580800/header.jpg?t=1652377026",
    "Price": 19.99,
    "Developers": "Spyridon Thalassinos",
    "Publishers": "Spyridon Thalassinos",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_0f558b14f132131dcd7cc72913badf51377136f8.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_8e5bcf46448ca12a05bc5d0ebc03ab618e87f269.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_67d9bae6a6f3d7f9069f4d75100033456ab8afca.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_4c7ab7a794bfdf5ea03e7959151bd35c7b4542b1.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_d4908e7d13ea48d60711af394a89ffbec59c42bd.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_47d56ea702a157ff59b0e589674975f19e254079.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_5d63a701c4ad4207a376d6592ae5562a1f8e1bb4.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_1deafbe4ed4fb46540de8c229437765320a18f22.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_4b831a55c288d7113fad562808faf7d034cabc54.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_b618114cb9ee1b908924d0f81f68bc9198fad58d.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_122fdbb59779b06e0f1bc037046da450b340b43b.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_df39c6c8a2370da1a2ca028085f588ff541465e4.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_87cbe09c0f0d295755f58aba028813d14472f23b.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_c26af32b6856d5f3641c06471cea40efd4b1d2c9.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_fbd88e5eaee5e0f673a5a411ef704406e041ccf9.1920x1080.jpg?t=1652377026,https://cdn.akamai.steamstatic.com/steam/apps/1580800/ss_fcf7185e217979d6abf00c3d036b02261a981450.1920x1080.jpg?t=1652377026",
    "Slug": "erannorth-chronicles",
    "Meta Title": "Erannorth Chronicles: Sep 16, 2021, Spyridon Thalassinos ...",
    "Meta Description": "Looking for information on Erannorth Chronicles? Check out the release date (Sep 16, 2021), developer insights from Spyridon Thalassinos, and a complete...",
    "Alt Text Image": "Official header image for Erannorth Chronicles game - Steam 1580800",
    "Canonical URL": "https://gusku.site/game/erannorth-chronicles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Erannorth Chronicles\", \"description\": \"Looking for information on Erannorth Chronicles? Check out the release date (Sep 16, 2021), developer insights from Spyridon Thalassinos, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spyridon Thalassinos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spyridon Thalassinos\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1580800/header.jpg?t=1652377026\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}