{
    "AppID": 919410,
    "Name": "Felix The Reaper",
    "Release date": "Oct 17, 2019",
    "About the game": "Felix The Reaper is a challenging single-player puzzle game . You take on the role as Felix, whose job is to make sure that people die . To do this, Felix must work in the shadows and rearrange faith so that death is always the end result. At its core, the game is about manipulating shadows so that Felix can set up his targets safely covered by the shadows. The core gameplay has a Hitman Go'ish, Monument Valley'ing and Sokoban-like simplicity running through it. There are three rules you have to master to become a successful Reaper: Rule #1: Stick to the shadows Each level is set on a grid-based platform. The squares of the grid are either lit up or in shadow, and Felix has to do his job in the shadows. Rule #2: Control the shadows Felix has the ability to rotate the sun, and move objects, to create new pathways for him to reach his target. Rule #3: Make sure people die The end goal of each level is to set up your targets and have them meet their maker. To add something extra to this core game experience, we wrapped it in deep layers of storytelling, death, dance, art history, love and comedy. That way you get to enjoy a wholesome story world, while boiling your brains on complicatedly straight forward shadow puzzles about Death. Challenging single-player puzzle game . Take on the job as The Reaper and make sure people die . Make sure to stay in the shadows . Light is the domain of life. Not good. Control the shadows to reach your target. Enjoy a framing narrative of dangerous love and peculiar characters. Dance along with Felix to an original soundtrack from 10+ indie music artists. Unlock time trials and hardcore levels for an extra challenge. Felix The Reaper sprang from a fascination with the sprawling, humorous and grotesque art history of Death. Many themes have emerged in the cultural identity of Death, including The Dance of Death or Danse Macabre and Death And The Maiden . We sort of mashed those two themes together in Felix The Reaper. For the character himself and the world around him, the inspiration was more diverse: We took cues from the ancient TV show The Twilight Zon e, medieval painters like Bruegel and Bosch and the cartoon characters of Adventure Time and Hayao Miyazaki . Another important inspiration for Felix The Reaper was the amazing artistic collaborators in the production. We worked with dancers, a long list of music artists and history scholars. The Dance Several dancers contributed to the game's production, and eventually Gunilla Lind and Raphaël Ferdinand Eder-Kastling improvised the final moves that ended up in the game. Here's Gunilla doing a dance move for Felix: And here's Raphael doing another: The Music Of course a game with a dancing protagonist needs great music—why else would he be dancing? We designed the game in a way that lets the music artists be themselves. We wanted them to add to the game through their personal artistic expression, rather than ask them to be what we want them to be. This made for a varied and strange combination of music. But since the gameplay is a non-stressful puzzler, you actually have time to appreciate and enjoy the weirdness while playing. The Art History The idea for the game itself stems from art history. We actually started with The Danse Macabre and Death and The Maiden as a basis, and then asked ourselves: How can we make a game about this? Eventually and through several different prototypes, we ended up here. Alongside the production, a history scholar was diving into the art history of Death across more than 10 centuries for a book manuscript he is working on, and every time he hit upon something interesting he told us, and we tried to put it into the game if it fit. There are five different articles by this historian Søren Hein Rasmussen within the game—you can unlock them as you progress.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/919410/header.jpg?t=1642454254",
    "Price": 1.19,
    "Developers": "Kong Orange",
    "Publishers": "Daedalic Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_c8744f1635ffae5a84f266cb7578c0562d165d47.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_1eb0bb88be2a2327862c4ce304aafe9c2a3c600c.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_55368e14c3b99cf397fc9913d65534d45230b52d.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_467df83b6f7c38b9d9e8569f5c04aadc0095acdf.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_eb24c8c2b2928d744d6bf6631ee51445c2519cd6.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_e625cb7a15637927c738c80ed35c232745e37e91.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_11e9caa5b81bc8ebd72ef9c05cb3b1838f290dde.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_68d085d6aedfcef00c9604e69a5780ec574c478b.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_b7a33080d22669c7b6b260105d7c767497175d23.1920x1080.jpg?t=1642454254,https://cdn.akamai.steamstatic.com/steam/apps/919410/ss_087cbe39d211c588849306c86c45bdf0f68f9de9.1920x1080.jpg?t=1642454254",
    "Slug": "felix-the-reaper",
    "Meta Title": "Felix The Reaper: Oct 17, 2019, Kong Orange and Full Over...",
    "Meta Description": "Looking for information on Felix The Reaper? Check out the release date (Oct 17, 2019), developer insights from Kong Orange, and a complete game summary.",
    "Alt Text Image": "Official header image for Felix The Reaper game - Steam 919410",
    "Canonical URL": "https://gusku.site/game/felix-the-reaper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Felix The Reaper\", \"description\": \"Looking for information on Felix The Reaper? Check out the release date (Oct 17, 2019), developer insights from Kong Orange, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kong Orange\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daedalic Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/919410/header.jpg?t=1642454254\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}