{
    "AppID": 611730,
    "Name": "Galactic Feud",
    "Release date": "Jul 18, 2018",
    "About the game": "Welcome to GALACTIC FEUD! Play WITH YOUR FRIENDS locally or online in this fast-paced party brawler. Compete against each other in this fun filled, hilarity ensuing, adrenaline pumping, caffeine consuming, all out chaotic brawl fest. Current features 12 Exciting Maps 5 Chaotic Game-Modes 80+ unlock-able cosmetics Over a dozen unlock-able weapons Local or Online Multiplayer with your friends! Player servers! Partial controller support (Handles everything except kicking players and inviting/joining through Steam) Everything was going well for The Host and Galactic Feud. So well, that the executives had approved the use of the Grab-a-Tron to get more contestants for future seasons. Only problem was, the increase in new roommates caused conditions to become disgusting and difficult. The Originals (the first contestants grabbed) had had enough. They were promised freedom for fighting and it didn't look like they were going to be sent home any time soon. Zork rallied his new friends and began their final fight. The Contestant Rebellion of 2078xi ended almost as quickly as it started. The contestants had made easy work of all the untrained over-paid executives. That was until they stepped into the Host's office. Standing on top of his enourmous desk, The Host smiled as he held up a small remote device. His finger danced over the bright blinking red button. He taunted the angry rebels, trying to convince them he held their lives in his hands. All the contestants looked to Zork for their next move. He knew they were tired and worn out; it was time to make a deal. Aiming high, he tried to gain everyone's release. By the end of negotiations he had garaunteed their freedom but only after the new season ended. It wasn't perfect, but it was something and the contestants knew if The Host didn't hold up his end of the deal they could just fight their way out. They all started heading back to their chambers when The Host suddenly slipped trying to get off his desk. Everything happened in slow motion; he fumbled with the device, tossing and turning, falling through the air. It all ended abruptly with the sound of a button clicking. That's when the rhythmic beeping began. He looked over at his contestants, each one now had a green blinking light in their chest. Seconds later they all exploded into bits and parts. At first, The Host was frantic trying to put all the pieces back together. It was impossible, nothing matched anymore and he just sat in silence thinking about all the money he lost. It took sometime for him to realize the potential of this ... opportunity, but once he did It didn't take long for The Host to pull the plug, or in this case push the button, on the rest of his staff. Now he could make his contestants look any way he wanted and the best part was the exploding microchip had fried everyone's hypothalamus, making them addicted to combat and competitions. SPECIAL THANKS We would never have made it to this point with out the help provided by these wonderful people. Thank you so much for testing with us, telling us our ideas are terrible and being all around great people! [TCI] Pillow - TheLoneK - Chaos4000 - KillerHippie - Wolfieboy21 - Apollyoned - Meximus -JosephSolar - FaceTheSound - Porty - ZhrChaos - The_Cliffy - Stumpt Games - ChaoticHD - Trinax - KIT - AKillerDogV100 - Dardanos_of_fate - MonkeyMan1520 - Wacky - Gornall27 - Gear - Nate - The minimum requirements represent the absolute minimum specifications required to run the game, however they will not result in a perfect experience and you will have minor visual issues.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/611730/header.jpg?t=1544531586",
    "Price": 9.99,
    "Developers": "FAT BOMB STUDIOS, LLC",
    "Publishers": "FAT BOMB STUDIOS, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_d774af7b32b5ce1e3b5abaaa65ab010125cda07d.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_134e94394b6c468e449b2507ee2d81f8f50cb952.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_b0dd6f1c3825213b8ed2ea34b71c19689d81e45b.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_d53eb32c8cd517ce4c2a18326389b9027241a459.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_4961fa080e8732e665d67f07fc192e1aed8bde4d.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_429745f2d73d8ca47710c27b87bde86a786af050.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_f98d6cf8e5ea5acf2b8519de9a36260d256364c0.1920x1080.jpg?t=1544531586,https://cdn.akamai.steamstatic.com/steam/apps/611730/ss_26795bdb30b419e4e380f2c74f0e33c05489c399.1920x1080.jpg?t=1544531586",
    "Slug": "galactic-feud",
    "Meta Title": "Galactic Feud: Jul 18, 2018, FAT BOMB STUDIOS, LLC and Fu...",
    "Meta Description": "Looking for information on Galactic Feud? Check out the release date (Jul 18, 2018), developer insights from FAT BOMB STUDIOS, LLC, and a complete game ...",
    "Alt Text Image": "Official header image for Galactic Feud game - Steam 611730",
    "Canonical URL": "https://gusku.site/game/galactic-feud",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Galactic Feud\", \"description\": \"Looking for information on Galactic Feud? Check out the release date (Jul 18, 2018), developer insights from FAT BOMB STUDIOS, LLC, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"FAT BOMB STUDIOS, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FAT BOMB STUDIOS, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/611730/header.jpg?t=1544531586\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}