{
    "AppID": 613020,
    "Name": "Gem Hunter",
    "Release date": "Apr 28, 2017",
    "About the game": "Gameplay Gem Hunter is a story-driven action adventure platformer for the HTC Vive and Oculus Rift . Fly your Hovercraft on a quest to help recover the Fox King's stolen Diamonds and defeat the three Witch Sisters. Mine gems, battle creatures, uncover secrets, solve mysteries, customize your ship, and claim the highscore on the online speedrunning leaderboards for monthly prizes! Game Content 2-4 hours of Story-driven Gameplay, spanning across 10 full Stages to explore and 28 Diamonds to discover and collect. 4 Epic Boss Fights that will require you to hone your skills to complete. Multiple Endings based on who you decide to help or betray. Competitive Speedrunning Leaderboards with monthly prizes for top scorers. Compete in both 100% and Any% categories Comfort Options: Steer your Hovercraft via Motion Controllers or by Headset. Uses Peripheral Vignetting to ease rotation. Original Orchestral/Synth Soundtrack Challenging Platforming &amp; Thinking puzzles Hovercraft Customization &amp; Upgrades: Gain the ability to Dash, summon Shields, and Spring Jump high into the air. Discover secret new Ammo types, change your ship's Color scheme, upgrade your Thrusters, etc. 6+ Unique enemies, ranging from Rock Golems to Flying Robot Drones, and Venom-spewing Plants to Dragons. Mine gems out of rocks to give your ship new powers! Collect Citrine, Amethyst, Emerald, Ruby, and Sapphires. Story The Fox King has hired you to reclaim the Castle's stolen Diamonds from the three Witch Sisters; Dezravella, Petrichora, and Ravanna. His emissary explains that the sisters have scattered the missing Diamonds across the magical worlds contained inside each of the Castle's many Paintings. As you begin your journey by tracking down Dezravella, a Dragon Riding Fire Witch, you discover that not all is as it seems, and there may very well be two sides to this story. It is up to you to choose right and wrong: Whether you ought to fight the Witch Sisters and collect Diamonds for the Fox King, or to break oath and help Ravanna restore peace to those worlds the Diamonds have been taken from. Locomotion Disclaimer This game uses Sliding Locomotion. If you are prone to VR Motion Sickness, there are Comfort Settings and alternate locomotion methods available in game that haven proven extremely effective for Roomscale VR players. However, for extreme cases they may not be adequate. You have been warned.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/613020/header.jpg?t=1493409817",
    "Price": 5.99,
    "Developers": "FoxLeap",
    "Publishers": "FoxLeap",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_1d5970b069ca4948fffb137c1a92aab1dccaecf4.1920x1080.jpg?t=1493409817,https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_ab6f4719541be12c23d6802c23e8af3eb8f03491.1920x1080.jpg?t=1493409817,https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_9f0b7462378335faef76d87e0e2a6e66f740acbb.1920x1080.jpg?t=1493409817,https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_b75695d6c16c64fcb8c0c3cedbeed7f63ac1807d.1920x1080.jpg?t=1493409817,https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_12acc41bb40d91cb501239f82866b00f23f2e63e.1920x1080.jpg?t=1493409817,https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_fd601b7b1065d69c0bfb3db6eebc8d2c41ea53d6.1920x1080.jpg?t=1493409817,https://cdn.akamai.steamstatic.com/steam/apps/613020/ss_6040486b3bd9eaa9a3ec0df412b6c6c784d12a0a.1920x1080.jpg?t=1493409817",
    "Slug": "gem-hunter",
    "Meta Title": "Gem Hunter: Apr 28, 2017, FoxLeap and Full Overview",
    "Meta Description": "Looking for information on Gem Hunter? Check out the release date (Apr 28, 2017), developer insights from FoxLeap, and a complete game summary.",
    "Alt Text Image": "Official header image for Gem Hunter game - Steam 613020",
    "Canonical URL": "https://gusku.site/game/gem-hunter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gem Hunter\", \"description\": \"Looking for information on Gem Hunter? Check out the release date (Apr 28, 2017), developer insights from FoxLeap, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"FoxLeap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FoxLeap\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/613020/header.jpg?t=1493409817\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}