{
    "AppID": 923810,
    "Name": "If My Heart Had Wings -Flight Diary-",
    "Release date": "Feb 27, 2019",
    "About the game": "All characters appearing in this game are over 18 years old. While If My Heart Had Wings -Flight Diary- is technically a fan disc for If My Heart Had Wings , it includes six stories - including the prologue and epilogue to the main story - and acts as a sort of sequel to the original. There are no common routes, and each respective story is played as a standalone story after selecting it from the startup screen. There are also no branches in the stories. Story 'All people meet in the sky!' A group of boys and girls have their first real encounter with the sky - an encounter which provides the foundation for their new shared dream: to soar to the far side of the clouds, on wings into which they've poured their hopes and wishes. The setting is Kazegaura - a lovely little town where the wind blows pleasantly. Today, a boy named Aoi Minase waits for the wind with his friends on a hill lined with windmills. Once again, they await the time for departure - to take off on the sprawling, white wings of a glider. The sky above stretches out to infinity. Their goal: the highest point in the sky possible. Individual Story Details Inherited Wings: Soaring Club Epilogue The vivid colors of summer have long become familiar and normal. One boy searches for the continuation to yesterday's answer... Aoi has made the decision to quit the club once the summer ends. But the Soaring Club is now faced by a certain problem. It's the sort of problem for which answers will not come easily. Kotori is plagued with anxiety. In this place to which she had once escaped, she had found hope - the hope to dream. But it's that very dream itself that she now can't seem to find... This is the tale of Kotori and Aoi, two birds locked in a cage, finding the courage to spread their wings to their own 'next sky'. Wings of Dreams: Soaring Club Prologue The wings of dreams fly on a new wind. Amane has found the answer she was promised. Her dream of crossing through the corridor of the clouds together with her new friends has been fulfilled. She's filled with nostalgic memories... Isuka's heart pounds as she hears this. With everyone so radiant, she feels an overwhelming sense of pressure and pain. 'I want to experience this miraculous sky, one more time...' Thus begins the prologue to a new tale about friends managing to come together once again. Inexpressible Emotion: Hotaru The story of Hotaru Himegi. Production is underway on a promotional video to pique the interest of next year's batch of new students. In the process, a mistake on Hotaru's part causes Aoi to injure his knee. Haunted by a feeling of responsibility for the accident, Hotaru volunteers to help out Aoi's mother at Flying Fish Manor. 'I'll do anything. Please, just ask - Master Ao-nii.' Unfamiliar Answer: Kanako The story of Kanako Sigure. A typhoon has forced the postponement of the first test flight of the school year. Apart from the occasional spot of trouble here and there, it was a regular day like any other. As Kanako wakes up in the morning, she immediately realizes that she hadn't been sleeping in her own bed - but Aoi's. A young man and woman spending an entire night alone together. It would actually be stranger if nothing whatsoever had happened... 'Have I... made a mistake?' The Kazato Sisters: A Day in the Life This story takes place after you begin dating the Kazato sisters in the main story. The Day I Found My Wings In this story you can read the events of the main story in a novel written from Kotori's perspective.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/923810/header.jpg?t=1573644022",
    "Price": 14.99,
    "Developers": "MoeNovel",
    "Publishers": "MoeNovel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_24e874fbdccd4a11920570ba3b350ae12b587a9a.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_cb90a26721f5a3be936ce85ce0de1ab525d4912a.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_4f18a16328ed65a142515da9eb8eaff45f174ddf.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_0acc64d76f93d226050ba07239ceb04bed72c562.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_e108abfc32f6f06ef2d189fec8453661484afcc2.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_2913a57c0c5b52937351c48b65b5c560a02d400f.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_5412926bd09281b1e4ce8cfc4e1cce793087a8ac.1920x1080.jpg?t=1573644022,https://cdn.akamai.steamstatic.com/steam/apps/923810/ss_8279835abced8c07e220a65c5bf73953e48b9cb5.1920x1080.jpg?t=1573644022",
    "Slug": "if-my-heart-had-wings-flight-diary",
    "Meta Title": "If My Heart Had Wings -Flight Diary-: Feb 27, 2019, MoeNo...",
    "Meta Description": "Looking for information on If My Heart Had Wings -Flight Diary-? Check out the release date (Feb 27, 2019), developer insights from MoeNovel, and a comp...",
    "Alt Text Image": "Official header image for If My Heart Had Wings -Flight Diary- game - Steam 923810",
    "Canonical URL": "https://gusku.site/game/if-my-heart-had-wings-flight-diary",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"If My Heart Had Wings -Flight Diary-\", \"description\": \"Looking for information on If My Heart Had Wings -Flight Diary-? Check out the release date (Feb 27, 2019), developer insights from MoeNovel, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"MoeNovel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MoeNovel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/923810/header.jpg?t=1573644022\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}