{
    "AppID": 1964540,
    "Name": "Isolate ME!",
    "Release date": "Jun 10, 2022",
    "About the game": "Hard times have come for a simple provincial town - a pandemic. An unknown virus has begun to spread rapidly around the world, and in a small provincial city, it is time for the administration to make important decisions in order to do everything possible for the safety of the city. Who will take matters into their own hands? the president? Major? Superman? No! All powers were transferred to the valiant policeman, who must control the number of infected people in the city. How long can you last? The game consists of endless waves, which are divided into 2 stages: The first stage is a seasonal disease. During this period of time, the virus does not spread between citizens, you have a tip about their approximate number in the city. Quarantine as many of them as possible before the start of the second phase and prepare the city for the season of the spread of the disease. The second stage is a pandemic. At this stage, the virus begins to spread from those infected who remained in the city in the previous stage. Your task at this stage is to prevent the number of infected people from becoming more than healthy ones. After completing the second stage, you return to the first. BUT SUDDENLY!!! A new strain of the virus appears at the same time as even more people have settled in the city! Where is the administration looking? It doesn't matter, as long as there is a super responsible policeman in the city, everything is under control ... probably ... The game ends when the number of infected becomes about 80% of the total number of citizens in the city. At the very beginning of the game, you have a thermometer with which you can measure the temperature of a citizen, if he has a high temperature, then he must be urgently isolated! Otherwise, issue him a certificate of verification (just don't issue a certificate by mistake!) Use support from the police department, hire interns to help check the temperature of civilians on the street, build barricades to restrict the movement of citizens, set up cameras with a thermal imager to better see the situation around. The future spread of the disease in the city depends on your tactics. In addition to the situation with civilians, we must not forget about ourselves! Change your mask and gloves in time, as they help reduce your risk of contracting the virus yourself, the more often you touch people, the faster items are consumed. Also, remember to use a disinfectant to reduce your own infection rate. These items are available for purchase at pharmacies. Every time you start the game, the city is procedurally generated so that every game experience is new.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1964540/header.jpg?t=1654845516",
    "Price": 2.99,
    "Developers": "LBeastwood",
    "Publishers": "LBeastwood",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1964540/ss_86bb3621575ffeebc0041a4fef92fca6ddfb4d3a.1920x1080.jpg?t=1654845516,https://cdn.akamai.steamstatic.com/steam/apps/1964540/ss_d5948b2c144f5aba257dbdc034740441d0fac3fe.1920x1080.jpg?t=1654845516,https://cdn.akamai.steamstatic.com/steam/apps/1964540/ss_7d856427774cea9239b2f1655e0e7403cde1a45f.1920x1080.jpg?t=1654845516,https://cdn.akamai.steamstatic.com/steam/apps/1964540/ss_d9a0c63889aadf78e355943dedf684383342b548.1920x1080.jpg?t=1654845516,https://cdn.akamai.steamstatic.com/steam/apps/1964540/ss_49e5c705879b6ba088793eeaf3d9a1cf496c8591.1920x1080.jpg?t=1654845516",
    "Slug": "isolate-me",
    "Meta Title": "Isolate ME!: Jun 10, 2022, LBeastwood and Full Overview",
    "Meta Description": "Looking for information on Isolate ME!? Check out the release date (Jun 10, 2022), developer insights from LBeastwood, and a complete game summary.",
    "Alt Text Image": "Official header image for Isolate ME! game - Steam 1964540",
    "Canonical URL": "https://gusku.site/game/isolate-me",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isolate ME!\", \"description\": \"Looking for information on Isolate ME!? Check out the release date (Jun 10, 2022), developer insights from LBeastwood, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LBeastwood\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LBeastwood\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1964540/header.jpg?t=1654845516\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}