{
    "AppID": 868520,
    "Name": "killer7",
    "Release date": "Nov 15, 2018",
    "About the game": "From the minds of iconoclast writer/director SUDA51 (Goichi Suda) and legendary directors Hiroyuki Kobayashi and Shinji Mikami, killer7 returns for the first time in over 13 years! From the renowned studio Grasshopper Manufacture, Ltd. comes a cult classic adventure game that cemented the studio's international fame and recognition. (Photosensitive seizure warning: Game may potentially trigger seizures for people with photosensitive epilepsy. Viewer discretion is advised.) Dive into a dark world of underground assassins in a tale of revenge as Harman Smith, a man who manifests 7 deadly personalities into the real world, known as the killer7. Take control of this distinct murderers' row as they hunt down the sinister Kun Lan, to stop his plan of world dominance, and end his organization of deadly suicide bombers known as 'Heaven Smile.' Multiple Personalities - Take control of Harman's distinct 7 personalities, each with their own appearance, personality, weapon of choice and special ability. A Sinister Foe - Face off against the 'Heaven Smile' organization in a unique combination of first and third-person shooting mechanics. Killer Moves - Utilize the full host of killer7's special abilities to reveal secrets and solve puzzles. Your Pick - Switch between personalities at will to best tackle every encounter. A Dark Path Awaits - Follow a deeply engaging storyline brought to you by one of the highly acclaimed creators of all time, SUDA51. A New Look - Optimized for PC, now experience the cult classic like it never has before! A Killer Style - A timeless visual style that wowed audiences from its first reveal, perfectly ported to modern machines. killer7 chronicles the connection between two men whose intertwined path develop into a compelling tale of revenge and altering personas, propelling players into the consciousness of one man, Harman Smith and his seven different personalities. Your goal: stop Heaven Smile, a group responsible for a wave of indiscriminate violence that is plaguing the world. Unique characters, complex story, and dark imagery presented with striking cel-shaded graphics are all the essential ingredients for this classic title. CHARACTER PROFILE Harman Smith The central character in this story. He is an elderly man of 65, physically dependent on his live-in nursing assistant. However, when aroused he shows his true colors as the 'God Killer.' His massive armor piercing rifle is one of his professional trademarks. - Weapon: Armor piercing rifle Garcian Smith The leader of 7 different personalities and also a loyal servant of Haman. He's low-key and nothing's ever humorous to him. He uses his special telegnosis ability to search and destroy the Heaven Smiles that use optical camouflage. - Weapon: Handgun with Silencer Dan Smith The most aggressive personality with the biggest attitude out of the 7. He's dressed cool with a suit and tie. No one will mistake him for a business man, at least not with his big revolver he carries all the time. There is hatred in his eyes. Some even say that if you stare into his eyes, you can see the devil. - Weapon: Custom Magnum Mask de Smith A mysterious former professional wrestler, he managed to build quite a following with this unique blend of Lucha Libre and British Lancashire style wrestling. There are rumors of his rampaging maskless through the ranks of the No Holds Barred circuit as well. Just when he had been invited to New York to appear at the main event, he vanished without a trace. His specialty move is known as the Smith Special (usually referred to in wrestling circles as the 'burning hammer.') His double grenade launchers pack a powerful punch and can fire normal, Electric, and Gravity grenades. Animals naturally flock to the young and kind-hearted Babyface. - Weapon: Double Grenade Launchers Coyote Smith Like a venomous serpent, he's a cold-blooded personality. A Latino thug who knows his ways in the streets. Coyote is synonymous with the 'art of lock-picking.' He's a man who knows how to get things. It's this extraordinary skill that qualifies him as a member of the Smithe Alliance. Also worth mentioning is his ability to take lives brutally. - Weapon: Custom Revolver Kevin Smith This albino man uses a knife as his weapon of choice. He can disappear into thin air by taking off his shades. He favors solitude over harmony. They say he's not a man of many words. But in actuality, no one has ever heard him speak. Some rumor that his voice can summon gods. - Weapon: Knives/Throwing Knives Kaede Smith The only girl in the killer entourage. She summons hear deadly spirits by blasting out a shower of blood from her wrist. Because she lives a life so close to death, her ability to survive life-or-death situations is beyond that of any living man. Her specialty is long-range shooting. She's able to use a 2-step zoom when firing her weapon. On a personal level she's very passive and tends to keep her distance from others. - Weapon: Automatic Pistol with Scope Con Smith The blind boy Con has exceptional hearing that allows him to visualize sounds. He also has an awesome rapid-fire ability. Another nice attribute is his super running speed that if he wanted could outrun almost any enemy. When he's asleep, he's just an average child. Nobody would suspect him of being an elite assassin. - Weapon: Double Automatics ENEMY PROFILE Kun Lan A parasitic avatar from Haman Smith's past. With the power of the gods, he brought forth the 'Heaven Smile.' His plan is to bring down the Federation of States. Heaven Smile Violent beings who exist through the hand of Kun Lan. Their sole mode of attacking is to get near their targets and blow themselves up. In urban camouflage, they are very difficult to spot with the naked eye.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/868520/header.jpg?t=1599768388",
    "Price": 19.99,
    "Developers": "GRASSHOPPER MANUFACTURE INC.,Engine Software BV",
    "Publishers": "NIS America, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_fdc3129d384feeb4a4e722d71d6cd761231c7340.1920x1080.jpg?t=1599768388,https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_f2bb979273fc6f02856fd13583ab499488f54240.1920x1080.jpg?t=1599768388,https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_073648236ac399c2e7f56c78f1bdf33292379fc2.1920x1080.jpg?t=1599768388,https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_97efcd15cfb406b80c43ba15c65700427cb0f477.1920x1080.jpg?t=1599768388,https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_02ff376eb0f69fb167e0ff15169bd8d65f9a7c47.1920x1080.jpg?t=1599768388,https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_6a1bde35f8818772cdd23dd06ceec860ee55d3b9.1920x1080.jpg?t=1599768388,https://cdn.akamai.steamstatic.com/steam/apps/868520/ss_0a157dd2f57c7b12c94bbc17bf8d8f3bd87ac023.1920x1080.jpg?t=1599768388",
    "Slug": "killer7",
    "Meta Title": "killer7: Nov 15, 2018, GRASSHOPPER MANUFACTURE INC.,Engin...",
    "Meta Description": "Looking for information on killer7? Check out the release date (Nov 15, 2018), developer insights from GRASSHOPPER MANUFACTURE INC.,Engine Software BV, ...",
    "Alt Text Image": "Official header image for killer7 game - Steam 868520",
    "Canonical URL": "https://gusku.site/game/killer7",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"killer7\", \"description\": \"Looking for information on killer7? Check out the release date (Nov 15, 2018), developer insights from GRASSHOPPER MANUFACTURE INC.,Engine Software BV, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"GRASSHOPPER MANUFACTURE INC.,Engine Software BV\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NIS America, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/868520/header.jpg?t=1599768388\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}