{
    "AppID": 1266980,
    "Name": "Madrun",
    "Release date": "Apr 11, 2020",
    "About the game": "Race against up to 7 other players online and create catastrophic chaos with items beyond insanity. Breaking the tradition of single-player, story-based platformers. Interested? This is the brand new 2D platformer experience you want. This is a completely free game with no in-game purchases or advertisements. It's meant to be available for anyone to enjoy. Gameplay The game consists of 20 levels, each with their own themes, gimmicks, and difficulty. The game also includes a random level generator. Each race is unique. No matter how many times you play any level, a new race will never be the same. When you hit a '!' block, you'll receive an item. The item distribution is based on your position and random chance. The further behind you are, the more powerful your items will be. Use your items quickly to ensure maximum chaos~ Racing is separated into three modes: Online VS, Local Duel, and Time Attack. In Online VS, you can connect and race with up to 7 other players. The bigger the room, the more chaos and destruction... In Local Duel mode, you can race offline against a friend on the same device on split-screen. The default controls are recommended (player 1 on WASD, player 2 on arrow keys). In Time Attack mode, you can race offline alone for the best record in every level. Menu Navigation The title screen allows you to choose between the three racing modes, settings, credits, and help. The settings menu has multiple functions. First, you may change your controls. The Online Mode toggle allows you to choose between playing with players from all over the world or just from your region. You can turn on or off player names during online races and the minimap. Lastly, you can switch between full-screen and windowed mode. The help menu explains the functionality of each item in the game. The credits menu lists the contributors who made this game for you. In the Online VS menu, you can host a public room (anyone can join), host a private room (only players who know the exact room name can join), join anyone's public room, or join a private room with the correct room name. Once in a room, you'll be able to chat with the other players, and the host decides when the game will start. After the room starts, all players will vote for a level to race in and a vote will be chosen randomly. Then it's time to wreak havoc and race to the flag! While racing, you can press Enter to pause the game. In Online VS and Local Duel, you can either continue the match or quit the match from the pause menu. In Time Attack, you can also retry the level from the start. Controls The default controls are A and D for running, W for jumping, and S for item. For player 2 in Local Duel, the respective controls apply to the arrow keys. You can navigate the menu with your mouse. You can change the key bindings to anything of your preference in the settings menu.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1266980/header.jpg?t=1617361949",
    "Price": 0.0,
    "Developers": "Tianyu Cao",
    "Publishers": "Tianyu Cao",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_0cf383a46f87161109f1d53f5ea1895a096523c0.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_06e50a9b752c2988d9b0a59ca96b4cf072ccb394.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_4a0ff69228b47e3322463f9ff31a353c3aa3bccb.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_bc6062f67d9ce7bee306019dd18e59c82158d53d.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_737292fb8d486f26f99d9a8b3bdac034f2d0a5b4.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_1e8880423bc2b1984159f1c246d216157eee1acd.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_a1bb925a85993cb11435e8bb76dd861e540ae46f.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_e69406600644099a21061e914cd51956a30d8a00.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_052feacc8985bbed0a3ab6612c583911b542174a.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_52b90f80aa4210dc4331ec9fce58d191dcc27537.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_3f6fb0cba66160ce810dd7daf73dfefbf1c63a72.1920x1080.jpg?t=1617361949,https://cdn.akamai.steamstatic.com/steam/apps/1266980/ss_467de44fcecce5cfb81f58aee98db6d4d8ee1758.1920x1080.jpg?t=1617361949",
    "Slug": "madrun",
    "Meta Title": "Madrun: Apr 11, 2020, Tianyu Cao and Full Overview",
    "Meta Description": "Looking for information on Madrun? Check out the release date (Apr 11, 2020), developer insights from Tianyu Cao, and a complete game summary.",
    "Alt Text Image": "Official header image for Madrun game - Steam 1266980",
    "Canonical URL": "https://gusku.site/game/madrun",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Madrun\", \"description\": \"Looking for information on Madrun? Check out the release date (Apr 11, 2020), developer insights from Tianyu Cao, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tianyu Cao\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tianyu Cao\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1266980/header.jpg?t=1617361949\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}