{
    "AppID": 898590,
    "Name": "Margonem",
    "Release date": "Feb 20, 2019",
    "About the game": "- Online multiplayer with as many friends as you like - 6 playable classes - Over 20,000 items to acquire - A loot system with unique, rare, legendary, uncommon and common items - Create your own equipment from legendary items of the highest order - Over 2000 maps to visit - Over 500 different stories to survive - Over 1,000 different enemies - More than 60 ingame achievements to unlock - A clan system that allows players to group - A special city accessible from level 260 - Powerful monsters guarding the legendary treasures Prepare your weapon! Fight powerful monsters &amp; threatening characters, like a Titan, multiple Colossi and other monsters that haunt the lands of Margonem! You do not have to fight alone! Join a clan, gather a team and go hunting! Decide for yourself who you will be and in what adventure you will take part! This world is full of adventures! Do you wish to forge your own legend? It is not that easy! Defeat a huge Titan guarding treasures. Solve the mystery of a complicated relationship with the past... Become a hero who discovers the secrets of the Artifact Maker! Become an Emissary whose job it is to protect the world of Margonem from danger. In order to embark on this journey, you will need to both gather a team, as well as preparing yourself suitably. Each new hero must decide his or her path…. Become a fearless warrior who wipes their enemies out with powerful hits! Their raw strength, combined with a tremendous technique in huge weapon wielding, is a killing experience for their enemies. A warrior is a simple character - they encounter an enemy, they attack them fiercely - no magic tricks. A paladin opposes every chaos force they encounter. This saint warrior has devoted their whole life to destroying world’s evil. Become a heavy armored disciple who uses simple magic to enhance their abilities of haunting undead and chaotic beings! Feel the power running through your veins! Become a formidable mage who destroys their enemies with balls of fire not worrying about their strength or battle experience. Cast a mighty lightning or a blinding blizzard spell on your rivals and make them suffer in pains. No ordinary human has a slight chance of beating you! You fight so beautifully as if you were dancing. Every pirouette brings your enemies closer to their own death. The ability of simultaneous parrying and hitting is a dangerous combination that makes a blade dancer a powerful character. Even best armored knights cannot predict your agile moves! Use your ancient knowledge to combine bow skills with a wildlife magic. Great understanding of nature and animals allows you to fill your every shot with a force of Mother Nature. Your hits will not only wound your enemies severely, but also suck them out of their energy. You feel best in forests and on meadows, where nobody can stand in your way! Fill the battlefield with a lethal whistle of your arrows! Become a true hunter who knows forests like the back of their hand. Hideous monsters won’t realize what hit them when they enter your territory. Finesse and master craftsmanship of your bow is the most horrible combination to your enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/898590/header.jpg?t=1592203542",
    "Price": 0.0,
    "Developers": "Garmory",
    "Publishers": "Garmory",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/898590/ss_91a7f1b27844c73124539e1649ff00ff3c32b907.1920x1080.jpg?t=1592203542,https://cdn.akamai.steamstatic.com/steam/apps/898590/ss_76229cff044dde257ceda7810f8299ab36945642.1920x1080.jpg?t=1592203542,https://cdn.akamai.steamstatic.com/steam/apps/898590/ss_1f90c0bbce7aed7601b25da4fe612b5177a26110.1920x1080.jpg?t=1592203542,https://cdn.akamai.steamstatic.com/steam/apps/898590/ss_317d1a76deea311cc0085ff7ce3acb6fa4e07776.1920x1080.jpg?t=1592203542,https://cdn.akamai.steamstatic.com/steam/apps/898590/ss_320fe83d7d3d4b0783351b7e8989299d75c3ed1c.1920x1080.jpg?t=1592203542,https://cdn.akamai.steamstatic.com/steam/apps/898590/ss_6105a6d3ed0fb044bd516e7ac053dac1d3fb6e14.1920x1080.jpg?t=1592203542",
    "Slug": "margonem",
    "Meta Title": "Margonem: Feb 20, 2019, Garmory and Full Overview",
    "Meta Description": "Looking for information on Margonem? Check out the release date (Feb 20, 2019), developer insights from Garmory, and a complete game summary.",
    "Alt Text Image": "Official header image for Margonem game - Steam 898590",
    "Canonical URL": "https://gusku.site/game/margonem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Margonem\", \"description\": \"Looking for information on Margonem? Check out the release date (Feb 20, 2019), developer insights from Garmory, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Garmory\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Garmory\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/898590/header.jpg?t=1592203542\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}