{
    "AppID": 497460,
    "Name": "Mervils: A VR Adventure",
    "Release date": "Oct 25, 2016",
    "About the game": "Mervils is an open world RPG platformer built specifically for third-person VR Your story begins in the picturesque Mervil countryside with your good friend 'Merlyn the Blue' . Merlyn is an ancient wizard of the time and foresee's the resurrection of a great enemy. He fears it is the return of the Dark Lord, “Balazar” . Armed with a few coins and a great Mervil sword, you embark on your journey. Throughout the five vibrant worlds you meet Mervils, Wizards, and ghosts of the past that tell stories of the power found within The Great Mervil Book. Only a fool-hardy Mervil would set-out on such a forsaken quest to defeat 'Balazar the Evil' . Will you be cunning enough to find the pages of the Great Mervil Book and have the power to stop Balazar's imminent attack? The task will not be an easy one! The pages are scattered in the darkest depths of the Mervil Kingdom and 'Balazar's' enemies are on the hunt. It's up to you, the bravest hero in all the lands to rebind the pages of The Great Mervil Book and save the Kingdom from 'Balazar's' destruction! Features Upgrade your armor! Your adventurer begins the journey with a simple sword, no armor, and merely a few coins, but the Mervil Armory is filled with helmets, bracers, pauldrons, axes, and swords to help defeat your enemies! Learn the stories of old. The Mervil Kingdom has been in existence for thousands of years and the local villagers know the lay of land better than any other. Their stories and quests will light the way through the darkest corners of the Mervil worlds. Catapults, Ballistas, and Cannons! Your sword is not the only weapon in the lands, find hidden catapults and ballistas to destroy Balazar's enemies and seek out cannons to fly high through the Mervil skies! Travel by Rail, Ice, and Sea! Balazar's attack is imminent and you'll need to find quicker ways to travel across the lands. Along the way you will find a Mine Cart, a Sleigh at the top of an icy tundra, and a Pirate Ship in Crystal Bay. Be wary though, travelling at great speed comes with great consequences! Put your mind to the test, literally! Throughout your journey you will find puzzles designed specially for VR, use your mind to unlock hidden treasure, to navigate through complex labyrinths and even to balance on a tight rope thousands of feet in the air! Relax in the Mervil Countryside. Your quest is not all battles and puzzles, take your time and talk to the local fishermen, roast marshmallows late at night by the fire, and take in the waves along the coast of Paradise Cove. Enjoy a jolly Celtic melody throughout. Mervils love their music and you'll find each village playing their own Celtic tune as you progress through the worlds! The game can be played 'Roomscale' with Motion controllers or 'sitting/standing' with a gamepad on the HTC Vive or Oculus Rift. Play comfortably! Choose from a 'Blink' , smooth follow, or custom camera mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/497460/header.jpg?t=1507833301",
    "Price": 19.99,
    "Developers": "VitruviusVR",
    "Publishers": "VitruviusVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_9464bda573eadc1a1c11e33c62e905e6df18263f.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_cdd304a024bcd9db0e0a69330326e223f89edf84.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_7320a5220963943323cdd025b0753995cf7dcc4f.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_afcae2c3183083ae443c6c0d3652a822e830f4b5.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_203608e5c765f18945d886dc5411a93338f88187.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_267a20fcdaf715981eaef84b4af7400fc0d22c74.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_ef1318b2887119e7fb0ea975ed9f70aafeb3560c.1920x1080.jpg?t=1507833301,https://cdn.akamai.steamstatic.com/steam/apps/497460/ss_7602cb30887ed12fcde7ecc85d7c6108fe4dcda1.1920x1080.jpg?t=1507833301",
    "Slug": "mervils-a-vr-adventure",
    "Meta Title": "Mervils: A VR Adventure: Oct 25, 2016, VitruviusVR and Fu...",
    "Meta Description": "Looking for information on Mervils: A VR Adventure? Check out the release date (Oct 25, 2016), developer insights from VitruviusVR, and a complete game ...",
    "Alt Text Image": "Official header image for Mervils: A VR Adventure game - Steam 497460",
    "Canonical URL": "https://gusku.site/game/mervils-a-vr-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mervils: A VR Adventure\", \"description\": \"Looking for information on Mervils: A VR Adventure? Check out the release date (Oct 25, 2016), developer insights from VitruviusVR, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 25, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"VitruviusVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VitruviusVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/497460/header.jpg?t=1507833301\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}