{
    "AppID": 1553290,
    "Name": "Multiplicity KVM",
    "Release date": "Apr 20, 2021",
    "About the game": "Combine the power of multiple machines and shed the hassle (and cost) of traditional KVM boxes. With Multiplicity KVM, you can control up to 9 PCs with a single keyboard and mouse completely wirelessly, freeing up your workspace by removing the cables and extra hardware needed for a traditional KVM switch. This versatile, secure, and affordable software solution makes working across multiple computers a breeze. If you are on the go and remoting into other PCs, or simply require the power of a seamless connection of up to 9 machines, Multiplicity KVM is the best application to get the job done. You can lock and unlock all of your PCs at once from one keyboard, listen to audio from multiple PCs without having to switch headsets and speakers, and drag and drop files and folders of any size between PCs. Creatives love the ability to retain their formatting when they use Multiplicity KVM to seamlessly copy and paste content from one PC to another. Designers and editors alike use seamless mode to run editing programs alongside their intense graphic design applications without experiencing lag, stutter, or drop in frame rate. Imagine running up to nine computers when you’re gaming, streaming, or video-sharing! Multiplicity KVM can keep your PC running optimally while allowing you to use your laptop or other machines for additional tasks while you play, without having to constantly switch back and forth between keyboards. Multiplicity KVM has two modes: Seamless mode allows you to establish a keyboard and mouse (plus audio) connection between as many as nine computers that are adjacent to each other and on the same network. You can stack your displays and move easily between them, or create a virtual laptop “docking space” that will easily reconnect every time it comes back within proximity. KVM mode allows you to use your computers remotely with a single keyboard and mouse. Road warriors, project and IT managers, plus other users who have more than one machine active in their day often use KVM mode to power through tasks using remote functionality. Users create active sessions into different types of machines, including machines with no display, and control them from the primary PC. This mode also has the ability to establish a remote session using a VPN connection. Features: Seamless: Control up to 9 PCs with one keyboard and mouse KVM: Control multiple PCs with one keyboard, mouse, and monitor Drag &amp; drop files and folders of any size between PCs Preserve formatting on text and images which are copy &amp; pasted between two PCs Lock &amp; unlock all PCs at once from one keyboard Audio share from multiple PCs and listen through one PC Seamlessly switch between PCs using a mouse, hotkey, and touch (for touch-enabled monitors) Hot key or touch to a specified field in an application or form Secure your PCs with encrypted and authorized remote connections Log remote connections in the Windows Event Viewer Encrypt data sent between PCs with AES-256 encryption Multiplicity vs. Multiplicity KVM",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1553290/header.jpg?t=1618928582",
    "Price": 39.99,
    "Developers": "Stardock",
    "Publishers": "Stardock",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1553290/ss_b03b6b2ac9e86b12bb90a0d463cd91ab7f008727.1920x1080.jpg?t=1618928582,https://cdn.akamai.steamstatic.com/steam/apps/1553290/ss_cd8f5fe0faf590d4de29e6331807b27c07387cb3.1920x1080.jpg?t=1618928582,https://cdn.akamai.steamstatic.com/steam/apps/1553290/ss_bb7684cfbde7b9abcdf6ac5410e09758d72e06a0.1920x1080.jpg?t=1618928582,https://cdn.akamai.steamstatic.com/steam/apps/1553290/ss_ff1fed33a449a7313b45f7d5721d6e0528d116fa.1920x1080.jpg?t=1618928582,https://cdn.akamai.steamstatic.com/steam/apps/1553290/ss_0a58f6664b424feb06a20f7bf96a44cf92bd79a0.1920x1080.jpg?t=1618928582",
    "Slug": "multiplicity-kvm",
    "Meta Title": "Multiplicity KVM: Apr 20, 2021, Stardock and Full Overview",
    "Meta Description": "Looking for information on Multiplicity KVM? Check out the release date (Apr 20, 2021), developer insights from Stardock, and a complete game summary.",
    "Alt Text Image": "Official header image for Multiplicity KVM game - Steam 1553290",
    "Canonical URL": "https://gusku.site/game/multiplicity-kvm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Multiplicity KVM\", \"description\": \"Looking for information on Multiplicity KVM? Check out the release date (Apr 20, 2021), developer insights from Stardock, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stardock\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stardock\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1553290/header.jpg?t=1618928582\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}