{
    "AppID": 873860,
    "Name": "Pop Island - Let's Code !!!",
    "Release date": "Jul 13, 2018",
    "About the game": "EVERYTHING IS CODE ! What is Pop Island - Let's Code : A complete SDK! You can code and execute your program. Take your mouse and keyboard, and start coding. It is a fantastic tool for all coders who want to play with code. Beginners are welcome to join our community. The code is powerful. We share this power with pride. A key to the future. The code is the new alphabet. Over the next few years, many jobs will require code skills. Use your fingers and deploy your best neurons. Your future thanks you warmly! An ocean of possibilities. The engine reads several million commands per second. The world also supports millions of blocks to display. Our libraries have more than five hundred functions. CODE IS POWERFUL What is NOT Pop Island SDK: Finished. The project is beyond ambitious. After five years of passionate work, I see it as a big tree. Many small leaves and branches continue to grow every day. Will this project ever be finished? We will see this together. For complete newbies. An SDK is a collection of tools, a bit like a powerful calculator. You need some knowledge to use it. If you already have programming skills, you will quickly feel at home. Enjoy !!! Otherwise, be patient. Take your first steps peacefully. We provide some tutorials. Mastering the code requires practice. The good news? Code is powerful. And it is up to you to use it. A collection of games. Ok, we've included some of our games. You can play alone or with someone. It's a bit of a taste of what you can achieve with this powerful SDK. It's just to give you some ideas. And if you'll create something big, do not hesitate to share your creation and your knowledge on Youtube. Newbies and the community need you !!! We already love you! CODE IS BEAUTIFUL What is programming? What makes us good programmers? Coding is defining the future. We observe its shapes, contours, and asperities. Finally, we transform this big model into a list of ordered commands. Then we press the RUN key. These little words come to life, and the magic happens. Sometimes - and by the most pleasant coincidence - your program works gently. This moment is called a miracle, and we dance and sing. But it is rare. Most often, we will have to rewrite our program several times. The most excellent coders have the intuition of the code. They see huge problems as a stack of small, easily programmable problems. And they code these chunks of programs like a painter on his canvas, little by little. YOUR FUTURE THANKS YOU For new coders, there is good news: the foundations of programming are accessible to all. And once acquired, our pocket SDK allows you to explore the paths of programming and have fun. Our Pulp language is close to the C language and makes some borrowings from Python. Because our language is close to the most common computer languages, what you learn here will be valuable. Welcome to the veterans! Welcome to the new coders! We are a big family. Your future thanks you. For thirty years, I have been coding games and playing with artificial intelligence. I worked for five years in the hope that everyone could learn to code. Let's share this power. My name is Oliver DENIS. And I would be happy if you become the next Turing. We are gamers. We are Makers. We are Coders. We are what we do. Join us.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/873860/header.jpg?t=1576778849",
    "Price": 9.99,
    "Developers": "odenis studio",
    "Publishers": "odenis studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/873860/ss_d7f5d12d8de950b7d8b6473c143e4ec730ce1cb1.1920x1080.jpg?t=1576778849,https://cdn.akamai.steamstatic.com/steam/apps/873860/ss_fceac0c5c93f4e37c5bc27ec8ff3057176a4ad21.1920x1080.jpg?t=1576778849,https://cdn.akamai.steamstatic.com/steam/apps/873860/ss_2054066abd884a013fca12ec03602982888386b9.1920x1080.jpg?t=1576778849,https://cdn.akamai.steamstatic.com/steam/apps/873860/ss_4601fdc509ad44c59d685d68a941a8162a564206.1920x1080.jpg?t=1576778849,https://cdn.akamai.steamstatic.com/steam/apps/873860/ss_426b62959088c9ef1987fa6e59f42d817af6f5bb.1920x1080.jpg?t=1576778849,https://cdn.akamai.steamstatic.com/steam/apps/873860/ss_1b798d9193fcde747b9cc555f9390a04e4ae536a.1920x1080.jpg?t=1576778849",
    "Slug": "pop-island-let-s-code",
    "Meta Title": "Pop Island - Let's Code !!!: Jul 13, 2018, odenis studio ...",
    "Meta Description": "Looking for information on Pop Island - Let's Code !!!? Check out the release date (Jul 13, 2018), developer insights from odenis studio, and a complete...",
    "Alt Text Image": "Official header image for Pop Island - Let's Code !!! game - Steam 873860",
    "Canonical URL": "https://gusku.site/game/pop-island-let-s-code",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pop Island - Let's Code !!!\", \"description\": \"Looking for information on Pop Island - Let's Code !!!? Check out the release date (Jul 13, 2018), developer insights from odenis studio, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"odenis studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"odenis studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/873860/header.jpg?t=1576778849\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}