{
    "AppID": 461620,
    "Name": "Predynastic Egypt",
    "Release date": "Oct 10, 2016",
    "About the game": "Get ready to witness evolutionary breakthroughs that enabled early Egyptians to march into faraway lands, fight catastrophes, hardships and ultimately establish first Egyptian state. Will you be able to re-enact the events that unfolded historically or will you doom your fledgling chiefdom into forgotten annals of history? Get an intimate knowledge about events that took place before the Classic Egypt eras through this unique game. Simulation of the ancient world Wars, drought, enemy invasions, epidemics, internal turmoil, migration of the tribes, religious ceremonies, exploration of distant lands, celebrations and more than 100+ other events and trials await you in the game! Technological evolution of mankind 48 historically accurate technologies and cultural achievements of Predynastic Egypt with interesting descriptions, will show the technological evolution of mankind on the example of the Egyptian civilization. Mysteries of Egyptian religion and culture You will see the birth of the unique religion of the Nile civilization, starting with beliefs in spirits and ending with the gods of Predynastic Egypt and you will learn the secrets known only to archeologists and Egyptologists! Reconstructed map of Ancient Egypt Accurate reconstruction of the geographic map of ancient Egypt 5000-3000 BC, taking into account the climatic changes of that period when the Sahara was a Savannah and not a desert and Wadies were rivers and not roads. Reconstructed city of Hierakonpolis Accurate archaeological reconstruction of the Hierakonpolis - the former center of Predynastic Egypt. You will build the real houses, temples and tombs, that were excavated by archeologists in XX-XXI century. The fate of the whole nation is in your hands. Make important decisions in real historical situations, wars, disasters. True story will immerse you into the mysterious atmosphere of the ancient world, you will see through the eyes of the ancient Egyptians.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/461620/header.jpg?t=1577116213",
    "Price": 9.99,
    "Developers": "Clarus Victoria",
    "Publishers": "Clarus Victoria",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/461620/ss_fe5dc3000f89e494aa64688e7e4545f6de21ab16.1920x1080.jpg?t=1577116213,https://cdn.akamai.steamstatic.com/steam/apps/461620/ss_b6cdb940f9f5f75d2482d7c3daed0c76410fc9fa.1920x1080.jpg?t=1577116213,https://cdn.akamai.steamstatic.com/steam/apps/461620/ss_d5fe5f7950c465855f8fa798b1b3a6b10d5ceaa6.1920x1080.jpg?t=1577116213,https://cdn.akamai.steamstatic.com/steam/apps/461620/ss_3ed1130b8d60d778def5296fae19481b5dc16ff5.1920x1080.jpg?t=1577116213,https://cdn.akamai.steamstatic.com/steam/apps/461620/ss_49b0aaaec9f43cec7a95a6b8be20adcd66ebb619.1920x1080.jpg?t=1577116213",
    "Slug": "predynastic-egypt",
    "Meta Title": "Predynastic Egypt: Oct 10, 2016, Clarus Victoria and Full...",
    "Meta Description": "Looking for information on Predynastic Egypt? Check out the release date (Oct 10, 2016), developer insights from Clarus Victoria, and a complete game su...",
    "Alt Text Image": "Official header image for Predynastic Egypt game - Steam 461620",
    "Canonical URL": "https://gusku.site/game/predynastic-egypt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Predynastic Egypt\", \"description\": \"Looking for information on Predynastic Egypt? Check out the release date (Oct 10, 2016), developer insights from Clarus Victoria, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Clarus Victoria\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Clarus Victoria\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/461620/header.jpg?t=1577116213\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}