{
    "AppID": 1958120,
    "Name": "Rail Walkers",
    "Release date": "May 17, 2022",
    "About the game": "Back Story Set in the not so distant future, you have been tasked with protecting a secret government mining operation. Its deep-earth drilling has disturbed previously unknown families of intelligent insects. Threatened by your machinery being too close to their nests, swarms of these insects are fixated on destroying your infrastructure. Historically, effective control of these swarms has only been possible with the use of Rail Walkers. These semi-autonomous turret based weapons contain sophisticated electronics enabling them to intelligently target and destroy thousands of attack insects. Gameplay The single objective is to protect your Base and infrastructure from the insects by using Rail Walker technology. You will start with a single Type 1 Level 1 Rail Walker positioned on a small length of rail-track in the middle of your mining area. This track will need to be extended, allowing your Rail Walker to reach further into other areas of your operation. By using switching tracks your Rail Walker can easily be moved from location to location. Rail Walkers are controlled manually via the Remote Operations Hub. You will issue commands to the Rail Walker to stop, start, recharge, patrol, reload and so on. You will also operate the rail switching tracks, changing the path your Rail Walker will follow. The insects attack in waves, with each wave most likely being more difficult than the previous. Defeating these wave attacks will earn you funding to upgrade your Rail Walker or to even purchase more Rail Walkers. Each upgrade brings faster movement, increased battery life, better firepower and so on. Rail Walkers is somewhat relaxed in that wave attacks don't begin until you initiate them, and only when you're good and ready. This means you have plenty of time to devise your strategy with regard to rail layout, Rail Walker deployment and Rail Walker positioning. Once a wave begins though the atmosphere becomes..er...a little less relaxed... Construct your rail-tracks thoughtfully and apply strategy and care when deploying your Rail Walkers...good luck with your struggles... Rail construction with track pieces including straights, curves and switching rails Remote rail-mounted turret control including commands to move, stop, reverse, patrol, repair, reload, recharge, upgrade and return to Base 8 different Rail Walker types 4 upgradable chassis types for each Rail Walker 4 upgradable motor types for each Rail Walker 40 swarm waves to conquer 10 different insect swarm types and behaviours 8 pieces of infrastructure to strategically protect Invest funds from 'scrap organic matter' into faster more sophisticated Rail Walkers Central control of all Rail Walker functions via the Remote Operations Hub Rail path and switching preview to assist with Rail Walker directions Automatic range and targeting sensors Automatic collision detection and emergency braking on the rail network Steam Achievements (37) to track your progress and cleverness Management and control of your Rail Walkers is performed via the Remote Operations Hub. This hub contains all the commands and detail needed to successfully manage your small army of Rail Walkers including General Commands Rail Walker information window Rail Walker targeting window Rail Walker POV camera view Rail Walker command activation Rail Walker Commands Move - Rail Walkers won't move on the rails unless commanded to do so Reverse - There is no real concept of forwards and backwards for a turret on a rail, here Reverse means switch direction rather than go 'backwards' Patrol - The Rail Walker will move as far as it can in one direction on the rail network and then reverse automatically and go the other way, until commanded to stop Recharge - Keep an eye on battery charge for your Rail Walkers, a flat battery in the middle of a swarm attack is bad news Reload - Don't run out of ammunition, enough said Disarm - Perhaps useful for various different attack strategies Repair - Damage to a Rail Walker will need to be repaired, repairs take time, plan ahead Upgrade - Earning funds through the sale of organic matter (the insect leftovers sought after by the science community), Rail Walkers can be improved with ammunition, cycle time, reload time, damage protection, movement speed, battery time and capacity Return to Base - All actions must be performed back at Base Stop - Well, it stops the Rail Walker, immediately Command Log - Monitor the system logs of each Rail Walker, keep an eye out for low battery warnings, low ammunition count and so on Rail Commands Switch activation (up to 30 switches) Switching HUD Rail route preview display Please join us in our journey this year to deliver and enhance what we hope will be a unique (and most importantly, fun) experience within the genre. We're truly focused on making Rail Walkers the best it can be. Feedback, suggestion, comments, rants (surely not) and raves are all welcome. Please reach out to us, we're super friendly. Best wishes to all from the teeny-tiny team here in Australia...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1958120/header.jpg?t=1652841665",
    "Price": 9.99,
    "Developers": "John Hnidec",
    "Publishers": "John Hnidec",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_6b50021a4dbf5afe411f480b798473d45811652f.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_7b420db97999084b862b5255f5c22d2db6ee2c80.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_27ce4569dd56199583926f2a008f7e54dbfba591.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_db30603b32fd7a3946b41809a92eb179ec74e9df.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_feb2ed951d87a57b52f181cdc2531b4663082a81.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_12ac624c9c0165cbd5ec3b7f6ca51f293a376ee0.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_5f257871534bc41665abdba2f2d65c6553fb7022.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_c84ea2f36f8850b912cf3be667c8cb6053af5f6d.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_b4a37cf3af6ffef024a55c11443f59c14f736cf6.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_17f6a5eb85078a984f70434c86aeacfb2b665303.1920x1080.jpg?t=1652841665,https://cdn.akamai.steamstatic.com/steam/apps/1958120/ss_8378c70cabfbf500b0545ebceb9a64f05e748e51.1920x1080.jpg?t=1652841665",
    "Slug": "rail-walkers",
    "Meta Title": "Rail Walkers: May 17, 2022, John Hnidec and Full Overview",
    "Meta Description": "Looking for information on Rail Walkers? Check out the release date (May 17, 2022), developer insights from John Hnidec, and a complete game summary.",
    "Alt Text Image": "Official header image for Rail Walkers game - Steam 1958120",
    "Canonical URL": "https://gusku.site/game/rail-walkers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rail Walkers\", \"description\": \"Looking for information on Rail Walkers? Check out the release date (May 17, 2022), developer insights from John Hnidec, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"John Hnidec\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"John Hnidec\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1958120/header.jpg?t=1652841665\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}