{
    "AppID": 1609100,
    "Name": "Skald: Against the Black Priory - the Prologue",
    "Release date": "Jun 1, 2021",
    "About the game": "You drag yourself from the black tides, across the corpses of drowned men, and onto the unwelcoming, craggy shoreline. Gulls cry overhead and the stink of seaweed fills your nose. By some miracle you have made it to Idra. It will take all your skill to survive and unravel the eldritch mysteries of the Black Priory. Pray your sanity holds. About the Prologue ‘Skald: Against the Black Priory’ is an old-school roleplaying game that combines modern design and a fully realised narrative with authentic 8-bit looks and charms currently in development. This is the prologue! Delve into a dark fantasy world, full of tragic heroes, violent deaths and Lovecraftian, cosmic horror. Explore an engaging, branching story mixed with rich exploration and crunchy, tactical, turn-based combat that will seem familiar yet innovative to RPG fans, old and new. What's in the Prologue Delve into the first few hours of gameplay as you explore the cursed isle of Idra. The prologue features about 1-2 hours of gameplay and will allow you to play around with most of the game's features. Currently we do not support using the prologue save-file for the main game after launch. Features The full game will feature: Lovingly crafted retro-style art: Experience a richly illustrated world of authentic pixel art using thousands of hand-drawn tiles and images A palette inspired by the legendary Commodore 64 computer. Optional CRT filter for that authentic old-school experience. Deep character creation: Build your main character and recruit a party from among a dozen diverse characters, each with their own skill-set, agenda and personality. Choose from a dozen classes and backgrounds as well as heaps of feats, spells and equipment as you take your party from level 1 to 20. Crunchy tactical combat: Engage in challenging, fast-paced, turn- and grid-based combat. Play it your way, with fully customizable difficulty and feedback settings. Or hit ‘auto-resolve’, lean back, and (hopefully) watch your party cleave a bloody path through their foes. A richly detailed, living world: Explore the vast expanse of Freymark and the Outer Isles and watch your actions spell doom or salvation for the region. Focus on the rich, branching narrative… Or live the life of a mercenary and explore varied sidequests and encounters - the plot will wait for you. Manage your party as you make camp, recruit hirelings, travel by land and sea, and interact with powerful factions and their visions for the world. Become part of a fantastic community: Skald was made possible by crowdfunding and already has a large, passionate and welcoming community that can’t wait to meet you. By joining Skald’s Early Access you’ll have a direct line to the developer, get sneak peaks and give feedback on forthcoming plans and help shape the game into a modern classic. We will publish the powerful tools used to create the game in an effort to support and encourage modding and content creation once the game has fully launched. The Story of Skald: A Dream Come True Skald is the dream-project of a lone Norwegian developer, AL. AL missed the thrill of delving into grand, immersive games such as ‘Ultima’, ‘Magic Candle’, ‘Wasteland’ and the Gold Box series. When he noticed the lack of newer roleplaying games that combined the classic (early 90s) charm with more modern game design he decided to take matters into his own hands. AL set to work crafting the game of his dreams. A highly successful Kickstarter and Indiegogo campaign with 700 backers, and a fast-growing community of passionate fans proves he made the right call.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1609100/header.jpg?t=1639585110",
    "Price": 0.0,
    "Developers": "Scape-IT AS",
    "Publishers": "Raw Fury",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_3d7592dbe499f7efa705c8b173c9c63a39e3bdb2.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_efd5826af8a38973b4eb11f3ddf9701f86c54338.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_fdcd921e11b6c4ab0d8ff880120065cf4afa3a30.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_b8a3b26d6bb23285a710b6d4724a37dddaf101d2.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_4fc195799b9f98f9e9802057567a76b1ca90c2c2.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_6738324a4dbfa68b45a5a1f8958574912b66592e.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_dce008e7f580fd325a138a731c341730a1210272.1920x1080.jpg?t=1639585110,https://cdn.akamai.steamstatic.com/steam/apps/1609100/ss_3446ee4bf6ba8314a90a6fc22d52ec74a0af1651.1920x1080.jpg?t=1639585110",
    "Slug": "skald-against-the-black-priory-the-prologue",
    "Meta Title": "Skald: Against the Black Priory - the Prologue: Jun 1, 20...",
    "Meta Description": "Looking for information on Skald: Against the Black Priory - the Prologue? Check out the release date (Jun 1, 2021), developer insights from Scape-IT AS...",
    "Alt Text Image": "Official header image for Skald: Against the Black Priory - the Prologue game - Steam 1609100",
    "Canonical URL": "https://gusku.site/game/skald-against-the-black-priory-the-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Skald: Against the Black Priory - the Prologue\", \"description\": \"Looking for information on Skald: Against the Black Priory - the Prologue? Check out the release date (Jun 1, 2021), developer insights from Scape-IT AS...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Scape-IT AS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Raw Fury\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1609100/header.jpg?t=1639585110\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}