{
    "AppID": 946050,
    "Name": "Soda Dungeon 2",
    "Release date": "Jul 9, 2020",
    "About the game": "Your favorite fizzy dungeon crawler is back! The Dark Lord has locked all sorts of legendary items, loot, and goodies up in his castle behind a seemingly endless guard of monsters, traps, and treachery. Daunting? Not for you— You’ll be safe in the tavern hiring Soda Junkies to do the dirty work for you. Take the loot they bring back to upgrade your tavern, town, and armory to attract stronger adventurers, then repeat. Build your town, assemble a mighty team, and see if you can make it through the dungeon to the next dimension and beyond. Along the way your band of merry, soda-fueled minions will encounter trumpeting skeletons, angry chefs, Dark Lords, Darker Lords, and a fairy that is just really, really trying her best. The only thing they won’t find is timers, lives systems, or a paywall. Everything can be bought with in-game currency because that’s just the Soda Dungeon way. / Custom AI Patterns! - Sick of dumb-as-rocks NPC allies? We are too. Create custom behaviors for you party using Soda Script! Even when you're not looking over their shoulders they're doing exactly what you want. Craft Gear - Craft new armor and weapons for the adventurers you hire. Find rare materials deep within the Dark Lord's castle to make all new items. Play While AFK - Have a life outside Soda Dungeon? No problem. Earn Battle Credits while you’re away and redeem them for loot when you come back. Even when you're not playing, you're gathering resources! Build Your Home Base - Assembling the best party will take more than a tavern this time around. Build a blacksmith forge, a wizard’s shop, an arena, and more to unlock your party’s true potential. Always More To Do - We heard you. You wanted more mountains to climb. You wanted more goals to accomplish. You... wanted to help people clear rodents from their property ¯\\_(ツ)_/¯ Lucky you, because the NPCs in Soda Dungeon 2 are ready to cough up strangely valuable rewards in exchange for completing an assortment of side-quests! If you find yourself asking 'What's a Soda Dungeon' This is the section for you! Soda Dungeon is a turn-based dungeon crawler where you recruit a team of adventurers to raid dungeons on your behalf. With the loot they find you’ll build up your town, attract better heroes, and find out just how deep the dungeon-hole goes. Experiment with Confidence - Mix and match classes, try out loads of gear, and send them off to fight. But fear not, everyone comes home safe with all your hard-earned loot. Defeat is just part of the game :) Free and Fair - Everything can be earned with in-game currency. No loot boxes. But if you want to level up a little faster, we may have some special upgrades for you to peruse. Cross-Platform Play - Play on your mobile phone, tablet, or Steam and take your save file with you wherever you feel like playing. We’re told it’s in “the cloud”. Optional Auto-Combat - Feeling lazy? We get that. Set up your party, flip on the auto-combat and let the spoils of battle roll in. You deserve a break. ANProductions is a one man studio that has been developing games of all types for over a decade. Poxpower would like it known that he too has been developing games for a long time, possibly even 11 years.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/946050/header.jpg?t=1613492765",
    "Price": 0.0,
    "Developers": "AN Productions,Poxpower",
    "Publishers": "Armor Games Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_d2bac3c3582467475983a9f2c6f9d0f86bbaa174.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_8c366a3d5438e56bb24e65ae6e3efecc2e82bbd7.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_aa1fb76c4ad5095bf2759d34651fd3cbb1bf97b1.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_9c27476b34656f558e1f7315093a5e352575173b.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_9dc5c749f64f3dde095131776eaf3d45093477d0.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_fb7ea72d3ebcc0ae59962304618bccb9660171ef.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_7527b770f5a71ccceac1f2424c75cb40bd50959f.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_13caeafb39bded60a1c37e2e658c8384f0d6133e.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_fbb293e620aca7eda4b46ce629abadc5b3c428b9.1920x1080.jpg?t=1613492765,https://cdn.akamai.steamstatic.com/steam/apps/946050/ss_52b0a5ebe5ea3173b3b4e5383e7ada3d8290df8e.1920x1080.jpg?t=1613492765",
    "Slug": "soda-dungeon-2",
    "Meta Title": "Soda Dungeon 2: Jul 9, 2020, AN Productions,Poxpower and ...",
    "Meta Description": "Looking for information on Soda Dungeon 2? Check out the release date (Jul 9, 2020), developer insights from AN Productions,Poxpower, and a complete gam...",
    "Alt Text Image": "Official header image for Soda Dungeon 2 game - Steam 946050",
    "Canonical URL": "https://gusku.site/game/soda-dungeon-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soda Dungeon 2\", \"description\": \"Looking for information on Soda Dungeon 2? Check out the release date (Jul 9, 2020), developer insights from AN Productions,Poxpower, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"AN Productions,Poxpower\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Armor Games Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/946050/header.jpg?t=1613492765\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}