{
    "AppID": 479180,
    "Name": "Space Universe",
    "Release date": "Jun 15, 2016",
    "About the game": "Space Universe —take part in a vast procedurally generated Universe. Players will realize their ambitions and ideas, therefore developing and moving ahead on the way into the Universe. In Space Universe, you will have a full freedom of action: you can destroy everything in your way, investigate space bodies, extract valuable materials, build ships / stations and many other activities! In Space Universe, you aren't playing the superhero who is urged to rescue the Universe from an inevitable accident. You differ in no respect from the others, and in fact start out weaker than them. Only by training and gaining experience and intellect will you learn to survive and become stronger. You can become whoever you’d like to be! Pirate, hero, or anything inbetween! In-game, your character can possess certain skills that are dependant on you. In Space Universe, you are limited only by time and your desire. Studying skills is necessary to understand what skills enemies have in dire situations. The economic and political model of the game depends on you--the player-- giving you new opportunities every day! Features of game: - Arrangement of the ship / station as it pleases you. - Dynamic battles. - Customization. You will be able to create the ship however you wish. Possibilities of your ship completely depend on the decisions chosen by you. You can construct a small research ship, a large industrial freighter, a carrier, a military battleship or even a defensive frigate! - Management. All the resources (including fuel, energy, ammunition, spare parts for repair, provisions, medicines) of your faction / company / group are limited, therefore, you must protect them and use them rationally. - Fleet. You aren't attached to just one ship. You can also construct many spaceships and stations; however many you will consider necessary. - Planets. Realistic behavior model of planets. For planetary landing, you need to overcome the atmosphere of the planet if it is needed, and to avoid breaking your ship on a planet surface because of gravitation force. - Production of resources. Investigate asteroids and planetoids on availability of minerals; extract them from a subsoil of planets or find fragments of spaceships! - A multistage system of production. Production of raw materials and minerals aren’t enough to construct something. You have to process the received resources in special institutions to receive the necessary components for creation of modules. - Crafting. By means of gathered resources and materials, create things necessary for your adventure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/479180/header.jpg?t=1475854366",
    "Price": 14.99,
    "Developers": "Universe",
    "Publishers": "Universe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/479180/ss_c668209d19c8e8236df98b1e51d20c9083e69883.1920x1080.jpg?t=1475854366,https://cdn.akamai.steamstatic.com/steam/apps/479180/ss_2f58ab72c8ce01d56d04806a767ea634199bcb64.1920x1080.jpg?t=1475854366,https://cdn.akamai.steamstatic.com/steam/apps/479180/ss_54e93f05ad0c1c296e5faa623f402a57dd576f83.1920x1080.jpg?t=1475854366,https://cdn.akamai.steamstatic.com/steam/apps/479180/ss_ef576c8039a8d544b2738ff32581a55d80bea738.1920x1080.jpg?t=1475854366,https://cdn.akamai.steamstatic.com/steam/apps/479180/ss_ca16bf907715db26059cf19f1ee07a909e1f9d6b.1920x1080.jpg?t=1475854366,https://cdn.akamai.steamstatic.com/steam/apps/479180/ss_0d291151bdd2fe533961c520f849788008a23db9.1920x1080.jpg?t=1475854366",
    "Slug": "space-universe",
    "Meta Title": "Space Universe: Jun 15, 2016, Universe and Full Overview",
    "Meta Description": "Looking for information on Space Universe? Check out the release date (Jun 15, 2016), developer insights from Universe, and a complete game summary.",
    "Alt Text Image": "Official header image for Space Universe game - Steam 479180",
    "Canonical URL": "https://gusku.site/game/space-universe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Universe\", \"description\": \"Looking for information on Space Universe? Check out the release date (Jun 15, 2016), developer insights from Universe, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Universe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Universe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/479180/header.jpg?t=1475854366\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}