{
    "AppID": 39540,
    "Name": "SpellForce - Platinum Edition",
    "Release date": "Nov 3, 2009",
    "About the game": "Included in the Platinum Edition are three titles: SpellForce: The Order of Dawn In a world beyond imagination... In their immeasurable greed and constant thirst for power, the thirteen most powerful Mages of all time doomed the land, hurling it into an endless spiral of chaos and despair. Entire countries were wiped out in the blink of an eye when the devastating power of the Elements was unleashed - Elements summoned by dark rituals. Continents shattered like glass, the pieces strewn about like leaves in the wind. Huge armies, bound by the the power of ancient runes, brought war and destruction to the lands that survived the initial onslaught. All that was left were a few islands, connected by magic portals. Now, only a few years after the end of the Convocation, evil is back - stronger and more powerful than ever before - to finish what was started. Yet there is still hope. The prophecies tell of a human. A human damned to immortality, bound forever by the power of the blood runes… Soon, the time will come when the power of one may change the destiny of many. For better or for worse... SpellForce: Shadow of the Phoenix By means of an enslaved god's life essence a dark necromancer is trying to reanimate the powerful circle mages and make them his unholy servants. Only the power of the Phoenix Stone will be able to prevent the returning of the Circle. Thus the rune is summoned again to finally put an end to his former slave-masters. But to free the special power of the Phoenix Stone, the blade of the Shadow Sword is required which is held by the rune warrior of Urgath. The two avatars need to combine their powers and work together to overcome this final enemy. SpellForce: Breath of Winter A Prince of Darkness, a Fial Darg, was set free through the Convocation and took over the reign over the Fire Empire. His whish is to bring the Renegades, the Gods of darkness, back to Eo. For the Ritual, to make that happen, he needs the blood of a first-born Elve. But there is only one more left, Cenwen, the Elve Queen, who lives under the ice where she sings for the mighty dragon Aryn… Innovative game design: The unique mixture of RTS and RPG elements offers a brand new game experience. High degree of identification with the hero-avatar, whose skills and strengths can be improved by the player. Click'n'Fight: This revolutionary control system guarantees instant action, the best possible overview and completely new tactical possibilities in battle. 6 races - Humans, Dwarves, Elves, Dark Elves, Orcs and Trolls - that can be used simultaneously (!) to build settlements and fight battles and more than 30 different enemy races, from cowardly goblins to powerful demons, Fire Angels, Werewolfs and giant Ice Dragons. A multitude of spells, divided into different categories of magic (white, black, elemental, etc.) and enchanted items Awe-inspiring 3D-graphics with zoom levels from isometric to 1st-Person-views Free game in SpellForce – The Breath of Winter: The Avatar can develop and upgrade his skills with every map he plays. This mode enables the player to try out other Avatars abilities without playing the main campaign again.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/39540/header.jpg?t=1618008861",
    "Price": 9.99,
    "Developers": "Phenomic",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_baddb7f7ecd8c65406e7abd40419a380dfb8b8d3.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_963cee10495d110c395ff8adee9241033d3f2e3b.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_61872f9cc4b9f51580ee2cdfae4439e07c49890b.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_8e668cf237e38c58f4e59d2fcbd90969b93369e5.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_39bfc9d683fb38ab3fab590d90ab4193fa8ae677.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_d6fd2bad3f2ba6c30adf7f480975754f0bc5a87a.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_605c181d097504648660d2c9c41b75c0bb0ca8ba.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_1d56fe5825c83b81186af97509732bcb2fc49e9e.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_75988c9e26eae1b4955ef1ec49316eab646f7efc.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_e1993dd26da90be3c7d06575a75c3af5220f9566.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_131a031f2def1db810c95f8160ecc8a126bc91c0.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_1cb3e1f9923135abef3e23d6aed6ce3de2f82287.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_762bdaa6f51fb34d56dc359b44153eb7df62e3cf.1920x1080.jpg?t=1618008861,https://cdn.akamai.steamstatic.com/steam/apps/39540/ss_9fa8a178989f682a96aa4dc9a08c4072053c143c.1920x1080.jpg?t=1618008861",
    "Slug": "spellforce-platinum-edition",
    "Meta Title": "SpellForce - Platinum Edition: Nov 3, 2009, Phenomic and ...",
    "Meta Description": "Looking for information on SpellForce - Platinum Edition? Check out the release date (Nov 3, 2009), developer insights from Phenomic, and a complete gam...",
    "Alt Text Image": "Official header image for SpellForce - Platinum Edition game - Steam 39540",
    "Canonical URL": "https://gusku.site/game/spellforce-platinum-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SpellForce - Platinum Edition\", \"description\": \"Looking for information on SpellForce - Platinum Edition? Check out the release date (Nov 3, 2009), developer insights from Phenomic, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Phenomic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/39540/header.jpg?t=1618008861\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}