{
    "AppID": 1023640,
    "Name": "Sweet Galaxy Adventure!",
    "Release date": "Jul 3, 2019",
    "About the game": "Want to explore explore the galaxy with beautiful girls? Take on the role of a space cadette who is just about to embark on his first real mission into outer space. Little does he know that the ship that he is about to call home is almost exclusively crewed by beautiful women! Explore space (and your new crew members?) in this new visual novel. Take part in the day-to-day life on board the space ship and help your new crew mates in their assignments. Get to know them more and more as you spend time with them, and maybe even learn a new skill or two that may come in handy if the ship ever finds itself in a dire situation... In true visual novel spirit you will navigate your way trough conversations and actions to determine the outcome of interactions with people on the ship, the way you act will heavily effect the outcome of the adventure, so take care when choosing how to act and what to say. Who knows, maybe your choices might even lead to romance? Biographies Kashiwagi Amaya Age: 24 Height: 174 cm Description: This redheaded troublemaker is the head of engineering the ship. Get used to plenty of pranks if you are going to be around her. She might put you in a few awkward situations for her own amusement, but deep down she is a kind and loving person. Kagawa Ei Age: 26 Height: 178 cm Description: She may be a little clumsy sometimes, but the science officer of this ship is more than qualified for her job. Just be ready to help her when she falls over. She is perhaps a bit more quiet than the other officers, but she is a very sweet person once you get to know her, but that can take a while due to her shyness. Sekino Juri Age: 23 Height: 154 cm Description: What she lacks in stature she makes up for in attitude. This girl is the ship's navigator, and she will make sure that you remember that she outranks you. But don't worry, you will surely get along... Just don't mention her chest size or the fact that she is wearing very high heels.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1023640/header.jpg?t=1578004764",
    "Price": 7.99,
    "Developers": "Tofubeef",
    "Publishers": "Touwaku Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1023640/ss_0a7a0595e4b58412c171faa590596b4a69adb80b.1920x1080.jpg?t=1578004764,https://cdn.akamai.steamstatic.com/steam/apps/1023640/ss_db9906703a9f61759f957a51b7302376481934a7.1920x1080.jpg?t=1578004764,https://cdn.akamai.steamstatic.com/steam/apps/1023640/ss_c804ebafd745665c2db01b454aa84aa7baad6b89.1920x1080.jpg?t=1578004764,https://cdn.akamai.steamstatic.com/steam/apps/1023640/ss_cc9628377eda2ffc9f31abbba64ef4c355be5630.1920x1080.jpg?t=1578004764,https://cdn.akamai.steamstatic.com/steam/apps/1023640/ss_a5d8836d90abb16e22df93950d6957ae5b3b4728.1920x1080.jpg?t=1578004764",
    "Slug": "sweet-galaxy-adventure",
    "Meta Title": "Sweet Galaxy Adventure!: Jul 3, 2019, Tofubeef and Full O...",
    "Meta Description": "Looking for information on Sweet Galaxy Adventure!? Check out the release date (Jul 3, 2019), developer insights from Tofubeef, and a complete game summ...",
    "Alt Text Image": "Official header image for Sweet Galaxy Adventure! game - Steam 1023640",
    "Canonical URL": "https://gusku.site/game/sweet-galaxy-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sweet Galaxy Adventure!\", \"description\": \"Looking for information on Sweet Galaxy Adventure!? Check out the release date (Jul 3, 2019), developer insights from Tofubeef, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tofubeef\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Touwaku Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1023640/header.jpg?t=1578004764\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}