{
    "AppID": 1047930,
    "Name": "Templum de Malum",
    "Release date": "Jun 14, 2019",
    "About the game": "A 'Point and Click' Adventure game in the classic style but with modern day elements. Philip is a young British aristocrat with a taste for exploration. Denying his father's wishes, he sets sail for uncharted lands with the aid of his father's uptight servant, Brimley. All is well until his crew hits turbulent seas and his ship wrecks leaving only him and Brimley on a small island near the Middle East. Instead of sending smoke signals for a hopeful rescue, he desires to explore the giant ziggurat which is, without a doubt, the lost Tower of Babel. Danger, traps, wealth, and intrigue await within the Temple that time itself forgot... F E A T U R E S -Classic “point and click” UI that is intuitive and robust. Supports point and click, scroll wheel toggle, or keyboard hotkeys so you can play how you want. -Integrated hint system: Talk to your companion, Brimley, at any time for hints or read his thoughts in his robust journal that writes as you explore! -Challenging, yet logical, puzzles. Keep your wits about you and use clues, atmospheric hints, lore, and items to help you progress. There is no need to have great hand eye coordination but only have a sharp wit and an explorer's spirit to succeed! -Beautiful hand drawn visuals: This is not 3d computer generated design nor asset store artwork. Only hand-crafted custom graphical art here. -Immersive soundtrack, sound effects, and atmospheric track. The audio consists of a high quality soundtrack tailored to the mood of each area you explore. The sound effects bring out the feeling of being there along with the atmospheric track of the area you are in. As a bonus, you have full control over the volume of the music, sound effects, and atmospheric track with a built in audio mixer slider panel. -Deep lore and engaging story: learn about the past as you try to survive the present. Unravel the mystery of the Tower as you progress. -Even enjoy failure as the death sequences are fun and entertaining to watch (and humorous!) -Lots of unique content: No cookie cutter game play or repetitious puzzles and terrain. Puzzles and rooms are unique and diverse. You should never get bored. -Cheeky and interactive responses to your choices in game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1047930/header.jpg?t=1609934812",
    "Price": 14.99,
    "Developers": "Nuts and Volts Electronics",
    "Publishers": "Nuts and Volts Electronics",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1047930/ss_82a25dd39a6bd2bd1472b102ca5d47490941a596.1920x1080.jpg?t=1609934812,https://cdn.akamai.steamstatic.com/steam/apps/1047930/ss_7b205b3278ebe64ba1f56b590246f8abf933d924.1920x1080.jpg?t=1609934812,https://cdn.akamai.steamstatic.com/steam/apps/1047930/ss_876efc6eba43e1fb72514b83f56bf2c5f2210843.1920x1080.jpg?t=1609934812,https://cdn.akamai.steamstatic.com/steam/apps/1047930/ss_5a8c0f2caa2f805816d511889bcd8b8fd17d457d.1920x1080.jpg?t=1609934812,https://cdn.akamai.steamstatic.com/steam/apps/1047930/ss_0b292a4762acf8109653c38c8c940e0df6b943bd.1920x1080.jpg?t=1609934812,https://cdn.akamai.steamstatic.com/steam/apps/1047930/ss_4152392f367ffeaba1c1d88eb11f105000d17ce0.1920x1080.jpg?t=1609934812",
    "Slug": "templum-de-malum",
    "Meta Title": "Templum de Malum: Jun 14, 2019, Nuts and Volts Electronic...",
    "Meta Description": "Looking for information on Templum de Malum? Check out the release date (Jun 14, 2019), developer insights from Nuts and Volts Electronics, and a comple...",
    "Alt Text Image": "Official header image for Templum de Malum game - Steam 1047930",
    "Canonical URL": "https://gusku.site/game/templum-de-malum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Templum de Malum\", \"description\": \"Looking for information on Templum de Malum? Check out the release date (Jun 14, 2019), developer insights from Nuts and Volts Electronics, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nuts and Volts Electronics\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nuts and Volts Electronics\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1047930/header.jpg?t=1609934812\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}