{
    "AppID": 1979610,
    "Name": "The FED",
    "Release date": "May 12, 2022",
    "About the game": "An agency called the FED has identified an online group of potential threats. All they need is evidence to have them locked away. You are a new agent going undercover in that online group with the task of getting that evidence, by whatever means necessary. Gameplay You start each workday of The FED at 5pm, in your office, where your boss will fill you in on any important information. You can interact with the members of the group using your PC, which has various desktop icons to click. The main one is the chat client 'Postapp' the group uses, which allows you to communicate directly with the members, as well as see what they've been up to during the day. Along with this chat client there is also 'BNM' news, which will tell you about recent world events, or a streaming platform 'Comfy' for when you want to pass the time, just to name a few. The goal of the game is to try and get as many members arrested for as long a sentence as possible. At the end of the game you will be given a full breakdown of how well you performed. Mechanics Using the chat client 'Postapp' you can talk to the members of the group about all sorts of things. Messages are sent by clicking the member's username in Postapp and clicking 'Message', then choosing a message topic. Messages with '...' at the end normally lead to further options, and sometimes certain responses will unlock new topics to talk about. Time only passes when chatting or watching streams so you cannot ask everything to everyone in the same day. Members also have different schedules when they are online, so you might have to specifically wait to get the guy you're targeting. Each member has his own interests, life situation, and views on how to act. A soldier might join a military parade. An avid reader might try writing a book. A failing small business owner might give up and go back to school. Each also has his own idea of it the player is a friend or foe, and innocent or suspicious. How you talk with a member will change how he feels, and how he acts. Here are just some of the ways you can interact: Act innocent to convince him he can tell you what he's up to. Buddy up talking about his interests, then convince him to change his job, leave university, or skip his friend's wedding. Use an injustice committed against him to tell him he needs to do something about it. Discuss the news to make him angry at society and watch him go off on his own. Members will also send you messages first from time to time, giving you more opportunities to interact. There are many ways that members can get arrested, big and small, with varying charges that can be levied against them. But don't just go for the easiest charge! Courts don't find every defendant guilty, so the more evidence and charges you can get the more likely you are to get them all taken down. It might be best to tell a member to avoid some actions if it could get him arrested for something minor with little evidence early on. Remember that police can arrest a criminal even if your agency doesn't want them to. Self-inserts When starting a new game you can choose to let the game generate names for the members, or input them yourself. This is split up into regular names and online usernames, so you can generate one and input the other yourself if you prefer.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1979610/header.jpg?t=1652367345",
    "Price": 8.99,
    "Developers": "Britnet Media",
    "Publishers": "Britnet Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_164d68757bec8bc61bc1f303ee6c29ad52338fd4.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_9958281973c7aeccf4da5f27444a8bfe4248c65d.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_d4b951a9861a03892d7e14849630e9b614049367.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_d2188e386d183781196af47ba12018df46130748.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_451d6d192582e83a1c7897acd3a0feb1e27310e5.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_7256329abea1657ca333bc632618cda5c36baa79.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_a32722a759e2d88eb5317112d718bcd2eabd238b.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_04b82c21a14a8e0438757b90738794e6cb5107ef.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_e96bee4d51f34e922a6c4138db90400a388fe0f8.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_591e439455a8308656053db174d54274f9a0e449.1920x1080.jpg?t=1652367345,https://cdn.akamai.steamstatic.com/steam/apps/1979610/ss_be3e6838e583f7ef8a69c85459e19bea18e51fdd.1920x1080.jpg?t=1652367345",
    "Slug": "the-fed",
    "Meta Title": "The FED: May 12, 2022, Britnet Media and Full Overview",
    "Meta Description": "Looking for information on The FED? Check out the release date (May 12, 2022), developer insights from Britnet Media, and a complete game summary.",
    "Alt Text Image": "Official header image for The FED game - Steam 1979610",
    "Canonical URL": "https://gusku.site/game/the-fed",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The FED\", \"description\": \"Looking for information on The FED? Check out the release date (May 12, 2022), developer insights from Britnet Media, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Britnet Media\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Britnet Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1979610/header.jpg?t=1652367345\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}