{
    "AppID": 941300,
    "Name": "TouHou Nil Soul",
    "Release date": "Feb 28, 2020",
    "About the game": "Story Scarlet Devil Mansion is asking for trouble again. For the sake of convenience, vampire lord Reimilia Scarlet release scarlet mist to blind the sun. No doubt such stupid behavior will definitely result in a tragedy. Look! Reimu and Marisa are coming to teach her a lesson. What is different is that Reimu and Marisa use dummies called “Nil Souls” to defeat opponents this time. Come on! Let’s choose your soldiers , pick up your weapons , dodge opponents’ bullets and beat them down. We firmly believe that this brand new scarlet mist anomaly will keep company with you during your playing of about 20 hours. 1.A unique system including turn base and barrage — turn-based barrage system. 1-1 What is the turn-based barrage system? To cut a long story short, it is a system syncretizing turn-based game and barrage. A system in which the barrages will move according to preset trajectory after players complete operation. A systemwhichletsplayersthink twice before every character’s every step so that their characters won’t be hurt by changing barrages. So this unique system requires players to have the ability of deducing situation they will face after several rounds and scan changes of battlefield in the dynamic perspective.Just think about how you try to guess your friend’s next step when playing chess, then you may understand the system better. ▲ This turn-based barrage system nearly like this in the game. 1-2 How can I enjoy the turn-based barrage system? The answer is the diversity of barrage itself. In this aspect, TouHou Project’s official games and other barrage games have given us a lot of reference. Barrages in the game can be classified as: regular barrages , random barrages , tracking barrages and blocking barrages .Meanwhile, bosses’skills can add more changes to barrages. Let’s see two examples. Rumia can hide barrages, which means palyers can’t see her barrages completely. As a result, players have to deduce trajectory of barrages according to their acquaintance with barrages and then dodge them. Hon Meirin is good at knockback, so chances are that even if players have dodged barrages, Hon Merin can still use her skills to beat them back to the area surrounded by barrages or even to a barrage. We hope that we can combine bosses’skills with rules of barrages to create more plentiful experience. ▲ Tetris barrages? Are you kidding me?(´_ゝ｀) 1-3 How can we cope with barrages? We provide three ways: dodge , just stand still and elimination .Here we don’t to talk about the first and second ways more. As for the third way, players’ characters will have the ability of eliminating barrages. For example, we design some skills which allow players to eliminate barrages in a certain area, and some spell cards which can attack bosses while eliminating barrages in a large area. We believe that properly using skills of eliminating barrages while attacking bosses, together with barrage itself, will create something interesting. We hope we can make the system more attractive as possible as we can. ▲ Oh~ my friend, are you annoyed with being surrounded by barrages? Here is Master Spark, eliminates abundant barrages in a line, releases powerful blast to the maximum and leaves no side effects at the same time. Are you sure you can refuse such a mighty spell card? ▲ Besides active attacking skills, some supporting skills also have the effect of eliminating barrages. How to use these skills properly will become the core of the system 2.Six kinds of skills, weave , combine and mutate. We will spend most of time on developing skills in the following days. After all, combos between skills decide whether the game is attractive. So far, we’ve designed and classified skills as following: ▲ Attack,Instant damage without any cost. Meanwhile you can also recover your mana. But it will be restricted by distance. ▲ Defensive skills,Reduce damage from bosses’ attack. ▲ Barrage skills,Bosses only at present. Bosses will use barrages to fulfill the battlefield, surround players’ characters and finally kill them. ▲ Spell card,High damage, high cost and various additional effects. ▲ Summons skills,Bosses only. Bosses will summon servants to raise their damage. ▲ Supporting skills,Skills of coping with different situation and raising combating effect. 2-1 System of opponents’ skills As for opponents’skills, we preset three motivating method: RA(random and active) , CA(conditional and active) ,and CP(conditional and passive) .ere is brief explanation: Generally, opponents will randomly launch a skill randomly every round. When some conditions are met, opponents will launch one or several active skills. When some conditions are met, one or several passive skills will be motivated.种被动。 ▲ ur anonymous Rumia is killed by opponent’s combo of barrages, spell cards and environment restriction. 2-2 System of players’ skills or four skills. Attack has restriction on scope, skills will cost characters’ mana and defense has no restriction. Besides all above, there are other several rules: Restriction on scope. Some skills only have certain effective rounds. Some skills have CD. Some passive skills cannot be motivated inbattles but they will take effect continuously (For example, floating opponents won’t be influenced by environment.) What’s more, in our next developing step, we are considering letting players themselves choose skills ▲ Marisa can’t release ‘Master Spark’ due to CD of five rounds. 2-3 Servant system ——Icing on the cake To keep players from being bored with the pattern of fighting against bosses, bosses will summon two to four servants to combat together. Every servant has its respective action bar, which means players should regard each servant as an opponent. Servants have their own action patterns as well as interactive(with their masters of course) action patterns. How and when to cope with these servants properly will also be an interesting core remaining to be pondered on. So far, we can show you following information…… ▲ Reimu andher servants —— Red and white magatamas ▲ Marisa and her servants——Casket of Star ▲ Patchouil and her servants——Philosopher’s Stone 3.team , items and storyline exploration 3-1 System of team ‘TouHou Nil Soul’ is a turn-based barrage game requiring all characters ally against opponents. At most five characters are permitted in one team. More characters will be unlocked with the exploration of storyline. Each character has different position and feature. Using these features properly to foster strengths and circumvent weaknesses will make your combat more efficient. What’s more, each character will have following designing: Potential combating statistics. Three or four innate skills(we will improve this aspect in the following editions) Three slots for: weapons, armors and accessories. ▲ You can check and adjust characters’ status when you configure team for next battle. Grey characters are unavailable. 3-2 System of items We design the system of items of course. Putting different items into right slots can considerably raise characters’ statistics, which will do help to your following battles. Here is some information about items: The only way to gain items so far is: First, win a battle. Second, go to Kourindouand get some dormant items. Third, infuse ‘Nil Soul’ into items and waken them. Now you can use them. Wakened items have random statistics. Different levels will randomly drop different items. For example, if you get a Reimu’s weapon in ‘Hakurei Shrine’, then next time you may see this weapon in another level instead of ‘Hakurei Shrine’. The reason why we design this mechanism is that we hope we can avoid letting players play one level repeatedly just for one specific item. So far, each character has her private weapon but armors and accessories can be used universally All dormant items you get from all levels will only exist before next time you get new dormant items. In other words, if you don’t waken dormant items you get from the last battle during the period between the last battle and next battle, these dormant items will be replaced by new dormant items ▲ fter you win a battle, you can get some dormant items in Kourindou. Since the ‘Nil Soul’ is finite, it deserves to think twice before wakening items. 3-3 System of levels We design a map ranging from Hakurei Shrine to Scarlet Devil Mansion.What’s more, you will see some special landmarks on this map, they correspond to battlefields in official games.Yes, those familiar opponents will challenge you when you exploring the map. Here is the explanation in detail about this system: You can only unlock next area by defeat the boss of this area. You can challenge every area repeatedly. You will get random items from different area. Story of each area will only be motivated the first time you challenge the area What’s more, we are trying our best to polish this aspect and enrich players’ experience of exploring the map. ▲ Once you’ve explored the whole map, you will get a picture of part of Gensoukyo. By the way, we haven’t designed this picture completely on the basis of official games. 4.ther things we think we should display here 4-1 Characters in the official game ‘the Embodiment of Scarlet Devil’ are all available. Besides Reimu and Marisa, nine characters in ‘the Embodiment of Scarlet Devil’ will appear in our game. They will be unlocked with players’ exploration of storyline. ▲ The deblocking of two vampire bosses has some special conditions so we decide not to display their images here. 4-2 Humorous storyline We fill this game with a great deal of stories. While enjoying the main line, we hope these stories can make you smile knowingly. Yes, it is just a relaxing game, a pleasant game from the beginning to the end. So, you can motivate any story as you wish. 4-3 Salute the original music——Remix based on original music In recent years, the mainstream of composing TouHou fan music is reshaping original music. Actually, we’ve chosen a different way when we developing game music. We decide to use the remix adaption of original music (which is closer to original music). So far, we’ve completed 23 songs. Well, that’s not the end. This number is still raising.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/941300/header.jpg?t=1650424695",
    "Price": 7.99,
    "Developers": "Re零同人社,二色幽紫蝶",
    "Publishers": "二色幽紫蝶",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_a918f1ac689d6ac004fdbaeb0c564017bfa13e0c.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_dcaed500bb150377169f29eecf3aec47fa651293.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_ca5864b088149bc21d8e134fc4622b388fe2c986.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_ad67d139e950d0becc0ae0877ead5f6bb15dee10.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_95f2b055e27287fb0e2925981eedc68503e86343.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_ebf3719867cbcf9dd2bbdabb6174dca7eaafc9d2.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_7d4c2b0b2d1f98b830b6828bf9f626f8a9267c5c.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_31ad8f415d30ae0f1a1f58edf23069cb284e0e2d.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_ab4b36e9ba9cb3087c08cecc42b5cbb358484048.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_28968b3e3ddedb5b4c8852cf142db9f373b5738a.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_88a62a7ba3b6962fd9d14e2061a0c677193b027c.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_cd34ab986a4b31f4b26627e20713b092e1a9a5b6.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_34727bf5f885a26b79d651cb53688a551f5086db.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_84633fff780f14635794566c6d6d1279e2347377.1920x1080.jpg?t=1650424695,https://cdn.akamai.steamstatic.com/steam/apps/941300/ss_41754b608bcc30a4c857d88a904fbc1b80c8e1e0.1920x1080.jpg?t=1650424695",
    "Slug": "touhou-nil-soul",
    "Meta Title": "TouHou Nil Soul: Feb 28, 2020, Re零同人社,二色幽紫蝶 and Full Over...",
    "Meta Description": "Looking for information on TouHou Nil Soul? Check out the release date (Feb 28, 2020), developer insights from Re零同人社,二色幽紫蝶, and a complete game summary.",
    "Alt Text Image": "Official header image for TouHou Nil Soul game - Steam 941300",
    "Canonical URL": "https://gusku.site/game/touhou-nil-soul",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TouHou Nil Soul\", \"description\": \"Looking for information on TouHou Nil Soul? Check out the release date (Feb 28, 2020), developer insights from Re\\u96f6\\u540c\\u4eba\\u793e,\\u4e8c\\u8272\\u5e7d\\u7d2b\\u8776, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Re\\u96f6\\u540c\\u4eba\\u793e,\\u4e8c\\u8272\\u5e7d\\u7d2b\\u8776\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e8c\\u8272\\u5e7d\\u7d2b\\u8776\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/941300/header.jpg?t=1650424695\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}