{
    "AppID": 688000,
    "Name": "Trials of the Thief-Taker",
    "Release date": "Aug 10, 2017",
    "About the game": "In London, 1729, before they had police, they had you: thief-takers, hunting criminals for cash! Fire a flintlock and sip gin in the age of powdered wigs. Will you grow rich catching smugglers and highwaymen, show mercy, or become a crime boss yourself? Trials of the Thief-Taker is a 140,000-word interactive historical adventure novel by Joey Jones, where your choices control the story. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. As a thief-taker, paid by the court or hired by the victims of crime to recover property and, for an extra price, bring the culprit to justice, you'll stalk your prey across the misty commons and narrow rookeries of 18th-century London. Lead a gang of unwashed ruffians (or stalk the streets alone) as you apprehend highwaymen on lonely roads, and root out crooks and counterfeiters in inns and coffeehouses. Through cunning, force, or suspicious connections, you will find your mark. You may strike a blow for justice, making a name for yourself and bringing good people to your cause. Or you can create the crimes you intend to solve, stealing the goods you'll be paid to recover, bribing prison guards to let your associates go, building your criminal empire while everyone lauds you as a hero. Be quick or cautious, proper or disreputable, generous or mercenary...it's all in a day's work for a thief-taker. Load your flintlock! There are thieves to take. Play as male, female, or as a woman disguised as a man; gay or straight. Make your way through a world ruled by manners, harsh laws, and lurking treachery. Run an empire of crime or establish the first police force...or both at the same time! Capture, befriend, or romance corrupt officials, escape artists, courtiers, highwaymen, smugglers and grave-robbers. Immerse yourself in Georgian lingo: learn the difference between a cove and a swell, a blue pigeon and an ark ruffian. Play the high-stakes dice game Hazard in the gaming houses of Covent Garden. Make your way with your silver tongue, a good horse, your street smarts or with two fists flying.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/688000/header.jpg?t=1538613631",
    "Price": 3.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/688000/ss_7cdd0fbb342953a5c8e085ddbbced61dd683b6bf.1920x1080.jpg?t=1538613631,https://cdn.akamai.steamstatic.com/steam/apps/688000/ss_92cadae3643f7f2789dec911bd24e74b8f32ba64.1920x1080.jpg?t=1538613631,https://cdn.akamai.steamstatic.com/steam/apps/688000/ss_2c91b528421a96f0ffb7a72601efd39f8dffa36d.1920x1080.jpg?t=1538613631,https://cdn.akamai.steamstatic.com/steam/apps/688000/ss_c9b01f711d39383fb035ae66d2d29e3f1464436b.1920x1080.jpg?t=1538613631,https://cdn.akamai.steamstatic.com/steam/apps/688000/ss_546d802cd99a6789aaf85284093f27b7bc292d3d.1920x1080.jpg?t=1538613631",
    "Slug": "trials-of-the-thief-taker",
    "Meta Title": "Trials of the Thief-Taker: Aug 10, 2017, Choice of Games ...",
    "Meta Description": "Looking for information on Trials of the Thief-Taker? Check out the release date (Aug 10, 2017), developer insights from Choice of Games, and a complete...",
    "Alt Text Image": "Official header image for Trials of the Thief-Taker game - Steam 688000",
    "Canonical URL": "https://gusku.site/game/trials-of-the-thief-taker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trials of the Thief-Taker\", \"description\": \"Looking for information on Trials of the Thief-Taker? Check out the release date (Aug 10, 2017), developer insights from Choice of Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/688000/header.jpg?t=1538613631\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}