{
    "AppID": 544290,
    "Name": "Tyto Online",
    "Release date": "Nov 25, 2016",
    "About the game": "We are still in development. Please read the Early Access description above before purchasing. Thank you! Tyto Online is a MMORPG where you play as an evacuee from the now uninhabitable Earth. You’re settling on the planet Ovo to study at Tyto Academy as you establish your new life. Explore and complete quests while learning real science concepts. These are designed to be appropriate for 9 years old and up. Right now, we have mainly content around Ecology (aligned with middle and high school science standards), including a create-your-own ecosystem Sandbox. We are beginning to add Heredity content beginning on June 5th. For information about this module, see: We'll continue to add features and content along with our early access users in a true co-development fashion, based on your close input and conversations. Our target is to have 3 complete modules with sandbox and emergent gameplay features, and a very smooth experience overall, before we leave early access. As we continue, our long-term goal is to have a massive MMORPG where you can learn across many subject areas as you play for years. CURRENT GAME FEATURES Customizable Character Customizable Apartment with furniture and decor kits Over 50 Quests, with more being added 3 Espeth City Zones: Espeth Park, Student District, Civics District 5 Biodomes from Earth: Mojave Desert, Great Plains Grassland, Amazon Rainforest, Himalayan Forest, Alaskan Tundra Create-your-own ecosystem biodome simulation Full branching dialogue with quests (voice acting in progress, some implemented) Pets that follow you around Leveling system Custom composed music Please note that we are active in development and have many ways to co-develop with our Early Access users (see the descriptions above). We release updates (nearly) every week that include additional features and/or content. FUTURE PLANNED GAME FEATURES* Many more quests, customization options, furniture, decor, etc. Clubs (a more open version of guilds) Paint your own clothing and furniture Player economy -- ability to sell your creations, start learning about entrepreneurship as you rent carts/shops Additional modules of content -- after Ecology and Heredity, we're looking at more Life Science and/or Entrepreneurship Achievements and Titles Water Balloon Roller Derby Capture-the-Flag PvP Arena Additional crafting and sustainable resource gathering Upgrade your apartment, move around to new areas! * Please note this is not a commitment that these will happen, pending on resources, gameplay feedback, or other factors. THE LORE It is 2142, and Earth is no longer home to humans. You’ve been evacuated alongside countless others, and have spent the past four years traveling through space. Your destination: the planet Ovo, where you’ll begin a new life. Ovo is home to many strange and wonderful plants and animals, as well as hundreds of humans who made the journey before you. Tyto Academy, the most prestigious school in the galaxy, has accepted you as a student. Spend your days exploring and performing experiments in the Ovonian jungle, and decorating your very own, private apartment. Care for the last of Earth’s native plants and animals in the biodome facility. Quest by yourself or with friends online, and learn real scientific concepts as you play. Who knows? Perhaps your collective efforts may one day restore the Earth!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/544290/header.jpg?t=1496316353",
    "Price": 0.0,
    "Developers": "Immersed Games",
    "Publishers": "Immersed Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_8c42de21da0ab7e5b00081fdd5673ad83a3b663c.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_4c535dbc623d7b74ce4dea54a34d307c38a835bc.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_99570a7305311ae53d078b99cf0e4f6ea4e64d94.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_c54613f598c024042b681f3506f0baea9f605dcf.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_f7fad615a363818a326104fa2ac7db5b0897fee2.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_3775f3cb70d1b6e54f98d1648b1ce59c61340392.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_c25113b121c237b5dafe081641d92a64618c675e.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_9b0424ced8aa60a6e7a31345e934f0f6eef6aa59.1920x1080.jpg?t=1496316353,https://cdn.akamai.steamstatic.com/steam/apps/544290/ss_880c1e4a71a9e1a6890b0fa8cb0f9489920b70f5.1920x1080.jpg?t=1496316353",
    "Slug": "tyto-online",
    "Meta Title": "Tyto Online: Nov 25, 2016, Immersed Games and Full Overview",
    "Meta Description": "Looking for information on Tyto Online? Check out the release date (Nov 25, 2016), developer insights from Immersed Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Tyto Online game - Steam 544290",
    "Canonical URL": "https://gusku.site/game/tyto-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tyto Online\", \"description\": \"Looking for information on Tyto Online? Check out the release date (Nov 25, 2016), developer insights from Immersed Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Immersed Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Immersed Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/544290/header.jpg?t=1496316353\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}