{
    "AppID": 743860,
    "Name": "Wild West Online",
    "Release date": "May 10, 2018",
    "About the game": "“We all came to this new world for a reason. Some looking for the thrills of the frontier, some seeking fortune and glory, and some just looking for a new beginning. Whether seeking justice, revenge or escape from past deeds -- we all had to find our own way to survive.” Wild West Online is a online persistent open world action game that immerses players into an unrestricted PVP range war on the Western Frontier. Once you step outside the safety of town, you're stepping into the fight! WWO is intended for multiplayer online action-shooter game fans and social (PVP) roleplayers. This is not a story-driven MMO experience with AI enemies and deep NPC narratives, rather the PVE features in WWO are designed to enrich the PVP experience with social roleplaying, farming, mining, crafting, homesteading and quests. FACTION WARFARE Pick either the ruthless McFarlane Family or their calculating rival Steele Industries , and join the clan war for control of Rosewell County and all its bountiful resources. Pick a clan and participate in this feud: fight for the honor of the company, help settle scores, and most importantly defend your own territory while seizing land and resources away from your rival. PUBLIC SHOWDOWNS Your mettle will be further tested through public PVP combat events. Fight against all comers, alone or teamed with friends. The rewards rich, but the opposition is fierce. Only the toughest and cleverest will walk away with the loot. Daily events let you hone your skills in preparation for exclusive, high-value events. LARGE WORLD OF WILD WEST TO EXPLORE Wild West World exploration will take you through a variety of gorgeous biomes, each with its own charms – and dangers. Plains, forest, desert and mountains can all be found in Wild West Online. And like the pioneers of yore, you can map out new territories looking for the perfect claim or homestead, or you can take a different path when your wanderings lead you into one of WWO’s various settlements. BECOME A SEASONED HAND The more you play, the more you'll level-up and progress your character. Not only will you build-out your skill tree, but you'll unlock new gear and be able to upgrade and modify your weapons in order to dominate the frontier. And character progression in WWO isn’t a locked to a rigid class system, but rather you put time and skill points towards what excites you the most. SOCIAL ROLEPLAYING Perhaps you’re a gunslinger type, drawn to combat? Spend your time and points in that area. Are you more of a craft-and-sell type? The shops eagerly await your wares. Or perhaps you’d like to stick to the wilderness, adventuring for cash, or simply exploring this new frontier? Social roleplaying with your friends allows you to try different role playing games - you can choose the righteous path of being a Sheriff, and find yourself beholden to the laws of the land. Or you can opt for the dangerous freedom of running as an outlaw. All these things are possible in Wild West Online.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/743860/header.jpg?t=1545343726",
    "Price": 0.0,
    "Developers": "WWO Partners Ltd",
    "Publishers": "WWO Partners Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_4af5ccff1c85f6151965c54ba94a366917291dd3.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_3406e8dbf22075728e10d1fd6cfdc5ef02b3abe6.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_450b559c7baf1be11308c28e20371525744aa600.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_7ebbfdc1975e99a3f86c42003b02628b82fdd9bc.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_7e3cc987caaca5d31e08e4289ed280d44432d539.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_347061d3624d52b111deef10b72613f188b0bdc8.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_9c37f64d24052cc381b04b22425cd3f627472978.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_9e1c65096451b0af90dab088e07610cb19e3a719.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_d7145c4a4ed438a3400936833a8a0e97b7800567.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_5b482c26cae1b1c91a4ca62f2fec4cc91256a51d.1920x1080.jpg?t=1545343726,https://cdn.akamai.steamstatic.com/steam/apps/743860/ss_5714a46cd523bed07ca6628a4c0ba3d2531ec6a6.1920x1080.jpg?t=1545343726",
    "Slug": "wild-west-online",
    "Meta Title": "Wild West Online: May 10, 2018, WWO Partners Ltd and Full...",
    "Meta Description": "Looking for information on Wild West Online? Check out the release date (May 10, 2018), developer insights from WWO Partners Ltd, and a complete game su...",
    "Alt Text Image": "Official header image for Wild West Online game - Steam 743860",
    "Canonical URL": "https://gusku.site/game/wild-west-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wild West Online\", \"description\": \"Looking for information on Wild West Online? Check out the release date (May 10, 2018), developer insights from WWO Partners Ltd, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"WWO Partners Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"WWO Partners Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/743860/header.jpg?t=1545343726\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}