{
    "AppID": 1727020,
    "Name": "爆Z联",
    "Release date": "Jan 21, 2022",
    "About the game": "A game developed by 2 people. We are also one of the previous research and development. We believe that the iterative development of the game is inseparable from continuous exploration and inheritance. So we choose to continue and polish this game here. data architecture The numerical architecture similar to wow and sword net 3 is adopted. Support long-term content updates (free). diversified scenes of sea, land and air With the development of the plot, players will experience the wonderful adventures of drifting, air combat, flying cars, abyss and missiles. At the same time, each leader has playing skills and needs simple exploration and thinking. free combination of forbidden skills of gods The rouge playing method in the game can freely combine cyclone, fire, thunder explosion, blade, dirt, wood leaf, crystallization and other element skills, and more advanced elements appear with the depth of the scene. catch a zombie and be a pet The ghosts you can see in the game can be caught and cultivated. After feeding fish, swallowing corpses and sucking marrow, they can grow into reliable combat partners. In addition, some rebellious mercenaries and mecha chariots can also become your partners. extraordinary guns and weapons Subsequently, artillery, fire gun, electric gun, sword, axe, etc. will be updated one after another. All are dropped by the world boss, and some double copies are obtained. other ways to play 1. Fishing: buy feed to lure the fish you want to catch, but it may also lure the water ghost to take the bait. Fish can also be raised to a very large extent. 2. Legion Hegemony: form legions to compete for territory. Legions with territory can harvest rare currency every day. 3. Arena: conduct real-time PK to compete for the ranking of the ladder. (to be opened soon)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1727020/header.jpg?t=1656814668",
    "Price": 0.0,
    "Developers": "Corgi",
    "Publishers": "Corgi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1727020/ss_5740e9ea454ad45221969bd6893d0d56067cd200.1920x1080.jpg?t=1656814668,https://cdn.akamai.steamstatic.com/steam/apps/1727020/ss_ef0d8ae1fe3ecda2f8434d13d97050febf155503.1920x1080.jpg?t=1656814668,https://cdn.akamai.steamstatic.com/steam/apps/1727020/ss_0002bcec810227e571316d9b948c8f5d47746e8c.1920x1080.jpg?t=1656814668,https://cdn.akamai.steamstatic.com/steam/apps/1727020/ss_d7375a6a2903ca004f14ba51e9e1a04d908d651e.1920x1080.jpg?t=1656814668,https://cdn.akamai.steamstatic.com/steam/apps/1727020/ss_0acaad9a4f48fcd98ea026e39fdab09d20b69814.1920x1080.jpg?t=1656814668",
    "Slug": "z",
    "Meta Title": "爆Z联: Jan 21, 2022, Corgi and Full Overview",
    "Meta Description": "Looking for information on 爆Z联? Check out the release date (Jan 21, 2022), developer insights from Corgi, and a complete game summary.",
    "Alt Text Image": "Official header image for 爆Z联 game - Steam 1727020",
    "Canonical URL": "https://gusku.site/game/z",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7206Z\\u8054\", \"description\": \"Looking for information on \\u7206Z\\u8054? Check out the release date (Jan 21, 2022), developer insights from Corgi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Corgi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Corgi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1727020/header.jpg?t=1656814668\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}