{
    "AppID": 450500,
    "Name": "Ace of Seafood",
    "Release date": "Apr 8, 2016",
    "About the game": "In the seas of the distant future, humans have all but disappeared. Now, fish and crustaceans fight great wars, massacring one another with deadly lasers. In your current, newly-awakened state, you are no more than a piece of seafood. However, you have been blessed with the talent for leading your allies into battle. Ransack the reefs. Discover underwater worlds. Raise an army. Rack up your victories. Do whatever it takes to become the Ace of Seafood. More About the Game Defeat enemies, gather allies, hone your skills, secure reefs, and voyage the seas from top to bottom! Ace of Seafood is a third-person action game in which you establish a party of up to six fish/crustaceans, exploring the vast ocean and battling with various forms of marine life in order to expand your oceanic domain. At the beginning, you need to share your secret desire to become one of the seafood. Take control of an array of sea creatures and freely explore the ocean in an open-world map. Engage in battle with various forms of marine life in order to capture the reefs they guard. The reefs serve as bases from which you can strengthen your allies and breed more of them. The more victories you rack up, the stronger the army you can control, and the further out to sea you can explore. In battle, your allies will follow the commands of the Ace (that's you). Guide them wisely as they enter battle formations and use their special abilities. In the world of Ace of Seafood, sea creatures possess the ability to shoot powerful rays of light that can destroy just about anything. So, do you get it now? No? Why not? New Features An online mode has been added to the latest version of the game! You can create your account on the top screen (see below image). Once you log in and go to the load data screen, an 'UPLOAD' option will be displayed to the right. Use this option to upload your data to the server and share your account between iOS/Android versions, other PCs, etc. As an extra added bonus, once you’ve beaten the game you will be able to battle the Ace Team of another player who has uploaded their own data to the server as well. Note: When uploading data, if you do not specify names of your team and team members, they will not appear in the game and will be invisible to other players. Additionally, from 'CONFIG', you can set 'ONLINE FEATURE' to 'OFF' to prevent other teams from attacking you. (Attack is set to “ON” by default). Message from the Developer Hmm, what kind of game should I make...? I'd love to float endlessly through a vast, rich world. I want to freely speed around in all directions, in beautiful formations. I also want to dig holes and explore the depths of the ocean floor. I want to be able to take on monsters several times my size. I want to shoot laser beams from my mouth... and so on. So many dreams... and to think that “playing as seafood” would be the way to fulfill them. Behold: the school of fish and their sleek, agile movements, honed through experience from battles past. Admire the underground tunnels dug out by the shrimp. Discover the terrors that lurk in the deep, and the creatures which can light up even the darkest depths of the ocean! These are the sorts of creatures that I could never create on my own... So allow me to pass onto you the legend of their awesome deeds instead. This is the epic tale of the champion of an ocean world. And epic tales are known to carry a tiny bit of exaggeration...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/450500/header.jpg?t=1592544833",
    "Price": 11.99,
    "Developers": "Calappa Games",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_5bb2559509d93679a4384ce03d56f8933f9a58b1.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_93214a9f635eaca4b6b18094e7d454f6ba4517fe.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_98f1874cabbab6bd2cf926d71162ddaad546d0b8.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_b9f86eacc6178f7e7e46213a3771a640c7630a26.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_5e09d93155c5e25a1d15088e6533347aff7a519a.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_7e4e491fdf9260abbd9dbfac4e7ff5f4e8e233eb.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_154661659f881bd4c88c5f0a4b2da1a96a2c3d84.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_03d72d58ea67fe5867e5237854b54179aa4a69d6.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_cd1b840e6729c197613dc40c0c8ae2c0c219f013.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_b26ea33a9b46b8484d8160e423a59afd9b59433a.1920x1080.jpg?t=1592544833,https://cdn.akamai.steamstatic.com/steam/apps/450500/ss_5dcc96b1acff5fafa34c10b5280eabe79a85e08e.1920x1080.jpg?t=1592544833",
    "Slug": "ace-of-seafood",
    "Meta Title": "Ace of Seafood: Apr 8, 2016, Calappa Games and Full Overview",
    "Meta Description": "Looking for information on Ace of Seafood? Check out the release date (Apr 8, 2016), developer insights from Calappa Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Ace of Seafood game - Steam 450500",
    "Canonical URL": "https://gusku.site/game/ace-of-seafood",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ace of Seafood\", \"description\": \"Looking for information on Ace of Seafood? Check out the release date (Apr 8, 2016), developer insights from Calappa Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 8, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Calappa Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/450500/header.jpg?t=1592544833\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}