{
    "AppID": 1215350,
    "Name": "AudioWizards",
    "Release date": "Jan 22, 2020",
    "About the game": "AudioWizards is a fully accessible audio game for the blind and visually impaired where you battle incoming enemies using elemental spells differentiated by their unique sounds. Grab your headphones, turn up the volume, and dive into the world of Sondveiw! SUPPORTED SCREEN READERS NonVisual Desktop Access (NVDA). Windows Screen API. STORY AudioWizards is set in the world of Sondveiw, a world inhabited by an organization called, you guessed it, AudioWizards. The organization was formed to defend Sondveiw from Distortions, nasty creatures that thrive in noise, adamant on consuming the world in it. AudioWizards believe that sound enables their magic and gives meaning to it, but it’s hard to find harmony with all that distorting noise around. You play as an apprentice who travels with a seasoned wizard called Saundaman. Saundaman’s teaching methods are pretty much “learn as you go” while he quenches his never-ending thirst for tea. FEATURES HIGH-QUALITY SOUNDS Recognize everything happening around you by the amazing sounds alone! Listen to the elemental sounds the Distortions make and counterattack them with corresponding elements! ACCESSIBLE Fully accessible for the blind and visually impaired with screen reader support and intuitive navigation. Navigation made easy and all UI elements are fully labeled. CARTOONY 3D GRAPHICS Includes easily distinguishable cartoony graphics, which is a rarity in audio games. The audio is still the key! ACTION-PACKED GAMEPLAY Easy to learn, hard to master. The gameplay is fast-paced, intense, and challenging. Audio games community, this is for you! BREATHTAKING SOUNDTRACK All music was made in cooperation with the blind and visually impaired musicians. The soundtrack can also be purchased separately. CHARMING STORY MODE Embark on a wacky journey with your tea-graving mentor Saundaman in 20 + 5 unique story levels to unravel the mystery behind the invasion of Distortions. Funny narration about tea and magic! CHALLENGING ENDLESS MODE Put your listening skills to the test and compete for the highest score against an endless wave of enemies! Collect Wizarding Hats to increase your chances of survival and keep aiming for those sweet hi-scores!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1215350/header.jpg?t=1603879048",
    "Price": 4.99,
    "Developers": "myTrueSound",
    "Publishers": "myTrueSound",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1215350/ss_3eb208d430293a36f2997cbd5a28fc74c10b5484.1920x1080.jpg?t=1603879048,https://cdn.akamai.steamstatic.com/steam/apps/1215350/ss_726b8cf3f5e82925a7ca3a1bb18ab3ffc31916b9.1920x1080.jpg?t=1603879048,https://cdn.akamai.steamstatic.com/steam/apps/1215350/ss_9380a0761b1fc9777d90a371d01cf6b35f11caae.1920x1080.jpg?t=1603879048,https://cdn.akamai.steamstatic.com/steam/apps/1215350/ss_27d0422c11020a4137e978f29da1e4abba43973b.1920x1080.jpg?t=1603879048,https://cdn.akamai.steamstatic.com/steam/apps/1215350/ss_44d3e837277283028b3e0b491b2935cbeca3153c.1920x1080.jpg?t=1603879048",
    "Slug": "audiowizards",
    "Meta Title": "AudioWizards: Jan 22, 2020, myTrueSound and Full Overview",
    "Meta Description": "Looking for information on AudioWizards? Check out the release date (Jan 22, 2020), developer insights from myTrueSound, and a complete game summary.",
    "Alt Text Image": "Official header image for AudioWizards game - Steam 1215350",
    "Canonical URL": "https://gusku.site/game/audiowizards",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AudioWizards\", \"description\": \"Looking for information on AudioWizards? Check out the release date (Jan 22, 2020), developer insights from myTrueSound, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"myTrueSound\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"myTrueSound\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1215350/header.jpg?t=1603879048\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}