{
    "AppID": 1924350,
    "Name": "Bargue",
    "Release date": "Jun 17, 2022",
    "About the game": "Can you survive in a bar where the mafias are located? You have to be careful who you talk to as you try to survive in a 12-person bar with mafias, customers and neutral. Can you talk to the different people you sit at the table in each round and convince them you're on the good side? You can play the Bargue game online with a group of 12 friends or with random players. Thanks to the voice chat infrastructure of the game, you can talk with the players in-game and try to persuade them by speaking. At the beginning of the game, do not forget to choose which language you will play the game, or you may find yourself in a game where a different language is spoken :) You must stick to the role assigned to you at the beginning of the game. As a doctor, you can heal yourself or you can heal other players, while as a detective, you can see what is going on in the game. You can add some excitement to the game as the owner of the place, and you can enjoy your gold with the rich role. You have to be careful not to get killed by the mafias and not to lose your money to the thief! If you are in the role of a customer, do not be sad, you can make the game more fun by using your gold in different features! At the beginning of each game, you will have a certain amount of gold. You can spend these golds according to the features of your role. You can save your gold for the next rounds, or you can use your gold immediately. Do not forget that the more rounds you do not spend your gold on skills, the more money you have. Unless you lose your gold to the thief 🙊 So, how you use your gold is entirely up to you :) We can divide the roles in the game into three categories. These categories are neutral, customers, and mafias. Our neutral role is the thief. As a thief, your main goal in this game is to reach a certain amount of gold until the game is over. How will you achieve this? You can save your money for a few rounds if you want, or you can try to steal other players' money for some gold. But unfortunately, it's a matter of luck whether you can steal the money or not. So you can try to find the rich in the game and when you sit with them, you can steal their money :) As customers, you must understand who is the mafia and try to get the mafia out of the bar. Customers consist of the doctor, the detective, the rich, the owner of the place and regular customers. If you are a doctor , you must use your powers at the right time and try to protect the customers from the mafia who are trying to poison them. Or you can bring back some player to the life that you believe is good by saving a few rounds of money. If you are a detective , you can use your powers to figure out who the mafias are. You can use your gold to see what has been ordered on the tables, or you can use it to learn the role of someone you believe is bad. If you are rich , you should choose carefully who to give your money to. You can give your money to the doctor and help them to protect the customers. If you are the owner of the place , you can find the mafias and use your money to kick them out of the bar. If you cannot decide who is bad, you can choose to sit with that person for the next round and try to figure out if she/he is a customer or a mafia (or thief :). As the mafia, your goal is to get the dominance at the bar. You can use your gold to poison customers or the thief. But you can also try to persuade the neutral thief and take it to your side :) You can chat among other mafias with mafia chat. Thus, you can decide what kind of strategy you will adopt together. But one of the mafia’s say is more important. Who? The Godfather. Yes, you read it right, of course, you have a mafia boss, and the final decision is her/his. What happens if the godfather dies? Another mafia takes over the role of the godfather. So you keep trying to dominate the game. Now you know most of the things. You can learn the rest from the information part of the game. You can get one step closer to winning by developing new strategies while playing. After that, the ball is in your court. Can you persuade your opponent by speaking so that you will not be one of the players who are thrown out of the bar by voting at the end of each round? Let the good one win, or should we say the bad one 🙄",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1924350/header.jpg?t=1655988701",
    "Price": 4.99,
    "Developers": "Evenmore Games",
    "Publishers": "Evenmore Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1924350/ss_cb8d0692f1afae1b29dafab6a1fa7b6e4002f416.1920x1080.jpg?t=1655988701,https://cdn.akamai.steamstatic.com/steam/apps/1924350/ss_f509ae70976da936babb031cd309c0647603d781.1920x1080.jpg?t=1655988701,https://cdn.akamai.steamstatic.com/steam/apps/1924350/ss_8eae659c55f9cc49177c0da21575decc4f256491.1920x1080.jpg?t=1655988701,https://cdn.akamai.steamstatic.com/steam/apps/1924350/ss_37d46db83ef44f40d7faf6f9b3f6a5d1f47c9b74.1920x1080.jpg?t=1655988701,https://cdn.akamai.steamstatic.com/steam/apps/1924350/ss_bfb70786860cc9fb6f26af8aaa7483ba0e1dd78e.1920x1080.jpg?t=1655988701",
    "Slug": "bargue",
    "Meta Title": "Bargue: Jun 17, 2022, Evenmore Games and Full Overview",
    "Meta Description": "Looking for information on Bargue? Check out the release date (Jun 17, 2022), developer insights from Evenmore Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Bargue game - Steam 1924350",
    "Canonical URL": "https://gusku.site/game/bargue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bargue\", \"description\": \"Looking for information on Bargue? Check out the release date (Jun 17, 2022), developer insights from Evenmore Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Evenmore Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Evenmore Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1924350/header.jpg?t=1655988701\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}