{
    "AppID": 821560,
    "Name": "螢幕判官 Behind the Screen",
    "Release date": "Apr 3, 2018",
    "About the game": "“Behind the Screen” is a game includes various elements such as puzzles, stealth modes and fighting that you can easily handle. Most stories are inspired by actual historical events of Taiwan. If you dig deep into our stories, you will find that it’s not just an “easy game”. Although players can finish the game in about one to two hours, the real thinking challenge will still goes on after you solve it. In “Behind the Screen”, players will explore deeply into the memories of a suspected murderer’s life, in order to dig out the real truth. The whole storyline is set in 1970s when Taiwan just got rid of Martial Law Period, and Internet hasn’t widely known nor used. Through this game, you can experience how media destroys a person under the help of audiences, which echoes with the meaning of it’s Chinese name: “Screen Judges”. Without witnessing the truth, everyone could be a judge hide behind the screen, unfairly judging others’ crime by one-sided words. Art style: We used a surrealistic picture book art style inspired from old Taiwanese hand-drawn color advertisements and posters. During those times, painter blended reality and imagination to create a realistic style that mimics photos yet is different from traditional oil painting, thus making a picture book style art with great allurement. This delicate and vintage style will bring you strong feelings about Taiwan’s old period, which is absolutely worth experiencing. Game features: ＊Spending over one year of developing, there are many hidden metaphors and chapters in this game for players to discover. ＊This game reflects our world. Player will continuously experiencing events related to issues like media abusing, stereotype, etc. ＊Using lots of Taiwanese style elements in the game, which provides you a great chance to glance Taiwanese culture. Development group: 18 Light, an independent game studio founded in 2012 by a bunch of college student in their apartment on 18th floor. Our motto is, “Give you an extraordinary journey in a coffee time.” And every game we made is about an adventure. We insist creating games that enable players to share fun and to discuss the story with each other. We blend social issues on our game plots, so besides entertainment players can enjoy our deep stories. In the future, we hope we can change the world through our games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/821560/header.jpg?t=1650621150",
    "Price": 8.99,
    "Developers": "18Light Game Ltd.",
    "Publishers": "18Light Game Ltd.,Cheese Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/821560/ss_6f12c8c5fb72881b73133d83c122912cc3d011a1.1920x1080.jpg?t=1650621150,https://cdn.akamai.steamstatic.com/steam/apps/821560/ss_94862b9d891cd4d1379bce66e63a89f55550a373.1920x1080.jpg?t=1650621150,https://cdn.akamai.steamstatic.com/steam/apps/821560/ss_553c08bd00ff41abd930ee5ffe754d3eb854ff01.1920x1080.jpg?t=1650621150,https://cdn.akamai.steamstatic.com/steam/apps/821560/ss_533a3622be4f83dc891503d8322d3065dc29e5c9.1920x1080.jpg?t=1650621150,https://cdn.akamai.steamstatic.com/steam/apps/821560/ss_7cf7a468b770430bdb64ed6c508239603d13f968.1920x1080.jpg?t=1650621150,https://cdn.akamai.steamstatic.com/steam/apps/821560/ss_50b0d0894af02477aea227c6aa4ba51318475b51.1920x1080.jpg?t=1650621150",
    "Slug": "behind-the-screen",
    "Meta Title": "螢幕判官 Behind the Screen: Apr 3, 2018, 18Light Game Ltd. an...",
    "Meta Description": "Looking for information on 螢幕判官 Behind the Screen? Check out the release date (Apr 3, 2018), developer insights from 18Light Game Ltd., and a complete g...",
    "Alt Text Image": "Official header image for 螢幕判官 Behind the Screen game - Steam 821560",
    "Canonical URL": "https://gusku.site/game/behind-the-screen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u87a2\\u5e55\\u5224\\u5b98 Behind the Screen\", \"description\": \"Looking for information on \\u87a2\\u5e55\\u5224\\u5b98 Behind the Screen? Check out the release date (Apr 3, 2018), developer insights from 18Light Game Ltd., and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"18Light Game Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"18Light Game Ltd.,Cheese Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/821560/header.jpg?t=1650621150\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}