{
    "AppID": 810020,
    "Name": "Belle II in Virtual Reality",
    "Release date": "Mar 5, 2018",
    "About the game": "This virtual reality model of the Belle II experiment at the KEK laboratory in Japan shows the marvels of the subatomic world, where matter and antimatter collide at nearly the speed of light, converting energy to matter and back again according to Einstein’s famous formula E = m c squared, all in the blink of an eye. Watch and control the simulation of each collision event in which an electron and its antimatter counterpart collide and morph into other forms of subatomic matter that move through the Belle II apparatus. There are three variants of the Windows app: for the Oculus Rift, the HTC Vive, and the computer screen. The Mac OSX and Linux apps display on the computer screen. Please see pages 1-4 of the quick-reference guide for the hand-controller joystick and button mappings for your controller (Xbox controller, Oculus Touch, or Vive) or for your computer's keyboard/mouse. When you start the app, you see the true-scale Belle II apparatus (relocated from Japan into the CUBE at Virginia Tech). The exterior container fades away, exposing the active detector elements inside. The first electron-positron-collision event is loaded and then animated for its 100-nanosecond duration, showing the detailed trajectories of the incoming particles along the two beam lines and of the by-products from the collision of one electron with one positron. At the end of this collision history, the particle sprites and trails are erased so that you see only the hits recorded by the active detector elements in the 'snapshot' of the collision event. Beam-line particle bunches pass through each other every 4 nanoseconds but only a few of these bunch crossings result in a collision; the colliding particles are highlighted in the animation. The beam-line particle bunches circulate in the vacuum beam lines of the 3-kilometer-circumference SuperKEKB accelerator; only the short section nearest the Belle II apparatus is shown in this app. With your controllers, you may move horizontally and vertically to enter the detector's interior and rotate your viewpoint. By turning your head, you may view the detector and the collision by-products from different orientations. You may rewind and fast-forward through the history timeline of each collision event, pause/resume, and slow down or speed up the animation rate. You may zoom in or out with your controllers if you enable this feature in the in-game menu (guide page 6). Gazing at one of the particle sprites, you may select it to expose a panel of detailed information about the particle (guide page 5). Check the SAVE box to copy this information to the virtual panel on one wall. Gazing at the rows on this wall, you may select among them to display the sum of the kinematic quantities in the bottom row. Check the FOCUS box on the sprite's info panel to highlight only the generational chain of daughters from this parent, temporarily hiding all other particle sprites and trajectories. In this state, bring up a similar information panel to UNFOCUS the generational chain and re-display all of the sprites and trajectories. With your controllers, toggle the display of the in-game menu or reposition it in front of you. Choose among three sub-menus (guide page 6) to control aspects of the event animation. The event-history timeline is always visible at the bottom of the menu: with your gaze and selection, you may scrub through this timeline and change the animation rate. In the TRANSFORM sub-menu, you may reposition yourself and scale the size of the detector (nominally at the true scale of 1:1); you may also enable the use of the controller hot-keys for menu-free zooming. In the DETECTOR sub-menu, you may change the visibility of parts of the Belle II apparatus (the active parts record the event snapshots, the passive parts provide the supporting structure). In the PARTICLES sub-menu, you control the visibility of some or all of the particle sprites and the sprite size; gazing at the entries in the event list, you may select among the available collision events (guide page 7). You may edit the event sequence or add new event histories by following the instructions on guide page 8. Enjoy your explorations of the subatomic world with the Belle II detector!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/810020/header.jpg?t=1535660640",
    "Price": 0.0,
    "Developers": "Zachary Duer,Tanner Upthegrove,Leo Piilonen,George Glasson,W. Jesse Barber,Samantha Spytek,Christopher Dobson",
    "Publishers": "Virginia Tech Institute for Creativity, Arts and Technology,Virginia Tech Department of Physics,Virginia Tech School of Education",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_85460ca8956569299323db3c575b18246986a0f5.1920x1080.jpg?t=1535660640,https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_9b4d0cb13f85b99ea7d411d8c17efc549bbe27ab.1920x1080.jpg?t=1535660640,https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_4d11bdb1c55214aef9857b6201a63afc5f99efee.1920x1080.jpg?t=1535660640,https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_0e1ba71a5a38b189dd7006806eed94f7093e5144.1920x1080.jpg?t=1535660640,https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_8ba103108dea58afac9dd231b83fa23556fcd4a3.1920x1080.jpg?t=1535660640,https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_69ec55fd417f1fe3bdf232122e172bcb71f0a21f.1920x1080.jpg?t=1535660640,https://cdn.akamai.steamstatic.com/steam/apps/810020/ss_92bba122176b8cdaa27eb17db82493ae43b71bb5.1920x1080.jpg?t=1535660640",
    "Slug": "belle-ii-in-virtual-reality",
    "Meta Title": "Belle II in Virtual Reality: Mar 5, 2018, Zachary Duer,Ta...",
    "Meta Description": "Looking for information on Belle II in Virtual Reality? Check out the release date (Mar 5, 2018), developer insights from Zachary Duer,Tanner Upthegrove...",
    "Alt Text Image": "Official header image for Belle II in Virtual Reality game - Steam 810020",
    "Canonical URL": "https://gusku.site/game/belle-ii-in-virtual-reality",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Belle II in Virtual Reality\", \"description\": \"Looking for information on Belle II in Virtual Reality? Check out the release date (Mar 5, 2018), developer insights from Zachary Duer,Tanner Upthegrove...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zachary Duer,Tanner Upthegrove,Leo Piilonen,George Glasson,W. Jesse Barber,Samantha Spytek,Christopher Dobson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Virginia Tech Institute for Creativity, Arts and Technology,Virginia Tech Department of Physics,Virginia Tech School of Education\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/810020/header.jpg?t=1535660640\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}