{
    "AppID": 582660,
    "Name": "Black Desert",
    "Release date": "May 24, 2017",
    "About the game": "Go Beyond Limits : WORLD CLASS MMORPG Black Desert is a game that tests the limitations of MMORPG by implementing remastered graphics and audio. Enjoy exciting combat and siege, exploration, trading, fishing, training, alchemy, cooking, gathering, hunting, and more in the vast open world. Black Desert - A true MMORPG The Start of Your Dream Adventure GRAPHICS Remastered Cutting-Edge Graphics An expansive, open world MMORPG made with Pearl Abyss’ proprietary game engine. With spectacular sceneries, realistic environments, and sophisticated details. Enter a world created with state-of-the-art graphics and prepare for unforgettable adventures. OPEN WORLD Multitudes of In-Game Activities Don't feel like fighting? Countless other activities await! Farming, trading, horse training, fishing, sailing, crafting, cooking… Get immersed and dive into diverse life skills! KNOWLEDGE Knowledge-Based Game Content Knowledge is power! Stick around and become an expert of the Black Desert world. Gain knowledge from combat, exploring, or interacting with NPCs. Knowledge will influence your gameplay and assist you on your adventures. COMBAT Non-Target &amp; Fast-Paced Combat Experience an innovative combat system unlike any other MMORPG. The need for quick reactions and precise control will keep you enthralled throughout your entire experience. Exciting commands/combos will always keep you on your toes. NODE &amp; SIEGE WAR Large-Scale PvP Wars Guilds, prepare for battle! Victory is near! Join formidable guilds as they fight head-to-head on the battlefield. Be victorious, become lords, and seize control of taxes, resources, and more! CUSTOMIZING Become Your True Self Experience insane levels of customization. From height, torso, face, and skin texture, to micro-level details, your imagination is the limit! Create your own unique characters, just like you've always desired, in Black Desert.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/582660/header.jpg?t=1658233501",
    "Price": 9.99,
    "Developers": "Pearl Abyss",
    "Publishers": "Pearl Abyss",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/582660/ss_ecb8cb71b127f9f6eea9bcdadddabd5b6d8f734f.1920x1080.jpg?t=1658233501,https://cdn.akamai.steamstatic.com/steam/apps/582660/ss_f367fad018a2cc92530e3b8fc7dc8541dd21b71e.1920x1080.jpg?t=1658233501",
    "Slug": "black-desert",
    "Meta Title": "Black Desert: May 24, 2017, Pearl Abyss and Full Overview",
    "Meta Description": "Looking for information on Black Desert? Check out the release date (May 24, 2017), developer insights from Pearl Abyss, and a complete game summary.",
    "Alt Text Image": "Official header image for Black Desert game - Steam 582660",
    "Canonical URL": "https://gusku.site/game/black-desert",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Black Desert\", \"description\": \"Looking for information on Black Desert? Check out the release date (May 24, 2017), developer insights from Pearl Abyss, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pearl Abyss\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pearl Abyss\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/582660/header.jpg?t=1658233501\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}