{
    "AppID": 1929210,
    "Name": "Block KUZUSHI",
    "Release date": "May 2, 2022",
    "About the game": "This game is a retro arcade-style forward-looking 3D block-breaking game represented by Atari 'Breakout' and TAITO 'Arkanoid'. All operations are possible with just the mouse, and the paddle (player) can play with a smooth operation feeling like operating with a dial controller. The behavior of balls and objects is performed by physics. Gimmick Depending on the type of block, it is durable, it moves when hit, it moves from the beginning, it speeds up the ball when it hits, it splits when it hits, it disappears and appears, until it hits the ball There are various types, such as those that cannot be seen, those that disappear when hit, but regenerate after a while, and those that shoot a beam and counterattack when hit by a ball. In addition, blocks such as the indestructible panel that flies from outside the screen, the 'drone' (Zako enemy) that flies around the screen and shoots the beam, and the 'core' (middle boss) that produces drones and blocks with high durability. There are other gimmicks as well. The boss is waiting for you on the last stage. Item As in many other breakout games, help items may appear under various conditions, giving you an advantage in the game. Multi-capsule (red) Fire another ball. The destruction efficiency of the block will be improved, but it will be difficult to keep the ball because there is also a collision detection between the balls. However, as long as there is one or more balls on the screen, even if you drop the balls into the abyss, it will not be a mistake. Defense Capsule (Blue) Five defensive blocks will appear in front of the abyss to cover the ball falling into the abyss. Also, the speed of the ball hitting the defense block will slow down. Brake capsule (green) The speed of one ball on the screen slows down. If there are multiple balls, the oldest ball will be the target. Score capsule (yellow) If you take it, you will get a high score. This game extends with points and increases the stock of balls, so it is advantageous to get points. Warp If you clear a specific stage, the 'warp' that can be started from the middle stage will be lifted. It will be saved to disk. Suspend and resume If you pause and click the 'STOP THE GAME' button during the game, a break save will be created and you will be returned to the title screen. If you press the 'RESUME' button from the title, you can resume from the interrupted stage. However, when it resumes, the interrupted save will be discarded, the score will be 0, and 4 or more balls in stock will be discarded. Also, if you select 'START' on the title screen, the interrupted save will be discarded. Interface You can set the screen size and window, full screen switching, BGM and SE volume adjustment, difficulty setting (easy, normal, hard), and graphic quality. The settings are auto-saved to disk. Operation method Move the paddle left and right with the left and right mouse. (Cannot move up and down) Left-click to confirm the menu. Right-click to pause. Rule It will be cleared if you destroy all the blocks that should be destroyed in the stage. Indestructible blocks and some highly durable blocks will be cleared without being destroyed. If you drop the ball into the abyss, you will make one mistake and the ball will be consumed, and if the ball runs out, the game is over. If the player is hit by the beam, it will be inoperable for a certain period of time, but just hitting the beam is not a mistake.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1929210/header.jpg?t=1651536577",
    "Price": 3.99,
    "Developers": "COPIKAL",
    "Publishers": "COPIKAL",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1929210/ss_8840462f600ba9a2b52fd000658064dffc7739ed.1920x1080.jpg?t=1651536577,https://cdn.akamai.steamstatic.com/steam/apps/1929210/ss_0721fcb392dbe94b4e2bcc13b282ea700d1a6049.1920x1080.jpg?t=1651536577,https://cdn.akamai.steamstatic.com/steam/apps/1929210/ss_7c49d350b3310c2deeee768fb699495d4dfe1cb3.1920x1080.jpg?t=1651536577,https://cdn.akamai.steamstatic.com/steam/apps/1929210/ss_c35d5d6f44d5406fb1349aad3e1b306487aa7d83.1920x1080.jpg?t=1651536577,https://cdn.akamai.steamstatic.com/steam/apps/1929210/ss_c741b12e7ca0960aac3ef89a86dfd4b37b8c555e.1920x1080.jpg?t=1651536577",
    "Slug": "block-kuzushi",
    "Meta Title": "Block KUZUSHI: May 2, 2022, COPIKAL and Full Overview",
    "Meta Description": "Looking for information on Block KUZUSHI? Check out the release date (May 2, 2022), developer insights from COPIKAL, and a complete game summary.",
    "Alt Text Image": "Official header image for Block KUZUSHI game - Steam 1929210",
    "Canonical URL": "https://gusku.site/game/block-kuzushi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Block KUZUSHI\", \"description\": \"Looking for information on Block KUZUSHI? Check out the release date (May 2, 2022), developer insights from COPIKAL, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"COPIKAL\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"COPIKAL\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1929210/header.jpg?t=1651536577\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}