{
    "AppID": 516000,
    "Name": "Candy Thieves - Tale of Gnomes",
    "Release date": "Oct 24, 2016",
    "About the game": "You inherit a strange box that is actually an interdimensional candy factory. How did this happen? Where are the gnomes coming from? Play the game to find out! ✔ MAKE JELLY CANDIES Who are these cute little shapeless jellies? Who cares? Stuff them into your factory right away to get super-tasty candies! First gnome’s barely arrived, and here’s a second one already! Without even asking permission, the entire line grabs your candy one by one and rushes off in all directions. Simple persuasion is unlikely to get them to leave. You need strong defenses and proven tactics! ✔ TRICKY GNOME THIEVES These gnomes will do anything to get your candy. Smash them, throw them, zap them – do whatever it takes! Nah, none of this is fatal. The creatures pouring out of the portals are just soap replicas of the little misers, who want to cram their storehouses full of sweet caramel candies. So they’re taking them from you. Without asking! ✔ ASSEMBLE ASSORTED TRAPS So why do you need metal parts? That’s right – to assemble ingenious traps, bait, and even guns. All in the name of anti-gnome defense! And these won’t just prevent the gnomes from stealing your goodies – they’ll also teach them not to take things from someone else without asking! The key is to understand the tactics and strategy of the game. Everyone has their own style – including you! ✔ STUNNING GRAPHICS The beautiful details of the gnome world come alive at your fingertips. A colorful adventure awaits. Hurry – this puzzle isn’t solving itself! The game contains beautiful high-quality 3D visuals. We decided to implement not just interesting gameplay but beautiful, colorful worlds that both adults and kids would love. ✔ EPIC BOSS BATTLES This fairy tale world will be appreciated by kids and adults alike. And the best part is when a huge strange creature suddenly appears on the screen – a boss! Ah... so you haven’t bumped into a boss yet? You can be sure they’ll be the most difficult challenge you will face. ✔ IMMERSE YOURSELF IN THE MYSTERIOUS STORY OF THE GNOMES What a mess! Our hero’s grandfather has gone missing, and a terrible disease spreads across the gnome world. What if this is all connected? Find out more about what happened... and fix it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/516000/header.jpg?t=1477374169",
    "Price": 2.99,
    "Developers": "TrolleyBuzz LLC",
    "Publishers": "TrolleyBuzz LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/516000/ss_f1ef37e54646e2f97000e1aef57ad1c8b2c21cef.1920x1080.jpg?t=1477374169,https://cdn.akamai.steamstatic.com/steam/apps/516000/ss_ceddcbc17df91504ca28493d85d0d709f36e417a.1920x1080.jpg?t=1477374169,https://cdn.akamai.steamstatic.com/steam/apps/516000/ss_e5818b84108087609a885491ba7870179abbe337.1920x1080.jpg?t=1477374169,https://cdn.akamai.steamstatic.com/steam/apps/516000/ss_6ba01f9acff297fe479ab312dd99664df876617a.1920x1080.jpg?t=1477374169,https://cdn.akamai.steamstatic.com/steam/apps/516000/ss_0dd15284638acb58848b5ec896a0e618a889fed6.1920x1080.jpg?t=1477374169,https://cdn.akamai.steamstatic.com/steam/apps/516000/ss_ebd4d25b5caf1c3b93d8bc816eb387309d9fded5.1920x1080.jpg?t=1477374169",
    "Slug": "candy-thieves-tale-of-gnomes",
    "Meta Title": "Candy Thieves - Tale of Gnomes: Oct 24, 2016, TrolleyBuzz...",
    "Meta Description": "Looking for information on Candy Thieves - Tale of Gnomes? Check out the release date (Oct 24, 2016), developer insights from TrolleyBuzz LLC, and a com...",
    "Alt Text Image": "Official header image for Candy Thieves - Tale of Gnomes game - Steam 516000",
    "Canonical URL": "https://gusku.site/game/candy-thieves-tale-of-gnomes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Candy Thieves - Tale of Gnomes\", \"description\": \"Looking for information on Candy Thieves - Tale of Gnomes? Check out the release date (Oct 24, 2016), developer insights from TrolleyBuzz LLC, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 24, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"TrolleyBuzz LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TrolleyBuzz LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/516000/header.jpg?t=1477374169\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}