{
    "AppID": 719250,
    "Name": "Cove Point Fun Center VR",
    "Release date": "Nov 20, 2017",
    "About the game": "Have you ever wanted to own your very own fun center complete with bowling alley, mini golf, VR arcade, escape room, arcade and many other fun things to do? Or, perhaps you just like fun centers. If you answered yes to owning one but don’t have millions of dollars to buy one, or answered yes to just liking to go to them but don't want to go out of your house, what is the next best thing (and cheapest option)? Having it in virtual reality! I couldn’t find a game that fit my wants in a fun center type game so I created my own to share with the world! There is so much fun to be had in Cove Point Fun Center VR. Update 2.0 has been released! Highlights: Ocean life update (added 20+ sea creatures, ocean environment got a huge overhaul), New VR in VR detective/escape room game (~30 - 60 minutes of game play), playable grand piano now next to the playable drum set in the arcade. See Update News Post for full details. Full game of 10 pin bowling 12 hole pirate themed outdoor minigolf, set on a tropical beach and inside a pirate cave Escape Room Experience – ever wanted to feel trapped and required to discover a way to escape your enclosure in which you are stuck inside? If not, give it a try anyways. A short escape room experience. Shooting basketball arcade game Skee-Ball game Drum set - A working drum set. Grab the drum sticks and make some noise! Or play along with songs from the jukebox. Guitar – strum a couple random chords on a guitar like a real rockstar (that's how the pros all play right?) Piano - playable grand piano by the stage in the arcade area. You can only play the piano with two fingers though. Chopsticks anyone? VR Arcade with two VR mini games – 1. Space Pong VR. play a futuristic VR racquetball type game by putting on the VR-arcade's VR headset while already in VR (VR-ception?). 2. Case of the Parlagog. A storylined, futuristic steampunk styled, detective investigation, suspenseful, escape the room type game. This new VR in VR game has about 45-60 minutes of gameplay. Whiteboard – use your mad art skills in VR by grabbing the markers and going crazy on the white board. Jukebox with many songs – don’t like what’s playing go ahead and change the song yourself. Don’t like any of the choices? Go ahead and shut it off entirely. Have a therapeutic relaxing time by chilling on the beach listening to the ocean waves hit up against the sandy beach all while hitting golf balls into the tropical blue waters. Go into the ocean, beneath the waves, to see the tropical life swimming around you. Play around with objects just as you would in real life. Most everything that would be interactable in real life is interactable in this game. Grab the fire extinguisher and blast it around Use the restroom! Don’t forget to wash and dry your hands Turn off the lights – just because you can Grab a free soda from the vending machine, then proceed to build a giant tower with them and then knock it over with a bowling ball Many other things to interact with, grab and throw around. Just like we all do in real life: like grabbing our computers and chucking them across the room. Motion controllers are required to play. As of now teleporting is the method of movement. Smooth locomotion is being looked at/worked on right now but not guaranteed to make it into the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/719250/header.jpg?t=1541615700",
    "Price": 3.99,
    "Developers": "Armet Games",
    "Publishers": "Armet Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_142a722c5d69854ca367dbef424e2904d9382101.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_8a6e95cb224375baca1ed8fc45adb71eb51d6f3a.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_1c73c4b8c0a67d98cc29f7aa86d5b761d1b2fb23.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_f13af1baea93c6895122257b96f31c26e3b4710f.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_9aa15e79892265a86d7568416213d008cbc208fb.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_17f77c48f8b1d6a9d30aae145692ff78731c35bd.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_2c36bc8b5ea1b8d91e55538111bb3c5f833cab52.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_0bd78a9b9261702e98bf13412cce0a8187f296e0.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_ba79ae2dbfb5e034de4a83d3b735d7de98072425.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_89effa4c98578c674528c49a54663f234276933c.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_0603856c72cd6829f0b5456b1c3db8d54f2f891a.1920x1080.jpg?t=1541615700,https://cdn.akamai.steamstatic.com/steam/apps/719250/ss_9852fa701b57ff8e7ad0a849a9dcef6489bca71a.1920x1080.jpg?t=1541615700",
    "Slug": "cove-point-fun-center-vr",
    "Meta Title": "Cove Point Fun Center VR: Nov 20, 2017, Armet Games and F...",
    "Meta Description": "Looking for information on Cove Point Fun Center VR? Check out the release date (Nov 20, 2017), developer insights from Armet Games, and a complete game...",
    "Alt Text Image": "Official header image for Cove Point Fun Center VR game - Steam 719250",
    "Canonical URL": "https://gusku.site/game/cove-point-fun-center-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cove Point Fun Center VR\", \"description\": \"Looking for information on Cove Point Fun Center VR? Check out the release date (Nov 20, 2017), developer insights from Armet Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Armet Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Armet Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/719250/header.jpg?t=1541615700\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}