{
    "AppID": 1410710,
    "Name": "Democracy 4",
    "Release date": "Jan 13, 2022",
    "About the game": "Democracy 4 lets you take the role of President / Prime minister, govern the country (choosing its policies, laws and other actions), and both transform the country as you see fit, while trying to retain enough popularity to get re-elected... Built on a custom-built neural network designed to model the opinions, beliefs, thoughts and biases of thousands of virtual citizens, Democracy 4 is the state-of-the-art in political simulation games. A whole new vector-graphics engine gives the game a more adaptable, cleaner user interface, and the fourth in the series builds on the past while adding a host of new features such as media reports, coalition governments, emergency powers, three-party systems and a more sophisticated simulation that handles inflation, corruption and modern policy ideas such as quantitative easing, helicopter money, universal basic income and policies to cover current political topics such as police body cameras, transgender rights and tons more. Democracy 4 is the ultimate sandbox for testing out your political ideas. We all think our politicians are useless and that we could do a better job ourselves, but is that really true? With one eye on the budget, one-eye on the polls, and somehow finding time to watch out for terrorist attacks at the same time, you will find that staying in power while changing society for the better is a tougher job than you ever imagined. Would it really be a good idea to legalize all drugs? to give the police machineguns? to ban abortion? to invest heavily in green energy? would UBI really work? can you stay elected after cutting pensions in half to pay for your science budget? There is only one game that lets you find out! The intention in designing this game is to have no implied bias whatsoever (tricky, but we try!) so this is NOT a game that is going to lecture you about politics, or tell you that your beliefs are wrong. This is a strategy game, not a political protest :D. If you want to turn your country into ayn rand's fantasy, abolish all public spending and all taxes, you can do that. it might work, it might not! depending on how you handle it. On the other hand if you want to nationalise the railways, the energy companies, the water companies, cap CEO pay, ban second-home ownership and put universal income in place, you can do that too. All the game tries to do is model the *likely* effects, short and long term of any action you take. Because modders have so enthusiastically supported earlier games in the series, we are doing our best to make Democracy 4 as mod-friendly as possible too, and steam workshop support will make choosing and installing mods easy. Ultimately all our data is in text files that you can edit yourself, so if you think our analysis of the link between car tax and car usage is wrong (for example), its trivial to edit it, and share your changes with other players. Ultimately Democracy 4 is not a game about simply winning an election, but about running the country. Losing an election is just the end-game (unless you get assassinated), the real challenge to the game is whether or not you can create a country you are honestly proud of. I hope you enjoy trying :D",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1410710/header.jpg?t=1652704202",
    "Price": 26.99,
    "Developers": "Positech Games",
    "Publishers": "Positech Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_af543b338f85e863b23a2f2b6e6687edf21e0c4c.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_6e8967c4538cb639b27582a36a9bd870b1764e09.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_a88d61d5a664b8df8385ddc44b48ff3b229c3a8d.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_b78a26fad507bc2a538b4b2084d76db7747cbe16.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_2f20bd49743a9c957df9b5abb6b8a51d7aa2dc3f.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_cd0b382592ef42361a3be075215d17b71c5a9841.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_94fdabef4bceb25aef5ca8288bfd59d320f7fde4.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_34ae17bf18e55ad6b8250ab7fe65217806d38f89.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_9db289c814f5cb763f1da4fb3ea3ac8993f2d141.1920x1080.jpg?t=1652704202,https://cdn.akamai.steamstatic.com/steam/apps/1410710/ss_52b8c93fb899f28235c62976dcd7b07dae51d154.1920x1080.jpg?t=1652704202",
    "Slug": "democracy-4",
    "Meta Title": "Democracy 4: Jan 13, 2022, Positech Games and Full Overview",
    "Meta Description": "Looking for information on Democracy 4? Check out the release date (Jan 13, 2022), developer insights from Positech Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Democracy 4 game - Steam 1410710",
    "Canonical URL": "https://gusku.site/game/democracy-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Democracy 4\", \"description\": \"Looking for information on Democracy 4? Check out the release date (Jan 13, 2022), developer insights from Positech Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Positech Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Positech Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1410710/header.jpg?t=1652704202\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}