{
    "AppID": 858830,
    "Name": "Echoes of the Fey: The Last Sacrament",
    "Release date": "Jul 10, 2018",
    "About the game": "Magic meets mystery in Echoes of the Fey, a series of detective stories in a world of high fantasy. Play as Sofya Rykov, a private investigator with a secret of her own: she’s the only Human who can wield magic. Each episode is a narrative-heavy adventure game with branching story-lines and a standalone plot. Sofya’s loyalty grows divided when she is hired for one job and blackmailed into another. Sofya’s childhood love and the Emperor’s daughter, Katerina, seeks her protection from threats near the border. Katerina’s rival Nikolai, a ruthless local politician, needs a dangerous drug stolen from the powerful Krovakyn Church and has the leverage to force Sofya to do it. All the while, Katerina and Nikolai clash over control over the city—and Sofya’s heart. Large segments of The Last Sacrament will play as a point and click adventure game with dialogue in the traditional style of a visual novel. But unlike earlier Woodsy Studio games, The Last Sacrament also features an in-world tabletop RPG called RiftRealms. Inspired by story-focused pen and paper games, Sofya will play RiftRealms games with various supporting characters as dungeon master. Players will both build a character in RiftRealms to fight increasingly more powerful foes, and learn about the key players in Sofya’s life through how they choose to tell a RiftRealms story. While the characters of Echoes of the Fey play RiftRealms with Sofya, they reveal their own prejudices and beliefs through their strategies. They serve as “dungeon masters” who try to create a gaming experience for Sofya (and thus the player) that is both entertaining and challenging. Kind and compassionate characters like Heremon might slip up by making the game too easy, while ruthless characters like Arkady transform the game into a harrowing experience. Despite her hardships, Sofya gets many chances to find love amidst her adventures. She can forge a romantic bond with Nikolai, Heremon, Katerina, or Arkady as she tries to escape the dangers of her predicament.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/858830/header.jpg?t=1582839301",
    "Price": 13.99,
    "Developers": "Woodsy Studio",
    "Publishers": "Woodsy Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/858830/ss_0f01eb5f498d8fe1474a002e0620edfcada38432.1920x1080.jpg?t=1582839301,https://cdn.akamai.steamstatic.com/steam/apps/858830/ss_d83bd7210ca02fef16147be6987f17e0ff1b1cf2.1920x1080.jpg?t=1582839301,https://cdn.akamai.steamstatic.com/steam/apps/858830/ss_d7ab5e146138aad2db02ba3e9c4508d5f206f92c.1920x1080.jpg?t=1582839301,https://cdn.akamai.steamstatic.com/steam/apps/858830/ss_2c23e126ede4435468526eb452717bb110f7aa23.1920x1080.jpg?t=1582839301,https://cdn.akamai.steamstatic.com/steam/apps/858830/ss_2eea5f59aa6105d9677149601612a55db2936858.1920x1080.jpg?t=1582839301",
    "Slug": "echoes-of-the-fey-the-last-sacrament",
    "Meta Title": "Echoes of the Fey: The Last Sacrament: Jul 10, 2018, Wood...",
    "Meta Description": "Looking for information on Echoes of the Fey: The Last Sacrament? Check out the release date (Jul 10, 2018), developer insights from Woodsy Studio, and ...",
    "Alt Text Image": "Official header image for Echoes of the Fey: The Last Sacrament game - Steam 858830",
    "Canonical URL": "https://gusku.site/game/echoes-of-the-fey-the-last-sacrament",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Echoes of the Fey: The Last Sacrament\", \"description\": \"Looking for information on Echoes of the Fey: The Last Sacrament? Check out the release date (Jul 10, 2018), developer insights from Woodsy Studio, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Woodsy Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Woodsy Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/858830/header.jpg?t=1582839301\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}