{
    "AppID": 915670,
    "Name": "Everreach: Project Eden",
    "Release date": "Dec 4, 2019",
    "About the game": "WELCOME TO EDEN Everreach: Project Eden is a fast-paced, story-driven action-RPG set on the visually stunning Planet Eden. In Everreach , you play as Nora Harwood, member of Everreach’s Security Division, on a mission to secure the colonization process of Eden and investigate mysterious incidents. Explore this vast alien world and descend into the planet’s depths to discover the ancient secrets of a long-forgotten civilization. Packed with tactical ground combat, high-speed vehicular warfare and a compelling level and skill system, Everreach immerses you in its intriguing story and diversified gameplay. DIVE INTO A SCI-FI EPIC! Play as a highly trained security guard specialized in extraterrestrial missions Customize your skills and gear through a classic skill tree with over 80 upgrades Engage in tactical battles, deploy forcefields or use the environment against your foes Immerse yourself in 8 hours of story from Michelle Clough, game writer and former narrative QA for the Mass Effect trilogy Explore Eden's beautiful vistas designed by Mai-Anh Tran, an artist who worked on movies such as WarCraft and Star Trek: Beyond Hop onto your hoverbike to engage in high-speed vehicular warfare Designed to be played with mouse and keyboard or gamepad EXPLORE A BEAUTIFUL ALIEN PLANET Explore Eden, the first habitable planet discovered in our galaxy Roam through the unique biosphere in diverse biomes like deserts, forests and caves Stumble upon hidden loot and optional story elements scattered throughout the open environments Discover the fate of other civilizations in Everreach’s deep lore EVERREACH: PUTTING THE STARS IN REACH Welcome to Eden, the first habitable planet we've discovered in our galaxy, with a lush environment, unique biosphere and the first evidence of alien civilization. Thanks to your advance purchase, our plans for an exclusive luxury settlement are well underway. A team of scientists, mechanics, and construction workers is already planetside, building a network of settlements and cities for you and your fellow colonists. Unfortunately, due to unforeseen complications on-site, our official opening date has been slightly delayed. We apologize for any inconvenience. A team of highly trained specialists has been dispatched to Eden to evaluate the situation and restore regular operation as soon as possible. Thank you for choosing Eden Colony and Everreach Industries!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/915670/header.jpg?t=1601481807",
    "Price": 2.49,
    "Developers": "Elder Games",
    "Publishers": "Headup,Beep Japan",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/915670/ss_c3fafa990e5ec514f69f7dd2187cd87e0cf72796.1920x1080.jpg?t=1601481807,https://cdn.akamai.steamstatic.com/steam/apps/915670/ss_68c69d6aec7ea6febf60a89cbbd7bd3b33855fdd.1920x1080.jpg?t=1601481807,https://cdn.akamai.steamstatic.com/steam/apps/915670/ss_5f1e9ed01d7ef9377bf016d34ed0721614aa9d4d.1920x1080.jpg?t=1601481807,https://cdn.akamai.steamstatic.com/steam/apps/915670/ss_46d923b22a933c178f31943ed6a9341bbcfb9e13.1920x1080.jpg?t=1601481807,https://cdn.akamai.steamstatic.com/steam/apps/915670/ss_cfc64f65b60da922b032926ac9affeb81c88591b.1920x1080.jpg?t=1601481807,https://cdn.akamai.steamstatic.com/steam/apps/915670/ss_b65e68c36098f73deb51c6052811f0c4c082f1bf.1920x1080.jpg?t=1601481807",
    "Slug": "everreach-project-eden",
    "Meta Title": "Everreach: Project Eden: Dec 4, 2019, Elder Games and Ful...",
    "Meta Description": "Looking for information on Everreach: Project Eden? Check out the release date (Dec 4, 2019), developer insights from Elder Games, and a complete game s...",
    "Alt Text Image": "Official header image for Everreach: Project Eden game - Steam 915670",
    "Canonical URL": "https://gusku.site/game/everreach-project-eden",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Everreach: Project Eden\", \"description\": \"Looking for information on Everreach: Project Eden? Check out the release date (Dec 4, 2019), developer insights from Elder Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Elder Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup,Beep Japan\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/915670/header.jpg?t=1601481807\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}