{
    "AppID": 757500,
    "Name": "Fadeholm",
    "Release date": "May 15, 2018",
    "About the game": "Endless exploration and adventure awaits those fearless enough to enter. Survival is only the beginning! Fadeholm is a procedural virtual reality (VR) survival dungeon crawler designed in the same vein as old school Nethack and Rogue. As one of the remaining ‘Fade’, the player is challenged to explore the depths of the ancient catacombs in search of an ancient relic. The Fadeholm is as rich as it is dangerous, with room after room filled with riches and items that will make exploration just a little bit easier. The player must manage hunger,health, and endurance while they search every corner of the dungeon, because while the undead hit hard, a Vorpal Warblade of Fire hits harder. The first chapter, Upper Fadeholm includes: 3 levels of procedural(reproducible random) generated dungeon, expandable to 8 levels through game settings. Multiple unique monsters, each randomized with their own equipment, tactics, and behaviors. Randomized loot throughout the dungeon. Equipment held and worn by monsters is usable upon their defeat. Items become more powerful and enchanted the deeper the player travels Detailed item inspection system aids in determining the power and abilities of the loot discovered. Intuitive movement system: Touchpad movement (4-axis + controller direction control) Armswing locomotion (4 axis + HMD direction control) Teleport for jumping obstacles and quickly manuvering Player can mix and match modes to both controllers. Interactive inventory system: eight active storage locations over the shoulder and hip slots “hot swappable’ allowing quick exchange of items belt slot provides access to various sized satchels for additional storage. independent shield slots on each arm to allow use of items while still employing a shield in combat. wearable headgear Save Game support: Player can save their adventure at anytime and pick up where they left off later. Supports up to three different ‘Engrams’ (save games with history) to enable more than one person adventuring on a single Steam account. Seed (Dimensional Thread) based generation of content: Controls generation of dungeon, monsters, loot, etc. Each Thread generates a unique game play experience. Share a Thread with a friend and compete on the leaderboards, or just see who can explore the furthest! Leader boards, both local and Steam. Rank yourself against your friends and the community. Each board based upon the specific dungeon (dimensional thread) selected.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/757500/header.jpg?t=1528032571",
    "Price": 19.99,
    "Developers": "Enoch,Horbin",
    "Publishers": "Infinite Opal",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_c9d25f0dd678b52c20629f206d1811ebc557bbf9.1920x1080.jpg?t=1528032571,https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_04bb6acb2201e2731e0dbbde567fdbfc3c4514e3.1920x1080.jpg?t=1528032571,https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_3385d9a78634d83a11aebf31f86f4d0726712b52.1920x1080.jpg?t=1528032571,https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_c235a65657ad1823d76f508d9c1cfef9d03ac136.1920x1080.jpg?t=1528032571,https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_1768b6816c2d077db6fddc9ed956ca357f238d5b.1920x1080.jpg?t=1528032571,https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_b1a851ff6cbf39443028491dfa26659abfed4fd6.1920x1080.jpg?t=1528032571,https://cdn.akamai.steamstatic.com/steam/apps/757500/ss_688692a5557976bea41535ef254d11edd9599af7.1920x1080.jpg?t=1528032571",
    "Slug": "fadeholm",
    "Meta Title": "Fadeholm: May 15, 2018, Enoch,Horbin and Full Overview",
    "Meta Description": "Looking for information on Fadeholm? Check out the release date (May 15, 2018), developer insights from Enoch,Horbin, and a complete game summary.",
    "Alt Text Image": "Official header image for Fadeholm game - Steam 757500",
    "Canonical URL": "https://gusku.site/game/fadeholm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fadeholm\", \"description\": \"Looking for information on Fadeholm? Check out the release date (May 15, 2018), developer insights from Enoch,Horbin, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enoch,Horbin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Infinite Opal\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/757500/header.jpg?t=1528032571\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}