{
    "AppID": 1105460,
    "Name": "Flight of the Amazon Queen: 25th Anniversary Edition",
    "Release date": "May 17, 2021",
    "About the game": "The year is 1949 and you assume the role of Joe King, a pilot for hire who is given the job of flying Faye Russell (a famous movie star) into the Amazon jungle for a photo shoot. Of course, things never go according to plans. After an unfortunate turn of events they find themselves stranded in the heart of the Amazon jungle, where Joe will embark on a quest to rescue a kidnapped princess and in the process, encounter a dangerous temple, fearsome Amazonian warriors, and a powerful mad scientist intent on taking over the world! It's up to you to deal with the imminent threat of world domination … but be careful, or this may be the last Flight of the Amazon Queen! The game features: A classic graphic adventure based on the much-loved LucasArts adventure games and the '40s adventure films Explore over 100 exotic locations and interact with over 40 wildly individual characters including, but not limited to, a tribe of Amazon women and 6-foot-tall pygmies Witty dialogues packed with sassy humor will make you laugh out loud FULL voice-acting including the talents of the famous British actress Penelope Keith, Actor William Hootkins who played Red Six(Jek Porkins) in Star Wars, Brad Lavelle, Tom Hill, Enn Reitel, Jon Coleman, Debbie Arnold and more! '25th Anniversary Edition' features: - Totally new, much praised, game play controls that were built from the ground up Hotspot based with the option to highlight all hotspots in each game screen Highlight action selected All-new slick icons and animations - Completely new game menus and save/load system + Saves cloud syncing - Three Music options: MT-32, General MIDI or AdLib - High-end graphics upscaling (xBRZ filter) for high-resolution displays - Optional retro settings: play with original graphics and even the original controls (mouse pointer) - Multiple languages (ALL included without additional payment): English voice acting, with the option for adding subtitles in English, Spanish, Italian, Russian and Hebrew German voice acting with or without German subtitles French voice acting with or without French subtitles - Extras included: Soundtrack (also as original Midi version) + Interview Mini-Game featurette with Audio Commentary by Game Creator + Playing Guide + 'The Making of' booklet + Original Manual + Art Book + Legacy Editions as FREE downloadable content (DLCs) for Windows, macOS and Linux (Multiple languages). LucasArts, Monkey Island, Indiana Jones and Star Wars are registered trademarks of Lucasfilm Ltd.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1105460/header.jpg?t=1654407947",
    "Price": 3.99,
    "Developers": "MojoTouch,Red Sprite Studios",
    "Publishers": "MojoTouch",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1105460/ss_8054d16cb7da2066ccf65fb182d6e4076bd6d6cc.1920x1080.jpg?t=1654407947,https://cdn.akamai.steamstatic.com/steam/apps/1105460/ss_a085ecc3e5d70c5a4f306a1f26d66c453c70bf4d.1920x1080.jpg?t=1654407947,https://cdn.akamai.steamstatic.com/steam/apps/1105460/ss_d1b25d367441ea5c34199ff09a2ceaebe5b17cc8.1920x1080.jpg?t=1654407947,https://cdn.akamai.steamstatic.com/steam/apps/1105460/ss_16271f32b8006724503cdcffe62755f7c84a0f2d.1920x1080.jpg?t=1654407947,https://cdn.akamai.steamstatic.com/steam/apps/1105460/ss_1f29d72047cdf8ed4111278676737db17c6c47af.1920x1080.jpg?t=1654407947",
    "Slug": "flight-of-the-amazon-queen-25th-anniversary-edition",
    "Meta Title": "Flight of the Amazon Queen: 25th Anniversary Edition: May...",
    "Meta Description": "Looking for information on Flight of the Amazon Queen: 25th Anniversary Edition? Check out the release date (May 17, 2021), developer insights from Mojo...",
    "Alt Text Image": "Official header image for Flight of the Amazon Queen: 25th Anniversary Edition game - Steam 1105460",
    "Canonical URL": "https://gusku.site/game/flight-of-the-amazon-queen-25th-anniversary-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Flight of the Amazon Queen: 25th Anniversary Edition\", \"description\": \"Looking for information on Flight of the Amazon Queen: 25th Anniversary Edition? Check out the release date (May 17, 2021), developer insights from Mojo...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MojoTouch,Red Sprite Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MojoTouch\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1105460/header.jpg?t=1654407947\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}