{
    "AppID": 671330,
    "Name": "Lit the Torch",
    "Release date": "Aug 2, 2017",
    "About the game": "Game Overview Lit the Torch is a unique action puzzle game. In order to uncover true self and solve the mystery, the girl travels through two different worlds. Overcoming different traps and avoiding monsters and finally solving all the mysteries. Game Story The time dimension is broken, and I am travelling around my broken pieces of memories. Why is everything so familiar? There is always a shadow of someone with a voice in my ear whispering: Lit the Torch! Following the voice, I moved forward in between two worlds, I start to uncover myself. Core Mechanism 1. The core mechanism of the game is the interchangeable dual world. Players can move through the square world, control the game, the characters travel between two worlds, through the construction of platform terrain, players will avoid all traps and monsters to clear the stage and solve the mystery. 2. In the latter part of the game, players in the square world can have free movement, zoom in and out, follow iterative changes of the characters. 3. In addition to dual world interaction, there are two customs clearance, windy mode, touch the torch to slowdown and more game mechanism content. Unique Game Playing The game uses a crossover of two worlds, each individual level has unique designs, which interchanges frequently, evokes a sense of mystery for players. Fantastic Style of Art Each chapter of the game corresponds to a different art scene, through the bold composition of different colors, each scene has a lot of animation for players to enjoy. Wonderful Background Story The game is a challenge of intelligence operations, with a profound narrative, it evokes the sense of thought in players. Wonderful Music Effects The music in Lit the Torch were created specially by American independent music producers, based entirely on the overall style of the game and the background story. Each chapter corresponds to a different background music, but also has a rich game scene sound effects, such as monster growl, wind, all kinds of music effects from traps etc.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/671330/header.jpg?t=1649916658",
    "Price": 0.99,
    "Developers": "Corn Entertainment",
    "Publishers": "IceSimba",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/671330/ss_8d1ad2f6bc161a6bec03fc88d1bc85e6b2a51a97.1920x1080.jpg?t=1649916658,https://cdn.akamai.steamstatic.com/steam/apps/671330/ss_222e0a8ca7dcebec26804c4a48fa5313cc14bd11.1920x1080.jpg?t=1649916658,https://cdn.akamai.steamstatic.com/steam/apps/671330/ss_438253c9e7258049d87eb46014a9a481a0d884c1.1920x1080.jpg?t=1649916658,https://cdn.akamai.steamstatic.com/steam/apps/671330/ss_21f7ba88d94a6f0ce0ffedde1237c4335a3d62b0.1920x1080.jpg?t=1649916658,https://cdn.akamai.steamstatic.com/steam/apps/671330/ss_c9cf7a7d34a1fc19b8d289f36616816273ef9890.1920x1080.jpg?t=1649916658",
    "Slug": "lit-the-torch",
    "Meta Title": "Lit the Torch: Aug 2, 2017, Corn Entertainment and Full O...",
    "Meta Description": "Looking for information on Lit the Torch? Check out the release date (Aug 2, 2017), developer insights from Corn Entertainment, and a complete game summ...",
    "Alt Text Image": "Official header image for Lit the Torch game - Steam 671330",
    "Canonical URL": "https://gusku.site/game/lit-the-torch",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lit the Torch\", \"description\": \"Looking for information on Lit the Torch? Check out the release date (Aug 2, 2017), developer insights from Corn Entertainment, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Corn Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IceSimba\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/671330/header.jpg?t=1649916658\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}