{
    "AppID": 601250,
    "Name": "Micronomicon: Heroes",
    "Release date": "Apr 5, 2019",
    "About the game": "Micronomicon is a classic tactical role-playing fantasy game with turn-based style of combat! In the game, the player travels through a huge fantasy world. You’ll complete some quests, fight with evil spirits, collect ancient artifacts and toss a challenge to the strongest bosses.  Features: Turn-based battles on a hexagonal map. Real-time map travel. Four character classes. Over 20 spells – attacks, fortifications and control (can be improved). Powerful bosses with their own unique magic abilities. Lots of quests with awards. Equipment improvement.  World map: The player travels through the game world in real time. In this mode, the player can freely move, explore the world and interact with the NPC to obtain information and complete quests.  Tactical battles: The battles, which occur on a small map with a hexagonal grid, feature a turn-based strategy. At the start, the player can use the spell of his team, attack the enemy or order his character to move to another grid. On some maps, the team will have to first break through fortifications – they can’t attack enemies as long as they are intact. Bosses have at their disposal a formidable arsenal of spells – that is why it is very important to think out the moves. Bosses can be treated, they can call for backup, set traps, and do much more.  Four character classes: Archer Specializes in long-range combat and critical strikes. His spells help him to keep the enemy at a distance, entangling the enemy’s feet, as well as lulling the legs for a while.  Witch The witch possesses magical abilities and can heal wounds in a combat. Some of her spells cause damage to all the enemies on the battlefield. When necessary, she can teleport herself to avoid close combat.  Paladin Warrior of light. His magic can both treat all his allies and charm their weapons to deliver extra damage. During critical moments, he can call upon the power of light, which would make enemies to treat his wounds instead of causing damage.  Warrior An experienced fighter clad in heavy armor. His magic allows him to charm the armor of his allies. He can quickly reduce the distance to the enemy and pull the life out of enemies using his blood magic ability.  Magic: Magic is divided into four types – control, damage, and treatment and charm. Each team member can use his spells in combat. Spells don’t consume energy, but once a spell has been used, you can’t reuse it in 6 moves. When a team attains new levels, characters receive magic points, which can be used to improve spells. New spells can be received for completing quests or you can grab them from enemies.  Equipment: During the game, you can find lots of different items to fortify your team. Items are separated by quality – from simple gray ones to epic orange items. They can be improved by absorbing other unnecessary items. Moreover, the item being improved acquires more features. When the maximum improvement has been reached, the item can evolve by merging with magical signs. Here, the item class increases by one star, while losing some improvements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/601250/header.jpg?t=1556624215",
    "Price": 1.99,
    "Developers": "SVP",
    "Publishers": "SVP",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_30f6110b63a02494ffcf52e62c46c8a996b16645.1920x1080.jpg?t=1556624215,https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_1692b61dc971920ee37a05b6a8a55dc04a327a1c.1920x1080.jpg?t=1556624215,https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_d2945c11301bd40eac41ca818864eb01ac0448cb.1920x1080.jpg?t=1556624215,https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_79989554d0adb1860a9b0552a806db70227dce12.1920x1080.jpg?t=1556624215,https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_802495d023611f7c76a1f43c6a92dffe1d00d220.1920x1080.jpg?t=1556624215,https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_ca1113c3f8a445c4bf5f46e77890d3b1a95005f6.1920x1080.jpg?t=1556624215,https://cdn.akamai.steamstatic.com/steam/apps/601250/ss_15bebd42b707efb4bcdc65ad6a9977218f5e7333.1920x1080.jpg?t=1556624215",
    "Slug": "micronomicon-heroes",
    "Meta Title": "Micronomicon: Heroes: Apr 5, 2019, SVP and Full Overview",
    "Meta Description": "Looking for information on Micronomicon: Heroes? Check out the release date (Apr 5, 2019), developer insights from SVP, and a complete game summary.",
    "Alt Text Image": "Official header image for Micronomicon: Heroes game - Steam 601250",
    "Canonical URL": "https://gusku.site/game/micronomicon-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Micronomicon: Heroes\", \"description\": \"Looking for information on Micronomicon: Heroes? Check out the release date (Apr 5, 2019), developer insights from SVP, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"SVP\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SVP\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/601250/header.jpg?t=1556624215\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}