{
    "AppID": 730410,
    "Name": "Music Band Manager",
    "Release date": "Dec 6, 2017",
    "About the game": "Always dreamed of creating your own musical group and making your way to the stars? Now your desires can become a reality! In our game you can go all the way from rehearsals in the garages to appearances on the stages where world-famous performers have visited. You will have the opportunity to record songs on different topics, give the name of each of them, release albums. Manage the activities of your newly-born musicians completely and completely! You have four most popular genres in the music world: rock, electronic music, pop, r'n'b. Your musicians can play in all directions, so do not have to make a hard choice at the beginning of the game - improve in all these genres! There are three levels of difficulty to choose from, but if the game seems to be hard for you, you can change your difficulty level at any time. With the promotion of the group you will be assisted by several managers, each of them has a huge number of ideas on how to do it. You will have to face a lot of difficult moral choices, which is more important for you: money, popularity through black PR, or the love of people? Or do you just want to carry your creativity into the masses and make people happy? Managers will give you a huge amount of bonuses if you make the right choice and listen to your heart and head. You will have to act smartly and judiciously, because some elections can damage your reputation on the contrary. You will be available hundreds of different musical instruments, as well as many cool things that you can give to your musicians, and each of these items will give a certain bonus! Win many musical awards on the way to the top! Compete for a place in the top 100 with other players! Your musicians will often comment on what is happening to them, so you definitely will not be bored! Rather, start to conquer the whole world with the help of your music! - creation of own music in 4 genres; - concerts around the world; - Several secret super goals; - a lot of interesting events and difficult elections; - a wide choice of instruments and things for musicians; - musical awards and achievements; - the chance to break into the first lines of the music charts; - the opportunity to become a recognizable worldwide superstar!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/730410/header.jpg?t=1517016588",
    "Price": 7.99,
    "Developers": "Hamsters Gaming",
    "Publishers": "Hamsters Gaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/730410/ss_6d4264141d692326b7c026a130f8b8fea9e30de1.1920x1080.jpg?t=1517016588,https://cdn.akamai.steamstatic.com/steam/apps/730410/ss_9e73a9debcf649086cd31b83a199ff4c1fecba80.1920x1080.jpg?t=1517016588,https://cdn.akamai.steamstatic.com/steam/apps/730410/ss_e55df8ce589e4acbd1396bc655af7c6563771e39.1920x1080.jpg?t=1517016588,https://cdn.akamai.steamstatic.com/steam/apps/730410/ss_2284686ea2cfbadffd1e5c941e7975f3fa2a48b8.1920x1080.jpg?t=1517016588,https://cdn.akamai.steamstatic.com/steam/apps/730410/ss_02e5f9960b362531a5111b9abea47a730b32c315.1920x1080.jpg?t=1517016588,https://cdn.akamai.steamstatic.com/steam/apps/730410/ss_9533655df057141e77d368941ca71664f014623d.1920x1080.jpg?t=1517016588",
    "Slug": "music-band-manager",
    "Meta Title": "Music Band Manager: Dec 6, 2017, Hamsters Gaming and Full...",
    "Meta Description": "Looking for information on Music Band Manager? Check out the release date (Dec 6, 2017), developer insights from Hamsters Gaming, and a complete game su...",
    "Alt Text Image": "Official header image for Music Band Manager game - Steam 730410",
    "Canonical URL": "https://gusku.site/game/music-band-manager",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Music Band Manager\", \"description\": \"Looking for information on Music Band Manager? Check out the release date (Dec 6, 2017), developer insights from Hamsters Gaming, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hamsters Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hamsters Gaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/730410/header.jpg?t=1517016588\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}