{
    "AppID": 887570,
    "Name": "NEBULOUS: Fleet Command",
    "Release date": "Feb 11, 2022",
    "About the game": "Take command of a fleet of space warships tailored to your exact play-style. Favor a small task group of robust, flexible multi-role combatants, a large group of specialized ships, or something in between. Do battle in a heavily simulation-based tactical game featuring everything from kinetics and beam weapons to realistic radar and electronic warfare. Nebulous seamlessly blends the thoughtfulness of pre-mission planning, tension of battle decision-making, pressure of real-time action, and pain of inevitable sacrifice into an intense tactical space game that will keep you reflecting on every decision (and mistake) for hours after each battle. Skip the economy management: you're here to dominate in battle. Drop into the battlespace with your full fleet and carefully plan your moves. Deep, methodical combat based on thrusts, withdrawals, and counter-thrusts keeps the tension ratcheted up without numbing you with a screen constantly full of explosions. With no reinforcements coming, every hit hurts and every loss counts. Victory favors thoughtful planning and precise execution. It's in your hands, Commodore. Control In-Depth Band-boxing your units and right clicking the enemy doesn't fly here. With small, intimate battles, we offer you unparalleled control of every unit right down to their individual mounts. Keep your entire fleet together, dynamically split off task units, or give each ship its own assignment. Large maps with lots of cover and radar occlusion make methodical positioning and sight lines critical. Massing firepower in one place is not always the best solution, as the enemy could come from any direction in the fully 3-dimensional battlespace. Covering your retreat is always in order. Group your weapons and task them to different targets or focus fire with everything you have. Selecting the appropriate weapon to engage a target is as impactful as deciding which targets to engage at all. Weapons have compounding benefits and drawbacks, all of which can be compensated for and planned against. Radar And E-War Simulation Intelligence is key to victory and your situational awareness is never a given. Use asteroids and gas clouds to obscure your ships from enemy sensor systems while illuminators and fire control radars mark targets and the enemy attempts to blind you with jammers. Occlusion, passive signal detection, and balancing radar signature size makes fighting for intel as vicious as firing missiles. Plan To Win All fleets are unique in Nebulous, and you won't know what the enemy is bringing to the field until your first radar contact. A point value system keeps fleet strength in balance, but you may spend half the battle (or more) trying to determine your adversary's capabilities. The built-in fleet editor allows players to build their fleet from a set of hulls, each with their own niche, and configure these hulls to vary their capabilities. Each new ship is a blank canvas waiting for you to express your tactical identity. Detailed Damage Model There are no healthbars; every ship is held together by its armor and its components. All armor damage is positional, meaning hits to undamaged areas will face the full weight of the armor plating. The armor protects the soft, critical interior components and the ship's crew who will fight frantically to keep the ship operational. Damage control teams will move from compartment to compartment, repairing damage where they can according to a module's criticality and the player's priorities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/887570/header.jpg?t=1657782250",
    "Price": 19.99,
    "Developers": "Eridanus Industries",
    "Publishers": "Hooded Horse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_3b655fdd69ec4840f97a38014f53dcde72dd0855.1920x1080.jpg?t=1657782250,https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_6612f58b3c304b6a6acc13a4dedd21974963e3fb.1920x1080.jpg?t=1657782250,https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_a9712becb2231b81dc51e1eaf1cc6a842c4b39d0.1920x1080.jpg?t=1657782250,https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_140d561de3c84ecefd4ec0620e84780831db9004.1920x1080.jpg?t=1657782250,https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_72e69742d92686dddbfe21cf410a3cec3f9c0b23.1920x1080.jpg?t=1657782250,https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_ae2066137f558db637d4b27f37a300eed521bdc7.1920x1080.jpg?t=1657782250,https://cdn.akamai.steamstatic.com/steam/apps/887570/ss_e9058d19c5d60b101509fc177c4cc68223255fd1.1920x1080.jpg?t=1657782250",
    "Slug": "nebulous-fleet-command",
    "Meta Title": "NEBULOUS: Fleet Command: Feb 11, 2022, Eridanus Industrie...",
    "Meta Description": "Looking for information on NEBULOUS: Fleet Command? Check out the release date (Feb 11, 2022), developer insights from Eridanus Industries, and a comple...",
    "Alt Text Image": "Official header image for NEBULOUS: Fleet Command game - Steam 887570",
    "Canonical URL": "https://gusku.site/game/nebulous-fleet-command",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NEBULOUS: Fleet Command\", \"description\": \"Looking for information on NEBULOUS: Fleet Command? Check out the release date (Feb 11, 2022), developer insights from Eridanus Industries, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eridanus Industries\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hooded Horse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/887570/header.jpg?t=1657782250\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}