{
    "AppID": 1627280,
    "Name": "Operation: VICUS",
    "Release date": "Jan 17, 2022",
    "About the game": "There is only you, the chosen one who rules over the village. You have to find out what the strange notes are about, where do they come from and what do they want to tell you? Besides, with your actions you will strengthen or weaken your relationship with your inhabitants. Make tough decisions that will haunt you longer than you might think. Expand your village to accommodate more inhabitants and explore new things in the laboratory, be it weapons, buildings and much more. However, you'll have to stay alert, because you'll be haunted by insidious beasts that would love to destroy your village. So you must train your troops and lead them into battle! Build your village With the help of your mines, the ores extracted from there will be processed by your blacksmith and in combination with the wood of the forester, great things can be built, such as new habitable houses, attractions for the inhabitants or yet barracks and defensive guns. With the help of your laboratory you can improve your buildings and make them more robust or you can have new, better buildings researched, which you can then use in your village! Satisfaction If you want to work your way forward, it is of great importance to take care of your villagers. You need to monitor their happiness, either the overall happiness of your village or the happiness of the individual citizens. If the villagers are in a bad mood, you need to get to the bottom of it and, if necessary, fix the problems that cause it using the Satisfaction menu or the information provided by the individual citizens. But if you neglect their feelings, you have to expect deterioration in your production and further problems! Day management The daily schedule of the villagers is determined by you alone. You can determine the schedule of each citizen: You can make them work longer hours to boost your production, give them more free time or alternatively let them decide what they want to do. However, you must never forget that your actions affect the mood of each citizen, and their moods add up to determine the satisfaction level of your village. So make sure that the inhabitants have nothing to complain about! Low Poly Artstyle Dive into the world of the unique Low Poly Artstyle and experience relaxed atmospheres in the morning or mysterious mood in the evening. The interplay between the cartoon-like animations and the beautiful low poly look creates beautiful moments. The music, reminiscent of No Mans Sky in places, creates a great ambience with its style that always fits the situation. Combat and defense* Upgrade your town with barracks and guns to defend against the invaders! Upgrade your barracks to get better and stronger troops. Decide which strategy you want to follow, fight with weaker but more troops or less but stronger? And better to finish everything in close combat or to finish the enemy from a distance? Or both? You decide and lead your warriors into battle and decide still in battle which targets your troops should attack and how many of your soldiers should pursue this target! Story* Find out what the strange notes are all about! Make tough decisions and try to understand what this village is all about! *These features are currently planned but not yet implemented",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1627280/header.jpg?t=1642438874",
    "Price": 7.99,
    "Developers": "Ilja Soutchilin,Tom Berger",
    "Publishers": "Ilja Soutchilin,Tom Berger",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1627280/ss_96840333c9e637c4c0702ae9e758513b777bad07.1920x1080.jpg?t=1642438874,https://cdn.akamai.steamstatic.com/steam/apps/1627280/ss_33016ab182c53f763d7ccbd26c062b513f622986.1920x1080.jpg?t=1642438874,https://cdn.akamai.steamstatic.com/steam/apps/1627280/ss_e37206fee1f29632354eeb876b9c16f39645b8bc.1920x1080.jpg?t=1642438874,https://cdn.akamai.steamstatic.com/steam/apps/1627280/ss_f690cbe397e14e27f07c418d656de34b53ff254c.1920x1080.jpg?t=1642438874,https://cdn.akamai.steamstatic.com/steam/apps/1627280/ss_c94069880cabb46c2120b22bf6ef1ec4536ccce1.1920x1080.jpg?t=1642438874",
    "Slug": "operation-vicus",
    "Meta Title": "Operation: VICUS: Jan 17, 2022, Ilja Soutchilin,Tom Berge...",
    "Meta Description": "Looking for information on Operation: VICUS? Check out the release date (Jan 17, 2022), developer insights from Ilja Soutchilin,Tom Berger, and a comple...",
    "Alt Text Image": "Official header image for Operation: VICUS game - Steam 1627280",
    "Canonical URL": "https://gusku.site/game/operation-vicus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Operation: VICUS\", \"description\": \"Looking for information on Operation: VICUS? Check out the release date (Jan 17, 2022), developer insights from Ilja Soutchilin,Tom Berger, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ilja Soutchilin,Tom Berger\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ilja Soutchilin,Tom Berger\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1627280/header.jpg?t=1642438874\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}