{
    "AppID": 369100,
    "Name": "Predator Simulator",
    "Release date": "May 15, 2015",
    "About the game": "DISCLAIMER Have you had enough of pointless &amp; boring 'simulator' ripoffs? It's about time someone made a simulator that's actually a game you can enjoy. Prepare to restore you faith in the simulator games, GameIndica Entertainment brings you the next best simulator since the simulator genre was born. INTRO Predator Simulator is an action arcade RPG packed with endless gameplay and new missions for every game session. On a quest to become a true Lionborn , you get to save the planet by wiping out humanity from the face of the earth. Yeah.... didn't you always want to do that anyway? Now is your chance! GAMEPLAY Explore the wild countryside while enjoying fresh farm raised pigs, rooster &amp; chicken wings. Reach the human populated city to start your manhunt and climb up the defcon levels. Eat anything that moves because that what a predator does to survive. Tasty and weak human prey will get you big rewards, but be careful, too much chaos will attract the hunters! You will be classified as a Predaterrorist and face heavy resistance. Be prepared for the worst. Unlock the hidden uncharted territory outside the game world by becoming a true Lionborn , where you can find secret journal entries from the game developer. We hope you will enjoy knowing more about the back story of this game and how it was made. KEY FEATURES + Play as an apex predator AKA a lion. + Funniest part of the game is the Advanced AI system with real-time Predator-Prey simulation. Unarmed preys will try to run for their lives, armed hunters will try to hunt you down. Although getting them scared will make it easy to hunt them. Various scaring tactics can be used (ex. Attack from hidden corners or behind, jump scare them, roar at them, eat someone in front of them etc) + Kill various species depending on your own humanitarian or animal loving bias. + There are hipsters, rednecks, donut loving cops, cosplayers and even console peasants in the city. + Live tweets from your poor, whining victims + After hunting your prey, eat them and listen to the sweet bone crushing musical notes. It never gets old. + Defcon levels work like wanted levels in any open world game. The higher you get, the more bonuses you get but the game becomes more difficult. + Tons of characters to unlock as you play. Bigger rewards for hunting down higher level victims. + Powerful roar to scare everyone around you. Once you become a true Lion born by acquiring the glorious Fus-Roar-Duh skill, roars become lethal. + Xbox Controller support.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/369100/header.jpg?t=1541730214",
    "Price": 7.99,
    "Developers": "Imran Arafat",
    "Publishers": "Reality Gameware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/369100/ss_6ae664a7c7cd34138a0b81f48d348929f8a3e529.1920x1080.jpg?t=1541730214,https://cdn.akamai.steamstatic.com/steam/apps/369100/ss_a930252b4251260fa274c4227e923cc85b787f57.1920x1080.jpg?t=1541730214,https://cdn.akamai.steamstatic.com/steam/apps/369100/ss_0ee613b49dee3c163bfa5bc4e141334a91dadfad.1920x1080.jpg?t=1541730214,https://cdn.akamai.steamstatic.com/steam/apps/369100/ss_c5d2bda801eec4ec6de87436570a1f0561e02b0b.1920x1080.jpg?t=1541730214,https://cdn.akamai.steamstatic.com/steam/apps/369100/ss_311710123f319cc2dc84640ee59a54a6cbc4e8a8.1920x1080.jpg?t=1541730214",
    "Slug": "predator-simulator",
    "Meta Title": "Predator Simulator: May 15, 2015, Imran Arafat and Full O...",
    "Meta Description": "Looking for information on Predator Simulator? Check out the release date (May 15, 2015), developer insights from Imran Arafat, and a complete game summ...",
    "Alt Text Image": "Official header image for Predator Simulator game - Steam 369100",
    "Canonical URL": "https://gusku.site/game/predator-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Predator Simulator\", \"description\": \"Looking for information on Predator Simulator? Check out the release date (May 15, 2015), developer insights from Imran Arafat, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 15, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Imran Arafat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reality Gameware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/369100/header.jpg?t=1541730214\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}