{
    "AppID": 1822460,
    "Name": "Pwnk: Stream Battle Royale",
    "Release date": "Apr 22, 2022",
    "About the game": "Engage live audiences and grow your stream with a variety of funny community games Pwnk Royale &amp; Olympwnks are the main game mode: Create your own live game show using Pwnk's mini-game battle royale! Your audiences will be able to play with you in real-time, create funny live content together, and even help you battle against other streamers! Pwnk supports all the biggest streaming platforms: Twitch, Youtube, Facebook Gaming Also 30+ variety games with frequent updates Pwnk NFTGarden: The world's first Play2EarnNothing game! Streamers and viewers can now get filthy rich with Non-Fungible Tulips! An NFTParody game. PWNK Ball: It's like Pong but viewers can participate by pitching the ball. PWNK Rescue: Which streamer can save the most birds? PWNK Draw: Can you guess what the streamers are drawing together? Pwnk Defense: Pwnk Defense is a tug of war strategy game between 2 teams. Pwnk Snack: Can you guess which colored snack has the most area in the box? Pwnk Blitz: Can you quickly pick the correct matching item? Pwnk Doll: Can your eyes keep track of Russian Doll? Pwnk Away: Can you find who is away? Pwnk Raid: Can you raid the most coins? Pwnk Places: Can you guess where I am? Pwnk Relations: Can you guess their relationship? Pwnk Defense: Defend your team‘s base and destroy your enemies! Pwnk Life: Live your best life possible! A text-based life sim Pwnk Crossplay: Can you guess crossdressing or not? Pwnk GameWorld: Can you guess what game I'm playing based on the game map? Pwnk &amp; Count: Can you count how many characters are remaining? Pwnk Food: Can you guess the country or territory by the food? Pwnk Products: Can you guess are these products real or not? Pwnk Man: Which viewer will become the biggest Pwnk Man? Pwnk Mandela: Can you guess the correct Logo and characters? Pwnk Loot: Can you guess the correct video game by game items or loot! Pwnk 90s: Does this belong to the 90s? Pwnk Animals: Does this animal exist? Pwnk Actor: Can you guess the movie by actor! Pwnk Who: Guess whose is it? Guess the character by the item shown in the image. Pwnk Nation: Guess the nation by the item shown in the image. Around 8 new games will be added to the collection each month. All games are Free and easy to play. Are you a streamer? You can play Pwnk with your viewers and with another streamer's chat. Pwnk is very community-oriented and brings people together in existing streamer's communities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1822460/header.jpg?t=1658303391",
    "Price": 0.0,
    "Developers": "STARSCAPE PTE. LTD.",
    "Publishers": "STARSCAPE PTE. LTD.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_40f3493accb6f1e7a432657eb565404b53f73499.1920x1080.jpg?t=1658303391,https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_2b9150687a499e3543a8ca897d157c8d4556e5e9.1920x1080.jpg?t=1658303391,https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_772c80f661c3a9e52ec74c88987af8829b14b233.1920x1080.jpg?t=1658303391,https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_cbe499a9a1ddcf7a83f9644eac77bafcf2bd791e.1920x1080.jpg?t=1658303391,https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_c41e46288e2b55ce234be1939067a6cdd4e9a319.1920x1080.jpg?t=1658303391,https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_c4d55005db3f217d75101eb460268ca4a3484d6a.1920x1080.jpg?t=1658303391,https://cdn.akamai.steamstatic.com/steam/apps/1822460/ss_670699a7a6357998ff37212a4c0e0aaa121d358e.1920x1080.jpg?t=1658303391",
    "Slug": "pwnk-stream-battle-royale",
    "Meta Title": "Pwnk: Stream Battle Royale: Apr 22, 2022, STARSCAPE PTE. ...",
    "Meta Description": "Looking for information on Pwnk: Stream Battle Royale? Check out the release date (Apr 22, 2022), developer insights from STARSCAPE PTE. LTD., and a com...",
    "Alt Text Image": "Official header image for Pwnk: Stream Battle Royale game - Steam 1822460",
    "Canonical URL": "https://gusku.site/game/pwnk-stream-battle-royale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pwnk: Stream Battle Royale\", \"description\": \"Looking for information on Pwnk: Stream Battle Royale? Check out the release date (Apr 22, 2022), developer insights from STARSCAPE PTE. LTD., and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"STARSCAPE PTE. LTD.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"STARSCAPE PTE. LTD.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1822460/header.jpg?t=1658303391\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}