{
    "AppID": 773520,
    "Name": "Refight:Burning Engine",
    "Release date": "Oct 15, 2018",
    "About the game": "'Refight: Burning Engine' is a military survival TPS game developed by Brahma Games. The game is based on armored vehicles with a Battle Royal gameplay, and creates a sandbox world which is comprised of different terrains with UE4 engine, to offer players a realistic and exciting vehicle battlefield. Players can grow stronger by searching resources in their favorite vehicles, and fight with enemies for survival. The last one standing will have the glory of becoming the Warlord. Gigantic Sandbox, free competitive gameplay A huge 6000 x 6000 sandbox map. The battlefield contains mountains, rivers, towns and other such complex terrain provides the player with a great amount of freedom. Survival and glory [Countless dangers] There are dangers lurking around every corner in the game, enemies will cause countless obstacles to your survival. 30 players fight against each other in their vehicles while they flee the danger zone. Fight for limited resources, strategic competition [Various Items] The battlefield offers a wide variety of items, including cannons, external armor that enhance defense, components that boost firepower, engines , transmission components and various types of repair items and ammunition, increasing the playability of the battle. [In-depth Strategy] Players must plan strategies according to their vehicles, the landing positions and actions of enemies, the location of supplies, airdrops and many other variables in order to survive. Four legendary vehicles that each have their own unique characteristics [T55] A well-balanced, all-purpose vehicle that is effective for offensive and defensive strategies alike. It has the greatest firepower, allowing players to often earn the glory of warlord. [M60] The novices’ best friend, in the current version, the M60 is extremely popular. Its massive load bearing capacity allows the M60 to carry more spare armor which can help players to survive for much longer, giving players a superb gaming experience. [MK6] The rock-solid MK6 has extremely heavy armor, making it a mobile fortress. It is especially suit for players who love to push forward, allowing them to experience the most passion of driving a heavy tank. [Leopard 1] Players often praise the Leopard 1 for its amazing agility. It may be weakened in the current version, but playing it is still an enthralling experience. Armor system, vehicle structure [External Armor] The game realistically replicates armor modules and thickness values of vehicles, including standard thickness, equivalent thickness, angling etc. [Internal Structure] The internal structure of vehicles has been faithfully and realistically replicated. Damage to the crew and its internal structure will affect vehicles’ control. Skin sets and challenge rewards [Cool Suits] The cyberpunk-styled Suit allows players to flaunt their own personality. The various camouflage skin suits from the store can be used to confuse players in battle. Every warlord can find the suit for themselves. [Challenge Rewards] The large amount of challenges bring rewards to players. Player invitations, novice challenges, weekly challenges, season challenges and more will provide players with a wide multitude of challenges, allowing for players to have different in-battle targets according to their own playing style. New Mode: Combined Operations [Faction Battle] 30 players are split into two teams to battle it out with one another. The first team which destroy 30 enemies first will claim victory. [Kill Rewards] Players will drop supplies such as ammo and repair crates when they die. When players are destroyed by enemies, their skills, fire control components and armor will all be destroyed. [Immortal Hero] In this mode we have provided players with a second chance to reenter the combat upon dying. After dying, players will be randomly airdropped on their team’s side. Push forward for the glory of your faction!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/773520/header.jpg?t=1586238917",
    "Price": 0.0,
    "Developers": "梵天游戏",
    "Publishers": "梵天游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_867038a724604c9aaaec9897a56bc17660664bc6.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_16bc74be19e7b91f31c50c76374f4a6ffb44ab98.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_2881b9a445d412a4a7b3eef92d5ce3d15ea236c1.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_56e5fcecd93c3db0882bfd3f1185df3ea3199711.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_2696dac13a7543a09bed13823abfb0874904d59e.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_90c06377085811b9af15cf8d23d9de464b63689c.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_811aa07dd9603d970891543c468c99cb8c3ab393.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_26dfb0ec1bce99243494fc4cd9033a3f4232b977.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_066c1d23eb2fdfdd8f47ba08c98e7e5568e1dcee.1920x1080.jpg?t=1586238917,https://cdn.akamai.steamstatic.com/steam/apps/773520/ss_da10d2f0e9cb99fa00bbda9885154d16d436847b.1920x1080.jpg?t=1586238917",
    "Slug": "refight-burning-engine",
    "Meta Title": "Refight:Burning Engine: Oct 15, 2018, 梵天游戏 and Full Overview",
    "Meta Description": "Looking for information on Refight:Burning Engine? Check out the release date (Oct 15, 2018), developer insights from 梵天游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for Refight:Burning Engine game - Steam 773520",
    "Canonical URL": "https://gusku.site/game/refight-burning-engine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Refight:Burning Engine\", \"description\": \"Looking for information on Refight:Burning Engine? Check out the release date (Oct 15, 2018), developer insights from \\u68b5\\u5929\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u68b5\\u5929\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u68b5\\u5929\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/773520/header.jpg?t=1586238917\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}