{
    "AppID": 642000,
    "Name": "Regenesis Arcade Lite",
    "Release date": "Nov 20, 2017",
    "About the game": "*LITE VERSION allows you to play only first map (without boss fight) in Arcade mode, for more we encourage to purchase Full Version of Renesis Arcade. ERADICATE MACHINES. SAVE EARTH. Jump into the middle of the action in Regenesis Arcade Lite , the VR sci-fi shooter set in dystopian future ran by machines. Select one of two locomotion modes (free movement or teleport) and choose from variety of weapons, one for each hand, creating powerful synergies using perks to take the fight to machines. Most of game’s content will be a bit different every time you play due to a random generation mechanism. WEAPONS &amp; UPGRADES: INSTRUMENTS OF DESTRUCTION Collect weapons from each of three categories, that can be upgraded for maximized firepower. From gravity gun, through minigun, shotgun to powerful rocket launcher and wavegun, every weapon comes with its own strengths and weaknesses you need to consider while in the heat of the combat. KNOW YOUR ENEMY Fighting the deadly killing machines will not be easy. Coming from all directions, covering both ground and air, each enemy requires different tactical approach. Some will activate shields that either deflect or absorb damage, others will dodge swiftly every shot coming at them or make a kamikaze run right into your face. Do not underestimate your opponent no matter how small it might be! THE WAR THEATER In Regenesis Arcade Lite, you will battle through 8 detailed maps in campaign mode (Lite version allow to play first map only), ranging from futuristic cities, through forests to atomic wastelands, in different weather conditions, including a snowy blizzard! Discover and explore each map’s enemies and weapons drops in order to gain tactical advantage! After you finish the campaign you will continue in game+ mode, that will increase the difficulty and enable all types of enemies and unique weapons to be spawned in each level. After you unlock a level, you can start campaign from any point you want, getting faster to the further part of the game but not having all the goodies you might have collected if you’d start from the beginning. It’s up to you to either save your time grinding or prepare yourself better for the onslaught! GLOBAL SCOREBOARD Feel the spirit of ARCADE competition and fight for the highest score on the global leaderboard! Random generation and long-run nature of the game encourages you to master the levels and the weapons to the point where you can effectively compete for the domination as the ultimate champion without getting bored. Regenesis Arcade Lite brings the true spirit of retro arcade games into modern environment of Virtual Reality!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/642000/header.jpg?t=1537457943",
    "Price": 0.0,
    "Developers": "Hyperbook Studio",
    "Publishers": "Blue Technology Sp. z o.o.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_80dbe539a6ac3f0a2cc87c2168d8f24ebc83f00f.1920x1080.jpg?t=1537457943,https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_6ae5f7728f278c38748d005c13407d5d44822f54.1920x1080.jpg?t=1537457943,https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_cfbe6ad0c0b69af23069c7feed4df4f2d8eb2666.1920x1080.jpg?t=1537457943,https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_49487e609ae4824d9c54a2ddf661999c94a1d05d.1920x1080.jpg?t=1537457943,https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_053d8187525187712d4a39fa857cbcae0d97fdae.1920x1080.jpg?t=1537457943,https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_5b92775141a1f1605ca28ef9e9d737799fa30fc4.1920x1080.jpg?t=1537457943,https://cdn.akamai.steamstatic.com/steam/apps/642000/ss_4e71d3d5bce6edb88b3f4a3a81a8b8c708ca2852.1920x1080.jpg?t=1537457943",
    "Slug": "regenesis-arcade-lite",
    "Meta Title": "Regenesis Arcade Lite: Nov 20, 2017, Hyperbook Studio and...",
    "Meta Description": "Looking for information on Regenesis Arcade Lite? Check out the release date (Nov 20, 2017), developer insights from Hyperbook Studio, and a complete ga...",
    "Alt Text Image": "Official header image for Regenesis Arcade Lite game - Steam 642000",
    "Canonical URL": "https://gusku.site/game/regenesis-arcade-lite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Regenesis Arcade Lite\", \"description\": \"Looking for information on Regenesis Arcade Lite? Check out the release date (Nov 20, 2017), developer insights from Hyperbook Studio, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hyperbook Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Technology Sp. z o.o.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/642000/header.jpg?t=1537457943\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}