{
    "AppID": 1728080,
    "Name": "Roseblight",
    "Release date": "Sep 25, 2021",
    "About the game": "'There is... something... that flows between all of us. You can feel it too, can't you? Spirit, Life, Magic, whatever you call it... it's there. It binds us all together in a way. We're all made of it. But some... some can conjure it. Mold it, shape it, change the universe with it. I fear those who can.' Roseblight is a strategy/action RPG that takes place on the distant planet Ahokau, a monochromatic world filled with deadly wildlife, vast uncharted territory, and mysterious natural phenomena. After their world is thrown into chaos due to a large meteor falling from the sky and crashing on a nearby mountain, our overall-wearing trowel-wielding hero sets off to investigate. But on their journey, they discover new truths about the world, the universe, and themselves. RECRUIT - Some lost souls are itching to go on an adventure, and if you convince them to join you they may aid you on your journey as an ally. OBSERVE - Knowing your surroundings is the key to surviving within them. Take note of your peers and your foes to reveal useful information that can turn the tides when needed. STORY - Everyone has a story to tell, some more than others. There are many hidden truths about our universe and those who reside within it, and if you talk to the right people you may unveil some information you wish you hadn't. EXPLORE - Vast uncharted territory means vast means of conquering. Run until your feet hurt. Explore until your curiosity is satisfied. Turn over every stone until there are no stones to turn over. BATTLE - In a world seething with vengeful spirits and bloodthirsty creatures, someone has to put them in their place. Sharpen your gardening equipment and show them who's boss. LOOT - Treasures and loot gained from victorious battle can be converted into various equipment and trinkets that will aid you on your journey. INVESTIGATE - Plentiful secrets and mysteries are scattered throughout Ahokau, and if you look in the right places you may be rewarded handsomely. GROW - Exploration and prowess yield new skills, techniques, and hidden powers that can be used to tip the scales of the universe. HELP - It never hurts to lend a helping hand to those in need. Perhaps your love and generosity can reward you in the future. TRIUMPH - Improve. Adapt. Persist. You fall down, and you get back up. They won't stop fighting for what they believe in, and neither should you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1728080/header.jpg?t=1632596059",
    "Price": 7.99,
    "Developers": "AploveStudio",
    "Publishers": "AploveStudio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_07f1ca42059ee02cbffc1a359962d0660410f3d8.1920x1080.jpg?t=1632596059,https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_0c1b526fc17c3486813fb8c5290cd2aa1083daa6.1920x1080.jpg?t=1632596059,https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_2a59ca6da5dcaf22166186e24c88ff9d8e2b5825.1920x1080.jpg?t=1632596059,https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_7b606fab77163a4b8d763a680412f291576c6af8.1920x1080.jpg?t=1632596059,https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_36774b49c5559638d4d8d534579b6af7c72b2ef2.1920x1080.jpg?t=1632596059,https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_c44860345c66a67693ca594d01e1f055560e1d53.1920x1080.jpg?t=1632596059,https://cdn.akamai.steamstatic.com/steam/apps/1728080/ss_83a81787eda49b932abf9566b37ab3f6c53cecd4.1920x1080.jpg?t=1632596059",
    "Slug": "roseblight",
    "Meta Title": "Roseblight: Sep 25, 2021, AploveStudio and Full Overview",
    "Meta Description": "Looking for information on Roseblight? Check out the release date (Sep 25, 2021), developer insights from AploveStudio, and a complete game summary.",
    "Alt Text Image": "Official header image for Roseblight game - Steam 1728080",
    "Canonical URL": "https://gusku.site/game/roseblight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Roseblight\", \"description\": \"Looking for information on Roseblight? Check out the release date (Sep 25, 2021), developer insights from AploveStudio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"AploveStudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AploveStudio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1728080/header.jpg?t=1632596059\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}