{
    "AppID": 1119840,
    "Name": "Sands of Aura",
    "Release date": "Oct 21, 2021",
    "About the game": "A ruinous cataclysm unleashed by a tormented god descended the world of Talamhel into perpetual night. The hourglass of time was shattered and its essence poured across the land, creating an endless sea of sand. The once-flourishing world of Talamhel became a putrid lesion of its former glory and those who called it home are now husks of corruption--violent, undying, unyielding soldiers of death. But Talamhel is not lost--not yet. For generations, the righteous few have endured. You are one of those few. On the eve of your induction into the Order of Remnant Knights, the last protectors of man, Talamhel is once-again wracked by calamity. The corruptive nature of the Night Plague has mutated, and the realm of man needs the Remnant Knights more than ever. Track down the emergent evil and destroy it. Protect the realm of man. From the helm of your nimble grainwake, carve across the perilous sandseas to confront the source of this newfound terror, but don’t expect a guiding light or a red X on a map. You’ll chart your own course forward--behold the open seas, and choose the heading you best see fit. But familiarity is a far-flung concept aboard the grainwake--the shifting sands are always changing, revealing secrets, dangers, and paths unseen. Things are not as they seem… Talamhel is an open world, free to explore and discover as you please Every island is a unique, colorful encounter of combat, lore, and plunder With tiered levels of difficulty, locations offer challenges that will reward those who overcome With a trusted (undead) companion rested in the crow’s nest, you’ll never sail the seas alone The corruption that plagues Talamhel has created a horde comprised of both man and other Talamhelic natives: The venerable Ferrum and the insectoid, hive-minded Hashara. Once warring nations have become an abominable army of undying malice. From doomsday cultists to fallen kings, the foes that guard the answers you seek are determined to see your end. Prepare for an unrelenting, unforgiving combat experience not to be taken lightly. Swing true, dear knight, swing true. With hundreds of weapon components to be reclaimed from the crumbled remains of civilization, there are thousands of unique weapons to be forged. Find the hilt that fits just right. Cleave through the corruption with 7 distinct fighting styles Bolster yourself with dozens of armor sets, each with their own unique defenses Combine and modify your devastation with magical augments, creating a personalized build Starspire is the sanctuary that you call home, and its doors remain open to those you deem worthy of its hearth. Along your journey, you will encounter refugees in need of shelter and a Remnant Knight can see they find it in Starspire. Each person deserving of Starspire will make their new home stronger and safer, but not all are deserving. Working as an optional companion to core gameplay, Starspire offers an opportunity to test your Remnant traits of leadership and judgment. The choices you make regarding Starspire’s residents will alter your story and affect your fate, as well as the fate of others--but only if you choose to make those choices. New Starspire residents unlock perks like gifts of exclusive equipment and unique services Discover the lives of others, their choices and actions, and decide their fate Engage with characters unlike any you’ve ever met, and rebuild a community Decisions not easily made: become familiar with the grey area between right and wrong The symphony of the sands are brought to life with an evocative, soul-stirring soundtrack composed and produced by the incredible Eduardo Lopez. Sands of Aura will feature a fully symphonic soundtrack, with a wide selection of instrumentation--from the haunting strings of the antique Viola Da Gamba to the resonant thunders of a professional Bulgarian choir. These are the unforgettable sounds of Talamhel. The score of a wounded world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1119840/header.jpg?t=1658348498",
    "Price": 24.99,
    "Developers": "Chashu Entertainment",
    "Publishers": "Freedom Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_b05c56d4cf19d826b805b8cb7531112a66e2404f.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_edb8fed255de01732583278fbbe1182d1febc380.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_b047c180b5a3059c1e839ef235d543404cedc39e.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_1f640947f25b12ac952b5376437809522840086e.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_d6ec658f3da0c39f7ed591cd6a17e34b93d60d9d.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_babe0331e4f49747ac4839c9bc5ce41e3c6ac1d2.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_312425f6be979d6e959ba455ff7643389bc419a1.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_8ab8e095690b21dd172c5dee3ae7fe94b0d821fd.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_c49158218d8de64b610a52fe30574d886ee1bc41.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_4cab01b608053fe5d25382bfd5361aedd383d1ef.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_778e4162943e05547296bdccc8cdb185fe8e2ef8.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_4738c5810fd87449b0639ff4cf1be63dd4d6cd9f.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_216e813aefa20da32ec9ded4238af9b380927114.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_b17ae3193ba88315377ca0d13cf48a0260d0aea1.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_42e1f9594b96074c7302cb1accc11aea973970b1.1920x1080.jpg?t=1658348498,https://cdn.akamai.steamstatic.com/steam/apps/1119840/ss_c9694564e7d1fe1f2f2d35d5c1891e310ba12ea7.1920x1080.jpg?t=1658348498",
    "Slug": "sands-of-aura",
    "Meta Title": "Sands of Aura: Oct 21, 2021, Chashu Entertainment and Ful...",
    "Meta Description": "Looking for information on Sands of Aura? Check out the release date (Oct 21, 2021), developer insights from Chashu Entertainment, and a complete game s...",
    "Alt Text Image": "Official header image for Sands of Aura game - Steam 1119840",
    "Canonical URL": "https://gusku.site/game/sands-of-aura",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sands of Aura\", \"description\": \"Looking for information on Sands of Aura? Check out the release date (Oct 21, 2021), developer insights from Chashu Entertainment, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chashu Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Freedom Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1119840/header.jpg?t=1658348498\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}