{
    "AppID": 1849760,
    "Name": "Siege of Treboulain",
    "Release date": "Apr 14, 2022",
    "About the game": "Rule a magical city and defend it from an enemy army! In this epic fantasy game of swordfights, warfare, politics, and romance, can you prove worthy of your throne? The Siege of Treboulain is a 260,000-word interactive novel by Jed Herne. It’s entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. You’re the young ruler of a magical city, trying to lead your people to greatness. When a ruthless army besieges Treboulain, you must martial your troops, rally your people, and defend your city! Will you take to the walls yourself, using your magic and skill with a sword to inspire your soldiers? Or will you command the defense from a distance, using your sharp tactical mind? Should you fill the moat with traps, train elite magicians, or recruit mercenaries for a surprise attack? With rival politicians attempting to usurp you, what will you sacrifice to maintain order? Manage your population’s morale – and your dwindling resources – with wise leadership. Expose deadly conspiracies, find love and friendship amidst the turmoil, and prove your worthiness to rule. Can you save your city against overwhelming odds – and forge a mighty legend? Play as male, female, or non-binary; gay, straight, bi, or asexual. Explore a magical city filled with rich history, fascinating lore, and arcane secrets. Find love or friendship with a brave warrior, a wise priestess, a cunning merchant, or a talented artist. Become a powerful arborturgist and master the magic of the plants. Command soldiers, plan tactics, and fight in everything from one-on-one duels to massive, history-shaking battles. Defeat enemies with swordplay, enchantment, spectacular speeches, or trickery. Manage the city’s internal politics and balance the demands of the army, priests, merchants, and commoners. Choose from three unique backstories – magician, warrior, or scholar – and learn about your enemy through flashbacks. Win the respect of your people…or become a tyrant who demands their obedience! Leave a legacy that will affect your city – and the world – forever.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1849760/header.jpg?t=1649947438",
    "Price": 5.99,
    "Developers": "Choice of Games LLC",
    "Publishers": "Choice of Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1849760/ss_06cbefdd7c46eddd577823380fd57992741de716.1920x1080.jpg?t=1649947438,https://cdn.akamai.steamstatic.com/steam/apps/1849760/ss_0a83695b18447af12209418597686afd69be54e1.1920x1080.jpg?t=1649947438,https://cdn.akamai.steamstatic.com/steam/apps/1849760/ss_c564997edec49efa3f8585a9b99eb24122d3a8f8.1920x1080.jpg?t=1649947438,https://cdn.akamai.steamstatic.com/steam/apps/1849760/ss_313eedd3173216b90929dcfcdea4a8203a43f9be.1920x1080.jpg?t=1649947438,https://cdn.akamai.steamstatic.com/steam/apps/1849760/ss_c26e44d685c4f81f7d44a2b9f6155d3e8c154581.1920x1080.jpg?t=1649947438",
    "Slug": "siege-of-treboulain",
    "Meta Title": "Siege of Treboulain: Apr 14, 2022, Choice of Games LLC an...",
    "Meta Description": "Looking for information on Siege of Treboulain? Check out the release date (Apr 14, 2022), developer insights from Choice of Games LLC, and a complete g...",
    "Alt Text Image": "Official header image for Siege of Treboulain game - Steam 1849760",
    "Canonical URL": "https://gusku.site/game/siege-of-treboulain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Siege of Treboulain\", \"description\": \"Looking for information on Siege of Treboulain? Check out the release date (Apr 14, 2022), developer insights from Choice of Games LLC, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1849760/header.jpg?t=1649947438\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}