{
    "AppID": 602080,
    "Name": "Solaroids",
    "Release date": "May 26, 2017",
    "About the game": "Stand your ground against a seemingly insurmountable threat that is after your precious sun. Defend your solar system in a continuous conflict that progresses from tame introductory levels to epic high-octane space battles that will challenge even the most experienced pilots. Power-ups As the levels progress and the threat continues to grow, so will the kinds of weapons at your disposal. Perform advanced maneuvers while dodging asteroids, mines, and enemy missiles as you upgrade the capabilities of your ship and rack up higher and higher scores. Equip primary, secondary, and defensive weapons - the choice is yours. Upgrades Add additional outrider attachments to your alpha fighter and create an extremely powerful ship. Keep both your ship and outriders in good repair or watch your precious power-ups float off into the darkness of space for the taking. Bosses Under the cover of an asteroid belt, enemies and complex bosses lurk waiting to attack. Each boss has their own attack patterns, weapons, and weaknesses. Tread carefully and use the hazards in the belt to defeat your foes without succumbing to them yourself. Local Multiplayer Fly solo, or with up to three of your friends in local multiplayer mode. Play co-op against waves of enemies or square off against each other in a wide-open combat arena. Players can join at any time with no need to setup complex game modes. Keep your straight during intense combat by customizing your primary and secondary ship colors, or configure friendly fire/collisions to adjust the level of co-op. Emulation Emulate the look and feel of Classic arcade machines or retro consoles by adjusting Vector, Palette, and CRT effects. Mix and match to your taste! Early Access My name is Chad Yates (Kiates) , and I am passionate about delivering Solaroids as the best Asteroids© style retro 2D arcade game on the market now or ever. Browse my update and patch history or look at the regular high score events I hold. Check the forums and you will see my level of commitment. Please join my community to suggest changes and play my latest builds - let’s build this together!! Solaroids will continue to evolve with input continuously gathered from players in the community, as it makes its way to an official release out of Early Access! Additional Features Damage system based off physical, mechanical, and electrical properties Up to 4 local players Unlimited credits (configurable) Free Play - Provides instant and insanely intense action (unlockable) Separate local and global leaderboards for both First Credit and Any Credit high scores Original soundtrack Support for Steam music Fully configurable control styles: Classic, Hybrid (single-stick), Modern (twin-stick) 4K+ resolution support 60Hz-240Hz+ support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/602080/header_alt_assets_2.jpg?t=1655700688",
    "Price": 9.99,
    "Developers": "Chad Yates",
    "Publishers": "DynF/X Digital LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/602080/ss_1065bbc39c06a664dec0c98c0dfc90acf02cdbda.1920x1080.jpg?t=1655700688,https://cdn.akamai.steamstatic.com/steam/apps/602080/ss_e0dbdbaf5e38e79bf1f101ba65a15bd9570945d7.1920x1080.jpg?t=1655700688,https://cdn.akamai.steamstatic.com/steam/apps/602080/ss_eae8f0d37b011887e2b589e9028fff0a1e87c959.1920x1080.jpg?t=1655700688,https://cdn.akamai.steamstatic.com/steam/apps/602080/ss_8015c18dd4e130a27cc8a80a72aa2e27f2279dd7.1920x1080.jpg?t=1655700688",
    "Slug": "solaroids",
    "Meta Title": "Solaroids: May 26, 2017, Chad Yates and Full Overview",
    "Meta Description": "Looking for information on Solaroids? Check out the release date (May 26, 2017), developer insights from Chad Yates, and a complete game summary.",
    "Alt Text Image": "Official header image for Solaroids game - Steam 602080",
    "Canonical URL": "https://gusku.site/game/solaroids",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solaroids\", \"description\": \"Looking for information on Solaroids? Check out the release date (May 26, 2017), developer insights from Chad Yates, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chad Yates\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DynF/X Digital LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/602080/header_alt_assets_2.jpg?t=1655700688\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}