{
    "AppID": 730710,
    "Name": "Space Viking Raiders",
    "Release date": "Jan 14, 2019",
    "About the game": "Features -Online co-op campaign -- do the entire campaign online and with your friends! -Unique Physics-Based Abilities and Weapons -- shred the hordes of oncoming aliens! -Innovative Swarm Gameplay -- shape and manipulate the oncoming enemy formations to maximize destruction! -Deep Tactical Gameplay -- only the best vikings can master the hardest difficulties and achieve the high-scores. It takes a high degree of cooperation and individual skill to defeat the hardest difficulty. A warning to the weak! -Blast through throngs of enemies from 3 dimensions! Battle the fleets of the Federites, face the gory horror of the Sluglings, and feel the wrath of the Sugarfiends. Assault them on their homeworlds, destroy their buildings, raid their lands, and take the elementium that you came for! -10 Missions, with fully voice acted dialogue! Roughly 5 hours to complete the campaign for the first time. -Singleplayer, and 2-4 player co-op campaign supported. -Xbox controller support. (General Gamepad Support) -3 different difficulty settings for a more chill experience or legendary mode for the try-hards. -A large selection of epic music to splatter your foes to. -4 Playable characters, each with many unique abilities. [YouTube Reviews] Roadmap / Unconfirmed Features -Endless mode, survive as long as you can with limited health and energy against the endless horde. -PvP nutball (soccer / football mode) -More levels -Got ideas? Join the Discord! Story and Mechanics Space Viking Raiders is a co-op action role-playing game set in a comedic, sci-fi multiverse. 1 to 4 people can play the 3-5 hour campaign locally or through ONLINE MULTIPLAYER!! Our badass energy axes and special abilities are similar to popular MOBA mechanics Choose 1 of 4 Space Vikings, raid other dimensions and engage thousands of aliens in intense futuristic combat. Launch your destructive onslaught with 10 devastating abilities that will obliterate enemies and landscapes alike. Use brute force and aggression to smash through enemy waves or pick your moment and strike with tactical precision. Once you’ve vaporized all foes in your path you must destroy the enemy base with it’s spawners, energy shields and defensive turrets. In the center of each base, the “heart building”, destroy it, the base crumbles and you’ll claim it’s precious Elementium. Play online or locally with up to 4 people. Take advantage of different play styles and abilities using complimentary weapon systems to line up the best combos. When you and your fellow raiders run out of Energy, you’ll have to maneuver and melee, timing your attacks just right to keep the enemies at bay. Navigating the alien worlds will be a perilous venture and require careful platforming skills. As you move through canyons, over archipelagos and across the sugary desserts, you’ll have to bounce over cliffs, carefully maneuver moving platforms and avoid destroying the very ground under your feet. The 10 level campaign you will play through follows the story of legendary Space Viking Raider, Dredrick ‘Deadeyes’ and his ruthless and irreverent crew of Space Viking misfits. Nakano ‘Zica’ Zicarus, the audacious munitions expert and technical prodigy. Tommy K., the crew’s resident Berserker, brain damaged, and suffering from frequent bouts of memory loss and psychedelia. And Athelia, the crew’s 2nd in command and pilot, her competence and measured personality paired with a fierce loyalty to Dredrick. After raiding a science vessel and looting inter-dimensional portalling technology they begin raiding alien worlds. The arid canyons of the sluglings. The lush archipelago of the Federites. And the sugary desserts of the Sugarfiends. We play on hard. Based in Vancouver, Multiball Studios was created by Adam Thompson and Scott Banducci. Using their complementary skill sets and funded with their own money, they set out to build an indie game studio from the ground up. Despite having minimal time and resources, Multiball was able attract some of the best talent from Vancouver's rich game and film ecosystem. Sound engineers from feature film productions, artists from AAA gaming studios and modelers and animators from the indie game scene. Using a network of connections locally in Vancouver and from around the world they've pulled in music and voice acting from places like New Zealand and Scotland. The idea we believe in is both simple and difficult: the best way to become a successful indie game studio is to start making games. If our games are good, the money will flow. With veteran lead developer Adam Thompson at the helm we expect this first game will demonstrate the tremendous potential of Multiball Studios creativity and network of talented individuals.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/730710/header.jpg?t=1549826012",
    "Price": 4.99,
    "Developers": "Adam Thompson",
    "Publishers": "Multiball Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_5a201ad0d1521177ae07b20d5f7d7a26acddcaaf.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_1192aa4c3351b631b02269075c1f2f17eab9f4d6.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_00a6d1810d2c741f051e2d9241c5e77777bcf80b.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_d1ecad7ca5074d02eaed36af4c6acb658a454ac0.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_1a1c77ab5a6ec5e613dc4351ce59b890c176a608.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_e2ea5fb998234442f9628403d2962955a57d2f95.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_92a580ff3ddf3fe853595ca837d85a8c79af08de.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_bb168d31dbc3c49244365db91cb21c1d71470351.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_4b77eabf85a9e02cf5f02650bf418d06ba35d53d.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_aba4d437db0b04b24f051239140afd9aaa442e54.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_1fd76b2edec6005ac8e512ebc262647cae5e80a9.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_a377bada15781110181472e3af737c6cc3aa33a8.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_e38d3c012f9cdb667017b026c2cba26703e67658.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_df27c14bfe35cb99238e449ada041a2186113d83.1920x1080.jpg?t=1549826012,https://cdn.akamai.steamstatic.com/steam/apps/730710/ss_ac6762087eeb6d491a518e6d7b7801451d1e23c4.1920x1080.jpg?t=1549826012",
    "Slug": "space-viking-raiders",
    "Meta Title": "Space Viking Raiders: Jan 14, 2019, Adam Thompson and Ful...",
    "Meta Description": "Looking for information on Space Viking Raiders? Check out the release date (Jan 14, 2019), developer insights from Adam Thompson, and a complete game s...",
    "Alt Text Image": "Official header image for Space Viking Raiders game - Steam 730710",
    "Canonical URL": "https://gusku.site/game/space-viking-raiders",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Viking Raiders\", \"description\": \"Looking for information on Space Viking Raiders? Check out the release date (Jan 14, 2019), developer insights from Adam Thompson, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adam Thompson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Multiball Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/730710/header.jpg?t=1549826012\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}