{
    "AppID": 1236720,
    "Name": "Spirit Island",
    "Release date": "Jul 29, 2020",
    "About the game": "In the most distant reaches of the world, magic still exists, embodied by spirits of the land, of the sky, and of every natural thing. As the great powers of Europe stretch their colonial empires further and further, they will inevitably lay claim to a place where spirits still hold power - and when they do, the land itself will fight back alongside the islanders who live there. Spirit Island is a cooperative settler-destruction strategy game designed by R. Eric Reuss and set in an alternate-history world around A.D. 1700. Players become different Spirits of the land, each with their own unique elemental powers, forced to defend their island home from colonizing Invaders spreading blight and destruction. Your Spirits work with the native Dahan to increase your power and drive the invading colonists from your island in this strategic area-control game. In Spirit Island, players choose between 1-4 Spirits to control. The number of Spirits determines the size of the island: Spirit Island includes all of the content from the award-winning tabletop game: 8 different Spirits, each with 4 Power cards unique to that Spirit 36 Minor Power cards that enhance the abilities of your Spirits 22 Major Power cards with more powerful effects to devastate the Invaders A modular island, made up of 4 balanced island boards, for a variety of layouts Thematic island boards that reflect the canonical island and provide a new challenge 3 multi-tier Adversaries (specific Invaders) for play variety and fine-tuned challenge: Brandenburg-Prussia, England, and Sweden 4 optional Scenarios for even more play variety 15 Invader cards driving a distinctive Invader expansion system 2 Blight cards with challenging effects as the Invaders blight the Island 15 Fear cards with beneficial effects, earned as you terrify the Invaders Every rule &amp; interaction in the game has been carefully adapted and thoroughly tested by expert Spirit Island players, as well as the designer himself. If you’re wondering how a certain situation works in Spirit Island, this game is the ultimate rules lawyer! Features: Original dynamic music composed by Jean-Marc Giffin brings Spirit Island to life. Each Spirit has unique musical elements that wax and wane as the game progresses. 3D Textured maps bring a realistic look and isometric perspective to the Island. 3D Classic maps present the Island the way it looks on the tabletop. 2D Classic maps provide a simplified top-down option for all you number crunchers out there. Over 78,000 different potential game configurations to choose from. Play a solo game with 1 to 4 Spirits, pass &amp; play with your friends, or play with friends using Steam Remote Play Together. NEW: Expand your gameplay options with DLC! Promo Pack 1 includes two Spirits: Heart of the Wildfire and Serpent Slumbering Beneath the Island. Branch &amp; Claw adds two Spirits, an Adversary, four Scenarios, many new Power, Fear, and Blight cards, and new mechanics including the Event Deck.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1236720/header.jpg?t=1617637334",
    "Price": 24.99,
    "Developers": "Handelabra Games Inc.",
    "Publishers": "Handelabra Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_64f2610822625dee5f19b5a575bc4e3bb1f3e2b5.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_67e2fecb0d8266cb5a7785358a2bf9d0d363d3a5.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_9d0eafb26b0f88b338b7c1f0070df30155f13e44.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_1b0a7814dcbe76006f5cc60011209bf801a5fbd8.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_2166c1d591722907a28b0d317ae6b64cd1ba2945.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_08d972eed36db85e3bb4c2413ac9be5fcbe67016.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_d6fc379990f48175cffdad478a641b1d114287ab.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_4de4d83ec490c9784b2c7937e598040af48e5895.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_bb1801278fcbfed61cbb68c184a905c31c37f8d7.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_bf368453d0fd22c680ba8d493d391a0cb2e8ceae.1920x1080.jpg?t=1617637334,https://cdn.akamai.steamstatic.com/steam/apps/1236720/ss_1dbb19fdd2a3ea73efb8f2d3511b4e0a22a3ff36.1920x1080.jpg?t=1617637334",
    "Slug": "spirit-island",
    "Meta Title": "Spirit Island: Jul 29, 2020, Handelabra Games Inc. and Fu...",
    "Meta Description": "Looking for information on Spirit Island? Check out the release date (Jul 29, 2020), developer insights from Handelabra Games Inc., and a complete game ...",
    "Alt Text Image": "Official header image for Spirit Island game - Steam 1236720",
    "Canonical URL": "https://gusku.site/game/spirit-island",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spirit Island\", \"description\": \"Looking for information on Spirit Island? Check out the release date (Jul 29, 2020), developer insights from Handelabra Games Inc., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Handelabra Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Handelabra Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1236720/header.jpg?t=1617637334\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}