{
    "AppID": 1347240,
    "Name": "Suez Canal Simulator",
    "Release date": "Apr 20, 2021",
    "About the game": "Take control of the Suez Canal! Pilot a ship from the Mediterranean to the Red Sea and back. Take part in prototypical northbound or southbound convoys. Travel thru Egypt and feel the wind in your hair and the sand in your eyes. A full 1:1 scale re-creation of the 193-kilometer-long waterway that changed the world, the Suez Canal! A LITTLE HISTORY The history of the Suez Canal predates Cleopatra with a manmade waterway linking the ancient cities surrounding Cairo with the Red Sea. Built under the leadership of Ferdinand de Lesseps, the Suez Canal opened for passage in 1869 and instantly revolutionized global travel and commerce. The canal was operated by the British and the French until 1956 when it was nationalized by Egyptian President Gamal Abdel Nasser. The Suez Crisis of 1956 was an ill-fated attempt by the British, French, and Israelis to seize control of the canal. The Six Days War found a fleet of 15 ships stranded in the canal from 1967 until 1975, nicknamed the 'Yellow Fleet' from their decks always being covered with blowing sand. The 1973 Yom Kippur War littered the banks of the canal with the remnants of war, much of which is still visible today. WHAT TO EXPECT Simulating a journey thru the Suez Canal allows you to gain an understanding of what to expect on the real journey. After a journey through Suez Canal Simulator you will be graced with the knowledge a seasoned mariner would need in order to approach such a journey with confidence. If you plan on taking a trip through the Suez Canal then this simulator can accurately teach you the canal waterways, the sea approaches, anchorage and port locations, and the locations of lighthouses, range lights, buoys, and signal stations. Drive massive container ships, Suezmax supertankers, and modern cruise ships, and sail thru the canal on the winds of Egypt's fertile plain and the Sinai Peninsula. Meet ships along the way and take care to avoid collisions in the canal. Watch for traffic and signals in the canal or watch the sun rise and set over the Mediterranean and the Red Sea. With buttery-smooth physics, rich vivid graphics, and ultra-realistic atmosphere and lighting, Suez Canal Simulator will set the standard for PC simulator games for years to come. WITH SOMETHING FOR EVERYONE Own one of human engineering's most epic achievements.. own the Suez Canal!.. Get underway now, add Suez Canal Simulator to your Steam Library today! SUEZ CANAL SIMULATOR... AVAILABLE NOW ON STEAM!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1347240/header.jpg?t=1652186814",
    "Price": 19.99,
    "Developers": "Digital Light",
    "Publishers": "Digital Light",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_cd9acb27481b7734810bc5c00d877e4d43b2af8c.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_cdc95109098d9d62a13db00666411bc4458f56f8.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_36fe45f073b5eefc5baa56e33a744d68c52533b2.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_f03016ee4be2e53620b07c837246dad3b307005c.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_4afda9c2c2ac6051c8720738987d3928ed163a21.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_570a4e9d12c0c3abd77b44eeda14d97766761e1e.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_89808b3a4d0918b9d7e3d89d8f8337213ec3dedb.1920x1080.jpg?t=1652186814,https://cdn.akamai.steamstatic.com/steam/apps/1347240/ss_d4cb5ba5ceceba6d2807923f1c723fb19a0e3aee.1920x1080.jpg?t=1652186814",
    "Slug": "suez-canal-simulator",
    "Meta Title": "Suez Canal Simulator: Apr 20, 2021, Digital Light and Ful...",
    "Meta Description": "Looking for information on Suez Canal Simulator? Check out the release date (Apr 20, 2021), developer insights from Digital Light, and a complete game s...",
    "Alt Text Image": "Official header image for Suez Canal Simulator game - Steam 1347240",
    "Canonical URL": "https://gusku.site/game/suez-canal-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Suez Canal Simulator\", \"description\": \"Looking for information on Suez Canal Simulator? Check out the release date (Apr 20, 2021), developer insights from Digital Light, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Digital Light\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Digital Light\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1347240/header.jpg?t=1652186814\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}