{
    "AppID": 1158460,
    "Name": "SULVER'S JOURNEY",
    "Release date": "Nov 9, 2020",
    "About the game": "Sulver's Journey is a fantasy adventure series that follows the warrior Sulver as he searches planet Maroth to collect 6 Divine Stones and 6 Galactic Crystals and keep them out of the clutches of the space conqueror Genesis. However, Genesis has acquired one of these 6 Galactic Crystals, which is known as the Planetary Crystal. Genesis has shattered the Planetary Crystal into 8 shards and scattered them across planet Maroth. Genesis gives Sulver a chance to join him and his cause to try and use the crystals and stones to usher in a Genesis envisioned utopian era with Genesis as the ruler. Collect all 8 shards, open the Lost Dimension and stop Genesis from using a duplicate Planetary Crystal to transform planet Maroth into the Lost Dimension. Upgrade Sulver with a wide array of enhancements, bought through Rutho's Shop. Collect 8 special weapons, all with 3 levels of upgrades! Central City: Sulver's home base and location for Rutho's and Dot's shops and Doctor Birtton's Labboratory Razor's Field: The field that provides access to Mount Oro, The Wizardly Woods, Mount Oro, Poseidon's Bay and the Ancient Ruins. The Hawk watches over the field. Watch out for Hunter Razer patrolling the field as well and try to find the aura boots. They will help you dash through Razer's Field. The Wizardly Woods: A mysterious and dark wooded area inhabited by the Elders and a group of sorcerers, as well as other spirits. The Dark Wizard Cloak haunts these woods and must be stopped by locating Sapphire's Wand. Mount Oro: The ice ninja Borge awaits at the top of the mountain for a much anticipated battle with Sulver. Try not to get blown off the mountain or get buried under any forced avalanches. Find the ice gauntlet to help you scale Mount Oro. Poseidon's Bay: Sharkoid has taken charge of Poseidon's Palace. The Divine Hammer will help fight off Sharkoids army but make sure you have your special breathing item from Rutho's shop before taking the plunge into the bay. Pharaoh's Desert: The ancient long thought dead king of the pharaoh's, Rahma Dao, is still alive and rules with an iron fist. No one is allowed to enter the deepest part of the desert. Find the Eternal Blade and battle Rahma Dao. Future City: Ledges, traps, surprise enemies, a space shuttle and the maniacal Doctor Iron await Sulver in the Future City. The Galactic Energy Beam will help Sulver navigate past some of the more dangerous enemies. But Sulver has to find it first. Blazing Canyon: Make sure you have purchased your heat resistant armor and found your damage reducing armor before entering the Blazing Canyon. Waves of fire, intense heat, fiery enemies and the ancient dragon warrior known as Blaze, all plan on stopping Sulver's journey once and for all. The Raging Ax will aid in Sulver's mission to subdue Blaze. Ancient Ruins: The homeland of the ancient warriors that possessed the power of Sulver. The dark souls and dark energy of all living beings hover over the Ancient Ruins which energies enemies and creates craters and constantly shifting platforms. The Ring of Destiny will help Sulver maintain balance and hep him do battle with his evil counterpart. The Lost Dimension: Genesis's domain. Fight your way through Genesis's Village, Genesis's Dungeon and Genesis' Fortress. Take down the Dark Hunter, stop Trivoid and finally foil Genesis's plan to use the planetary crystal to transform the Planet of Maroth into a land filled with the dark and unstable energy of the Lost Dimension. Includes BONUS levels and mini-games! Bonus Areas consist of: Sorcerer's Summit, Savage Falls, Stone Village, Sapphire's Castle and the Future City Race area. If you are a fan of the Mega Man X series you will love Sulver's Journey. Sulver will feature a series of fun weapons and classic upgrades throughout the game. Eight stages must be cleared before you can enter Genesis' Netherworld which is known as the Lost Dimension. Exciting challenges and a plethora of heroes and villains makes Sulver's Journey an enjoyable game for players both young and old.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1158460/header.jpg?t=1634853166",
    "Price": 14.99,
    "Developers": "Vincent Acampora",
    "Publishers": "Vincent Acampora",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1158460/ss_a376b692d17a62d30d83abc82b63566bf196cd0c.1920x1080.jpg?t=1634853166,https://cdn.akamai.steamstatic.com/steam/apps/1158460/ss_b0cd1667af35c3bb679691cebb3868a35b99650e.1920x1080.jpg?t=1634853166,https://cdn.akamai.steamstatic.com/steam/apps/1158460/ss_7956432752c6a43688506bae74153af41534b2e0.1920x1080.jpg?t=1634853166,https://cdn.akamai.steamstatic.com/steam/apps/1158460/ss_780412b25bc5bf78aede3eeedcaebca5e5ab29b6.1920x1080.jpg?t=1634853166,https://cdn.akamai.steamstatic.com/steam/apps/1158460/ss_315082b1475f57032db945b5d8fcb521eaf9ce92.1920x1080.jpg?t=1634853166",
    "Slug": "sulver-s-journey",
    "Meta Title": "SULVER'S JOURNEY: Nov 9, 2020, Vincent Acampora and Full ...",
    "Meta Description": "Looking for information on SULVER'S JOURNEY? Check out the release date (Nov 9, 2020), developer insights from Vincent Acampora, and a complete game sum...",
    "Alt Text Image": "Official header image for SULVER'S JOURNEY game - Steam 1158460",
    "Canonical URL": "https://gusku.site/game/sulver-s-journey",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SULVER'S JOURNEY\", \"description\": \"Looking for information on SULVER'S JOURNEY? Check out the release date (Nov 9, 2020), developer insights from Vincent Acampora, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vincent Acampora\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vincent Acampora\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1158460/header.jpg?t=1634853166\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}