{
    "AppID": 466940,
    "Name": "The Sandbox Evolution - Craft a 2D Pixel Universe!",
    "Release date": "Nov 15, 2016",
    "About the game": "Use your godly powers to craft amazing pixel worlds or destroy the universe! Welcome to The Sandbox Evolution, the #1 pixel art world creation game. Play with physics, over 200 elements and controllable heroes. Make your own games or levels, and then share your creations online. There are no limits to your creativity and imagination! - Click to drop elements, use your keyboard and mouse to zoom and scroll, control heroes with your gaming controller or keyboard. - Create or destroy with your mouse! - Amazing HD pixel art graphics featuring multiple visual effects, parallax scrolling and more - Build worlds up to 10x bigger than in the previous Sandbox game - Draw original art or fanboy tributes to your favorite retro characters with over 100 colors - Create your own levels using Blocks and other Platforming elements - Compose chiptune melodies and become a retro maestro - Share your creations in the Online Gallery - Save and Sync your progress online with Steam or Email - Follow your favorite Players and Top Creators via the Social Menu - Full support for the Steam Controller to create worlds and control the heroes characters inside levels made by others players CREATE YOUR WORLD PIXEL AFTER PIXEL! - Build a 2D pixel world by mixing and matching over 200 elements to discover their interactions - Use predefined templates or start from scratch: Music, Pixel Art, Sandbox, Caveman or Avatar - Manipulate Natural elements: Mud, Water, Sand, Fire, Metal, Electricity, Acid, Lava and more - Many Heroes with different skillsets: Shoot with Arnold, fly with Fujin or play with Hamster, the cutest of all OR UNLEASH THE WRATH OF GOD WITH THESE ELEMENTS - NUKE: Arguably mankind's worst invention, this mega-bomb has devastating effects. - TORNADO: A super whirlwind makes everything fly away as you guide it through your worlds! - EARTHQUAKE: Drop an epicenter generator over your worlds to unleash chaos throughout the landscape. - LIGHTNING: Godlike power at your fingertips! Spawn lightning bolts by tapping anywhere. A MAJOR EVOLUTION OVER ITS PREDECESSOR: THE SANDBOX! - even more freedom and creativity, through improved physics and side-scrolling worlds 10x bigger than its predecessor. - much-improved beautiful pixel art graphics featuring multiple visual effects, parallax scrolling and more - 5 dedicated Creators modes to embrace every maker player: Create Sandbox, Make Game, Make Laser, Make Chiptunes, Draw Pixel Art - 9 exclusive campaigns levels themed around several aspects of the gameplay: Genesis, Disasters, Machines, Lasers, Pixel Art as well as the story of some of the new heroes controllable characters: Ninja or Caveman - easy-to-use game maker that enables players to create a retro-style platformer level in just a matter of seconds!! - over 200 elements (many of them are new and not present in its predecessor) for players to choose from when designing their worlds, to pick between various entities, game-making blocks, platforms, enemies, portals and characters, pixel art drawing colors, and more. - innovative “Daily Quests” mode to play some of the most challenging levels made by other players - full support for the Steam Controller for players to create worlds and control the heroes characters inside levels made by others players. - new Friends social menu where players can follow their favorite Players and Top Creators THE GAME MAKER YOU WANTED - Begin with ready-to-use 4x4 pixel blocks, then add platforms, traps and enemies to spice things up - Create your own levels using Game Design elements: Controllable Heroes, Platforms, Portals, various Blocks or Spikes - Place a controllable hero character in your level to instantly add intuitive, direct control - Congratulations! You just made your very own 8bit pixel platformer level in less than a minute :) ADD LIFE &amp; BUILD YOUR WORLD - Bring Life to your worlds with Dogs, Wolves, Bears, Cows, Deer or Sabertooth Tigers - Spread foliage and numerous tree varieties to bring beauty to your new world - Decorate with Houses, Castles and Igloos, and create life on your world with AI Humans INTRODUCE TECHNOLOGY... OR DESTROY IT ALL - Utilize tech like Batteries, Crosswires, Resistance, Bulbs, Heaters, Coolers, LEDs and multiple Sensors - Play with Lasers: click to rotate the angle of the light beam and start creating exciting new pixel universes and puzzles! - Destroy everything you can with C4, Meteorites, Nitro, TNT or even a Nuke CAMPAIGNS &amp; DAILY QUESTS - Experience the creation of the universe through a full campaign of 15 levels - Explore a prehistoric world with the Caveman, and fight Bears and Wolves to recover his child in the Caveman Campaign - Learn how to draw pixel art like a real artist in the zen drawing Pixel Art Campaign - Help Fujin, the Ninja of the Wind, collect the Jade Jars and keep them away from evil beings - New Daily Quests, pulled from the best player creations. Challenge the best in the world, or build your levels for a chance to be featured BROWSE THE GALLERY AND SHARE ONLINE - Share your worlds with other players - Search worlds by keyword or by tags (pixel art, music, arcade, technology or landscape) - Filter worlds based on the Newest or Hottest creations - Play the most inspiring worlds and interact with them in various ways - Rate the creations on 5 stars JOIN OUR COMMUNITY OF 745,000 FANS! Each new Update of The Sandbox Evolution will bring even more elements, heroes and campaigns! You’ll see… no one could ever dream a better world than yours! Download The Sandbox Evolution and build your world today!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/466940/header.jpg?t=1513117405",
    "Price": 0.0,
    "Developers": "PIXOWL INC.",
    "Publishers": "PIXOWL INC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_069c4fbdc42e0ec4faf6218026d94aca5ddb6c3a.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_2f45364b60180031d2831bc1949107cd7d862e99.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_2a59012fd37420f1ea713dc04af1fe4cce60fb60.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_9077ef9718bd97cfe5d60650dcc5c9ee5f899e28.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_c73e0500336b415c8c54eac56c71d0413b567332.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_085f45d593504114139bc0573536c3c8ffea0a09.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_dc267b88bc961830913b3b20f5bfb79568f36063.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_10261b312360588206e21907b2a285c0b918fbe9.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_e07ae8f97af4ffd50b951c78e46df13f5a7c10f9.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_d52521a1c1ec6bd035f9686a00489d1f8043ce87.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_5a6371552f03e67ca9c99c290f8ae2553b1573f3.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_5af4e501d5405bf997763b8b175d947002037bf4.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_2fb9e54634af727a6fa71e26233dfbf7c5dd7e88.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_90b9a3543313fff9d1c198a5af4b3761c3828aa1.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_925ce31139e1b22b96ce5eb7b753b1bc4b6ab0e0.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_86f711d30914573e8cd7a35dd3ed81a6f51e77b8.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_cf162d4642a954a53724f5dab3c6687482425c4e.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_efb5e614c132cd9158d3125a1cd32762443a878c.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_a42f6a39f0c2815053ddd3fc58706a605074d80f.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_1d8a46c63ce715a56d1d6a657b73ec7c8e9e2e7f.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_6e591a515e54849f910428f4fa78c43249d58142.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_15af2154cd979d6a331638f5bf7373f5f02403eb.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_56014e677718bd1fa7132cb150118bc408c3ef22.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_202314804eb42db55ead22083a3cdb46aa9133eb.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_940b6b72b010768d628efa009e2a8a49b21351d3.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_d9652869182685fd0608171b02eead2a9272109d.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_186c2b9959f4f26251ecad8b11760591a8e199c5.1920x1080.jpg?t=1513117405,https://cdn.akamai.steamstatic.com/steam/apps/466940/ss_0da1322278b751b7c4ab329e420b9f236ca2f5c0.1920x1080.jpg?t=1513117405",
    "Slug": "the-sandbox-evolution-craft-a-2d-pixel-universe",
    "Meta Title": "The Sandbox Evolution - Craft a 2D Pixel Universe!: Nov 1...",
    "Meta Description": "Looking for information on The Sandbox Evolution - Craft a 2D Pixel Universe!? Check out the release date (Nov 15, 2016), developer insights from PIXOWL...",
    "Alt Text Image": "Official header image for The Sandbox Evolution - Craft a 2D Pixel Universe! game - Steam 466940",
    "Canonical URL": "https://gusku.site/game/the-sandbox-evolution-craft-a-2d-pixel-universe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Sandbox Evolution - Craft a 2D Pixel Universe!\", \"description\": \"Looking for information on The Sandbox Evolution - Craft a 2D Pixel Universe!? Check out the release date (Nov 15, 2016), developer insights from PIXOWL...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"PIXOWL INC.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PIXOWL INC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/466940/header.jpg?t=1513117405\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}