{
    "AppID": 613470,
    "Name": "The Inner World - The Last Wind Monk",
    "Release date": "Oct 20, 2017",
    "About the game": "The flute nose dynasty has been watching over Asposia for centuries on end. In secret, they fill the roly-poly world with light and life. Emil, a trader for odds and ends, has led all the Asposians astray, making them believe that the dynasty is in cahoots with dark forces. Seriously, who knows what this weird family is doing day in, day out? The only one who could stop evil Emil is the heir to the flute nose throne: Robert. He has been petrified for three years, though. With a huge dose of enthusiasm, but little to no idea what he’s actually doing, he embarks on an adventure to find the legendary last wind monk. Of course, he has some great company: Peck, as loyal as he is flightless, and Laura, a rebel who certainly does fly, but only off the handle and who is Robert’s love with a capital L, by the way. A final ray of hope is provided by the mysterious Mama Dola, who seems to know more about Robert’s destiny than Robert himself… Features Experience the fun and moving sequel to “The Inner World” (you don’t need to know the first part!). Save the flute noses from persecution and evil Emil! Hours of fun brainteasers await you: find the last wind monk, cause trouble in a tumble mouse factory, play with Uncle Oboe for some toilet paper in prison, help a desperate Bingo-Pony become happy once again, bring the adorable baby gorf back home and save Asposia! Again! Navigate Robert and Laura, those charming Asposians, through the game. And now you can even operate the nutty pigeon, Peck. There are new sites for you to discover! Including the topsy-turvy airport “Asposia Central”, the quirky tumble mouse farmers and the mysterious Shovel Mountains. Practice new songs on your magic flute nose and activate ancient artefacts. Beautiful hand-drawn adventure for people quick on the draw. Hilarious dialogues in awesome sound quality. The Asposian puzzle help: Provides you with hints when you’re as clueless as Robert – completely spoiler-free of course. Available for most any operating system or console – except the Gameboy!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/613470/header.jpg?t=1644313998",
    "Price": 19.99,
    "Developers": "Studio Fizbin",
    "Publishers": "Headup,Kalypso Media Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/613470/ss_6895e5a623edfaff902800e81f4586b48df64f07.1920x1080.jpg?t=1644313998,https://cdn.akamai.steamstatic.com/steam/apps/613470/ss_3ae18c10a565f8b568109aa86b7f2cd3e162733b.1920x1080.jpg?t=1644313998,https://cdn.akamai.steamstatic.com/steam/apps/613470/ss_2a6c6b161453c8bdd212b3d4ad4e7eb64c06d787.1920x1080.jpg?t=1644313998,https://cdn.akamai.steamstatic.com/steam/apps/613470/ss_0fe4bda3e1bd349a955328394897157fdd584fa6.1920x1080.jpg?t=1644313998,https://cdn.akamai.steamstatic.com/steam/apps/613470/ss_120161836fd4b00cddd16db59f620637c19fe382.1920x1080.jpg?t=1644313998,https://cdn.akamai.steamstatic.com/steam/apps/613470/ss_6715127ef78b97a2c42dea12ecba89af650e1ee9.1920x1080.jpg?t=1644313998",
    "Slug": "the-inner-world-the-last-wind-monk",
    "Meta Title": "The Inner World - The Last Wind Monk: Oct 20, 2017, Studi...",
    "Meta Description": "Looking for information on The Inner World - The Last Wind Monk? Check out the release date (Oct 20, 2017), developer insights from Studio Fizbin, and a...",
    "Alt Text Image": "Official header image for The Inner World - The Last Wind Monk game - Steam 613470",
    "Canonical URL": "https://gusku.site/game/the-inner-world-the-last-wind-monk",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Inner World - The Last Wind Monk\", \"description\": \"Looking for information on The Inner World - The Last Wind Monk? Check out the release date (Oct 20, 2017), developer insights from Studio Fizbin, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Fizbin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup,Kalypso Media Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/613470/header.jpg?t=1644313998\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}