{
    "AppID": 494670,
    "Name": "TransRoad: USA",
    "Release date": "Nov 9, 2017",
    "About the game": "In this exciting new management simulation game by Deck13 Hamburg you will start out as the owner of a small logistics company and cleverly employ all of your managerial skills to lead your business to success. Have you ever wanted to found a company in Kansas City? Or are you more the Vegas type? Whether you prefer the Rocky Mountains or New York feel free to live the American Dream on the realistic map of TransRoad: USA . Choose a headquarter in one of 37 real US cities, buy your first trucks and trailers and hire some drivers. Find the best contracts and the best route combinations to avoid unladen journeys and work to your clients’ satisfaction. You know that trust is maybe the most important good in business? You would like to form a close - and gainful - relationship with your customers? In TransRoad: USA building a good reputation with a great variety of clients all across the USA is the key to success. Deliver orders in time and manage special requests to build up trust and gain access to the real big transport contracts. One US truck is not enough for you? So, how about 100? Manage your growing truck fleet with dozens of vehicles and trailers and send them across the whole USA. Be smart in assigning the right trucks to contracts, avoid unladen journeys and make the real big money! Unlock new types of goods by buying trailer concessions and aquire new clients. Connect key industries with their suppliers in a complex simulated economy. You thought that you had finally mastered your business? But are you prepared for the upcoming economic crisis in the automotive sector? TransRoad: USA will simulate economical KPIs like markets and prices and will always come up with a new event to surprise you. Challenge accepted? Features: Complex company management: Buy and sell trucks and trailers, hire and fire drivers, develop and expand your marketing department, buy trailer concessions, take out and pay back loans, review statistics, and more Truck management: Maintain your trucks, flexibly combine trucks, trailers and drivers to fulfil contracts on time Trailers for heavier loads need more powerful trucks - decide wisely between two-, three- or even four-axle trucks Complex order and customer relations management Many unique clients with several sub-offices 7 different trailer types which can be unlocked by buying new trailer concessions Deliver orders in time or suffer painful penalties Earn the full trust of a customer to unlock profitable recurring orders Meet your opponents - on the map and in the statistics Realistic USA map with more than 37 cities and 19 famous landmarks Freely zoomable map - from full US overview to a close-up of your truck Three game modes: Campaign, Sandbox and Quest mode",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/494670/header.jpg?t=1654107744",
    "Price": 29.99,
    "Developers": "Deck13 Hamburg",
    "Publishers": "astragon Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_9ab27b9f281e75a15826ace3d6d8863acbea612f.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_6ab86a36f7e6bec36ca628a8997e3e4b535e5f02.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_ae32fa44df6dfb6fcd9b74bff230d2169300429b.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_22a6e11b6974a5fb7d3762bf7bcc40035669ae63.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_3340665a20a906c570fda3971f763bc40ca2f4c7.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_0dc83bd8a71039b4acd008b61a9e724c7d3fe03f.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_ea6a1c18b9d296a4b22bc1e8a19c3f17ac1f249d.1920x1080.jpg?t=1654107744,https://cdn.akamai.steamstatic.com/steam/apps/494670/ss_00505b331cdfe1ac31e8aaca80198e873ea665fc.1920x1080.jpg?t=1654107744",
    "Slug": "transroad-usa",
    "Meta Title": "TransRoad: USA: Nov 9, 2017, Deck13 Hamburg and Full Over...",
    "Meta Description": "Looking for information on TransRoad: USA? Check out the release date (Nov 9, 2017), developer insights from Deck13 Hamburg, and a complete game summary.",
    "Alt Text Image": "Official header image for TransRoad: USA game - Steam 494670",
    "Canonical URL": "https://gusku.site/game/transroad-usa",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TransRoad: USA\", \"description\": \"Looking for information on TransRoad: USA? Check out the release date (Nov 9, 2017), developer insights from Deck13 Hamburg, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Deck13 Hamburg\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"astragon Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/494670/header.jpg?t=1654107744\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}