{
    "AppID": 846030,
    "Name": "ΔV: Rings of Saturn",
    "Release date": "Aug 12, 2019",
    "About the game": "You are a captain of an independent asteroid excavation ship, operating in the mineral-rich rings of Saturn - the thickest debris field in our solar system. Your task is to navigate rings, excavate minerals, and sell the ore at the Enceladus station. You can hire and manage your crew who will aid you, update your ship - or switch to a completely new one. You can acquire a bounty hunter licence, explore mysteries or smuggle weapons - but at the core, you are a rock-hopper and rock-hopping is what you’ll spend most of your time at. And since it is the core of this game, we made sure you’ll have a great time flying your ship and excavating. You are no chosen one, the story does not revolve around you - it is driven by the characters you hire and encounter, and each playthrough will play out differently. You can choose to investigate and embrace their lives, or just ignore them. It’s all up to you. Tired of having more Fiction than Science? Here you will find lasers are not visible without a medium, sound does not move through the void of the empty space and every action has an equal and opposite reaction. Thrusters eject gas that heats up and pushes away objects, your reactor is cooled by propellant flowing through it and radiators glow when you pump heat into them. There are no energy shields, teleporters and Heisenberg compensators. No lightspeed, no blasters, and no artificial gravity. Instead, we have fission reactors, thermal rockets, ion thrusters and centrifugal gravity. You'll have hard decisions to make, with no 'best' equipment to answer every need. All technologies are real and there is no technobabble. But it’s still a game and one that is fun to play. ΔV is in active development, with new stable updates coming out each week, and experimental ones getting pushed out daily. Some players call this Proper Early Access, others call it the Golden Age - but in the end, it just means you have a polished game you can play and you can see it grow as you do. Many ideas you’ll find in the game come from players and it is not uncommon to suggest something on our discord - and see it in the game next week. Our player community consists of enthusiasts geeks, engineering nerds and science-fiction nerds, and if that sounds like your kind of crowd - come to our discord , chat with us, and see how the game unfolds in real-time. The event-driven nature of our storytelling means that we can expand our stories and enrich your experience seamlessly - while you are still playing. There is no need to start a new save, new events, equipment and features will just appear as you go. Sounds like your kind of game? Check the demo. It’s free, and your saves will carry over.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/846030/header.jpg?t=1656484814",
    "Price": 9.99,
    "Developers": "Kodera Software",
    "Publishers": "Kodera Software,Kurki.games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_41cbf19ac4207b5064e2c10a881853a007b05e95.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_0affe4f7ade03dbaf79d61c928c2e0bb9fa45666.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_31ebcb9cdafee9e98c9c73f018b40017aabde01e.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_8d5f2b55227b677db85c4701875c4f90262b9dc8.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_fc54e09ccb8f2fbcaf6c3fb3f8dbbd0504fd97e9.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_63fb735d59a18ac3f3a658b41982001e723d47d8.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_dc4a67e575eca7654cf8091304e326998458e0df.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_178f90f85eae8ed784df69f27bd3f82cd914021f.1920x1080.jpg?t=1656484814,https://cdn.akamai.steamstatic.com/steam/apps/846030/ss_cb8b2d947354c684fe42098c6b9607fdf720d059.1920x1080.jpg?t=1656484814",
    "Slug": "v-rings-of-saturn",
    "Meta Title": "ΔV: Rings of Saturn: Aug 12, 2019, Kodera Software and Fu...",
    "Meta Description": "Looking for information on ΔV: Rings of Saturn? Check out the release date (Aug 12, 2019), developer insights from Kodera Software, and a complete game ...",
    "Alt Text Image": "Official header image for ΔV: Rings of Saturn game - Steam 846030",
    "Canonical URL": "https://gusku.site/game/v-rings-of-saturn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u0394V: Rings of Saturn\", \"description\": \"Looking for information on \\u0394V: Rings of Saturn? Check out the release date (Aug 12, 2019), developer insights from Kodera Software, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kodera Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kodera Software,Kurki.games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/846030/header.jpg?t=1656484814\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}