{
    "AppID": 1044200,
    "Name": "Wasteland Survival",
    "Release date": "Jun 3, 2019",
    "About the game": "Wasteland Survival - Post Apocalypse Zombie Survival Adventure Game. It was a peace and happy land. Warm house and billboard lighten up when evening falls, weather forecast telling you if it is suitable for going out though you seldom gave it attention. When the nightmarish Infection burst all of a sudden, spread itself everywhere before the civilization noticed, and turned most human beings into brutal zombies, human ruler seemed to have to release their control and underwent the attack of wild nature the once brothers. Long period of striving must begin. Maybe it’s gonna be long enough for you, one of a few survivors turns the once real history into nonsense in your mind. But wait, will you give up? You know struggle would make a difference. You know you remain reluctant. And only keeping alive can there be a chance for hope, though hunger, thirsty, coldness and zombies will all threat your life, other survivors may also be your enemy in cruel environment. Start to act! Craft weapons first to attack the enemies. Build the strong house and advanced equipment. And find partners to cooperate. Could the mankind society be back? Who knows? Let’s Start the Game and See What Will Come. Tips to Add Your Life Hours: Pick up wood and stones to craft tools. Craft weapons to defend yourself against zombie harassment and rob materials from zombies and wild animals. Keep an eye on your health point HP. Try dispersing your enemies then act, sneak attack causing more damage and making you hard to be found by them. Kill them and you can get close to the boxes for precious survival materials. Learn to cook and make thick cloth to keep you from the hunger and cold. There is nothing more important than to build a comfortable and stable house. Be careful when you see other survivors before you are sure they are kind. Possibly you need to fight. Build the kennel and keep a dog. That may make the crazy zombie world a little warmer. Fix the radio to collect useful information. Craft workbench to upgrade your equipment and weapons. Craft traffic tools to travel to farther places quickly. Once you unfortunately die, get back to your body and collect your items within 10 mins. Explore more open land to find more survival resources. The crazy apocalypse world might be frightening at first, but there is no need to be totally desperate. You can choose to explore and grab enjoyment. Why not? You have nothing to lose. Hope you can strive and survive longer in this Wasteland island before the return of mankind age.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1044200/header.jpg?t=1559632857",
    "Price": 0.0,
    "Developers": "Joyloft Co., Limited",
    "Publishers": "Joyloft Co., Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1044200/ss_4d169f650b257e4cd70431318b7a66ff1a61994b.1920x1080.jpg?t=1559632857,https://cdn.akamai.steamstatic.com/steam/apps/1044200/ss_df03b1c8a0600c77c44a2419da036bc27c2e0413.1920x1080.jpg?t=1559632857,https://cdn.akamai.steamstatic.com/steam/apps/1044200/ss_1a50c3d648773152206818191ad6f6074038dc0c.1920x1080.jpg?t=1559632857,https://cdn.akamai.steamstatic.com/steam/apps/1044200/ss_af53d194b1593d680bca256119e6c5fbc3f53323.1920x1080.jpg?t=1559632857,https://cdn.akamai.steamstatic.com/steam/apps/1044200/ss_e28cfc9015d3ba4b11b825bdc17d8bffdb5dddcf.1920x1080.jpg?t=1559632857",
    "Slug": "wasteland-survival",
    "Meta Title": "Wasteland Survival: Jun 3, 2019, Joyloft Co., Limited and...",
    "Meta Description": "Looking for information on Wasteland Survival? Check out the release date (Jun 3, 2019), developer insights from Joyloft Co., Limited, and a complete ga...",
    "Alt Text Image": "Official header image for Wasteland Survival game - Steam 1044200",
    "Canonical URL": "https://gusku.site/game/wasteland-survival",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wasteland Survival\", \"description\": \"Looking for information on Wasteland Survival? Check out the release date (Jun 3, 2019), developer insights from Joyloft Co., Limited, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joyloft Co., Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joyloft Co., Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1044200/header.jpg?t=1559632857\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}