{
    "AppID": 1765690,
    "Name": "World Wide Hack",
    "Release date": "Dec 22, 2021",
    "About the game": "World Wide Hack is an MMO simulation game about realistic hacking and cybersecurity for the Web, PC, and Mac. It is up to you if you decide to join forces with other hackers to gain control over enemies networks or select the path of dark web creator to gain wealth or you will explore endless networks full of other hackers, human stories and company agendas which you can affect and change the world . You hack into the leaked system of QuanTech company and, with other hackers, reveal their secrets while exploring experimental open-world networks. Manipulate corporations' and inhabitants' lives by hacking their computers, observe the consequences of your actions and decide if you want to protect or exploit this world. Collect the most effective sets of hacking and security tools, gather assets, and improve your computer to hack others, control parts of the network, or create the best websites and tools which will help other hackers and make you rich! Work with others to make your experimental activities useful for your faction and lead with them the world in the right direction. Find out how easily some can manipulate many and how powerful but dangerous control over the information can be... The game is in early access, so please be aware that the game still requires lots of bug fixing, polishing, and content and mechanics of the game can change. Currently, only Windows, Linux, and Web are supported. Later will be added Mac support. Key Features FUN YET AUTHENTIC HACKING Real-life hacking and security tools which are authentic yet modified to be fun and created with several options to strategize DECISIONS AND CONSEQUENCES Use your power to manipulate the life of the game characters and corporates, which have various problems and stories and, in the end, affect the world balance. RICH DYNAMIC STORY WITH REPLAYABILITY Engaging main story and mini-stories in quests bring the player new perspectives on world problems. Discover different views of two factions, finding unique pieces with every gameplay. REALISTIC ATMOSPHERE From the first contact with the QuanTech application, you are pulled into a realistic atmosphere of the corporate environment and their secret quantum experiments, where nothing breaks your immersion. COOPERATE, COMPETE OR GO SOLO Full of puzzles in competitive and cooperative quests, playable in both multiplayer and solo-like gameplay. You will decide if you will involve in PvP and area control fights LEARN ABOUT CYBERSECURITY Experience living futuristic IT world emphasizing the importance of cybersecurity. Find yourself surrounded by other players passionate about technological progress and innovations, learning about the impact of technology on modern society. --- Join our Discord community here: Supported using public funding by Slovak Arts Council (main partner). In case em sent you, answer is: /sys/em.conf",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1765690/header.jpg?t=1652272662",
    "Price": 16.99,
    "Developers": "Lotus Innovations",
    "Publishers": "Lotus Innovations",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_af242c15e0ab13adc98eb6495a50cb1565101ef2.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_fcbed9f28c4047eabfa3d3d271494a401737d85c.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_639b71a3d97f60e4c5b4b1ac674c9532806ba146.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_2c11c6eab783875955a011ec65812e1a629b3992.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_c1ddcdb6eca57c397e8d10f008b6f7ba89be8c1c.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_a563058f938be69be7aab400aa9fe6d251da8bf5.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_8e487e5a2519a51545fa0c16541ddf9f0ac70712.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_715d35d9eadc034ab8ee160bd66c3c41329dfc2c.1920x1080.jpg?t=1652272662,https://cdn.akamai.steamstatic.com/steam/apps/1765690/ss_4c1234b95218f780608514748dac9b6d0861926c.1920x1080.jpg?t=1652272662",
    "Slug": "world-wide-hack",
    "Meta Title": "World Wide Hack: Dec 22, 2021, Lotus Innovations and Full...",
    "Meta Description": "Looking for information on World Wide Hack? Check out the release date (Dec 22, 2021), developer insights from Lotus Innovations, and a complete game su...",
    "Alt Text Image": "Official header image for World Wide Hack game - Steam 1765690",
    "Canonical URL": "https://gusku.site/game/world-wide-hack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World Wide Hack\", \"description\": \"Looking for information on World Wide Hack? Check out the release date (Dec 22, 2021), developer insights from Lotus Innovations, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lotus Innovations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lotus Innovations\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1765690/header.jpg?t=1652272662\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}