{
    "AppID": 1507210,
    "Name": "aerofly RC 8",
    "Release date": "Feb 5, 2021",
    "About the game": "Fly fantastic RC models with this model flight simulator on your PC monitor or stand directly on the runway of the 4D scenery in VR mode. aerofly RC 8 is the first choice for beginners, amateurs and professionals when it comes to learning and improving model flying. The extremely realistic flight physics, fantastic graphics and the option with a VR headset always give you the feeling of being right on the field. Training with the aerofly RC 8 prepares you perfectly for flying model airplanes and also offers incredible fun! Practice air racing, limbo flying, balloon piercing and hovering with the Helitrainer, aerobatics with the Torquetrainer, face landing contests, enjoy slope flying with gliders, fly in chase view through the 4D scenery and much more. Choose from many different model types: Aerobatic models, helicopters, jets, gliders, scale models, indoor models and quadrocopters. Aerofly RC 8 comes with 64 models and 15 sceneries by default. You can expand aerofly RC 8 at any time by getting one of the expansion packs that each feature 90+ new models and 20 new sceneries! FEATURES Choose from over 64 models and 15 sceneries (incl. 4D scenery for VR mode). Incredibly detailed sceneries with full HD display support (monitor). Full VR support (HTC Vive, OCULUS, Windows Mixed Reality). Extremely detailed models with realistic flight physics. Set wind and time of day for optimal training conditions. Many different model types: Aerobatic models, helicopters, jets, gliders, scale models, indoor models and multicopters Support for many USB R/C controllers and USB joysticks. Fly with aerofly RC 8 friends around the world in multiplayer mode. Fly together on the same computer with the Split-Screen feature. Winch-Launch, Hand-Launch, Glider-Towing NOTE: Many of the models (especially helicopters) cannot be controlled reasonably with joystick that has less than 4 axes. Visit our official website for a list of supported input devices or optional hardware to connect your own transmitter. Here is a list of included models: CarbonCore 500x4 Addiction Adrenaline 120 Alpina 5001 Arcus E ASG 29 Baron 58 DHC-2 Beaver Birdy-DS Blade 700x Blade XL Bobcat C160 Transall Caliber Calmato EP 1400 Calmato 60 Sports CAP 232 CL-415 Constellation Cularis Diamond DA-42 DG 808C DHC-2 Beaver Float Plane Robin DR400 Robin DR400 TrueScale Duo Discus XL EC-135 F-16 Funjet Funray Futura GD-8 Goblin 700 Speed H2O E-2C Helios Ju 52 Bo 208 Junior Katana Kinetic 100 Logo 400 MavicPro Aermacchi MB339 MD-11 MD 500E Mig-29 Nuri 163 P-38 Lightning P-51 D TrueScale Pilatus PC-11 Piper J-3 Pitts 2b PT-40 SOXOS 800 Spark Speedwing Sprint SU-29 Swift S-1 T-Rex 600 E Veloxity Vendetta II Wilga Yak 55 Included sceneries are: Augsburg MFCA (Bavaria, Germany) Bennet Flying Field (Nevada, USA) Creek Island - 4D Desert (Arizona, USA) - 4D Muncie AMA Field (Indiana, USA) - 4D Muncie AMA Field (Indiana, USA) - multi-panorama Neuburg/Donau (Bavaria, Germany) Norrison Island - 4D Rocky Lands (Middle West, USA) - 4D Salzburg (Kraiwiesen, Austria) Seiser Alm (South Tyrol, Italy) Sparling Field (Nebraska, USA) St. Gallen (Canton St. Gallen, Switzerland) - 4D Superstition Air Park (Arizona, USA) Torrey Pines (California, USA)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1507210/header.jpg?t=1612778182",
    "Price": 79.99,
    "Developers": "IPACS",
    "Publishers": "IPACS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_b990c961c500d16aeaddaae793563c47f9c45e92.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_19c940b18cf5d86e8e7a140a188feeefed55b7e1.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_7cde559eb09f8fca16c25fa8989de1f2f492f33d.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_259ea217e6a746f9d415459f4f4c15bd9a3c5bb6.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_0cfc3638e2a42bf7e9427a159cf431378e3fbf1b.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_07288b655ccf5d34c4dbc7e86b2e9ba64eed9aff.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_fe83725fa9468078efece57a9e791cd2561eeb10.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_05f04510526b27d7f0c1114be4ddac4532b8c1f0.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_2b7083e8ef7b82ae44ad3b0643095948605c7307.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_cc2590f898fe2ca66fe7186cf281a0dd77bbfe92.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_2fa7244c3f0386d31c7c96d08564567414e358b8.1920x1080.jpg?t=1612778182,https://cdn.akamai.steamstatic.com/steam/apps/1507210/ss_d67c38c9211b00fd05df2bed8e40f98d31ea1ea2.1920x1080.jpg?t=1612778182",
    "Slug": "aerofly-rc-8",
    "Meta Title": "aerofly RC 8: Feb 5, 2021, IPACS and Full Overview",
    "Meta Description": "Looking for information on aerofly RC 8? Check out the release date (Feb 5, 2021), developer insights from IPACS, and a complete game summary.",
    "Alt Text Image": "Official header image for aerofly RC 8 game - Steam 1507210",
    "Canonical URL": "https://gusku.site/game/aerofly-rc-8",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"aerofly RC 8\", \"description\": \"Looking for information on aerofly RC 8? Check out the release date (Feb 5, 2021), developer insights from IPACS, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"IPACS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IPACS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1507210/header.jpg?t=1612778182\", \"offers\": {\"@type\": \"Offer\", \"price\": 79.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}