{
    "AppID": 513320,
    "Name": "ALICE VR",
    "Release date": "Oct 27, 2016",
    "About the game": "Alice VR is a story-driven exploration game rich with puzzles and designed to be a singular VR adventure . Game is inspired by the famous Lewis Carroll's novel 'Alice's Adventures in Wonderland', taking its characters and themes to a new science-fiction setting. Enjoy beautiful graphics, atmospheric, electronic soundtrack and lose yourself in the world of Alice VR. An unexpected malfunction forces your ship’s AI to wake you from the cryo sleep. You have to make an emergency landing on the nearby planet. Your goal there is simple: find enough fuel to escape. This straightforward task gets complicated when you realize that all of the planet’s citizens had disappeared in mysterious circumstances. Alice VR is a fresh take on the classic adventures of Alice in Wonderland. During your playthrough you'll meet familiar characters such as Cheshire Cat or Mad Hatter, but the unique sci-fi setting will make every encounter a big surprise. Will you discover the planet's secret? Are you ready to face the challenges ahead? Follow the white rabbit into the unknown - the future is in your hands. FEATURES Tailor-made for VR from the ground up - no compromises! Gripping story with multiple endings that lets you choose your own path Futuristic graphics and electronic ambient soundtrack composed by the masters of the genre, EON Sounds Over 60 inspired puzzles just waiting to be solved Use the changing gravity to walk on walls and ceilings, play with shrinking and growing devices, and have fun with the physics of the world of Alice VR VIRTUAL REALITY Alice VR works on Oculus Rift, HTC Vive and is also compatible with Razer OSVR. Traditional controllers are supported on Oculus, while both them and motion controllers work on Vive. The game is designed to be the most comfortable VR experience possible. After a lot of research and discussions with gamers, we've learned how to make the game enjoyable even for players new to VR. We want you to feel relaxed through your entire playthrough. Alice VR also works on a regular monitor, without a VR headset. DIGITAL SOUNDTRACK With the game you’ll receive its original, atmospheric soundtrack! Enjoy the full, electronic sound composed by EON Sounds. It makes for an incredible listening both on headphones and big speakers, each time taking you back to the world of Alice VR! DIGITAL ARTBOOK WITH CONCEPT GRAPHICS AND NOTES FROM THE DEVELOPERS Over 40 pages of this digital artbook are filled with concept arts from the game, showing the beautiful and haunting scenery of planet Speculo and its only city: Mirabillis. Each page also contains notes from the developers, telling about their inspirations and the work behind Alice VR. A SET OF UNIQUE WALLPAPERS CREATED BY THE DEVELOPERS Marvel at the high-resolution, picturesque vistas of Speculo sitting right there on your desktop! Every graphic was specially created by the developers to showcase the beauty of this alien planet and the foreboding atmosphere of its lonely city. ADDITIONAL VIDEO CONTENT ABOUT DESIGNING ALICE VR Listen to what the game’s creators have to say about designing a game specifically for VR. What challenges laid before them and where did they drew their inspiration from? This video materials show what was going on behind the scenes of Alice VR. REVIEWS Hardcore Gamer The planet is filled with trippy touches and striking imagery. There’s an adorable robotic companion who pops up from time to time to offer cryptic advice, and tons of interesting environmental details. (...) People who want to explore a striking new land in a relaxing fashion will be in heaven here. Adding to this are some interesting puzzles. An early one that involved rearranging pieces of a coil to reactivate the ships engine was simple and clever. Traversal puzzles that goof around with gravity are a delight to solve as they force a level of three dimensional thinking that is satisfying to solve. VR Focus The world that Carbon Studio has created is a fantastic mix of sci-fi architecture and bizarre dreamlike scenarios. The books inspiration can be seen everywhere, from the mechanical cat that occasionally appears to the out and out absurdly trippy experiences, sharks flying through the sky, menacing black and white forests, tunnels that twist and turn as your viewpoint changes, it’s a visual assault on the senses. Add to that the eerie audio score, and you have quite an engaging mixture. God is a Geek With a five hour playthrough it’s one of the longer story-based VR titles, and with monitor support included, you can always experience the wacky world of Alice VR minus the VR.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/513320/header.jpg?t=1658843794",
    "Price": 9.99,
    "Developers": "Carbon Studio",
    "Publishers": "Klabater",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_d8b3ac4587c828cbbe6217492705907ce5acfcfd.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_48c175d4c36c1e204de7a6f9f873b1da13e3aa4f.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_09249a327e5b17fb88ad5cc55336b96aac775a41.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_685871dc61b6b3c0d7929ee835df55ddd0049f53.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_e36c865607a3ac89cb6d14e6019850f5e7540594.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_0f8bf8fde90810ece7d87fb309bc984e5fbcdca9.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_3d0f83a3db2883b1a09f078b5bf57b98fba01ab8.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_fe4c8b38edb7966756cefc5904644a9da1905ff7.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_bc57fa3b3d5e0a64ddda6d7190f304cda98ff181.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_56cc48c11e40f07a2b9f87909f1d3a99a4d74b24.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_dd0e554e4ab60e6ec5358b847c75f4dd64485599.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_239ce59a79151037d98ad067f00c72bc3fa25940.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_588b7ac9a27a9954d78fd974b215943ab25eca57.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_83515a1e81610dac89e9affdd444fe2f6e8a8004.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_8c93295765ea9a4ed330de3e2434b3550fdb92ca.1920x1080.jpg?t=1658843794,https://cdn.akamai.steamstatic.com/steam/apps/513320/ss_f3b401f1cce3f1fc6280c3c0db8513db8012716b.1920x1080.jpg?t=1658843794",
    "Slug": "alice-vr",
    "Meta Title": "ALICE VR: Oct 27, 2016, Carbon Studio and Full Overview",
    "Meta Description": "Looking for information on ALICE VR? Check out the release date (Oct 27, 2016), developer insights from Carbon Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for ALICE VR game - Steam 513320",
    "Canonical URL": "https://gusku.site/game/alice-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ALICE VR\", \"description\": \"Looking for information on ALICE VR? Check out the release date (Oct 27, 2016), developer insights from Carbon Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Carbon Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Klabater\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/513320/header.jpg?t=1658843794\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}