{
    "AppID": 1307310,
    "Name": "ArrowBall",
    "Release date": "Nov 9, 2020",
    "About the game": "ArrowBall is a Local Multiplayer Sports game where players use explosive arrows and acrobatics to outmaneuver their opponents and control THE BALL on a variety of unique Stages. Overview Challenge your friends in 1v1 or 2v2 competitions where both teams try to get THE BALL into the opposing team's goal to score points. Run, jump, fire explosive arrows, activate Clutch Mode to set up the perfect shot, or launch a devastating Super Arrow. Charge your Super Bar by defending your goal and spend it to activate Clutch Mode or your Super Arrow. Stages Each match takes place on one of 6 different stages with unique layouts and features HighRise - A no-frills stage in the ritzy part of town Arena - A simple, fast-paced stage with a large crowd to cheer you on Laser Dome - A stage that takes place in a swanky night-club, features disappearing blocks and a randomized layout HyperLoop - Play on top of a speeding train as hazards shift the play field around you Factory - Give the workers some entertainment on their lunch break in this stage with conveyor belts and a shrinking goal zone ClockTower - Play on the inside of a clock-tower as the stage rotates around you Super Arrows There are 8 Super Arrows all with unique effects and characteristics. Super Arrows consume a large chunk of your Super Bar so make sure to use them wisely. Warhead - Send THE BALL flying at max speed with a huge explosion Slicer - Cut THE BALL into 2 THE BALLs Repulsor - Create a protective force-field to repel THE BALL Grapple - Hook THE BALL and yank it towards you Smash - Become an arrow and send your body hurling towards THE BALL Volley - Shoot 9 small explosive arrows in an arc Rocket - Control a small rocket-powered arrow Laser - Shoot an arrow that bounces off of walls Clutch Mode You can activate Clutch Mode at any moment to slow down time and line up the perfect shot or make a last-minute save. Clutch Mode consumes your Super Bar as you use it so it won't last forever. Features: Engage in thrilling local multiplayer matches with 2-4 Friends/Enemies Master 8 different Super Arrows with devastating and tricky effects Play Across 6 Stages with unique layouts and mechanics Send THE BALL on the trip of a lifetime into your opponent's goal",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1307310/header.jpg?t=1612238854",
    "Price": 7.99,
    "Developers": "Jaiden Gerig",
    "Publishers": "JELLO Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_9a9bf7c0e1d2c9f3288ab5a2ad6518b02da17ef0.1920x1080.jpg?t=1612238854,https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_67102d72181ec973efdd4122222cd266ed8ce066.1920x1080.jpg?t=1612238854,https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_e4107cef32637ccb9aed4a4f78ac3b72fbe82ada.1920x1080.jpg?t=1612238854,https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_044a830ffc3b4826347c894cd11b16177c7f8eb4.1920x1080.jpg?t=1612238854,https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_07b5f2ecfa40069bb80a7882ab2967964597d17f.1920x1080.jpg?t=1612238854,https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_d7110aad42dd3f934eac6130205d37046ef1c776.1920x1080.jpg?t=1612238854,https://cdn.akamai.steamstatic.com/steam/apps/1307310/ss_d1d6836bd33815035052a614e28f0dc1fee3a2ff.1920x1080.jpg?t=1612238854",
    "Slug": "arrowball",
    "Meta Title": "ArrowBall: Nov 9, 2020, Jaiden Gerig and Full Overview",
    "Meta Description": "Looking for information on ArrowBall? Check out the release date (Nov 9, 2020), developer insights from Jaiden Gerig, and a complete game summary.",
    "Alt Text Image": "Official header image for ArrowBall game - Steam 1307310",
    "Canonical URL": "https://gusku.site/game/arrowball",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ArrowBall\", \"description\": \"Looking for information on ArrowBall? Check out the release date (Nov 9, 2020), developer insights from Jaiden Gerig, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jaiden Gerig\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JELLO Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1307310/header.jpg?t=1612238854\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}