{
    "AppID": 992300,
    "Name": "嗜血印 Bloody Spell",
    "Release date": "Jan 26, 2022",
    "About the game": "Solution to the black screen and crash problem when entering the game: 1. Download and install the K-Lite Codec Pack decoder, the decoder download address: 2. Go to the root directory of BloodySpell and find BloodySpell.exe, right-click on properties, run compatibility mode, and then disable full-screen optimization. 3. Unplug the wireless controller receiver or turn off Bluetooth 4. Check the integrity of the game 5. Upgrade the graphics driver When entering the game, there are problems such as the untouched start game button and UI display error: Step 1: alt f4 to turn off the game. Step 2: Delete the Savesdir folder in the root directory of Bloodthirsty Seal. Step 3: Reopen the game and follow the prompts to download cloud archives. 'Bloody Spell' is a martial arts action role-playing game. The core of the game is battle-oriented, and it combines many fighting elements and systems. Ten years ago, Yejin and his sister Li went to practice martial arts under the sect of Wanfa. Since then, they have been far away from the complicated human world.Ten years later, the mysterious organization that claimed to be Void Legion invaded the sect, and then the world was in chaos, and the brothers and sisters were reinvested in the chaotic world.The sisters who are dependent on each other are taken hostage, and the disciples have been killed in one by one... At the moment when the bloodthirsty spell is opened, Yejin who knows himself, can he fulfill his commitment to everyone? And who is the last to be able to help the building, to save the devastated world? In terms of combat, this game uses multi-weapon switching as the main feature, and for each weapon in different speeds, power and positioning, design a variety of different skills, a variety of skills combo, greatly enhance the game cool feeling, excellent hitting and handling feel make it even better. The highlight of the level design is the form of random combination, that is, the scenes, monsters, equipment, and configuration of the props that the player is reborn after death are different from before, so that the game presents diverse characteristics, increasing the level variables and The game is fun. The 'Bloody Spell' system is that, Yejin uses special skills in the body's evil spirit curse to achieve various effects such as violent walking, bullet time, roar breaking, assassination execution, counterattack and blood return, etc., which is to enhance the character's attack power and auxiliary combat. And to simplify the battle, add to the character and weapon attributes, and some even play a role in determining the battle. The system makes the combat part more flexible, more selective and versatile, while also ensuring the smoothness and refreshment of the battle. In addition, many interesting side quests, diverse survey elements, and mini games interspersed with them greatly expand the game's fullness and playability. We hope to see ten different players in ten different ways. If the enemy's threat is too great, you can use the bloodthirsty skills, assassinations, flying props, scene agencies to destroy them. Finally, please be careful in this Survive in the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/992300/header.jpg?t=1658720400",
    "Price": 24.99,
    "Developers": "艺龙游戏",
    "Publishers": "艺龙游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_04f87dc4dc00a9a84ccaae2029fc27e98ba37320.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_73522530daaccfc5811c0ad0b7c18dca92e5ed2b.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_26b6017564d5ec5452bd450c8f3c27a0b97da74f.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_04076af4ce197b111d9f63329f7e2e461b689d09.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_c1d5a23e1cf5c9c281ec9bf010edd53ea805e5ba.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_a9cee508745350162cf6736a155f32eb1f793bfc.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_875a9d2635963b62ae8d3fd075a9a34892afdb3a.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_364a681c0abb46ee4fdfbb06c458716dac62aacd.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_bce3699a264c4ff8d7f767b78810ef9dacd258e5.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_f814f7588ed201516f4cc8845fbfad4e69ddb0b6.1920x1080.jpg?t=1658720400,https://cdn.akamai.steamstatic.com/steam/apps/992300/ss_32986e9fe64d0d89188a3d4cf1c5050ea05b1076.1920x1080.jpg?t=1658720400",
    "Slug": "bloody-spell",
    "Meta Title": "嗜血印 Bloody Spell: Jan 26, 2022, 艺龙游戏 and Full Overview",
    "Meta Description": "Looking for information on 嗜血印 Bloody Spell? Check out the release date (Jan 26, 2022), developer insights from 艺龙游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for 嗜血印 Bloody Spell game - Steam 992300",
    "Canonical URL": "https://gusku.site/game/bloody-spell",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u55dc\\u8840\\u5370 Bloody Spell\", \"description\": \"Looking for information on \\u55dc\\u8840\\u5370 Bloody Spell? Check out the release date (Jan 26, 2022), developer insights from \\u827a\\u9f99\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u827a\\u9f99\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u827a\\u9f99\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/992300/header.jpg?t=1658720400\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}