{
    "AppID": 815420,
    "Name": "Bomb Hunter MT",
    "Release date": "Apr 3, 2018",
    "About the game": "Game Description:  Bomb Hunter MT is a game about people and all kinds of beasts. The battle takes place on an island of 4 square kilometers and players need to use their own. Skills circulate with these dinosaurs. You can slay them with their battlefield skills, and you can kill them with guerrilla warfare. Once the battle begins, there is no Any place is safe because they will catch up with you quickly. Developer Quick Record: Bomb Hunter MT is a small game about the free battle between humans and various beasts. The protagonist uses weapons and skills to conquer various beasts if you like simple About running, jumping, free fighting games, you can try this game. BlockGames is a very passionate independent game studio. This is not a huge game with hours of content, we want to You are provided with a simple game that allows you to feel the joy of free movement, the high adrenaline moments and the thrill of fighting. This game offers you: Ability to move freely through various skills and equipped with bombs and spears as weapons A 4 square kilometre island map 3 difficulty modes + one kill mode + entertainment mode 5 freely configurable numbers of beasts Very suitable for occasional play for a while, enjoy the time of free exercise. The game has added Tyrannosaurus Rex. The Tyrannosaurus Rex has a wide range of movement speeds, which can be accelerated in a short period of time. It has a strong attack power and can attack the enemy. The huge body shape can bring earthquake effects. It will occasionally make a roar and cause tremors. It can absorb the energy of the character, making it difficult for the character to get out of the way. The Tyrannosaurus Rex is divided into three kinds of difficulty, and the skill will increase as the difficulty increases. Operation Description: W,S,A,D keys Move forward and backward Space key Jump (Hold the Space key to make the jump farther) E key Drag chain 1 (accelerates the character but consumes energy) Q key Drag chain 2 (accelerates the direction specified by the character but consumes energy) R button behind the bomb Right mouse button Left mouse button Javelin throw javelin 1,2,3 keys Speed ​​gear P key display punctuality L key hides the heart Mouse wheel Adjust camera distance ESC key to display the configuration menu (configure the type and number of dinosaurs) C key Switch camera angle 2019/12/18 Update notification: 1. Some time ago, we added forest scenes in the game, which was intended to provide more rich game experience for players, but we ignored the performance problem, a huge number of tree models, which aggravates the operation burden of the system, and then leads to the serious decline of the operation efficiency of the game. The players also have a lot of complaints and dissatisfaction. Here we say sorry to you! presentAfter we cancel the forest scene and further optimize the performance of the original scene and system, there should be no more problems that cannot run smoothly. And in the futureIn the update, we will bring more interesting content to you on the premise of ensuring good performance of the game. 2. Since there is no limit to the number of NPC (dinosaur) generated in the old version of the game, when the number of NPC generated in the scene is too large, it is inevitable that the game will not run smoothly due to jamThe new version limits the number of dinosaurs generated. The number of dinosaurs is limited to 100, and more than 100 parts willCannot build again. 3. Added 2 beauties. 4. Added random challenge mode, in which the system will generate a random number of random species of dinosaurs to participate in the battle. 2020/10/14 Anti epidemic action: To prevent novel coronavirus pneumonia from spreading on the island, we distributed masks for each role.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/815420/header.jpg?t=1645301291",
    "Price": 0.49,
    "Developers": "FreeCube",
    "Publishers": "FreeCube",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_be4dbe8fda75ccab9db19e3ca2ee0e7ad6a49c24.1920x1080.jpg?t=1645301291,https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_f0cca8301f6500ee1291126e2c391d75fd2274c0.1920x1080.jpg?t=1645301291,https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_210f2afc74f0aeeb213ba29c9935a790a932787c.1920x1080.jpg?t=1645301291,https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_85a54977687c0432fede817de031305ab1bffde2.1920x1080.jpg?t=1645301291,https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_73c3a298ef08ad95f6cea663c3d02da76e2270dc.1920x1080.jpg?t=1645301291,https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_26c34fbcade05c89ca8419c94a3225d59c3123f7.1920x1080.jpg?t=1645301291,https://cdn.akamai.steamstatic.com/steam/apps/815420/ss_f938c8fa6b43d1f1911e6f3b6be99c9cffc2f484.1920x1080.jpg?t=1645301291",
    "Slug": "bomb-hunter-mt",
    "Meta Title": "Bomb Hunter MT: Apr 3, 2018, FreeCube and Full Overview",
    "Meta Description": "Looking for information on Bomb Hunter MT? Check out the release date (Apr 3, 2018), developer insights from FreeCube, and a complete game summary.",
    "Alt Text Image": "Official header image for Bomb Hunter MT game - Steam 815420",
    "Canonical URL": "https://gusku.site/game/bomb-hunter-mt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bomb Hunter MT\", \"description\": \"Looking for information on Bomb Hunter MT? Check out the release date (Apr 3, 2018), developer insights from FreeCube, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"FreeCube\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FreeCube\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/815420/header.jpg?t=1645301291\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}