{
    "AppID": 1047750,
    "Name": "Chili The Chipmunk Pinball Adventure",
    "Release date": "May 2, 2019",
    "About the game": "In anticipation of the up coming game from N J FOX 'Chili the Chipmunk' Chili the chipmunks pinball adventure brings back the classic arcade style pinball in full 3D. As part of the all new N J FOX Arcade line of freeware games, Chili the chipmunks pinball adventure will have you coming back for more and more. Features include: Camera, lighting, audio, and most important controller options to give the player the ability to play their way. Loose track of the ball? use the cameras switch or follow modes to keep the ball in check, like pinball the old fashioned way leave the camera on default mode where you can see the whole table at once. Like a light show? change the light setting to follow - mode and watch the ball wizz around the table at high speed, missing the arcade atmosphere change to studio mode and play like your in a real arcade. Maybe you prefer day light to indoor spot light if so keep the daylight mode for a more unique take on pinball. Love like or hate the music and or sound effects you can turn them on or off in the music and Sound FX settings. Which controller is more comfortable, X Box one or PlayStation 4? this is what the controller type option is for, keep the default controller type A for X Box controls or switch to controller type B and play with play station controls if you prefer, No key board or mouse is required to play the game. The evil millionaire Caching and his associate Dr Sni have kidnapped Chilis animal friends including Koda her best friend. Help chili navigate round 3 exciting pinball tables, score points, bounce off everything including the glass it self and rescue chilis animal friends to find and confront Caching and rescue Koda or try and get the high score and set your self a world record can you reach the legendary 999,999,999 High Score. Rescue an animal friend and they'll join you on the table and score you more points, the more animal friends you free the more points you can rack up at once. Play again and again rescue chilis friends and beat the high score in this fast passed pinball adventure game that'll keep you coming back for more. NOTE: This game does not need the key board or mouse to play however you will need the mouse to operate the unity game launcher we apologise for this inconvenience and hope it doesn't ruin your experience, please enjoy the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1047750/header.jpg?t=1556866488",
    "Price": 0.0,
    "Developers": "N J FOX",
    "Publishers": "N J FOX",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1047750/ss_b855f3a42e06a26cbb6a081ba86f87139a61ef56.1920x1080.jpg?t=1556866488,https://cdn.akamai.steamstatic.com/steam/apps/1047750/ss_0eab819d26df70571e8ce391f1d2d97e7a7d0507.1920x1080.jpg?t=1556866488,https://cdn.akamai.steamstatic.com/steam/apps/1047750/ss_d32b839334047bb6937eeefa0e64fe2a5e0bf057.1920x1080.jpg?t=1556866488,https://cdn.akamai.steamstatic.com/steam/apps/1047750/ss_5a04806c68a8d8183cec427626d509061fa04df5.1920x1080.jpg?t=1556866488,https://cdn.akamai.steamstatic.com/steam/apps/1047750/ss_04c8a7e0c4ddc246fe5a23e72fa795db9d260982.1920x1080.jpg?t=1556866488",
    "Slug": "chili-the-chipmunk-pinball-adventure",
    "Meta Title": "Chili The Chipmunk Pinball Adventure: May 2, 2019, N J FO...",
    "Meta Description": "Looking for information on Chili The Chipmunk Pinball Adventure? Check out the release date (May 2, 2019), developer insights from N J FOX, and a comple...",
    "Alt Text Image": "Official header image for Chili The Chipmunk Pinball Adventure game - Steam 1047750",
    "Canonical URL": "https://gusku.site/game/chili-the-chipmunk-pinball-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chili The Chipmunk Pinball Adventure\", \"description\": \"Looking for information on Chili The Chipmunk Pinball Adventure? Check out the release date (May 2, 2019), developer insights from N J FOX, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"N J FOX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"N J FOX\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1047750/header.jpg?t=1556866488\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}