{
    "AppID": 776000,
    "Name": "Choice of the Vampire",
    "Release date": "Feb 9, 2018",
    "About the game": "Slake your thirst, without becoming a monster! Blessed with the blood-soaked gift of immortality, will you tend the flock of humanity—or twist it to your whims? When a brash young country butts heads with a brash young vampire, who will come out ahead? Choice of the Vampire is an epic, four-volume, 850,000-word interactive novel, by Jason Stevan Hill. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. Begin your vampiric journey in Volume One, The Battle of New Orleans , set in antebellum Louisiana, where your reputation is only as good as your skill with a sword or dueling pistol. Volume Two, The Siege of Vicksburg, continues into the Civil War, at the site of one of the war's most grueling and decisive battles. When a strange vampire seeks to disrupt the Confederate defenses, will you help him, hinder him, or consume him? In Volume Three, The Fall of Memphis (available as DLC) you find yourself in Memphis, as ex-Confederates loot the public coffers and dismantle the advances of Reconstruction. In Volume Four, St. Louis, Unreal City (now available as DLC), explore the 1904 World's Fair, which promises to be the party of the century. As your character concludes their first century of unlife, they must navigate the waters of industrialization and urbanization. The excesses of capital and rapid industrialization is producing a new class of educated, militant workers who are ready and willing to stand up to the nation's elite. Meanwhile, the vestiges of the Confederacy systematically dismantle Reconstruction, while simultaneously pitting European immigrants against the Chinese and the formerly enslaved. And yet, national figures such as JP Morgan and Jay Gould are forcing their will upon St. Louis all the way from New York. Still, the vampires of the Society must adapt and thrive, caught between centuries of experience and the rapidly changing world around them—a world that would destroy them utterly if they were to be revealed. When one of their number permanently gives into their Beast and begins hunting other vampires, the Society of North America are thrust into disarray, and you must decide what is worth dying for. Play as male or female; gay, straight, or pan; cis or trans. Exploit the domains of humanity: become a patron of the arts, an advocate of the temperance movement, an underworld boss, an investor in industry, or a visionary of the world of the unseen. Choose your prey: gamblers, artists, financiers, or workers. Hold your head up high and feed only from animals—or drink the heartsblood of your fellow vampires with gusto. Survive the machinations of your fellow vampires, the malice of the mortals you have wronged, and the hunters who want to see your kind destroyed. Unravel the mysteries of vampirekind. Meet famous historical figures—and drink their blood. Can the American Republic satiate you, or will you drain it dry?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/776000/header.jpg?t=1604023847",
    "Price": 5.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/776000/ss_8dbeb0dea26c8cff760ba60c58c30b20d4ba78a6.1920x1080.jpg?t=1604023847,https://cdn.akamai.steamstatic.com/steam/apps/776000/ss_72740b5c5fa3714d16df07fe5763b9d5985aecf2.1920x1080.jpg?t=1604023847,https://cdn.akamai.steamstatic.com/steam/apps/776000/ss_5ddc1c4e7f12668c3e9446350e93b70276d44018.1920x1080.jpg?t=1604023847,https://cdn.akamai.steamstatic.com/steam/apps/776000/ss_779417bb7f0ffa39e0fd8bf0329bd698db59c3c1.1920x1080.jpg?t=1604023847,https://cdn.akamai.steamstatic.com/steam/apps/776000/ss_4967b3927a6eb60054f9f58a687f08abf607b513.1920x1080.jpg?t=1604023847",
    "Slug": "choice-of-the-vampire",
    "Meta Title": "Choice of the Vampire: Feb 9, 2018, Choice of Games and F...",
    "Meta Description": "Looking for information on Choice of the Vampire? Check out the release date (Feb 9, 2018), developer insights from Choice of Games, and a complete game...",
    "Alt Text Image": "Official header image for Choice of the Vampire game - Steam 776000",
    "Canonical URL": "https://gusku.site/game/choice-of-the-vampire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Choice of the Vampire\", \"description\": \"Looking for information on Choice of the Vampire? Check out the release date (Feb 9, 2018), developer insights from Choice of Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/776000/header.jpg?t=1604023847\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}