{
    "AppID": 8800,
    "Name": "Civilization IV: Beyond the Sword",
    "Release date": "Jul 24, 2007",
    "About the game": "Sid Meier's Civilization IV®: Beyond the Sword is the second expansion pack for Civilization IV - the 2005 PC Game of the Year that has become a worldwide hit. The expansion focuses on the time periods after the invention of gunpowder and delivers 11 unique and challenging scenarios created by the development team at Firaxis as well as esteemed members of the Community. Beyond the Sword also includes ten new civilizations, sixteen new leaders, five new wonders, and a variety of new units that offer even more fun and exciting ways for players to expand their civilization's power as they strive for world domination. Expanded Epic Game : Adds a massive increase of new units, buildings, and technologies to the epic game with a tremendous amount of effort focused on the late game. New Game Scenarios : 11 new scenarios custom-designed by the team at Firaxis and some members of the Fan Community. New Civilizations : 10 new civilizations, such as Portugal, Babylonians, and Netherlands and their associated unique units and buildings. More Civilization Leaders : Sixteen new leaders, both for the new civilizations as well as additional leaders for existing civilizations, including Hammurabi of the Babylonians, Abraham Lincoln of the United States, and Sitting Bull of the Native Americans. Corporations : A new game feature similar to religion allows players to found companies and spread them throughout the world. Each corporation provides benefits in exchange for certain resources. Espionage : Now available earlier in the game, this feature offers players many new ways to spy on opponents, stir citizen unrest and defend government secrets. Events : New random events - such as natural disasters and pleas for help or demands from their citizens - challenge players with obstacles that must be overcome for their civilization to prosper. New Wonders : Five new wonders await discovery, including the Statue of Zeus, Cristo Redentor, the Shwedagon Paya, and the Mausoleum of Maussollos. Expanded Space Victory : Winning the race to Alpha Centauri will now require more strategic planning and tactical decision making. Apostolic Palace : The United Nations is available earlier in the game, providing a way to win a diplomatic victory earlier. In addition, new resolutions expand the available diplomatic options. Advanced Starts : A major fan request, this new feature enables players to 'buy' components of a custom-tailored empire and begin play in the later part of the game, allowing one to experience many of the new features of the expansion in a shorter amount of time. Advanced AI : The greatly-enhanced AI now relies more on smart play and less on handicap bonuses to remain competitive, providing a more consistent challenge throughout the course of the game, both economically and militarily. The ways in which the AI attempt to achieve victory have also been expanded.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/8800/header.jpg?t=1573063843",
    "Price": 9.99,
    "Developers": "Firaxis Games",
    "Publishers": "2K",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002320.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002321.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002322.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002323.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002324.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002326.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002327.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002328.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002329.1920x1080.jpg?t=1573063843,https://cdn.akamai.steamstatic.com/steam/apps/8800/0000002330.1920x1080.jpg?t=1573063843",
    "Slug": "civilization-iv-beyond-the-sword",
    "Meta Title": "Civilization IV: Beyond the Sword: Jul 24, 2007, Firaxis ...",
    "Meta Description": "Looking for information on Civilization IV: Beyond the Sword? Check out the release date (Jul 24, 2007), developer insights from Firaxis Games, and a co...",
    "Alt Text Image": "Official header image for Civilization IV: Beyond the Sword game - Steam 8800",
    "Canonical URL": "https://gusku.site/game/civilization-iv-beyond-the-sword",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Civilization IV: Beyond the Sword\", \"description\": \"Looking for information on Civilization IV: Beyond the Sword? Check out the release date (Jul 24, 2007), developer insights from Firaxis Games, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2007\", \"author\": {\"@type\": \"Organization\", \"name\": \"Firaxis Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2K\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/8800/header.jpg?t=1573063843\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}