{
    "AppID": 872230,
    "Name": "Destiny of Altrais",
    "Release date": "Oct 18, 2018",
    "About the game": "Story • The Land of Altrais was being united by a caring and benevolent king whose only hope was to see a Golden Age. In his travels the king met many races and worked tirelessly to help them understand the need for peace. Working with the Ancients he was able to foresee a great evil coming to tear the kingdom apart. While developing a mass tablet transportation system the evil was sowing the seeds of discontent and hatred. • Unbeknownst to the king, the Evil in the East had its claws in all of the races one way or another and was just waiting for the right moment to strike. Whispers of this deceit reached the king who decided to try and defeat this evil alone before it would tear the kingdom of Altrais apart. Sadly he failed in his endeavor and the hope of a Golden Age for Altrais died with him…or so was thought. • Many years later the kingdom of Altrais has been split into 7 distinct races who barely acknowledge that there ever was a chance for peace. The races all vie for the crown of Altrais, but none have been able to locate it. • Legends speak that the king of old wore armor that was built by each race. This armor was imbued with such power that helped calm the minds of the people and see reason in working together. The armor is thought to be in the possession of the Evil in the East who now seeks the crown to fully seat themselves as ruler of Altrais. • You are but a squire for the King of the Humans and have been a servant all your life. Your family was killed in a tragic fire while working for the King and so he felt it his obligation to take you in and raise you. However, he could not let the other races think him weak so he could not take you as his son and heir. For what king deserves to rule when he cannot even have his own blood on the throne. • Evil continues to roam the land of Altrais and threaten the very existence of the races. Rumors speak that the Evil in the East has redoubled its efforts to secure the crown. However, even quieter rumors have started to be heard the Evil in the East does not even control the Armor of Legend and seeks to destroy all races that may be hiding it. Combat • Turn based battle system with up to 4 total members on the combat screen. • Various elements and weapon types causing the player to choose how they want to do battle. • Specific weapons and armors to specific hero classes will allow the player to develop the fighting team how they choose. • Enemy levels with scaling to allow a continual feeling of progress and difficulty regardless of where the player adventures. • Up to 36 total followers allowing for multiple variations of playstyles and party dynamics. • Random encounters that are specific to terrain and vary on creature type and difficulty. Questing • 7 races providing a total of 150 quests and multiple additional side quests all being contained within an easy to use Journal System • Open world adventuring and questing allowing the player to decide how they want to play and which races they choose to help. • A blueprint system to allow the player to upgrade their City of Altrais into something more suitable to their questing style. • Consequences for choices reminding the character that they are to be a force of good for the Kingdom of Altrais, since evil is already around.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/872230/header.jpg?t=1543421395",
    "Price": 2.99,
    "Developers": "MAGES",
    "Publishers": "MAGES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_f971e219880ac81ff8b40fefc9f66fccfc2aeab8.1920x1080.jpg?t=1543421395,https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_2519ea23eef4722e9e57478821559134e197c1a9.1920x1080.jpg?t=1543421395,https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_7aaecaeae4a089bfa8f6554c7eab6806c9c51118.1920x1080.jpg?t=1543421395,https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_8927fba8f945f295167754339e5a70d9f9a4fb78.1920x1080.jpg?t=1543421395,https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_8ec959ace22cfe2416dbb72be425cc180e25b20d.1920x1080.jpg?t=1543421395,https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_07d3087ca870475f3c7291601fa44d413af3778c.1920x1080.jpg?t=1543421395,https://cdn.akamai.steamstatic.com/steam/apps/872230/ss_21b2bb12c067f5130ad7fc837775e5bda25d71af.1920x1080.jpg?t=1543421395",
    "Slug": "destiny-of-altrais",
    "Meta Title": "Destiny of Altrais: Oct 18, 2018, MAGES and Full Overview",
    "Meta Description": "Looking for information on Destiny of Altrais? Check out the release date (Oct 18, 2018), developer insights from MAGES, and a complete game summary.",
    "Alt Text Image": "Official header image for Destiny of Altrais game - Steam 872230",
    "Canonical URL": "https://gusku.site/game/destiny-of-altrais",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Destiny of Altrais\", \"description\": \"Looking for information on Destiny of Altrais? Check out the release date (Oct 18, 2018), developer insights from MAGES, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/872230/header.jpg?t=1543421395\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}