{
    "AppID": 338000,
    "Name": "Echoes+",
    "Release date": "Jan 15, 2015",
    "About the game": "Echoes+ is an intense retro action space shooter created with App Game Kit 2. It will test your reactions and concentration levels to the max! Fight your way through wave after wave of neon coloured space enemies, leveling up your score multiplayer and shields as you go. The onslaught just keeps on building with new challenges the further you progress. You'll need to be super focused if you want a place on the global high score table, one blink and it can be all over! Echoes+ is a showcase game made using App Game Kit 2 (AGK). You can learn more about App Game Kit 2 here: / Echoes mode Echoes mode consists of 10 levels of blasting action, each introducing a new enemy with different strengths &amp; weaknesses. When you get hit you lose energy but it can be replenished by collecting green power ups. Getting hit may also downgrade your weapon, but act fast and you can power it back up again. Increased kills means more power-ups. Time Attack Just want a quick blast? Then try time attack. In this mode you have to score as many points as you can in 3 minutes. You get unlimited energy but being hit incurs a points penalty. Tips The secret to a high score is collecting multipliers. The more enemies you kill the more multiplier power-ups will be dropped. Shooting stars will always drop a score multiplier. Warning! Points lost if hit are linked to the score multiplier. Survivor Mode This is all about how long you can survive without taking a hit. The score is irrelevant! Tips Your weapon will power up over time automatically. Time is your priority so shooting enemies might not always be the best approach. Destroying planets might be risky but they drop shields which will protect you for 10 seconds, invaluable in this game mode. Classic Mode This has a simpler game play and modified controls making it more like the 80's retro games. Tips Use smaller and more controlled movements than in other game modes. Try and stay away from the edge of the play area whenever possible. Listen out for the warning sounds that mean a saucer is approaching. Meteor Storm Mode This challenges you to fend off increasingly frequent and dense waves of meteors. Destroy the golden meteors &amp; collect score multipliers. Tips Your ship starts with a fixed amount of energy which cannot be replenished. Getting hit reduces your energy but also causes you to drop some of your score multipliers. Your weapon power is fixed and cannot be increased. Asteroid Belt Mode Here you face snakes of energy that increase in both quantity and length at each new level. Tips Your ship starts with a fixed amount of energy which cannot be replenished. The score multiplier is linked to the number of asteroid belts at the start of the current level. Your weapon power is fixed and cannot be increased. Zoo Trials (zoots) These are a series of additional challenges. Each zoot can be attempted on any of the four difficulty levels, with harder difficulties contributing more towards your total completion percentage; Easy = 1%, Normal = 2%, Hard = 3% and Insane = 4% Only the hardest difficulty achieved counts towards your total, so for the ultimate 100% score you need to complete each of the 25 zoots on insane difficulty. Zoots can only be completed in specific game modes so make sure you check these on the zoo trials menu screen. The Pause screen shows your progress towards and zoots. If you enjoyed Echoes+ then you might also like 1982! /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/338000/header.jpg?t=1560447308",
    "Price": 0.0,
    "Developers": "Binary Zoo",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/338000/ss_5f78700896cd20db9b2593f8af5f6a1d57637089.1920x1080.jpg?t=1560447308,https://cdn.akamai.steamstatic.com/steam/apps/338000/ss_325c5289792411ae9e0712da14a4f577d378f59a.1920x1080.jpg?t=1560447308,https://cdn.akamai.steamstatic.com/steam/apps/338000/ss_edee0e18d9fd1f15b4afa70005ae26e5c288c3c3.1920x1080.jpg?t=1560447308,https://cdn.akamai.steamstatic.com/steam/apps/338000/ss_ebcd9006339c8a4bcf6420eacca71b4e4e15cc04.1920x1080.jpg?t=1560447308,https://cdn.akamai.steamstatic.com/steam/apps/338000/ss_d8e0e09f477b04814017f3782e9bc7d090fa7ac1.1920x1080.jpg?t=1560447308",
    "Slug": "echoes",
    "Meta Title": "Echoes+: Jan 15, 2015, Binary Zoo and Full Overview",
    "Meta Description": "Looking for information on Echoes+? Check out the release date (Jan 15, 2015), developer insights from Binary Zoo, and a complete game summary.",
    "Alt Text Image": "Official header image for Echoes+ game - Steam 338000",
    "Canonical URL": "https://gusku.site/game/echoes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Echoes+\", \"description\": \"Looking for information on Echoes+? Check out the release date (Jan 15, 2015), developer insights from Binary Zoo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Binary Zoo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/338000/header.jpg?t=1560447308\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}