{
    "AppID": 683000,
    "Name": "Evasion",
    "Release date": "Oct 8, 2018",
    "About the game": "Experience the next generation of VR combat with Evasion, an intense sci-fi bullet-hell shooter. Play solo or team up to save an embattled colony from swarms of lethal Optera. Run, dodge, and unleash devastating Surge Attacks as you fight your way through an action-packed story campaign. Featuring four player classes, a challenging Survival Mode and free move locomotion, Evasion is the ultimate wish fulfilment for sci-fi shooter fans. Explosive VR Combat Evasion will deliver cinematic destructible environments and intense bullet hell action. Players will team up and fight their way through maelstroms of bullets while diving for cover. The ‘Swarm A.I’ enemy behaviour system adds a new level of tension, making tactical movement and teamwork critical to your squad’s survival. Experience the charge of heroism as you and your team run and gun to complete vital objectives, rescue one another and overcome deadly ambushes. Built For Locomotion Evasion will empower gamers to walk, run and dive into battle with unparalleled locomotion freedom. Evasion’s goal is to deliver on the promise of free movement that VR gamers want. Players can choose from highly crafted locomotion modes designed for FPS gameplay that can be customized to your own play style and comfort level. Fight Solo or Team Up Make your mark on the battlefield and choose from four hero classes including the death-dealing Striker, indispensable Surgeon, calculating Engineer or valiant Warden. All four classes have their own unique strengths, weapons &amp; ultimate abilities. Players can combine class types to create the most effective team. From compelling mission objectives, to powerful player class combinations and blockbuster-quality FX and destruction, Evasion is poised to become the next must-own VR shooter. Evasion Key Features: Action packed and high-intensity sci-fi shooter gameplay Co-operative Multiplayer Campaign Total immersion with ‘next-gen’ full body avatars powered by IKinema Authentic FPS locomotion options for the most realistic VR shooter experience Four unique Hero Classes with powerful custom weapons and signature abilities. Best in-class physics &amp; destruction, enhanced for the Intel® Core™ i7 processor Spectacular Unreal Engine visuals &amp; 3D Spatial Audio brings combat to life Coming to HTC Vive &amp; Oculus Rift in Fall 2018",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/683000/header.jpg?t=1574729582",
    "Price": 19.99,
    "Developers": "Archiact",
    "Publishers": "Archiact",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/683000/ss_d7f453af70e6140ff8631f9f72650c03f866e747.1920x1080.jpg?t=1574729582,https://cdn.akamai.steamstatic.com/steam/apps/683000/ss_bbd4b09b93bfcf73a394dad9a0859bb12b0d0a5e.1920x1080.jpg?t=1574729582,https://cdn.akamai.steamstatic.com/steam/apps/683000/ss_bca357696973ad6dd7387ea4e434b17be5ec613d.1920x1080.jpg?t=1574729582,https://cdn.akamai.steamstatic.com/steam/apps/683000/ss_0081cf71b6c40983805f168c31a4f0a5b10deb18.1920x1080.jpg?t=1574729582,https://cdn.akamai.steamstatic.com/steam/apps/683000/ss_933b2ffbe90884823c60dd945f5bb4920ae0c9fb.1920x1080.jpg?t=1574729582",
    "Slug": "evasion",
    "Meta Title": "Evasion: Oct 8, 2018, Archiact and Full Overview",
    "Meta Description": "Looking for information on Evasion? Check out the release date (Oct 8, 2018), developer insights from Archiact, and a complete game summary.",
    "Alt Text Image": "Official header image for Evasion game - Steam 683000",
    "Canonical URL": "https://gusku.site/game/evasion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Evasion\", \"description\": \"Looking for information on Evasion? Check out the release date (Oct 8, 2018), developer insights from Archiact, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Archiact\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Archiact\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/683000/header.jpg?t=1574729582\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}