{
    "AppID": 416670,
    "Name": "Gunslingers",
    "Release date": "Dec 17, 2015",
    "About the game": "Closing The game will be closed 30-DEC-2019 A unique turn-based tactical game in a Space Western setting. Direct your mercenary in team PvP battles. Pick one of 5 classes and choose from a large assortment of armor, weapons, and equipment. The more battles you fight, the cooler your mercenaries become, the faster they run, the better they shoot, and (most importantly) the more abilities they learn – abilities that can dramatically change the course of the battle. Use attribute points and carefully choose your equipment to match your mercenary to your unique playing style. Play on your own and join random battles. Or, team up with your friends in a clan and take part in tournaments. key Game Features Quick turnbased gameplay. Each team's players take their turns simultaneously, resulting in a fast-paced game with tactical interaction between team members. 5 player classes. Command up to 5 mercenaries, each with their own skills and abilities – their own strengths and weaknesses. 2 modes of combat. In Skirmish mode, simply kill your enemies and protect your allies to gain victory. In Capture mode, you also need to capture and defend control points. Clan tournaments. Every few days, tournaments are held to determine the strongest clan! More Info About A Mercs 5 mercenary classes are available in the game: stormtrooper, scout, sniper, medic, and robot. Each merc has his or her own skills, weapon, and playing style. John the sniper, armed with a sniper rifle, deals immense damage to his target at a large distance. The sniper can also cover an ally who is under threat of being attacked. Lira the scout, on the other hand, uses subterfuge and cunning. She's a scout and saboteur who can sneak up on the enemy's rear quickly and unnoticed, revealing the enemy's position to her allies and weakening and wounding him before nimbly hiding herself from his retribution. Her weapon is an SMG. Next is the robot Bobby, a universal battle machine with a tough metal hull and armed with a machine gun. Bobby has two modes: defensive mode, where he can cover allies with his powerful shield, and attacking mode, where he turns into a weapon of mass destruction. The medic is an essential unit on the battlefield. Her name is Leto, and she's not afraid to take aim at her allies – with a syringe gun full of healing nanobots or a stimulator that can refill action points. An efficient medic can make a good team unstoppable! Last of all is the stormtrooper Greg. He is a tough guy armed with an assault rifle. His job is to break through the enemy's ranks, deal them damage, interfere with their activity, and all the while survive enemy attacks. You can pick any merc to bring into battle and develop all of your mercs in parallel.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/416670/header.jpg?t=1589376811",
    "Price": 0.0,
    "Developers": "Kovalim",
    "Publishers": "Kovalim",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_b2141fdddbf6c81481917798f5b856c493163d85.1920x1080.jpg?t=1589376811,https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_56598cee5c5e2c767c57f588900fdd6fc6af68f3.1920x1080.jpg?t=1589376811,https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_04096dace113310cb1f3edcd95ae38740dfd7966.1920x1080.jpg?t=1589376811,https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_e69c647cfc843bb146ec754f11a757cb70006ddb.1920x1080.jpg?t=1589376811,https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_2b5e65a7e17c789c693cd2a6c5447de28c5fa67c.1920x1080.jpg?t=1589376811,https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_5dca65c045cee1b892dc2e160d92de105e6edf94.1920x1080.jpg?t=1589376811,https://cdn.akamai.steamstatic.com/steam/apps/416670/ss_f9646986135015c4b52beea798a61e166c3a91d6.1920x1080.jpg?t=1589376811",
    "Slug": "gunslingers",
    "Meta Title": "Gunslingers: Dec 17, 2015, Kovalim and Full Overview",
    "Meta Description": "Looking for information on Gunslingers? Check out the release date (Dec 17, 2015), developer insights from Kovalim, and a complete game summary.",
    "Alt Text Image": "Official header image for Gunslingers game - Steam 416670",
    "Canonical URL": "https://gusku.site/game/gunslingers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gunslingers\", \"description\": \"Looking for information on Gunslingers? Check out the release date (Dec 17, 2015), developer insights from Kovalim, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kovalim\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kovalim\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/416670/header.jpg?t=1589376811\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}