{
    "AppID": 367520,
    "Name": "Hollow Knight",
    "Release date": "Feb 24, 2017",
    "About the game": "Hollow Knight Expands with Free Content Godmaster - Take your place amongst the Gods. New Characters and Quest. New Boss Fights. Available Now! Lifeblood - A Kingdom Upgraded! New Boss. Upgraded Bosses. Tweaks and Refinements across the whole game. The Grimm Troupe - Light the Nightmare Lantern. Summon the Troupe. New Major Quest. New Boss Fights. New Charms. New Enemies. New Friends. Hidden Dreams - Mighty new foes emerge! New Boss fights. New Upgrades. New Music. Brave the Depths of a Forgotten Kingdom Beneath the fading town of Dirtmouth sleeps an ancient, ruined kingdom. Many are drawn below the surface, searching for riches, or glory, or answers to old secrets. Hollow Knight is a classically styled 2D action adventure across a vast interconnected world. Explore twisting caverns, ancient cities and deadly wastes; battle tainted creatures and befriend bizarre bugs; and solve ancient mysteries at the kingdom's heart. Game Features Classic side-scrolling action, with all the modern trimmings. Tightly tuned 2D controls. Dodge, dash and slash your way through even the most deadly adversaries. Explore a vast interconnected world of forgotten highways, overgrown wilds and ruined cities. Forge your own path! The world of Hallownest is expansive and open. Choose which paths you take, which enemies you face and find your own way forward. Evolve with powerful new skills and abilities! Gain spells, strength and speed. Leap to new heights on ethereal wings. Dash forward in a blazing flash. Blast foes with fiery Soul! Equip Charms! Ancient relics that offer bizarre new powers and abilities. Choose your favourites and make your journey unique! An enormous cast of cute and creepy characters all brought to life with traditional 2D frame-by-frame animation. Over 130 enemies! 30 epic bosses! Face ferocious beasts and vanquish ancient knights on your quest through the kingdom. Track down every last twisted foe and add them to your Hunter's Journal! Leap into minds with the Dream Nail. Uncover a whole other side to the characters you meet and the enemies you face. Beautiful painted landscapes, with extravagant parallax, give a unique sense of depth to a side-on world. Chart your journey with extensive mapping tools. Buy compasses, quills, maps and pins to enhance your understanding of Hollow Knight’s many twisting landscapes. A haunting, intimate score accompanies the player on their journey, composed by Christopher Larkin. The score echoes the majesty and sadness of a civilisation brought to ruin. Complete Hollow Knight to unlock Steel Soul Mode, the ultimate challenge! An Evocative Hand-Crafted World The world of Hollow Knight is brought to life in vivid, moody detail, its caverns alive with bizarre and terrifying creatures, each animated by hand in a traditional 2D style. Every new area you’ll discover is beautifully unique and strange, teeming with new creatures and characters. Take in the sights and uncover new wonders hidden off of the beaten path. If you like classic gameplay, cute but creepy characters, epic adventure and beautiful, gothic worlds, then Hollow Knight awaits!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/367520/header.jpg?t=1625363925",
    "Price": 14.99,
    "Developers": "Team Cherry",
    "Publishers": "Team Cherry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_5384f9f8b96a0b9934b2bc35a4058376211636d2.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_d5b6edd94e77ba6db31c44d8a3c09d807ab27751.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_a81e4231cc8d55f58b51a4a938898af46503cae5.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_62e10cf506d461e11e050457b08aa0e2a1c078d0.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_bd76bd88bc5334ee56ae3d5f0d8dec4455e8e3b8.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_33a645903d6dd9beec39f272a3daf57174a6cc26.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_47f3523dbea462aff2ca4bc9f605faaf80a792b2.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_92c7e8f34c00bdb455070ecdd5b746f0d2f6d808.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_946e83ea924eff46a93e14e841bdbb1accd1654c.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_b17396ebcbef87cd016c433927bb2dd7edb17660.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_f1f594e1057a124d289a5905b53b5a0f820982c0.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_2329fe632e788efd9ece9dcfc98c0ea723ac0d04.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_fbe692d154a3d9dd627966d5445c4647ae0f71ce.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_1552562bd322fb94fd8c5a6595e75f1e6808db41.1920x1080.jpg?t=1625363925,https://cdn.akamai.steamstatic.com/steam/apps/367520/ss_5478c9192023a3b3e438c030caa0809b62523587.1920x1080.jpg?t=1625363925",
    "Slug": "hollow-knight",
    "Meta Title": "Hollow Knight: Feb 24, 2017, Team Cherry and Full Overview",
    "Meta Description": "Looking for information on Hollow Knight? Check out the release date (Feb 24, 2017), developer insights from Team Cherry, and a complete game summary.",
    "Alt Text Image": "Official header image for Hollow Knight game - Steam 367520",
    "Canonical URL": "https://gusku.site/game/hollow-knight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hollow Knight\", \"description\": \"Looking for information on Hollow Knight? Check out the release date (Feb 24, 2017), developer insights from Team Cherry, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Cherry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team Cherry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/367520/header.jpg?t=1625363925\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}