{
    "AppID": 37980,
    "Name": "Jewel Quest Pack",
    "Release date": "Aug 24, 2009",
    "About the game": "Includes the first three titles in the the ultimate jewel matching adventure, Jewel Quest ! Rupert and Emma have settled down and opened a museum to display their many artifacts. While playing with a mysterious jewel board, their daughter unknowingly pops open a secret compartment. Suddenly, the air is filled with spores, and Natalie's vision fades. Desperate to save their daughter's sight, Rupert and Emma search the globe in search of the fabled Golden Jewel Board, rumored to hold the antidote that will cure her, but does it even exist? Guided by cryptic clues left by a shady stranger, Rupert and Emma encounter new challenges; wild monkeys to capture, powerful pearls that can alter the jewel boards, and head-to-head competition that pit you against renowned experts, Hani and Sebastian. Time is running out! It's up to you to follow the clues and find the cure! 200 levels in 11 regions 30 different jewels Visit every continent, while working on quests to earn jewels and artifacts Search for the fabled Golden Jewel Board Join Professor Pack on the ultimate jewel matching adventure across the world's richest continent. The dangers of the safari, The history of the Zimbabwe ruins and the majesty of Victoria Falls await your discovery, filled with puzzles of skill and twists, while surrounded by gorgeous dynamic backdrops and animation. Get swept away by the heart pounding soundtrack as you're immersed in realistic and authentic African settings. Discover an amazing new element of fun with the Exclusive Dueling Jewels Tournament Play: Pit your jewel matching skills against others around the world! Play against other players, or be matched with a computer opponent! Embark on a thrilling journey in a story filled with adventure, love, and betrayal that changes with every replay! Map your progress through 180 challenging puzzles Encounter buried relics, cursed items, and mind-boggling boards Stunning graphics, captivating music, and wild sounds Get special hints to help you with your battle against time Explore the ancient ruins of Mayan civilization while discovering hidden treasures and priceless artifacts. In this unique new take on the classic-style matching game, you must rearrange valuable relics to turn sand tiles into gold. When all of the tiles in a puzzle board are golden, you win! As you venture deeper into the jungle, you will encounter increasingly difficult puzzles containing secret twists, cursed items, and buried artifacts. Earn the respect of your fellow archaeologists and collect oodles of treasure and jewels!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/37960/header.jpg?t=1447352428",
    "Price": 19.99,
    "Developers": "iWin",
    "Publishers": "iWin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_e6b45075c0be275f7becce84baa1142faf6c1ad5.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_57c750aff2b3b111915d49dc6282cc41f0b662e2.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_2c0b6539c6cdb5cf24aeaa9859cf6aade75a7c40.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_25836a7da6119b0691a4f035b11dc659607befd3.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_4b406d176f2ec4f4dcd28780e1ac8b056014a9e8.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_09baca984d0fccc627553ad8f1985ef935bb07fc.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_bef167ec5379118418d6c7c89c85c71e15aa1ed2.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_715824dac5f65046a5654b51a54eb30c0ba992ea.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_4d35b9794d071f5e26d87b11fef2ebfce4ab2b57.1920x1080.jpg?t=1447352428,https://cdn.akamai.steamstatic.com/steam/apps/37960/ss_0e4294b20491c9232cf5a475976f9f6f99415c93.1920x1080.jpg?t=1447352428",
    "Slug": "jewel-quest-pack",
    "Meta Title": "Jewel Quest Pack: Aug 24, 2009, iWin and Full Overview",
    "Meta Description": "Looking for information on Jewel Quest Pack? Check out the release date (Aug 24, 2009), developer insights from iWin, and a complete game summary.",
    "Alt Text Image": "Official header image for Jewel Quest Pack game - Steam 37980",
    "Canonical URL": "https://gusku.site/game/jewel-quest-pack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jewel Quest Pack\", \"description\": \"Looking for information on Jewel Quest Pack? Check out the release date (Aug 24, 2009), developer insights from iWin, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 24, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"iWin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"iWin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/37960/header.jpg?t=1447352428\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}