{
    "AppID": 1533960,
    "Name": "Liars Village",
    "Release date": "Apr 13, 2021",
    "About the game": "Welcome in the Liars Village experience! Land with all the survivors on an island where you will have to accumulate resources, money and act strategically to lead your team to victory! At the start of the game, each player randomly obtains a job, a role and house keys. The roles are divided into two categories: Innocents and Criminals . As Innocent , investigate to find the Criminals and complete missions to escape them! Each successful mission will grant you mission points . When all Innocents reach 100 mission points , the Rescuer begins construction of the rescue boat allowing all Innocents to leave the island. As Criminal , you will have to discreetly eliminate the Innocents . By completing the missions, you will be able to validate Criminal levels to unlock valuable resources and benefits. By completing your job tasks during your working hours, you earn money that you can spend in the supermarket to buy items, food or weapons. Interact with a multitude of objects present on the island Lock the front door of your house or your garage door. You can also pick or break locks. Use the bed, chairs, toilet, and kitchen equipment to meet your needs (energy, bladder and hunger). Buy resources at the supermarket by interacting with the items on the shelves. Main features Multiplayer : Host your own games and play with up to 12 players . Personalization : Personalize your character by choosing his gender, his physical characteristics and his outfits. An interactive island : An interactive environment with 4 habitable houses , a police station , a prison , a supermarket and a seaport . Interact with most of the island elements, rocks, trees and many more! Game modes : Configure your games by selecting the options and the desired game mode (new game modes will appear with the updates). Economy : Everyone starts the game with a sum of money. Players can buy and sell resources at the supermarket as well as trade between players. On the island of Liars Village, some resources are scarce and everyone can set their prices. Managing your budget is very important in order to equip yourself, meet your basic needs and obtain the necessary resources for your missions. Many jobs available : Among more than ten jobs, randomly play a policeman, a journalist, a lumberjack, a scientist, a hunter or even a hacker! Games : List of games classified by language and possibility to quickly join your friends thanks to Village Code . Written and voice communications : Communication is essential in Liars Village. As long as a game is in progress, proximity communication is used. A journalist can be heard on all in-game televisions, radios and tablets. Use radios to communicate between players on a desired frequency. A random frequency is sent to every Criminals at the start of the game. Communicate using this frequency to find out who is Criminal with you. Tablet : At the start of the game, you get a tablet. Access various applications, some of which are reserved for certain jobs. Get the list of events planned on the island, read your messages or see your character's detailed health status. Craft : In house garages, use workbenches to craft items from a list of craftable items. Performance mode : when you activate it, this mode reduces graphics quality as much as possible and makes adjustments in order to favor performance. Progress and statistics : Find all the information about your games from your profile page. Each game played earns you experience points allowing you to level up. Steam advantages : Use a single platform to access the game and stay informed of news, events and updates. The benefits are detailed below. Steam advantages Your in-game account is linked to your Steam account. No registration required! Access the game directly from your Steam library. Join and invite your Steam friends from within the game! Guaranteed high quality in-game voice communications with Steam Voice. Follow the news of the game by joining the official Discord server where you will find all the informations about the game. Important places on the island Your home In each game, you randomly live alone or with other players. As Criminal , you also get the keys to a second house. Most of the furnitures in the houses are interactive. Use these interactions to cook, meet your needs, watch TV or craft items in the garage. You can lock your front door and garage door so only players that have the keys of the house can enter. The doorbell at the entrance warns residents of your presence. By having the necessary tools, it is possible to pick or break a door lock to unlock it. Use the house chest to store items. Police station Elections for the mayor take place at the police station. Each candidate for the election of mayor of the village can make a speech in order to be elected. Police officers can use the lockers and all the equipment of the police station. Thanks to the tablet, police officers can also obtain the results of fingerprint analyzes and information on the player's homes. Prison The police officers can imprison players in the prison. The prisoners have access to a schedule of their day with hours of walks and meals where the cell gates open. It is possible for a prisoner to escape by finding tools in the prison that will allow him to hook the entrance doors of the prison. In emergency meetings that can be triggered at any time by players, the player with the most votes can be sent to jail. Supermarket The supermarket will allow you to buy all kinds of resources while stocks last. Selling resources is also possible. For example, a lumberjack can sell his wood to the supermarket, which will supply the supermarket's wood stock. The guards have access to the surveillance room of the supermarket with the possibility of seeing the island's cameras in real time as well as recordings at different times of the day. Seaport The port is where you will need to go to leave the island. You can also find the Rescuer there with whom you can chat to get your mission rewards. When 100 mission points are obtained by the Innocents , the Rescuer begins the construction of the rescue boat. You can also fish at the port for different types of fish. Board the rescue boat to leave the island and escape the criminals . Laboratory Scientists can make drugs in the lab. Each drug provides temporary benefits: boost of energy, endurance or even the level of hunger. Scientists also use medic kits to heal damage suffered. The hunting area In this area, you can hunt many animals. These animals will allow you to obtain meats that you can cook or sell. There are 3 types of animals: passive, semi-aggressive and aggressive. Jobs Each job has a succession of steps that will allow you to earn money. Your working hours are defined each day at midnight. Jobs can serve as a cover for Criminals . Each player can decide to reveal his job or make believe that he has another one. Take advantage of the possibilities of your job to complete your final objective, help and make your team win! You will also earn mission points as Innocent and Criminal levels as Criminal . Police officer Objective: Investigate to eliminate or imprison the Criminals . He can : Analyze the fingerprints taken Imprison players Check players Handcuff players He benefits from a resistance bonus to the damages suffered thanks to his bulletproof vest. A Criminal police officer can use his weapon to eliminate players and can imprison Innocents . He can also give wrong informations about the results of fingerprint scans to eliminate suspicion about himself or another Criminal . Having access to the prison, he can easily free an imprisoned Criminal . Journalist Objective: To ensure the communication of essential informations. He can : Use the camera to make lives. The live is broadcast on televisions, radios and tablets. Send flash news. Make forecasts on a player's job. A Criminal journalist can transmit wrong information and spread rumors in the interest of Criminals . Vigil &amp; Prison Guard Objective: Perform rounds to monitor players and study their behavior. He can : Access the surveillance room: viewing the cameras of the prison, the supermarket or the police station. Check players. His energy level decreases less quickly. A Criminal vigil can take advantage of his night shift to break into houses or eliminate Innocents . By accessing the marked spots, he can easily eliminate a player in an out of sight area. Locksmith Objective: Easily access all areas of the island. He can : Repair broken locks. He benefits from a success bonus in hooking and breaking locks. A Criminal locksmith can break locks more easily to gain access to desired locations. He can break a lock to enter a closed room, eliminate the player(s) in the room and then repair the lock to lock the door so the dead bodies are harder to find. Lumberjack Objective: Supply the supermarket with wood. He can : Chop down trees to get wood that you can sell or use in crafting many resources. He benefits from a wood harvest bonus: 1 additional unit for each harvest. His endurance level decreases less quickly. A Criminal lumberjack can quickly obtain useful wood in the craft of many resources (weapons, tools ...). Selling a large amount of wood can earn him a lot of money. This job is a good alibi no matter where you are: trees are present all over the island. Hunter Objective: Hunt animals present in the hunting area. He can : Hunt animals and obtain meats that they can then cook or resell. His level of hunger decreases less quickly. His endurance level decreases less quickly. A Criminal hunter can discreetly eliminate players on the pretext that the player has been killed by an animal. Electrician Objective: Check and repair electrical installations. He can : Repair sabotaged electric meters or electric pylons. Install a new electric meter if the current meter is too damaged. The electrician can know the exact electricity consumption of a house thanks to his application. A player's tablet charges while in a house. It is therefore possible, thanks to the power consumption, to know in which rooms the players are located in real time. A Criminal electrician can sabotage electricity meters or electricity pylons to cut off electricity in a certain area. When entering through the garage at night, it may be useful to consult the real-time power consumption of the house to know which room(s) the inhabitants are currently in. Use your job to pretend to fix while you are sabotaging. Hacker Objective: Hacking electronic devices to obtain informations that can then be shared with your team. He can : Intercept messages and send messages pretending to be another player Simulate receiving notifications Rig the elections of the mayor by adding 1 additional vote to a candidate Unlock a prison cell A Criminal hacker is very valuable because he can give information, help his allies and manipulate Innocents with complete discretion. Scientist Objective: Craft medicine and heal injured players. He can : Craft different types of drugs (care, boost in hunger level, endurance ...) Heal a player who has suffered damages Obtain informations on the dead bodies of the players (approximate time of death, type of damages suffered, weapon used ...) A Criminal scientist may conceal informations following the study of a dead body to protect himself or an ally. He can also provide his allies with the drugs needed to complete their missions. Miner Objective: Supply the supermarket with metals. He can : Collect metals from rocks which you can resell or use in crafting many resources. He benefits from a metal harvest bonus: 1 additional unit for each harvest. His endurance level decreases less quickly. A Criminal miner can quickly obtain metals useful in the craft of many resources (weapons, tools ...). Selling a large amount of metals can earn him a lot of money. This job is a good alibi no matter where you are: rocks are present all over the island. Many new jobs will be added with the updates ! The mayor of the village He is elected by the players during day 2. In the event of a tie, the mayor is elected at random among the players with the most votes. Without votes, the mayor is elected randomly from among all the players. If the mayor is imprisoned or killed, a new mayor is randomly elected. It is also possible to become mayor by unlocking skills or obtaining a high Criminal level . He can : Use double voting in emergency meetings. Use the keys of the police station, the supermarket and the prison. Know the current planning of the prison. Send flash news. He gains 5 skill points when he is elected. Skills During the game, you can unlock skills that will help you save time, maintain your discretion or give you certain advantages. Obtaining skill points is defined as follows: 1 point per purchase or sale at the supermarket (valid once per minute) 5 points per end of job service 2 points per easy mission accomplished 4 points per normal mission accomplished 6 points per hard mission accomplished 2 points per aggressive animal killed 1 point per need (energy, bladder, hunger) increased to 100% 1 point by eliminating vote at a meeting 5 points for a player elected mayor",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1533960/header.jpg?t=1648578203",
    "Price": 6.99,
    "Developers": "Leonard Jouen",
    "Publishers": "Leonard Jouen",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_4a744c23cde737c16f8daaadde4bef9484cd36b9.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_253c4eb46c7807c906b18b700be3fd3bb4284a3d.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_fdcb6eb8c44660c51a36410a5b5f06a3ba2926f0.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_016dafebcb5d74376fc784f34fd70610a99b5c4c.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_c57e003d0480d5fa8d708e89bc6ea545bef23ca8.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_93bf21f2f6c38b166043fda8459b19b4b30086f9.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_77a7e5c21d96899dfb6820e257015784226e9878.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_113403d6b53a5d3ac9c1a8476a49228c3e67bf24.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_c3359e46ebfc465ff27940f0243d0b56fc38b39f.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_6de16bd8b6630aad9faf518d5bd24bee4eb46ae4.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_db7176ba83dc26719de59ea4e6e60f5f956628eb.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_b378e1026234bc007ccd57b6f5905519921c3dc0.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_51f916af2ce847a52ea744fb8850666d6d227ef3.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_485744a4fc7642cd549a677fef7f0758ca20fc86.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_8e258ddddcc0318545a4b0bd4f972fa22a88579c.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_e7f80028b24a1ff3c4c8f8bbf4bb53e9d5bda03c.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_fdf4e84ea884cabe01a0ad90e95bbf5b2fc105a8.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_6e5ce0c2414cdb265e7822eb1105ccf82421836b.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_0c181b16b6088b892baf6acdb3d3bbe3bcf8feba.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_5f7b32a6b9e6569e90b3063ee4d1b284c45e15cb.1920x1080.jpg?t=1648578203,https://cdn.akamai.steamstatic.com/steam/apps/1533960/ss_4c6bf304f8af8d39a5ac6bd372aeac53f155b443.1920x1080.jpg?t=1648578203",
    "Slug": "liars-village",
    "Meta Title": "Liars Village: Apr 13, 2021, Leonard Jouen and Full Overview",
    "Meta Description": "Looking for information on Liars Village? Check out the release date (Apr 13, 2021), developer insights from Leonard Jouen, and a complete game summary.",
    "Alt Text Image": "Official header image for Liars Village game - Steam 1533960",
    "Canonical URL": "https://gusku.site/game/liars-village",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Liars Village\", \"description\": \"Looking for information on Liars Village? Check out the release date (Apr 13, 2021), developer insights from Leonard Jouen, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Leonard Jouen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Leonard Jouen\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1533960/header.jpg?t=1648578203\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}