{
    "AppID": 495820,
    "Name": "Lil Tanks",
    "Release date": "Apr 4, 2017",
    "About the game": "Lil Tanks is a side-scrolling shooter with RPG elements that puts you in control of a prototype tank -- defending humanity from the alien scourge known as The Cuur. As Earth's last hope, you must upgrade your tank with unique power-ups and blast the aliens back to where they came from! Level up by destroying The Cuur and earn powerful permanent upgrades. Unlock multiple tanks by completing objectives and finishing the campaign. The survival of the human race rests in your hands! - Campaign Take control of Lil Tanks and defend the Earth from The Cuur. Pilot your tank through several unique locations around the world and stop the alien scourge from terraforming our planet! - Hardcore Want even more of a challenge? Try Hardcore mode! Unlock medals by completing objectives throughout the campaign. Each medal provides an additional challenge to make your experience tougher. Before each stage, choose which medals you wish to activate. Test your skill with one medal, or several at a time. Customize your playthrough! - Endless You are pitted against an endless onslaught of Cuur. See how long you can survive against wave after wave of alien invaders! - Boss Training Practice exterminating your favorite bosses while gathering intel and creating strategies for future encounters. The Cuur come in all shapes and sizes! Battle over 20 different enemy types as you protect Earth from the invaders! Earn XP for every enemy you defeat. Unlock permanent upgrades to shielding and firepower as you level up! Having trouble getting through a difficult section? Keep at it! Your level does not reset when you die. Come back stronger each time and let The Cuur have it! In addition to your tank's upgrades, be on the lookout for powerups dropped by enemies. Equip Wide Shot, Flame Shot or the Chaser to boost your tank's weaponry. You can also swap powerups with your partner at any time during your mission! Don't want to head into battle alone? Battle The Cuur with another player piloting your indestructible companion tank to help clear the way! Defend the planet from the Cuur assault! Travel the globe to seek out and destroy the invaders. Look out for environmental hazards along the way! Lil Tanks will feature an original soundtrack from Kelly Warner! Kelly is a musician and producer of custom music and sound design for creative video and visual/interactive media. His original music has been featured on MTV, Comedy Central, The CW Network, NBC, BTN, ESPN and more. His productions have also been incorporated in many US brands and organizations; which include the Ohio State University, and commercial tourism of Ohio and West Virginia. Kelly also has a creative presence with internet media and apps for iOS and Android. His work can be heard in the acclaimed Armored Aces WWII sim game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/495820/header.jpg?t=1602020704",
    "Price": 4.99,
    "Developers": "Lead Money Games",
    "Publishers": "Lead Money Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_93c5acbf05c55a905f058d19d973dda03325a501.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_66ebd6955b6bddc23096aac7fcb45fc2c6e75030.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_4771975ca02f11c596a621601e2c76331c77ccac.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_185931d538e599066267900b4716125c3e514592.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_2b568618acba2394589ecd46b82e439823b82087.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_7b5510469258398a990342ce7c0c8703cf96e514.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_4a3e5db8e3ede0318788e32d413674383f0e342e.1920x1080.jpg?t=1602020704,https://cdn.akamai.steamstatic.com/steam/apps/495820/ss_472049d3433266cd82129043bcd80ac879955b2a.1920x1080.jpg?t=1602020704",
    "Slug": "lil-tanks",
    "Meta Title": "Lil Tanks: Apr 4, 2017, Lead Money Games and Full Overview",
    "Meta Description": "Looking for information on Lil Tanks? Check out the release date (Apr 4, 2017), developer insights from Lead Money Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Lil Tanks game - Steam 495820",
    "Canonical URL": "https://gusku.site/game/lil-tanks",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lil Tanks\", \"description\": \"Looking for information on Lil Tanks? Check out the release date (Apr 4, 2017), developer insights from Lead Money Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lead Money Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lead Money Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/495820/header.jpg?t=1602020704\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}