{
    "AppID": 717560,
    "Name": "Lucifer Within Us",
    "Release date": "Oct 15, 2020",
    "About the game": "Everyone is a suspect. Unmask their lies. Choose one to purge. Lucifer Within Us asks you to solve player-directed, story rich mysteries with your wits, making observations and deductions in a world of daemonic possession and invasive soul-scanning technology. From the creator of The Shrouded Isle. Investigate timelines. Question your suspects. Watch their movements and testimonies closely, as the reconstruction may be based on lies. Use contradictions and clues to form your own hypothesis. Who is lying and why? Who is possessed? You must decide what is the truth for yourself, based on the evidence presented. Real mystery-solving. No hidden plot twists, no QTEs, no random puzzles or mini-games, just you and the information. In all 3 cases, don’t just act like a detective -- BE a detective. Finding the murderer will require true understanding of the case, not just following the story. Banish daemonic A.I. Enter the minds of citizens to gain insight into what they don’t want you to know. Dig through their subconscious and accuse the guilty in order to cast out their daemons, for the good of the Inquisition. Any damage done to a citizen’s psyche as a result of quarantine, exorcism, or rehabilitation is a consequence of their own immorality. Expose the False Utopia. Through centuries of indoctrination, humanity is taught to think pure thoughts and speak true words, untainted by falsehoods and delusions. Yet beneath this facade of purity, you find dark desires stir deep within people’s hearts, yearning for release. As a digital exorcist working for the Church of Ain Soph’s Inquisition, it is your duty to find sinners and ensure continued harmony. Digital daemons corrupt the network cause human hosts to act on secret desires and sins, even unto murder. Discover the One Truth to determine which citizens are infected and exorcise the possessed. Built on the rubble of the Old World, the last human city has become a utopia of progress, digitization, and art. The Church guides citizens towards advancement and Truth with the aid of a digital consciousness network. Use all of the tools at your disposal to find the truth, wherever it may hide… and beware the lies you tell yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/717560/header.jpg?t=1649861812",
    "Price": 19.99,
    "Developers": "Kitfox Games",
    "Publishers": "Kitfox Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/717560/ss_1039c561453f1069cf1d9d349bf438a03132d722.1920x1080.jpg?t=1649861812,https://cdn.akamai.steamstatic.com/steam/apps/717560/ss_f1c3379d273c470e6c5fd07bcc37992a50097148.1920x1080.jpg?t=1649861812,https://cdn.akamai.steamstatic.com/steam/apps/717560/ss_88541d90b320e1abdd77f3cd1dfbbd8397243a0e.1920x1080.jpg?t=1649861812,https://cdn.akamai.steamstatic.com/steam/apps/717560/ss_488d7fc294a91add51022f33a18ab3f94629520d.1920x1080.jpg?t=1649861812,https://cdn.akamai.steamstatic.com/steam/apps/717560/ss_69ece0df78843c923b6a758136f6528ca0f48059.1920x1080.jpg?t=1649861812",
    "Slug": "lucifer-within-us",
    "Meta Title": "Lucifer Within Us: Oct 15, 2020, Kitfox Games and Full Ov...",
    "Meta Description": "Looking for information on Lucifer Within Us? Check out the release date (Oct 15, 2020), developer insights from Kitfox Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Lucifer Within Us game - Steam 717560",
    "Canonical URL": "https://gusku.site/game/lucifer-within-us",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lucifer Within Us\", \"description\": \"Looking for information on Lucifer Within Us? Check out the release date (Oct 15, 2020), developer insights from Kitfox Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kitfox Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kitfox Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/717560/header.jpg?t=1649861812\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}