{
    "AppID": 1470320,
    "Name": "Malmyr",
    "Release date": "Dec 21, 2020",
    "About the game": "Overview: Malmyr is a story based game about building and maintaining production chains. You will have to control where your resources are diverted to and ensure that there are enough workers to fulfill your missions. Don't be fooled by the simple and stylized look of Malmyr - The game is getting very complex, very fast. 12 magical runes enable you to make your buildings more efficient. The functionality of the Runes was heavily expanded with the Runemagic 2.0 patch. New ways to use and combine the runes to a total of 18 runewords will allow new strategies for the hardest missions Malmyr has to offer. You are sent to the forgotten lands of Malmyr by your King to expand the kingdom's territory and exploit Malmyr's precious ore deposits. While doing so you find out about the sinister fate of the Dwarves that once inhabited the continent. You will have to protect the kingdom from suffering the same! About us: We are two very passionate german devolpers who always wanted to make games. We decided to take a leap of faith and go for it. When buying this game you should keep that in mind. Malmyr is made with great love for detail and we hope that we can offer unique challenges with each mission, but it cannot offer hundreds of hours of playtime like bigger games with actual funding and a budget can. While we cannot promise to expand the game's content and currently have no plans to do so beyond Runemagic 2.0, we will continue to improve the game and fix bugs. Ziegler gamedev has the vision 'Making dreams come true'. We feel that part of that also is making the best game we can for our players. Mamlyr is... Inspired from games of our past and present - Like The Settlers, Anno and Factorio. 12 story based missions - You need to find a good strategy to complete them and handle the hazards thrown at you. Unique obstacles and ambience for missions - Each mission was made to give you a different experience: Sometimes more relaxing, sometimes more challenging than the previous one. Complex production chains - They will get longer and will need a wider variety of resources to function. A different take on resource transportation - You will not just connect buildings with a road, set up a transportation route or build conveyor belts. You will have to manage and optimize each piece of road manually. Over 45 different resources - Global resources like coin and food, building resources like wood and bricks and commodities for selling like jewelery. A range of over 70 buildings - From woodcutter's huts, to different mines, foundries and toolsmiths to be able to reach the rarest ores of Malmyr. 12 magical dwarven runes - They can be used in three ways: Terraforming your territory, magically creating resources or by socketing the runes in excavated ruins for permanent global bonus effects. 18 magical rune words - Combine three runes to form a special rune word with vastly different and powerful effects. Runecrafting - Allowing you to combine spare runes and convert them into other runes. Runecreation - Convert surplus coin into runes. Mamlyr isn't... War - There are no enemies, other than the mission itself, for you to fight. Mega-factories - You will not build one huge, ever growing mega-factory. The game is about fulfilling the task at hand: The current mission given to you by the King. After you are done with a mission, you will be sent to a new region and will have to handle a new task. Microtransactions - You get the full game by buying Malmyr. Static production chains you build and never touch again - You will need to adapt to your current mission. Sometimes, this means that you will have to sell buildings and rebuild them somewhere else.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1470320/header.jpg?t=1637514962",
    "Price": 14.99,
    "Developers": "ziegler gamedev GbR",
    "Publishers": "ziegler gamedev GbR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1470320/ss_8eede408928831ed14bc60a2193f35152a03889f.1920x1080.jpg?t=1637514962,https://cdn.akamai.steamstatic.com/steam/apps/1470320/ss_07643cfe98771746d0e9b810c5277f426681ce29.1920x1080.jpg?t=1637514962,https://cdn.akamai.steamstatic.com/steam/apps/1470320/ss_ac9ed3b0198060e24829917e1e69a3b80b236f05.1920x1080.jpg?t=1637514962,https://cdn.akamai.steamstatic.com/steam/apps/1470320/ss_fba0b0e9fd1fda29cb4d6675a16dc2b2b95d00fe.1920x1080.jpg?t=1637514962,https://cdn.akamai.steamstatic.com/steam/apps/1470320/ss_4995f7b9fd139e78d80489b0eb66ffe42f696b0d.1920x1080.jpg?t=1637514962,https://cdn.akamai.steamstatic.com/steam/apps/1470320/ss_dd09a3654bb8a55407e0d00ad0cd67a1eacedf1c.1920x1080.jpg?t=1637514962",
    "Slug": "malmyr",
    "Meta Title": "Malmyr: Dec 21, 2020, ziegler gamedev GbR and Full Overview",
    "Meta Description": "Looking for information on Malmyr? Check out the release date (Dec 21, 2020), developer insights from ziegler gamedev GbR, and a complete game summary.",
    "Alt Text Image": "Official header image for Malmyr game - Steam 1470320",
    "Canonical URL": "https://gusku.site/game/malmyr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Malmyr\", \"description\": \"Looking for information on Malmyr? Check out the release date (Dec 21, 2020), developer insights from ziegler gamedev GbR, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ziegler gamedev GbR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ziegler gamedev GbR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1470320/header.jpg?t=1637514962\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}