{
    "AppID": 268890,
    "Name": "Masters of the World - Geopolitical Simulator 3",
    "Release date": "Feb 5, 2014",
    "About the game": "Discover the industry standard for geopolitical simulation of today’s world! In Masters of the World, the third incarnation of Geopolitical Simulator, play as the head of state of one or more countries and expand your influence across the globe. A totally unique simulation engine The game engine, Geopolitical Simulator 3, includes over 600 data elements for each of the 175 playable countries and calculates their changes in real time throughout the game based on players’ actions. Some examples include popularity ratings, political relations, and economic exchanges between countries. Various organizations, including NATO, use the technologies in the Masters of the World simulator for education and training. Over one thousand playable actions.At the country’s helm, the player/head of state can act in many areas: budget, taxation (nearly thirty types of taxes), currency, economy (over 130 economic activities), foreign and domestic affairs, defense, society, labor, health, social security, education, environment, transportation, culture, and more. For each of these areas, numerous laws can be proposed and must be voted on by the Parliament in order to pass. For example: setting social welfare benefit minimums, changing the retirement age, developing atomic weapons in secret, subsidizing the auto industry, hiring teachers, defining the powers of unions, setting speed limits on roads, regulating prostitution, creating an international film festival, etc. The player can also construct elements on the world map, which will change accordingly: nuclear plants, wind farms, military bases, pipelines, high-speed train lines, airports, and many more. Every action has its consequences. Lobbies, social groups, and leading national and international figures will intervene if their artificial intelligence finds it necessary to do so (interviews with the press, resignations, protests, strikes, roadblocks, wars...). To prevent tension, the player can meet with any figure, or address the media (over 8 hours of dialog in the game). Thanks to its intelligence services, the player also has an entire arsenal of spies and “special” ops. For example, he or she can - at his or her own risk - reveal scandals about another political party, dismantle terrorist networks, sabotage a foreign infrastructure, have an opponent assassinated, etc. As the head of the military, the player can move all of his or her units around the map from their actual bases during military conflicts. International organizations (over 50 organizations included) play an important role. At the UN, for example, the player can denounce a nation in order to obtain the Security Council’s authorization for a military intervention. The player can also create his or her own organization.Lastly, in order to stay in power, he or she must actively campaign to make sure he or she is elected. Playable scenarios Twenty or so scenarios are included in the game, such as “American Fiscal Cliff,” “Israel-Iran Escalation,” “Organization of Rice Exporting Countries,” “European Budgetary Golden Rule,” “Building South American Pipelines,” “African Economic Boom,” “Third World War,” “Triple A,” and “Famine in Southern Sudan.”. Multiple integrated options Network multiplayer mode Multi country mode to play several countries at the same time Game settings: terrorist activities, natural disaster probabilities, reactivity of the people, war triggering Real-time online player ranking Integration of your own photos, logos, and names to make the game even more realistic Interactive tutorial and constantly accessible help during the game Have fun learning geopolitics with the QUIZ mode, which has over 3000 questions Text and dialog 100% in English Note about the DRM: it uses an automatic and seamless activation at the first launch, then it can be played off-line if needed. It allows unlimited activations on three computers at the same time, plus if needed to migrate for free to other computers. So you'll never have to pay twice for the same licence of the game. The system allows future and backward compatibility with game add-ons plus upcoming upgrades to sequels of the game and access to our newsletters subscription. This also offers possibility to players having bought previously on other sites to migrate on steam and keep their add-ons.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/268890/header.jpg?t=1517285197",
    "Price": 34.99,
    "Developers": "Eversim",
    "Publishers": "Eversim",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_6cf27989bdd0055cac46eb1f03d34d31a647a637.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_f4e0817869dc4f9c541a89d12ba83775d6f6642b.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_4d946ef8accf82bd3b070c2d7ab441a767a160aa.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_fbc006c78d07de83e34eb2d1695e591995361a00.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_68cec3948529f927d1d9fe3df7717030b209be8b.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_f4e72ab22979906471b132aeb2f499f72fc4fe9b.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_f4c3fca8c6aa4316d2aa54f6f6fa76db08035a31.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_4f8280ac1a6ffd10407a4417f142d1dd130160c7.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_fd24287f7f56eb9ec190b09e45321805083f81ee.1920x1080.jpg?t=1517285197,https://cdn.akamai.steamstatic.com/steam/apps/268890/ss_2fd304ac078b8e09170a749708bd45daa3c0fefb.1920x1080.jpg?t=1517285197",
    "Slug": "masters-of-the-world-geopolitical-simulator-3",
    "Meta Title": "Masters of the World - Geopolitical Simulator 3: Feb 5, 2...",
    "Meta Description": "Looking for information on Masters of the World - Geopolitical Simulator 3? Check out the release date (Feb 5, 2014), developer insights from Eversim, a...",
    "Alt Text Image": "Official header image for Masters of the World - Geopolitical Simulator 3 game - Steam 268890",
    "Canonical URL": "https://gusku.site/game/masters-of-the-world-geopolitical-simulator-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Masters of the World - Geopolitical Simulator 3\", \"description\": \"Looking for information on Masters of the World - Geopolitical Simulator 3? Check out the release date (Feb 5, 2014), developer insights from Eversim, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eversim\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eversim\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/268890/header.jpg?t=1517285197\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}