{
    "AppID": 528740,
    "Name": "Operation: New Earth",
    "Release date": "Dec 14, 2016",
    "About the game": "Operation: New Earth is an intense sci fi multiplayer strategy game in which you must command an advanced military facility to defend Earth from a hostile alien invasion! Create an alliance, gather resources, and unlock advanced technology to level up your stronghold - your only protection against the invaders who are laying waste to the planet! Prepare to defend yourself and your allies against other surviving human factions in the struggle for territory and dominance over what remains of our world - and battle for Neutronium, a powerful alien element like no other, brought to Earth by a meteorite shower. Seek it out to enhance your armies and advance your technology to become the most formidable force that humanity has ever seen. Commander, it’s time to mobilize! Retake and defend this new Earth and let no enemy, alien or human, stand in your way! JOIN THE FIGHT Connect with players from around the world in the massive battle to take back planet Earth. BUILD YOUR BASE Build and upgrade your facility unlocking new technologies, structures, dropships to become a juggernaut of power. RAISE AN ARMY Train an army of varied and specialized unit types including hi-tech infantry and cutting-edge war machines. HARVEST NEARBY RESOURCES Build outposts in the world to defend your supply lines and harvest Neutronium. COMMAND YOUR HERO Train an elite Hero unit for incredible advantages and bonuses, while attempting to defeat and capture enemy players’ Heroes in battle. DEFEND YOUR TERRITORY Raid, destroy, or capture enemy Heroes - choose your strategy to direct your troops in battle! JOIN AN ALLIANCE Assemble an Alliance and build a powerful network of territory; increase your defenses, gain great advantage over key resources and objectives, and strategize to terminate the opposition to your new Earth in a single stealth mobile strike! Without powerful allies like you, humanity will surely fall. It’s no longer fiction, Commander, you must join the fight now - or face extinction at the hands of your enemies!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/528740/header.jpg?t=1652965672",
    "Price": 0.0,
    "Developers": "Hunted Cow Studios",
    "Publishers": "Hunted Cow Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/528740/ss_42b5f4054abd97b58be3b7520b693221aab5ef1a.1920x1080.jpg?t=1652965672,https://cdn.akamai.steamstatic.com/steam/apps/528740/ss_8d98b8088d5ec381fdbe3024ae514b2b56601c04.1920x1080.jpg?t=1652965672,https://cdn.akamai.steamstatic.com/steam/apps/528740/ss_206df9c1567b98d5e966e7aad2c1409b561b869d.1920x1080.jpg?t=1652965672,https://cdn.akamai.steamstatic.com/steam/apps/528740/ss_8a2adbc3981bdc1430ad4d87e6cb73959b7bcf71.1920x1080.jpg?t=1652965672,https://cdn.akamai.steamstatic.com/steam/apps/528740/ss_a4d64db04c3e4d836b913b920397c237dede145a.1920x1080.jpg?t=1652965672,https://cdn.akamai.steamstatic.com/steam/apps/528740/ss_bcc7ce10c2e38ec0f2ebccbdce74cc1c4657ca9b.1920x1080.jpg?t=1652965672",
    "Slug": "operation-new-earth",
    "Meta Title": "Operation: New Earth: Dec 14, 2016, Hunted Cow Studios an...",
    "Meta Description": "Looking for information on Operation: New Earth? Check out the release date (Dec 14, 2016), developer insights from Hunted Cow Studios, and a complete g...",
    "Alt Text Image": "Official header image for Operation: New Earth game - Steam 528740",
    "Canonical URL": "https://gusku.site/game/operation-new-earth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Operation: New Earth\", \"description\": \"Looking for information on Operation: New Earth? Check out the release date (Dec 14, 2016), developer insights from Hunted Cow Studios, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hunted Cow Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hunted Cow Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/528740/header.jpg?t=1652965672\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}