{
    "AppID": 1087280,
    "Name": "Out of the Park Baseball 21",
    "Release date": "Mar 20, 2020",
    "About the game": "Out of the Park Baseball 21 - the 21st version of the award-winning sports strategy franchise - delivers the most new features and improvements in series history! It features unprecedented depth and customization, brand-new guided experiences for newcomers and veterans, authenticity licensed by MLB and the MLBPA, and a bounty of offline and online experiences found nowhere else. “OOTP is an astonishing accomplishment!” - Boston Red Sox Principal Owner John W. Henry Out of the Park Baseball 21 is the biggest and best version ever made. Built upon the foundation of a series that has twice won Metacritic’s PC Game of the Year - the only game to ever do that - it delivers unprecedented baseball authenticity across the board. Out of the Park Baseball 21 Basic Features Discover new talent, draft the next superstar, negotiate with free agents, enter trade talks with other teams, build your dynasty and guide a franchise into an infinite future! As a manager, dive into the more hands-on management and set your team's lineups, pitching staffs, in-game strategy and call the shots from the dugout. You can oversee your league at a high level, or play out each game in the redesigned 3D game mode, managing play by play or even pitch by pitch. OOTP has it all covered! OOTP 21 comes with accurate 2020 MLB and MiLB rosters featuring ultra-realistic player ratings, schedules (including the London Series and the MLB at Field of Dreams), and league rules. Plus, all historical MLB seasons (1871-2019, including full historical minor leagues) and dozens of international pro and independent baseball leagues from around the world, featuring accurate 2020 rosters and player ratings. You can even create your very own fictional baseball universe with fictional teams and players, the possibilities are endless. The Infinite Baseball Sandbox! New features in OOTP 21 include: All new Game Flow guides you through the unique OOTP experience in a smart, fully customizable way! Not sure what to do next? Game Flow gets you where you want to be, depending on what is happening right now. Whether it is Spring Training, the dog days of summer, or the offseason, it is easy to find what to do next. A fun way for newcomers and veterans alike to experience Out of the Park Baseball! At long last - build your franchise’s dream ballpark! 3D Ballpark Construction Kit 1.0 allows you to configure a 3D stadium to your whims. Choose from many different field shapes and sizes, ballpark layouts and architectural elements and combine them with Ballpark Factors to emphasize the kind of organization you want to put together - defense, power, speed, gaps, you name it. This long-awaited feature lets you live a childhood dream - building your own ballpark! Upgraded Live Services! The smashing success of Live Starts expands this season, with additional information being used to make each Live Start even more authentic . Start your OOTP 21 experience from any date of the 2020 MLB season - from Day 1 through the end of the 2020 Postseason - with up-to-the-minute Rosters, Injuries, Trades, Standings, and more! New 2020 MLB rules, tactics, and player strategies ! Baseball is changing in significant ways, and we have got everything in place. How will you use the all-new 26-man rosters to your advantage, as well as the new 28-man September configuration? How will you strategize around the new 3-batter-minimum for relief pitchers? What will your lineups and rotations look like with separate 10- and 15-day Injured Lists for pitchers and hitters? It is a whole new world! Community-driven User Experience improvements ! A beautiful new interface with fully customizable player page statistics. Plus! Player lists are dramatically improved and can be configured to your liking, with more information than ever available at your fingertips. Big 3D in-game upgrades ! New in-game camera modes let you ‘follow the ball’ during the action, and multiple camera angles are available for pre-pitch, during the pitch, and after the pitch. Dozens of new 3D animations are in place, and the entire 3D gameplay has been smoothed and polished. Plus, we have completely reworked in-game audio for better crowd and ambient noise during games - including ballpark-specific audio customization! Scouting reimagined ! We have rebuilt scouting from the ground up this year, with significantly improved AI, new visual indicators of scouting accuracy, a new and fully customizable Player Scouting Page, new Needs-based assignments, organically created scouting reports coming at different intervals, and more. You have never experienced scouting in OOTP like this! Drafting reimagined ! A huge amount of new information is in your hands for the draft, including Mock Drafts, Future Draft Classes, sortable Draft History, and more. Realistic high school, college, and junior college player progressions make draft classes more interesting - and authentic - than ever. You will be positioned to dominate! New statistics ! Strikeout percentages, walk percentages, strikeout minus walk percentages and more are tracked and displayed to ensure you are fully aware of how successful (or not) your players are. New league customization options! Build your baseball universe YOUR way with improved League Expansion that has been made even more configurable, including long-desired improvement of Minor League team arrangements. The All-Star Weekend goes BIG ! For the first time ever, experience and play the Prospects Game and admire majestic blasts in the Home Run Challenge. Upgraded technical design under the hood! Reduced save game space requirements use less of your hard drive and optimize the game’s installation and simulation speed The most active development team in the business roars back this season! Each week we produce dozens of videos and podcasts, including the popular weekly video shows This Week In Perfect Team and Perfect Team Playoff Push every Thursday, multiple Franchise series, and two audio podcasts - OOTP Now and The Kevin Kennedy Show! You are in direct touch with the developers and the community every day. Many more improvements, all built upon the incredibly deep award-winning Out of the Park Baseball engine that has accurately simulated the World Series winner the past three seasons on MLB Network and produced entertaining simulations for FiveThirtyEight! Perfect Team 21 mode : Perfect Team is an incredible free online competition mode in Out of the Park Baseball that shook up the industry when it first launched in OOTP 19. Assemble, customize, and manage your team by collecting baseball cards from the past, present and future of Major League Baseball. Set your strategy and tactics, then compete against players from around the world to see who is truly the best! Do you have what it takes to build the Perfect Team? New features include: New player card selection - collect over 4000 cards! Beautiful new player card artwork A brand new league structure with 2 new league levels and a single Perfect League. Can you become the ultimate Perfect Team champion ? New promotion/relegation systems for a more dynamic league evolution Improved ratings calculations for every type of player card Hundreds of new Collection Missions with great rewards New in-season Special Tournaments - including qualifiers - and competitions with unique rewards, enhancing the wildly popular Perfect Team Tournament feature New content delivered each and every week all Perfect Team season long Dozens of surprises big and small all year!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1087280/header.jpg?t=1658710626",
    "Price": 0.0,
    "Developers": "Out of the Park Developments",
    "Publishers": "Out of the Park Developments",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_8701cff7307787a6f24455045144b07eda8d7db0.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_f933a341d62dd7a31f4c5ab5598f31b2931c91f4.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_c3f67258ebe5c8a6e942d33d05d84eedbc1fb4e5.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_c99aedb594b81c3611cbcc1d8870bdfd259c4000.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_735c874d2455a67143f663b45da83a838ab768f3.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_ae712828fad06d4f10af834540a372f892627edb.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_f60ed3b6fa40f6db61daacbfa4ac8ffa022a77f0.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_bd45dd03f480166f0c4ea59ca321caa482243604.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_5e81a86672f4ca4601c6f4c9f0f0476024d130e9.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_f73b0ba7357879d82a931de50fbc3edd08663542.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_f63402807c1a59c69c813d93fc457ac939f9e6cb.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_df6d2addbb823ef6edeec70e5a7f57c00c9ee0b9.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_2faa949bcf06f764fc5bb04e45ba3e8e9f4d792b.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_c2676592a0e61b5f051dc87599934116299e31aa.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_8c7ad7a070b1ffd29e2aeaf987720f6d7cf7ac8a.1920x1080.jpg?t=1658710626,https://cdn.akamai.steamstatic.com/steam/apps/1087280/ss_28b57bc7a05a5efcb723278f30a4aaac572d0091.1920x1080.jpg?t=1658710626",
    "Slug": "out-of-the-park-baseball-21",
    "Meta Title": "Out of the Park Baseball 21: Mar 20, 2020, Out of the Par...",
    "Meta Description": "Looking for information on Out of the Park Baseball 21? Check out the release date (Mar 20, 2020), developer insights from Out of the Park Developments,...",
    "Alt Text Image": "Official header image for Out of the Park Baseball 21 game - Steam 1087280",
    "Canonical URL": "https://gusku.site/game/out-of-the-park-baseball-21",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Out of the Park Baseball 21\", \"description\": \"Looking for information on Out of the Park Baseball 21? Check out the release date (Mar 20, 2020), developer insights from Out of the Park Developments,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Out of the Park Developments\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Out of the Park Developments\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1087280/header.jpg?t=1658710626\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}