{
    "AppID": 1272500,
    "Name": "Paraiso Island",
    "Release date": "Jun 5, 2020",
    "About the game": "One Earth Rising will donate a portion of sales to support our marvelous charity partners and their work in rebuilding the lives affected by real natural disasters like hurricanes and earthquakes. There are so many different fun and interesting characters living on Paraiso Island. Make new friends on the island, from the dancing raccoon Nacheline to Senorita Bomba who has the habit of wanting to explode everything. Feel like farming? Fay Fuzz sells seeds that allow you to plant vegetables and fruit, grow your own farm, and use the ingredients at your restaurant to give the customers Caribbean flavors that will make them ecstatic. Make the island your own, decorate the inside of your house however you want, go either dark and gritty like a pirate or bright and colorful like the day of the dead, change the colors of the grass and sand with the help of the magic of Papa Bois. Your creativity is limitless and we can't wait to see how your make your own little paradise. Go beyond Free to Play and get all current DLC in the Become a proper Islander, open the restaurant and hotel, and unlock so many new features. Learn more about what this paid bundle contains. Are you ready to be the island’s top chef and restaurant owner? Chop, mix and cook Caribbean recipes; play the cooking mini-game; serve islanders meals in your restaurant. Freshen up your look with this collection of colorful items inspired by the Day of the Dead! Includes Day of the Dead flooring, wallpaper, furniture set, home skin and character skin. Who is the Mysterious Stranger, why does he want to make the world a more colorful place? Introduces more quests and expands your island experience. A collection of in-game items: two unique chairs; two tables; an exclusive Carnival character skin. Can you be the island’s hotel owner and the host-with-the-most? This expansion includes the customizable hotel building; earn extra coins by entertaining and looking after tourists. Enjoy additional quests. Never worry about wearing out your equipment ever again with this set of unbreakable tools! This download gives you access to a machete, a shovel and a fishing rod that never breaks no matter how much you use them!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1272500/header.jpg?t=1591896184",
    "Price": 0.0,
    "Developers": "One Earth Rising™",
    "Publishers": "One Earth Rising™",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1272500/ss_18b71b33d857c05620283c60cef6e6be0fd23af7.1920x1080.jpg?t=1591896184,https://cdn.akamai.steamstatic.com/steam/apps/1272500/ss_2c9bd770c4721921848ef3b160d9dbd8c0a25974.1920x1080.jpg?t=1591896184,https://cdn.akamai.steamstatic.com/steam/apps/1272500/ss_3a547568bd06c1cb971f5a0ca640b5a59d0eef97.1920x1080.jpg?t=1591896184,https://cdn.akamai.steamstatic.com/steam/apps/1272500/ss_1a0d54e7ed1878e41352cc4526420c1528ee18c5.1920x1080.jpg?t=1591896184,https://cdn.akamai.steamstatic.com/steam/apps/1272500/ss_887ee13b370255ac1824a4e7aa604363296d3f02.1920x1080.jpg?t=1591896184,https://cdn.akamai.steamstatic.com/steam/apps/1272500/ss_f7e30b8da7600e11b26f9a507673c69f9421dd2a.1920x1080.jpg?t=1591896184",
    "Slug": "paraiso-island",
    "Meta Title": "Paraiso Island: Jun 5, 2020, One Earth Rising™ and Full O...",
    "Meta Description": "Looking for information on Paraiso Island? Check out the release date (Jun 5, 2020), developer insights from One Earth Rising™, and a complete game summ...",
    "Alt Text Image": "Official header image for Paraiso Island game - Steam 1272500",
    "Canonical URL": "https://gusku.site/game/paraiso-island",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paraiso Island\", \"description\": \"Looking for information on Paraiso Island? Check out the release date (Jun 5, 2020), developer insights from One Earth Rising\\u2122, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"One Earth Rising\\u2122\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"One Earth Rising\\u2122\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1272500/header.jpg?t=1591896184\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}