{
    "AppID": 1609870,
    "Name": "Pro Basketball Manager 2022",
    "Release date": "Nov 15, 2021",
    "About the game": "Have you ever dreamt of replaying the last possession during the playoffs’ finals? Which player should have taken that last shot? With Pro Basketball Manager 2022 you become the coach of your favorite team and will be able to change history. With more than 160 playable competitions - including 25 international competitions, 11 continental competitions, 12 female competitions, over 40 national cups - spread across 55 countries , you will never run out of new opportunities, each team will face different challenges depending on their league, budget or history. All teams include updated rosters for the 2021-2022 season. For the first time Pro Basketball Manager also features 2 licensed leagues with official names, logos and photos. Through your journey to the hall of fame, you must not only recruit and train your players, but also take part in live games, giving on-court instructions or scouting to find the stars of tomorrow. Ensure the stability of your team by managing the day-to-day operations such as club finances, staff management or improving your arena. Will you lead your team to glory or lead yourself to unemployment? It all depends on you with Pro Basketball Manager 2022 . Get it now to enjoy the most realistic basketball management game ever made. FEATURES In Pro Basketball Manager 2022 we have implemented a brand new User Interface for the live games, following the community’s feedback on last year’s game. All the information will now be accessible within a few clicks! You will also notice the new 3D arenas - completely customisable - and new 3D animations to make games more enjoyable. We have also added more than 60 new playable competitions all over the world (complete list below) with updated rosters for the 2021/2022 season which gives you access to 40 000+ players and 160+ competitions. PLAY YOUR GAMES IN 3D (or 2D) AND CHANGE YOUR TACTICS LIVE Once your team is prepared, you can kick off the season and play all the matches live! You can watch the games with our 3D engine. You can check the condition of each player; check their statistics; make substitutions and adjust your strategy at any time during the match. Thus, you are able to change your defense or offense tactics, as well as being able to choose the next play that will be made by your players! Interact with them to influence their mood - to be sure they are in the best condition to make your team win! SCOUTING, TRAINING, FINANCES ... NUMEROUS PARAMETERS TO MANAGE YOUR TEAM Send your scouts to check out players around the world through our in-depth scouting system. Train your players collectively, but also individually in order to get the best results. Improve your club's finances by improving your arena... many possibilities are available to lead your club to fame! EACH LEAGUE HAS ITS OWN RULES Each league has its own rules and these have been faithfully reproduced in Pro Basketball Manager 2022 .The recruitment process applied to your team will completely differ according to the league in which you play. In the North American league, for example, you will have to handle all the complexity of contracts, exceptions to avoid paying the luxury tax, not to mention trades or the draft. In most of the other leagues you will have to manage the buying of players, loans or free agents, taking care not to exceed the payroll allocated to your team for the season. YOUR OWN ON-COURT PLAYBOOK! Pro Basketball Manager 2022 allows you to greatly deepen your experience as a coach by letting you create your own plays, which you can then use during live games. If you are taking your first steps as a manager, you can also get help from an assistant who will handle the most complex tasks for you. NUMEROUS INTERACTIONS BETWEEN PLAYERS AND COACH Each player has his own personality and his own affinities with other players or clubs. Dismissing your player’s best friend could leave him sad and have him underperform! THOUSANDS OF STATISTICS AT YOUR DISPOSAL! Be it individual players or teams, you have a whole range of statistics at your fingertips which allow you to manage your progress. You can thus check on your players’ performance, evaluate your own career, or even look back through the archives on each match, both for your team or others. MAKE CHANGES TO THE GAME VIA THE DATABASE EDITOR AND SHARE IT WITH THE COMMUNITY THROUGH THE STEAM WORKSHOP! The database editor has received many new features this year to allow you to customize your database more than ever. You can now create complex competitions… only your imagination is the limit! With the Steam Workshop, you can also download databases created by other players in the community and use them for your own career. LIST OF PLAYABLE COMPETITIONS America : 2 continental competitions Argentina (1 men's league), Brazil (1 men's league), Colombia (1 men's league), Dominican Republic (1 men's league), Mexico (1 men's league), Panama (1 men's league), Puerto Rico (1 men's league), Uruguay (1 men's league), USA (1 men's league), Venezuela (1 men's league) Asia : 1 continental competition China (1 men's league), Japan (2 men's leagues, 1 national cup), Philippines (1 men's league), South Korea (1 men's league) Europe : 6 continental competitions Albania (1 men's league, 1 national cup), Austria (1 men's league, 1 national cup), Belarus (1 men's league, 1 national cup), Belgium (1 national cup), Belgium - Netherlands (1 men's league), Bosnia (1 men's league, 1 national cup), Bulgaria (1 men's league, 1 national cup), Croatia (1 men's league, 1 national cup), Cyprus (1 men's league, 1 national cup), Czech Republic (1 men's league, 1 women's league, 1 national cup), Denmark (1 men's league, 1 national cup), Estonia - Latvia (1 men's league), Finland (1 men's league, 1 national cup), France (4 men's leagues, 2 women's leagues, 2 national cups), Georgia (1 men's league, 1 national cup), Germany (3 men's leagues, 1 national cup), England , Scotland , Wales (1 men's league, 1 national cup), Greece (2 men's leagues, 1 national cup), Hungary (1 men's league, 1 national cup), Iceland (1 men's league, 1 national cup), Israel (1 men's league, 1 national cup), Italy (2 men's leagues, 1 women's league, 2 national cups), Kosovo (1 men's league, 1 national cup), Lithuania (2 men's leagues, 1 national cup), Luxembourg (1 men's league, 1 national cup), Macedonia (1 men's league, 1 national cup), Montenegro (1 men's league, 1 national cup), Netherlands (1 national cup), Norway (1 men's league), Poland (1 men's league, 1 women's league, 1 national cup), Portugal (1 men's league, 1 national cup), Romania (1 men's league, 1 national cup), Russia (2 men's leagues, 1 women's league, 1 national cup), Serbia (1 men's league, 1 national cup), Slovakia (1 men's league, 1 national cup), Slovenia (1 men's league, 1 national cup), Spain (3 men's leagues, 1 women's league, 2 national cups), Sweden (1 men's league, 1 national cup), Switzerland (1 men's league, 1 national cup), Turkey (2 men's leagues, 1 women's league), Ukraine (1 men's league, 1 national cup) Oceania : Australia (1 men's league), New Zealand (1 men's league)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1609870/header.jpg?t=1640599010",
    "Price": 24.99,
    "Developers": "Umix Studios",
    "Publishers": "Umix Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_44e1be7bb92d9ff44de116ab5d8b5724e8513dc1.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_5202f011e78f81747038f616fdc1bda39af222cd.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_12814d5196a261084031d7f2d94be2aacc2ab22e.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_09a57f7735da7d14d56d9b5cd4c4c684cbde87a1.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_9be0b8e9e61481bff6e580d3d593383a1e24d985.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_48666864b03621525415eb4c95f2a3a247d95c4c.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_d83f273f11d2e29c4ca53c76a7ed505856b87309.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_bf3efeafaf92bcf91ac7f6eda6bfc79addd56d9d.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_dd12d82b0d76811849d3ac5390a6a57d440715cf.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_b596a797b51c5ef518aa006d866f2377e356e85f.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_5c698a45a15df09f83ce03fa103ae37fc4bde56d.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_3cc4c29650f066769f7afa3bd3817c0aa079873a.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_fbe3b7138c8d5a5654dbd985fb3bb8646df1b5a2.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_0f5718a98eaba28d6f0964291467fd8d3a5d4e92.1920x1080.jpg?t=1640599010,https://cdn.akamai.steamstatic.com/steam/apps/1609870/ss_831232fe96f4ea65807b922a95ed53453df8fccd.1920x1080.jpg?t=1640599010",
    "Slug": "pro-basketball-manager-2022",
    "Meta Title": "Pro Basketball Manager 2022: Nov 15, 2021, Umix Studios a...",
    "Meta Description": "Looking for information on Pro Basketball Manager 2022? Check out the release date (Nov 15, 2021), developer insights from Umix Studios, and a complete ...",
    "Alt Text Image": "Official header image for Pro Basketball Manager 2022 game - Steam 1609870",
    "Canonical URL": "https://gusku.site/game/pro-basketball-manager-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pro Basketball Manager 2022\", \"description\": \"Looking for information on Pro Basketball Manager 2022? Check out the release date (Nov 15, 2021), developer insights from Umix Studios, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Umix Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Umix Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1609870/header.jpg?t=1640599010\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}