{
    "AppID": 909320,
    "Name": "Ruinarch",
    "Release date": "Aug 25, 2020",
    "About the game": "Ruinarch is a simulation sandbox game where you create obstacles and cause conflicts in procedurally generated fantasy worlds. Inspired by story generator games like Rimworld and Dwarf Fortress, weaving tales of both anguish and humor is central to Ruinarch’s gameplay. The game gives you all the infernal tools you'll need to toy with people's lives and relationships. There are many ways to be evil. Choose from three overlord Archetypes - each one provides you with a different playstyle. Do you want to focus on sheer destruction or are you into a more subtle puppetmaster approach? You can experiment by combining destructive spells. The most straightforward way to wipe out villagers is to simply cast powerful spells like Meteors, Earthquakes, Fire Balls, Lightning and more. But what happens when you hurl a meteor at a poisonous puddle? Poisonous meteor explosions, that's what! And that's just one of the many nefarious ways that you can combine elemental interactions to create your personalized cocktail of destruction! Slowly gain new powers by upgrading the Portal. Continue to sinisterly interact with the world to produce Chaotic Energy and then use these dark powers to upgrade your Portal. You gain permanent access to more heinous Powers by upgrading the Portal. Once the Portal is at the maximum level, you will finally be able summon yourself into the world and win the game! You can afflict villagers with flaws. Sure, you could just destroy the world with ice and fire, but the real fun begins when you meddle with villager lives to put them into compelling and tragic situations! Afflict the local hero with Lycanthropy and watch as his once loyal friends turn on him when the full moon rises. Afflict an annoying husband with Unfaithfulness and then watch the fireworks once you tell his wife of his misdeeds. You can spawn monsters to kidnap and harass villagers. You can snatch or seize a roaming monster and then breed it in your Kennel. This will allow you to summon them as part of your monster parties. Create monster parties to snatch Villagers or raid Villages. Your corrupted versions behave differently from their wild counterparts as they have been bred to perform very specific functions. You can spread malicious info. Your Beholder Structure allows you to spawn Eyes all over the world to gather information. You've seen a Knight steal a Shaman's Potion? Store it as an Intel and then tell the Shaman about it! You can spread Plague. Build the Biolab to afflict Villagers with Plague and summon Plagued Rats. Upgrade your plague to instill it with various nasty symptoms and improve its virulence. You can even make Plagued victims explode when they die! You can torture people. You can build a Prison and incarcerate villagers. If necessary, you can torture them in ridiculous ways to afflict them with random flaws. Perhaps someone will have a mental anguish and become a Serial Killer when it gets back to its village? You can brainwash folks into becoming cultists. You can also try to brainwash your prisoners. If successful, it will return to its village as a secret cultist who will quietly worship and aid you. You can start a zombie apocalypse. You can also make the Plagued dead rise as zombies. Other villagers that they attack may also contract the virus. Soon, the entire village will be filled with nothing but shambling zombies. You can make Vampires and Werewolves. Afflict a Villager with Vampirism or Lycanthropy to turn them into denizens of the night. Watch as they terrorize their neighbors and spread the curse! You may eventually see the Village fight back and start Vampire and Lycan Hunts.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/909320/header.jpg?t=1653030063",
    "Price": 24.99,
    "Developers": "Maccima Games",
    "Publishers": "Squeaky Wheel Studio Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_f98ed011637877cf14cdc13b4ad1267df4d1e526.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_87a39955f93ffbaa3d35ad6ef1ffda26b3ac4da2.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_d53b386e9ddb7a1b32552022a62e4bf34e21a4d3.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_68de6ae72ce2eb3045a30917e07c24db1c7a9298.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_ae7f26c8bfdb8bef0079722978299e32422d5f56.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_f04295813017ec01849ca72f39854c0f4a78c675.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_7ef495578dd26ff74a8d14661b41304434ecffcf.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_b780c5465769a7d6e35e06348aba03a06bb5136e.1920x1080.jpg?t=1653030063,https://cdn.akamai.steamstatic.com/steam/apps/909320/ss_089170a7870f220d815a0cda0093a0d10fac82b0.1920x1080.jpg?t=1653030063",
    "Slug": "ruinarch",
    "Meta Title": "Ruinarch: Aug 25, 2020, Maccima Games and Full Overview",
    "Meta Description": "Looking for information on Ruinarch? Check out the release date (Aug 25, 2020), developer insights from Maccima Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Ruinarch game - Steam 909320",
    "Canonical URL": "https://gusku.site/game/ruinarch",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ruinarch\", \"description\": \"Looking for information on Ruinarch? Check out the release date (Aug 25, 2020), developer insights from Maccima Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maccima Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Squeaky Wheel Studio Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/909320/header.jpg?t=1653030063\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}