{
    "AppID": 1415110,
    "Name": "Second Chance",
    "Release date": "Sep 28, 2020",
    "About the game": "Play as Zana, an elf who has been brought back from the dead to carry out a duty bestowed upon her by the sun goddess. Choose from 4 different classes, each with their own play style. Form your own strategy and defeat any enemies that stand between you and the villainous Koroime. Craft your own weapons and armour to become an over powered champion of the gods. Enjoy part one and see the story unfold and see Zana evolve as a character before your eyes. Archer: With a boost in critical hit rate and evade chance, the archer can quickly knock down anyone that steps up to the plate. However, the downfall is the lack of abilities especially early game, this can make your start a struggle. Mage: A variety of Margias (Spells) with secondary effects, can make Zana a terrifying foe to battle, with a wide array of attacks, Zana can make battling her frustrating for all enemies involved. Though it's greatest downfall is the lack of defence, mages can dish it out but they can't take it. Knight: A great boost in health and defence, Zana as a knight can take any damage given to her, with great health regeneration, the only challenge she'll face is who is to hit first. Although the knight version of Zana has great health and regen, she doesn't do as much damage as other classes, so her battles tend to take longer. Brawler: Fast and ruthless the base damage output is the highest, great abilities and powerful attacks, not much needs to be said about the brawler only one question, Who wants these hands first? While the brawler Zana has the highest base damage output, she can't take many reprisals, low health and defences, but once you start laying in hits, it's over for the enemy. Once you have selected your class you are thrown into the world of Skettaria, where you'll meet new faces and will have the urge to help anyone that asks you for it. The question is though, why were you really brought back? Is it truly to stop one villain? Or is there something greater at hand here? Meet with Lunny, a beautiful hero from one of the world's most powerful guild, The Heroes Guild. She turned down a job she seemed unfitting for her. It's up to you to pick up the pieces. Crafting: Through your adventures you'll pick up items which you can use for crafting for weapons and armour, use them to become an overpowered weapon of the gods. Adventure: There's a world waiting for you to travel, look around and take it all in, there's plenty enough to do. Fight: what kind of RPG would Second Chance be without fighting enemies!? Battle all kinds of enemies with different strengths and weaknesses.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1415110/header.jpg?t=1622260986",
    "Price": 6.99,
    "Developers": "GvH Universe",
    "Publishers": "GvH Universe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1415110/ss_7b9f05b772ce1d882a1514934c7b3dc706e0f35f.1920x1080.jpg?t=1622260986,https://cdn.akamai.steamstatic.com/steam/apps/1415110/ss_3b80ce15c4af351161f99a78b6e100e98ae3e3a5.1920x1080.jpg?t=1622260986,https://cdn.akamai.steamstatic.com/steam/apps/1415110/ss_dd48644af7654cde0682d6fb458d58681c0f8df1.1920x1080.jpg?t=1622260986,https://cdn.akamai.steamstatic.com/steam/apps/1415110/ss_52582e9b33d3b0b4553a467a0a6f1e9835d46ea3.1920x1080.jpg?t=1622260986,https://cdn.akamai.steamstatic.com/steam/apps/1415110/ss_89357feb7c6587e23ddcf61c80bae009cc1fe7db.1920x1080.jpg?t=1622260986",
    "Slug": "second-chance",
    "Meta Title": "Second Chance: Sep 28, 2020, GvH Universe and Full Overview",
    "Meta Description": "Looking for information on Second Chance? Check out the release date (Sep 28, 2020), developer insights from GvH Universe, and a complete game summary.",
    "Alt Text Image": "Official header image for Second Chance game - Steam 1415110",
    "Canonical URL": "https://gusku.site/game/second-chance",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Second Chance\", \"description\": \"Looking for information on Second Chance? Check out the release date (Sep 28, 2020), developer insights from GvH Universe, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"GvH Universe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GvH Universe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1415110/header.jpg?t=1622260986\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}