{
    "AppID": 1283810,
    "Name": "Solenars Edge II: Aurora of The Seventh Dawn",
    "Release date": "Jun 8, 2020",
    "About the game": "Solenars Edge II: Aurora of The Seventh Dawn is the sequel to Solenars Edge Rebirth and takes place three years after the events of Solenars Edge: Afterstory. In Solenars Edge II: Aurora of The Seventh Dawn. You take on the role of Thedo and Aionis as they struggle to solve the mystery of the connection between Alcornagia and Deminastia. Venture across familiar lands in Alcornagia as you play as Thedo and discover new ones as you traverse Deminastia for the first time in the series as Aionis. One soul trying to find his missing friends and another soul trying to find his way back home. Two lost souls with a mission to accomplish and a burning desire to accomplish their goal. Will you help guide them to their final destination or will they remain lost forever? Alcornagia Synopsis: Long ago, the Archieves (An originally created word for the type of enemy) attacked the world of Alcornagia and decimated around 80 percent of the population. Years later, King Thedo of Ternesta struggles to recover from the devastation from that day known as the 'Archieves Massacre'. Though several of his friends had perished in front of his very eyes. There have been rumors of random disappearances seemingly related to that event. Thedo, convinced that some of his friends may still be alive, embarks on a quest alongside Yenta and Nerine to locate his missing friends and discover the mystery of Deminastia. Deminastia Synopsis: Aionis is a shy 17 year old homeless student who has no connections or friends. His father, Phyrith who was one of the chosen's group back in the battle for the Solenars Edge, was killed during the Archieves Massacre. Bound to a lonely dwelling within a cave, Aionis only eats at his run-down school on the week days and starves on the weekends. His life seemingly going nowhere until he stumbles upon a book called 'The Aurora of The Seventh Dawn'. Upon opening the book, Aionis is transported into another world named Deminastia. He is soon greeted by Solenia, a young Elven girl who is a bit of a prodigy and Atsumora, who was one of the heroes who was assumed dead. Aionis, at the suggestion of Solenia and Atsumora, enrolls in Nelditus Academy. An elitist school that practices the art of Raiken slaying. Raikens are horrific beasts that prey on the living mainly at night, and sometimes the day. Before Aionis can enroll, he is given a task by headmaster Inuzuka and must complete it before he can become a student. Balancing his daily school life, Raiken Slaying and his ongoing desire to return home. Aionis' life has suddenly turned upside down. Will he be able to accomplish his goal or will he end up trapped in Deminastia forever? Only you can find out. Features: -Engaging turn-based battle system similar to Estellium Legends. -Two world game-play that swaps between different main characters throughout the story. -A wonderful and profound soundtrack. -3 party member battles with the ability to swap party members in and out of combat. -A simple, yet diverse and unique character trait system. (Ex: Aionis can unlock and equip different outfits and Solenia can utilize event based summons). -Multiple skills and weapons to utilize. -Several Mini-Games to play and areas to explore. -Multiple secret bosses to discover and fight to unlock rare rewards, extra Kacha and exp! (Each boss comes with their own unique battle theme). -A heart-touching story that spans between two worlds. *Co-Op is only available in a separate password protected build, more details are here:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1283810/header.jpg?t=1658848031",
    "Price": 0.0,
    "Developers": "Team Syukino",
    "Publishers": "Team Syukino",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1283810/ss_20990d78fc9fa33414feabd8aa4a0a180dcece4b.1920x1080.jpg?t=1658848031,https://cdn.akamai.steamstatic.com/steam/apps/1283810/ss_1cbf6efd941941331ecea44a2a148ff305348557.1920x1080.jpg?t=1658848031,https://cdn.akamai.steamstatic.com/steam/apps/1283810/ss_2abb1228d89eff4d497b87ddc9efec6520151a66.1920x1080.jpg?t=1658848031,https://cdn.akamai.steamstatic.com/steam/apps/1283810/ss_ded2363a5c54f9a54dd95d2c747f66dfbf4cd4d5.1920x1080.jpg?t=1658848031,https://cdn.akamai.steamstatic.com/steam/apps/1283810/ss_527a775848497d7fcf896bd3c0a45826e668bec2.1920x1080.jpg?t=1658848031,https://cdn.akamai.steamstatic.com/steam/apps/1283810/ss_7ebf46bfe1a1e3a4c55abfc82d49292964dcad98.1920x1080.jpg?t=1658848031",
    "Slug": "solenars-edge-ii-aurora-of-the-seventh-dawn",
    "Meta Title": "Solenars Edge II: Aurora of The Seventh Dawn: Jun 8, 2020...",
    "Meta Description": "Looking for information on Solenars Edge II: Aurora of The Seventh Dawn? Check out the release date (Jun 8, 2020), developer insights from Team Syukino,...",
    "Alt Text Image": "Official header image for Solenars Edge II: Aurora of The Seventh Dawn game - Steam 1283810",
    "Canonical URL": "https://gusku.site/game/solenars-edge-ii-aurora-of-the-seventh-dawn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solenars Edge II: Aurora of The Seventh Dawn\", \"description\": \"Looking for information on Solenars Edge II: Aurora of The Seventh Dawn? Check out the release date (Jun 8, 2020), developer insights from Team Syukino,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Syukino\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team Syukino\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1283810/header.jpg?t=1658848031\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}