{
    "AppID": 832620,
    "Name": "SpectraLayers Pro 5 Steam Edition",
    "Release date": "May 1, 2018",
    "About the game": "Sound design in the full sense of the word. SpectraLayers Pro 5 , one of the world’s most revolutionary spectral editing platforms, is now available on Steam.The spectral graph in the program enables users to view audio material right down to the finest level of detail, for precise editing, mixing, restoration or for designing one-of-a-kind new sounds.SpectraLayers transforms sound into a unique visual world of multidimensional audio data. Explore new creative possibilities and edit your sound on a visual level like a designer. Sound designers, mastering engineers and even forensic experts rely on the wide spectrum of tools, high-performance audio engine and straightforward connection with other DAWs offered by SpectraLayers Pro 5 . The essential features: Editing in real time: With the newly developed audio engine Brand new workstation: Work on a redesigned interface and with new options for using tools Access the third dimension for sound: Edit audio in 2D or 3D - ideal for mastering and other tasks Take control of the full audio spectrum: With precise tools such as overtone, frequency or magic wand Layer-based audio editing: Connect virtual groups in the mix and apply your favorite color Compositing view: Preview your final mix - before it's final. Want to use different tabs? Work on several projects? Or drag data from one project into another? With multi-project management, it's simple. Work with other DAWs: Perfect interoperability with SOUND FORGE Pro 12 and AVID Pro Tools® Revolutionary sound design Mixing with Spectral Casting Use the frequency spectrum of one layer as a cast for the overall mix. This creates a well-balanced mix, for example with guitars and vocals. Sound design with Spectral Molding Spectral molding uses frequencies to materialize crosses between recordings for truly creative sound design.For example, imagine a guitar recording with an acoustic texture of vocals. Get ready for an unbelievably inspiring trip into a universe of out-of-this-world sounds. Cleaning with acoustic finger prints Perform noiseprint-based noise reduction directly within a waveform using customized noiseprints containing multiple frequency bands of any width.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/832620/header.jpg?t=1538761524",
    "Price": 0.0,
    "Developers": "MAGIX Software GmbH",
    "Publishers": "MAGIX Software GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/832620/ss_0afdbabab05cd43a95cc9cdf7468b4f288b6bcc2.1920x1080.jpg?t=1538761524,https://cdn.akamai.steamstatic.com/steam/apps/832620/ss_26a5932a726b3b136696938ee723d49d14944b9a.1920x1080.jpg?t=1538761524,https://cdn.akamai.steamstatic.com/steam/apps/832620/ss_0d6c04420c2a4caec677f194c9f5054a1dcf4c3f.1920x1080.jpg?t=1538761524,https://cdn.akamai.steamstatic.com/steam/apps/832620/ss_4f726aebb51258bca94e700214fd38fef3dd1a2a.1920x1080.jpg?t=1538761524,https://cdn.akamai.steamstatic.com/steam/apps/832620/ss_e4940ba813a9443db7a8b9a701643e374eaff793.1920x1080.jpg?t=1538761524,https://cdn.akamai.steamstatic.com/steam/apps/832620/ss_82157a26c72123aefcfe47bdfabeba94341cadcd.1920x1080.jpg?t=1538761524",
    "Slug": "spectralayers-pro-5-steam-edition",
    "Meta Title": "SpectraLayers Pro 5 Steam Edition: May 1, 2018, MAGIX Sof...",
    "Meta Description": "Looking for information on SpectraLayers Pro 5 Steam Edition? Check out the release date (May 1, 2018), developer insights from MAGIX Software GmbH, and...",
    "Alt Text Image": "Official header image for SpectraLayers Pro 5 Steam Edition game - Steam 832620",
    "Canonical URL": "https://gusku.site/game/spectralayers-pro-5-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SpectraLayers Pro 5 Steam Edition\", \"description\": \"Looking for information on SpectraLayers Pro 5 Steam Edition? Check out the release date (May 1, 2018), developer insights from MAGIX Software GmbH, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/832620/header.jpg?t=1538761524\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}