{
    "AppID": 1497530,
    "Name": "StarPicker",
    "Release date": "Jul 9, 2021",
    "About the game": "Landing on mysterious planets, you have to quickly identify your location and find the best way to collect lost stars. Show your agility and strategy skills to accomplish your mission. Don’t panic, even when you face the unknown and its unexpected challenges. Then don’t forget to check your route review with players from all over the world and be the one who will save the universe! Key features: Discover unknown territories through original land navigation gameplay. Explore 60+ levels in 5 unique environments. Unlimited original hand drawn maps with regularly updated contents. 3 exciting game modes adapted for different challenge-seekers. Attractive cosmic soundtrack in late 60’s style tailored for each game level. Engaging online community : ranking and replay analysis. Compare your route choices with players worldwide and improve your performances. Story: Well, it all begins with an unexpected “disaster” … All the stars are falling down from the sky. Is this the end of the world? The youngest Nobel Prize winner Minna Vellamo is assigned with the mission of finding back lost stars. She chose to be accompanied by a robot named Harvey for him being a ...robot. Little does she know, Harvey is the clumsiest and most talkative robot ever. One day before departure, Minna was told that “Electric Eel” Janus White will also be joining the team. Being depressed for a very long time since retirement, the former footballer signed himself up to the project. He believed that this is the only opportunity to find back his old-day glory and to prove to the public that he is still a hero. Will Janus achieve what he is looking for? Often described as bold, independent and determined, will Minna get along well with Janus? Gameplay: Start a navigation adventure in space with only a map and a compass in hands. Whether you’re a curious traveler, a challenge-seeker or a speedrunner, there is always a game mode waiting for you in StarPicker. 3 game modes: The Main Race mode is the most relaxing experience. You can be a traveler, embracing fantastic landscapes , gaining satisfaction in your map reading skills, meeting curious animals and uncovering the mysterious history on each planet. In the Electric Eel mode : win the challenge with your impressive observation and incomparable precision . Fearless of taking risks even on unknown territories. It’s the perfect mode if you are looking for challenges without worrying about time . Maybe you are an orienteer, a traceur or a speedrunner who “flies” in a complex environment! StarPicker’s Berserk mode suits you the best! Reveal stars one by one in a limited time, avoid obstacles by acting cool like a Light Speed Racer. From novice to expert: Adjust the game options to your capacities and improve your navigational skills. Use compass and learn map reading with International Standard for Orienteering Maps.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1497530/header.jpg?t=1631447807",
    "Price": 19.99,
    "Developers": "Emedion Games",
    "Publishers": "Emedion Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_1a36b994402c6d92ae791c422bb0d5a6ee814c84.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_46dafed89db4a2adf9edf7f93c76706793c13256.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_af7732c656343cd2afe153b9592428088f1abbf6.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_b7fc991751c245275e2ec3088c03fd2b2effed14.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_fcf6fe57ac4523d7705ca8e3af65759fbd90f062.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_a38b124fd4bd100c8db6c98ba1fe89b5cd2e644a.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_7ac312abf5d98eedba807486a7f21c4ccdc32c24.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_2a9d30b48370b646ccf9fb8ad141e0b81c2402d4.1920x1080.jpg?t=1631447807,https://cdn.akamai.steamstatic.com/steam/apps/1497530/ss_c7394a85bba45277950c966d93adb6c41e05c685.1920x1080.jpg?t=1631447807",
    "Slug": "starpicker",
    "Meta Title": "StarPicker: Jul 9, 2021, Emedion Games and Full Overview",
    "Meta Description": "Looking for information on StarPicker? Check out the release date (Jul 9, 2021), developer insights from Emedion Games, and a complete game summary.",
    "Alt Text Image": "Official header image for StarPicker game - Steam 1497530",
    "Canonical URL": "https://gusku.site/game/starpicker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"StarPicker\", \"description\": \"Looking for information on StarPicker? Check out the release date (Jul 9, 2021), developer insights from Emedion Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Emedion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Emedion Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1497530/header.jpg?t=1631447807\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}