{
    "AppID": 1055430,
    "Name": "Swords and Sandals Classic Collection",
    "Release date": "Apr 18, 2019",
    "About the game": "'Gladiator ... gladiator ... gladiator ... Swords and Sandals, Gladiatorrrrr!' If this refrain means anything to you, then you grew up playing the legendary Swords and Sandals turn based combat game series. Millions of kids grew up playing S&amp;S in their schools, late at night on the family computer's browsers or in their bedroom on a rainy Saturday morning. These games have been played over half a billion times, and for good reason. Swords and Sandals is nostalgia, Swords and Sandals is life. Now, the world's favourite gladiator game series has arrived on Steam for the very first time ever . The Swords and Sandals Classic Collection comes with five of the greatest S&amp;S games ever made (and two bonus games!) and three art galleries featuring behind the scenes images from the series long and illustrious past. Swords and Sandals I : Gladiator Swords and Sandals II : Emperor's Reign Swords and Sandals III : Gladiae Ultratus Swords and Sandals IV : Tavern Quests Swords and Sandals Crusader BONUS Swords and Sandals Mini Fighters BONUS Gross Out : Battle For Sludge Valley PLEASE NOTE - ONLY SWORDS AND SANDALS IV OFFERS MULTIPLAYER ( VIA LOCAL HOTSEAT ) Swords and Sandals I : Gladiator Hear the crowd roar as you enter the gladiatorial arena in this epic adventure set on the Island of Doomtrek. Unleash the hero within and become the ultimate gladiator against 7 of Brandor's fiercest Arena Champions. Go back to where it all began when the madman HeChaos ruled the arena! Swords and Sandals II : Emperor's Reign Arise Gladiator. Released from your chains in a dark cell and thrust into the arena you must fight for your life, fame and fortune. The evil Emperor Antares now reigns supreme in Doomtrek and the gladiatorial games are bigger and more epic than ever as twenty legendary fighters enter the arena. If it is your destiny you will vanquish your rivals, defeat the Emperor and become an immortal. Swords and Sandals III : Gladiae Ultratus Part three of the great series hurls you into the Gladiae Ultratus, the most dangerous and spectacular gladiator tournament in all Tritonia. Forget all you thought you knew about Swords &amp; Sandals and prepare yourself for the quest of a thousand lifetimes! 24 powerful new Arena Champions await you, from mighty stone giants to automaton robots from another world. Are you ready to become the ultimate gladiator? (Note, this is the SOLO edition of the game. Alas, the multiplayer servers died many years ago but will be reborn in S&amp;S VI, coming in 2020!) Swords and Sandals IV: Tavern Quests The Swords and Sandals saga continues as our embattled gladiators step out from the arena and into a wider and more dangerous world. Up to four gladiators compete in a variety of minigames, adventures and battles set across an epic eight realms of danger and adventure. Featuring over 40 minigames, local multiplayer action with up to 3 friends and all the gladiatorial action the game series is famous four. It's turn based combat meets Mario Party in Brandor's biggest board game crazy. Swords and Sandals Crusader Brandor erupts into chaos and war as the realm's greatest heroes and villains take to the battlefield. Lay siege to castles in the pouring rain or send your cavalry against a horde of skeletons in the heat of the scorching desert. This is a turn based strategy game in the style of Defender of the Crown , featuring army combat and management, a simple RPG progression system and a special 'Survival mode' which pits you against your foes one after the other. Control giant iron robots, fifty foot high demons and great apes and shake the very foundations of Brandor. Put on your sandals again and become the finest crusader in the realm! *BONUS* Swords and Sandals Mini Fighters Swords and Sandals returns - this time, faster, tougher and tinier! Welcome to S&amp;S MINI FIGHTERS! This was a version of S&amp;S 2 made in 2011 and originally designed for mobile phones, it was renamed and re-released in 2018 as Mini Fighters and featured very fast battles and very small gladiators! *BONUS* Gross Out : Battle For Sludge Valley The one and only time Swords and Sandals was ever reskinned, this curious game from 2007 features a cast of misfits defending their town from an evil property developer using Fart Cannons, Rotten Eggs and all manner of disgusting weapons in a hilarious and bizarre showdown across 7 locations. Made using the Swords and Sandals II combat engine. All of your favourite Swords and Sandals games for one low price. Relive the magic today, five of your all-time favourite Swords and Sandals games in full-screen glory. The power of nostalgia is yours!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1055430/header.jpg?t=1646692280",
    "Price": 9.99,
    "Developers": "Whiskeybarrel Studios",
    "Publishers": "eGames.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_30c60776831fda14a6d97fe7117c99017f71cec5.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_97b6d19a5784b542d6c8cb629458b3fcae4ecf42.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_d11520c823b994fdf1c8764591bc253220b05fa3.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_e13a37aba220904d56168cc0c2d937b893f79a85.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_83c11330abc6be32c232b4111d32a7dfc45cde16.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_23358351bcc9f1add41917c2d57362d2f50798dd.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_d44deae56d66f8eb353b7b52d82c47445e6cdf3e.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_d915318424928f97bcfa940d548603277f6c9fed.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_56519d590e3838486b34d31313ce3daf4ef71ee5.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_c4ac59a6f0ee85efd5062d88334b083044a29b82.1920x1080.jpg?t=1646692280,https://cdn.akamai.steamstatic.com/steam/apps/1055430/ss_fceaa75fe1490433725742410cece0f9d9de53c4.1920x1080.jpg?t=1646692280",
    "Slug": "swords-and-sandals-classic-collection",
    "Meta Title": "Swords and Sandals Classic Collection: Apr 18, 2019, Whis...",
    "Meta Description": "Looking for information on Swords and Sandals Classic Collection? Check out the release date (Apr 18, 2019), developer insights from Whiskeybarrel Studi...",
    "Alt Text Image": "Official header image for Swords and Sandals Classic Collection game - Steam 1055430",
    "Canonical URL": "https://gusku.site/game/swords-and-sandals-classic-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Swords and Sandals Classic Collection\", \"description\": \"Looking for information on Swords and Sandals Classic Collection? Check out the release date (Apr 18, 2019), developer insights from Whiskeybarrel Studi...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Whiskeybarrel Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"eGames.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1055430/header.jpg?t=1646692280\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}