{
    "AppID": 773320,
    "Name": "TcNo TimeKeeper",
    "Release date": "Jan 15, 2018",
    "About the game": "TcNo TimeKeeper helps you shorten the time you spend editing a video by helping you remember exactly where you need to be in the video. Stop spending time scrubbing hours of video, and work on a better final product. (This is NOT editing or recording software, you still need those to record and edit videos as usual). Who is this for? Livestreamers Podcasters Video creators (YouTube, Vimeo, etc.) Video editors (If the creator uses TcNo TimeKeeper) Features Save storage space: If no times were noted before the end of the recording, you'd be presented with an automatic option to delete files created after the recording started individually or all together. Controlled easily: Setting matching hotkeys will allow seamless integration with any recording software. Remote control from any WiFi and web-enabled device: Use a phone, tablet or even another PC to control the program. This program makes it perfect for those without direct access to a computer while recording, such as in a podcasting situation. Compatible with every recorder and editing software The program outputs times you record into a text file or .csv for later use. If you don't edit your work, send this and whatever else you need to an editor, and they can use the times. The program does not interact with recording or editing software directly. You still need recording and editing software; this does not substitute either. It's purely another tool to help speed up the editing process. How do I use the program? While recording content (on any device with any software), have TcNo TimeKeeper open. When something noteworthy occurs that you or an editor needs to come back to in editing, press the hotkey you assigned to make a note of the time. When you or someone else is editing the video, they know exactly where to go and don't have to spend hours scrubbing through the footage finding good parts, missing hundreds on the way. Spending less time searching allows creators to create better final products. The program is lightweight and designed to run in the background without interrupting the user, making it perfect for Livestreamers, Podcasters and content creators alike to use it without the audience even knowing. Easy to understand I created the program to be simple and understandable for anyone. Once downloaded, set up the hotkeys you want, and if possible, set the start/stop recording hotkey to the same as your recording software, so they both start simultaneously. While recording, press the note keys to remember specific moments in the recording. Does it work with X or Y recording/streaming software? The program works independently from recording software. It doesn't matter what program you use to record heck; you can even use hardware. The program suggests that you set the hotkeys to the same as your recording software for ease of use; it doesn't matter what software you use. This program works with any recording software. Does this program record or edit video? Will I still need recording/editing software? No, TcNo TimeKeeper does NOT record, edit or interact with your video. Yes, you will still need recording and editing software for video creation. This program is here to help you better know the footage you record so that when you or an editor gets around to editing, they can skip to where they need to be and edit faster. When you use this tool and make notes of important events as you're recording, you'll be able to find them in the hours of footage you record quickly. When you spend less time looking for good content in the footage, you'll have more time to finish polishing the final video.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/773320/header.jpg?t=1651361442",
    "Price": 0.0,
    "Developers": "Wesley Pyburn",
    "Publishers": "Wesley Pyburn",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/773320/ss_92a48594cbda0e2499b8eeec4079f8ba9f5ee173.1920x1080.jpg?t=1651361442,https://cdn.akamai.steamstatic.com/steam/apps/773320/ss_61f99c0eb2fbea2f465e2dbcdb2e4ac8e3822bbe.1920x1080.jpg?t=1651361442,https://cdn.akamai.steamstatic.com/steam/apps/773320/ss_bb00b43d0bc7b23dcd4397e8f602caf5a474056b.1920x1080.jpg?t=1651361442,https://cdn.akamai.steamstatic.com/steam/apps/773320/ss_ac1bd10f5bab4ba4b3b03111d16052a320fede29.1920x1080.jpg?t=1651361442,https://cdn.akamai.steamstatic.com/steam/apps/773320/ss_ba36cf41ececfc66ce08f81711aa25a86f447ae4.1920x1080.jpg?t=1651361442,https://cdn.akamai.steamstatic.com/steam/apps/773320/ss_9221f987d9d6b8152e1213f04c260a46e6c35e49.1920x1080.jpg?t=1651361442",
    "Slug": "tcno-timekeeper",
    "Meta Title": "TcNo TimeKeeper: Jan 15, 2018, Wesley Pyburn and Full Ove...",
    "Meta Description": "Looking for information on TcNo TimeKeeper? Check out the release date (Jan 15, 2018), developer insights from Wesley Pyburn, and a complete game summary.",
    "Alt Text Image": "Official header image for TcNo TimeKeeper game - Steam 773320",
    "Canonical URL": "https://gusku.site/game/tcno-timekeeper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TcNo TimeKeeper\", \"description\": \"Looking for information on TcNo TimeKeeper? Check out the release date (Jan 15, 2018), developer insights from Wesley Pyburn, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wesley Pyburn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wesley Pyburn\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/773320/header.jpg?t=1651361442\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}