{
    "AppID": 509250,
    "Name": "TO THE TOP",
    "Release date": "May 18, 2017",
    "About the game": "VR Platforming Game , that gives you the freedom to move across the environment with superhuman abilities. Conquer over 35 levels with new obstacles and challenges. Compete for the fastest times or explore the environment. Experience the freedom of movement. Story In the future, cities are not protected by superheroes, instead superheroes are built. Super Bots are human piloted robots engineered with super powers to protect and serve the people. TO THE TOP Academy is a training program to test your skills and see if you are capable of piloting one of these machines. So strap in and see if you can pass this challenge Our core motivation for creating TO THE TOP was to create a movement mechanic that is simple to use, takes advantages of VR input, and feels very comfortable to play. We spent a year testing and tuning this system, until it felt like a movement system that was not only fun to use but also opened the door to create brand new gameplay that has not been seen in platforming games before. Climb - Grab with one hand at a time, to move across surfaces, up over or around. You can climb 360 around objects. Leap - Grab on with both hands, look at where you want to go and release to leap. Perform consecutive leaps to build up speed and power. Air Control - While leaping through the air, you can control your fall with the direction you are looking. Skate - Green surfaces can be skated on. Grab them, point in the direction you want to go and skate across the surface. Fly - Equipped with Jet Hands, you can fly through the sky. And more … Inspired by classic platforming games like the Super Mario series, we wanted to distill what made the genre so great and bring these concepts back in a brand new way. With this in mind we were able to bring a new level of skill, challenge, and discovery to VR. So you can come back again and again in the pursuit of bettering your skills and master the game. Easy to Pick Up - Controls are easy to use and do not require many buttons or gestures. New or hardcore gamers can easily jump into TO THE TOP. Hard to Master - To earn the best times and collect all of the items. You need to master all of the movement mechanics to pounce though the levels like a robotic cheetah. Learn the Environment - Each level can be traversed not only horizontally but vertically as well. It is important to learn these layouts and figure out the best paths through the levels. Challenging Obstacles - Each new level brings a new challenging obstacle to overcome ranging from Wall Runs to a giant moving robot you need to climb. Hidden Areas - Discover hidden paths in each level to earn a Medal. TO THE TOP is the start of something great and we wanted to make sure players had a complete package of a game with hours of content to discover 35 Levels to Play - Each level brings new challenges and environments to discover. Over 30 Customizable Options to Unlock - Customize your robot ranging from hands, torso, and head. 3 Time Goals to Conquer Per Level - Each level has multiple time goals that range in difficulty. 2 Collectable Goals Per Level - Take your time and explore each level to discover Geoms to collect and a Hidden Medal. Online Leaderboards - Speed run for the best times on our online leaderboard system. Multiplayer - Jump into an online session and race for the best time against other players. Put your skills to the test. TO THE TOP was made in Austin, TX and we were inspired by the local music that is a part of our scene. We are fortunate to have their music on the TO THE TOP soundtrack. So make sure to play with headphones on and turn it all the way up! Musical Artists Capyac Mirror Mask Night Drive Slooom Sip Sip And special guests Future Islands Available for Arcades on SpringboardVR TO THE TOP is an independent project created by Electric Hat Games LLC",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/509250/header.jpg?t=1569022917",
    "Price": 19.99,
    "Developers": "Electric Hat Games LLC.",
    "Publishers": "Electric Hat Games LLC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_452052cbd4042e8aad755a61840f1c346392fa41.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_d567b626e2c0cca7d6871d38509cd04e3f0cd12b.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_d49624da9305a4d345d2ffbc65dd132f3e345786.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_caaf8657c0f6c3021f44ba0a7169e832df114489.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_6216c50a29d01abce9f803b72170c7a7cf5ab8b2.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_29b12a640c6876a2b0c2051081ca3e82b4b94b94.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_fbff01f1132cd8cea6939b512690a8e8bc15f305.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_d9fb1cb4e81b3fe5f1be4894d36542f4ff33821d.1920x1080.jpg?t=1569022917,https://cdn.akamai.steamstatic.com/steam/apps/509250/ss_ff192004ad4b53c5db7fab43d347557275d0e189.1920x1080.jpg?t=1569022917",
    "Slug": "to-the-top",
    "Meta Title": "TO THE TOP: May 18, 2017, Electric Hat Games LLC. and Ful...",
    "Meta Description": "Looking for information on TO THE TOP? Check out the release date (May 18, 2017), developer insights from Electric Hat Games LLC., and a complete game s...",
    "Alt Text Image": "Official header image for TO THE TOP game - Steam 509250",
    "Canonical URL": "https://gusku.site/game/to-the-top",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TO THE TOP\", \"description\": \"Looking for information on TO THE TOP? Check out the release date (May 18, 2017), developer insights from Electric Hat Games LLC., and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Electric Hat Games LLC.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electric Hat Games LLC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/509250/header.jpg?t=1569022917\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}