{
    "AppID": 1221390,
    "Name": "VOXEL HORIZON",
    "Release date": "Apr 14, 2020",
    "About the game": "Create your own voxel world! Collaborate with your friends in your own level! Battle over destructible terrain! The game was never inspired by the very famous digging game. Instead, some inspiration came from Warroid for MSX (1986). The game has the following features: Massively Multiplayer Online Game (1000 players per server) Players can create various terrain structures. Players can fight against other players or bots. Players can create private levels where they can invite their friends to build structures together or battle against each other. All terrains and structures are stored on the server. The client streams the voxel data from the server. Players can run their own servers on their PCs. These servers can be accessed by anyone on the Internet. The planned features include: Additional character classes Co-op boss fight Player-to-player trading more items About Dedicated Server In the single-player mode(virtual server), you can only edit, save, and load voxel worlds. In the online mode(public server or private server), all game features are available. Public servers are provided and maintained by the developer. They are located in Japan, East US, West US, and West Europe regions, and will be available for at least one year from the release date. After one year, the public servers may be shut down depending on the developer's financial situation. Even if the unfortunate event occurs, you can still continue to build your world in private servers. Private servers are available with the initial release and can be used anytime without any time limit. About Game Updates This game is being developed and maintained by a single person. The developer considers this game a lifelong project and plans to provide updates for many years to come. However, depending on the developer's financial situation, this might not be feasible. Some features are not fully implemented yet, so please review currently available features before making the purchase decision. Refund Policy We adhere by Steam's refund policy. As mentioned above, some features are not fully implemented. Please review currently available features before buying this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1221390/header.jpg?t=1648556165",
    "Price": 9.99,
    "Developers": "Ice Shovel Soft",
    "Publishers": "Ice Shovel Soft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1221390/ss_907356f51639f17f7a7baa38925b75afba420f2a.1920x1080.jpg?t=1648556165,https://cdn.akamai.steamstatic.com/steam/apps/1221390/ss_d529d2edffcfee64e7f4452daf557f1fc18301a4.1920x1080.jpg?t=1648556165,https://cdn.akamai.steamstatic.com/steam/apps/1221390/ss_3cba6ca96b939e000a4ff287f41ac18a05a12776.1920x1080.jpg?t=1648556165,https://cdn.akamai.steamstatic.com/steam/apps/1221390/ss_5d66218a5579138809dbeab5477374a463011722.1920x1080.jpg?t=1648556165,https://cdn.akamai.steamstatic.com/steam/apps/1221390/ss_c8ae5b157598fdd669f17a8f86c1dcc2fcd0e2b5.1920x1080.jpg?t=1648556165,https://cdn.akamai.steamstatic.com/steam/apps/1221390/ss_b5e07b0868ec9b7194f3a74a99dc76be93e21632.1920x1080.jpg?t=1648556165",
    "Slug": "voxel-horizon",
    "Meta Title": "VOXEL HORIZON: Apr 14, 2020, Ice Shovel Soft and Full Ove...",
    "Meta Description": "Looking for information on VOXEL HORIZON? Check out the release date (Apr 14, 2020), developer insights from Ice Shovel Soft, and a complete game summary.",
    "Alt Text Image": "Official header image for VOXEL HORIZON game - Steam 1221390",
    "Canonical URL": "https://gusku.site/game/voxel-horizon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VOXEL HORIZON\", \"description\": \"Looking for information on VOXEL HORIZON? Check out the release date (Apr 14, 2020), developer insights from Ice Shovel Soft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ice Shovel Soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ice Shovel Soft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1221390/header.jpg?t=1648556165\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}