{
    "AppID": 509170,
    "Name": "VRNinja",
    "Release date": "Sep 14, 2016",
    "About the game": "Breathe, Focus… But Don’t Forget To Duck! Enter the world of VRNinja, a fast-paced virtual reality game that challenges you to dodge and duck your way past flurries of flying weapons. With three scenic Japanese environments to experience and two challenging modes of play, VRNinja will put your reflexes to the test as you train to become the ultimate ninja master. Which Weapon Will Be Your Undoing? Each weapon in the ninja’s arsenal serves a different purpose, whether it is to trick you into letting your guard down or to overwhelm you with bombastic force. You’ll need to keep your wits about you and your body moving to outlast the ninja’s deadly onslaught. Simple Controls, Yet Difficult To Master. Playing VRNinja is as simple as plugging in your VR headset, booting up the game, and dodging your way to victory. No extra controllers or peripherals required. About VRNinja is a fast-paced virtual reality game that challenges players to dodge their way past flurries of deadly weapons as they train to become the ultimate ninja master. Set in the scenic landscapes and locales of Japan, VRNinja transports players into a fully immersive virtual world where quick reflexes and razor-sharp focus are paramount to survival. Feeling competitive? Invite your friends and family over to compete against you in VRNinja’s challenging Arcade Mode! Will you outlast your rivals? Or will you fall flat in your attempt to perform a sick Matrix-inspired backbend? VRNinja is a perfect party game for all-ages. Go ahead and try not to crack a smile as you watch your friends contort, crouch, and cringe their way past waves of invisible projectiles. Powered by Unreal Engine 4, VRNinja makes full use of the latest in VR technology, integrating 3D positional audio and head-tracking to craft a gameplay experience welcoming to newcomers and experienced VR gamers alike. Features Pick Up And Play Controls: There are few movements as natural to humans as the instinct to dodge when something is flying at your face. VRNinja makes the most of this by only requiring a VR headset to play; no additional peripherals or controllers required! Two Modes of Play: In Campaign Mode, you will be pitted against increasingly difficult waves of projectiles as you advance through the game’s three unique environments. Complete each area to unlock it in the tremendously challenging and endless Arcade Mode! Three Beautiful Japanese-Inspired Levels: Explore the peaceful Dojo, the steamy Hot Springs, and the spooky Nighttime levels! Each new area you discover introduces a new distraction that will test your observational skills and focus. Four Ninjutsu Weapons To Avoid: Quickly identify the patterns of incoming projectiles to survive! Each weapon has its own trajectory, whether it’s the straight-flying Kunai, the swirling and twirling Rockets, or the curving Shuriken. On top of the basic projectiles, you’ll also have to contend with the deadly Kunai Bombs. When their timer hits zero, they’ll explode and shower you with Kunai! Super Slow-Mo Ramen Power: Feeling overwhelmed? Take a break and slow down time by catching a flying bowl of ramen! This power-up is only temporary though -- make sure you’re ready once the knives start flying! Notes VRNinja is compatible with the Oculus Rift DK2 as well as the CV1.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/509170/header.jpg?t=1489773248",
    "Price": 9.99,
    "Developers": "OutOfBounds Software Solutions Inc",
    "Publishers": "OutOfBounds Software Solutions Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/509170/ss_e72ac7cc265f5fe46775e163655a756f838d56a1.1920x1080.jpg?t=1489773248,https://cdn.akamai.steamstatic.com/steam/apps/509170/ss_081946f096e852bb5a9dd710c0abe818c4349029.1920x1080.jpg?t=1489773248,https://cdn.akamai.steamstatic.com/steam/apps/509170/ss_f779ec21be6e06791f57ecf16a12cccf0bf71d53.1920x1080.jpg?t=1489773248,https://cdn.akamai.steamstatic.com/steam/apps/509170/ss_9151fb3b27ad10fcfcd0862c8a214f1b0f122814.1920x1080.jpg?t=1489773248,https://cdn.akamai.steamstatic.com/steam/apps/509170/ss_2332641bbdcdca614f908ef8011993683bd3b04c.1920x1080.jpg?t=1489773248,https://cdn.akamai.steamstatic.com/steam/apps/509170/ss_be1c5abeaa9f05d1f1a41105246d519fe7e0fa9f.1920x1080.jpg?t=1489773248",
    "Slug": "vrninja",
    "Meta Title": "VRNinja: Sep 14, 2016, OutOfBounds Software Solutions Inc...",
    "Meta Description": "Looking for information on VRNinja? Check out the release date (Sep 14, 2016), developer insights from OutOfBounds Software Solutions Inc, and a complet...",
    "Alt Text Image": "Official header image for VRNinja game - Steam 509170",
    "Canonical URL": "https://gusku.site/game/vrninja",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VRNinja\", \"description\": \"Looking for information on VRNinja? Check out the release date (Sep 14, 2016), developer insights from OutOfBounds Software Solutions Inc, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"OutOfBounds Software Solutions Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OutOfBounds Software Solutions Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/509170/header.jpg?t=1489773248\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}