{
    "AppID": 424030,
    "Name": "War of Rights",
    "Release date": "Dec 3, 2018",
    "About the game": "War of Rights is a multiplayer game set during the perilous days of the American Civil War, in the Maryland Campaign of September, 1862. Campfire Games is devoted to presenting the gruesome and glorious elements of the period, while maintaining the highest level of historical accuracy and realism as is possible with the wonders of CRYENGINE. ⠀⠀⠀⠀⠀⠀ - Massive battles: Take part in engagements consisting of 300 players. - Tailored for line formation teamplay: Custom formation buff mechanic system rewards sticking together by lessening the suppression effects, the morale cost for the team when dying and the flag bearer respawn rate. - Multiple army branches: Fall in on the line as an infantryman or shatter the fighting spirit of the enemy as an artillery crewman! - Historical accuracy: Period correct uniforms, weapons, manual of arms animations, battlefields, objectives &amp; drill camps. - Regimental pride: 135 researched and recreated regiments &amp; batteries all supporting uniforms for all ranks (Private to Colonel) and player classes. ⠀⠀⠀⠀⠀⠀ - Immersive communication: In-game 3D voice system. - Recreated battlefields: More than 30 historically accurate skirmish areas of the Battles of Antietam and South Mountain as well as the Siege of Harpers Ferry to play on and three drill camps to perfect your formation forming abilities or simply exchange battle stories at the campfire. - Player classes: Private, NCO, Flag Bearer, Drummer, Bugler, Fifer &amp; Officer playable from every regiment &amp; battery featured and covering all ranks from Private to Colonel. - Community focus: A strong company (player organized clans) focus with a dedicated company tool and forum sections devoted to in-game event creation. ⠀⠀⠀⠀⠀⠀ - Powerful game engine: Powered by CRYENGINE V, War of Rights is capable of providing visuals unmatched by any other Civil War game. - More than a game: War of Rights is a vision that keeps expanding its scale. The project is entirely crowdfunded and has been developed on for the past 6 years. We consider it more of an ever evolving artistic piece rather than a final product with a targeted release deadline with set features. Players in the game will be able to play on multiple battlefields of the campaign, from the confluence of the Potomac and Shenandoah Rivers where the Siege of Harper's Ferry took place, to the ridgelines of South Mountain, and to the meandering waters of Antietam Creek at the Battle of Antietam. Additionally, players will also be able to choose from a list of regiments that fought in each battle as well as what rank to fight as, whether they want to slog it out as a lowly private, or if you want to orchestrate the carnage and mayhem as a major general. ⠀⠀⠀⠀⠀⠀ Uniforms and bodily features will all be customizable for other players to see as you march and fight in the lines of battle according to the tactics of the period. As a General, you will operate in your headquarters equipped with a map of the battlefield and constantly receiving reports of friendly and enemy positions. Send out new orders to the regiments to move forward, or fall back - all in real time. The orders will move down the chain of command, to the Colonels, Majors, down to the Captains in charge of the individual regiments, all of whom have the option to follow the orders of their trusted commander, or rebel against his wishes and fight as you see fit. ⠀⠀⠀⠀⠀⠀ Each map contains a period reconstruction of the buildings, farms, forests, roads, and rocks as they were in 1862 so players can fight through the streets of Harper's Ferry, in the wooded heights of Fox's Gap at South Mountain, or in the cornfields and Bloody Lanes of Antietam. Players can feel the whiz of deadly shot and shell fly by their bodies, or hit their comrades or themselves as they scream in a bloody hail from their wounds. Limbs will fly and blood will be spilt once again as Campfire Games brings the fighting of the Civil War right to the player's computer screen! ⠀⠀⠀⠀⠀⠀ Will you heed the Union call against the traitors? Or will you fight to defend your family and livelihood with the Confederacy? You decide! ⠀⠀⠀⠀⠀⠀ We thought it a good idea to recreate/repost our Early Access roadmap as a lot of players having joined us recently are unlikely to know what we are intending to offer as the game advances in its development. The below roadmap should be taken for what it is - a preliminary list of things we have planned for. As all plans are subject to change, there is a great chance that the list will also end up changing, however. The order of the roadmap is also subject to change as the development moves ahead. Some things listed may arrive a great deal sooner or later than what their listing order indicates. 1. Bug fixes, stability improvements: This will be an ongoing focus throughout the development of the game. An alpha is never without its bugs. New content rarely comes without its fair share of bugs and issues required to fix up. 2. Performance improvements: We are well aware of the performance of the alpha is needing to be improved - especially at higher playercounts. Major programming work is currently going into reworking the most expensive part of the game at high playercounts. Once finished you should all be experiencing much better framerates on populated servers. 3. Expanded server moderation tools: This will allow server administrators more control to manage and configure their server using commands such as: kick,ban,change map, change skirmish area, change weather and time of day. 4. Improved melee: Melee is going to be receiving a much needed overhaul, including the availability of a parry move and animation kill sequences between two players (“kill-moves”) to increase the visual fidelity of close quarter fighting. 5. New battlefields: The Battles of South Mountain and Shepherdstown will eventually complete the Maryland Campaign of 1862. 6. Historical Battles mode: Besides the quicker Skirmish mode, the largest and main game mode intended for the game, known as Historical Battles, would open up the entirety of the 4x4 km battlefields for more of a complete playthrough, with a moving frontline consisting of several capture areas. This will also entail the use of the full chain of command where players take the part of Generals, using maps and couriers to direct troops across the huge battlefield. 7. Generals: The chain of command on the battlefield will be expanded with the addition of generals. Generals bring a tactical overview to the battle that all other classes lack, helping to command the troops when using the historical battles mode, helping to bring some order to the chaos of war. 8. Cavalry: Horses are to be implemented for both cavalry units, moving artillery pieces, as well as for the high command and their couriers. The cavalry was still an important branch of the armies of the period considering the changes in technology, acting as reconnaissance and quick response units as understandings for their use developed over the period of the war. 9. Final Release: Once the above features have been finished, we will be at the point that we would be just about ready for full release of the game to all and sundry! This final release would also be the point that those that had backed us originally would be getting their promised physical and digital goods. While we cannot give any definite date as to when we might get to release, we inch closer every day!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/424030/header.jpg?t=1649485227",
    "Price": 29.99,
    "Developers": "Campfire Games",
    "Publishers": "Campfire Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_500924bcf36b82ba34bf931559ab4f89f4804312.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_8f20376375fb5a67c51caad396e9a23be4a92bca.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_7bd3ef7ebd3fd524c5f1bc076f724fa92977d145.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_f9c69511e676bf4ecc16d599e9a235b25dbec5fb.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_3be52aa5ba6e899647f2c80b3580720415ccdea9.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_3facd4305a7ba1a2ed7527e6297dd2b98e2dc793.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_2f9702dd2d246d679c94b331815d2c6f03568f82.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_5ec6f9a13ff6034afe06a33d2a4d53f44401b9b0.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_70e89879ee1b7096bfc5b97fdbc3f06ba0925c0b.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_a4d1d8433fbd114fb4453b32843d1cb8a2369938.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_287486fc4d6981a350353aea0289044b6aec4a37.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_1985c4384231296ee1c937d463381d24b29f8765.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_79af5361d05d407d52e26c4b4f1d305314409d96.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_b1ba72369e8d005bb5962430488b7c510c34a288.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_d2bf231d3b527918a64a0daf093d801910709645.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_60c3ae7579d387a74e745d74ab34e7a998992064.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_9df4728b4c00f6ed338857434a95375b6b4b0c37.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_db8fe756f88901ef59f81523388cfc8b7c8168ff.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_9a2a74fdc036c7403ea0a478bd6b1258d5c5f550.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_7baacc0de9fc027be4560141615500a41dcf78b0.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_6ebbb5500a8df2dd4e64270b59033333319a1058.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_7c864c6988d7889ea42c5c0b1b8c3e0f29f1a1f0.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_40814f23a3a375eeebbdc80497adb06de1636bed.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_bd4a5e79ad78425e39863bad9a774207208bef92.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_0736060493701dee7e48ff0d924374fe0025234e.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_a657690643ddb2b81660eabd7afc2c56f150b0e8.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_6ec4685ac39e9b478925ab1644c6f050d0a6c92c.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_e7029c200a43a6e04cae02b77650854273b2199f.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_eb1ae52e90de8cb86409a4749c7aea102d3cbb28.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_98ba4fd7d72ede4b0718129d9d1276e53b6ab321.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_2d1ab376623aaa067321d6c864cb5bd340e8f129.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_583ca56cd06974ff8babac4b95bc5f043d383d76.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_214275b58563707b196dd8d6a16fb0abf6585f76.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_0db91265bef3c0317ce2d7f9177a1390b03b7699.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_384180880c1caec9167ecde72f2eebce80b7afcc.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_173a8a18cae91a6ff4a58dbb1ea84cd1771acc0f.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_3ac8cfeebc2e13919b17258123857fb15ac358b9.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_4e71e601c93fe2ce50067919cf27d83ae9db18e8.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_7349b8a69b1c1858e786e958fbd00ada20ecc44e.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_170d1c29756a31a2308ca8d2e6880b9cedc919b1.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_961cfc0d8e0580889b55afb17068d4f8ff763f1f.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_625a0c106b088f2ea02f81f288c81051b3f0595d.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_9a2ed5ebc48829cd28440be17c787c0be4d855f2.1920x1080.jpg?t=1649485227,https://cdn.akamai.steamstatic.com/steam/apps/424030/ss_e25963c0db818adde1ca6b7ae840990ff8e1ec1f.1920x1080.jpg?t=1649485227",
    "Slug": "war-of-rights",
    "Meta Title": "War of Rights: Dec 3, 2018, Campfire Games and Full Overview",
    "Meta Description": "Looking for information on War of Rights? Check out the release date (Dec 3, 2018), developer insights from Campfire Games, and a complete game summary.",
    "Alt Text Image": "Official header image for War of Rights game - Steam 424030",
    "Canonical URL": "https://gusku.site/game/war-of-rights",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"War of Rights\", \"description\": \"Looking for information on War of Rights? Check out the release date (Dec 3, 2018), developer insights from Campfire Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Campfire Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Campfire Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/424030/header.jpg?t=1649485227\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}