{
    "AppID": 970900,
    "Name": "1001 Jigsaw. Home Sweet Home",
    "Release date": "Dec 10, 2018",
    "About the game": "1001 Jigsaw. World Tour: Home Sweet Home is an exciting puzzle game and a fantastic opportunity to feel the warmth and comfort of being at home. Assemble jigsaws from a multitude of pieces and make your house a home in 500 high-quality photos. Now you can play your favorite puzzle game and feel like you're at home no matter where you are! For more exciting and comfortable gameplay, we've provided a bunch of opportunities! Set a difficulty for each puzzle to suit you – choose the number of jigsaw pieces, their angle and the turn function! Save your progress at any time and come back to assembling your saved jigsaws whenever you want! Simple controls and a bunch of hints and tools make the game more comfortable. With configuration options like this, the game is accessible both to new players and true professionals in the puzzle game genre. Get ready for bright sunbeams cascading across your sheets, the pitter-patter of feet on the stairs, the crunching of toast and oatmeal... The rustling of the morning paper and the dog barking outside... Cool water in the pool and the smell of freshly-cut grass... Dinner with the whole family, a rocking chair by the fireplace and so much more to stir up your deepest memories of home sweet home! Decor, interior design, family and comfort await! 1001 Jigsaw. World Tour: Home Sweet Home is a game and a source for inspiration. 500 high-quality photographs of vivid and delicious puzzles that will make your heart flutter. Here you can get inspired and host an unforgettable family celebration, choose the decor and interior design, and make the home your own. A warm and one-of-a-kind mind teaser game! Go ahead and dive in today! - 500 high quality unique images - Well designed game-play: useful hints, sort tool and magnifying glass. - Optional game difficulty control makes your gameplay infinite - Custom styles of pieces with rotation - Save game progress and continue to collect the puzzle at any time - Tasks and colorful trophies for those who love excitement - Pleasant and relaxing music - Get 500 puzzles for one purchase. It is beneficial!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/970900/header.jpg?t=1544450828",
    "Price": 4.99,
    "Developers": "Creobit",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/970900/ss_50d11b00be0017e160366647e6d5963845e6a4c7.1920x1080.jpg?t=1544450828,https://cdn.akamai.steamstatic.com/steam/apps/970900/ss_f80a552b072806cd479f4f9c2affd9a90ad8c27e.1920x1080.jpg?t=1544450828,https://cdn.akamai.steamstatic.com/steam/apps/970900/ss_fa3cf3e8aa3a927ae35c84e8e4515691ecea40e1.1920x1080.jpg?t=1544450828,https://cdn.akamai.steamstatic.com/steam/apps/970900/ss_0a30b8479c7013dd8bc25ce9e1e00b73d8121c9f.1920x1080.jpg?t=1544450828,https://cdn.akamai.steamstatic.com/steam/apps/970900/ss_dcf86af54958f1ae260fecb5514bc667d770a75a.1920x1080.jpg?t=1544450828,https://cdn.akamai.steamstatic.com/steam/apps/970900/ss_998d99996909ee2ccb1d177cb1c106ebb79ff53e.1920x1080.jpg?t=1544450828",
    "Slug": "1001-jigsaw-home-sweet-home",
    "Meta Title": "1001 Jigsaw. Home Sweet Home: Dec 10, 2018, Creobit and F...",
    "Meta Description": "Looking for information on 1001 Jigsaw. Home Sweet Home? Check out the release date (Dec 10, 2018), developer insights from Creobit, and a complete game...",
    "Alt Text Image": "Official header image for 1001 Jigsaw. Home Sweet Home game - Steam 970900",
    "Canonical URL": "https://gusku.site/game/1001-jigsaw-home-sweet-home",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"1001 Jigsaw. Home Sweet Home\", \"description\": \"Looking for information on 1001 Jigsaw. Home Sweet Home? Check out the release date (Dec 10, 2018), developer insights from Creobit, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/970900/header.jpg?t=1544450828\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}