{
    "AppID": 1502080,
    "Name": "ALTDEUS: Beyond Chronos",
    "Release date": "Feb 18, 2021",
    "About the game": "The best-rated paid Oculus Quest App as of January 2021 according to Road to VR! Won the Adventure Category Award for the Famitsu/Dengeki 2020 Game Awards! *Famitsu is the most prestigious video game magazine starting in 1986 in Japan Note: This game contains multiple unlockable paths - don't stop playing at the first credits roll! This isn’t a dream... Dive 300 years into the future of Tokyo. ALTDEUS features 15-20 hours of gameplay with one of the largest branching storylines ever in a VR game. Become Chloe, a mecha pilot who will have her revenge and annihilate the Meteora once and for all. Pilot a giant mecha and make the decisions to determine humanity’s future. Converse with other characters and seek clues in the Adventure Section. The Mecha Battle Section is where things get rough, as you enter the cockpit of Makhia, the towering humanoid anti-Meteora combat weapon. Your choices and actions branch the story leading to multiple-endings. Features: Mecha Battle Section: Your actions in this section lead to different stories. You can enjoy stellar VR concerts. The Libra AI suggests possible choices for you in the Adventure section. Interact with objects in real-time and solve mysteries. This game has high ratings from game media including an 80 Metacritic score. You can experience the anime mecha battles of your childhood dreams and immerse yourself in the deep story of this world. Story: The year 2280. Humanity sought safety and salvation deep underground, establishing Augmented Tokyo. This 2km radius underground city became humanity's last bastion. Chloe, a member of the Anti-Meteora military organization Prometheus, defends the city in her Makhia, a massive battle robot, battles against the Meteoras, alien beings of immense size and strength, with her companions. Everything she does, she does for her fallen friend. Her dearest friend. Coco. Everything Chloe does is to avenge Coco. Crucial choices and decisions are coming to you next by next. Can you pull the trigger? This game is highly recommended for people... looking for a VR game with a lengthy story and replayability who love story-oriented games, anime, or movies who love games but are not good at playing difficult ones looking for a game that doesn’t cause motion sickness wanting to be passionate with their childhood dream experiences wanting to pilot a mecha of their very own",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1502080/header.jpg?t=1652755026",
    "Price": 17.99,
    "Developers": "MyDearest Inc.",
    "Publishers": "MyDearest Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1502080/ss_501ea2c58b1dbb715feefa351c3f985a95bf5d7c.1920x1080.jpg?t=1652755026,https://cdn.akamai.steamstatic.com/steam/apps/1502080/ss_0fe65e6555246d3f3069dcf4e189fdab860bc746.1920x1080.jpg?t=1652755026,https://cdn.akamai.steamstatic.com/steam/apps/1502080/ss_1c340be6a57e5acb7a44089c93591d596ddab2a3.1920x1080.jpg?t=1652755026,https://cdn.akamai.steamstatic.com/steam/apps/1502080/ss_720e5867e6d777ca20d1a19b5a579f81607f84bd.1920x1080.jpg?t=1652755026,https://cdn.akamai.steamstatic.com/steam/apps/1502080/ss_522c90b92a4b7a1b0f3e6414eb076515a5e0c2d6.1920x1080.jpg?t=1652755026",
    "Slug": "altdeus-beyond-chronos",
    "Meta Title": "ALTDEUS: Beyond Chronos: Feb 18, 2021, MyDearest Inc. and...",
    "Meta Description": "Looking for information on ALTDEUS: Beyond Chronos? Check out the release date (Feb 18, 2021), developer insights from MyDearest Inc., and a complete ga...",
    "Alt Text Image": "Official header image for ALTDEUS: Beyond Chronos game - Steam 1502080",
    "Canonical URL": "https://gusku.site/game/altdeus-beyond-chronos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ALTDEUS: Beyond Chronos\", \"description\": \"Looking for information on ALTDEUS: Beyond Chronos? Check out the release date (Feb 18, 2021), developer insights from MyDearest Inc., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MyDearest Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MyDearest Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1502080/header.jpg?t=1652755026\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}