{
    "AppID": 536270,
    "Name": "Ancestors: The Humankind Odyssey",
    "Release date": "Aug 27, 2020",
    "About the game": "Ancestors: The Humankind Odyssey is a third-person open world survival game where you Explore, Expand, and Evolve to advance your clan to the next generation in this exhilarating new adventure from Panache Digital Games. Embark on the most incredible odyssey known to humankind: human evolution. Spanning from 10 million to 2 million years ago, begin your journey, before us, in Neogene period Africa. Explore a beautiful yet ruthless world, from swinging through tree branches in the jungle to stalking prey across the golden savannah grasslands. Decide what attributes to learn and hone in order to pass down knowledge to future generations, from crafting tools to enhancing evasive tactics against predators. Just like real life, make sure to eat, drink, and sleep to stay alive and have the energy to face any danger that may come your way. Grow your clan and find strength in numbers as you progress through critical evolutionary stages of human evolution. Your choices will write your clan’s story and determine if you can survive your evolution. Explore Ruthless Africa Explore the never-before-experienced world of Neogene Africa starting 10 million years ago at the dawn of humankind. From the tops of tree canopies overlooking lush jungles to the golden grasslands of the savannah, traverse a beautiful yet unforgiving landscape. For every breath-taking view, beware of the weather, predators, and other dangers that threaten your survival. Expand Your Territory and Grow Your Clan Increase your chances of survival by uniting new members of your species and giving birth to future generations. Control different clan members, form bonds to create families, and work together to intimidate predators during expeditions. Conquer fear as you explore unknown locations in order to expand your territory. Evolve Through Multiple Generations See the physical and intellectual evolution of the first hominids as you explore, learn, and survive. Spanning from 10 million to 2 million years ago, play as one of the first hominids and evolve over the course of millions of years during key stages in human evolution. Make crucial discoveries and hone physical abilities that will be passed down to future generations such as Ardipithecus ramidus and Australopithecus. Choose How You Survive Evolution was not written in stone. Your decisions shape how you will overcome obstacles, increase your species, and what knowledge will pass on to future generations. Focus on specific attributes or choose a more balanced approach to survival. Your clan’s ability to survive will be directly impacted by your choices, making each player’s experience unique.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/536270/header.jpg?t=1627497373",
    "Price": 39.99,
    "Developers": "Panache Digital Games",
    "Publishers": "Private Division",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_b7a3615ae6f8a5886c5d3b72c3ed08ae0b4249e2.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_a04daacab5e13d844c1473b106a98bdb439de732.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_27e876bf51d87b638f4f59e96b117dcc83e32692.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_9cde7b2bc09fc72064844758c4c3fd17478d0c78.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_a526a2c3cf24be8bfefb6d3da92792c6fe0321ef.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_ff3e62604bc8b64a0a8aa185bb818ade9e9624a0.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_d5a44ed85ced7b40da0f39054fccc4aa27e3a93b.1920x1080.jpg?t=1627497373,https://cdn.akamai.steamstatic.com/steam/apps/536270/ss_cc8326f6ba23091dc76a5abe5d2cc2e94153ae18.1920x1080.jpg?t=1627497373",
    "Slug": "ancestors-the-humankind-odyssey",
    "Meta Title": "Ancestors: The Humankind Odyssey: Aug 27, 2020, Panache D...",
    "Meta Description": "Looking for information on Ancestors: The Humankind Odyssey? Check out the release date (Aug 27, 2020), developer insights from Panache Digital Games, a...",
    "Alt Text Image": "Official header image for Ancestors: The Humankind Odyssey game - Steam 536270",
    "Canonical URL": "https://gusku.site/game/ancestors-the-humankind-odyssey",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ancestors: The Humankind Odyssey\", \"description\": \"Looking for information on Ancestors: The Humankind Odyssey? Check out the release date (Aug 27, 2020), developer insights from Panache Digital Games, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Panache Digital Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Private Division\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/536270/header.jpg?t=1627497373\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}