{
    "AppID": 1272240,
    "Name": "Beat The Machine: Rebooted",
    "Release date": "Jul 14, 2020",
    "About the game": "Game Description: Beat the Machine: Rebooted is a top down retro arcade shooter where you must defeat the virus T.O.M (Totally Overpowered Machine) that is invading Sector VIII. Play as Damon, the cocky cadet, willing to aid Sector VIII from total destruction. Guided by Logan, Syncopia and Pete, natives of Sector VIII, traverse across 25 levels corrupted by T.O.M’s virus brigade. Story: Beat the Machine: Rebooted is a story of a fictitious world inside of a computer. The story takes place inside of the Origin Sectors with each sector acting as its own motherboard. T.O.M, the main antagonist, wishes to gain control of each Sector in an attempt to make a supercomputer from all the Origin Sectors' computer components. Sector VIII is the last surviving Sector and the smallest of all 11 sectors. Damon, the protagonist is the last hope of saving the Sectors and restoring the Origin Sectors to what it once was. You must stop T.O.M before he gains World domination. Skill Tree: Choose your way to play with over 5,000,000 skill combinations. Choose to upgrade stats like Rate of Fire, Damage, Armor and more. Take down crowds of enemies with Time Capsule’s Area of Effect slowing power and damage over time. Maneuver your way through levels with Wave Dash, a repositioning dash ability. Liking Wave Dash? Upgrade it to afflict damage on each enemy you travel through. Blast enemies away with Pulse Blast and cause them to spin out with Nano-Tornado. Is straight-up damage your Forte? Try using Engine Burst to deal massive damage in a huge explosion around the XV9 ship. Want to lower your cooldowns? We got skills for that too! Levels and Objectives : Each level has their own unique objectives. Come up with new strategies to find the best or fastest way to clear each level. The game also features 9 unique enemy types with varying levels of difficulty, along with 5 unique bosses. The game also features 3 game modes: Casual, Advanced and Nightmare. Casual allows for unlimited skill resets, Advanced mode allows for 0 resets and Nightmare reduces the total amount of skills you can take. Dodge your way through hazardous zones and Wave Dash your way in landing that killing blow on that pesky enemy. Difficulty: Beat the Machine: Rebooted was designed to be a game that has a ramping difficulty. Although there are not checkpoints in any level, your progress is saved after reaching the end zone of each level. Beat the Machine: Rebooted brings the right amount of frustration and the perfect amount of opportunity to improve your play as you defeat the evil creations of T.O.M. Controller Support: To experience Beat the Machine: Rebooted to its fullest potential, we recommend a controller to play. Use your favorite controller to take down enemies. Need to drop Time Capsule or Automated XV9-Bot in the right place? Use our unique targeting indicator system to drop the ability in the place of your choice with a controller, or just aim your cursor with Keyboard and Mouse. Survival Mode: Beat the Machine: Rebooted also features an endless survival mode, in which you try to survive as long as possible without taking lethal damage. Survival features the fan favorite skills to unlock. Earn credits for shooting enemies and spend credits to buy upgrades for the XV9 ship. Customizations: Customize your ship with a selection of 12+ paint colors, each of the paint colors is unlocked by completing achievements built into Steam. Unlocking all achievements awards you with a special paint color to show your completion and dedication to this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1272240/header.jpg?t=1650827734",
    "Price": 19.99,
    "Developers": "Sanguine Studios",
    "Publishers": "Sanguine Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_3e2dd98e3d14ae7878711b95f23f1bc75121453b.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_939e93451d3a87ac559f7b2853e32f09d8990122.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_aa0bca2b97602896342fd814523f1dd5513f06b7.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_84e3467ff642fcc0f35b97c60dc4cdb0eb4b68ac.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_0f704138bea6558f2e20802fc4392e50f9f419fe.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_bae42dd554c5f64352e456abe228bebe43fa23ec.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_c886de50c5dfe518b1a5cdaa0d278f9fb25ce113.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_9d5706127749c876e35f8f77488737a7b3b423f6.1920x1080.jpg?t=1650827734,https://cdn.akamai.steamstatic.com/steam/apps/1272240/ss_9dcce40e0eea8ddc22fd84f55931e4e25b84690b.1920x1080.jpg?t=1650827734",
    "Slug": "beat-the-machine-rebooted",
    "Meta Title": "Beat The Machine: Rebooted: Jul 14, 2020, Sanguine Studio...",
    "Meta Description": "Looking for information on Beat The Machine: Rebooted? Check out the release date (Jul 14, 2020), developer insights from Sanguine Studios, and a comple...",
    "Alt Text Image": "Official header image for Beat The Machine: Rebooted game - Steam 1272240",
    "Canonical URL": "https://gusku.site/game/beat-the-machine-rebooted",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beat The Machine: Rebooted\", \"description\": \"Looking for information on Beat The Machine: Rebooted? Check out the release date (Jul 14, 2020), developer insights from Sanguine Studios, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sanguine Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sanguine Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1272240/header.jpg?t=1650827734\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}