{
    "AppID": 1977900,
    "Name": "Bonza Boom",
    "Release date": "Jul 1, 2022",
    "About the game": "Hey, get ready to face the most exciting shooting battle between cute animals! Bonza Boom is a new turn-based battle shooting game. Shooting each other to get a glory victory and collect golden crowns! Use them to unlock different battle scenes to challenge other players in all places around the world and get exceptional card prizes! Keeping the winning streak helps increase the number of silver leaves and trophies, as well as unlocking different aircraft. When tired of fighting, you can also go to the Challenge Mode to experience different gameplay, and go to the Online Multiplayers gameplay to chat with club members or friends! Dissimilar fruits-bombs create a juicy and tasty explosion! Finish daily quests to get rewards and discover your own shining moments through battles. Come to make your way high up to the peak of our leaderboards in each season.  Features . Turn-based Strategic Shooting Games Shooting each other to get a glory victory and collect golden trophies! . Astonishing Bullet-time Mechanics Play all kinds of tricks in the air like a movie star, vanquish your rivals before you touch the ground, and make your own shooting combo! . Online Multiplayer Mode You can choose a 2V2 or 3V3 room for PK, to fight alongside strangers, or join a club, invite club members to create a team to battle, chat and discuss cards and strategies, etc.; you can also send voice messages in real-time during the battle, and adjust the tactics a step ahead. . Special Bricks and Traps Be care of the explosive terrains in the hot volcano and the rising acid pool in the abandoned factory! Beat your enemy by taking advantage of the special mechanics of battle scenes! . A Wide Variety Of Battle Scenes From Quiet Forest to the Glorious Glaciers, from Sweet Paradise to the Vast Desert, you will battle with adversaries in distinct areas all around the universe! . Over 50 Cards All Have their Own Special Power From explosive bombs to stunning tricks, we have all the imaginations in your wildest dream. . Special Events With A Distinctive Gameplay Diverse events open on weekdays or weekends. Try assorted events and win gold coins, even acorn rewards! Experience all our cards in the draft challenge and win 5 times in a row to get the increasing ultimate reward. . A Number Of Cute and Colorful Characters. Each one has its own unique skin and skill. Meet your new friends and beat other competitors! . 40+ Vivid Stickers Make a laughing face when you get thoroughly defeated in the battle or give a kiss when you meet your favorite character! . Personalized Name and Flags Express yourself by customizing your name, choosing different flags, finding friends in the same camp, challenging players from all over the world, and fighting for the honor of the country! Bonza Boom is a completely fun-to-play game while you can still use coins to accelerate your game's progression. And you can also get free rewards by playing matches or other ways. A good network condition will help you play brilliant combos more efficiently in our games. Don't hesitate, play Bonza Boom right now! Hope you like our game and have fun! If you have any suggestions or questions, please feel free to contact us anytime. We will do our best to solve the issues.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1977900/header.jpg?t=1658300735",
    "Price": 0.99,
    "Developers": "Gillar Limited",
    "Publishers": "Gillar Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_d5511852799c86d80802c706cfa2e4d98dde3794.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_da2d3a8e53ef2bf017f5833e1f0c08ddd38a37c5.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_e100ba5e413e9970b99c00870a385992f774b187.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_825e00e184de7de59c382685ca5147c1154a4012.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_de2d7458c45ad879638290f418107d638a6fdd18.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_85ff8aedbb3759a71887ba760b4a90d04bd1a518.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_79405d36eb13d8d9a9d7dd702ca6edb0faef3cb0.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_fa56ff3437e247e6bc16a86f3d12412f1ea30e0f.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_c7b24a4643399964c1f0fdb7591bd91a465672b4.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_eae867acc4e15e5cad35f85f1811c181136282cd.1920x1080.jpg?t=1658300735,https://cdn.akamai.steamstatic.com/steam/apps/1977900/ss_52581b5ab878406cc226156d60163efa29c6a4a8.1920x1080.jpg?t=1658300735",
    "Slug": "bonza-boom",
    "Meta Title": "Bonza Boom: Jul 1, 2022, Gillar Limited and Full Overview",
    "Meta Description": "Looking for information on Bonza Boom? Check out the release date (Jul 1, 2022), developer insights from Gillar Limited, and a complete game summary.",
    "Alt Text Image": "Official header image for Bonza Boom game - Steam 1977900",
    "Canonical URL": "https://gusku.site/game/bonza-boom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bonza Boom\", \"description\": \"Looking for information on Bonza Boom? Check out the release date (Jul 1, 2022), developer insights from Gillar Limited, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gillar Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gillar Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1977900/header.jpg?t=1658300735\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}