{
    "AppID": 662910,
    "Name": "Cash Crop",
    "Release date": "Aug 3, 2017",
    "About the game": "The Delightfully Fun Cannabis Farming Game! Casual Farming Sim meets Tycoon/RPG gameplay...with Cannabis! The year is 2017 and cannabis is the new green gold rush! It’s the wild west all over again with customers trying to get the best weed, businesses trying to make a buck, and everyone trying to stay out of jail! The marijuana industry is going through a once-in-a-lifetime, end-of-prohibition transformation. Will you get your cut of the profits? Cash Crop fuses the immensely popular RPG/Tycoon Farmer style of gameplay with the culture, humor, and challenges of today’s most popular cash crop! YOUR FARM, YOUR EMPIRE Control your entire grow operation. Choose the strains to grow, design your irrigation and power systems. Run a small organic farm by hand, or a sprawling commercial grow with dozens of crew, multiple locations, and hundreds of plants. Choose the pace and the scale that fits your high goals. ECOLOGY, PLANT RELATIONSHIP Your plants are the heart of your farm. Caring for each of your plants is a fun rewarding challenge to keep them healthy and stress-free. From Sniklefritz to Pineapple Express, each strain has different needs and preferences. Become an expert grower by mastering the individual care of each plant. MORE TOOLS, MORE POWER (insert grunt) From hand tool to power tools, a variety of fun and playful equipment are available for the industrious farmer. Use hoses to water plants from a distance, and hedge trimmers to quickly harvest and tame your crops. HEAT: HiGHER RISK, HIGHER REWARD Do you run a squeaky-clean operation, in full compliance? Or do you risk everything for a shot at fortune? You accumulate Heat for growing more plants than you have a license for and doing business with shady characters. Too much Heat will attract protestors, inspectors, helicopter fly-bys, even DEA raids and shutdowns! Turn up the heat for a more engaging, fast-paced play! Follow all the rules and avoid risk for a more casual experience. YOU'RE NOT ALONE: MEET YOUR QUIRKY CREW Growing all these plants is hard work; hire some friends to MAKE your farm flourish. When you're not directing them, crew members will move about the farm trimming plants, checking water and nutrient levels, and performing other tasks. Their skills will improve with use over time and with better equipment. NEGOTIATE CONTRACTS, MANAGE VENDORS AND CLIENTS Review and apply for a variety of contracts to fulfill. Meet other farmers, store owners, bands, celebrities, and maybe even Big Foot (he loves Sasquatch OG) as you share your crop. Negotiate for every last penny or accept bottom dollar to improve your relationships. TECH TREE: STAFF RESEARCH AND DEVELOPMENT Behind every great bud is a great team. Hire lawyers, gardeners, even street dealers as you expand your operation. Investing in your staff unlocks skills, perks, and abilities for your farm. COMPLEX SYSTEMS: AUTOMATION MAKES YOU STRONGER (and makes it one step closer to the robots taking over) Tired of watering by hand? Work smarter, not harder, by installing pipes and sprinklers to quickly and reliably water your plants. Timers and other control systems can be installed to make managing your crop a breeze. EXPLORE THE PACIFIC NORTHWEST Once your farm is running profitably, adventure onward. Explore Seattle, the Cascades, and more as you hunt for quests, breed new strains, expand to new markets, and find the Easter Eggs we've hidden for you. Open shop in Seattle, or start a grow in Oregon. FARMING: ONLY THE BEGINNING Future releases will include Retail and Processor gameplay. Move on from the farm and run your own chain of stores, glass shop, or an oil processing facility. Future plans also include new markets such as Nevada, California, Texas, and more. The sky is the limit!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/662910/header.jpg?t=1521213800",
    "Price": 15.99,
    "Developers": "Joint Ventures",
    "Publishers": "Joint Ventures",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_0ed5de4cb24e275ee1bdb946b94fde3c17c475a2.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_4267918bba74a50d4c2eb40a63a2cbdf3541ab8c.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_fb54cfd555f0cefb068b105b90bae76cc8330376.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_9d925e95c554316eb90e7b67cab6f54368c12309.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_4d8b16123ce408d3cf6fd7308d51d08f4d744ed0.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_6191902e414d29c8fc90a2ede35191499dc52535.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_f31ce13107c16f15aefc24d113723140ccb493dd.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_95118a339ed60b89eb03c35cd9d619aca416e034.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_8ce9f3b2ac113d83fab802eb15d995ed69ccdf51.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_7d8f247ecce6d6e0f464ef34233d8b06901bada3.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_8240b542997cee0c00c301e0e6b11e0b1782c568.1920x1080.jpg?t=1521213800,https://cdn.akamai.steamstatic.com/steam/apps/662910/ss_e87d5d3b45282a6efd70d8a70ab3e693e2379215.1920x1080.jpg?t=1521213800",
    "Slug": "cash-crop",
    "Meta Title": "Cash Crop: Aug 3, 2017, Joint Ventures and Full Overview",
    "Meta Description": "Looking for information on Cash Crop? Check out the release date (Aug 3, 2017), developer insights from Joint Ventures, and a complete game summary.",
    "Alt Text Image": "Official header image for Cash Crop game - Steam 662910",
    "Canonical URL": "https://gusku.site/game/cash-crop",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cash Crop\", \"description\": \"Looking for information on Cash Crop? Check out the release date (Aug 3, 2017), developer insights from Joint Ventures, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joint Ventures\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Joint Ventures\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/662910/header.jpg?t=1521213800\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}