{
    "AppID": 720060,
    "Name": "Colony",
    "Release date": "Dec 15, 2017",
    "About the game": "Colony - strategy with elements of the economy about the colony of ants. The player's task is to properly accumulate resources and manage them in order to overcome the colony of the opponent. Buildings A feature of buildings in the game is that they can not be destroyed. Opponents can only destroy each other's units. Anthill The main building that is displayed on the game map before the game begins. The anthill of the enemy is located symmetrically with respect to the center of the map. You can not put an anthill too close to the center of the game screen and the edges. The collected resources of the ants are placed in an anthill, if there is no more close storehouse. All new ants also appear in an anthill. Laboratory After the construction of the laboratory, the study of the sciences and the training of soldiers becomes available. The laboratory is an extension to an anthill and does not require manual positioning. Stock The construction of warehouses can increase the rate of collection of resources. Workers and architects deliver the collected resources to the nearest warehouse, or to their anthill. In total it is possible to build five stocks. The warehouse can be built anywhere, but not too close to the growing resources. Units Ants are created using the buttons on the 'Build' panel. Work ants and Architects who do not participate in the collection of resources are displayed in the form of blinking spots on an anthill. Normally ants are not involved when there is no corresponding resource to collect, or they are outside the collection areas. - Worker Gathers food. Initially, you can create 40 worker ants and after the construction of each warehouse, this maximum is increased by another 15. Has one unit of health. - Architect Engaged in collecting wood. The maximum number of architects is the same as the maximum number of worker ants. - Warrior Designed to attack the enemy ants. The health of a warrior greatly exceeds the health of ants of other types and can be increased by studying the science of 'The Might of Warriors'. After studying the science of health, the already created soldiers do not increase. The maximum number of soldiers is not limited. The movement speed of ants when attacking an enemy increases by 30% compared to normal speed. Work ants and Architects slow their movement by dragging resources by 30%. Resources - Food Food grows from grains that appear after the growth of the previous group of plants and is collected by workers. If the food has stood untouched for a long time, then it turns into a wood. - Wood The wood is assembled by architects and is an indispensable resource for building a laboratory and warehouses, as well as for creating warriors and studying certain sciences. The wood appears from a long unassembled meal. To prevent workers from using food, you need to use the option 'forest area' in the 'order' panel. The food thickets chosen in this way will not be collected by workers. Advice Do not delay with the extraction of the wood - the earlier you accumulate the necessary amount for building a laboratory and warehouses, the more powerful your economy may be. Build warehouses in places of large accumulation of resources and away from an anthill - so your workers and architects will more effectively collect resources. If some resources are far from the delivery points, then you can clear or not create the collection zones in which they will be located until you build a warehouse nearby. If you have studied the science of 'resource growth,' then try to have as many resources as possible to ensure maximum growth, since the increment is measured as a percentage of the current quantity and is limited. The game is a unique example of a strategy where the user only needs to monitor the development of the Colony, and manage it, but not like in the normal RTS. Control Manage with the mouse and Hotkey. ('E' - build the worker, 'A' - build the architect, 'W' - build the warrior, '-' - remove the area, '+' - add the area, 's' - add the warehouse, 'f' - the forestry mode, 'b' - add trap, 'l' - build laboratory)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/720060/header.jpg?t=1650828841",
    "Price": 1.99,
    "Developers": "eugeniy_kh",
    "Publishers": "eugeniy_kh",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/720060/ss_ee9c983b88b2f7f0f20366152a119fad972eb35b.1920x1080.jpg?t=1650828841,https://cdn.akamai.steamstatic.com/steam/apps/720060/ss_fcf2ee846684151491ec63c080339b4d531b8574.1920x1080.jpg?t=1650828841,https://cdn.akamai.steamstatic.com/steam/apps/720060/ss_bc792d43cca12aeb784d6551648a6bbe679da9b9.1920x1080.jpg?t=1650828841,https://cdn.akamai.steamstatic.com/steam/apps/720060/ss_07d3ae4729fe61f3336d7fc4418b3e3db15d7631.1920x1080.jpg?t=1650828841,https://cdn.akamai.steamstatic.com/steam/apps/720060/ss_4c31c98015f0cb237e58df65be483f9839b88e88.1920x1080.jpg?t=1650828841,https://cdn.akamai.steamstatic.com/steam/apps/720060/ss_b2a51a81e61f04695628eed13bbc9cc06075989d.1920x1080.jpg?t=1650828841",
    "Slug": "colony",
    "Meta Title": "Colony: Dec 15, 2017, eugeniy_kh and Full Overview",
    "Meta Description": "Looking for information on Colony? Check out the release date (Dec 15, 2017), developer insights from eugeniy_kh, and a complete game summary.",
    "Alt Text Image": "Official header image for Colony game - Steam 720060",
    "Canonical URL": "https://gusku.site/game/colony",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Colony\", \"description\": \"Looking for information on Colony? Check out the release date (Dec 15, 2017), developer insights from eugeniy_kh, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"eugeniy_kh\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"eugeniy_kh\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/720060/header.jpg?t=1650828841\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}