{
    "AppID": 391730,
    "Name": "Crashlands",
    "Release date": "Jan 21, 2016",
    "About the game": "TIME Magazine Top 10 Games of 2016 'Usually I can say what a game IS and be done, but it's hard to figure out what Crashlands ISN'T. It's a funny, crafty, fighty, jumpy, makey, adventurey, type... thing. I think they started making a cool game and just couldn't stop. ' - Tycho, Penny Arcade Crash land and craft, battle, and quest your way through this story-driven Crafting ARPG overflowing with sass! Become Flux Dabes, a galactic trucker whose latest shipment gets derailed by a chin-strapped alien menace named Hewgodooko, leaving you stranded on an alien planet. As you hustle to retrieve your packages you’ll become enmeshed in a nefarious plot of world domination, which will require all of your wits and both of your glutes to overcome. Learn recipes from the local sentient life, make new friends, uncover ancient secrets and deadly bosses, tame everything and build yourself a home-away-from-home as you learn to thrive after crash landing on planet Woanope. Player 2 can now play as Juicebox! Juicebox's S.T.R.A.W.™ not only harvests resources but also brings additional firepower to the battlefield. But watch out, the enemies are gonna try to kick his robotic butt too now! But Juicebox has a few special moves up his mechanical sleeves... Happy Juiceboxing with your friend! Key Features Expansive Crafting System Unlock over 500 craftable items as you explore the world and learn its secrets! Self-managing, Infinite Inventory Your inventory is infinite, manages itself, and retrieves your tools when you need them, so you can focus on adventuring, questing, and building. You'll never dig through your bag or return to your base to free up inventory space - giving you more time to thrive after crash landing! RPG-Style Character Progression Become more powerful through creating ever-more-amazing items! As you grow in power, you can venture to new regions of the world, meet strange characters, discover new stories, and encounter new and interesting enemies. Skill-Based Combat Learn the attacks of the enemies you encounter, and use your skill, agility, and wits to defeat them! You can even augment your fighting prowess with the power of the dozens of gadgets you can craft. Set your enemies on fire, stun them, slow down time, and more! Intuitive Base Building Building a base in Crashlands is so simple it feels like fingerpainting. You can create beautiful, sprawling bases in minutes! Tameable Creatures Every creature in Crashlands can become a trusty combat sidekick. Find an egg, incubate it, and hatch your very own adorable or hideous bundle of joy. You can even craft special items to grow and empower them! Huge World... with Huge Problems Crash land on a planet with four sentient races, three continents, an epic bid for the future of the planet, and you - trapped in the middle, trying to deliver your freakin' packages. Take your time to dive into the sidestories of the characters you meet or just rush headlong into making that special delivery. With hundreds upon hundreds of quests, there's a lot to do and discover on planet Woanope! Crossplatforminess Don't want the fun to stop? Crashlands is also available on mobile - the exact same game, with your cloud-synced progress - so you never have to stop!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/391730/header.jpg?t=1643297273",
    "Price": 14.99,
    "Developers": "Butterscotch Shenanigans",
    "Publishers": "Butterscotch Shenanigans",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/391730/ss_4371ea930febc58b90a94b59e1c6661e84b6cb1c.1920x1080.jpg?t=1643297273,https://cdn.akamai.steamstatic.com/steam/apps/391730/ss_72ce8ef37a25a9f635f99231128eaa404753e998.1920x1080.jpg?t=1643297273,https://cdn.akamai.steamstatic.com/steam/apps/391730/ss_2c617bd62fe85cf5cdc4c754d3f48cc188cadfd1.1920x1080.jpg?t=1643297273,https://cdn.akamai.steamstatic.com/steam/apps/391730/ss_76921db6783523eb4dc8ba137d4beea47b170b5e.1920x1080.jpg?t=1643297273,https://cdn.akamai.steamstatic.com/steam/apps/391730/ss_d9980a73b09a8ee67b6d124f6a4b08cdb85461fa.1920x1080.jpg?t=1643297273,https://cdn.akamai.steamstatic.com/steam/apps/391730/ss_7fc9e7c43cf254626592b65c08ed95986cb8152d.1920x1080.jpg?t=1643297273",
    "Slug": "crashlands",
    "Meta Title": "Crashlands: Jan 21, 2016, Butterscotch Shenanigans and Fu...",
    "Meta Description": "Looking for information on Crashlands? Check out the release date (Jan 21, 2016), developer insights from Butterscotch Shenanigans, and a complete game ...",
    "Alt Text Image": "Official header image for Crashlands game - Steam 391730",
    "Canonical URL": "https://gusku.site/game/crashlands",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crashlands\", \"description\": \"Looking for information on Crashlands? Check out the release date (Jan 21, 2016), developer insights from Butterscotch Shenanigans, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Butterscotch Shenanigans\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Butterscotch Shenanigans\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/391730/header.jpg?t=1643297273\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}