{
    "AppID": 542910,
    "Name": "Crumbled World",
    "Release date": "Dec 1, 2016",
    "About the game": "Crumbled World is a tower defense game where you're tasked to create a maze of defensive structures with the purpose to defend the world crystal. The world crystal is what keeps the world from further collapsing into darkness and without it no hope exists. Your missions is to defend different areas using knowledge and abilities gathered to adapt to new challenges. Game play Each map have a certain amount of incoming enemy waves that tries to destroy the world crystal. The player build towers to protect the crystal and vanquish the evil enemy horde. Every map have a different layout and new obstacles to overcome, this makes deciding witch tower will be best suited to defend against the hordes of oncoming enemies waves very hard. When placing towers it is important to think of the synergy between them, as some have abilities that require other towers to work. Towers can be upgraded to have abilities In the defense, and combining certain towers can create efficient killing zones in the system. Tower placement The placement of towers in this game is non-grid based. In other words you can place and rotate towers freely. This makes the placement of towers a bigger challenge and a greater opportunity than other games in this genre. Gold Gold is your primary resource and is spent on buying and upgrading towers as well as temporary boosts. For each wave cleared you gain a fixed sum of gold and for each enemy killed you get an interest based amount of gold based on the gold currently held. The interest rate is to give an edge to skilled players and gold will stack up more and more as the game progresses. Since gold is rewarded for a kill it is possible to acquire additional towers during a wave. Boosts The towers have a boost ability. When enabled the tower becomes extremely efficient for a short amount of time. This make it an important mechanism to survive hard waves, but relying too heavily on this function will cost you in the long run. When used correctly the boost functionality can make your system last several waves longer than it should have done otherwise. Key Features: 8 unique towers with several different abilities. With the option to customize/specialize them with different properties. Over 10 unique monster types. Campaign with 20 different maps. Custom maps, that contains challenges and different game modes. Multiplayer support with co-op. Placement of towers are non grid based. Map editor that is easy to use, when making basic maps. The editor can even be used to create custom mods for the game. Easy and extensive scripting support via Lua language.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/542910/header.jpg?t=1495268823",
    "Price": 5.99,
    "Developers": "Clone Corps",
    "Publishers": "Clone Corps",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_1d12081b6a658f49a144dbbfcaf2cd1cd3274f08.1920x1080.jpg?t=1495268823,https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_5f44289f8561553547b39b74e4f8cf34b6b41333.1920x1080.jpg?t=1495268823,https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_426b3dc40fe8b58aa96c37d2eaebc52c3b4f28d1.1920x1080.jpg?t=1495268823,https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_c988c6682eb1f48c8b464ad82a9343662ebe8ed9.1920x1080.jpg?t=1495268823,https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_fa8310e68bb490b2781d9f1fad5ebc5d4d740ce3.1920x1080.jpg?t=1495268823,https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_271aec70c82dfa825ee9a61a70a4fa0475a87b96.1920x1080.jpg?t=1495268823,https://cdn.akamai.steamstatic.com/steam/apps/542910/ss_d61b2abcfefaee5c54dece8f069112554f6a1583.1920x1080.jpg?t=1495268823",
    "Slug": "crumbled-world",
    "Meta Title": "Crumbled World: Dec 1, 2016, Clone Corps and Full Overview",
    "Meta Description": "Looking for information on Crumbled World? Check out the release date (Dec 1, 2016), developer insights from Clone Corps, and a complete game summary.",
    "Alt Text Image": "Official header image for Crumbled World game - Steam 542910",
    "Canonical URL": "https://gusku.site/game/crumbled-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crumbled World\", \"description\": \"Looking for information on Crumbled World? Check out the release date (Dec 1, 2016), developer insights from Clone Corps, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Clone Corps\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Clone Corps\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/542910/header.jpg?t=1495268823\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}