{
    "AppID": 1530920,
    "Name": "Crush Depth: U-Boat Simulator",
    "Release date": "Feb 10, 2021",
    "About the game": "Please note , Crush Depth is in development, very early, pre-alpha version state and this page is meant for early backers who are already familiar with this project. At this stage, we are still nowhere near what anyone would consider a finished product . The pictures and other media you see on this page are also a work in progress and not representative of the final product. We are making Crush Depth available for purchase for your support and feedback. We fully welcome your input, criticisms, questions, experiences, suggestions, and anything else you would like to share with us. Only by getting you, our supporters, involved in the process of shaping this project, can we get to where we want to be. We hope you will accept that invitation and support us by purchasing a copy. All of the features listed below are what we aspire to, not what is available at this time. This is not fun War isn't fun, and we're not going to sugarcoat the realities of history. Out of the 1,156 U-Boats which were commissioned, 765 never returned to port. Out of around 40,000 men that served in the U-Boat arm, 30,000 of them never returned to port (with some sources even citing higher losses of life). On the allied side, no fewer than 2,603 merchant vessels were lost to German submarines, at the gruesome cost of no fewer than another 30,000 who lost their life at sea. Our goal is to offer an honest glimpse into the brutality of the Atlantic campaign. Unparalleled realism To recreate the most realistic U-Boat simulation ever conceived of, we have set up collaborations with numerous archives worldwide to obtain the original blueprints used in the construction of the Type VII-C U-Boat. We are also being advised by one of the last men still alive who served on a U-Boat, Mr. Friedrich Grade, chief-engineer on U-96 and U-183. Even further, we have a partnership with the ‘Freundeskreis U-995’, whose sole purpose is to restore and maintain the last Type VII-C in existence. Your support of this project is the support of maintaining history, both virtually and physically. We are rebuilding the Type VII-C U-Boat to a level of fidelity that has never been seen before. We are giving the countless other ships and planes you will encounter a similar treatment. All of the units you will encounter in this project are one-to-one translations of the original blueprints and building regulations, built with the utmost attention to detail. To make it function realistically as well, we are developing a level of physics simulation that takes into account things such as hydrostatic pressure, viscous resistance, electrical conductivity, propagation of sound through different mediums, salinity, temperature, Boyle’s law, and many, and many more factors. Another fine example there: our world is not flat, but a proper oblate spheroid, with full bathymetry and height data, accurate to 15 arc-seconds. Your actions and decisions will matter. Your engine failure will not be the result of some randomizing algorithm deciding it is time to do so. Your torpedoes missing their target will not be the result of some chance generator determining you have hit enough already. Everything you will see happening will be the result of stone-cold physics. We will be able to create a level of realism that has never been seen before in any other submarine simulator. Playability ...but don’t get us wrong either. We are not deliberately trying to scare people away by making something so complicated that you will need to get a Ph.D. in submarining first just to enjoy Crush Depth. You will find interactive tutorials that will teach you everything you need to know: from complex interactions between the engine management, ballast system, and rudder controls needed to dive the boat properly, to how to decode and encode radio traffic with the enigma machine, to making a tasty Eintopf for your crewmates. Apart from that, you will be able to customize your experience to suit just how complicated you want things to be. If you are not particularly interested in performing the ten-odd steps one would have to perform to turn on a compressor, you won’t have to. A click of a button will allow you to simplify that process to a single step. Even further, you can forego having to do that at all, by letting the intelligent AI take control of whatever task you have in mind. The World of Crush Depth Crush Depth will offer you a variety of settings. Our main focus for the further development of this project is creating a persistent MMO-environment, set in and around the U-Boat base of Lorient, France. From there, you and your crew members will depart for the Atlantic and other parts of the world. Apart from the patrols themselves, the project will also spend a great deal of attention on life onshore, from repairing and restocking your boat, preparing and planning for your next departure, coordinating radio traffic with those currently at sea, to having a drink or two (or three, or four, or five) with your fellow sailors in the local bar. Apart from all the valves, dials, and other machinery, you will be able to interact with, other items you find onboard or bring on your person will be fully interactive as well. This will allow you to engage in dozens of other activities, such as playing a game of chess or skat with your crewmates, having a cup of coffee, or trying to nick your captain’s pair of binoculars (The latter is probably ill-advised, but we feel we shouldn’t ignore the lighter side of life on board either). Your own player character will also be fully customizable to your own liking, offering a wide range of options in terms of physique, clothing, accessories, and the like. Over the course of your career, you will indeed be able to obtain medals and other insignia to display your skill and achievements to the many other people we hope to welcome to this project. The worldwide, persistent MMO-setting is however not the only game mode we will roll-out. Other options will include historical encounters, where you will be put in the exact same time and spot as some of the real skippers were. Customizable encounters, where you can decide for yourself what kind of ships you wish to encounter, where, when, and under which conditions. Interactive training missions, that will allow you to dot the i’s and cross the t’s before you decide it’s time to get in the thick of it. All of these modes are fully networked as well, ready for you to have at alone, or with a group of friends. Even more, if you would rather play on the allied side, why not? This is something we hope to expand on in later versions of the project, but a playable Elco PT-Boat (and perhaps some other units as well), will be included in a first release. Support our project! Your contributions make a big difference to our project. Building a complex and historically accurate representation of the Battle of the Atlantic is a very significant investment. We have opened up the project at this incredibly early point in the project to allow those who see the value in what we are trying to achieve to help us financially by purchasing a copy. We have thought about fundraising through Kickstarter, but the realities of working in an incredible niche genre means support is built over a long period of time after trust is built with the community. We are fully committed to bringing this project to life and post constant updates to our Discord. We hope to see you there as well. Thank you all for your consideration and support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1530920/header.jpg?t=1644711470",
    "Price": 59.99,
    "Developers": "Crush Depth Studios",
    "Publishers": "Crush Depth Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_3ab6cda3173633bc1f35d42533fa86942e998740.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_0d143371b5d3595f02fa3ba17bf60f9d7faed74e.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_3b7d2a9ffdb5adc47aad62271d14d89e418bd4a7.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_5555c0c8b95cf97117a62cffda7065c4fe478bf9.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_7714e155df4764b9e0ed5c1cb928385f81f868cc.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_461220a7e438dc147680985bb21ff503afdf4263.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_db61bd8b7d65329c5991df2b5809455974072d46.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_f4198a7200a9af1f56ff5ded46d7dda00db816d3.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_21113e027dbdbaee0c2d0d95f19fa25cc2d4a4ec.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_4539359ec8eb7f1c0da64d0a13f92da5df419a9b.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_eefd50c051a5687d2d1f38cc18ea2c8028326468.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_1726b7d067b3a62d57e5560b4a3ab6f022d3487c.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_6578e396f434608a15dd2226fb3dc63ce231cecb.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_224cd80d3f842b31631c0329da8e332100053758.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_8e9505a0f7b4e8702f5bb6cf39dbe55210f89137.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_07a2e155303e9e7d956fbd12fa303366db5f1f5f.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_6baa84302616cb962e22416310ead30dcb993f74.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_3d775a0d1c7de0b013a3197d45d35483067d0fa0.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_d1646f8998e2ab7b485d074cbba26335b66c00be.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_3003092fec068efeb1e506bf4199843c6b85a320.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_94407d15ca1088e600dcbbab756e1b7f77eaeccd.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_f2452cfc9e6fda29c50a045997fb2191366da247.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_499c14d2d6a964724bb3517cb6bd2dfd5005cee7.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_3c941c08fb4d230ef3affd756b77b7279a814a64.1920x1080.jpg?t=1644711470,https://cdn.akamai.steamstatic.com/steam/apps/1530920/ss_7fa1747aa0ae99aea46ac9117273ac16e9025e84.1920x1080.jpg?t=1644711470",
    "Slug": "crush-depth-u-boat-simulator",
    "Meta Title": "Crush Depth: U-Boat Simulator: Feb 10, 2021, Crush Depth ...",
    "Meta Description": "Looking for information on Crush Depth: U-Boat Simulator? Check out the release date (Feb 10, 2021), developer insights from Crush Depth Studios, and a ...",
    "Alt Text Image": "Official header image for Crush Depth: U-Boat Simulator game - Steam 1530920",
    "Canonical URL": "https://gusku.site/game/crush-depth-u-boat-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crush Depth: U-Boat Simulator\", \"description\": \"Looking for information on Crush Depth: U-Boat Simulator? Check out the release date (Feb 10, 2021), developer insights from Crush Depth Studios, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crush Depth Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crush Depth Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1530920/header.jpg?t=1644711470\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}