{
    "AppID": 973700,
    "Name": "Disassembly VR",
    "Release date": "Jan 31, 2019",
    "About the game": "Love taking things apart? Seeing how things work? Destroying things? Fighting while destroying things? This game lets you do so in the ultimate destruction experience! DISASSEMBLE Disassembly VR: Ultimate Reality Destruction simulates the experience of taking everyday objects apart. Figure out how to disassemble an object by removing screws, bolts, nuts using the correct tools and your bare hands. Find obscure parts for bonus and achievements. Weapons and additional tools unlock as you complete levels for more destructive fun! DESTROY Shoot a TV with a shotgun, blow up your computer, smash stuff with a hammer, crash cars, airplanes, helicopters and much more. High performance bullet holes with precision calculated ballistics, trajectory, penetration, deflection and tumbling. BUILD Full sandbox mode allows you to build structures, spawn in vehicles, weapons and bombs, place and fight mannequins. Build your ultimate mega fortress! FIGHT Defend your fortress against evil mannequins! Every tool and object is a weapon. Disassemble a vehicle and use its parts for offense or defense! Full body active ragdoll physics for both enemy and player make melee combat extremely physical and satisfying! Advanced climbing AI allow the enemies to climb over physics obstacles to get to you. EXPERIENCE Drive cars and a tank, fly a helicopter and fighter jet, experience a plane crash, dive underwater in a submarine, sail and sink with the Titanic, orbit the Earth, ride an elevator, cook food, make coffee, and much more. Experience everything in this game! There is no other VR game like this! ALL HEADSETS SUPPORTED All SteamVR headsets supported, including Index, Vive, Vive Pro, Vive Cosmos, Rift, Rift S, Quest, Quest 2, Pimax 5K/8K/8KX, and Windows Mixed Reality. FULL FINGER TRACKING INTERACTION SYSTEM Full finger tracking with dynamic per-finger grip system. Real natural object handling with realistic hand and finger physics! Fingers realistically grab objects of any shape Use thumb-index finger pinch grip to pick objects up with pressure sensitivity Light pinch grip allows you to roll, swing and twirl objects or move them with your other hand Apply pressure to increase frictional forces, or use three or more fingers for a firm grip Two-finger object pickup using thumb to middle, ring, and pinky finger (only supported for Index controllers) Palm grip objects using your middle, ring and pinky fingers and your palm Using pinch grip and palm grip together, you can pick up another object while still holding onto one Physical hands and fingers allow for picking multiple small objects up by placing them onto your palm Physical haptic feedback allows you to feel everything you touch Two-handed grab supported for all objects, handle things like you would do in real life Pressure sensitive pliers work just like the real thing (only supported for Index controllers) This is the only VR game on Steam with high fidelity physical finger interactions. All features of the Index controllers are utilised, from touch to pinch grip to force sensors. Experience the full capability of the Index controllers! Features 51 objects ranging from furniture, appliances, electronics, to the super jumbo A380! At least 8 to 12 hours to complete all levels! 25 different tools and weapons - screwdrivers, pliers, spanner, guns, bombs, and even a rocket launcher! Dual wielding supported! Full body fighting physics - fight active ragdoll enemy mannequins and get fully physical! True 3D bullet holes with actual depth, enhanced sounds, debris and slow motion! High performance precision calculated bullet ballistics, trajectory, penetration, deflection and tumbling! Sandbox mode - freedom to build and destroy anything you want! Full physics is turned on in sandbox mode! Realistic physics - grab and drag parts to disassemble, move or drop them! Fully interactive objects - Drive cars and ships, fly planes and helicopters, operate a coffee machine, spin a fidget spinner, and much more! Realistic destruction - tools and weapons unlock once you successfully disassemble objects. Shoot and blow it up in slow motion 'bullet' time! Posable mannequin - place crash test dummies in cars, trains or other vehicles and crash them up! High replay value - explore alternate ways to disassemble an object, or create your own fun in sandbox mode! Free locomotion, teleport, smooth &amp; snap turning, and flying - all-in-one universal controls! Ultimate Quality setting with HDR, SSAO, FXAA &amp; Bloom effects! Exclusive to the Steam version! List of objects Sidetable, Lamp, Speaker Pocket Knife, Microscope, Antique Car Robot, Safe, Bicycle Chair, Water Heater, House Hard Disk, Blender, Coffee Machine Sink, Lego Van, Hellfire Missile Screw Driver, Rice Cooker, Titanic Phone, Jig saw, Car Toaster, Coffee Grinder, Airplane Flashlight, Elevator, Train Tablet, DVD Player, Skyscraper Toilet, Telescope, Tank Hair Dryer, Computer, Space Station Drone, Hoverboard, Helicopter Controller, TV, Submarine Fidget Spinner, Claw Machine, F1 Car Toothbrush, Microwave, Fighter Jet More to be added in future updates Join our Discord for latest development updates:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/973700/header.jpg?t=1608658575",
    "Price": 20.99,
    "Developers": "Khor Chin Heong",
    "Publishers": "Khor Chin Heong",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_b7de3c7476b4c16917b1d4426565727d04de4956.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_5dc1b14c8b1eb8c89789de1c26dab3f1ad873331.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_1713c7b1ad1179784be5037fa7f3d5a3ec7b35cf.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_593683cf2685beb249feb2dad3d062a02f22fec6.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_adaf985c8d067d940e2a9ee2548ccc0c6a3c5d99.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_04a72a953cb6167aa64df1311dea2ad22cfc87e3.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_1fea559710016b43bdd6c7a1a60a0b8fe6895b9a.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_3a959968589e0a4389013fbfed7d3d622220a528.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_b0ff15aa87b4a9faee682865fc7ca55deda76f5f.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_0cc6b108c64a97ef49a54b76ebe282e9600848f1.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_9364de857cdd5a55a443a5917421a06d7a01d1d9.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_a734acb23aafc2339ee8d55268b92dde8131d0bd.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_47820bce348c0798396d53c4bd8c3397ebbb7a20.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_00a1639671fea94dbfc9273a82e747a9b4dd5c9b.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_dfe5e33517682ccceffcc610852e54327d17e200.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_b14d6a1c0a13fce7347c45d49874949bba0715a9.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_9b9a083f3a03a92493890cce1e48830dd1cfc636.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_1287acdf2e92c398ccb3a1272511eb6163c492d9.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_891543ac94b5492be1137956e978f8f268efb9af.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_5b21cd9d8b38d6a72cb2b6953a728a79a0a98c97.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_b9b9a5536073f544fa91ebf5c110dc3bdcdcc597.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_ddd35098d2a4956c3422d217cc5753446134e319.1920x1080.jpg?t=1608658575,https://cdn.akamai.steamstatic.com/steam/apps/973700/ss_7596b4f1d9e0a1351ba5ffacb3acc75e0807bb7b.1920x1080.jpg?t=1608658575",
    "Slug": "disassembly-vr",
    "Meta Title": "Disassembly VR: Jan 31, 2019, Khor Chin Heong and Full Ov...",
    "Meta Description": "Looking for information on Disassembly VR? Check out the release date (Jan 31, 2019), developer insights from Khor Chin Heong, and a complete game summary.",
    "Alt Text Image": "Official header image for Disassembly VR game - Steam 973700",
    "Canonical URL": "https://gusku.site/game/disassembly-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Disassembly VR\", \"description\": \"Looking for information on Disassembly VR? Check out the release date (Jan 31, 2019), developer insights from Khor Chin Heong, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Khor Chin Heong\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Khor Chin Heong\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/973700/header.jpg?t=1608658575\", \"offers\": {\"@type\": \"Offer\", \"price\": 20.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}