{
    "AppID": 999860,
    "Name": "Enemy On Board",
    "Release date": "May 8, 2020",
    "About the game": "Enemy On Board is an online multiplayer (6vs2) social deduction game where 2 random players are the Alien imposters and the other 6 players are Crew members. The Crew’s goal is to figure out which 2 among them are Aliens, hunt them down, and kill them - all while repairing the spaceship’s generators to keep communication lines open in an effort to escape space isolation. Aliens sow discord, and wreak havoc in order to destroy the Crew members by whatever means necessary. Last team standing wins. Choose from one of many Crew members, each with their own unique character abilities and perks Establish who the 2 Alien impostors are and kill them with your trusted teammates Keep communication lines open, get weapon ammo, and progress through the round by fixing broken generators aboard the Andromeda Scavenge weapons from the Armory and hunt suspected Aliens Survive for long enough and turn into a powerful Cyborg to face the Aliens head on Choose your powerful Alien and execute your deadly strategy to destroy the Crew Sow distrust, deceive Crew members, and stay hidden in plain sight Strategize with your alien partner in Alien voice-chat Gather Evolution Points using your alien ability Harvest enough Evolution Points and transform into your powerful Alien form to decimate the Crew. Each alien has a unique attack, the skill of their species TRUST NO ONE Enemy On Board is a game of teamwork and trust for the ultimate goal: survival. Aliens and Crew both use built-in voice-chat to communicate, and Aliens even have their own second channel to strategize. Just a piece of advice for you...Aboard the Andromeda, it's best to trust no one. REAL-TIME ACTION COMBAT Space is a messy place - even more so when there are 2 aliens among you, that just killed your friends. Tensions can often rise and you just have to whack someone with a hammer. Instead of voting out the Alien impostors - kill them. Don't just trick people - orchestrate a friendly Saturday-afternoon mauling for them. DEEP PROGRESSION SYSTEMS Level up your character and progress through the perk-tree to gain that extra edge on your opponents as you compete to be the best. Character abilities and perks all have 3 impact levels. Ascend your character to level up your character ability and roll for upgraded perks. AN ONGOING JOURNEY Enemy On Board is in Alpha via Steam Early Access. We could have kept the game closed or put the alpha behind a paywall and gone F2P later, but we'd rather just get your feedback and build this game WITH you. Updates are released regularly and we plan to operate Enemy on Board for years to come. Our official Discord is the best place to meet friends and share critical feedback with the development team. We sincerely hope to meet you there.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/999860/header.jpg?t=1611187090",
    "Price": 0.0,
    "Developers": "Windwalk Games",
    "Publishers": "Windwalk Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_1f2f505386c42435147e747de9a8ec6e8ac3710a.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_08e9ce4cc1073d21f05e4552a127e974a5a60430.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_733a5987facb45f826822cdd0f1f8caea1bba5ae.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_7144d40ad157134e600bf0abfd50ddef0b64da1e.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_c8cc85cbde22f8519baa67e9ed8f01f15dd6b54d.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_5c59bfac7214d31e59087aeebd1d952324b0389a.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_05ac34394129dcf9b1193c0cbcd9b604901a3ab5.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_0313fe685737222618427c936fcb1814d03358d2.1920x1080.jpg?t=1611187090,https://cdn.akamai.steamstatic.com/steam/apps/999860/ss_4363d997d5b457c033721836962e9a62a6aecfe1.1920x1080.jpg?t=1611187090",
    "Slug": "enemy-on-board",
    "Meta Title": "Enemy On Board: May 8, 2020, Windwalk Games and Full Over...",
    "Meta Description": "Looking for information on Enemy On Board? Check out the release date (May 8, 2020), developer insights from Windwalk Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Enemy On Board game - Steam 999860",
    "Canonical URL": "https://gusku.site/game/enemy-on-board",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Enemy On Board\", \"description\": \"Looking for information on Enemy On Board? Check out the release date (May 8, 2020), developer insights from Windwalk Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Windwalk Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Windwalk Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/999860/header.jpg?t=1611187090\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}