{
    "AppID": 445020,
    "Name": "Frozen Synapse 2",
    "Release date": "Sep 13, 2018",
    "About the game": "Open World Tactics Frozen Synapse 2 brings you classic tactical gameplay with a new twist: it's set within a vast procedurally generated city. We're calling it 'open world tactics' - a combination of grand strategy and simultaneous-turn-based combat. In single player, Frozen Synapse 2 tasks you with defending the city of Markov Geist against an array of threats from within and without. Set up bases, deploy your forces and then enter any building or engage a target anywhere on the map: you define your own strategy. When you're ready to take tactical control, the camera will zoom down to your units, enabling you to make your plan and test it out. When you hit the 'Prime' button, your moves are locked in and you must see how they play out against your opponent's plan. The City The city is a living system, with many AI-controlled factions vying for control and conducting their own nefarious business. Choose to collaborate or betray, rob banks, assasinate political leaders or establish a delicate diplomatic accord: it’s up to you. Investigate the mysterious force which is making incursions into the city while trying to establish your own power base in this complex and treacherous futuristic world. Follow the extensive story or abandon it to forge your own path: it's up to you. You'll meet factions like the financial manipulators Diamond Brothers or the hacker collective GUEST as you navigate the political landscape. Multiplayer Frozen Synapse 2 features classic multiplayer modes from the original game as well as new ways to outwit your opponents, like the thrilling instant action of One Turn mode: commit your plan and see how it plays out against a range of oppositions from players all around the world. New Features Frozen Synapse 2 adds many new units like the Flamethrower, Minigun, Knife and Smoke Grenade. Curved walls and new objects like trees, rocks and cars allow for much more realistic levels on a variety of scales, from a road intersection to an enormous shopping mall. New Focus Diamond mechanic allows you to take out tricky enemies who insist on camping behind cover by predicting their location! Vastly improved AI makes for tense tactical battles and a host of UI improvements mean that the planning process is slicker than ever before. And of course, there's a brand new soundtrack from nervous_testpilot!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/445020/header.jpg?t=1536857782",
    "Price": 29.99,
    "Developers": "Mode 7",
    "Publishers": "Mode 7",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_be6527f0e966f091304b48ed1e0dce5af2accb4f.1920x1080.jpg?t=1536857782,https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_3b1aa4f1557b9f8d51b93ad0626124a8e149ae13.1920x1080.jpg?t=1536857782,https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_13a88ade71b5ef1c17c7ea408344b721765e54d0.1920x1080.jpg?t=1536857782,https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_2f5b2f0cab5e85352710ffd37bdd3abe1f7f9066.1920x1080.jpg?t=1536857782,https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_436d3d2457fa180bed820eb304173af92d6dd376.1920x1080.jpg?t=1536857782,https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_b07bf1b85c8573b349c7948ddd2a72b7c27598db.1920x1080.jpg?t=1536857782,https://cdn.akamai.steamstatic.com/steam/apps/445020/ss_f3679ff4293e93b0f29a5d08e39f24d964a2df45.1920x1080.jpg?t=1536857782",
    "Slug": "frozen-synapse-2",
    "Meta Title": "Frozen Synapse 2: Sep 13, 2018, Mode 7 and Full Overview",
    "Meta Description": "Looking for information on Frozen Synapse 2? Check out the release date (Sep 13, 2018), developer insights from Mode 7, and a complete game summary.",
    "Alt Text Image": "Official header image for Frozen Synapse 2 game - Steam 445020",
    "Canonical URL": "https://gusku.site/game/frozen-synapse-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frozen Synapse 2\", \"description\": \"Looking for information on Frozen Synapse 2? Check out the release date (Sep 13, 2018), developer insights from Mode 7, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mode 7\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mode 7\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/445020/header.jpg?t=1536857782\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}