{
    "AppID": 469920,
    "Name": "hackmud",
    "Release date": "Sep 22, 2016",
    "About the game": "Use a command-line interface to explore a vast, dangerous and ever-changing computer network. In the MUD, trust is everything and fortunes can be stolen in a moment. Develop your programming and hacking skills as you learn to exploit security flaws and protect your winnings. Explore scripts created by other players and create your own. Build tools and forge alliances, or lay traps and break bonds. Prove yourself Learn to think like a hacker as you navigate hackmud's character-driven singleplayer tutorial. Then, chart your own course through a multiplayer sandbox laden with risk and opportunity. Test real skills like cracking, coding, research and social engineering to thrive in a fully-scriptable, player-driven economy. Remember: wealth comes and goes, but knowledge endures. An echo of the future Encounter the denizens of the crumbling, abandoned internet of the far-future. Lonely cleaning drones pine for their absent users; malfunctioning weather networks ping each other across dead channels; strange new digital intelligences cohere and collapse in unindexed space. The world of the electron and the switch An intuitive retro-cyberpunk text interface inspired by classic hacking movies takes you back to an earlier vision of the internet. An original electronic soundtrack by Lena Raine and Ryan Ike gets you in the zone. BINMAT Security Shell online Binary Matrix - 'BINMAT' is hackmud's unique PVP system. Introduced in the 2.0.0 update, this command-line strategy game is your attack vector and last line of defense. Challenging, fully scriptable and supporting up to 32 players per match, BINMAT provides a deep strategic challenge that is integrally linked to all of Hackmud's systems - from the economy to the bonds you build with other players. A digital society hackmud is home to a thriving community of script-builders, code-crackers, Good Samaritans and hostile operators. Make new friends as you work together to solve complex puzzles and take part in narrative events. Discover and share clues as you draw closer to the truth that waits at the center of the network. NOTICE TO POTENTIAL PLAYERS hackmud is the work of a single developer (now supported by a small team.) We want to make sure that your experience of the game is as consistent, stable, and fun as it can be: but this is an incredibly complex game, and bugs and downtime may strike from time to time. However! As long as there are players playing the game, there will be balance patches and fixes. Real hacking is unforgiving and so is hackmud. This is a game where you will inevitably lose resources and upgrades, and where a mistake can cost you dearly - as such, it's not for everybody. Read as much as you can about the game and other players' experiences before making your purchase decision. Remember: scripts.get_level is your friend. We are hard at work on new features and content and we're excited about the future of hackmud. :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/469920/header.jpg?t=1569301994",
    "Price": 19.99,
    "Developers": "Drizzly Bear",
    "Publishers": "Drizzly Bear",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/469920/ss_e5ef1c8057fdfae006fd097fa6d17c0b23ce3b97.1920x1080.jpg?t=1569301994,https://cdn.akamai.steamstatic.com/steam/apps/469920/ss_4df4c143c6bcd626884e86e1fe36db8427594428.1920x1080.jpg?t=1569301994,https://cdn.akamai.steamstatic.com/steam/apps/469920/ss_9646e8b6168116fedc8144bd15b2ac74484263d6.1920x1080.jpg?t=1569301994,https://cdn.akamai.steamstatic.com/steam/apps/469920/ss_876ffbba44730e19dafa567a64efe16ec14a6bf7.1920x1080.jpg?t=1569301994,https://cdn.akamai.steamstatic.com/steam/apps/469920/ss_05490544b277375dc2db4f506250d5675982adf7.1920x1080.jpg?t=1569301994",
    "Slug": "hackmud",
    "Meta Title": "hackmud: Sep 22, 2016, Drizzly Bear and Full Overview",
    "Meta Description": "Looking for information on hackmud? Check out the release date (Sep 22, 2016), developer insights from Drizzly Bear, and a complete game summary.",
    "Alt Text Image": "Official header image for hackmud game - Steam 469920",
    "Canonical URL": "https://gusku.site/game/hackmud",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"hackmud\", \"description\": \"Looking for information on hackmud? Check out the release date (Sep 22, 2016), developer insights from Drizzly Bear, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Drizzly Bear\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Drizzly Bear\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/469920/header.jpg?t=1569301994\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}