{
    "AppID": 1204740,
    "Name": "How Stories Die",
    "Release date": "Nov 5, 2020",
    "About the game": "Story 'I will create the perfect story... even if it destroys billions of lives.' - ??? Horace lived a cozy and nice life as the prince of Alteria until his father sent him a letter that changed his life. In the letter he was required to escort the child of prophecy whom is destined to defeat the demon king to the palace. Surprisingly, when he arrives at the meeting place, he encounters three girls, each claiming to be the true hero. From here Horace is tasked with uncovering the real hero, or at least waiting until his father's sickness is over so he can roll over the responsibility to him. But time is not on Horace's side, as a mysterious voice appears in his dreams calling him both 'master' and 'enemy' and the army of hell marches closer and closer... Features -25-35 hours of engaging story, immerse yourself within the rich world of How stories die and watch as it breaks apart. -3 unique routes with completely different atmospheres, each based on one of the classic RPG roles: The mage, warrior and rogue. A different experience every route! -Overarching mystery that brings a new take on meta. -Partial beautiful OST with variations for some certain plot twists... -About 12 endings + true ending (not including bad endings or comedic endings). -15+ beautifully drawn CGs. -Tons of terrible jokes from Nozomi. Characters Nozomi Taara Nozomi is a cheerful and energetic girl. She lived in the forest most of her life with her demonic magician gangster bunny mentor so she doesn't know a lot about civilized society and gets excited about every little thing(with a lot of funny misunderstandings). Nozomi has an endless supply of horrendous jokes and puns and has a talent to use them exactly in the worst time. She isn't the sharpest tool in the shed but she has a great affinity for magic.(magic is mainly used by demons) Riko Futukami Riko has a short fuse and quite a lot of ego. She won numerous gladiator championships before with her amazing agility. Her ego is quite fragile, and with her childish and stubborn attitude that's quite the explosive combo. She loves drinking and talking like a walking thesaurus. Riko's former family was a family of gladiators but they disowned her for being too weak. Now Riko plans to beat her father in the finals and take revenge on him. She also possesses a drawing of Horace for some reason... Haruka Saionji Haruka is a shy and insecure girl. She is a genius that solves riddles in the blink of an eye and predicts what others will do based on cold logic. She lives in the slums of the Capital and is very physically weak. Although Haruka is insecure most of the time, when she faces an intellectual challenge her personality transforms into a very dominant and confident one. She also holds some very strong political views regarding the royal family. Contrary to her innocent looks, she hides a lot of very dark truths, some of which even she doesn't fully understands...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1204740/header.jpg?t=1613412631",
    "Price": 0.0,
    "Developers": "VisualBagel",
    "Publishers": "VisualBagel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_17001b5a40c0dc33f8ae7999822976ede194d3ab.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_e8fc774206102c9dc28bb60a347b9125eff7e1b8.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_f03c839ef8d3134ecbda0ad73f5eb4a71c034efb.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_baefb571267b55652511a0a62d27c06ce0f93fde.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_bb444dc7a541028daa1d2b34894e243eedea99a0.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_9c1861ff69399e1d247c04a59491f40575885948.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_847bf49dea776458b79fbb663ba5ba1c3f8a1b3d.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_61fd8eea16a25b1c2e1474110220a44198332a9d.1920x1080.jpg?t=1613412631,https://cdn.akamai.steamstatic.com/steam/apps/1204740/ss_6ed66b9b116fadb2ae188a2798b6590d31e66f29.1920x1080.jpg?t=1613412631",
    "Slug": "how-stories-die",
    "Meta Title": "How Stories Die: Nov 5, 2020, VisualBagel and Full Overview",
    "Meta Description": "Looking for information on How Stories Die? Check out the release date (Nov 5, 2020), developer insights from VisualBagel, and a complete game summary.",
    "Alt Text Image": "Official header image for How Stories Die game - Steam 1204740",
    "Canonical URL": "https://gusku.site/game/how-stories-die",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"How Stories Die\", \"description\": \"Looking for information on How Stories Die? Check out the release date (Nov 5, 2020), developer insights from VisualBagel, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"VisualBagel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VisualBagel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1204740/header.jpg?t=1613412631\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}