{
    "AppID": 1230930,
    "Name": "Inside The Computer",
    "Release date": "Mar 4, 2020",
    "About the game": "Plot: You were a computer science professor. Once you wanted to test your new invention, the 'Real Object Teleporting Portal Based on Network'. This special machine could digitalizes a real object and send it to network wires by a connected computer, then transport it through network wires to the target portal and instantiate it to the real world. After some simple testing by small objects, you were ready to test it using your own body. You entered the input portal. But you didn't know that there were some viruses in the computer connected to the portal. The viruses hacked your transport program and blocked you from getting into the network wires after you were successfully digitalized. You stayed in the bus of your computer. (Bus: a special kind of circuit which connects different parts in a computer and transfers data between them.) The viruses blocked the output portal behind you, so you couldn't get out. You knew that if you go to each hardware in the computer to delete these loaded viruses, you could unblock the portal then go back to human world safety. -~-~-~-~-~-I'm the deluxe split line -~-~-~-~-~- How to play? This game has 12 levels now. They are 3 disk levels, 8 RAM levels, and one CPU level. In disk levels, the viruses come recurrently. You need to delete all of them with only one life to win. Be careful with the magnetic read head that could illuminate a dangerous red beam above you. In the first four levels of RAM levels, there are 3 virus spawners that can spawn viruses. You need to delete all spawners first, then delete all viruses to win. But because of the hacking of viruses, the bridges in RAM levels will recurrently collapse and rebuild. If you are careless, you may fall into the void then be deleted directly. But don't worry, this time you have 2 extra recompile (revive) chances to help you win. In the next four levels of RAM levels, there are 8 virus spawners and a ringlike barrier in the scene. There's also a Code Fragment in the center of the scene. The player can not go or transmit across the barrier. There are four virus spawners inside the barrier and four virus spawners outside the barrier. The player's start point is inside the barrier, and the barrier will break itself after the player deletes the four virus spawners inside the barrier. After the barrier breaks, the player can go and delete the four virus spawners outside the barrier. The bridges will still recurrently collapse and rebuild. After you delete all of the four virus spawners, the Code Fragment in the center of the scene will be invoked, and the bridges will stop collapsing. The Code Fragment is a mini-boss. It can only attack the player and be harmed by the player after it's invoked, and it has different skills. The player will win the level after the Code Fragment is deleted. In the CPU level, the player will fight with the virus boss. This level has four main stages, and the player will fight with the boss in different states and amounts in different stages. In the first stage, the player will fight with Advanced Virus Boss Image. In the second stage, the player will fight with Virus Boss Instance, and the third stage begins after Virus Boss Instance's completeness is less or equal to 75% of its full completeness value. In the third stage, the player will fight with four Virus Boss Image at the same time. In the fourth stage, the player will continue to fight with Virus Boss Instance until the player deletes the boss. The player needs to survive through all of the stages and delete Virus Boss Instance to win this level. There are four Buff Sphere Generators in the scene, and they can generate Buff Spheres over time. The player will receive a random buff and recover some bullets instantly after picking up a Buff Sphere. The player will also receive some debuffs when being harmed by some of the boss's skills. This game has 3 different types of viruses. The first kind is the basic ranged attack virus, the second kind is the ranged attack virus with shield, and the third kind is the close attack virus. The player has three special abilities besides the basic attack. The first one is shooting a blast bullet that can hurt all viruses in an area. The second one is creating a temporary shield that can help you immunize all damages (except falling into the void). And the third one is Transmission, the player can only use this skill in RAM levels and CPU level. After a short time for preparation, it can help you get to a destination away from you inside a given maximum distance. This ability can be used to get out of viruses' encirclement or pass a gap that is less than the maximum distance. But it can't help you go through a wall or any other obstacles. This skill has two levels, you can only use level 1 transmission in the first four levels of RAM levels. But you can use level 1 or level 2 transmission in the next four RAM levels and the CPU level. Comparing with the level 1 transmission, the level 2 transmission has a larger maximum distance (You need to use your mouse scroll wheel to adjust the distance to the new maximum distance manually after the level 2 transmission is ready.), but it also requires extra preparation time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1230930/header.jpg?t=1615131274",
    "Price": 0.0,
    "Developers": "Zihan Wang",
    "Publishers": "Zihan Wang",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_2bbb95c31586670204b46ab1b54b41be7251f8c5.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_968e16faed78967ae1181afa664ae8d5622d5fac.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_1c8e60522a45ba668f2366febb548ac66881995d.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_abeb0217fbf441d29654dc2f1e5b50681c927628.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_d354d5413e2f581418182778445e262bc7301306.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_00ce9fff3709048f5d455885b4487e7c69e1c445.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_dce92e03d5d374ec42c430eec0119188e7d0f10d.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_e23b6e3026d0f91309f6c7fbc5b8e43d46586ed4.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_f7eb94a769f5f12381dc0fc48d9f5b7e4169ec44.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_b1c4808e5513b84506ef2db35aa39755b75d516f.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_f0ecf04ef000d51e01fca78081679de2605e439a.1920x1080.jpg?t=1615131274,https://cdn.akamai.steamstatic.com/steam/apps/1230930/ss_6f97fe6540618cebd9eb657a1e189617a7ef3219.1920x1080.jpg?t=1615131274",
    "Slug": "inside-the-computer",
    "Meta Title": "Inside The Computer: Mar 4, 2020, Zihan Wang and Full Ove...",
    "Meta Description": "Looking for information on Inside The Computer? Check out the release date (Mar 4, 2020), developer insights from Zihan Wang, and a complete game summary.",
    "Alt Text Image": "Official header image for Inside The Computer game - Steam 1230930",
    "Canonical URL": "https://gusku.site/game/inside-the-computer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Inside The Computer\", \"description\": \"Looking for information on Inside The Computer? Check out the release date (Mar 4, 2020), developer insights from Zihan Wang, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zihan Wang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zihan Wang\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1230930/header.jpg?t=1615131274\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}