{
    "AppID": 555080,
    "Name": "Isyium",
    "Release date": "Dec 13, 2016",
    "About the game": "Features Over 40 original compositions - sci-fi electro tunes to immerse you into this altered world. (runtime 100+ mins) Easy to learn - just hit a button when the atoms collide! Deeper strategy with improved skill and higher competencies. Overlay systems - Easers to ease targeting of atomic hits (when earned), a Sight for aligning hits, a 'Resist-Vaporizing' meter to impede a vaporizing event, a Qenoscope to vanquish Antimatter Radicals, internal lighting options to favor tunnel imagery, options for spoken voice and/or continuous music with shuffle option by switch. About Isyium is a unique combination of simulation, strategy and casual arcade (if played in that spirit) with an abridged story mode. Set in an orbital accelerator many years in the future after Earth's untimely bio destruction, you pilot a futuristic - if not altogether rusted and clunky apparatus - called the Spinnercast Module, capable of near light speed as it races through the loop. Your goal is to create Isyium - a theoretical particle that reverses the effects of Proxectron - the cause of Earth's disaster. (Proxectron was similarly created in an orbital accelerator). Discovering a casebook detailing the process of defining Isyium, you now run something called a simulant, building particles and logging codes. When eight codes have been defined there is a brief puzzle to solve before uploading them, completing your mission. Gameplay From a viewport you interact with particles to form new entities. This is achieved by smashing two atoms then combining their offspring particles to color the core, which eject to one of eight positions in the outer group. At run completion there is a presentation of volumes. Once all colors have been completed, a competency is achieved, resulting in an auto-save and a code written to the casebook's cover. Strategy is required for mixing colors, maintaining the central core's mass, destroying Antimatter Radicals - which can damage your module and end your run early, along with using Discontinuous Anomalies to increase atomic velocities (and improve the mass of resulting particles) or contiguous atomic hits to increase velocity as well as earn Easer points and resist Vaporizing Rays. Balance your particle combining choices with elimination choices - either make a large amount of particles with greater mass (along with their orbiting satellites) to define harder to achieve, larger-sized colors sooner, or keep runs lean and eliminate threats early, requiring more runs overall. To assist, your module contains numerous dials and switches that link to tools, as described in the manual.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/555080/header.jpg?t=1481699554",
    "Price": 0.99,
    "Developers": "Glenn Main",
    "Publishers": "Glenn Main",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_142a27ca8110d221e1e633127aa65fd01958c02f.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_71574724188238f6b9c4bcc48037299ef2edae04.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_3d3b48c9b826f4fdb61692bd10e9a3625ce2ae7f.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_8badef5df3c65c50a51c49ca9cc7c040666d00f3.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_421b803f36ea20b999a4f1ea3c61cbb5a8cf4c44.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_783d2264ab576f715eb8d2587ea96782ba49644a.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_eff1267cb23bf9f83de0c11edb2680320f39f832.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_49bb219dd196faf7314d67617890817415c948b2.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_243c74cfdb221c4005551fa95184a032aeb483ef.1920x1080.jpg?t=1481699554,https://cdn.akamai.steamstatic.com/steam/apps/555080/ss_346ffdf19e049e06a3147329876ab325ceb85c79.1920x1080.jpg?t=1481699554",
    "Slug": "isyium",
    "Meta Title": "Isyium: Dec 13, 2016, Glenn Main and Full Overview",
    "Meta Description": "Looking for information on Isyium? Check out the release date (Dec 13, 2016), developer insights from Glenn Main, and a complete game summary.",
    "Alt Text Image": "Official header image for Isyium game - Steam 555080",
    "Canonical URL": "https://gusku.site/game/isyium",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isyium\", \"description\": \"Looking for information on Isyium? Check out the release date (Dec 13, 2016), developer insights from Glenn Main, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 13, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Glenn Main\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Glenn Main\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/555080/header.jpg?t=1481699554\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}