{
    "AppID": 471660,
    "Name": "Kingspray Graffiti VR",
    "Release date": "Dec 6, 2016",
    "About the game": "Creating amazing street art would be much more fun without the jail time, and now you can! Kingspray is a Multiplayer VR Graffiti Simulator, with battle-tested realistic spray, colors, drips, metallics, and more! Using a wide range of caps, ultra-detailed environments and paint surfaces, unleash your creativity (just see what some of our fans have already created!) and express your style! Paint System: Bombing in VR has never been so good. Based on feedback and testing from world-class artists we have created a wide range of caps to utilise, realistic pressure and fading, as well as wet/dry effects, drips and a range of real-world colors from Ironlak! You really can't go wrong! Locations: Kingspray offers a range of incredibly detailed and living environments, from a dusky city rooftop, to a dark and creepy train yard at night, to an abandoned Subway Station! We also provide a growing number of Sandbox locations, which feature even more realistic and varied Paint Surfaces, from Trucks, vans, corrugated iron, plaster walls, through to bricks, various concretes, even a giant Spray Can and a Baseball Cap! Multiplayer: VR is always more fun with friends! Kingspray supports up to 4 simultaneous painters collaborating in Multiplayer, and our long and tall paint surfaces are perfect for huge murals! Replay System: We store every spray you make, so you can play back your entire creation from start to finish! Observe yourself in the world (with full control of playback speed) from in VR, or show off your mad creations using our Director Camera System, which presents your session in a cinematic and engaging way (Perfect for streaming or parties!) Interactive World: Kingspray has so many hidden gems for you and your friends to find, from hurling cinder blocks, smashing beer bottles, to a fully functioning Hetch-A-Sketch! The world is also full of object to help you reach new heights, such as Ladders, Adjustable Scaffolding, even a driveable Scissor Lift! OH! and Sausages. Don't forget the sausages. Simple User Interface: A streamlined set of UI to get you painting as quick as you would in the real world, with completely customisable colors, pressure, undo/redo and direct sampling of the wall to get that precise color back! Phone and Extra Features: Saving and Loading work is as simple as pulling out your phone and taking a photo, or a selfie (including photo filters!). If you dig deeper, you'll discover a fully -fledged 360 camera you can drag around and world to get facebook-ready 360 Panoramas, great for viewing on Mobile Vr! Projector Mode: We've included a Projector! Beam your reference or sketches directly onto the Paint Surfaces to nail your ideas! Grab the Projector and get your position and angle exactly how you want, and resume your painting later on with all your reference intact. Interactive Tutorials: We have created an Interactive Tutorial system! Your personal guide will take you through all the features in Kingspray, or you can select what you would like to know about! This is just a fraction of the awesome features you will find in Kingspray, we cannot WAIT to see what you can create! For more information, visit InfectiousApe.com.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/471660/header.jpg?t=1518090345",
    "Price": 14.99,
    "Developers": "Andrew Bates,Craig Bentick,Nolan Cunningham,Onomis",
    "Publishers": "Infectious Ape",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_3ef675af417adae87c2bb6e34ce0c1f62fca63c1.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_0bdc342f127238837a805b052815141957abdedb.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_0565d66719885bb34b6369505ba36a1ffefc8a31.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_0d7dba3d547c9da325f7ee78d080ef99f5e5d7f6.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_63eb2b91f4ae3ad9f12de7a9333df7ef624e227e.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_4303a2b2a2a421be0cc151771178868ec62e65d8.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_bdb316e74e23556e4d270ce926aa02be831750c1.1920x1080.jpg?t=1518090345,https://cdn.akamai.steamstatic.com/steam/apps/471660/ss_a4c6a695bb22fe1891316700b8b85baf0248daf7.1920x1080.jpg?t=1518090345",
    "Slug": "kingspray-graffiti-vr",
    "Meta Title": "Kingspray Graffiti VR: Dec 6, 2016, Andrew Bates,Craig Be...",
    "Meta Description": "Looking for information on Kingspray Graffiti VR? Check out the release date (Dec 6, 2016), developer insights from Andrew Bates,Craig Bentick,Nolan Cun...",
    "Alt Text Image": "Official header image for Kingspray Graffiti VR game - Steam 471660",
    "Canonical URL": "https://gusku.site/game/kingspray-graffiti-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingspray Graffiti VR\", \"description\": \"Looking for information on Kingspray Graffiti VR? Check out the release date (Dec 6, 2016), developer insights from Andrew Bates,Craig Bentick,Nolan Cun...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Andrew Bates,Craig Bentick,Nolan Cunningham,Onomis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Infectious Ape\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/471660/header.jpg?t=1518090345\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}