{
    "AppID": 1844650,
    "Name": "Krampus Kills",
    "Release date": "Jan 6, 2022",
    "About the game": "THE NIGHTMARE ON CHRISTMAS Krampus Kills is a horror shooter that tells the story of a little brat named Finley, age 10, who lives with his parents in a northern town called Oakville. On Christmas Eve, Fin patiently waits for Santa, but little does he know that the ancient demon known as Krampus, the anti-Santa, has come for his soul! The game features extremely heart-pounding jumpscares, multiple locations, and intense Christmas-themed Horror as Krampus, powered by a complex AI architecture, will track the player down, follow footsteps in the snow, and smash through walls to bring his new soul to the underworld! Who is Krampus? Krampus is the shadow of Santa Claus. Instead of bringing toys to good little boys and girls, Krampus takes naughty souls to the underworld... The top lieutenant of Satan, Krampus is an incredibly powerful demon. During your adventure into terror, you will discover the ancient scrolls of Krampus, which are filled with lore. The definitive game made for horror streamers. Krampus Kills was made after watching hours of online streamers and analyzing what viewers enjoy most. The game is filled with jump scares, challenging puzzles, and horrifying monsters as well as hidden memes and jokes to give players a laugh along with a scare. Players are encouraged to post gameplay online! Fight the Elves of Darkness! Krampus is not alone in his journey to take your soul! His minions accompany him to shred you to pieces. Lucky for you, you got ol Dads boomstick to put them back where they belong! Gameplay and features Gameplay ranges from sneaking through tight corridors of your parent's 5000 square foot New England home to running and gunning in the sewers beneath, and exploring the vast haunted forest in the little town of Oakville. The gameplay focuses on jumpscares and story lore elements explaining the myth of Krampus. The game gunplay is based around your double-barrel shotgun, which is your primary weapon. Krampus AI is highly aggressive and challenging for players to learn to avoid. At its core, the game is a 'pursuer' horror game. With this purchase, you will get the main story game of Krampus Kills. Total game playtime is about 2-3 hours for casual gamers. Gameplay can be set to different difficulties and the game features achievements along with ending rankings and time for speed runners. The game features a survival mode that can be unlocked! Play for Achievements and have a blast. Krampus features a dynamic difficulty AI that will get harder or easier based on how well you play. Game modes! The game features a Nightmare mode that is unlocked once you beat the game. Nightmare mode allows players to challenge themselves with a version of the game that has completely new enemy spawns and a secret ending! Survival Mode: When you beat the game you can unlock the Survival Mode. Survival mode (also commonly referenced as horde) is a mode where you must survive as long as you can against endless waves of enemies! Test your skills and unlock the 15-minute survival achievement! Hide and Seek Mode: Hide and Seek is unlocked by default and features an open map where players must sneak around a giant forest with Krampus on the loose! Krampus has put a spell on you and you need to destroy 3 grandfather clocks to escape the forest. The game mode randomized item locations when you play and features an achievement if beaten. Technical Krampus Kills also includes full controller support. The game features beautiful 4k textures and targets a frame rate of 60 FPS. Levels are designed to run smoothly on both high and low-end computers. The game features an extremely detailed options menu for graphic settings so players can adjust the graphics to work with their machines. Players are encouraged to post their best time and screenshots in the forums. Happy Holidays Everyone!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1844650/header.jpg?t=1656888039",
    "Price": 14.99,
    "Developers": "DangerousBob Studio LLC",
    "Publishers": "DangerousBob Studio LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_7573939f230404dd78ce14bfa9c033bb09bac229.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_5a4f9a51268abe289b9dbff204ce1add7636b6c4.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_77b5db09416edb1913b308a18a504cbdda9d78b1.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_056cf4e8ab901f44b125caebecec931dc40a9b92.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_6f5eb407eacf55f7ae69e45dbecd252b44e77312.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_ca8fb48fbd96d5ccb191861d2d96559c05824f3e.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_da0e58ee0a26c83ca1c9ced76cd7748f21702cb4.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_25e80b487315338dcbf1479b3d76f13a58a905fb.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_379bd9f7af765ad8456e169de9ed18f7a0c66750.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_ac43ce4a363ee2e5c217cef2dc803da6aae4481a.1920x1080.jpg?t=1656888039,https://cdn.akamai.steamstatic.com/steam/apps/1844650/ss_e8ce20e5e2e2ac98d0cd67fa951d1fe566f42791.1920x1080.jpg?t=1656888039",
    "Slug": "krampus-kills",
    "Meta Title": "Krampus Kills: Jan 6, 2022, DangerousBob Studio LLC and F...",
    "Meta Description": "Looking for information on Krampus Kills? Check out the release date (Jan 6, 2022), developer insights from DangerousBob Studio LLC, and a complete game...",
    "Alt Text Image": "Official header image for Krampus Kills game - Steam 1844650",
    "Canonical URL": "https://gusku.site/game/krampus-kills",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Krampus Kills\", \"description\": \"Looking for information on Krampus Kills? Check out the release date (Jan 6, 2022), developer insights from DangerousBob Studio LLC, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DangerousBob Studio LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DangerousBob Studio LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1844650/header.jpg?t=1656888039\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}