{
    "AppID": 1382200,
    "Name": "Liquidators",
    "Release date": "Sep 30, 2020",
    "About the game": "WARNING: Do not play if you are sensitive to flashing lights. This is a student project made by a small team of passionate volunteers of various backgrounds, with no external funding or support. Alexei Ananenko, Valeri Bezpalov, and Boris Baranov. These three men undertook a selfless mission to drain water trapped beneath the Chernobyl nuclear reactors in the immediate aftermath of the blast, and Liquidators is the only game that lets players experience how they managed to contain this catastrophe. Based on true events, this first-person, survival horror experience will have you traverse the radioactive bowels of the blast site, carefully orienting your every step based on the readings of your Geiger counter. Each liquidator has their own set of skills, from stamina to crawling in vents, that gives players a variety of ways to approach the hazardous challenges between them and the valves that will drain excess water destabilizing the reactor core. Whether they all make it out, or more importantly, succeed at all, is in your hands. TENSE AND METHODICAL EXPERIENCE Navigate the claustrophobic guts of Chernobyl with only a Geiger counter and a less-than-reliable flashlight. Watch your step, it could be your last. Make the hard choice of saving or leaving downed liquidators as you inevitably lose them to the radiation. Approach the valve rooms in any order you like and replay to figure out what order gets you through the quickest. FIND YOUR WAY THROUGH THE UNKNOWN Explore the specific skill sets that define each of the three liquidators to find what best fits your play style. Solve each valve room in one of three ways depending on the liquidator you are using and replay to see how each one differs in their approach. Reach one of two distinct endings that will decide the future of Europe's livability for generations to come. WITNESS CHERNOBYL'S BRUTALITY Traverse a virtual recreation of the blasted, irradiated remains of the Chernobyl power plant. Immerse yourself in the time period with real newscasts and artwork from that era. Adjust the custom-made pixilation filter to your liking with three levels of intensity. HARROWING PREMISE BASED ON ACTUAL EVENTS Hear loved ones and others periodically radio in their final messages of admiration, as they assume the worst for these heroes. Listen to your commander for hints about what to do next. Experience the unique journey each liquidator had in their mission to contain the fallout. OUR MISSION TO RAISE FUNDS FOR CHERNOBYL CHARITIES This project is dedicated to all the liquidators, first responders, and support units that responded to the Chernobyl disaster. Through interactivity, people have a fresh way to experience the danger and horrors of their mission firsthand, with this being only one of many. It is our goal to raise awareness for the people that contained the fallout, which is why we have decided to go uncredited as developers and stay anonymous. The focus of our game is squarely on them and the organizations that support those affected by this tragic moment in history. One such charity is Chernobyl Children International, who provides ongoing access to medical services and community support for children affected by the blast. We ask that players donate to this cause and others like it in lieu of paying for the game. (We are not affiliated with Chernobyl Children International or any other organization, but independently chose them as a cause we want to highlight because of their reputation)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1382200/header.jpg?t=1634629324",
    "Price": 0.0,
    "Developers": "1986 CL3",
    "Publishers": "1986 CL3",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_9102d66ccff1404ec3affc18599cc7600c74f53b.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_b2140983d991ca87a7f1f81640cf10448971265a.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_f2b81d0f084f55b37989771367f6bdec58d617a4.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_607ac914ac03720daab9c352810f17f17048b996.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_0f6145661018eaa5b3f060f22a9b735154cf5918.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_f79c0eee9a0a8d78a557f75cc14657861ffc7787.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_5357cac861e32ba5cfc8d56a7824ceecbf67207c.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_38435baae8776803fd104c5018766e5de2353e8a.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_1a7e5da0abe4db593661bcf8e00515f31e7418c9.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_49d522bb0c3f7e9a951121e867d82600bef11570.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_1b8032778f43a337abc7c29a3e5571dcfe5c88e4.1920x1080.jpg?t=1634629324,https://cdn.akamai.steamstatic.com/steam/apps/1382200/ss_82f636199fbccde1758e7550c50c43975a51f933.1920x1080.jpg?t=1634629324",
    "Slug": "liquidators",
    "Meta Title": "Liquidators: Sep 30, 2020, 1986 CL3 and Full Overview",
    "Meta Description": "Looking for information on Liquidators? Check out the release date (Sep 30, 2020), developer insights from 1986 CL3, and a complete game summary.",
    "Alt Text Image": "Official header image for Liquidators game - Steam 1382200",
    "Canonical URL": "https://gusku.site/game/liquidators",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Liquidators\", \"description\": \"Looking for information on Liquidators? Check out the release date (Sep 30, 2020), developer insights from 1986 CL3, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"1986 CL3\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"1986 CL3\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1382200/header.jpg?t=1634629324\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}