{
    "AppID": 1819160,
    "Name": "Meteor World Actor: Badge & Dagger",
    "Release date": "Jun 9, 2022",
    "About the game": "The Seventh Republic—the city despised by the sun. Sunlight hasn't reached here since the last great war, and the shadows teem with vicious criminals. With evil threatening on every side, the National Police Agency is a stronghold of justice. Detective Ruka Hiryu belongs to the 13th Division—nicknamed the Sideliners, and treated like shit by the rest of the force. Absent any major incidents to keep him distracted, Ruka has been investigating the sealed Cult Massacre case in secret. Things change when the 13th picks up two new members. The agency is shaken with unreliable rumors about the semi-mythical Shining Union, and as suspicions and conjecture fly like bullets, will Ruka, the 13th, and the NPA go unscathed? Features Superpowered detective noir visual novel Regular-powered buddy-cop banter Moody, jazzy soundtrack Characters A detective who's had a hard time taking his work seriously for the past ten years, ever since he lost his mentor in the Cult Massacre. One year ago, he was forced to partner up with the rookie cop Claris, and in the course of their investigations together he reencountered the A-class criminal known as Linda. Recently, he's been moving independently of Claris more often... His abilities are ice-based and too powerful for him to fully control. He keeps them repressed most of the time. An officer in Ikuta's 1st Division, strong-willed, but formal and restrained. She hates Ruka for being so familiar with Ikuta, despite the difference in their ranks and Ruka's station as a lowly sideliner. Although ordinarily a stickler for the rules, she dives headfirst into regulation-breaking when she suspects that her family may be involved in a case. The beautiful sole employee of the café Love &amp; Peace. Ruka finds her very attractive. He is hardly the only one—half the police force seems to be after her. Given how many police officers she chats with in the course of her work, she is surprisingly well-informed about internal NPA affairs. A detective newly reassigned to the 13th Division. Originally associated with Forensics, she has all the necessary skills to do such work. However, she has serious problems forming human connections, mostly because she actively avoids other people. This hasn't changed since she joined the 13th, and she rarely converses with anyone aside from the usual morning and evening greetings. A fresh-faced rookie elf assigned to the 13th Division. After a year on the job, she has begun to develop a hint of competence. Unfortunately it's still just a hint at this stage, and she slips up in minor but important ways. She possesses the common power of elves, an ability to control the wind that excels in mobility and defense. The exiled princess of Genomland. Ruka saved her from pursuit by dangerous assassins. With the heat off her for the moment, she has been working at the NPA's cafeteria to make a living and enjoy the protection afforded by the agency's walls. A sweet and earnest girl by nature, she has both the older lunch ladies and the cafeteria's clientele wrapped neatly around her finger. An officer in the traffic division, Komachi is bright, witty, and a sucker for a handsome face. Her father is a senior police commissioner. She's a seasoned organizer and attender of weekend mixers, through which she has a wide web of personal connections. She ends up looking after Ruka with some frequency, if not always entirely voluntarily. The two once cooperated on an undercover investigation. A segitt swordswoman who leads a simple, rustic lifestyle compelled by her chronic lack of funds. Exceptionally strong even for a segitt, she's capable of facing down a delga one-on-one. She lives next door to Ruka, and runs a small subsistence farming operation in the hallway. She's also found steady employment with Strichoss's security outfit. Ruka's roommate, who dwells secretly in his coat pocket. Pixies like her are rare, and popular as household pets, which makes them targets for poachers. Ruka saved her after she fell into wicked hands. She's a busybody and won't keep out of Ruka's business, but her bright cheer easily compensates. When Ruka gets up to thinks she'd rather not see, she's considerate enough of him to go to sleep or simply pretend not to notice. An officer of the 13th Division, her information analysis and hacking skills are top-notch. She's so devastatingly effective, in fact, that she tends to look down on others without even thinking about it. Her partner on the force is the segitt Vars, and the two complement each other well. Due to the limited care she takes with her appearance, her eye-catchingly long hair is a bit of a mess. A dangerous Keeper with a power that allows her to control the young minds of children. More than ten years ago, she led a gang of child thieves called the Luiz, and it was in that capacity that she first crossed paths with a younger Ruka. Now, over a decade later, she still looks much the same as she did back then. She has been assisting Ruka with his hunt for the Cult, but her true motives are still a mystery. A keeper who wields powerful flames. This ability, combined with her investigative chops, has brought her to the considerable rank of Commissioner in a somewhat chauvinistic police agency. She's been following Ruka's activities with interest as he pursues the Cult from the shadows.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1819160/header.jpg?t=1654822972",
    "Price": 17.99,
    "Developers": "Heliodor",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_a57bdea2aeccbddd3fb4238c401a19ee43b7662a.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_5dabad3a3acfa56dfbc84c55f5041b20661d3753.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_4df161d1390c0cc04e4853f637571f32246441ea.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_ba6a955059a43b0ca73c468363afdc0ebfe71991.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_02a97a9ed6d4ae120eb2db43b22ca2b2b3075f62.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_7c2591ec2ca9bf1f2ef98887988920adc9584b34.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_b41cb854df3962a2868593b9810348c0ebb31f3a.1920x1080.jpg?t=1654822972,https://cdn.akamai.steamstatic.com/steam/apps/1819160/ss_c06e829880f9de176f17d6d405905861695b7e2a.1920x1080.jpg?t=1654822972",
    "Slug": "meteor-world-actor-badge-dagger",
    "Meta Title": "Meteor World Actor: Badge & Dagger: Jun 9, 2022, Heliodor...",
    "Meta Description": "Looking for information on Meteor World Actor: Badge & Dagger? Check out the release date (Jun 9, 2022), developer insights from Heliodor, and a complet...",
    "Alt Text Image": "Official header image for Meteor World Actor: Badge & Dagger game - Steam 1819160",
    "Canonical URL": "https://gusku.site/game/meteor-world-actor-badge-dagger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Meteor World Actor: Badge & Dagger\", \"description\": \"Looking for information on Meteor World Actor: Badge & Dagger? Check out the release date (Jun 9, 2022), developer insights from Heliodor, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heliodor\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1819160/header.jpg?t=1654822972\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}