{
    "AppID": 1170950,
    "Name": "Mortal Online 2",
    "Release date": "Jan 25, 2022",
    "About the game": "Subscription The base game of Mortal Online 2 comes with one month of game time included, after which players will need to maintain an active monthly subscription to continue playing the game. We have not activated subscriptions to the game during early release, play the game without subscription during early release. Forge your destiny in the player-driven fantasy world of Mortal Online 2, populated by other players who bring with them their own unique experiences and content. Whether you wish to be an artisan providing masterfully crafted arms and armor, a member of a powerful faction that occupies a region of the world, a tamer training rare and exotic beasts, a highwayman robbing others, or a noble soul seeking to protect the weak from outlaws and beasts—The story of your journey will be written through your actions, and you choose the direction of each chapter. EXPERIENCE THE WORLD OF NAVE From the bustling cities of a once-great empire to gloomy volcanic wastelands, frigid ice-capped mountain peaks to sweltering hot jungles full of beasts stalking through the undergrowth, fog-blanketed bamboo forests to dark caverns unexplored for centuries—the world of Mortal Online 2 is huge and brimming with creatures, secrets, resources, and opportunity. WHO WILL YOU BE? With four races and the option to mix multiple bloodlines within each race, you can forge a character perfectly tailored to your intentions. In addition to deeply customizing your character’s appearance, you can also build your character the way you’d like without the limit of being bound to classes. Invest in a large variety of impactful armor, weapons, and spells. Choose from an extensive list of unique skills and train them to master them—And if your chosen journey leads you down a new path, freely retrain your character as you see fit. A TRUE SANDBOX EXPERIENCE Mortal Online 2 offers you the choice to play the way you want to, whether alone or with others, with an expanding list of content to facilitate different styles of gameplay. Master numerous in-depth professions such as fishing, armor and weapon crafting, alchemy, and butchery; scour dark dungeons for rare spells to add to your collections; construct and furnish your home with a growing list of decorations; pick rare herbs to sell in far away lands for a profit; or gather together a band of like-minded adventurers into a guild and claim a castle. No matter the direction you take, your time in Nave will be unlike any other—entirely your own and always a part of its history. CONFLICT AND CONSEQUENCE Mortal Online 2 is a world full of impactful choices and consequences. With the exception of placing your items in a bank, almost everything—from armor to gathered resources—will be dropped on your death. This danger exists not only in the monsters and environmental hazards, but from other players as well. Guilds clash, duels are fought, and some may even take up the role of highwayman—all using real-time directional action combat. In a world shaped by conflict, every skirmish could spark something that changes the history of Nave forever. EXPLORE A VAST, LIVING WORLD The world remains large without fast travel, and if you choose to leave the well-guarded settlements and venture into the wilds—it can be dangerous. Many beings exist to be discovered, powered by a dynamic system allowing them to not always be found in the same spot. Encounter skittish deer-like springboks to gargantuan trolls that can throw fully-armored soldiers like toys. Whether you seek to collect rare items, tame a beast to fight by your side, or hunt down a rare creature, the possibilities presented by the world are many, and growing. A REALM SHAPED BY YOUR ACTIONS In Mortal Online 2, the actions of the players decide the social landscape and very gameplay environment in which you play. Whether it’s a house you happen upon in the wilderness, a guild who claim ownership over a region, a list of goods and animals available for purchase on a local auction house—Players, just like you, did all of it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1170950/header.jpg?t=1651856135",
    "Price": 26.79,
    "Developers": "Star Vault AB",
    "Publishers": "Star Vault AB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_b132303ddac6ebd4ec9176184a33816b40eb0812.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_f0b43b1096b103f9bdbf5c5cac9ddc74e85b6a92.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_1400c2d33c688c40e9c76f97e8f19b25ad986373.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_ea62eac947c48ee494b719f17501c0d5671cdc44.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_01e5f04e6b3b3d5859945d42282d4330ceb22ee8.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_2b659112e8ef8b62313ae90df79a3fdb722c176d.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_35f572719340469e8bb1a115b7da1c07d9f74a34.1920x1080.jpg?t=1651856135,https://cdn.akamai.steamstatic.com/steam/apps/1170950/ss_36bd9b32b83f4514cd35551476390417d64011fa.1920x1080.jpg?t=1651856135",
    "Slug": "mortal-online-2",
    "Meta Title": "Mortal Online 2: Jan 25, 2022, Star Vault AB and Full Ove...",
    "Meta Description": "Looking for information on Mortal Online 2? Check out the release date (Jan 25, 2022), developer insights from Star Vault AB, and a complete game summary.",
    "Alt Text Image": "Official header image for Mortal Online 2 game - Steam 1170950",
    "Canonical URL": "https://gusku.site/game/mortal-online-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mortal Online 2\", \"description\": \"Looking for information on Mortal Online 2? Check out the release date (Jan 25, 2022), developer insights from Star Vault AB, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Star Vault AB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Star Vault AB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1170950/header.jpg?t=1651856135\", \"offers\": {\"@type\": \"Offer\", \"price\": 26.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}