{
    "AppID": 1146970,
    "Name": "My Vow to My Liege",
    "Release date": "Sep 21, 2020",
    "About the game": "*Please be aware that the actual game is in 4:3. The widescreen ratio in the advertisement is but a compulsory requirement of Steam of uploading pictures on the store page. We apologize for any misunderstanding. 《My Vow to My Liege》is a visual novel dating game. Players get to play as a girl disguised as a man, FuChai, as the King of Ng. The dateable characters are: XiShi, a famous beauty in ancient China who is an actual lady in history but in this story, we have turned her into a man, an old enemy, GouJian, the undisputably loyal, Wu ZiXu, and the ever-vigilant guard, Chen Feng. Will they choose the man over the country? Love over hate? Who will they finally end up with? 【The Storyline】 In the last years of the dynasty, during the Spring and Autumn Period (approximately between 771 - 476BC), the Liege of a certain nation struggles of hegemony, and wars seemed endless. The Kingdom of Ng defeated their old enemy, the Kingdom of Yue. In the course of the war, the King of Ng, HéLǘ, sustained fatal injuries as he passed the throne to the new king 'FuChai', a girl. To fulfil the secret and long-standing wish of their ancestors of breaking their sacred vow with the Dragon God, she is forced to live a lie. Faced with countless bloody battles to seal the Dragon God, there suddenly appears a reprieve... Amid the chaos, who will loyally sacrifice their life and who will plot a scheme of betrayal—— Will they choose the man over the country? Love over hate? Who will they finally end up with? 【Characters】 Shi YiGuang cv: ？？？ 19years old A citizen of Ng and the next leader of the Shi Clan, the most magically powerful clan in all of the Kingdom of Ng and Yue. As a child, he was FuChai's playmate. He secretly escaped to ZhuLuo Village in the Kingdom of Yue to avoid being sacrificed at the Sword Pond. His medical skills are second to none. He is gentle and kind. His nickname is XiShi. --------On a less serious note-------- ·When washing his bandages and gauze at the river, he is often mistaken as a beautiful maiden by the water. ·His strongest skill is juggling. GouJian cv: ？？？ 21 years old He is the king of Yue, and because he lost the war, he surrendered himself to Ng to become a slave as he guards HéLǘ's mausoleum. He is a proud and arrogant person who suffered terrible humiliation as a slave. That makes him even more and more determined to take revenge on Ng by exterminating the whole country but inadvertently, he becomes friends with FuChai. --------On a less serious note-------- ·His survival skills are on par with Bear Grylls. ·He can down a bottle of MaoTai Wine but becomes a foul-mouth, babbling idiot when he gets drunk. Wu ZiXu cv: ？？？ 37 years old He came from the Kingdom of Chu. The King of Chu executed his family and clansmen when he was a boy, and his hair turned white overnight. HéLǘ brought him up, and his only mission in life is to help FuChai break the sacred vow with the Dragon God. He is highly wary but reliable. --------On a less serious note-------- ·The one he hates the most is the King of Yue, GouJian. ·His occupational hazard as the head instructor is his fear of having his exceptionally talented students kidnapped. Chen Feng cv: ？？？ 22 years old Orphaned on a battlefield, he was taken in by HéLǘ to be a FuChai's playmate. He studied under Mr Sun Wu to become FuChai's most loyal and dependable bodyguard. He is a calm, unapproachable man of few words. --------On a less serious note-------- ·He is a fan of sweet treats and slapsticks. ·He behaves like a spoilt puppy dog? → → This is a historical work of fiction set in the Spring and Autumn period of China (approximately 771 to 476 BC). The background art and fashion depicted in the artwork is only for aesthetic purposes and is not historically accurate. Additionally, the spirits, ghost and gods described here are from legends and folktales of how mankind can conquer elements of nature. Due to the historical setting, certain concepts might not conform to the general consensus of modern society, but it does not in any way represents the position of the production team on the subject.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1146970/header.jpg?t=1655260742",
    "Price": 9.99,
    "Developers": "YETU GAME",
    "Publishers": "方块游戏(CubeGame)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_cb480f259663dbe4977daeededa600f0beb03e01.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_45916a9be077290a6adc039b3f294e453f2435f1.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_1d7b3774227ba105c271e1f40205efbc0b2f23b4.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_868dc368fad34c3116c7821d8fe9032a52f24e07.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_2bf63f9402ee863c21fb76e1ed5a289c015ed22e.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_d04baae9349b4aa123801fbd94e9f1d5df2a97cb.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_32c0bf20a3bb748e83c82e2073d27a26082b6c0d.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_9979535c46d7ee6979f350c75d1ec11b3bb6d85e.1920x1080.jpg?t=1655260742,https://cdn.akamai.steamstatic.com/steam/apps/1146970/ss_bd50fc28f1460ae81e9e3e59bc9d75627cfb4b3d.1920x1080.jpg?t=1655260742",
    "Slug": "my-vow-to-my-liege",
    "Meta Title": "My Vow to My Liege: Sep 21, 2020, YETU GAME and Full Over...",
    "Meta Description": "Looking for information on My Vow to My Liege? Check out the release date (Sep 21, 2020), developer insights from YETU GAME, and a complete game summary.",
    "Alt Text Image": "Official header image for My Vow to My Liege game - Steam 1146970",
    "Canonical URL": "https://gusku.site/game/my-vow-to-my-liege",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Vow to My Liege\", \"description\": \"Looking for information on My Vow to My Liege? Check out the release date (Sep 21, 2020), developer insights from YETU GAME, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"YETU GAME\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u65b9\\u5757\\u6e38\\u620f(CubeGame)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1146970/header.jpg?t=1655260742\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}