{
    "AppID": 768370,
    "Name": "New Dawn",
    "Release date": "Sep 10, 2018",
    "About the game": "THIS GAME IS EARLY ACCESS ALPHA. PLEASE DO NOT PURCHASE IT UNLESS YOU WANT TO ACTIVELY SUPPORT DEVELOPMENT . Keep in mind that a Steam Early Access game is not completely finished, polished or fully optimized . New Dawn is a survival sandbox open-world multiplayer game set on an island during the golden age of piracy Vicious pirates land on an unknown South American island, wreaking havoc everywhere.These seamen are brutal and pitiless. Fighting them off will be no easy feat! A new dawn will rise for the island inhabitants.The peaceful life they have led until now will be no more. They will have to do everything in their power to remain undetected and to survive.But every cloud has a silver lining... The island inhabitants will discover new building techniques, weapons, and other tools useful for survival and protection. The main character is an island native who builds villages, uses natural resources in his quest for survival, and learns how to defend himself from the attacks of the pirates who have landed on the island looking for riches. Features Game in Early Access Customization - Male and Female There will be a chance to personalize your character by choosing the different types Map Size 18.0 mi² (49 km²) Combat System 3 directions for attacking and defending: High, Middle, Low Totem A totem depicts a natural or supernatural entity. It is considered a revered symbol of the tribe. Claim the land and build your very own tribe. The person who builds the totem becomes the Tribe Chief. Inspecting a totem will reveal the Tribe Name, Tribe Chief, Alliances, Tribe Members, as well as Players and NPCs killed by the tribe. All members of the tribe can trade with the allied tribes by using the totem Tree Climbing Climb trees to conceal yourself and observe enemies (The climb is working only on some trees) Pirate Village Raid pirate villages and camps on the island for rich loot NPCs Fighting off pirates will prove to be a challenge! They will find out where you’re hiding and go looking for you Different Structures to Build These include a pit house, a hogan, a teepee, and many more Book Building An architecture book that explains the construction process of complex structures from different materials (wood, stone, igneous rock) and with different levels of defense Slavery System Capture pirates and make them your slaves. Slaves guard and defend the base they are stationed to, but don’t forget to equip them Different Biomes Explore forests, jungles, beaches, caves, and valleys. Decide where you want to build your village Nearby Islands Explore the small islands located nearby Day-Night Cycle Protect yourself from the cold of the night and rain in order not to contract an illness Hunting Different kinds of animals inhabit the island. They are extremely aggressive and agile, so hunting them down isn’t going to be easy Traps Defend your village and hunt for animals using different kinds of traps Mineral Resources Different kinds of resources for building structures and villages, as well as for crafting tools and weapons Herbalism Use herbs to cure diseases, treat wounds, or poison your enemies Tools Craft tools to help you procure resources faster Equipment Craft different clothing items to protect yourself against The Future Development Goals Map Size 21.6 mi² (56 km²) Alliances Tribe Chiefs can arrange meetings with each other and form alliances between their tribes Wrecks Plenty of wreck sites to explore and loot Fishing Fish using a spear or special kinds of traps Cattle Paddocks Build paddocks for breeding domesticated animals. Every animal type has its own paddock Agriculture Plant different kinds of vegetable gardens that will prove essential for your survival Vehicles Find carriage parts that have been left by pirates and look for instructions on how to build and repair these wheeled vehicles Mount Catch a wild horse and domesticate it Barter Barter with other tribes to get items necessary for your survival We are an indie company and we want you - our community - to help us with ideas and development to follow your wishes and imagination about New Dawn. Good spirits be with you",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/768370/header.jpg?t=1574015779",
    "Price": 0.0,
    "Developers": "e-visualsoft",
    "Publishers": "e-visualsoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_2a76bd637121780c023c2917f6fa2ea5fb739017.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_60fe6bdca84e9527122a4b6c9fe4d3a815e7d53c.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_50a5246947676c9a6e9e167a5b6e6ac97d7344e5.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_552df3b7694d5b0327ad0f835187fe9304ccbaa2.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_2c548ea69db544ab39dfae298f6565a2fb17e70a.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_b3e98781b2cf817ef27152eddd0a774326bc6967.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_11b48a0bb327d86613994541b4ef69533dfd7726.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_8d8218070a95e467ddb0d324cca1df8056c54e21.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_6e2555c6e3989a93bbca8675befa2016f32dfbb9.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_9acdedec30c07b674e0b5d7b25178fbc57e4a4bc.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_de005f29bd3e93affd8ba7c648346e7231b12699.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_75dacb5c0acf979c7bcc36148efe717620110ad6.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_8502454e709c5483735bda36c49c0bd188d1559d.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_7172a32fe2c8622de1569ead4053aa3539b19f8b.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_4265d50e9a471b865752c17d2f4d4d6f3f6d2ad6.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_d198bc8799e123f308826745f252dd8cb706d78c.1920x1080.jpg?t=1574015779,https://cdn.akamai.steamstatic.com/steam/apps/768370/ss_552df3b7694d5b0327ad0f835187fe9304ccbaa2.1920x1080.jpg?t=1574015779",
    "Slug": "new-dawn",
    "Meta Title": "New Dawn: Sep 10, 2018, e-visualsoft and Full Overview",
    "Meta Description": "Looking for information on New Dawn? Check out the release date (Sep 10, 2018), developer insights from e-visualsoft, and a complete game summary.",
    "Alt Text Image": "Official header image for New Dawn game - Steam 768370",
    "Canonical URL": "https://gusku.site/game/new-dawn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"New Dawn\", \"description\": \"Looking for information on New Dawn? Check out the release date (Sep 10, 2018), developer insights from e-visualsoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"e-visualsoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"e-visualsoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/768370/header.jpg?t=1574015779\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}