{
    "AppID": 1291100,
    "Name": "Night Spasm",
    "Release date": "May 15, 2020",
    "About the game": "Night Spasm may seem like your average action-adventure RPG, but you've never seen a video game like this before! With its keen combination of retro graphics and modern-day gameplay, Night Spasm takes everything you love from video games and turns it into the greatest video gaming adventure of all time! Explore a lore-heavy world filled with loveable characters, intense combat, and the grooviest soundtrack you've ever heard from over 20+ iconic artists! Night Spasm literally has it all: Memorable characters, exciting battles, a modern sense of humor, epic music, and a story so philosophical you might realize a thing or two about yourself. It's a game of hard choices and major secrets... 'So what the heck is a NIGHT SPASM???' AN EXCITING ACTION-PACKED ADVENTURE WITH A DEEP AND DARK STORY... Following the story of the three main characters Theodore, Vander, and Evana, a terrible airplane crash causes them to teleport to an odd universe called 'The Island'. The Island was taken over by a rebellious phantom-like leader with a major rivalry against the former Island leader. As the newcomers (and the last people to ever come to The Island), you must take down the murderous phantom, Inevit, to restore The Island's former and glorious society! A MYSTERIOUS WORLD WITH AN INCOMPREHENSIBLE WAY OF LIFE Explore the humongous open-world, talk to characters (who may or may not hurt you), craft weapons, cook items, discover locations, and expand your army of colonists. Find mysterious relics and loot chests to receive items, and use your base to feed yourself and repair your equipment. Logic and a resourceful strategy is your greatest chance of succeeding! BATTLE YOUR ENEMIES WITH A STRATEGIC COMBAT SYSTEM OF RISKS, PREDICTION, AND RESOURCEFULNESS Change the flow of the story by fighting anyone you see as a threat, whether it be simple soldiers or an important character. Equip weapons to expand your attack options, then take turns between each ally and enemy until you claim victory or die trying. With many available strategies to win with, find what fighting style suits your party and capitalize on your resources for triumph! THE SMALLEST CHOICES CAN CHANGE THE WHOLE OBJECTIVE OF THE GAME! With much freedom in your hands, the choices you make can completely turn the tables! Who you make your friend and keep alive will change the entire future of your adventure. Choose to kill or spare your enemies and make the best with what you can! Your morals are the most impactful aspect of the game. What is good and bad in this world is your decision, each choice providing positive and negative changes to the lore. All of your decisions will lead up to an ending that changes to an extreme level! With fighting skills and smart thinking, the three heroes could succeed. Or you could, you know, cause the whole story to become a living nightmare (if that is your desire)... This is currently chapter 1... Chapter 1 of Night Spasm is the start of a grand adventure, and it's just getting started! Featuring over 30 to 50 hours of gameplay so far, we're continuing to work on future chapters that will be even more exciting than the last! With every new community member comes brand new ideas we may implement into Night Spasm! Do you want to be part of this community of people from all over the world? THANK YOU FOR CHECKING OUT THE NIGHT SPASM STORE PAGE! Thank you for taking interest in Night Spasm! We hope you consider playing this game and leaving a review of your experience! For more information, subscribe to our YouTube channel and follow our team on Twitter @master_moes. Be sure to join our Discord server too! Thank you for your support! Discord server: Instagram: / Twitch: / Twitter: (Ver. 1.0.7.6) See the community hub for patch notes and other updates, or see them in-game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1291100/header.jpg?t=1654645453",
    "Price": 0.0,
    "Developers": "Gideon Moes",
    "Publishers": "Gideon Moes",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1291100/ss_29fc092bc6df6e9245f1912d6f6c76920eed7b4e.1920x1080.jpg?t=1654645453,https://cdn.akamai.steamstatic.com/steam/apps/1291100/ss_e4e893f4d7cfa729b33325a54b1782724f866187.1920x1080.jpg?t=1654645453,https://cdn.akamai.steamstatic.com/steam/apps/1291100/ss_112d2afb740e9f5c14fbc992680bce3e1e716e51.1920x1080.jpg?t=1654645453,https://cdn.akamai.steamstatic.com/steam/apps/1291100/ss_f2fb769cd2246488492e57cbeecd702c703e4caf.1920x1080.jpg?t=1654645453,https://cdn.akamai.steamstatic.com/steam/apps/1291100/ss_f9a0e34f41a9b61db273e097c3a41e1bd8a47019.1920x1080.jpg?t=1654645453,https://cdn.akamai.steamstatic.com/steam/apps/1291100/ss_014268bc438020669598a90d99836d721fb9fe65.1920x1080.jpg?t=1654645453",
    "Slug": "night-spasm",
    "Meta Title": "Night Spasm: May 15, 2020, Gideon Moes and Full Overview",
    "Meta Description": "Looking for information on Night Spasm? Check out the release date (May 15, 2020), developer insights from Gideon Moes, and a complete game summary.",
    "Alt Text Image": "Official header image for Night Spasm game - Steam 1291100",
    "Canonical URL": "https://gusku.site/game/night-spasm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Night Spasm\", \"description\": \"Looking for information on Night Spasm? Check out the release date (May 15, 2020), developer insights from Gideon Moes, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gideon Moes\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gideon Moes\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1291100/header.jpg?t=1654645453\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}