{
    "AppID": 1355310,
    "Name": "Nightmare Puppeteer",
    "Release date": "Sep 21, 2020",
    "About the game": "MAKE EVERYTHING STRANGER! Make the weirdest animations in the world without having to live in a basement for twenty years to learn how! A 'game' only a filmmaker could make Fun and easy to use strange animation tools designed by internationally renowned award winning animation filmmaker M dot Strange Instantly and easily create attention getting original animations you can share with the world. Add your voice to the weirdo actors you design and puppeteer them in 48 different strange scenes. Add your own sounds, images and even videos to use in your new original animations! Every head in Nightmare Puppeteer does auto lip-sync, you can even add your OWN drawn faces and they will ALSO have lip-sync! Easily create attention getting gifs, music videos, or short films. You could even make a whole original movie with Nightmare Puppeteer! Most ALL of the gifs shown here were created by Nightmare Puppeteer's 'TV Mode', a fully automated and procedural animation mode that created endless automatic original animations. Combine 'TV Mode' with Nightmare Puppeteer's 'Twitch Mode' and you can't imagine the madness you can enable! Hella Features Lotsa Stuff - Includes 60 Scenes, 90 heads, 108 bodies, 90 props + lotsa eyes, teeth, noses, hair you can mix and match + add more stuff using Workshop! Keyboard Puppetry System - using a normal computer keyboard you puppeteer your actors, control the cameras, lights, even time itself and more! Craptacular Character Creator - create the most hilarious and disturbing characters imaginable + add tons of unnecessary props to them Lousy Level Editor - It's a level editor but it's pretty lousy. If it was in a game from 1995 it would be awesome, but its not 1995.... right? Visual Flavor Manager - choose the tastiest flavors for both your actor and the whole scene. Flavors include Krunchy, Wavey and Hyphy. Shut The Hell Up Auto-magic Lip Sync System - Actors will never stop talking using the recorded voices you add or use a live mic instead! Full Steam Workshop integration - Share everything including custom scenes made with the level editor, voice files, custom actors + more! Mediocre Media Compositing Manager - Add your own images, text, and video's(including green screen video) to be badly placed or composited into your scenes! Music Madness Machine - use auto beat detection or a Midi file to drive camera cuts, actor animations, even switching actor bodies and heads + more! Instant lyrics music videos - add a .srt subtitle file and Nightmare Puppeteer automatically displays the titles on screen. Add your own props - use your own models as props to be used by the actors OR drop them into the scene using the Lousy Level Editor! Twitch Mode - enable Twitch mode to allow the chat to control EVERYTHING including adding images, text and even video! HKLR Visual feedback system - taking visual feedback to a new level! Like what you see? Throw a heart! Hate it? Throw mud! + more(Only available in Twitch mode) Youtubrrr - add a randomized ai Youtubrrr to commentate on your scenes, our ai Youtubrrr's are much more interesting than biological ones. Remix Mode - Record your Nightmares including all key presses to remix yourself or share with friends on Workshop! Human Misery Organ - Use one of the presets or add your own sounds to play this evil audio instrument in your scenes. TV Mode - Random algorithms create entire procedural cartoons for you, just sit back and watch the madness and let people interact with them via Twitch chat. Rando's - add a selection of ai controlled chaos agents to your scene for EXTREME madness! Selections include Bear driving invisible car and Morbidly obese couple wielding dynamite and cigarettes 360 image capture - capture 360 images and 360 image sequences you can easily convert to videos(using other software) to share with the world. RR Support - REAL REALITY support, no expensive headset required. Render reality in amazing 9000k with farm raised free range organic eyeballs you already own. RR is the future and amazing and will make all your dreams come true. AND MORE - I can't list all the features because then you'd think I was lying, but there is more. Try the free demo and see for yourself if Nightmare Puppeteer will make all your nightmares come true. If it can be made... it can be made STRANGER! NOTHING is normal anymore. The worlds first cinematic animation maker and puppetry performance engine is here! Will you become the Puppeteer of Nightmares? We can't make your dreams come true, but we got your nightmares on lock. NOW YOU'RE PLAYING WITH NIGHTMARES! *NOTE* Any video/image you create with Nightmare Puppeteer is YOUR ORIGINAL CREATION, you are free to monetize it or do anything else you want with it. *NOTE* Nightmare Puppeteer DOES have built in video capture but it might cause audio sync issues on longer clips. Instead, use OBS or any other program used to capture gameplay videos and they work perfectly. *NOTE* Nightmare Puppeteer cannot create anything normal or mainstream, it can only create awkweird*, cringicidal** or hilurbing*** things. *Awkweird- Awkward + weird **Cringicidal- Cringy + homicidal ***Hilurbing - Hilarious + disturbing IMAGINATION NOT INCLUDED Model Attribution credits: Nightmare Puppeteer includes models by the following SketchFab users using the following license / Thanks to them for sharing their work! Biff by Koda Murray *(Using Body and head separately + modified materials) Cowboi by Zab *(Body only + modified materials) Fox Fem by AzulieZeiro *(Body only + modified materials) Lan Laffinty by Artofant *(Body only + modified materials) Lila Swimsuit by Ifraz01 *(Body only + modified materials) Retopoligized Horse by Hueeeee *(Body only + modified materials) Machoke by Braytendo *(Body only + modified materials) Awkward Look Monkey by Danyy59 *(Using Body and head separately) Doggo by GR.blend *(Using head + modified materials) Sasha by GR.blend *(Using Body and head separately + modified materials) King by GR.blend *(Using head + modified materials) Bailey by GR.blend *(Using Body and head separately + modified materials) Tarot by GR.blend *(Using head + modified materials) Mesh 9 Furry by Keh *(Using head + modified materials) Asahi Beer Bottle by Mizuchi Sensei Asahi Beer Can by Mizuchi Sensei OwlBear by RunemarkStudio *(Body only + modified materials) Kid of Darkness mask Slaughter To Prevail by Hellbrush *(made low poly version and modified materials) Cthulhu Mindflayer by Vindition *(No changes) Stylized Cartoon Skull by Vindition *(No changes) Furry Conejo Final Subir by krinis.vanyelis *(body only + added material) Dot Matrix With Stereo Sound by Jonas Pfeiffer *(Removed cart with Nintendo logo so they don't kill me ^_^) Low Poly Light Bulb by AleixoAlonso *(No Changes) If I have used your model and you would like a free Steam Key for Nightmare Puppeteer I would gladly provide you with one, just contact me(mdotstrange@gmail.com) and I will send you a key. I couldn't figure out a way to send a message on Sketchfab or I would have sent you one there. If I have used your freely available model and have forgotten to credit you please contact me (mdotstrange@gmail.com) so I can add your credit here and give you a free Steam Key if you would like one, thanks and sorry about that!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1355310/header.jpg?t=1656737782",
    "Price": 0.99,
    "Developers": "Imagination Rabbit",
    "Publishers": "Imagination Rabbit",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_b617862b4a551d54f186233a1814dc89f68727dd.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_72f1d1c3a23db72d95667beb1fca8b9473c98905.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_e33c3a019c5f7a557161ce0a481447ca33c7ac1a.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_7a851081751e70bc194d7f573eb254e7be4f5c47.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_c571a5d28e5dfd916822ea4e21bf0719016c2ef6.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_dacd6ffd8095350e47ebb21d209fcda2e76c0e35.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_409614b1ed9781361824d147505fb7307d9e8243.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_921ab1d311fc68a693a51e9f8627e6e212ee555e.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_e0a83132494d54876607cfaa70dcf227b0f21717.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_d17318665389dfa60f5b3a5aaea01d0c27734cb8.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_beba7e7ea6c89462b011a752424fbd01e4265345.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_91f37a551759a670fbade3a25bd6ba98923cb12b.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_a4fa849c3c8869f3b8d046f43127437fc36ecd56.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_1b443f5cc269f687fe2f749c4a28ca79c963236a.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_08b177411f12c3c687a734d9ca53beb5e5349ea3.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_41267ba8839e9162691fdd0a397385d967ff3113.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_31019898c1e4bf44988465a4ea79c875bbe96b4c.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_ccfeeaf0055e6c6e1b895439c2b7de8f7deeb78c.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_11bca19ef69b214488e22ff4913af5852e07f527.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_8b5345490be598740af8f3590c273f010a2a7985.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_8275156f6d5d8b74d683d6bd304c80bdcd5cb636.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_11a476f909b1ca78775600d5c07735a9bf2f206d.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_f81b9d1d3fcc246f790c8ed471e8c8a6200e49c6.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_8d8a271e567446d7bb77a1e70fda1164148c679b.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_b53a2203cba5621137a31ea62ba1b44121aac968.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_1b914404ddcda7716f2b044c6833842711866341.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_792ec429341ceed3d3b4dc59b87340bdd619103a.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_41cc1d03dea0f5a0827453793218d2f48714e87a.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_331e4eb6133ad221b99cba485f6cdd81898fa3e3.1920x1080.jpg?t=1656737782,https://cdn.akamai.steamstatic.com/steam/apps/1355310/ss_03e835e5fe526d847ea2cb1ff52ff8cca43db502.1920x1080.jpg?t=1656737782",
    "Slug": "nightmare-puppeteer",
    "Meta Title": "Nightmare Puppeteer: Sep 21, 2020, Imagination Rabbit and...",
    "Meta Description": "Looking for information on Nightmare Puppeteer? Check out the release date (Sep 21, 2020), developer insights from Imagination Rabbit, and a complete ga...",
    "Alt Text Image": "Official header image for Nightmare Puppeteer game - Steam 1355310",
    "Canonical URL": "https://gusku.site/game/nightmare-puppeteer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nightmare Puppeteer\", \"description\": \"Looking for information on Nightmare Puppeteer? Check out the release date (Sep 21, 2020), developer insights from Imagination Rabbit, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Imagination Rabbit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Imagination Rabbit\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1355310/header.jpg?t=1656737782\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}