{
    "AppID": 1001230,
    "Name": "Partial Control",
    "Release date": "Jun 14, 2019",
    "About the game": "Summary You are a crew member of a cyborg space ship. A signal passes through the ship and hacks everyone's brains. The entire crew loses control and they all start killing each other. It becomes a huge battle royal. However, for some reason, you aren't affected like the others by the hack: you manage to keep partial control over your own actions. Despite your cerebral limitations you are still the only one left that can do something and save the ship. The situation of living the adventure with a hacked brain translates to an interesting game play in which you do not control yourself in real time. Instead you can only make specific decisions at specific moments when the hack in your brain lets you. During these moments time pauses leaving you all the time you want to make your decisions. When you finish taking your decisions you must unpause time and watch your mindless automated body act. During this time you can only hope to survive until the next time your hacked brain allows you to make a conscious choice. Content Campaign: The campaign is made out of 81 levels accompanied by a small story line that will immerse you into the depth of a dark mysterious future. Chaotic Universes Mode: In this mode levels are randomly generated. Every attempt to beat a 'Chaotic Universe' is a different experience. There is a total of 5 Chaotic Universes that get harder and harder. Each Chaotic Universe is made out of 26 levels. During an attempt to beat a chaotic universe you won't be able to save your progress, so if you lose all your lives you will have to restart the 26 levels from the beginning. This mode is extremely unforgiving and it's only recommended for more experienced players. It's not even sure that the final chaotic universe is beatable. Sandbox mode: In this mode you can create your own levels and save them. Creating levels is very simple, it's just a matter of dropping elements into the field. You can mix item compositions to create insane fight scenarios. In this mode you can also view the saved replays of your exploits. You can even retry to beat the levels from the replays.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1001230/header.jpg?t=1614158200",
    "Price": 12.99,
    "Developers": "Cavern Head",
    "Publishers": "Cavern Head",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1001230/ss_faf6373b71209e064c91f5a398eda593054ab9a8.1920x1080.jpg?t=1614158200,https://cdn.akamai.steamstatic.com/steam/apps/1001230/ss_1091dd6c078173244c17026c5269874b2cec151b.1920x1080.jpg?t=1614158200,https://cdn.akamai.steamstatic.com/steam/apps/1001230/ss_f363ebdaa56b590d09bed561c510f38ac36925bf.1920x1080.jpg?t=1614158200,https://cdn.akamai.steamstatic.com/steam/apps/1001230/ss_c72ffa35f8a73b3689af228fd1b38456c5ef58f8.1920x1080.jpg?t=1614158200,https://cdn.akamai.steamstatic.com/steam/apps/1001230/ss_a3be357e56509a09f1c7c08dc16b5e37583b8ea3.1920x1080.jpg?t=1614158200",
    "Slug": "partial-control",
    "Meta Title": "Partial Control: Jun 14, 2019, Cavern Head and Full Overview",
    "Meta Description": "Looking for information on Partial Control? Check out the release date (Jun 14, 2019), developer insights from Cavern Head, and a complete game summary.",
    "Alt Text Image": "Official header image for Partial Control game - Steam 1001230",
    "Canonical URL": "https://gusku.site/game/partial-control",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Partial Control\", \"description\": \"Looking for information on Partial Control? Check out the release date (Jun 14, 2019), developer insights from Cavern Head, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cavern Head\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cavern Head\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1001230/header.jpg?t=1614158200\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}