{
    "AppID": 621880,
    "Name": "Phoenix Dynasty 2",
    "Release date": "Jun 8, 2018",
    "About the game": "Do you care about content more than graphics? Do you wish to go back to the endless nights of boss killing sprees? You even miss those old friendships you built while playing the classical games, don’t you? No more worries, the Old-School MMORPG Phoenix Dynasty 2 is right here for you! Legendary Castle Wars, Village Raids, Caravan Challenges, 24/7 PvP Maps, free Auto-Bot, a Non-Pay-to-Win Market system and many other entertaining activities are awaiting you in this unique MMORPG. We need all the Azurians to get ready for this mystical adventure in the ancient civilizations of the Far East! This special package includes a unique mount that will help you explore the maps much faster at the beginning of the game. It also offers you the items to discover the depths of the PDO2 universe easier. Hurry up to get a free permanent mount and exclusive materials! ‘’When the tears of a mother turn into blood, the Phoenix, one of the four sacred animals blessed by the mighty Pangu, will appear in the sky carrying the Sword of Infinity forged with its fire. Only the leader who holds the Stone of Infinity shall take the Phoenix under his/her command. When the time comes, all dynasties, animals, and gods will gather under the name ‘Phoenix Dynasty’ and become the rulers of the Nine Realms.’’ City War The magnificent NUWA! The city that lives in the dreams of gallant warriors! Every Saturday, the dynasties fight each other to become the new rulers of the city of Nuwa. The City War is made up of two stages. Firstly, the warriors breach the city gates and destroy the statues and bosses in the city. Then the dynasties race with one another to collect the highest number of flags and become the new rulers. The winning clan receives the highest share from the treasure of the city! Village War Every Sunday at 09:00 pm, the dynasties join the battle to conquer the village castles. Only the true warriors bear the power and courage to invade these castles. The Village War is also a pathway that leads you to join the city war and conquer the dream city of Nuwa.To take control of the villages, the warriors must destroy the statues and bosses as well as delivering the highest number of dynasty flags to receive the highest share from the treasure of the village. PvP Map This 24/7 open map hosts high-level mobs and unique bosses. You may enter the PVP map either with your party or on your own. This map also offers you plenty of Fame Points and rare titles that will boost your attributes remarkably. Caravan Challenges Escort the caravans through the world maps and earn tons of gold in return! You may also raid the caravans protected by other dynasties and be cruel outlaws who would do anything to get richer! Be a reliable merchant, or be a dreaded warrior among others! The choice is yours! Dungeon System There are several challenging dungeons you can enter via the related NPCs in Jiangdu. These dangerous maps host cruel mobs and bosses that have sworn an oath to be loyal to Darkazure at any costs! These rewarding challenges also play an essential role in your character’s progress. BOSS System Phoenix Dynasty 2 is full of ruthless Darkazure generals in every corner! You will have to encounter them while dealing with the mobs on each map. By killing those vile bosses, you can receive secret treasures any time and anywhere! Auto-Bot and Auto-Direction System Enjoying your tea or coffee while playing an online game has never been this easy! When a friend of yours drop by, or you want to take a break to watch a TV episode, you can just leave your character to the Auto-Bot and let the Azurian make progress 24/7! Wing System Craft your wings to have a magnificent look and acquire bonus attributes! You can also upgrade the wings to higher levels and types to become invincible. Dynasty Labyrinth War Every Monday, the dynasties battle to take control of the secret labyrinth in Demon Tower specially designed for prominent clans! Only the most powerful will have the privilege to rule this dungeon and challenge the crazy bosses! Tiger vs. Dragon Event Are you ready for an ever-lasting war? Tiger vs. Dragon is the toughest battle of the century even the darest warriors think twice before entering! Every day from 20:00 – 22:00, this unique PvP map invites all the warriors wanting to prove their power to the entire world of Phoenix Dynasty 2! The Royal Battlefield Join the Royal Battlefield up to seven times a day to compete with the ruthless invaders alongside many other players like you! With its unique mobs and tough bosses, the Royal Battlefield is the right place to demonstrate your skills and gain experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/621880/header.jpg?t=1534758268",
    "Price": 0.0,
    "Developers": "Ntroy LTD",
    "Publishers": "Ntroy LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_490b262935498e5b388fa2b6d4866ed81f756e6c.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_c645badc0a863295e4920345cfd7c54d1baaae35.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_59d7208ecf4b1ed9f9573e9280840f320f6b829f.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_c7e56ed6fdcfc11e860c49008a58b3489677a03b.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_704ce08549f0a66abd4d74d85f8ad4a70cf59aba.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_2a80e443fe29ddc25f56af562dd8d110786cc0f4.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_44a25fc6f82f451f3d51c0ea3a9502401982ded3.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_e3facad5ce57750b6552d8d31a746edd2f345ae2.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_7af61a6245d14d821bbafdfd0eae437b81d9ee51.1920x1080.jpg?t=1534758268,https://cdn.akamai.steamstatic.com/steam/apps/621880/ss_938c16c811af2af48b74558811c3c65d511470ad.1920x1080.jpg?t=1534758268",
    "Slug": "phoenix-dynasty-2",
    "Meta Title": "Phoenix Dynasty 2: Jun 8, 2018, Ntroy LTD and Full Overview",
    "Meta Description": "Looking for information on Phoenix Dynasty 2? Check out the release date (Jun 8, 2018), developer insights from Ntroy LTD, and a complete game summary.",
    "Alt Text Image": "Official header image for Phoenix Dynasty 2 game - Steam 621880",
    "Canonical URL": "https://gusku.site/game/phoenix-dynasty-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Phoenix Dynasty 2\", \"description\": \"Looking for information on Phoenix Dynasty 2? Check out the release date (Jun 8, 2018), developer insights from Ntroy LTD, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ntroy LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ntroy LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/621880/header.jpg?t=1534758268\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}