{
    "AppID": 1320490,
    "Name": "Princess Farmer",
    "Release date": "Mar 31, 2022",
    "About the game": "Princess Farmer is a match3 puzzle and visual novel game with easy to learn action mechanics and different playstyles that let you breeze through the game or challenge you. All three of the playstyles earn you rewards! The story is played in episodes , much like magical-girl anime, with each lasting between 20 minutes to 1 hour, depending on your chosen playstyle, your skills, and whether you decide to skip dialogue interactions. Different level goals keep you on your toes and bring a fresh approach to the match3 genre. Dialogue options let you choose how Princess Farmer interacts with her friends, affecting your relationships with them. Make them your BFF and they may reward you with gifts! Princess Farmer was just an ordinary farmer when one day she woke up under the Gaia Tree. Now through the magic of Mother Gaia, she can hoist up whole rows of veggies with ease to make matches and smash obstacles by herself, in co-op, or even with an AI companion! Something mysterious is happening in the woods and it's your job to puzzle your way to uncover it! You'll learn about the world around you as you talk and build relationships with the loveable characters including: Mother Gaia, Garlic, Shoppe Keeper Rowan, and even BunBot! Make combos! Smash rocks! Win hearts! Action Puzzle Gameplay It may look like Princess Farmer plays like modern match-3 games but it’s much more strategic and reaction-based, tasking you with character movement and stack management. You can choose to adjust how you approach your strategy to maximize matches, combos, and smashes. Personalize your playstyle: are you an Action Bunny, a Puzzle Bunny, or a Balance between the two? Level goals range from simple (like score, timed, harvest a certain veggie) to challenging (like fulfilling requests, avoiding matching certain veggies, danger areas). Some levels will pit you up against a (pretty adorable) opponent. But watch out for storms! That's when Grumpy Block shows up to spoil all your harvesting fun! Play with a Friend Sure harvesting is fun by yourself, but why not invite a friend? You can harvest together and even make dialogue choices together as you explore the world. With Steam's Remote Play Together, you don't even have to be in the same house! Collect Unlockables As you play, you'll earn Heart Coins which you can give to Ro at the Shoppe to collect different Hare Dyes. Charm the characters with dialogue options to unlock new outfits so you can harvest in style! Charming Graphics It's cute! It's bouncy! It's pink! It's retro! It's BUNNIES! Vibrant Soundtrack Produced by Astra, the soundtrack is bubbly, blending chiptunes with lo-fi beats. Additional music is by Chloe Hotline, The Crystal Furs, and Anne Beyond the Darkness. About Samobee Games We’re a wife/wife team building games in the mountains of British Columbia in Canada. We love all things cute and girly! About Whitethorn Games We’re an indie game publisher focusing on pleasant, cozy games that can be played in pieces, that require no special skills or knowledge, and that anyone can pick up and play. We’re believers in accessibility, inclusion, and widening the audience that gets to play. We like to consider ourselves the defenders of easy games.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1320490/header.jpg?t=1655232430",
    "Price": 14.99,
    "Developers": "Samobee Games",
    "Publishers": "Whitethorn Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_cba5c1a0abeac40f52c93f6d4208a64a257b06dc.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_89c3ef0ab1df919cef6a1f01d9b96976d672fdc0.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_31011ad127020291e88263da88637b6f281be356.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_f12e1a96b995681643c52686f3599edf9d7ceb2a.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_fbd67a31e45e2f16fc3ebcc02bfdc93bc1ac3b39.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_ed6252ab1837350d63032cffd84d916dd605ef48.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_b560c0ae3a97db6c70d50a8ded9245b0c70c16c5.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_fe4e76688e9539c1228c43d1b122f65489a60612.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_fb0583030742993fa55a16c3c5e28564619e90c1.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_d5c39f733accda7b5724d2d6bc15d159a1cbbb49.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_350151a6856a6fff78f5b2475e0459466f8777fd.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_287fb0e651d2f1a51d6dca8a3d511cfc050e333d.1920x1080.jpg?t=1655232430,https://cdn.akamai.steamstatic.com/steam/apps/1320490/ss_28dcdd87f5091a6b82341fb66bb5e541d721c011.1920x1080.jpg?t=1655232430",
    "Slug": "princess-farmer",
    "Meta Title": "Princess Farmer: Mar 31, 2022, Samobee Games and Full Ove...",
    "Meta Description": "Looking for information on Princess Farmer? Check out the release date (Mar 31, 2022), developer insights from Samobee Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Princess Farmer game - Steam 1320490",
    "Canonical URL": "https://gusku.site/game/princess-farmer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Princess Farmer\", \"description\": \"Looking for information on Princess Farmer? Check out the release date (Mar 31, 2022), developer insights from Samobee Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Samobee Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Whitethorn Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1320490/header.jpg?t=1655232430\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}