{
    "AppID": 788930,
    "Name": "Razerwire:Nanowars",
    "Release date": "Feb 28, 2018",
    "About the game": "RW:NW™ is a personal revisitation of the 80s' arcades where I spent most of my pocket money as a kid. It's also my very first solo project after six years of working on much larger team projects. After all that work on slow pachyderms, I wanted to take a stab at something smaller, faster to make, and granting a more immediate fun. So, I dusted a gameplay idea I hid in a drawer a couple of years back, I set it up as a 30 minutes-a-day project and started working on it during lunch breaks. When the prototype was welcomed quite enthusiastically by the first testers, I decided to make it real. Razerwire:Nanowars™ is as a simple little game, quite replayable and with a little nice set of upgrades, achievements and highscores to beat to satisfy the progression geek in all of us. It is suggested to play with a mouse, but now since version 1.07, Razerwire integrates full controller support as well If you get to have half the fun playing it as I had making it, I think you'll cherish it! Cheers, Emiliano, @DokHgn Use the mouse to maneuver a monomolecular filament (the RazerWire) to protect your generators and kill the nanobugs assaulting them. Survive endless waves of attackers with increasing difficulty. Avoid hits on the Generators. Use the RazerWire to destroy your enemies. Use left and right mouse click to activate some powerups (like the Antimatter Blaster and the PowerWave). Enjoy a rogue-like progress: Survive as many waves as possible, die, use earned points to unlock upgrades and powerups, and then jump back in the fight (there are checkpoints every 20 waves, no worries!) Multiple enemy types with several variants each : 7 Movement types (including Teleport, Accelerating Zig zags and Escaping from the Wire) 4 Shooting modes including homing missiles, scrambling bullets and all-around shooting 2 Armor types Multiple unlockable upgrades for the Wire including Shields, Armor, Health and Recovery Times Up to 7 powerups including Anabolishields, Nanoblades and Chrono Molasses Procedural difficulty increase in the endless waves progression If you like what you see, feel free to follow me (@DokHgn) and RWNW (@RzW_NW) on Twitter! Support is the best fuel for productivity ;) In a future far, far away, humanity has colonized most of the galaxy. However, our world is being exterminated by an unseen enemy. When scientists figured out that the killers are nano-sized, virus-like aliens, Dr.Illerotsap modifies a medical tool, a monomolecular filament used for nano-scale medical operations, and turns it into a formidable weapon against the enemy. The RazeWire was born. My thanks go first and foremost to my family and to Jenny, for supporting my mad attempts at making a living with a job that I love. To Olaf for sharing my office throughout the whole development, drooling over my flip flops and covering the floor with hair and love. To my friend Ottavio from Mash Machine for having made the super cool music for the game. To Yannis for all the help with the copies and marketing (I am even worse at that than at art otherwise ;) ). To Juhani Junkala for his amazing 8-bit VFX libraries / To Siim and Mikk for the moral support throughout the project.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/788930/header.jpg?t=1631634065",
    "Price": 0.49,
    "Developers": "Hammer and Ravens",
    "Publishers": "Hammer&Ravens",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_d39c95160a20bc0c98271088685c019d7110fbce.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_dec081367b71fd11b0808a0b0337897e82a7ec82.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_94abe931cb60c6078598a3f0b3f2f5ba7bdca24f.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_0ae91e0530f9e30cb72a14e6e0389135d166df71.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_112e291a7358f009abfb168809f200287c82ca8a.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_c16dac33afaa1c4ff8bb43ede092330e51a904d5.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_5296b55fb5b75ba1a463f392529996b893a8ac76.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_178c01fa10cb4a921bc19b9cb220223953fc44a2.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_55cb77347a1af9d45bcac772cf17965cf72b7bb6.1920x1080.jpg?t=1631634065,https://cdn.akamai.steamstatic.com/steam/apps/788930/ss_1a534a4c8e965c06e0b61ebd01b38696777a4181.1920x1080.jpg?t=1631634065",
    "Slug": "razerwire-nanowars",
    "Meta Title": "Razerwire:Nanowars: Feb 28, 2018, Hammer and Ravens and F...",
    "Meta Description": "Looking for information on Razerwire:Nanowars? Check out the release date (Feb 28, 2018), developer insights from Hammer and Ravens, and a complete game...",
    "Alt Text Image": "Official header image for Razerwire:Nanowars game - Steam 788930",
    "Canonical URL": "https://gusku.site/game/razerwire-nanowars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Razerwire:Nanowars\", \"description\": \"Looking for information on Razerwire:Nanowars? Check out the release date (Feb 28, 2018), developer insights from Hammer and Ravens, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hammer and Ravens\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hammer&Ravens\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/788930/header.jpg?t=1631634065\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}