{
    "AppID": 357700,
    "Name": "Rogue Continuum",
    "Release date": "Oct 4, 2016",
    "About the game": "A wise-cracking space marine, an ice cold sniper, a homicidal robot and a chainsaw-wielding aristocrat travel back in time to save Earth from destruction in a co-op roguelike planet-crawler. It’s the year 2890 AD and Earth just got blown into tiny pieces by an unknown alien force. Humanity’s only hope are an elite strike force of galactic super soldiers who fortuitously managed to escape on a prototype spaceship that can travel back in time by 28 days. Turning back the clock with no idea as to who the assailants were/are/will be, they do the sensible thing and decide to kill all hostile alien races to make sure. Go solo or team up with up to three friends for intense roguelike planet-crawling action. Choose from four distinct characters each with their own play-style, weapons and abilities. Earn XP to upgrade each character’s stats and abilities between runs and find blueprints to unlock and upgrade weapons in the Armory. Features Save planet Earth from the certain doom that just happened : our best, and only, plan - travel back in time and obliterate all the hostile alien planets we know about before they have the chance to destroy Earth. That will totally work and absolutely makes us the heroes of this story. Friendship is fragging other species into non-existence together : some people like to play with themselves and that’s totally fine but personally I always enjoy company when I’m shooting aliens in the face. With online and local co-op multiplayer for up to four friends or strangers, you too can experience the intensity of group slugging. Die, Upgrade, Repeat : each time you die, the ship will jump back in time and you can start over. Only this time, you’re that little bit tougher, a little bit quicker. Maybe you learnt a new skill, maybe you found some blueprints to a new weapon. With an infinite amount of time at your disposal even a punk like you could become the ultimate soldier. Funny how each time you jump back things are a little bit different though. Probably shouldn’t have chosen butterflies as the ship pet. Four flavours of fatality : Each character has a set of weapons that only they can use and abilities that only they are allowed to learn. The reasons for this are on a strictly need-to-know basis. Hey, this is a top secret military unit we’re talking about here, civilian; we told you about the time travel thing, what more do you want? Mysterious item shop merchant of unknown motivation : all the best games have them and this is no exception. Loot credits from the corpses of the alien scum you’ve slaughtered and give them to a strange hooded man to get cool gear like bullets that freeze enemies or boots that make you walk super fast. Alternatively, forego immediate gratification and invest in the merchant to unlock even cooler stuff for your future past self to purchase. Some of the best weapons we could think of : how does a dysfunctional crew of borderline psychopaths save the galaxy from a never-ending horde of bugged out aliens? Because someone gave them ridiculously overpowered weapons and abilities such as calling down an airstrike inside an underground cavern of course. Discover blueprints that have been carelessly left lying around the galaxy to discover even more awesome weaponry or upgrades.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/357700/header.jpg?t=1565900622",
    "Price": 0.0,
    "Developers": "Rocktastic Games",
    "Publishers": "Rocktastic Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_0f2907a7cee5fe076f698946816193d1f3988b04.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_c8ca2eca893e95d3c5dc48d7a455dea3c8076021.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_667a06a850ea6306558baa3a36f84396cf8d04df.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_9a69535cb50a45b1c582d5b8127c2e700205abc9.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_88b93084ceab28df7514b4a7b7d666bf195a5955.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_28d3461b9bf236b3780eb94bf398a5828db8f8cf.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_96e2e2677ea40b5c5eaa8c91356ab7d48b221ca9.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_5107b17fe3d011374b07c19a0f039ddc87dc316c.1920x1080.jpg?t=1565900622,https://cdn.akamai.steamstatic.com/steam/apps/357700/ss_e12ca03eacd077b35dca85dd72ab1f023066ec23.1920x1080.jpg?t=1565900622",
    "Slug": "rogue-continuum",
    "Meta Title": "Rogue Continuum: Oct 4, 2016, Rocktastic Games and Full O...",
    "Meta Description": "Looking for information on Rogue Continuum? Check out the release date (Oct 4, 2016), developer insights from Rocktastic Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Rogue Continuum game - Steam 357700",
    "Canonical URL": "https://gusku.site/game/rogue-continuum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Continuum\", \"description\": \"Looking for information on Rogue Continuum? Check out the release date (Oct 4, 2016), developer insights from Rocktastic Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rocktastic Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rocktastic Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/357700/header.jpg?t=1565900622\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}