{
    "AppID": 788000,
    "Name": "RogueVerse",
    "Release date": "Aug 22, 2019",
    "About the game": "RogueVerse Dungeon is a 2D tactical turn-based dungeon crawler, suitable for all ages. The archetypal RPG elements like unit classes, exploration, monster encounters and looting are widely formalized in order to provide a quick and smooth gameplay. A full playthrough takes around 2 hours for an advanced player. Combats - the core mechanic of the game present a series of small tactical challenges - player needs to take rational decisions when confronting various types of enemies, and use a logical approach in traversing through the five stages of increasing difficulty. The random generated levels and the tight hi-score system promise high replayability, as well as strong competition for the top ranks in the leaderboard. Multiple hi-score entries are allowed per player, with each record providing insightful information and statistics about the playthrough taken. Features: Unique tactical battle system. Tutorial highlighting the important battle mechanics. 5 random generated stages of increasing difficulty and size. 42 different enemies. 24 of them can be summoned to fight on the player side. 64+ cards to open - they work like achievements, but some of the cards can be used in-game as well. For example enemies are summoned by obtaining their card first. 50+ items and collectibles. There is no inventory - best items are equipped automatically. Linear experience/level-up system. Skills and abilities gained on level-up are predefined. Tavern in each stage where player can buy weapons/accessories and save game progress. Extensive scoring system, encouraging the player to master best optimal play-through. Multiple hi-score records per player allowed. Score entries provide detailed statistics. Stroryline: RogueVerse Kingdom is under attack by evil forces rushing from the Shadows, led by the Dungeon Lord himself. The king of RogueVerse has gathered a party of four heroes to embark on a crucial task. They must descend into the Underground city of Shadows to find and engage the Dungeon Lord in his domain. Lead a Knight, Ranger, Cleric and Wizard into the depths of a tough and crowded network of dark caves, deep chasms and dangerous dungeons, but beware! There are no health potions in this role playing game, however there is plenty of beverages to drink at the tavern. Cheers! Mouse or Touchscreen controls: Click / Tap to walk, take or attack in the desired location. Click / Tap on any unit in your party to activate/deactivate abilities or cast spells. Right Click on units to see their description Keyboard controls and shortcuts: K - Knight draw shield N - Ranger draw bow Y - Wizard prepare to cast spell H - Cleric heal / protect instantly B - Wizard change weapon G - Cleric change weapon Arrows - 8 way movement, diagonal emulation by holding two keys at the same time Q W E A D Z X C - 8 way movement (numpad mapped in the same movement scheme) U - Toggle Sound M - Toggle Music F - Fullscreen R - Display Cards I - View Enemy Info Chart O - Display Hi-Scores V - Enter a Tavern T - Settings ENTER - Confirm SPACE - Cancel Gamepad controls: Coming soon.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/788000/header.jpg?t=1566908713",
    "Price": 9.99,
    "Developers": "FoumartGames",
    "Publishers": "FoumartGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_cead2ef6e83d23a5bb7d90ad96bd7a358bbd193c.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_e7d081f66af4391ad09841879798fac62d4ba1e7.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_54499b22bb1568b2bdaab46638494312ab5408a4.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_e1fd49e22e8dca289ebd6549e0e378f41f60a973.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_27c1cfbe6c413441fd91ca8780962fc0b7cd4250.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_339b52cee38e9309423098e0242daf775144582f.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_e8c007e255a17f25ca1fd0521ca268747abe2df8.1920x1080.jpg?t=1566908713,https://cdn.akamai.steamstatic.com/steam/apps/788000/ss_34bae743f5a6edfcd25b6ac8540cfb87e54604d1.1920x1080.jpg?t=1566908713",
    "Slug": "rogueverse",
    "Meta Title": "RogueVerse: Aug 22, 2019, FoumartGames and Full Overview",
    "Meta Description": "Looking for information on RogueVerse? Check out the release date (Aug 22, 2019), developer insights from FoumartGames, and a complete game summary.",
    "Alt Text Image": "Official header image for RogueVerse game - Steam 788000",
    "Canonical URL": "https://gusku.site/game/rogueverse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RogueVerse\", \"description\": \"Looking for information on RogueVerse? Check out the release date (Aug 22, 2019), developer insights from FoumartGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"FoumartGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FoumartGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/788000/header.jpg?t=1566908713\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}