{
    "AppID": 524010,
    "Name": "Siege of Centauri",
    "Release date": "Sep 12, 2019",
    "About the game": "Communications to Earth's first interstellar colony in Proxima Centauri have gone dark. In response, Earth has dispatched the Carpathia to investigate. Upon arrival, you find a colony under siege. Your mission: save the colony from these brutal alien invaders. Siege of Centauri puts you in command of the defense of Earth's first interstellar colony. Set in the Ashes of the Singularity universe, thousands of alien machines are attacking and only you, with your arsenal of deployable defense structures and strategic orbital abilities, can stop them. Customize the Carpathia in order to best handle the challenges of each individual mission, battle across the surface of an alien world through a series of story-driven campaigns or see how long you can survive in a doomed region where the enemy waves are truly endless. The enemy comes in all shapes and sizes, challenging you to counter them with the right defense in the right place. Siege of Centauri combines the best elements of classic tower defense games with the strategic depth Stardock has delivered in past titles, including Sins of a Solar Empire: Rebellion and Ashes of the Singularity. Features Defend the colony on Proxima Centauri from hordes of alien invaders in a vast campaign full of challenging missions. Deploy defenses, use powerful orbital abilities, and call units at the right time and place in order to survive the onslaught. Create your own missions using the workshop, then upload and share them with other players. Download new missions created by other users, too. Customize your defenses using dozens of tower upgrades. Determine what you need in order to survive. Upgrade your particle cannon to slow its target, your Artillery Post to leave fire in areas it has attacks, or your Corrosion Mortars so that victims infect the allies around them. Survive against unrelenting enemy waves in Endless Mode and see if you can outlast other players on the leaderboards. Fight against dozens of enemies with unique attacks and defenses. Beware the Falling Star that disables defenses when it explodes, or the Heart of the Phoenix that forms a chrysalis when destroyed that can be reborn as a new Heart.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/524010/header.jpg?t=1637248610",
    "Price": 14.99,
    "Developers": "Stardock Entertainment",
    "Publishers": "Stardock Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/524010/ss_7ac66905cf213baa4fb4f9f7f8e0b2e4e6a211f1.1920x1080.jpg?t=1637248610,https://cdn.akamai.steamstatic.com/steam/apps/524010/ss_ff69ad35daa0ff8ad238b413c404eb583baaed56.1920x1080.jpg?t=1637248610,https://cdn.akamai.steamstatic.com/steam/apps/524010/ss_13dcec23b71c0ba9776c25b1054fa017fada268f.1920x1080.jpg?t=1637248610,https://cdn.akamai.steamstatic.com/steam/apps/524010/ss_3de6c2eae0f5e42d2fc5012616a647714988216f.1920x1080.jpg?t=1637248610,https://cdn.akamai.steamstatic.com/steam/apps/524010/ss_712edc8dfddef3de8875e1ea2eef1c8800083a0e.1920x1080.jpg?t=1637248610",
    "Slug": "siege-of-centauri",
    "Meta Title": "Siege of Centauri: Sep 12, 2019, Stardock Entertainment a...",
    "Meta Description": "Looking for information on Siege of Centauri? Check out the release date (Sep 12, 2019), developer insights from Stardock Entertainment, and a complete ...",
    "Alt Text Image": "Official header image for Siege of Centauri game - Steam 524010",
    "Canonical URL": "https://gusku.site/game/siege-of-centauri",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Siege of Centauri\", \"description\": \"Looking for information on Siege of Centauri? Check out the release date (Sep 12, 2019), developer insights from Stardock Entertainment, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/524010/header.jpg?t=1637248610\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}