{
    "AppID": 355490,
    "Name": "Stratus: Battle For The Sky",
    "Release date": "Dec 2, 2016",
    "About the game": "Stratus: Battle For The Sky is a unique RTS reboot the game style mechanics of the old RTS, Netstorm Islands at War with the help of the original developers under a new IP and game work.. Enter the world of Stratus, ruled by the powerful and fickle Tempest gods of Wind, Thunder, Rain, and Sun. The world of Sonus is torn by powerful, eternal storms. The native inhabitants live on the majestic islands hovering high above the billowing maelstrom. Even though the inhabitants normally live in the calmer skies, their islands, over time, will be called down to the lower levels by the Tempests during what the natives call 'Times of Descent'. There they battle to prove their faction's worthiness to the Tempests and in so doing ascend once more to the peaceful higher realms. High Priests Take control of a high priest of Sonus. Your faction's priest may align to any one of the Tempest by constructing a temple dedicated to one of your choosing. Your priest is your avatar, and through your priest you may cast powerful spells to turn the tide of battle and aid your units. Though your priest is your avatar in-game, he is also your enemies number one goal to capture to submit as an offering to their chosen Tempest through an altar they construct. Stratus: battle for the sky will be released as early access and will continue to be developed and updated over time as we roll out further game features beyond first early access release, what to expect in EA What to expect from this first release 1. Players may log into the current work in progress lobby and join a battle ring, player may select world size, island size, Island numbers 2. Player Can launch game from battle ring in the lobby getting into game, we have tested with up 7 players in testing of joining and hosting server. if single person in is in ring toggling the gear next to name will launch game, if more then one person is on battle ring once they click to toggle in the game will launch. 3. Once in game players may construct temple and and workshop along with power generators and rain resource collecting golems and collect resources. 4, Player can also place bridge section and connect islands and construct from bridges.. 5. Rain faction Ice cannon, Rain beat spawning pools work to attack enemy structures in range.. 6. Review the currently finished Sun faction and Rain faction units designs. Coming Update The dev team is currently working on the following patch update fixes 1. health bar for units and structures showing current remaining health. 2. resource collection loop timing out bug that pops up sometimes fixed where resource collector stop occasionally 3. Priest capture and Altar for win game 4. correction to minor buildings dependency requirement for resource collectors and bridges Important This is a very early release and marks the first presence of Stratus: Battle for the sky on steam and as such it is still buggy but we are looking for players to report bugs so that we can move forwards with patching and implementing remaining factions and features as we move forwards to completing and polishing the game through funds raised.. Why release now? the team hopes through coming to steam early access to help raise funds to continue developing and finish the thunder and wind factions and finalize and polish gui elements for in-game and the battle lobby along with remain elements needed to complete Stratus.. Please report all issues or questions to the games community page",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/355490/header.jpg?t=1551955641",
    "Price": 15.99,
    "Developers": "Storm Isle Productions,Polywickstudio",
    "Publishers": "Storm Isle Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/355490/ss_24f24c10fc9789b383908158a8632bbbc9296fde.1920x1080.jpg?t=1551955641,https://cdn.akamai.steamstatic.com/steam/apps/355490/ss_b6c8906ec3801d60b26d0559fa3884a379e83f27.1920x1080.jpg?t=1551955641,https://cdn.akamai.steamstatic.com/steam/apps/355490/ss_0ce648d469e0b0ece6d07f420db1e19f93acaf8d.1920x1080.jpg?t=1551955641,https://cdn.akamai.steamstatic.com/steam/apps/355490/ss_0ce648d469e0b0ece6d07f420db1e19f93acaf8d.1920x1080.jpg?t=1551955641,https://cdn.akamai.steamstatic.com/steam/apps/355490/ss_24f24c10fc9789b383908158a8632bbbc9296fde.1920x1080.jpg?t=1551955641",
    "Slug": "stratus-battle-for-the-sky",
    "Meta Title": "Stratus: Battle For The Sky: Dec 2, 2016, Storm Isle Prod...",
    "Meta Description": "Looking for information on Stratus: Battle For The Sky? Check out the release date (Dec 2, 2016), developer insights from Storm Isle Productions,Polywic...",
    "Alt Text Image": "Official header image for Stratus: Battle For The Sky game - Steam 355490",
    "Canonical URL": "https://gusku.site/game/stratus-battle-for-the-sky",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stratus: Battle For The Sky\", \"description\": \"Looking for information on Stratus: Battle For The Sky? Check out the release date (Dec 2, 2016), developer insights from Storm Isle Productions,Polywic...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Storm Isle Productions,Polywickstudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Storm Isle Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/355490/header.jpg?t=1551955641\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}