{
    "AppID": 1369520,
    "Name": "Strangeland",
    "Release date": "May 25, 2021",
    "About the game": "You awake in a nightmarish carnival and watch a golden-haired woman hurl herself down a bottomless well for your sake. You seek clues and help from jeering ravens, an eyeless scribe, a living furnace, a mismade mermaid, and many more who dwell within the park. All the while, a shadow shrieks from atop a towering roller-coaster, and you know that until you destroy this Dark Thing, the woman will keep jumping, falling, and dying, over and over again.... Strangeland is a classic point-and-click adventure that integrates a compelling narrative with engaging puzzles. For almost a decade, we've been working on a worthy successor to the fan-acclaimed Primordia , and we are proud, at long last, to share our second game. Strangeland is a place like no other. Even in the real world, carnivals occupy a twilight territory between the fantastic and the mundane, the alien and the familiar. In their funhouse mirrors, their freaks, and their frauds, we see hideous and haunting reflections of ourselves, and we witness the wonder and horror of humanity in just a few frayed tents, peeling circus wagons, dingy booths, and run-down rides. Strangeland , of course, is most definitely not the real world. Indeed, unraveling the connections between this nightmare and the real world is the game's central mystery, and finding a way out is its central challenge. As you explore Strangeland , you will need to gather otherworldly tools and win strange allies to overcome a daunting array of obstacles. Forge a blade from iron stolen from the jaws of a ravenous hound and hone it with wrath and grief; charm the eye out of a ten-legged teratoma; and ride a giant cicada to the edge of oblivion.... Amidst such madness, death itself has no grip on you, and you will wield that slippery immortality to gain an edge over your foes. Navigating this domain of monsters and metaphors will require understanding its denizens and its enigmas. Unlike many adventure games that offer a linear experience and single-solution puzzles, Strangeland lets you pick your own way, your own approach, and your own meaning—one player might win a carnival game with sharpshooting, another by electrical engineering; one player might unravel a strange prophet's wordplay while another gathers visual clues scattered throughout the environment. Ultimately, Strangeland 's story will be your story. You are not the audience; you are the player. Approximately five hours of gameplay, replayable thanks to different choices, different puzzle solutions, and different endings Breathtaking pixel art in twice Primordia 's resolution (640x360—party like it's 1999!) Dozens of rooms to explore, with variant versions as the carnival grows ever more twisted An eccentric cast, including a sideshow freak, a telepathic starfish, an animatronic fortune-teller, and a trio of masqueraders Full, professional voice over and hours of original music A rich, thematic story about identity, loss, self-doubt, and redemption Integrated, in-character hint system (optional, of course) Hours of developer commentary and an 'annotation mode' (providing on-screen explanations for the references woven throughout the game) At Wormwood Studios, we make games out of love—love for the games we've spent our lifetimes playing, love for the games we ourselves create, and love for the players who have made all of those games possible. We know that players invest not just their money and time in the games they play, but also their hope and enthusiasm. And we want to make sure that players receive a rich return on that investment by creating games that provide not only a fun, challenging diversion for a few hours, but also lasting memories to keep for years. We think the best way to achieve that with Strangeland is to adhere to the genius of the adventure genre: the marriage of challenging puzzles and thrilling exploration, on the one hand, with an engaging narrative, on the other. At the same time, we've tried to remove the punitive aspects of adventure games (deaths, dead ends, illogical puzzles, pixel hunting, backtracking, etc.). Within this framework, we add uncanny visuals, memorable characters, and thought-provoking themes. The result for Primordia was a game that has received thousands of positive player reviews, and we have refined our approach further with Strangeland . We hope it will not disappoint the players who have given us such great support and encouragement over the years! And we hope that it will find a place in the hearts of new players as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1369520/header.jpg?t=1657774841",
    "Price": 14.99,
    "Developers": "Wormwood Studios",
    "Publishers": "Wadjet Eye Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_9b28e212e31be24cce834afe9e6be77779080cdb.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_b136d11f68bc9b7bd90c846172fc266924846512.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_a5cbba4a80d9e4d5b5f70557780600e0a9578aba.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_a25c0e9e0376548fb2b6707aac3e6f0f38e0d17c.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_eecad9855b917e9baa380d1b0bee3d239cb203eb.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_bd424cec1f2cae688a9d14b6f437328d88b91493.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_1aac486b173376d307fb8bc40ef02eec8a7abbec.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_7d6cb179e4061f95614e7d532a2b1a9846cde724.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_54c52913f2aacc8e04c00e068c7416b74e8b1da7.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_6782e115116d537f0fd35aa088913640d359f5a5.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_e41012bd153c02aefd139992d1c06e2cb379f1ea.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_f2bb34127ccb94a68371d618074417bba68e7c22.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_f5373453505d3b1a23ed2d4f958ca0b2631aa535.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_aaf83e83ec7a6c123697b03c877fd4e538cd823c.1920x1080.jpg?t=1657774841,https://cdn.akamai.steamstatic.com/steam/apps/1369520/ss_d3d3804be2329b2f371674660f6006e7d551b49c.1920x1080.jpg?t=1657774841",
    "Slug": "strangeland",
    "Meta Title": "Strangeland: May 25, 2021, Wormwood Studios and Full Over...",
    "Meta Description": "Looking for information on Strangeland? Check out the release date (May 25, 2021), developer insights from Wormwood Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Strangeland game - Steam 1369520",
    "Canonical URL": "https://gusku.site/game/strangeland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strangeland\", \"description\": \"Looking for information on Strangeland? Check out the release date (May 25, 2021), developer insights from Wormwood Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wormwood Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wadjet Eye Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1369520/header.jpg?t=1657774841\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}