{
    "AppID": 343860,
    "Name": "Tacoma",
    "Release date": "Aug 1, 2017",
    "About the game": "The Venturis Corporation wants their AI back. That’s where you come in. Tacoma is a narrative adventure set aboard a high-tech space station in the year 2088. As you go about your mission, you’ll explore every detail of how the station’s crew lived and worked, finding the clues that add up to a gripping story of trust, fear, and resolve in the face of disaster. At the heart of Tacoma is the facility’s digital surveillance system, which has captured 3D recordings of pivotal moments in the crew’s life on the station. As you explore, echoes of these captured moments surround you. You’ll use your ability to rewind, fast-forward, and move through the physical space of these complex, interwoven scenes to examine events from every angle, reconstructing the multi-layered narrative as you explore. Tacoma is the next game from the creators of Gone Home, and carries on that tradition of detailed, immersive, and powerful storytelling, while pulling players deeper into the narrative than ever before. Now featuring over two hours of Developer Audio Commentary! Just start a new game with Commentary enabled, or toggle it on in the Gameplay options. Features: A Richly Layered Story Experience: Six crewmembers lived and worked on space station Tacoma, forming relationships, experiencing love and loss, and facing crisis together. Discover not just what happened to these people, but what makes them who they are, through your role as an interactive investigator. The story is told through a series of fully voiced and animated interactive AR scenes, immersing you in the events on Tacoma. A Groundbreaking Multi-Path Story System: In each section of the station, you are surrounded by digital representations of crewmembers following their own parallel story threads that diverge, recombine, and split off again. Rewind, fast-forward, and move through these scenes’ chronologies as they swirl around you. Your interactive tools allow you to discover the tightly-knotted narrative from every angle, and in every detail. A Deeply Interactive Gameworld: Explore Tacoma Station both physically and digitally. Unlock doors and drawers to find meaningful objects, notes, and physical artifacts, while simultaneously exploring extensive records of the crew’s digital communications and personal thoughts. Every facet of the crew’s experience on Tacoma is part of your investigation. A Vision of the Future: Experience life in the year 2088. Discover a rich fictional universe that depicts humanity’s expansion into low-Earth orbit and beyond. A deeply-imagined speculative vision of the near future from the award-winning story team behind Gone Home and BioShock 2: Minerva’s Den. A Compact Narrative Game: Tacoma is estimated to take around 2 to 5 hours to complete. How deep you dig and how much detail you find is up to you. Tacoma is a non-combat, non-puzzle-focused game. The details of the story and gameworld are there for you to discover at your own pace. Developer Commentary Mode! Tacoma now includes over two hours of Audio Commentary from the writers, designers, programmers, artists and more who worked to bring the world of Tacoma to life. Learn secrets about Tacoma's fictional world, insight into the game development process, and personal stories from the people behind the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/343860/header.jpg?t=1596651493",
    "Price": 19.99,
    "Developers": "Fullbright",
    "Publishers": "Fullbright",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_5f28c18796e68f306ae0bc290c1498bef8f7ee9b.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_52effc12c87c4f68b5999a7b6b15b89a0d0d612a.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_8d3590e95c165a427545c8276acb1a9c093f5abf.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_875fba27c6b9462ea0693177c5a52e37e349b1ca.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_48d5bf311815ee566574da23698bf82cc0d5e635.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_2a332fb6b145e53c42da612d66a1ae97c0988401.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_51cdb08bb3bd551df9d9c2ed559d37a72fa2fde3.1920x1080.jpg?t=1596651493,https://cdn.akamai.steamstatic.com/steam/apps/343860/ss_ad957ae1770e9969da3067f092d74ff1a2c6d23e.1920x1080.jpg?t=1596651493",
    "Slug": "tacoma",
    "Meta Title": "Tacoma: Aug 1, 2017, Fullbright and Full Overview",
    "Meta Description": "Looking for information on Tacoma? Check out the release date (Aug 1, 2017), developer insights from Fullbright, and a complete game summary.",
    "Alt Text Image": "Official header image for Tacoma game - Steam 343860",
    "Canonical URL": "https://gusku.site/game/tacoma",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tacoma\", \"description\": \"Looking for information on Tacoma? Check out the release date (Aug 1, 2017), developer insights from Fullbright, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fullbright\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fullbright\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/343860/header.jpg?t=1596651493\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}