{
    "AppID": 1577120,
    "Name": "The Quarry",
    "Release date": "Jun 9, 2022",
    "About the game": "As the sun sets on the last day of summer camp, the teenage counselors of Hackett’s Quarry throw a party to celebrate. No kids. No adults. No rules. Things quickly take a turn for the worse. Hunted by blood-drenched locals and something far more sinister, the teens' party plans unravel into an unpredictable night of horror. Friendly banter and flirtations give way to life-or-death decisions, as relationships build or break under the strain of unimaginable choices. Play as each of the nine camp counselors in a thrilling cinematic tale, where every decision shapes your unique story from a tangled web of possibilities. Any character can be the star of the show—or die before daylight comes. How will your story unfold? YOUR STORY, THEIR FATE Will you dare to check what's behind that trap door? Will you investigate the screams echoing from within the forest? Will you save your friends or desperately run for your life? Every choice, big or small, shapes your story and determines who lives to tell the tale. A STUNNING CINEMATIC EXPERIENCE Cutting edge facial capture and filmic lighting techniques, combined with incredible performances from an iconic ensemble cast of Hollywood talent, bring the horrors of Hackett’s Quarry to life in a pulse-pounding, cinematic thrill ride. ENJOY THE FRIGHT WITH FRIENDS Place your faith in up to 7 friends in online play*, where invited players watch along and vote on key decisions, creating a story shaped by the whole group! Or, play together in a party horror couch co-op experience where each player picks a counselor and controls their actions. CUSTOMIZE YOUR EXPERIENCE Adjustable difficulty for all gameplay elements let players of any skill level enjoy the horror. And if you prefer to watch rather than play, Movie Mode lets you enjoy The Quarry as a binge-worthy cinematic thriller. Select how you want the story to unfold, kick back, and munch on some popcorn in between all the screams! STARRING: David Arquette as Chris Ariel Winter as Abigail Brenda Song as Kaitlyn Evan Evagora as Nick Halston Sage as Emma Justice Smith as Ryan Miles Robbins as Dylan Siobhan Williams as Laura Skyler Gisondo as Max Zach Tinker as Jacob Ethan Suplee as Bobby Grace Zabriskie as Eliza Lance Henriksen as Jedediah Lin Shaye as Constance Ted Raimi as Travis *Online multiplayer functionality will be available post-launch on or by July 8, 2022.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1577120/header.jpg?t=1658354742",
    "Price": 0.0,
    "Developers": "Supermassive Games",
    "Publishers": "2K Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1577120/ss_6bc90067dc39209a30b981e7a84559e7e0f9ae11.1920x1080.jpg?t=1658354742,https://cdn.akamai.steamstatic.com/steam/apps/1577120/ss_a3bffb7f9dfdb600e2f42bbe8acde38f77915b80.1920x1080.jpg?t=1658354742,https://cdn.akamai.steamstatic.com/steam/apps/1577120/ss_79feecbc3c4097c516cbb0f11f928e29fac84b00.1920x1080.jpg?t=1658354742,https://cdn.akamai.steamstatic.com/steam/apps/1577120/ss_94fe3b01d8e2a1f7a8f231523b03597405211889.1920x1080.jpg?t=1658354742,https://cdn.akamai.steamstatic.com/steam/apps/1577120/ss_8e7720649353401c04224405c344efc558b267dc.1920x1080.jpg?t=1658354742",
    "Slug": "the-quarry",
    "Meta Title": "The Quarry: Jun 9, 2022, Supermassive Games and Full Over...",
    "Meta Description": "Looking for information on The Quarry? Check out the release date (Jun 9, 2022), developer insights from Supermassive Games, and a complete game summary.",
    "Alt Text Image": "Official header image for The Quarry game - Steam 1577120",
    "Canonical URL": "https://gusku.site/game/the-quarry",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Quarry\", \"description\": \"Looking for information on The Quarry? Check out the release date (Jun 9, 2022), developer insights from Supermassive Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Supermassive Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2K Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1577120/header.jpg?t=1658354742\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}