{
    "AppID": 588990,
    "Name": "The Homestead Invasion",
    "Release date": "Jan 10, 2018",
    "About the game": "Intro The first outposts fell within minutes and before morning there was nothing but radio silence. Did they come from a distant world or deep within the Earth’s crust? Perhaps they were formed by the very fibers of man’s worst intentions, a cosmic comeuppance for lives misspent. Whatever their origin, these are the facts: they don’t rest, they can’t be reasoned with, and their intent is singular; to extinguish mankind wherever they step foot. Shore up your outpost, take up arms, and hope the night ends with this terrible enemy returning from whence they came. Gameplay The outposts have gone quiet and the sensor network is down, but things look clear at outpost 1. Have they withdrawn or do they lie quietly in wait? You must make your way to the outpost to find the answer. Get the outposts back online, and with the help of your AI companion accessible over your handheld radio, take back and defend from an onslaught of monstrous invaders. Use whatever you can to keep them at bay. Board up the doors and build your defenses, secure the hatches, but even that won’t stop them for long... Load up, strap on your guns, and prepare to fight to reclaim what’s yours. Play the first gamemode Reclamation, at outpost 1. New reclamation maps will be released monthly and sometimes seasonally depending on the occasion. Features Unique barricade system for building up your defenses to hold the attackers at bay. Periodic map releases with unique scenarios to keep things fresh. Relentless AI that will stop at nothing in their pursuit to track you down and kill you. A variety of weapons for sending the geisters into oblivion. Beautiful and terrifying sound design that builds a sense of peril. A stylized comic book esque world. Updates New map with expanded gameplay All new weapons Improved AI Updated graphics and style Multiple movement controls, now including slide movement. Future More outposts to reclaim Additional game modes, meaning new goals in new places, with new tools to get the job done. Story mode. Improved mechanics. We've got things in a good place for an early access release but we still have time to spend time ironing out mechanics, for all aspects of game play. More dynamic gameplay. From setting traps to sneaking, future game modes will offer even more diverse gameplay. Oculus Support Oculus is fully supported out of the box with a 2 sensor setup. Vive Support Vive is fully supported out of the box.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/588990/header.jpg?t=1550760501",
    "Price": 8.99,
    "Developers": "Ore",
    "Publishers": "Ore",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_5be75f622ad5bd54e242c0c68f5a113e294ff513.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_3ef9c4b5382d3a724501d19b9a3ba5f3ddb6e6c1.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_4d9abb94e54debcfd8c2202a7fb97ecf5d460514.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_478e7914ee7d6122f47e44a23a6104d3fac4f23c.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_deb2d9e8175fb1bdc43ef4f4c64494f5ecdd10e2.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_e59b0389f42de806154e940d48af58f11efde76b.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_5d24e41ecaca529187e2acdb6bad6f4efb610f14.1920x1080.jpg?t=1550760501,https://cdn.akamai.steamstatic.com/steam/apps/588990/ss_9f4255c360e531c9783a77d608c782452eed9463.1920x1080.jpg?t=1550760501",
    "Slug": "the-homestead-invasion",
    "Meta Title": "The Homestead Invasion: Jan 10, 2018, Ore and Full Overview",
    "Meta Description": "Looking for information on The Homestead Invasion? Check out the release date (Jan 10, 2018), developer insights from Ore, and a complete game summary.",
    "Alt Text Image": "Official header image for The Homestead Invasion game - Steam 588990",
    "Canonical URL": "https://gusku.site/game/the-homestead-invasion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Homestead Invasion\", \"description\": \"Looking for information on The Homestead Invasion? Check out the release date (Jan 10, 2018), developer insights from Ore, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ore\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ore\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/588990/header.jpg?t=1550760501\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}