{
    "AppID": 542480,
    "Name": "Therian Saga",
    "Release date": "Mar 27, 2017",
    "About the game": "Therian Saga is a MMORPG that tries to stand out of the crowd by offering a compelling storytelling surrounded by a massive mathematical set of rules that define the world your hero will evolve in. It could be said that it borrows elements from old-time MUD games, strategy games and even tabletops RPG. What to expect from the game: Skill Based: We use a system based on your hero, your tool, your companion, your location and some magic to calculate your capability to execute an action. Sandbox: It’s up to you to understand how to progress in the game. Storytelling: Old school style with text as the main medium for storytelling. Crafting: Complex, with a skills distribution mechanic from material to final product. Huge: The game is online since 2012, there are years of content available right now. Asynchronous: Play how much you like, be it 15 minutes or 20 hours, and program your hero’s actions. He will be doing them when you are sleeping, partying or working. Indies: The game is rough on players; you have to work hard to reach your goals. Devs: We are close to the players and you can discuss the future of the game with us. Asynchronous made cool To break the prejudice that asynchronous game had to be simple games. That was really important to us. We wanted a game that people could spend less time on than live MMO, but that could offer more for each second online. Your characters work while you are offline, but you will be also thinking about what you are going to make them do next time you log in. There are lots of games out there that are time-consuming for nothing. Building an asynchronous game that goes deeper into RPG gameplay: that was a battle worth fighting. A typical day in Therian Saga You can play the game the way you want. There is never a situation in the game where you have to stay at the computer. You can quit in the middle of a dungeon, even in the middle of a fight, and come back the next day and pick up where you left off. If you quit in the middle of a fight with another player, your characters will continue to fight as well as they can while you are offline. What about the typical day? As an example, suppose you can manage only short-playing sessions during your day. You might schedule tasks for your hero in the morning, then just check if everything is ok at lunch time and maybe indulge in some trading and social activities. In the evening, when you have a bit more time, you'll have lots of “live gameplay” options: quests, adventures, dungeon-raiding, fights with other players in the arena, maybe even a boss run. At the end of your play session, you might ask your hero to sleep, or carry on working during the night. If you miss one of your normal play sessions, your heroes usually have enough tasks left that they can continue to evolve anyway. Now that gives you a lot of flexibility and, as you can see, the game goes beyond asynchronicity and offer lots of live gameplay possibilities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/542480/header.jpg?t=1615431527",
    "Price": 0.0,
    "Developers": "Virtys",
    "Publishers": "Virtys",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_d0217ca112d69b2a53d9384f9c87d690585c3b36.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_8e1e85ee3bc7137d049eff654494232b49992f88.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_b69316c9ce2d6dcdbfa8c810b2826d6fafcbf5b8.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_d7938b8a26c3d91439a1f1a56bc5cb4e37006c6a.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_c67c34c966777982e72aa1319f5c03c4da0dfd57.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_6a4510e8e87011ff665a017e373f5e93e77dec3b.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_19f6dc0b52d3eb4fa2348379ee5a5000379bffa0.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_519b904c500c9ab36755f2722d0c00c61e40abc3.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_f42963b9a758f1245c30399017c210751b7f980e.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_d49803d8a59bd4889473d4a7bc220ecac9af0150.1920x1080.jpg?t=1615431527,https://cdn.akamai.steamstatic.com/steam/apps/542480/ss_fbadf6a9efe891924130bc653e0b67d134e71722.1920x1080.jpg?t=1615431527",
    "Slug": "therian-saga",
    "Meta Title": "Therian Saga: Mar 27, 2017, Virtys and Full Overview",
    "Meta Description": "Looking for information on Therian Saga? Check out the release date (Mar 27, 2017), developer insights from Virtys, and a complete game summary.",
    "Alt Text Image": "Official header image for Therian Saga game - Steam 542480",
    "Canonical URL": "https://gusku.site/game/therian-saga",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Therian Saga\", \"description\": \"Looking for information on Therian Saga? Check out the release date (Mar 27, 2017), developer insights from Virtys, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Virtys\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Virtys\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/542480/header.jpg?t=1615431527\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}