{
    "AppID": 8000,
    "Name": "Tomb Raider: Anniversary",
    "Release date": "Jun 5, 2007",
    "About the game": "Tomb Raider: Anniversary retraces Lara Croft's original genre-defining adventure  globe-trotting 3rd person action-adventure in pursuit of the legendary Scion artifact. Using an enhanced 'Tomb Raider: Legend' game engine, the graphics, technology and physics bring Lara's adventure and pursuit of a mystical artifact known only as the Scion right up to today's technology standards and offers gamers a completely new gameplay experience. Re-imagined, Anniversary delivers a dynamic fluidly and fast Lara Croft, massive environments of stunning visuals, intense combat and game pacing, and an enhanced and clarified original story. Epic Exploration - The lost city of Atlantis and ancient Egyptian pyramids are ripe for discovery: explore every hidden dark crevice and impossible heights; enter into strange, undiscovered lands and solve their deepest, darkest mysteries; open doors to new realms, uncover great rewards and unearth secrets to Lara's past. Acrobatic Gunplay - Deftly leap around charging enemies while you unleash a hail of bullets from your trademark dual pistols. Lethal Predators - The wilderness awaits with a wide range of bestial predatorsfrom bats to wolves to bearsready to defend their territory from human encroachment. New and improved AI means that all enemies will exhibit a more diverse behaviour set, providing improved combat challenges for the player. Supernatural elements are used sparingly to provide a mystical allure around the world, while maintaining the world's grounded core. The awesome T-Rex and intriguing Atlantean centaurs suck you in to the wonderfully intriguing and mysterious world of Tomb Raider. Death-Defying Environmental Playground - Leap over massive gaps, cling onto rock ledges, and swim through underground tunnels. Solve the Diabolical Machinery of the Past - seek to outwit the brilliant ancient designers of many epic puzzles and vaults in order to uncover their secrets. Be warned that they do not take kindly to 'meddling', and as such, the price of failure is extreme.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/8000/header.jpg?t=1592494287",
    "Price": 8.99,
    "Developers": "Crystal Dynamics",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/8000/0000002092.1920x1080.jpg?t=1592494287,https://cdn.akamai.steamstatic.com/steam/apps/8000/0000002093.1920x1080.jpg?t=1592494287,https://cdn.akamai.steamstatic.com/steam/apps/8000/0000002094.1920x1080.jpg?t=1592494287,https://cdn.akamai.steamstatic.com/steam/apps/8000/0000002095.1920x1080.jpg?t=1592494287,https://cdn.akamai.steamstatic.com/steam/apps/8000/0000002091.1920x1080.jpg?t=1592494287,https://cdn.akamai.steamstatic.com/steam/apps/8000/0000002096.1920x1080.jpg?t=1592494287",
    "Slug": "tomb-raider-anniversary",
    "Meta Title": "Tomb Raider: Anniversary: Jun 5, 2007, Crystal Dynamics a...",
    "Meta Description": "Looking for information on Tomb Raider: Anniversary? Check out the release date (Jun 5, 2007), developer insights from Crystal Dynamics, and a complete ...",
    "Alt Text Image": "Official header image for Tomb Raider: Anniversary game - Steam 8000",
    "Canonical URL": "https://gusku.site/game/tomb-raider-anniversary",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tomb Raider: Anniversary\", \"description\": \"Looking for information on Tomb Raider: Anniversary? Check out the release date (Jun 5, 2007), developer insights from Crystal Dynamics, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2007\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crystal Dynamics\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/8000/header.jpg?t=1592494287\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}