{
    "AppID": 1916970,
    "Name": "Tree Simulator 2023",
    "Release date": "Apr 1, 2022",
    "About the game": "It's that time! Its time to discover what it means to be a tree! Become a true work of art! Every frame a painting, every tree an original masterpiece. Be a tree alone or with friends online! Tree discord A lot went into 2023 so here is a breakdown of some of the features. Features Be a tree 3rd 'person' camera Stretch your roots and move around. More cosmetic items similar to the 'Red tie' Small handcrafted map now with a new area Select from 30 trees Many configurable tree settings Customizable weather system (Rain, Snow, Wind, Fog, Overcast) Day night cycle Seasons (As the seasons change, the trees appearance, weather, and environment will change) Save settings Multiplayer Server admin support Server browser that helps you easily connect with other players Private game support Password required servers (optional) Built in text based chat Ultra-wide monitor support Windowed support (a little wonky) Wallpaper engine support Xbox Controller support PS4 Controller Support Multiplayer Be the best forest you can be! Invite up to 250 glorious trees to join your forest. You can host a server and set the amount of trees that can join along with passwords and making the lobby private. Servers that are public will appear in a lobby list when trees click 'Join'. If a server is private you will only be able to join if that person is on your friends list or by invite. For transparency, multiplayer is tested with 4 trees, but it should support up to 250. There is no built-in voice chat. It is recommended that Discord or Steam chat be used. You can join a game in various ways: Host a game Host tree clicks 'Host' Host tree configures various desired settings or leaves them as default (Server name, private, password required) Host tree clicks 'Confirm' Join a game from the menu Tree clicks 'Join' Tree observes desired lobby in the list Tree clicks 'Connect' on desired lobby Join a game from an invite Host tree presses [Esc] on the keyboard Host tree clicks 'Invite' Host tree uses invite dialog to invite other trees Other trees start Tree Simulator 2023 Other trees press [Shift]+[Tab] to activate the Steam overlay Other trees click 'Play Game' in the Steam chat window Join a game from your friends list Tree observes friend tree playing Tree Simulator 2023 Tree immediately tells everyone they know Tree starts Tree Simulator 2023 Tree presses [Shift]+[Tab] to activate the Steam overlay Tree clicks 'Join game' in the Steam overlay from their friends name Questions about multiplayer?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1916970/header.jpg?t=1648810788",
    "Price": 3.99,
    "Developers": "Revmatek",
    "Publishers": "Remvatek",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1916970/ss_4fa738c59f47793148ae56e23e3059d5225f68b7.1920x1080.jpg?t=1648810788,https://cdn.akamai.steamstatic.com/steam/apps/1916970/ss_f54f8a2379dc22b7243f6811dbc3fd7c4bd23ac2.1920x1080.jpg?t=1648810788,https://cdn.akamai.steamstatic.com/steam/apps/1916970/ss_4e679891ee75c87531a87048cdaaa2c060c3688c.1920x1080.jpg?t=1648810788,https://cdn.akamai.steamstatic.com/steam/apps/1916970/ss_29a4f1f00bd9d2acaab826087973134c7007b87f.1920x1080.jpg?t=1648810788,https://cdn.akamai.steamstatic.com/steam/apps/1916970/ss_0b17a8bc104c78cbd8172ed5118dcdde5a578f11.1920x1080.jpg?t=1648810788",
    "Slug": "tree-simulator-2023",
    "Meta Title": "Tree Simulator 2023: Apr 1, 2022, Revmatek and Full Overview",
    "Meta Description": "Looking for information on Tree Simulator 2023? Check out the release date (Apr 1, 2022), developer insights from Revmatek, and a complete game summary.",
    "Alt Text Image": "Official header image for Tree Simulator 2023 game - Steam 1916970",
    "Canonical URL": "https://gusku.site/game/tree-simulator-2023",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tree Simulator 2023\", \"description\": \"Looking for information on Tree Simulator 2023? Check out the release date (Apr 1, 2022), developer insights from Revmatek, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Revmatek\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Remvatek\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1916970/header.jpg?t=1648810788\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}