{
    "AppID": 361790,
    "Name": "Winged Sakura: Mindy's Arc 2",
    "Release date": "Apr 26, 2019",
    "About the game": "Winged Sakura: Mindy's Arc 2 is a sequel to Winged Sakura: Mindy's Arc . It is not necessary to play the prequel to enjoy this game. Story Mindy Akumori recovers her memories and exits the dimensional world only to find her nation, Hysteria, in a brink of war. She voluntarily joins the Hysteria military and is now being personally trained under her sister, Cindy Akumori, a highly ranked commander. Within a short amount of time, it was reported that the situation was more dire than the informants proclaimed. The enemy nations have gained access to a forbidden spell that has allowed them to conquer a clear majority of Hysteria in one fell swoop by deactivating and surpassing Hysteria’s defense. Mindy receives an order to sortie east and she happily complies, but she encounters the unexpected and something nasty begins to stir... Features Innovative Tower Defense Experience a breathtaking Tower Defense game like no other. Strategically plan and overwhelm enemies by materializing time ticking units onto the battlefield or by casting powerful spells. Equip units with powerful items to unleash their fullest potential via our Progression System. Progression System Level up and gain skill points to learn and upgrade skills. Equip units with powerful items that can be obtained through crafting and clearing stages. Enchant and uncap the items to maximize their stats. 17 Playable Characters with Powers Customize your favorite units with over 25 equippable Powers obtainable in the game, each coming with a unique passive ability. A Rewarding Grind Boost the drop rates of any rare items you wish to obtain from a Free Battle stage to guarantee the item to drop within a few clears. Bond Abilities Using a skill will trigger specific Unique units' Bond Abilities, making them perform powerful actions. Minzy and Nino's Bond Abilities can become even more powerful when you raise their Affection by completing their story events. 2 Story Arcs Sortie east and learn what happens to Mindy through 15 Chapters, splitting into two story arcs. Enjoy the comedic character and side stories as you venture through the first arc. Steam Trading Cards &amp; Leaderboards Obtain popular emoticons creatively designed for the Winged Sakura series. Compete against others on the Steam Leaderboards. Post Game Content Complex Boss Challenges Designed for those who crave for more challenging post-game content. Utilize well-geared units to their fullest potential and overcome extremely difficult boss fights in Progressive Survival Mode. Progressive Survival Mode Unlock the most powerful items by playing through the Progressive Survival Mode up to 100 waves. A checkpoint is created every 10 successful wave clears, allowing you to easily farm for specific end-game items. After clearing all 100 waves, you can continue indefinitely, but checkpoints are no longer saved.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/361790/header.jpg?t=1569955513",
    "Price": 9.99,
    "Developers": "WINGED SAKURA GAMES",
    "Publishers": "WINGED SAKURA GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_44178744ebbcb104ce96d199c1b70460ca078d11.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_4aa0cd448917880ea2f12886746589abdccff69a.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_16f1ec6c3637cb010318002dcbab75d1459d2272.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_0f00aa0f0386437398452caee1022c0e75cf1a3a.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_3586010b2b2f22fa66d71d9086a2bbc7879218eb.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_185aaf850d347e11c456b6327fd0829a0cd98422.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_9d2759ca0b0109ee155f910942d6a31bdc9e8fe0.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_2c98c988cc4e0f51af93492dcb0cf224062038ad.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_f761b32e9b946633721c869a21b5964e40473745.1920x1080.jpg?t=1569955513,https://cdn.akamai.steamstatic.com/steam/apps/361790/ss_919e970d95ad38f4d68a998b9815fdb06b213c3b.1920x1080.jpg?t=1569955513",
    "Slug": "winged-sakura-mindy-s-arc-2",
    "Meta Title": "Winged Sakura: Mindy's Arc 2: Apr 26, 2019, WINGED SAKURA...",
    "Meta Description": "Looking for information on Winged Sakura: Mindy's Arc 2? Check out the release date (Apr 26, 2019), developer insights from WINGED SAKURA GAMES, and a c...",
    "Alt Text Image": "Official header image for Winged Sakura: Mindy's Arc 2 game - Steam 361790",
    "Canonical URL": "https://gusku.site/game/winged-sakura-mindy-s-arc-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Winged Sakura: Mindy's Arc 2\", \"description\": \"Looking for information on Winged Sakura: Mindy's Arc 2? Check out the release date (Apr 26, 2019), developer insights from WINGED SAKURA GAMES, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"WINGED SAKURA GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"WINGED SAKURA GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/361790/header.jpg?t=1569955513\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}