{
    "AppID": 1856890,
    "Name": "Zhazari VR",
    "Release date": "Mar 16, 2022",
    "About the game": "Zhazari VR Do you feel like diving into a world full of fantastic adventures? Then you've come to the right place! Zhazari is a game where many enemies are waiting for you, you will face orcs, ghosts and dark monsters. The inhabitants count on your endurance and strength in battle. You are the last hope to restore peace to the valley of Gherdania. Story In the past, Gherdania was full of life, people were happy, they danced extensively, the stalls were full of vegetables, fruits, handicrafts and beautiful clothes brought by merchants from all over the world, and almost every day a ship entered the harbor. Children ran carefree through the streets, the cities were full of peace, joy and friendliness. Unfortunately, all this happiness was lost when the king of Gherdania wanted to acquire more land for his kingdom and invaded the cursed forest with his army. Many warned him of the evil that lurked in the darkness and the curse that would be upon him if he crossed the forbidden place. However, the king thought this was a made-up legend and did not give up his plan. As soon as they entered the forest and cut down the first tree, the earth pulled them deep inside and a curse of darkness fell on the entire kingdom. Monsters appeared, wanting to take possession of every corner of the kingdom. Since then, nothing was the same, people fled with their families, those who had nowhere to go hid in cellars and attics, the cities became gloomy, sad and deserted. From everywhere eerie moans, roars and howls.... Do you dare to confront the scary magical creatures so that the townspeople can feel safe again? During your quest you will visit many interesting places, you will be able to enter buildings and castles and look into every nook and cranny, but be careful, you never know where the danger lurks. Into the Game At the beginning of the game you only have a sword in your inventory, but as you defeat more and more enemies you have a chance to gain other weapons, such as a bow or an axe. Weapons are always with you, you can reach for what you need at any time. With each level of the player, the monsters become stronger and more difficult to defeat, but for each of them you get EXP, so with the accumulated skill points you can improve your avatar, providing among other things faster regeneration, more strength and less damage. The world of zhazari is divided into 4 different sections, which can be selected from the menu after entering. The enemies that appear are randomly chosen, so you will find different types of enemies in different places. The focus of the game is on the melee combat system between you and the enemies. The story is a small part that you can read between the loading screens.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1856890/header.jpg?t=1647446351",
    "Price": 24.99,
    "Developers": "Virtual Rabbit Studio",
    "Publishers": "Virtual Rabbit Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1856890/ss_2a547d794b71e9f96ea6bcd2eb63126477a21bf1.1920x1080.jpg?t=1647446351,https://cdn.akamai.steamstatic.com/steam/apps/1856890/ss_f67b033572de4785a3bbb8f644526f7ae089f528.1920x1080.jpg?t=1647446351,https://cdn.akamai.steamstatic.com/steam/apps/1856890/ss_82bd49b6cbf648c287f15ef46e6fdb3ba47e212c.1920x1080.jpg?t=1647446351,https://cdn.akamai.steamstatic.com/steam/apps/1856890/ss_1f057af65bb456477d8f2e8cd69e5d76c44da692.1920x1080.jpg?t=1647446351,https://cdn.akamai.steamstatic.com/steam/apps/1856890/ss_dc3d4ef27072d76c1330e0a05c13a865c6b50813.1920x1080.jpg?t=1647446351,https://cdn.akamai.steamstatic.com/steam/apps/1856890/ss_76df3789210039b6061784160aa5673795dfe3da.1920x1080.jpg?t=1647446351",
    "Slug": "zhazari-vr",
    "Meta Title": "Zhazari VR: Mar 16, 2022, Virtual Rabbit Studio and Full ...",
    "Meta Description": "Looking for information on Zhazari VR? Check out the release date (Mar 16, 2022), developer insights from Virtual Rabbit Studio, and a complete game sum...",
    "Alt Text Image": "Official header image for Zhazari VR game - Steam 1856890",
    "Canonical URL": "https://gusku.site/game/zhazari-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zhazari VR\", \"description\": \"Looking for information on Zhazari VR? Check out the release date (Mar 16, 2022), developer insights from Virtual Rabbit Studio, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Virtual Rabbit Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Virtual Rabbit Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1856890/header.jpg?t=1647446351\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}