{
    "AppID": 856980,
    "Name": "7-in-1 Brain Sharpness Bundle",
    "Release date": "May 17, 2018",
    "About the game": "We transform science into delightful games For decades, researchers have created tasks that measure cognitive abilities. We’ve adapted some of these tasks and made some of our own, creating cognitive games. It makes you smarter! 7-in-1 Brain Sharpness Bundle - This is a set of games for brain training. Just a few minutes a day will help you improve your memory, attention, speed of decision making, etc. Improve your brain and compare your results with other people! Memory Lamp This training develops spatial working memory. This helps to better navigate in space, remember where in the parking lot you left the car, how to get to the library, etc. Memory Comparison This training increases working memory and fluid intelligence. It is used in neurophysiological studies to stimulate the activity of certain areas of the brain, as well as in psychology to assess and develop working memory, logical thinking, the ability to concentrate and, in general, fluid intelligence. Attention Symmetry The trainer develops attention and speed of decision-making. Reading an image with an ever-changing color and shape positively affects visual perception, attention, and decision-making speed, and an ever-increasing level of complexity increases efficiency. Just a few minutes, a couple of times a day, will bring your eyes in tone and improve your attention to detail. It is recommended to perform a workout before work, which requires a lot of concentration. Find The Unique The game improves concentration of attention, which helps to allocate the desired figure from the background and to keep this object, in turn, it increases the focus on different tasks, the fulfillment of goals and the completion of tasks to the end. Speed Comparison The game is aimed at training the speed of reaction and thinking. There is a myth that the reaction rate is the same for all, but it is not. You can easily verify this. It is enough to pass the test to determine the speed of reaction with friends or relatives. You will notice that it is different. Even one person during the day shows a different reaction rate. Another myth says that the reaction rate can not be improved. This is also not so. A lot of research confirms that the reaction is significantly increased due to exercise. Color Comparison The game develops the ability to suppress inappropriate responses that interfere with targeted actions. Speed Symmetry This exercise is for brain training, which improves memory and intellectual analysis. You will need to decide whether the displayed figure is symmetrical on the Y axis. (Symmetric means that its left side is the mirror image of the right side)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/856980/header.jpg?t=1529415011",
    "Price": 12.99,
    "Developers": "ALEKSANDER CHEPAIKIN",
    "Publishers": "ALEKSANDER CHEPAIKIN",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/856980/ss_da335eb5b3c80d6f84de431109ed369717dbe6af.1920x1080.jpg?t=1529415011,https://cdn.akamai.steamstatic.com/steam/apps/856980/ss_b839350f82a31085903fead4c27c194f05997ed8.1920x1080.jpg?t=1529415011,https://cdn.akamai.steamstatic.com/steam/apps/856980/ss_447c267ac93135611c73b2c24cb075a2a27472d3.1920x1080.jpg?t=1529415011,https://cdn.akamai.steamstatic.com/steam/apps/856980/ss_95864db952f9ded2f5aba9e7a531401fdff5d6d1.1920x1080.jpg?t=1529415011,https://cdn.akamai.steamstatic.com/steam/apps/856980/ss_91446bdc300a844ef3f78e80845d1d0b452d3b4c.1920x1080.jpg?t=1529415011",
    "Slug": "7-in-1-brain-sharpness-bundle",
    "Meta Title": "7-in-1 Brain Sharpness Bundle: May 17, 2018, ALEKSANDER C...",
    "Meta Description": "Looking for information on 7-in-1 Brain Sharpness Bundle? Check out the release date (May 17, 2018), developer insights from ALEKSANDER CHEPAIKIN, and a...",
    "Alt Text Image": "Official header image for 7-in-1 Brain Sharpness Bundle game - Steam 856980",
    "Canonical URL": "https://gusku.site/game/7-in-1-brain-sharpness-bundle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"7-in-1 Brain Sharpness Bundle\", \"description\": \"Looking for information on 7-in-1 Brain Sharpness Bundle? Check out the release date (May 17, 2018), developer insights from ALEKSANDER CHEPAIKIN, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ALEKSANDER CHEPAIKIN\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ALEKSANDER CHEPAIKIN\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/856980/header.jpg?t=1529415011\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}