{
    "AppID": 1096960,
    "Name": "Amazing: A House In Kansas VR",
    "Release date": "Jun 21, 2019",
    "About the game": "'Amazing: A House In Kansas' VR is a VR port of Immersive-Games title 'Amazing: A House in Kansas'. Try and navigate the house whilst it's spinning around in a tornado to find the exit and get rescued. Reworked and optimized for VR, this game uses SteamVR's new input system allowing you to remap for your controls for whichever VR setup you are using. Support for RiftCats VRidge with Xbox 360 Controller coming soon! Please note that, since this is a VR game, efforts have been made to make this game as comfortable to play as possible. However, should you start feeling any symptoms of VR sickness at any time, please stop playing immediately, rest up and then return when you're feeling free of symptoms. Reviews Sandora &amp; Vlaeg (German) Wir denken, das Spiel könnte vielleicht eine art Trainingsprogramm gegen Motion Sickness sein. Es hat mir wirklich Spaß gemacht, diese Erfahrung machen zu dürfen. Für den Zuschauer mag es simple und einfach aussehen aber wenn man es einmal selbst in der Virtuellen Realität erlebt, merkt man wie schwer es eigentlich ist, sich zu orientieren. (English) We think the game might be some kind of training program against motion sickness. It was really fun for me to have this experience. For the viewer it may look simple and simple, but once you experience it in virtual reality, you realize how difficult it is to orientate yourself. Briefing We received a message that there is a tornado heading in your direction. There was not enough time for us to send in a team to extract you, or place a portal inside your home. We have been fortunate to have a high altitude Base Jumper Ship in your area, with the technology to lock on to you. However the draw back is that they cannot gain a lock on you, whilst you are inside the building. You must find a way to escape the building by whatever means open to you. There is not much time, the Base Jumper Ship cannot remain in the tornado for more than a few minutes, so you must be quick with your escape. There is another problem. When the building broke from its footings, the gas supply ruptured and should the remaining gas cloud be ignited by the small electrical power, being supplied by the generator in the basement... well I am sure you understand the consequences. There is not much time! Good luck.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1096960/header.jpg?t=1565379069",
    "Price": 3.99,
    "Developers": "Mad Man Games,Immersive-Games",
    "Publishers": "Immersive-Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1096960/ss_6863d53ad47fa945bde9c7052b05c62af9ede8f7.1920x1080.jpg?t=1565379069,https://cdn.akamai.steamstatic.com/steam/apps/1096960/ss_6b96a0687d78fc46acfaebac6eb65d9e355016f4.1920x1080.jpg?t=1565379069,https://cdn.akamai.steamstatic.com/steam/apps/1096960/ss_5df474d0cc1dcd0b303c6cce465b192866fe6717.1920x1080.jpg?t=1565379069,https://cdn.akamai.steamstatic.com/steam/apps/1096960/ss_2e0d6268a0c7e8c15ccbd91e627c5698e7cbcc02.1920x1080.jpg?t=1565379069,https://cdn.akamai.steamstatic.com/steam/apps/1096960/ss_5cd999f7fbc6a1290ad3eb19f9d8da00ae2d534e.1920x1080.jpg?t=1565379069",
    "Slug": "amazing-a-house-in-kansas-vr",
    "Meta Title": "Amazing: A House In Kansas VR: Jun 21, 2019, Mad Man Game...",
    "Meta Description": "Looking for information on Amazing: A House In Kansas VR? Check out the release date (Jun 21, 2019), developer insights from Mad Man Games,Immersive-Gam...",
    "Alt Text Image": "Official header image for Amazing: A House In Kansas VR game - Steam 1096960",
    "Canonical URL": "https://gusku.site/game/amazing-a-house-in-kansas-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Amazing: A House In Kansas VR\", \"description\": \"Looking for information on Amazing: A House In Kansas VR? Check out the release date (Jun 21, 2019), developer insights from Mad Man Games,Immersive-Gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mad Man Games,Immersive-Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Immersive-Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1096960/header.jpg?t=1565379069\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}