{
    "AppID": 1673190,
    "Name": "Bahamut2-dragon's bride",
    "Release date": "Sep 30, 2021",
    "About the game": "This game supports English language from November 4, 2021! Remind you! The English version of this game uses Google machine translation, so the quality of the translated content may not be very good. It is recommended to download the PC Demo first and then buy it after confirming that it is acceptable. Thank you! Clear's legendary adventure will begin again! 3000 years ago, due to the human great wizard Aldia sealed Bahamut in his body, after his body degenerated into a baby, he was put in the box of time sealing, waiting for the long 3000 years to pass, and then he was After the mysterious man opened the sealed box and found Bahamut’s baby in his body, for some ulterior reason, he brought it back to raise and grew up. The baby was named Clear, and his adventures after he grew up. , Which is the story of Bahamut 1. And when Clear sealed Bahamut again, and degenerated into a baby again, the second time when Clear became an adult, it was the story of Bahamut 2-The Bride of the Dragon. Game Features 1. Rich career system: A richer career system than a generation, including three stages of basic occupations, advanced occupations and compound occupations. There are a total of 27 occupations that can be transferred. Each occupation can be transferred as long as it meets the requirements. And the ability value remains unchanged after the transfer, no weapons or skills are restricted, and the transfer is completely liberalized. 2. Diversified skills: You can learn skills when you upgrade your professional level, and this game has innovated a new way of combining skills to learn new skills. As long as you use multiple skills continuously in battle, you can create them as long as they meet the combination conditions. There are more than 500 skills to learn in this game. 3. Novel combat mode: Are you tired of traditional turn-based or action-based (ATB)? This game cancels the concept of MP, and combines MP and action bars into a new SP action combat system. The characters use skills no longer consume existing MP, but instead consume SP. SP is unified at the beginning of the battle. It is 0 and will increase over time. How to use the most effective skills in the existing SP will be a major challenge for players. 4. Brand-new pet system: In the first generation, pets are purchased in pet shops, or hidden pets are obtained through special events. In addition to the initial basic pets that can be purchased in the store, this game can also use the hunter’s tame skills to catch wild animals. Certain monsters have come to be pets. There are more than 20 kinds of pets for grabbing in this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1673190/header.jpg?t=1658094730",
    "Price": 9.99,
    "Developers": "王韋",
    "Publishers": "RMAsia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_5c50633d0a2755b9a0aaeaacad68d32651213748.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_1fb813eb49dea4e92b171470c292b0a6196d8a94.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_5a4440e63a6437f0f5520807e304ae15938f34be.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_7d5d196b1d8a488af2eda12982e90bd9f3dfaa71.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_4147122ab88a5ed90855ce3885bb081d16662e50.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_e50188d119bf3ab91a15aae88996f73cf0aac913.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_d33cb16cea7c3cc7c240b58c5a5655cf690c6df2.1920x1080.jpg?t=1658094730,https://cdn.akamai.steamstatic.com/steam/apps/1673190/ss_936a1939192475ebabafe9ab219ad57c5ca8ac1a.1920x1080.jpg?t=1658094730",
    "Slug": "bahamut2-dragon-s-bride",
    "Meta Title": "Bahamut2-dragon's bride: Sep 30, 2021, 王韋 and Full Overview",
    "Meta Description": "Looking for information on Bahamut2-dragon's bride? Check out the release date (Sep 30, 2021), developer insights from 王韋, and a complete game summary.",
    "Alt Text Image": "Official header image for Bahamut2-dragon's bride game - Steam 1673190",
    "Canonical URL": "https://gusku.site/game/bahamut2-dragon-s-bride",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bahamut2-dragon's bride\", \"description\": \"Looking for information on Bahamut2-dragon's bride? Check out the release date (Sep 30, 2021), developer insights from \\u738b\\u97cb, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u738b\\u97cb\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RMAsia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1673190/header.jpg?t=1658094730\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}