{
    "AppID": 699740,
    "Name": "BANNERMEN",
    "Release date": "Feb 21, 2019",
    "About the game": "Bannermen is a real-time strategy (RTS) game, with a strong focus on individual unit control as well as map control. With the complexity of chess, you must adapt and outsmart the enemy in real time while gathering intel through scouting. Every encounter is critical. With two resources, Wood and Gold, the game takes inspiration from predecessors within the genre and has a very high skill ceiling while still being easier to get into than comparable competitive RTS games. While staying true to its roots, Bannermen takes the best elements from the genre and adds its own unique flair to it. The nature of the game is competitive. Matches generally last between 10-25 minutes, depending on playstyle. This fast format allows for intuitive learning and gets you right in the action while making it easier to learn the counter plays than in other RTS games. GAMEMODES Singleplayer Campaign; take on the role of a fallen lord on his journey back to become one of the mightiest in the realm. AI Skirmish; battle it out with an AI and fight for humanity. Ranked Matches; climb the online ladder either alone or as a duo to prove who is the best commander. Unranked Matches; try out new strategies or take it easy while still finding online matches easily. Custom Games; choose your own team composition and map with up to 8 players. STORY Having suffered a crushing defeat in the Battle of Beckron, you, Lord Berrian must now regain former bannermen that have surrendered to Lord Karthor. The days of chasing glory are over, as terror spreads and forces ever greater sacrifices to hold Lord Karthor’s men at bay. Without a home and much time to spare, you must travel the vast lands of Valtoria to obtain supplies and convert soldiers to your righteous cause. GAMEPLAY Take manual control over each unit and use its abilities wisely. To become a successful commander, you need to manage your resources well and construct new bases when the timing is right. The balance between economy and army as well as transitioning to more advanced units when it is possible is a big part of the strategic depth in Bannermen. But there are also unique mechanics, like the Temples which you can build to gain Nature Powers. These powers can have devastating effects on your enemies and varies for each map as well as their available building locations. After a Temple has been erected your enemies will be notified and a publicly visible timer begins that counts down to when it is available. In Bannermen each player can choose to recruit one out of three Heroes that can be levelled up throughout the match to become more powerful. Levels are gained by killing neutral creeps, or by defeating enemy units. CAMPAIGN Bannermen features a full-length singleplayer campaign, that lets you dive into the realm of Valtoria as its hero. Command troops, free prisoners, infiltrate strongholds, manage resources and construct buildings in order to achieve victory in the great war. Learn to fight in many vastly different environments; use sandstorms to hide your advance, set up traps against incoming attacks or why not blow up your enemies with an explosive barrel? With creativity, you must use your surroundings to gain an advantage.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/699740/header.jpg?t=1617997428",
    "Price": 29.99,
    "Developers": "Pathos Interactive",
    "Publishers": "Pathos Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_c495004a740b71e4488967ab4c6d416ef328634a.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_eace8008bc16aa5e1fe7201256142e70078131ac.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_891a8b4e7a3bb51b4294c85ff5a50c88541271c3.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_6c5a85f3df2ae80f301a46cce19ff43543cdf2fa.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_179aeee8f308bdfb56ff6f938c988cc9962cf40e.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_60ed01bb75c32ede2b3b26d716f4118d65dd8356.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_ff4ae111273ecba8db540aceb54130890a46d41f.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_63c14cf22da0970e87a5a1357355a0ca6d829e6a.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_4cbaef0b32319b5f4de98b02f4eaa20059e0f1b7.1920x1080.jpg?t=1617997428,https://cdn.akamai.steamstatic.com/steam/apps/699740/ss_6336611d5c46e7330b22628ece776aa04e447416.1920x1080.jpg?t=1617997428",
    "Slug": "bannermen",
    "Meta Title": "BANNERMEN: Feb 21, 2019, Pathos Interactive and Full Over...",
    "Meta Description": "Looking for information on BANNERMEN? Check out the release date (Feb 21, 2019), developer insights from Pathos Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for BANNERMEN game - Steam 699740",
    "Canonical URL": "https://gusku.site/game/bannermen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BANNERMEN\", \"description\": \"Looking for information on BANNERMEN? Check out the release date (Feb 21, 2019), developer insights from Pathos Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pathos Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pathos Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/699740/header.jpg?t=1617997428\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}