{
    "AppID": 799340,
    "Name": "Battle for Gaming",
    "Release date": "Jan 9, 2019",
    "About the game": "I tried to incorporate excessively used monetization models as mechanics in the game. So you use DLCs (Downloadable Content) to upgrade yourself, you have to get random improvements from Lootboxes, paid with virtual currency. As ammunition, you use your banknotes and there are a bunch of Live Services to subscribe to, in order to gain boosts (for a price of course). No worries though, there are no real microtransactions in the game. In addition to the mechanics just mentioned, I added other additional systems to make for a replayable, engaging and fun game. ​ Description In the full version, there are two different game modes available. There is a story mode, where you can make your way through a storyline. Your choices matter, as there are multiple pathways and endings. The second mode is the Custom Game mode, where you can set your prefered settings and difficulty and try to achieve better and better high scores. In this demo version, you can only play the custom game without setting your own preferences. The enemies you face are Lootboxes with different attacks at their disposal. As you shoot your way through hordes of Lootboxes you earn DCs (Different Currencies – the in-game currency), which you can use to buy random rewards through Lootboxes. Those rewards are temporary improvements for this run only. During your playthrough, you also find so-called DLC fragments. You can use those to permanently upgrade different perks at the Centre (starting point of the level). The upgrades include things like your movement speed, your fire rate, the amount of ammunition you can carry, etc. But with DLC fragments you can also unlock a new weapon and the ability to dual wield. What else Also at some point, you will unlock the possibility to build up different combo points (there are several combos available at the end, for example, killing only red Lootboxes in a row, earns you bonus DCs. Or killing only one type of Lootboxes earns you bonus DC, etc…) You finish your combos with a melee attack, where you blink to an enemy and destroy it simultaneously. The enemies are randomly created, and you can also control how many enemies you want to face at a given time. More enemies mean you the possible rewards are exponentially higher but at the same time the risk of dying increases. The level itself is theoretically infinite and procedurally generated. But you have to stay in the vicinity of the Centre, as you need to come back to it for ammunition and upgrades (a little arrow points you the way though). You are also on a clock because there is a limited time until the invincible, deadly W-box starts to chase you. Once it reaches you, this run is over. But at least you keep all permanent upgrades for the next run. Game Features: First Person Shooter with a simple but recognisable art style Story mode with different paths and endings Custom Game mode lets you hunt for ever-higher high scores Enemies are hostile Lootboxes with different attacks Upgrade yourself through permanent upgrades Kills, Combo-kills and Melee strikes earn you temporary improvements Replayable, procedurally generated level with randomized layout and enemies You control the risk to reward ration for every battle",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/799340/header.jpg?t=1590739013",
    "Price": 6.99,
    "Developers": "Free Time Dev",
    "Publishers": "Free Time Dev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/799340/ss_17bc205b4afecf62f97b59b5beb38a72eaecd216.1920x1080.jpg?t=1590739013,https://cdn.akamai.steamstatic.com/steam/apps/799340/ss_367c17add46a1e4d9105c90c3f4de49c291b8b8b.1920x1080.jpg?t=1590739013,https://cdn.akamai.steamstatic.com/steam/apps/799340/ss_f4067ad63f949b109855472a5208a38d4fdce9f8.1920x1080.jpg?t=1590739013,https://cdn.akamai.steamstatic.com/steam/apps/799340/ss_6f976a8fa2bbcc30d6d01b4690363b11a9149f92.1920x1080.jpg?t=1590739013,https://cdn.akamai.steamstatic.com/steam/apps/799340/ss_31f1496515d98862d09977b85f11bbb504ab3dd2.1920x1080.jpg?t=1590739013,https://cdn.akamai.steamstatic.com/steam/apps/799340/ss_5d8982d1315c5e98a49db93b9377d572e0073586.1920x1080.jpg?t=1590739013",
    "Slug": "battle-for-gaming",
    "Meta Title": "Battle for Gaming: Jan 9, 2019, Free Time Dev and Full Ov...",
    "Meta Description": "Looking for information on Battle for Gaming? Check out the release date (Jan 9, 2019), developer insights from Free Time Dev, and a complete game summary.",
    "Alt Text Image": "Official header image for Battle for Gaming game - Steam 799340",
    "Canonical URL": "https://gusku.site/game/battle-for-gaming",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battle for Gaming\", \"description\": \"Looking for information on Battle for Gaming? Check out the release date (Jan 9, 2019), developer insights from Free Time Dev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 9, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Free Time Dev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Free Time Dev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/799340/header.jpg?t=1590739013\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}