{
    "AppID": 426240,
    "Name": "Caretaker Sacrifice",
    "Release date": "Aug 17, 2016",
    "About the game": "Be warned before you buy this game in early access state that the VR integration is experimental and is subject to change or removal based on community feedback. The game is currently under-going a major re-design based on the community feedback given so far. You have an opportunity to shape this re-design by expressing what you like and dislike about the current form. So far the wish seems to be to make the game more open world rather than level based as it currently is but I need to hear from more of you to make sure this is the correct decision. It is the end of everything. The stars went out long ago; everyone you knew and loved is dead. Now, alone in chill of the endless void, you have one last task -- to battle through an ancient machine and decide the final fate of everything. Narrated by David Hewlett (Stargate), Caretaker Sacrifice is an epic 6DOF game set in the far future. You must delve into the twisting innards of this alien device, through peril and adventure, to puzzle out what happened to the universe. In every sense, it’s a cerebral descent. Why Early Access? As a developer sitting on their own in an office working to get a game out it can be hard to tell if what you’re doing is right or not. The only time you can be sure is when people are actually playing the game and this has been incredibly true for Caretaker Sacrifice. After about a year I finally started to show it to people and the response was good but there was massive room for improvement. I continued this new way of working and showed it to more people and something became very clear - this process was working, the game was becoming a much better game through feedback and suggestions. So, instead of going for a full day-one-finished release I talked to Valve about putting it through early access instead so that I can engage with more people and more importantly get them involved in the development of the game going forward. This isn’t a bug-hunt or a cynical attempt to generate funds by putting out an un-finished game but a genuine attempt to engage with a community and hopefully end up with a good game. Development schedule Each level takes roughly 3-4 days to create, depending on the complexity and the size of the level. So from now till all the levels are done I should be able to do at least one update a week. This is going to be affected by the feedback I get from what is already in the Steam build. How will the full version planned to differ from the Early Access version? This is very much going to depend on how much the community engages with the development process. If there’s some glaring problems then they will need to be addressed. If however everything seems to be okay then the final version will be what’s currently here in the early access version - just a lot more of it. I’m setting the early access price to be much lower than the finished game because I don’t feel comfortable charging full price for something that’s still being worked on. As levels get added the price will be going up. Controls Caretaker Sacrifice can be played with either a Joypad or mouse. Joypad controls: Left analog stick to move forwards, backwards and to strafe left or right. Right analog stick to look around. Left and right bumpers to roll. Left and right triggers to fire. 'B' to send out a radar pulse to locate portals and suppressors. ‘Y’ button to invert the look. Mouse controls: Mouse to look around. WSAD to move. Left mouse button to fire. Right mouse button and move to roll. 'Q' and 'E' to roll. 'R' and 'F' to move up and down. Space to send out a radar pulse to locate portals and suppressors. Y’ to invert the look. There is currently a bug in Unity that means if you play Caretaker Sacrifice on a PC in windowed mode the mouse will lose focus. As soon as Unity fix this bug it will be fixed in Caretaker Sacrifice also. Extra controls: Press ‘C’ on the keyboard or ‘B’ on the joypad to disable the depth of field effect if you experience some frame rate slow down or you just don’t like depth of field effects. ‘Esc’ will exit the game completely. 1 and 0 held together on the keyboard wipes the automatic save game and will immediately restart the entire experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/426240/header.jpg?t=1488111024",
    "Price": 0.0,
    "Developers": "Xiotex Studios Ltd",
    "Publishers": "Xiotex Studios Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_a058f5ddee752038aca6545a72dd31cc46313ee7.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_5a99a7a3ac44e72f3cc9611722f55e7438c7fdf0.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_be563f9e1e0d83f1a1aeb179978694d5c2af71a4.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_d554effa55fb31f85adcfdb641429c9971264e38.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_23b438b2068edff677411f6b5752f1ec5bca01c6.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_52129c8b0b6ff63123bb84f265fda86789396f66.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_51f08fa619c6b5bc6c9b10b55d8ccfd70736fe5b.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_0e2f78b07289a728fba290cff198b97fe5d9f3a6.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_ea81808874e93fb3080271786ad60c97e301703b.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_5e8490476a6517c9161cc5640890dac6d53f161a.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_cbeaaeff541168ab0ee306f4bbb61fe15deb42f9.1920x1080.jpg?t=1488111024,https://cdn.akamai.steamstatic.com/steam/apps/426240/ss_7f33cb5cb8d0f380adc08579b648af5cac3a2cde.1920x1080.jpg?t=1488111024",
    "Slug": "caretaker-sacrifice",
    "Meta Title": "Caretaker Sacrifice: Aug 17, 2016, Xiotex Studios Ltd and...",
    "Meta Description": "Looking for information on Caretaker Sacrifice? Check out the release date (Aug 17, 2016), developer insights from Xiotex Studios Ltd, and a complete ga...",
    "Alt Text Image": "Official header image for Caretaker Sacrifice game - Steam 426240",
    "Canonical URL": "https://gusku.site/game/caretaker-sacrifice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Caretaker Sacrifice\", \"description\": \"Looking for information on Caretaker Sacrifice? Check out the release date (Aug 17, 2016), developer insights from Xiotex Studios Ltd, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 17, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Xiotex Studios Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Xiotex Studios Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/426240/header.jpg?t=1488111024\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}