{
    "AppID": 1175980,
    "Name": "城市生存计划 / City Survival Project",
    "Release date": "Nov 6, 2019",
    "About the game": "Introduction: 《City’s Survival Project》is a Chinese culture related simulation game played in the first person. The player will play as a newcomer who tries to survival in the big city. Within 90 days, the player will facing continuous challenges and make strategic decisions. There are over dozens of career paths to advance and over 50 different endings. Which path suits you is for you to find out (A good challenge will help you find your most suited path). Game mode: Easy mode: Survivals 90 days, try to make money as much as possible. Normal mode: increase cycle variable. Entrepreneurship and investment will automatically choose the best field for players Work times Description: work times is also a kind of growth There is no limit to the number of work in novel writing and independent design Screenwriters and venture capitalists need to work twice. Entrepreneurs need to work 7 times. Director works 5 times. Personal investment and angel investment will wait 3 days. The insurance is updated to the purchase amount. After that, every day. The loan amount is net assets, and the real estate can be mortgaged. As game time goes on, technology advances, Technological progress will affect the amplitude, frequency and median of each industry cycle. Industry understanding will affect the impact of the cycle on players. Services and finance are affected by the number of jobs of this type. Other industries are influenced by work experience. Introduction to the game’s characteristics: Appearance: (indicates a multiple of beauty, temperament, culture, apparel) Sprit: (indicates a multiple of EQ, experience, breadth of knowledge, social experience) Intellect: (indicates a multiple of IQ, skills, depth of knowledge, cognition) Stamina: (indicates a multiple of patience, perseverance, attitude, stress management) Body: (indicates a multiple of physical strength and immunity) Early Access: This game is mostly complete, only partial functions are not done yet. This is our first time developing an independent game, so we have a limited understanding of our users and the market. We hope to find like-minded developers along the way and your suggestions and feedbacks are most welcome.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1175980/header.jpg?t=1586241455",
    "Price": 1.99,
    "Developers": "HAN GUANG",
    "Publishers": "HAN GUANG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1175980/ss_c2d975fa80747ef824f11198123b220808b1e046.1920x1080.jpg?t=1586241455,https://cdn.akamai.steamstatic.com/steam/apps/1175980/ss_a6339ce3eece7f43caa88bc480c19e070d770d5c.1920x1080.jpg?t=1586241455,https://cdn.akamai.steamstatic.com/steam/apps/1175980/ss_d9b6086af4b58c90d288a025b39486028827e362.1920x1080.jpg?t=1586241455,https://cdn.akamai.steamstatic.com/steam/apps/1175980/ss_39502b83396febb0c8a30f5b1d1d00a86762c171.1920x1080.jpg?t=1586241455,https://cdn.akamai.steamstatic.com/steam/apps/1175980/ss_2c6083f66457302684e0d27b0b5d504ce82740ef.1920x1080.jpg?t=1586241455",
    "Slug": "city-survival-project",
    "Meta Title": "城市生存计划 / City Survival Project: Nov 6, 2019, HAN GUANG an...",
    "Meta Description": "Looking for information on 城市生存计划 / City Survival Project? Check out the release date (Nov 6, 2019), developer insights from HAN GUANG, and a complete g...",
    "Alt Text Image": "Official header image for 城市生存计划 / City Survival Project game - Steam 1175980",
    "Canonical URL": "https://gusku.site/game/city-survival-project",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u57ce\\u5e02\\u751f\\u5b58\\u8ba1\\u5212 / City Survival Project\", \"description\": \"Looking for information on \\u57ce\\u5e02\\u751f\\u5b58\\u8ba1\\u5212 / City Survival Project? Check out the release date (Nov 6, 2019), developer insights from HAN GUANG, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"HAN GUANG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HAN GUANG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1175980/header.jpg?t=1586241455\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}