{
    "AppID": 1638330,
    "Name": "Darius Cozmic Collection Arcade",
    "Release date": "Nov 17, 2021",
    "About the game": "Darius is one of the pioneers of arcade side-scrolling shoot 'em up games, first released in 1986 in a custom, 3 screen cabinet featuring in-seat bass speakers to deliver the impact of the game direct to the player! The aquatically themed, giant robotic fish bosses and Zuntata-composed soundscapes captured the hearts and minds of arcade goes everywhere, and now Darius Cozmic Collection Arcade brings 4 of those titles (total 7 versions) from the Darius arcade series, each with added features, some exclusive to Steam! Features: Multi-monitor support (Steam only!) Use 2 or 3 monitors for that authentic arcade experience! Body sonic in the home (Steam only!) Replicate the arcade's seat speaker output using a sub-woofer! Quick Save &amp; Load Save at any point during the game, then come back later to practice! Display features, Options &amp; Gadgets galore Scale, smooth and add scanlines, adjust difficulty, number of lives and add information-displaying gadgets to customise your view! Training Mode Set your powerup levels and choose which zone to practice! DARIUS Darius (Arcade, old version, 1986) Announced in 1986 and released to arcades in 1987. The revolutionary 3-screen cabinet, in-seat bass speakers and iconic cast of colourful, aquatic-lifeform-themed boss characters, together with the now legendary soundtrack established its place in game fan's hearts. Other features carried over included the branching stage maps and power up system. Darius (Arcade, new version, 1987) A difficulty-balanced version of the previous release making boss battle easier the more powerups you have. Darius (Arcade, extra version, 1987) Further difficulty balances along with all new enemy placement makes for an easier game which gets much more difficult at the end. DARIUS II Darius II (Arcade, Dual Screen version, 1989) A dual screen sequel to 1987's original game, with new bosses, new weaponry, the ability to switch directions during boss battles and... TUNA SASIMI! SAGAIA SAGAIA (Arcade, ver.1, 1989) Darius II was redesigned for the international market with shorter stages and less bosses with less health, but higher overall difficulty to balance the changes out. As a result, some routes and bosses were removed completely. SAGAIA (Arcade, ver.2, 1989) Conceptually the same as version 1, but with various changes, this second version is shrouded in mystery and it's unknown whether it was ever available to play at the time. Darius Gaiden Darius Gaiden (Arcade, 1994) The first Darius game available on a single screen, this allowed it to be installed in more arcades than its predecessors. Spectacular visuals with semi-transparent effects, parallax scrolling and breath-taking boss entrance scenes, the visuals are only surpassed by the difficulty! New to the series is the ability to capture and use mid-bosses, as well as the black hole bomb!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1638330/header.jpg?t=1637161284",
    "Price": 44.99,
    "Developers": "TAITO CORP.,M2 Co.,LTD",
    "Publishers": "TAITO CORP.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1638330/ss_c7930351b099cb58e4dfab083ea38084caf057bf.1920x1080.jpg?t=1637161284,https://cdn.akamai.steamstatic.com/steam/apps/1638330/ss_6c88d8aaa46690931bc69b00e23a7f938961b62d.1920x1080.jpg?t=1637161284,https://cdn.akamai.steamstatic.com/steam/apps/1638330/ss_7a2fe30204738112418787fb002a2f07203ca7cc.1920x1080.jpg?t=1637161284,https://cdn.akamai.steamstatic.com/steam/apps/1638330/ss_48ace80b6133b0f19e46188729adc0174d48e53f.1920x1080.jpg?t=1637161284,https://cdn.akamai.steamstatic.com/steam/apps/1638330/ss_b6b1b9940a2c682f3f044c990a462d739cc1d36c.1920x1080.jpg?t=1637161284",
    "Slug": "darius-cozmic-collection-arcade",
    "Meta Title": "Darius Cozmic Collection Arcade: Nov 17, 2021, TAITO CORP...",
    "Meta Description": "Looking for information on Darius Cozmic Collection Arcade? Check out the release date (Nov 17, 2021), developer insights from TAITO CORP.,M2 Co.,LTD, a...",
    "Alt Text Image": "Official header image for Darius Cozmic Collection Arcade game - Steam 1638330",
    "Canonical URL": "https://gusku.site/game/darius-cozmic-collection-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Darius Cozmic Collection Arcade\", \"description\": \"Looking for information on Darius Cozmic Collection Arcade? Check out the release date (Nov 17, 2021), developer insights from TAITO CORP.,M2 Co.,LTD, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"TAITO CORP.,M2 Co.,LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TAITO CORP.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1638330/header.jpg?t=1637161284\", \"offers\": {\"@type\": \"Offer\", \"price\": 44.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}