{
    "AppID": 718210,
    "Name": "Depopulation",
    "Release date": "Nov 24, 2017",
    "About the game": "The world’s pollution is threatening all life on Earth. Employed by a Billionaire, and chosen for your high intelligence and psychopathic tendencies, it’s up to you to save the world by any means necessary. On surface Depopulation is a military strategy game glorifying casualties, but underneath is a deeply emotional, philosophical roller coaster, that will help you understand our unbreakable connection with the environment. It hopes to portray the terrible cost of ignoring that connection. Use invasions, hunger, disease, nukes, amplifying natural disasters and civil wars to dramatically cull the most adaptable and clever animal on the planet. Or try a peaceful but harder approach. Use clever politics, convince countries to join you, build environmental wonders, construct environmental infrastructure and reduce the birth-rate to create a sustainable future. Either way, the only thing that matters is the survival of Earth’s environment, for which even billions lives is a small price to pay. Free WebAssembly version! Play in your Browser Now! (Might need the latest Chrome or Firefox - NO microtransactions) So why make a game about Depopulation? We all care deeply about the environment and its ecosystem. I wish we took Environmental issues extremely seriously. When a person or group of people destroys part the environment, they destroy anyone or anything that could have lived there – essentially preventing 100’s of future people and animals from even existing. This is far worse than murder, war, plagues etc. It is estimated that there are over 2,000,000 deaths per year from air-pollution in China and India alone. We are polluting the Earth more and more, and as a result more and more people/animal will not only die but have no-where to live. Yet, we live in an age with unprecedented resources to be able to help the environment. We understand natural relationships and sustainability. Potentially, we can maximise biodiversity and life. We can make the world even more wondrous. All that is required is a strong desire to do so… Terrain Rendering I've worked hard to create one of the best Earth rendering systems ever put inside a computer game. I wanted the earth to look beautiful. I wanted people to see the world as I see it. I want people to have a sense of what is being destroyed. Pros Has a free lower quality Browser version - check it out and see if you like it. (Contains NO microtransactions) Instant end turns, makes the game play very fast for a turn based game Easy to play Hard to master. Will help you understand the reality you live in. Helps you understand 'the fittest survive' - strictly meaning, the ones that 'fit' into their environment survive. The strongest do not survive. The strong consume all their resources until there gone and then perish. Cons Is fairly short, but highly re-playable. Saving the world is hard, and this game reflects that. Has a free version with most of the content, so is it worth buying? Yes! Especially if you want to support the author. This version has over 15 aweswan songs (web version only has 2), much much higher resolution graphics and will have larger 'PC only' assets that are too big to put in a web version. It's seriously, only $5 US so why not? Web version has no save games. Web version is ~40 meg and paid version is ~1.7 gig.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/718210/header.jpg?t=1572508095",
    "Price": 4.99,
    "Developers": "Aweswan studios",
    "Publishers": "Aweswan studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_9ce3bf0fc8a31130072732cd0cd250a136ccf9d4.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_73ec518349e9c20382f0af553e7627d2d43758f9.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_2ef17861b4546e0b20ea7657e220e8032443c89d.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_aa857a30ddc70cd7fbe0bffbc8c96950bc6fd9aa.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_6eb6634b03e76f764d098b4b61d1bb63fe57ca94.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_e8de51a7d0f9417d0aaba5c5f136b3cebe2a757a.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_1a223bd087ae56ade124f5c91b7815a871a560f4.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_e55dac707729374acf9f047d1731597379f40776.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_4c293a6ff3cae4fe6d096ef27c2815d61b886f73.1920x1080.jpg?t=1572508095,https://cdn.akamai.steamstatic.com/steam/apps/718210/ss_aad46ffa3c29ffb30637b54eb601aa0e68c1599a.1920x1080.jpg?t=1572508095",
    "Slug": "depopulation",
    "Meta Title": "Depopulation: Nov 24, 2017, Aweswan studios and Full Over...",
    "Meta Description": "Looking for information on Depopulation? Check out the release date (Nov 24, 2017), developer insights from Aweswan studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Depopulation game - Steam 718210",
    "Canonical URL": "https://gusku.site/game/depopulation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Depopulation\", \"description\": \"Looking for information on Depopulation? Check out the release date (Nov 24, 2017), developer insights from Aweswan studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aweswan studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aweswan studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/718210/header.jpg?t=1572508095\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}