{
    "AppID": 1689570,
    "Name": "Draw Music",
    "Release date": "Aug 20, 2021",
    "About the game": "Dot rhythm game! 'draw music' is a rhythm game made up of Dots 800(px) x 480(px). You can experience characters, musical instruments, and classical music of each Dot through game play. In the game? In this game, not only rhythm games, but also fights between villains and mini-games. It's included, so just because you know music well doesn't mean you can play games well! In the game, three large musical instruments were the main focus and several musical instruments were added. All musical instruments are acquired for 'Mi U' through certain conditions. If you get it, it's up to you to use it for 'draw' or 'music' . In gameplay, the more musical instruments you know, the less difficult the game is. If you don't, you'll have to rely on what's visible, so it's very difficult. There are two levels of difficulty in the game: 'Normal Mode' and 'Hard Mode'. I would like to tell you that we don't recommend 'hard mode' in the game. Story Main character 'Mi U' The main character, 'Mi U', had musical genius and was no less talented in painting. When 'Mi U' played music, colorful paintings popped up and danced as if they were notes. Everyone, adults and children alike, danced or shed tears in their emotions. The two grandfathers, who thought that 'Mi U' had tremendous power in the music that made everyone happy, thought. The grandfather of the musician 'White' is the genius of 'Mi U' and the great power of music. He said we should let everyone know. He said we should give her a 'Baton'. The grandfather of the artist 'Black' said that the images of music that 'Mi U' expresses It is said that you should give a 'brush' as a gift in admiration of what 'Mi U' thinks it is shaped. 'White' opinion of wanting 'Mi U' to be an idol to everyone around the world with music world. The opinions of 'The Darkness,' which is curious about the future of the various paintings that 'Mi U' represents, rather than music, collide. 'Mi U' will receive gifts from two grandfathers on Christmas Day, December 25th birthday. In the process, 'Mi U' makes a choice, and the grandfather who is not chosen is hurt and plays tricks on 'Mi U'. 'Mi U' hears that precious instruments have disappeared, so he goes looking for them! Imitation While producing the game, I thought a lot about what to put in this game. It's cute and lovely to see 'Mi U' play a lot of instruments in the name of rhythm games. 'Mi U' fused with a character to make each 'expression' created by 'Dot' feel even more cute and lovely. How on earth can any 'character' and 'Mi U' blend together to make the character feel better? At the same time, can you feel the cuteness of the main character, 'Mi U'? I lost track of time because I was worried about it a lot. There are many ideas to show another cute side of Mi-woo even after making the game. Please look forward to it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1689570/header.jpg?t=1644554526",
    "Price": 4.99,
    "Developers": "SMG",
    "Publishers": "SMG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_5e081d3f5192ea81ab771874f3643e97cbd07d16.1920x1080.jpg?t=1644554526,https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_1a4258d4998ce5abf5e637219f38882d3c9de0a8.1920x1080.jpg?t=1644554526,https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_c05f391942142ae6cd0450a3a3dec78b56da253f.1920x1080.jpg?t=1644554526,https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_9f5852aeb162a25ab06242b86839645388b42ca0.1920x1080.jpg?t=1644554526,https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_05697655767f9cebd77b2207c889617b5612eaf5.1920x1080.jpg?t=1644554526,https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_c6d7c1bb7f3e932ee5d111dce525b56329492f58.1920x1080.jpg?t=1644554526,https://cdn.akamai.steamstatic.com/steam/apps/1689570/ss_0e0fe846da8f1d626c36eff5cf69490d1e8b2cc0.1920x1080.jpg?t=1644554526",
    "Slug": "draw-music",
    "Meta Title": "Draw Music: Aug 20, 2021, SMG and Full Overview",
    "Meta Description": "Looking for information on Draw Music? Check out the release date (Aug 20, 2021), developer insights from SMG, and a complete game summary.",
    "Alt Text Image": "Official header image for Draw Music game - Steam 1689570",
    "Canonical URL": "https://gusku.site/game/draw-music",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Draw Music\", \"description\": \"Looking for information on Draw Music? Check out the release date (Aug 20, 2021), developer insights from SMG, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"SMG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SMG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1689570/header.jpg?t=1644554526\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}