{
    "AppID": 701990,
    "Name": "Edmonton Trolley Car",
    "Release date": "Sep 12, 2017",
    "About the game": "Experience 1915 history in Virtual Reality. Talk to authentic era characters on a busy street corner and then on a trolley car as it crosses the river and heads downtown, earning points by talking to people and observing landmarks. You feel immersed in 1915 as characters tell you aspects of the daily life, and as Model T's drive by amidst accurately portrayed historical buildings that still stand today. Your goal is to earn 100% of the possible 'conversation' and 'look-at' points by talking to the locals and seeing the historically important sights. You start on a bustling street corner where you get aquainted with the game's characters and gameplay, then board the trolley car and ride what was North America's northernmost trolley car system, down the famous Whyte Avenue. Experience the hair raising commute of a 1915 passenger as your trolley rumbles across the iconic 137 feet (46M) high, 'High Level Bridge'. Hang on to something as you share the bridge with a locomotive that rumbles past your trolley whose tracks are on the edge of the bridge. Look out your window down over the edge if you dare! Earn points by talking to various historically themed characters that you are sharing a ride with. People such as the stalwart conductor, gruff coal miner, aloof rich woman, optimistic upper class gentleman, and more. Get those characters to direct you to look at landmarks to learn about the events of the day in 1915 Edmonton. Earn points when you look in the direction of the arrow that appears, pointing you towards the historical landmark. This historically accurate first person POV game is fun for people in Edmonton who will recognize many of the buildings still here a century later, as well as entertaining for anyone interested to learn about this bustling and progressive frontier city. To earn 100% (26 conversation points and 6 landmark viewing points) one cannot help but learn a bit of city and era history. Can you get a perfect score? Play it again, until you do. Included in this purchase is a game with high replay value, that is divided up into 3 main levels of increasing difficulty. In the first level you are on the street where you have no time limit to learn how to operate the game before boarding the trolley, then in the second two levels as you ride the trolley you only have the length of the ride to talk to everyone and see everything before you arrive at the legislature building in downtown Edmonton. This VR game is intended to be played on your HTC Vive. Talk to the characters by getting close enough to them and then pressing the talk button on the hand held controller(s) if they have a voice cloud above their heads, and follow their instructions to look along at sites directed by the flashing arrow icons that appear.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/701990/header.jpg?t=1505220559",
    "Price": 5.99,
    "Developers": "Gametrip",
    "Publishers": "Gametrip",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/701990/ss_f66564734c98af8bce6c7f107f9d686acbff6825.1920x1080.jpg?t=1505220559,https://cdn.akamai.steamstatic.com/steam/apps/701990/ss_af44594b67cd6dc33e0e83379d83eae7e1aee826.1920x1080.jpg?t=1505220559,https://cdn.akamai.steamstatic.com/steam/apps/701990/ss_a8cc2c8612e7ff1b7b25c1fc497c416f0be3cc97.1920x1080.jpg?t=1505220559,https://cdn.akamai.steamstatic.com/steam/apps/701990/ss_1452f8691cb858474b8ffbba2a406a497c29e621.1920x1080.jpg?t=1505220559,https://cdn.akamai.steamstatic.com/steam/apps/701990/ss_bcb7e19bd746e1e3ae1e6b3a7d6e2f5e45c41ef8.1920x1080.jpg?t=1505220559",
    "Slug": "edmonton-trolley-car",
    "Meta Title": "Edmonton Trolley Car: Sep 12, 2017, Gametrip and Full Ove...",
    "Meta Description": "Looking for information on Edmonton Trolley Car? Check out the release date (Sep 12, 2017), developer insights from Gametrip, and a complete game summary.",
    "Alt Text Image": "Official header image for Edmonton Trolley Car game - Steam 701990",
    "Canonical URL": "https://gusku.site/game/edmonton-trolley-car",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Edmonton Trolley Car\", \"description\": \"Looking for information on Edmonton Trolley Car? Check out the release date (Sep 12, 2017), developer insights from Gametrip, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gametrip\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gametrip\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/701990/header.jpg?t=1505220559\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}