{
    "AppID": 1160420,
    "Name": "EducationXR",
    "Release date": "Sep 8, 2020",
    "About the game": "EducationXR is an advanced 3D training and education platform. Making education visual and engaging, it enables educators to create, deploy and distribute their immersive creations to VR, mobile, desktop and tablets. A growing library of both free and secure private content is available for anyone to explore. If you are an educator, teacher, trainer or creator, custom content development and additional features are available with a premium license. Contact us at info@heizenrader.com to learn more! Cross Platform A core design principle behind EducationXR is its multi-platform support, enabling learners to experience any of the courses from the device of their choice, with all interactions and content automatically adapted to the control scheme of the platform being used, whether it is touch controls, mouse or tracked controllers in VR. While similar solutions may restrict you to a single platform, EducationXR gives you unrestricted freedom on any device. We believe that the best medium for learning is the one that you have with you at the time when you are ready to learn. This means that you can take all of the content available on EducationXR with you anywhere, and explore it at your own pace. EducationXR runs on VR, on Windows and Mac computers, and on iOS or Android mobile phones and tablets. The apps are simple to install and keep up to date from the marketplaces that you are already familiar with. Immersive and Interactive Content Activities and objectives for tracking and assessing user understanding. Click, rotate and re-size 3D objects of your choice. Label 3D Objects for easy highlighting even across multi-user sessions. Media attachments for supplemental information support audio, video, text, images or 3D animations. Simulate real world interactions with 3D objects for enhanced learning. Users can click, grab, drag, push and more. There are several ways for users to navigate experiences. Creators can choose from a guided linear step based structure or a non-linear “choose your own adventure” structure. Collaboration It has never been easier to collaborate with others. We've eliminated the barriers that exist when trying to connect with others using online software. Now you can connect with users from anywhere, at any time thanks to our cross platform multiplayer engine. This means that you can host a group session or join someone else's from any device, with voice controls for all attendees. Mix VR, mobile or desktop users in a unique session. Analytics &amp; Heatmaps Full analytics in the admin web panel, with metrics to assess user's performance. 3D Heatmaps for VR users, analyze user's gaze directly from the admin panel and understand their behavior. Assessments EducationXR's assessment engine allows for you to easily measure and score what users have learned from your content. Authors can easily build assessments directly in the browser and deploy them to all platforms with the click of a button. Users can conveniently take assessments from any device, with the same functionality and ease of use. Partners &amp; Clients The EducationXR training platform is trusted by some of the most renowned companies and institutions, including Mayo Clinic, Medtronic or Merck. XR/AR Modes XR/AR provides a window into VR worlds from your mobile device of choice. Use your phone as a window into immersive worlds with complete spatial tracking.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1160420/header.jpg?t=1600195259",
    "Price": 0.0,
    "Developers": "Heizenrader LLC",
    "Publishers": "Heizenrader LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_ed792c0a4614d9eae6d5990ab4cd64c36b9a7ed6.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_47a104f91e33ee76582a6f682e10a7f7f355f340.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_68a3efb1512d8d0be90ee7ca6df2060dfe9e196b.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_abef3f96539da21c1f8bd0a02ee8868a29f8ae85.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_ddb8754ffae94a867f4781a12c894bae50f275e0.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_3df61a44a60d0173f89e737989114577df8ac7c9.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_f66ff2309b6bcaf5fee23235bc47337b2b5172cd.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_1c7815b28d92fdf133b0d7de4034b7f2c05905f3.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_f2f7d26c13233a994204fa7c402d7fcaa35c7354.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_b661eb720f6a2afaad8ddeb3941396d31acd7155.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_76785b311e7304909a3768c09ff92b912a9ed91f.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_cf96a810afe547c290a161903c9172a049c134c8.1920x1080.jpg?t=1600195259,https://cdn.akamai.steamstatic.com/steam/apps/1160420/ss_3b4a0de6a1bd93138a6eccae27b7392f5cb10eca.1920x1080.jpg?t=1600195259",
    "Slug": "educationxr",
    "Meta Title": "EducationXR: Sep 8, 2020, Heizenrader LLC and Full Overview",
    "Meta Description": "Looking for information on EducationXR? Check out the release date (Sep 8, 2020), developer insights from Heizenrader LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for EducationXR game - Steam 1160420",
    "Canonical URL": "https://gusku.site/game/educationxr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EducationXR\", \"description\": \"Looking for information on EducationXR? Check out the release date (Sep 8, 2020), developer insights from Heizenrader LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heizenrader LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heizenrader LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1160420/header.jpg?t=1600195259\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}