{
    "AppID": 712260,
    "Name": "Feast Your Eyes",
    "Release date": "Aug 11, 2020",
    "About the game": "After managing to escape death row, a poor unfortunate little marshmallow with blood on their hands cannot shake a past that shackles them. They're sinking into an abyss of surreal horror, isolated but not alone. Join this terrible yet heartbreaking little marshmallow, a mysterious and intrusive romantic named Simon, a gang of friends who may not even be real, and other strange characters as they struggle in a hell of doubt... What's even the point? Is there any future our tortured little marshmallow can look forward to? Creepy mementos of love... A plague that makes people stare at dirt... A familiar yet grown up face of someone who should be dead... What do all of these things have in common? When the fangs behind our facade sink deep into the mind and reflect our darkest thoughts, it becomes a struggle to not let our shadow take over. A semi-sequel/spin-off to Close Your Eyes , though made so it can be played stand-alone. A 3D surreal horror game that combines fixed camera angles with 2.5D elements. The game is mostly focused on its dark world that is occasionally littered with a strange threat or puzzle. Things start off a bit slow but gradually escalate, all while being mindful to pace itself and balance a level of intrigue, involvement and introspection. Travel between several strange locations, varying from a decrepit theater to a small forest village with no people in it, partake in strange events and overcome any challenges that may come your way. But be wary, things are often not what they seem. An intense yet odd atmosphere backed by an original soundtrack. A strange and cryptic narrative about loss, meaning, connection, and suffering. Quiet horror that settles into a mood rather than rely on jumpscares, paced to keep things interesting. Blending together scenes utilizing fixed camera angles as well as 2.5D gameplay with the depth of 3D. Scratch deep beneath the skin to reveal new flesh; the game is an entry into the ever expanding 'Yai Gameworks' universe. No one has full control over themselves, no matter how much some of us wish we did.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/712260/header.jpg?t=1598128680",
    "Price": 2.99,
    "Developers": "Yai Gameworks",
    "Publishers": "Yai Gameworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/712260/ss_065fd865f9d2b579c6db97152d1fee68cab04c6a.1920x1080.jpg?t=1598128680,https://cdn.akamai.steamstatic.com/steam/apps/712260/ss_dc48d1909a9291b855a9bbf5647348b60e508f04.1920x1080.jpg?t=1598128680,https://cdn.akamai.steamstatic.com/steam/apps/712260/ss_c5150949766a81bf60af383fbadc764cc278cf84.1920x1080.jpg?t=1598128680,https://cdn.akamai.steamstatic.com/steam/apps/712260/ss_6d9acbf3d2114d1be30e2f9955d0673ef05b03f1.1920x1080.jpg?t=1598128680,https://cdn.akamai.steamstatic.com/steam/apps/712260/ss_ba14127e1f23e957d01ad95efad944daedefbd71.1920x1080.jpg?t=1598128680",
    "Slug": "feast-your-eyes",
    "Meta Title": "Feast Your Eyes: Aug 11, 2020, Yai Gameworks and Full Ove...",
    "Meta Description": "Looking for information on Feast Your Eyes? Check out the release date (Aug 11, 2020), developer insights from Yai Gameworks, and a complete game summary.",
    "Alt Text Image": "Official header image for Feast Your Eyes game - Steam 712260",
    "Canonical URL": "https://gusku.site/game/feast-your-eyes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Feast Your Eyes\", \"description\": \"Looking for information on Feast Your Eyes? Check out the release date (Aug 11, 2020), developer insights from Yai Gameworks, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yai Gameworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yai Gameworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/712260/header.jpg?t=1598128680\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}