{
    "AppID": 1224600,
    "Name": "G String",
    "Release date": "Oct 16, 2020",
    "About the game": "ABOUT THIS GAME Slip into the Standard Issue Biosuit as Myo Hyori, a gifted Korean teenage girl who must face the perils of the future. Survive many hazards, explore a seemingly endless metropolis and beyond as the world around you implodes and history marches towards its inevitable conclusion. This is a cyberpunk inspired first person shooter with light environmental puzzles and a long, detailed singleplayer campaign focused on story and world building. G-String aims for an old school approach where there is minimal hand holding and your biosuit automatically keeps track of your health stats, ammunition count and armor condition. You need supplies to heal yourself, replenish your ammo/armor but your suit automatically takes care of your lights, sprinting and breathing (open air and underwater). Your on-board neuro-enhancers, air filters and light sources automatically recharge using movement and/or sunlight. Courtesy of Bortz Bioengineering your biosuit is very resilient but you do have to be careful: prolonged exposure to toxins will lead to fatal failure! You need to watch out for all sorts of environmental hazards, especially later on when the pace picks up considerably. Your telekinetic/pyrokinetic abilities will be available from the start and throughout most of the game, they should be enough to make progress until there are more means of input available. Worthy to note that initially your night-vision will be disabled as your biosuit was damaged presumably in earlier lab experiments. FEATURES LEARN about the troubled future of a space faring, shattered mankind. ESCAPE the ruthless, uncompromising powers governing Earth. SURVIVE acid rain, storms, a crumbling infrastructure and the omnipresent smog. EXPLORE many highly detailed maps with multiple routes and hidden secrets. PICK your fights; the more violent you are the more enemies you'll encounter. SOLVE environmental puzzles of varying complexity. REACH for the stars and beyond in your quest for answers. ADDITIONAL NOTES As long time fans know G-String took well over a decade to complete because it was a solo project for the most part; all assets and the lore had to be developed from scratch. My sincere hope is that this does not impact the game's quality, scope and scale negatively. From the slums of Greater Chinatown to Low Orbit Earth and Beyond your adventure will take you through several distinct locations. No important story elements were cut and the game was not divided into episodes- yet another reason why development took long. The finished product is not perfect nor will it ever be perfect however it has reached a stage when it's hopefully good enough for release considering the time and resources available to me at the moment. The goal with the initial release is just to put out a game that can be played form start to finish with no issues. There are no achievements and translations available yet. Those will probably be included in later updates if there is interest in the title. Of course if I had missed anything and there are any urgent problems they will be fixed in an early update as quickly as possible. The game's retro glitch art infused aesthetic draws heavily upon science fiction films released between the late 70s and early to mid 90s. Exceptions to this rule might include 1969's Space Odyssey or The Matrix. The world's design is very low key and as realistic as possible, everything was put together with feasibility and mass production in mind. The HUD and hints are also kept to a minimum. When work started on this project I was going through difficult times and G-String reflected this by touching on some troubling issues. Over the years even elements of horror and surrealism have found their way into the mix. Everything changes though and this work should not be viewed as mouth piece for anyone's views or beliefs. Everyone is encouraged to make up their own minds about the concepts they are presented with. The game is 10 to 15 hours long, combat is spaced out and can be harsh. Sometimes fights with humans can be avoided and multiple paths are available. There are a few cut-scenes in G-String but they are brief and depict things that would otherwise be impossible to show from the player's point of view. The different post-processing FX settings such as 'Film Noir', '70mm' or 'Sin City' can give the game a radically different feel so try to experiment to see what fits your gameplay style the most. POSSIBLE SPOILERS if you choose to view the 'quick reference'. PDF posted there Beauty Secrets will be updated after release as the game and lore are still getting small additions. Also HUGE thanks to everyone at VALVe / Steam and LunchHouse Software for their help! Without them it would have been impossible to go through the last stages of development! Thank you very much!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1224600/header.jpg?t=1633031794",
    "Price": 17.99,
    "Developers": "Eyaura",
    "Publishers": "LunchHouse Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_b4b6d4943c3c1747d1c8bfdfd7a4cebed438ee62.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_11f5c5f3d5f1bd4cf0dec157f62876d1a1d93f2a.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_0fcb1d01ec032a13d8af6eccf5738f69b1dde304.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_f0fd0ea276a20801a9f6c5babbf5c0c326c12346.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_a17ffb3ac514e99067d5ee59b3e55ae900a298c7.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_d8052c7238b48d599db0a9455168d9b027842ead.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_27522d6db72364b7c7383d41152f826b0eb5c342.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_d1afe27813ebe67c123763ef72eca87c2afb6802.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_3d474cee0eb4c29a583a6070b7e394e30f8ee631.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_a3c11edfc272da3db3ca318f26e17e8b73cf414c.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_d5cb3c4e8326e032ba8baeae71bdd36ea17c300c.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_8457dd2fc29787b4f3dc06528ef981f8eef98c01.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_c26162691876c8735c225e607c696033b63d1708.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_b909098d25d2dd088acd865af58b927e2afed3b4.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_f36204c20687f50f146ca81f658f2dd5b49c8329.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_279af868f13488e5c72a59c47b2307ada5bf425b.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_98de99248c6c37ccc4bc518516cf801862e44a00.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_0c34181d1e80f46477c4805d8187335956d9c672.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_2fac22b293448686d9159dbfbe34b2bcc6d43c12.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_d24da456aed28a14fc7ac550fe6c5a7c008468d2.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_128683ad293db02b88d06331a4a1bed32c10190d.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_42d7e9189629022053bb7dec37cf04e81a83b100.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_5d8ef1521215032fb69833765b6958af9d52d0fb.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_bc7c506c0a5b530b19b99bf77debb4715b77b767.1920x1080.jpg?t=1633031794,https://cdn.akamai.steamstatic.com/steam/apps/1224600/ss_2d1db403993d4ce109e42b4c334ed3721425c225.1920x1080.jpg?t=1633031794",
    "Slug": "g-string",
    "Meta Title": "G String: Oct 16, 2020, Eyaura and Full Overview",
    "Meta Description": "Looking for information on G String? Check out the release date (Oct 16, 2020), developer insights from Eyaura, and a complete game summary.",
    "Alt Text Image": "Official header image for G String game - Steam 1224600",
    "Canonical URL": "https://gusku.site/game/g-string",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"G String\", \"description\": \"Looking for information on G String? Check out the release date (Oct 16, 2020), developer insights from Eyaura, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eyaura\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LunchHouse Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1224600/header.jpg?t=1633031794\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}