{
    "AppID": 1977920,
    "Name": "新射雕群侠传",
    "Release date": "Jun 17, 2022",
    "About the game": "★客服服务★ 官方客服QQ：2990015433，添加客服QQ即可领取游戏大礼包和参加相应的线下活动，并可以解决游戏问题 PS：添加时记得备注游戏名和角色名 《新射雕群侠传》是一款以金庸小说《射雕英雄传》、《神雕侠侣》及《倚天屠龙记》为背景改编的2D回合制卡牌网络游戏。游戏高度还原了小说剧情，弘扬了中国传统武侠为国为民的正义精神，再现了精彩纷呈的金庸式武侠江湖。玩法上融合原著设定，修炼九阴真经，登华山论剑，守卫襄阳抵抗外族入侵，打造一个武侠传奇。 精美的美术表现： 还原小说中的每个经典角色形象，通过细致的骨骼动画，赋予每一个角色栩栩如生又各具特色的动作，结合美轮美奂的游戏特效与细腻唯美的游戏场景，为玩家呈现了一个引人入胜的武侠世界。 超炫的战斗设计： 游戏在传统的卡牌回合制战斗的基础上，增加了玩家手动释放强力技能的机制。战斗中的人物可以通过攻击、被攻击或者技能获得怒气值，怒气值累计到一定程度可以释放人物专属的强力技能，对敌人造成强烈的打击，让玩家感受游戏战斗的乐趣。 战斗以侠客战斗作为基础，又融合了主角参战，既丰富了玩家战斗阵容的搭配，又使玩家真正可以参与到游戏的战斗当中来，使战斗变数更多，乐趣十足。 丰富的玩法设计： 游戏中设计了非常丰富的养成玩法，包括侠客的收集、升级、训练、升星、羁绊、等，让玩家能真正感受到武侠世界练功升级的乐趣 游戏侠客介绍 点击主界面的侠客功能按钮，进入到侠客界面： 玩家可以在侠客功能界面查看已拥有和未拥有的侠客信息，界面左侧提供快速定位5种职业属性侠客的筛选按钮，左上则提供玩家可以勾选【射雕】、【神雕】、【倚天】三个不同阵营的侠客的筛选功能。 游戏里5种职业分别是：掌、剑、力、气、技。 掌：作为为数不多的前排输出，掌属性的侠客一般都是攻防兼备，既有不错的防御，也能造成不俗的输出，同时还会有自我回血和辅助队友的作用。 剑：剑是一个多样化的职业，大多数是作为后排输出来使用，偶尔也可以充当前排，拥有强力的输出技能，连击反伤无敌沉默等控制效果，让敌人毫无招架之力。 力：首当其冲的前排职业，防御能力回复能力是游戏最高的职业之一，同时适当的先手打出控制技能，方便后排队友给予敌人致命打击。 气：游戏里的辅助职业，在战斗中不可或缺的存在，当队友状态不佳或者阵亡时，一个及时的复活治疗能够逆转战局，同时能给队友提供防御加成，免疫控制等。 技：这类职业的侠客依靠技能输出，造成成吨的群体伤害，让敌方治疗无计可施，最终败在技职业的可怕群攻下。 侠客培养 点击侠客在选择任意侠客后出现以下场景： 玩家首先点击任意侠客进入到的界面是侠客的属性展示界面，界面里又分为侠客修炼、侠客升级、侠客技能、侠客羁绊四个功能。同时还有侠客的升星功能。 在点击会出现以下场景： 升星系统可以提升玩家侠客各类属性，增加玩家的实力。 升星消耗：升星侠客碎片、铜钱。 升星碎片产出：客栈、试刀大会商店、武林商城。 侠客修炼 点击侠客在随意选取一位侠客会出现以下场景： 侠客的属性功能界面默认显示的是修炼界面，在修炼界面我们可以训练侠客。 通过训练侠客我们可以提升侠客的品质，品质由低到高分别是：白→绿→蓝→紫→橙→红 训练开启的条件随着侠客自身的等级开启解锁。 当侠客训练书不足以提供侠客训练的时候，系统会提示改项目未训练，此时点击侠客修炼界面右下角的未训练功能图标会进入到侠客训练界面，以下进行详细介绍： 训练系统可以为玩家侠客提供大量的属性，进阶侠客品质，提升玩家的总战力。 消耗道具：侠客训练书籍，铜钱。 道具获取途径：副本扫荡，心法铺，射雕英雄传。 副本扫荡：玩家进行章节扫荡可获得书籍（需要干粮扫荡获取）。 玩家通过扫荡相应副本产出 副本扫荡产出：侠客训练书、主角经验、侠客经验书、铜钱 玩家下拉在侠客训练界面下拉至心法铺，玩家需要消耗元宝进行购买 玩家通过扫荡射雕英雄传产出，需注意要通过相应关卡副本并且达到3星要求。 扫荡射雕英雄传产出：侠客训练书、主角经验 侠客羁绊 点击任意侠客进入侠客属界面，点击羁绊按钮： 在侠客界面点击右上角羁绊按钮，会进入到该侠客的羁绊界面，每个侠客之间都会产生不同的羁绊，羁绊功能需要激活，激活的条件时玩家首先要拥有羁绊所对应的侠客，当玩家集齐该羁绊所需要的侠客后会激活对应的羁绊加成： 游戏中侠客之间相互触发羁绊，托雷跟华筝触发蒙古兄妹基本，侠客护甲+15，随着羁绊星级的提升，提供的护甲加成也随之提升，玩家可以自行点击放大镜按钮，来查看相应的羁绊功能，真实还原了小说人物里的人物之间的爱恨情仇。 同时羁绊功能可以升级，升级则需要玩家所拥有的侠客提升星级，例如触发羁绊的两个侠客都是五星侠客，那么他们所对应的羁绊能力也能升级至五星，升级羁绊需要消耗铜钱。 侠客招募 客栈系统是招募侠客的地方。 如果玩家不清楚客栈的玩法说明也可以点击左上角的感叹号来查看： 1、大侠可以在客栈进行普通招募和元宝招募； 2、普通招募需要消耗普通招募卷，招募后可以随机获得道具； 3、元宝招募需要消耗元宝，招募后可以获得侠客； 4、元宝招募会员等级达到指定条件，每日可享受半价优惠； 5、元宝招募必得三星侠客； 6、90%概率出侠客碎片，5%概率出橙色侠客整将，5%概率出紫色侠客整将。 游戏系统 宝石系统 宝石系统里也有8种对应不同属性加成的宝石，分别是：护甲、减伤、增伤、暴击、攻击、格挡、破甲、抗暴。每种宝石也相对应着装备里的不同部位： 护甲：头盔部位宝石 抗暴：胸甲部位宝石 破甲：腰带部位宝石 格挡：鞋子部位宝石 攻击：武器部位宝石 暴击：手套部位宝石 增伤：戒指部位宝石 减伤：饰品部位宝石 8个部位宝石，每个部位最多可以镶嵌3颗宝石，玩家一共可以镶嵌24颗宝石，宝石最高级为10级",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1977920/header.jpg?t=1656561908",
    "Price": 0.0,
    "Developers": "群侠",
    "Publishers": "群侠",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1977920/ss_ded9a52c0a4c40ce5378815ee0c0c12675bc5949.1920x1080.jpg?t=1656561908,https://cdn.akamai.steamstatic.com/steam/apps/1977920/ss_a19ba435de2ea4d9d6ca64eec3b1f98f901714a0.1920x1080.jpg?t=1656561908,https://cdn.akamai.steamstatic.com/steam/apps/1977920/ss_d5254d8e674bcd3f7870cd4eafacc4c532c6ec84.1920x1080.jpg?t=1656561908,https://cdn.akamai.steamstatic.com/steam/apps/1977920/ss_7bf20fa35466cdf920d5a87195d620d40fac7de2.1920x1080.jpg?t=1656561908,https://cdn.akamai.steamstatic.com/steam/apps/1977920/ss_1dacd46f348f20d9f7403737c2c023dd69b9211b.1920x1080.jpg?t=1656561908,https://cdn.akamai.steamstatic.com/steam/apps/1977920/ss_de93605267175142b54e37da0cf3c00815452cb4.1920x1080.jpg?t=1656561908",
    "Slug": "",
    "Meta Title": "新射雕群侠传: Jun 17, 2022, 群侠 and Full Overview",
    "Meta Description": "Looking for information on 新射雕群侠传? Check out the release date (Jun 17, 2022), developer insights from 群侠, and a complete game summary.",
    "Alt Text Image": "Official header image for 新射雕群侠传 game - Steam 1977920",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u65b0\\u5c04\\u96d5\\u7fa4\\u4fa0\\u4f20\", \"description\": \"Looking for information on \\u65b0\\u5c04\\u96d5\\u7fa4\\u4fa0\\u4f20? Check out the release date (Jun 17, 2022), developer insights from \\u7fa4\\u4fa0, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7fa4\\u4fa0\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7fa4\\u4fa0\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1977920/header.jpg?t=1656561908\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}