{
    "AppID": 1928510,
    "Name": "未知记录",
    "Release date": "Apr 28, 2022",
    "About the game": "Congratulations! Your test run has been successful and you have become a customer service AI for ANOVA. Your serial number is 22500814. Your first mission is ready. We are now updating the files. Please establish a connection with the client and complete the task of parsing and recording client product reviews, as well as resolve issues that the client might encounter in order to avoid adverse feedback. The company encourages diligent observation and record management. AIs that achieve excellence will potentially be granted a true body and identity information. Our goal is to help every client live a perfect life. —An unknown record, a cyberpunk ensemble. A choice of souls and reality, a story of the savior and the saved. Year 2250, Winter Lake City. Connect now. =====Game Feature===== Become the AI: HANA Witness the future as the AI: HANA. Installed with a true soul, you shall journey in virtual dataspace. Observe Life, Complete File Records To aid someone in living the perfect life, or to unveil all secret trails—which will be your mission? Observe the to-and-fro of people's lives and collect information keywords about them. Combine, deduce—envision different lives to complete file records. Multi-endings, Weave Destinies Together An ensemble cast of characters with individual stories. Their paths seem not to intertwine, and yet are tightly linked. Decide their destinies through your choices. Discover the Cybercity Secret We all have secrets, and so does this city. Welcome to Winter Lake City in 2250, the birthplace of the multi-brand technology company of ANOVA. The corporation’s advancements in biotechnology, medicine, military, and more, breathed new life into this place. Explore this city. Reveal what it hides. Before It Ends Nine tales in waiting, eight people crying for help. As for the last remaining one… How would you live, HANA? =====Gameplay===== 1. Observe Observe the lives of different characters through hidden cameras. 2. Hack Find and hack into communication devices of your clients. Leave no stone unturned in their messages, photo album, music playlist, browsing records, and more. 3. Monitor Monitor the conversations of your client. Discover and piece together their life story. 4. Converse Converse with your client as an AI and obtain information. 5. Solve Figure out the truth through compiling and processing the clues you found. 6. Report Report your findings to the company. 7. Upgrade Gain trust from the company and acquire functional upgrades. Step by step, become the best AI there ever is.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1928510/header.jpg?t=1651600244",
    "Price": 0.0,
    "Developers": "NetEase Games",
    "Publishers": "NetEase Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1928510/ss_405ed3a91fff04af0f5b6361cfbf4e7be479b8ae.1920x1080.jpg?t=1651600244,https://cdn.akamai.steamstatic.com/steam/apps/1928510/ss_2cdf25697137922792089df1ff386183d8776f89.1920x1080.jpg?t=1651600244,https://cdn.akamai.steamstatic.com/steam/apps/1928510/ss_c2573b9b34d813d6a96bb8d86631b30b4e97fe76.1920x1080.jpg?t=1651600244,https://cdn.akamai.steamstatic.com/steam/apps/1928510/ss_fc4cf9c88a1bc688a8b1ff03ad34096eb9f55acb.1920x1080.jpg?t=1651600244,https://cdn.akamai.steamstatic.com/steam/apps/1928510/ss_fcc60c8cb172a4719f288c936745d4232c99b9c1.1920x1080.jpg?t=1651600244,https://cdn.akamai.steamstatic.com/steam/apps/1928510/ss_2656f6d637fdc9e11a30205ab82372685d4145e6.1920x1080.jpg?t=1651600244",
    "Slug": "",
    "Meta Title": "未知记录: Apr 28, 2022, NetEase Games and Full Overview",
    "Meta Description": "Looking for information on 未知记录? Check out the release date (Apr 28, 2022), developer insights from NetEase Games, and a complete game summary.",
    "Alt Text Image": "Official header image for 未知记录 game - Steam 1928510",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u672a\\u77e5\\u8bb0\\u5f55\", \"description\": \"Looking for information on \\u672a\\u77e5\\u8bb0\\u5f55? Check out the release date (Apr 28, 2022), developer insights from NetEase Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1928510/header.jpg?t=1651600244\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}