{
    "AppID": 1021890,
    "Name": "Hero Swing VR",
    "Release date": "Nov 12, 2020",
    "About the game": "Hero Swing VR is an adrenaline filled VR experience where players swing through the air in a skyscraper filled Megalopolis. Hero Swing features multiple game modes allowing players to simulate their own ultimate swinging hero experience. GAME MODES The current version of Hero Swing VR features five game modes easily accessible from hero's apartment. Each game mode has multiple difficulty levels to accommodate the needs of both novice and experienced players. DISTANCE MODE Distance Mode is the 'vanilla' experience of Hero Swing VR. The goal is very simple, to cover as much distance as possible without touching the ground. Swing through the air, wall jump and avoid obstacles all while feeling the rush. This is an arcade high score driven game mode where the score will increase both with the distance covered and by performing various tricks. Distance mode comes in many variations such as Standard, Rooftop and Digital World. CHASE MODE Chase Mode was the logical continuation of our original “vanilla” experience. If we made swinging through a city possible why not also chase down bad guys? Welcome to the Chase Mode where the goal is to catch the bad guys making a fast getaway after a robbery. The robbers have various getaway vehicles such as cars, trucks and helicopters and each has its own pros and cons. It's up to the player to put his hero skills to the ultimate test. SWING&amp;GUN The Swing&amp;Gun arcade mode puts the player in a virtual 'Tron' inspired environment in order to fight off waves of robotic monsters. This mode combines both swinging and shooting mechanics and the result is fast paced adrenaline action. Use 6 different weapons and face both swarms of drones and giant robots. Just like our other modes Swing&amp;Gun requires the player to keep on the move by rewarding movement with ammo replenishment. VIRTUAL GOLF : We wanted to make specific challenges for the achievement room but then it turned out that it was a very fun and relaxing game mode that could be played with friends using only one headset. That's when we made Virtual Golf a game mode that is designed to be both a challenge new and old players and is multiplayer 'hot-seat' friendly. Players will have use a limited amount of swings to successfully navigate our 12 hole course, its basically Golf but in VR, with force gauntlets... TRAINING MODE : If you ever want to just relax in a comic book city and swing around then this is the game mode for you. No objectives, no stress, just enjoy the impressive skyline Hero city has to offer. Unless you are up for a challenge? Then partake in various challenge course in time trial mode. ROADMAP FOR FULL RELEASE: CORE GAME IMPROVEMENTS: We are happy with how our game looks and plays but we had certain higher standards in mind for our full release. Before the full release we are working on the following: improving the graphics optimizing the game to run better on PC optimizing controls (we would like to create multiple control presets that would fit the needs of both newer and more experienced players) expand existing game modes and challenges KAIJU MODE: This mode is what we had in mind when creating the Swing and Shoot game mode and mechanics. We always wanted the player to swing around a 300m tall Monster that is attacking the city. As it rampages through the skyline it's up to the Hero to dodge, swing and shoot at the Kaiju to save the city. As big fans of Kaiju movies we could not sit idle and not make this game mode. It's still in very early alpha but we would love to make a fully fledged game mode out of it with insanely difficult achievements. EXTRA ROADMAP: This part of the Roadmap is what we would love to do with the game if the game is well received. Developing a virtual reality game is money and time consuming and the following features are very time intensive. Originally we hoped to have those game modes included in the full release but it turned out that we underestimated the momentous task of making VR content. If by any chance Hero Swing VR is well received by the community so it covers our business expenses we will work to add the following game modes as Free DLC-post release: STORY MODE: We would like to create a lighthearted superhero story that combines various elements from other game modes in creating a integrated seamless experience. This particular mode is imagined as a very large expansion/addition for Free mode where player would move around the city and once when they feel like it, start story missions. MULTIPLAYER: The ultimate vision for Hero Swing VR always had multiplayer features. As have been noted earlier, if the game acceptance exceeds our expectations, we will be granted an opportunity to make this mode and to further spice up and enrich the heroic flavor this game provides. We would like to make at least three core game modes: Race, Combat and Coop. The race mode would be similar to other light hearted kart racing games where players fight while completing laps around the course. We believe that the distance mode could serve as a great course for racing other players and fighting them mid air. Combat mode is imagined as a 3v3 mode where players swing and shoot in standard shooter game such as, for example, team death match, search and destroy or capture the flag. Coop mode was imagined to allow players to enjoy story mode from above with friends. After all, wouldn't it be amazing to participate in this adventure simultaneously with your friends? ABOUT CUBICLE INTERACTIVE Our lifelong passion for video games and digital entertainment brought us together first as friends, and then as colleagues. What once was a mere hobby is now our full time commitment. Cubicle Interactive began as a playtime project in Unreal engine. Our goal was to develop an adrenaline filled experience inspired by our childhood heroes, but as development went on we realized that Hero Swing could truly become an amazing game. That is when we transitioned to work full time on this project and after another year of development it was time to involve the community in order to finish Hero Swing VR. That is how Cubicle and Hero Swing VR came to life, our attempt to share the ultimate swinging experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1021890/header.jpg?t=1610830968",
    "Price": 12.99,
    "Developers": "Cubicle Interactive",
    "Publishers": "Cubicle Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_619716e76a2622437f3e34aa47bf477ad26a342e.1920x1080.jpg?t=1610830968,https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_15770fcb6e9b6e5be1e93f24e0c05b42c37b7f3b.1920x1080.jpg?t=1610830968,https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_a93165be8164bae6ed4d75ac471e98e690f532fb.1920x1080.jpg?t=1610830968,https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_e16626aa889c487de23f312f959c87170dff6e2a.1920x1080.jpg?t=1610830968,https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_32256ef84af326679b04c47054bbf450a989f5f2.1920x1080.jpg?t=1610830968,https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_1fdd65392fd25c3273da0d3742dedd00ded18bf5.1920x1080.jpg?t=1610830968,https://cdn.akamai.steamstatic.com/steam/apps/1021890/ss_1b534d9f00933f4ddfc495ee77026445d1a8e141.1920x1080.jpg?t=1610830968",
    "Slug": "hero-swing-vr",
    "Meta Title": "Hero Swing VR: Nov 12, 2020, Cubicle Interactive and Full...",
    "Meta Description": "Looking for information on Hero Swing VR? Check out the release date (Nov 12, 2020), developer insights from Cubicle Interactive, and a complete game su...",
    "Alt Text Image": "Official header image for Hero Swing VR game - Steam 1021890",
    "Canonical URL": "https://gusku.site/game/hero-swing-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hero Swing VR\", \"description\": \"Looking for information on Hero Swing VR? Check out the release date (Nov 12, 2020), developer insights from Cubicle Interactive, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cubicle Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cubicle Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1021890/header.jpg?t=1610830968\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}