{
    "AppID": 1132710,
    "Name": "Hikari! Love Potion",
    "Release date": "Aug 30, 2019",
    "About the game": "STORY Yuuta is an average office worker that’s looking for some excitement in his boring life. One night like any other, a mysterious portal opens before him in the middle of the streets. Sophia, a former elf princess of an important medieval kingdom tells him he’s the messiah she’s been looking for so many years, the true savior from an old prophecy that must save and restore peace within her continent by using the Love Potion to defeating Beatrice, a corrupted Goddess that’s been creating chaos and confusion after starting and ending a war to obliterate all men and dominate all women by brainwashing. A little bit confused yet, Yuuta joins the busty princess on an adventure in another world! Use the Love Potion to reverse the brainwashing effect on Beatrice’s main girls, make them join your party and save the continent! CHARACTERS Sophia Personality: Cheerful, friendly, clumsy Cheerful, cute, and a little bit clumsy, Sophia is the legitimate princess of this region. After her whole family went missing during the war, she has been trying to find the true savior mentioned in the prophecy. Now her mission is to help Yuuta, the chosen one, to restore peace within these lands while putting her latest creation to the test... The Love Potion. Agnes Personality: Serious, protective, fearless As the leader of the Elite Knights, Agnes has earned the respect and affection of her companions and the people of Clarendux. It is a city that she has always loved and has sworn to protect and she uses her strong attitude and will to help the weak. However, after a mysterious visit during the war, her ideals and goals seem to have changed radically... Will you use the Love Potion to conquer Agnes and make her join your team or will you end up being just another victim of her sword? Iris Personality: Calm, shy and insecure. Iris has been an orphan for most of her life. From a young age, she became one of the most important and reliable maids in the city. Now, she lives only to serve her mistress in a world full of pain and torture. Despite all of this, this pretty and kind girl seems to have a secret or two under her sleeves. Do you have what it takes to conquer her heart and make her join you with the powers of the Love Potion? Rinu Personality: Outgoing, seductive, sexy Rinu is the most powerful succubus in these lands and is also the guardian of Pleasure Valley and all of its surroundings. Thanks to her immense power and sexy figure, even the bravest of warriors have fallen to her charms during the war. With a strong, daring and ruthless attitude, this beautiful creature won't hesitate to bring you to your knees and make you her slave if you decide to take the challenge. Are you ready for it? Beatrice Personality: Overconfident, arrogant, powerful, evil, sexy FEATURES Point and click adventure Fully uncensored erotic CGs CG gallery to view CGs and character sprites 5 sexy girls to romance Partial Japanese voice acting Multiple choices",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1132710/header.jpg?t=1580431508",
    "Price": 4.99,
    "Developers": "Toffer Team",
    "Publishers": "Denpasoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_837afe2f555b39bf8cb8a4c6295621af46c0fd4a.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_9db47112535576bea8747db1bdf09d4efa6ec504.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_e495afb9668ececfcbaf2e180042da1b2ead0bcc.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_114a4581e6d75b731ff2e441059da89d30ca2cd2.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_0c129ead1444e8d656fd9d7bec2c3b90efffde17.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_d8e9337e61e3e931a7985d434550db90b21ef618.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_14dc07d594f3602f1425868b78d140915c9df626.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_0c4edeece24a1479323da061cd106219c4e9d564.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_b8421c167cdcc525a066c72e43dad56bb3fefcfc.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_f8e7f36244a55d5027792ed32b4dd33b76d2b2fa.1920x1080.jpg?t=1580431508,https://cdn.akamai.steamstatic.com/steam/apps/1132710/ss_79182ceb4744cff3cbf3c370b86ec29fbfdc9b33.1920x1080.jpg?t=1580431508",
    "Slug": "hikari-love-potion",
    "Meta Title": "Hikari! Love Potion: Aug 30, 2019, Toffer Team and Full O...",
    "Meta Description": "Looking for information on Hikari! Love Potion? Check out the release date (Aug 30, 2019), developer insights from Toffer Team, and a complete game summ...",
    "Alt Text Image": "Official header image for Hikari! Love Potion game - Steam 1132710",
    "Canonical URL": "https://gusku.site/game/hikari-love-potion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hikari! Love Potion\", \"description\": \"Looking for information on Hikari! Love Potion? Check out the release date (Aug 30, 2019), developer insights from Toffer Team, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toffer Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denpasoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1132710/header.jpg?t=1580431508\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}