{
    "AppID": 401970,
    "Name": "Hypatia",
    "Release date": "Aug 29, 2018",
    "About the game": "Come explore Hypatia, the massively multiplayer metropolis filled with creation tools, mind-bending puzzles, and adorable stuffed animals! -EXPLORE- The city of Hypatia is a huge open world, filled with canvases for painting, canals for boating, and stuffed animals for throwing! Follow clues in the environment to find all the hidden areas, secret items, and unique treasures. The streets of Hypatia can be explored on foot, on a rowboat down the canals and lakes, or through the skies in hot air balloons and airships. Featuring full locomotion as well as teleportation movement modes, our robust control options allow you to move how you feel most comfortable. Whether you’re navigating a multi-dimensional maze, sailing through the rooftops in an airship, or diving with a plesiosaur at the bottom of the sea, you’ll be amazed by what you’ll discover next. Every corner of Hypatia has secrets waiting to be discovered, and each one will reward you handsomely for finding them! Win unique parts for your avatar, currency to spend in the mall, and lots more. -CREATE- Players can draw and paint anywhere, take pictures with one of five different types of camera, or perform a new act on stage in front of a live VR audience. Spray paint comes in every color imaginable, and permanently paintable walls are everywhere. If you prefer a traditional canvas, easels can be found in most of the city’s beautiful parks. Submit your favorite pieces to galleries like the Art Studio’s Painting Gallery or the Mango Photography Museum’s Photo Gallery, and vote for your favorite works by fellow artists. Can you win first place in the weekly art contests? Once you’ve made all this art and collected loads of prizes, where are you going to put it all? How about in your own personal apartment? Spaces are now available for Hypatia’s Player Property update! You can design and decorate your own VR home with furniture, wall paper, and lots of stuffed animals! Every door in Hypatia leads to a different property, meaning every player can own a part of the game map for themselves. -SOCIALIZE- Striking up a conversation with other players is easy with our proximity voice chat; just say hello! Use the Social menu to add them as a friend, and keep in touch anywhere in the city. Join our active Discord server to stay up-to-date on weekly community-led events and organize with other players. Through your travels across the city, you’ll be able to find and collect over a hundred unique avatar parts. Then you can customize each part with colors and styles, and mix &amp; match different parts to create your own individual look. Hypatia: Where creativity is the currency",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/401970/header.jpg?t=1551981518",
    "Price": 0.0,
    "Developers": "TimefireVR LLC",
    "Publishers": "TimefireVR LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/401970/ss_2c11be9ed3a89353387b8cbd0ca911f8d4ed2216.1920x1080.jpg?t=1551981518,https://cdn.akamai.steamstatic.com/steam/apps/401970/ss_e47b16de9fe3ac5169d87e849f57945c98122342.1920x1080.jpg?t=1551981518,https://cdn.akamai.steamstatic.com/steam/apps/401970/ss_ded4f3e4b0089f8f9e2c5450e59e790a89e2ff8f.1920x1080.jpg?t=1551981518,https://cdn.akamai.steamstatic.com/steam/apps/401970/ss_871cfd4ef62e996fbf9741cd74782c93c3e732cd.1920x1080.jpg?t=1551981518,https://cdn.akamai.steamstatic.com/steam/apps/401970/ss_e182f1caa0641716db5b4ac5bef724828fb2e5d1.1920x1080.jpg?t=1551981518,https://cdn.akamai.steamstatic.com/steam/apps/401970/ss_ef9f6a9fb12614a09e94c13721113e1c0adfcb1d.1920x1080.jpg?t=1551981518",
    "Slug": "hypatia",
    "Meta Title": "Hypatia: Aug 29, 2018, TimefireVR LLC and Full Overview",
    "Meta Description": "Looking for information on Hypatia? Check out the release date (Aug 29, 2018), developer insights from TimefireVR LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Hypatia game - Steam 401970",
    "Canonical URL": "https://gusku.site/game/hypatia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hypatia\", \"description\": \"Looking for information on Hypatia? Check out the release date (Aug 29, 2018), developer insights from TimefireVR LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"TimefireVR LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TimefireVR LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/401970/header.jpg?t=1551981518\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}