{
    "AppID": 1472560,
    "Name": "I Am Fish",
    "Release date": "Sep 16, 2021",
    "About the game": "I Am Fish is a charming, physics-based adventure starring four intrepid fish friends, forcibly separated from their home in a pet shop fish tank. Over the course of the game you join them as they swim, fly, roll and chomp their way to the open ocean from the far-flung corners of Barnardshire (the smallest county in England) in their bid for freedom and to re-unite once again. FINTASTIC FRIENDS Meet our heroes! Goldfish - cheerful, brave, and adventurous, a natural born swimmer! Pufferfish – a little slow but kind-hearted who can also puff up into a ball and roll across land. Piranha - wild, chaotic, loud, unpredictable, and loves to bite - obviously. Flying Fish – a little aloof at times but a real softy at heart, with the ability to glide through the air! These plucky heroes will leave no bowl unturned, putting their heart and shoal into the mission to re-unite! NO NEED TO BE A BRAIN STURGEON Swim, roll, glide, chomp, flip flop, inflate, fly and bite your way through enthralling challenges. A simple, intuitive control scheme leaves no excuses should your fish perish leaving you feeling very gill-ty. THINK OUTSIDE THE BOWL With its idyllic coastline and quaint villages Barnardshire might seem like a perfect slice of quintessential tranquility, but to our aquatic adventurers it’s alive with the very real threats presented by crossing roads, traversing rooftops, dodging deep fat fryers, avoiding wildlife including the cantankerous locals, not to mention fragile fishbowls and the very real problem that fish can’t breathe out of water. LEAVE NO FISH BEHIND We won’t dwell on grizzly fish death, but should your fish fall too far in whatever make-shift fishbowl it finds itself in, run out of air or generally flounder you will be popped back to the most recent checkpoint to refine your approach. SWIM TO FREEDOM Our four fin-tastic friends will be hitching rides in all manner of ad hoc water carriers including jars, mop buckets on wheels and the occasional pint glass. Cheers! Navigating in each make-shift aquatic vehicle poses its own unique challenge, but don’t worry, the relative freedom of open water is never too far away with inviting fountains, swimming pools and err, sewers full of hazardous materials to splash around in, before reaching the final goal – the shimmering, open ocean. BE CAREFUL YOU DON’T FLOUNDER Whilst I Am Fish may look like a piece of hake to play, actshoally the controls are deliberately designed to be challenging and with an additional layer of added Bossa Style controls, it won’t be like shooting fish in a barrel. Even if you are a dab-handed player, you might find yourself in deep waters - we dare you to dive in!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1472560/header.jpg?t=1656003679",
    "Price": 9.99,
    "Developers": "Bossa Studios",
    "Publishers": "Curve Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_448c5e50d0f663660dceb92279f0480b1a55806b.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_30de2e5d50bcb4a0460f5ef6858019665b9bc8d9.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_0480024d03a454dbd12178b35b5b10e8619c83e1.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_1afa229bd43a56ddc114983fb6e2c824f1dd3c3d.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_839c9b1028afb8226febb1e258260d3f92c7e125.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_fd9aa604a0c61a0ed5f86da7e1ca70e72f27aa6b.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_858e3528167517a8b2f49d9efd1691b2ee0c6681.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_4be849859bec3bcdf49bd6af15f4036db0a5e8cb.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_ba1ad6a5f9ae0625c8d65d5d59eaecfaeed00ffa.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_043e2dfcedd39c3d2a46526054036bc406c275bb.1920x1080.jpg?t=1656003679,https://cdn.akamai.steamstatic.com/steam/apps/1472560/ss_1d6e4efe8e674ec1bcc0cea7f2781b0e8ee106f7.1920x1080.jpg?t=1656003679",
    "Slug": "i-am-fish",
    "Meta Title": "I Am Fish: Sep 16, 2021, Bossa Studios and Full Overview",
    "Meta Description": "Looking for information on I Am Fish? Check out the release date (Sep 16, 2021), developer insights from Bossa Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for I Am Fish game - Steam 1472560",
    "Canonical URL": "https://gusku.site/game/i-am-fish",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"I Am Fish\", \"description\": \"Looking for information on I Am Fish? Check out the release date (Sep 16, 2021), developer insights from Bossa Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bossa Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Curve Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1472560/header.jpg?t=1656003679\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}