{
    "AppID": 635940,
    "Name": "Little Busters! English Edition",
    "Release date": "Nov 1, 2017",
    "About the game": "Story Riki Naoe lost his parents as a child, and fell deep into despair. He was saved by a group of kids who called themselves the Little Busters: Kyousuke Natsume, Masato Inohara, Kengo Miyazawa, and Rin Natsume. They took him and played at being heroes who fought tireless evil around them. Riki discovered endless joy in spending time with his new friends, even though the group was silly and their missions tended to end in failure. Over time, it washed away his loneliness and suffering. Years later, the whole gang was attending the same school, and Riki became a second-year. They were still as silly as ever and spent their youth following Kyousuke's silly ideas. Description 'Little Busters!' is a hit visual novel that was originally released in Japan in 2007. In the following year, 'Little Busters! Ecstasy' edition came out, promoting Kanata Futaki and Sasami Sasasegawa to heroines, and adding an all-new heroine, Saya Tokido. In 2012, the 'Little Busters! PERFECT EDITION' was released with improvements in the 'Little Busters! Ecstasy' scenarios. In 2012 and 2013, the game was made into two anime series 'Little Busters!' and 'Little Busters! ~Refrain~'. Both series are available and have gained a large following in many countries outside of Japan as well. 'Little Busters! English Edition' is a new version that further enhances 'Little Busters! PERFECT EDITION'. This new edition supports HD resolution for the first time on PC, and allows dynamic switching between Japanese and English text. Characters RIKI NAOE Ordinary Boy with an Extraordinarily Lively Youth The protagonist. Riki is a bit weak-willed, yet very considerate toward his friends. He always gets involved in the ruckus caused by the troublemakers around him. Riki also plays an important role as the straight man in his pals' idiotic comedy routines. KYOUSUKE NATSUME Leader who Turns Ordinary Days into Missions Kyousuke is the only third-year in the team and leads the team. The mysterious side of his personality attracts many girls unbeknownst to him while he enjoys boys' comics like a little kid. MASATO INOHARA Lovable Straight Muscle Idiot Masato is simply a muscle idiot. He dedicates his life to bodybuilding and fighting. Masato and Kengo are like cats and dogs, always fighting each other. No one but Kyousuke is capable of arbitrating their fights. KENGO MIYAZAWA Masato's Strongest Rival Kengo is a different type of idiot from Masato, one who devotes himself to kendo. He pretends to be cool and collected, but is actually impulsive and short-tempered under his exterior. Unlike the rest of the team, he has a somewhat cynical nature. KOMARI KAMIKITA Height: 159cm Weight: 45kg Measurements: 83, 57, 84 Peerlessly Cute Fairy Tale Girl Komari is a girl who loves picture books, fairy tales, and sweets. She is so careless and clumsy that she often messes things up and ends up bringing herself to tears. She lives her life seeking 'wonderful things' and 'keys to happiness.' Komari is, in short, an optimistic airhead. RIN NATSUME Height: 153cm Weight: 43kg Measurements: 77, 54, 80 Prideful Kitten who Doesn't Easily Take to Others Rin is Kyousuke's little sister. She is rather unsociable, having grown up under the protection of her brother. She tends to act before she thinks. She is often seen using high kicks when a particular person does or says something silly. HARUKA SAIGUSA Height: 163cm Weight: 49kg Measurements: 81, 59, 82 Easygoing Noisy Girl Haruka is not in the same class as Riki, but for some reason can always be found in his classroom. Where she goes, trouble always follows. She either gleefully involves herself, or gets caught up in the mess. She basically flies by the seat of her pants without taking anything seriously. KUDRYAVKA NOUMI Height: 145cm Weight: 37kg Measurements: 69, 51, 72 Exotic (Self-Proclaimed) Mascot Kudryavka has a very Japanese personality, influenced by her Japanophile grandfather, despite having been born and raised outside Japan. She doesn't like that fact and forces herself to speak English. She is actually younger than the rest of the team. Everyone around her adores and picks on her as a mascot. Her friends call her 'Kud.' YUIKO KURUGAYA Height: 170cm Weight: 55kg Measurements: 90, 60, 89 A Tad Mischievous Anego Yuiko is one of Riki's classmates, the very personification of an 'Anego.' Everybody around her counts on her because of her confidence bordering on arrogance and keen insight. She also loves cute girls. MIO NISHIZONO Height: 153cm Weight: 41kg Measurements: 75, 55, 79 Parasol-Holding Silent Beauty Mio is a quiet girl who spends every recess reading by herself. She is diligent in everything she does but sometimes goes off into her own little world after getting the wrong idea about things. She never forgets to take her parasol with her when going out. SAYA TOKIDO Height: 156cm Weight: 44kg Measurements: 83, 55, 82 Invincible Airhead One side of Saya is a cute girl liked by everybody in her class. The other side is a mysterious spy who at night searches the school grounds for the 'treasure' hidden and protected by the Darkness Executives that she occasionally engages. KANATA FUTAKI Height: 163cm Weight: 47kg Measurements: 80, 57, 82 Blunt, Unsociable, and Tactless Prefect Kanata is the head prefect at school. She is inflexible, unfriendly, and doesn't hesitate before showering people with insults. She has persistent hostility toward any student who 'corrupts public morals.' SASAMI SASASEGAWA Height: 154cm Weight: 43kg Measurements: 78, 54, 81 Self-Centered Cat Queen Sasami is the hope of the softball club and a prideful girl always accompanied by her followers. For some reason she considers Rin as her rival. Many people stutter when attempting to pronounce her tongue twister-like name. Theme Song 'Little Busters! -ecstasy ver.-' Composition &amp; Lyrics Jun Maeda Arranged by Tomoyuki Nakazawa (I've) Takeshi Ozaki (I've) Remix MintJam Vocals &amp; chorus Rita Developed by: VisualArts/Key Converted by: PROTOTYPE Translated by: Fruitbat Factory, Interweave Productions",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/635940/header.jpg?t=1649201003",
    "Price": 34.99,
    "Developers": "VisualArts/Key",
    "Publishers": "VisualArts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_bffc4a4b892f0a5be64ba28cc9eaa3e0c52a2a0d.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_1c53db3f051f206f8b4dc29954bc00492838168c.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_0dbb2570bf173bc39f9a5241089880e713e67e2a.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_2fc3c034bbf31b1965e088747c037f543cf025d1.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_08599090da750f0506a06e1e6decffbe6822f012.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_a0f921c1c4f9d5077e11a2bd6675bdaaa6c62fc5.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_2342f656ed6510bc328b283edd8bea0392ba50a1.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_e3d68014f6bfb1128bda2ce285e3f6eba52c207c.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_b984728b6158d4b8c33299fc533f744a97933174.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_99b0cd7faa8c4ffd80598602811f74beb08ae8e2.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_4e3143ad2bc094754d38803541ec057c29cbed69.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_839029f1de699829ba7dbee987deaf4fedaaf4ef.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_1d7bc0de9a751acb438d1bc45715612286550ce7.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_083bbc464f08e30799f6180aa1a60339399ffa17.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_ccafad6ee91f8b49e15a92af0712c954b7558722.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_2c37e7869758810560ace9d4e20bbaa23f59a78a.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_8045b6c72929dd9a654c1470275674f3e28d1823.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_28dfc3379f55104ff0ad01a44dad39bc375e4d0c.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_be014513ecab7ab43bb252ce9339d458e6f828ef.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_6f8fe904af2af12e3375f1ae0bae2418a15e05b3.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_a1ec662b8a5779f3c65c5b02d1b24596747f1e8e.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_bd88e444758d2ddad565d7df5a4dac5f8275ed2a.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_0934c1b83979e53167170639c3860afc51b5b929.1920x1080.jpg?t=1649201003,https://cdn.akamai.steamstatic.com/steam/apps/635940/ss_6abf84a8441baf1f99fd11b6fb402c03e12132df.1920x1080.jpg?t=1649201003",
    "Slug": "little-busters-english-edition",
    "Meta Title": "Little Busters! English Edition: Nov 1, 2017, VisualArts/...",
    "Meta Description": "Looking for information on Little Busters! English Edition? Check out the release date (Nov 1, 2017), developer insights from VisualArts/Key, and a comp...",
    "Alt Text Image": "Official header image for Little Busters! English Edition game - Steam 635940",
    "Canonical URL": "https://gusku.site/game/little-busters-english-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Little Busters! English Edition\", \"description\": \"Looking for information on Little Busters! English Edition? Check out the release date (Nov 1, 2017), developer insights from VisualArts/Key, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"VisualArts/Key\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VisualArts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/635940/header.jpg?t=1649201003\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}