{
    "AppID": 1566830,
    "Name": "Magna Graecia",
    "Release date": "May 23, 2022",
    "About the game": "Magna Graecia is a game that lets you create unique ever-growing farming villages set in ancient Greek style. In this game, you have to transform a lonely house into a charming hamlet by placing your buildings strategically, raising their level, receiving various adjacency bonuses, and expanding your territory. Magna Graecia is suitable for both who want to relax, slowly filling their village with olives and grapes, and those who want to test their strategic thinking because every ill-conceived building can be one of the last in your Greek village. You start the game with one house in the center and six empty hexagonal tiles around it, which you have to fill using a randomly generated sequence of buildings and resources: crop field, winery, forest, and so on, gaining points along the way. To expand your village, you need to build a house that adds all adjacent tiles to the territory of the Greek hamlet. In this game, you can (and should!) level up houses, wineries, and olive farms. Leveling up mechanics are simple: 3 same first-level buildings, where each is adjacent to the other two, turn into one second-level building, which gives you amazing bonuses. For example, a second-level house adds all adjacent tiles in a radius of 2 to the village (the radius is doubled). The game ends when the limit on houses is exhausted and all tiles in your village are filled with buildings and resources. There are two key resources in the game – olives and grapes . We can say that this is the real pride of your Greek hamlet. You should place olives and grapes on the adjacent tiles to olive farms and wineries respectively because adjacency bonuses play a very important role here: each resource gives +1 by default, and for each farm adjacent to it, this indicator increases by 1. Farms level up the same way as houses. Their radius of influence and adjacency bonuses will be doubled (now +2!), significantly increasing production in the village. Remember, that's a very powerful tool. By placing buildings correctly, you will literally become an olive oil and wine tycoon, thereby adding a lot of points to the overall rating of your village, which will show at the end of the game, how well you did in creating a Greek farming village. Magna Graecia offers you: Evaluating different options. Should I place it here? Or here? Reflection process. There is no timer. No one is rushing you. Overcoming yourself. Wanna beat your previous score? Do it. Growing olives and grapes. This is the most important. Magna Graecia does not offer you: Triple-A game experience A cinematic story Microtransactions Character customization Battle royale Game mechanics are inspired by Dorfromantik and Triple Town . Graphic design is inspired by Islanders and Kingdoms and Castles .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1566830/header.jpg?t=1653485218",
    "Price": 7.99,
    "Developers": "Gamestrix",
    "Publishers": "Gamestrix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_6a802e01be087014d78b69a0c794b6790a1d0848.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_9c3c9a8c230d95974c758c95ff59a9018cc5bbbc.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_ac4465ecc4dce78b45db18048f38b87c44ea91b4.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_90ff85acd4faedece96ea91dbb5032c8a180b206.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_3ff1dcdb4852a239cb243cac4de3785cf6dc398d.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_457ae26c463234e9c26d52bf9e825fb16f8e38c1.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_c01d4d20af0fbbacf1577905947315f3a1460c1a.1920x1080.jpg?t=1653485218,https://cdn.akamai.steamstatic.com/steam/apps/1566830/ss_4d333a7366e17ffea657822e982ac0b1ec53cdf4.1920x1080.jpg?t=1653485218",
    "Slug": "magna-graecia",
    "Meta Title": "Magna Graecia: May 23, 2022, Gamestrix and Full Overview",
    "Meta Description": "Looking for information on Magna Graecia? Check out the release date (May 23, 2022), developer insights from Gamestrix, and a complete game summary.",
    "Alt Text Image": "Official header image for Magna Graecia game - Steam 1566830",
    "Canonical URL": "https://gusku.site/game/magna-graecia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magna Graecia\", \"description\": \"Looking for information on Magna Graecia? Check out the release date (May 23, 2022), developer insights from Gamestrix, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gamestrix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamestrix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1566830/header.jpg?t=1653485218\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}