{
    "AppID": 1132670,
    "Name": "Metal Heads",
    "Release date": "Mar 26, 2021",
    "About the game": "Metal Heads is solo developed, crazy multiplayer party game with head-banging metal music, where up to 8 players compete in mini-games and board game modes with a whole lot of insane mini-games that are easy to play, but difficult to master. ALL OF THE MINI-GAMES Survive a nightmarish pipe filled with deadly fans, buzzsaws, and lasers in ' Pipemare '. Run and Jump like a lunatic to avoid searing hot lasers in ' Laser lunacy '. Melt your brain and put your memory to the test in ' Melting Memory ' These are just a few of the mini-games that Metal Heads will eventually launch with. SOLO, LOCAL AND ONLINE MULTIPLAYER MAYHEM Feel like playing with yourself? That's ok! Almost every mini-game can be played solo, and have alternate survival/chaos modes where you see how long you can survive. It's not as much fun without friends though, so invite them over, but don't worry, 8 people can play locally, so nobody should be missing out on the fun. Want to play with 8 players but don't have enough people? Join other players online for some 8 player madness with couch vs couch multiplayer. SKILL BASED BOARD GAME MODE! Test your metal (HA! get it!?) in the board game mode where skill determines the winner, not luck. Spin the movement wheel, then RUN, JUMP, and PLATFORM your way to your destination; Get the collectibles, take risky short-cuts, buy items, traps and obstacles at the shop to try and stop your opponents from winning. The player with the most board game points, wins! LIKE A BOSS! HOORAY! YOU WON! You get a........ BOSS BATTLE ! Inspired by classic 3D platformer bosses, the winning player will become a boss with their own set of skills and abilities to try and defeat all of the other players in a 1 vs ALL boss battle. The other players will need to use the environment, or wait for a window of opportunity to defeat the boss. This battle will decide if you really are the ultimate metal head. METAL HEAD MAKER (NOT available in Early Access...yet) Create your own unique Metal Head with the in-built Metal Head Maker. Chose the base head, and add accessories such as eyes, hair, antennae, or do the same with the body, and give your Metal Head a metal arm, maybe some clothing or....a CAPE! HEAD-BANGIN' TUNES It can't be called 'Metal Heads' if there's no metal music, so the extremely talented Andy Gillion, of Mors Principium Est and Neverafter fame has created the head-banging, face melting, energetic music for each and every single mini-game. PLUS extended tracks for each mini-games alternate/survival/chaos mode. Metal Heads music is 100% original to the game. (DISCLAIMER: Music is also DMCA FREE! Which means you will not be hit with copyright strikes while playing the game on a stream or video) LET ME SHOW YOU THE FUTURE I love party games, ALL of them, I don't care for competition, I just want to play them all, so it is great that I can create my own party game and add what I want to it, whenever I want. This means that after Metal Heads releases on PC, this is a rough idea of what I want to do: More mini-games. Eventually the plan is to have over 70 mini-games. More board-game maps. More is better, I love variety, and I know you do too, so I plan to make many more board game maps. More game modes. I have a few ideas I would like to experiment with to try and bring something new and unique to the table. Mini-game maker. I want you to be able to create your own mini-games. This is extremely difficult to make, but I want to do it! Board-game maker. There is already a prototype version, but this won't be available for a while. More game themes . Because rusty metal can get a bit monotone after a while. Seasonal updates. Because Santa's hats and winter mittens are Metal AF. MORE METAL. For every mini-game created, a new music track comes with it. The plan is for Metal Heads to feature some of the most talented metal artists in the Metal music industry. PLAY THE DEMO RIGHT NOW Seriously...do it! The Metal Heads demo currently supports both OFFLINE AND ONLINE MULTIPLAYER , and consists of a whopping TWELVE mini-games, most of which can be played solo. The demo does not contain all features yet, and like all games, it has dreaded, nasty, squirmy bugs, so please, do not give up if you run into one, head on over to the support forums found below, you may find a solution to a problem, but if not, you will not be ignored. / F.A.Q. HOW MANY PEOPLE ARE WORKING ON METAL HEADS?: THERE ARE 2 PEOPLE: Nathan Francis (Developer; hard to believe, but I do the 3d modelling, animations, UI, voices, SFX...everything! Except the music) Andy Gillion (Musical Genius behind the incredible original sound track) WHEN DID METAL HEADS START DEVELOPMENT?: JANUARY 2017. It has been on and off in development since then, but since MARCH 2019, development turned full time with 12-16hr days compared to the previous 4-8 hour weeks. And I relied on my day job in retail/sales to fund the project. Andy GIllion started working on music for Metal Heads in late November 2019 and has easily been the best addition to the development. WILL METAL HEADS COME OUT ON CONSOLE? Metal Heads would be perfect on console, so Nintendo Switch, Xbox and Playstation releases are planned for the future, but not solidified. There is currently no ETA for any console release, but you will be notified when it will be available. WHY DID YOU MAKE METAL HEADS? Metal Heads is a passion project, and something I (Nathan Francis) want to play when my friends come over, or whenever there is a party games night. I enjoy making things and seeing the reaction of others when they see and experience what I have made, especially when what I make, causes people to laugh and have a great time. I also love party games, it's a great way for friends to get together, and online party games are a great way to meet new friends, however I wanted to create a party game where up to 8 people could play, so that nobody misses out on the fun. WHEN WILL METAL HEADS RELEASE? There is no definitive ETA yet, but Metal Heads aims to release into early access in Q1 2021, allowing you to support the game and get access to new content as I develop it in preparation for the full game launch later on in 2021. As a solo developer, I have relied on a day job for income, it is difficult to maintain such a mammoth task of working 12-16 hours every single day, it is easy to burn-out so I need to be smart about how I work, and the future is unpredictable, so delays may happen, or ...hopefully, massive burst in productivity happen, and I can get Metal Heads out to you all sooner. Either way, no matter if Metal Heads gets buried, or if it becomes huge, I will still work on it, because I enjoy it, I am making the party game that I want to play. WILL THE DMCA DEMONS STRIKE ME DOWN ON FOR PLAYING THE GAME ON TWITCH OR YOUTUBE? NOPE! And if they do, contact me immediately and I'll strike those demons myself!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1132670/header.jpg?t=1657922912",
    "Price": 13.99,
    "Developers": "Otreum Games,Nathan Francis",
    "Publishers": "Otreum Games,Nathan Francis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_c310d6851d2b08b2cfc1e5538796ec4835d6a399.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_caddfa4a7ea65f28bbdde83b281a138043e2d6c1.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_36cb7bf1c81c1b4b5548e3cf4c4a81a236873dad.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_9965e7755298d7827f8e323a59632fb7d14f5847.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_e95e8df0100ba8e591572e142ed1241837acad5e.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_87487f1cb7688eeb84e73d6f15d523ea6b2d1b6e.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_05702d706803c6ffa3826732325878fb5db41c5e.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_b5a36c3fae155bd12673d519f8a8a84b68d15de4.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_7a1a660a1e25a94ac2cce5e8e9db0284330825ae.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_44678da88fdcfbca9d5bd88ecef98fdbb1aebfb1.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_c0f4c6bdc29ce733ddce1028fb24346f028ceffa.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_119fb8be5518fffeb13d5329a393b80deb327add.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_c872be41e22c0a3615cbfb0ae782203464290ca0.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_e387a42700967396e182de8bab0cf716b02de394.1920x1080.jpg?t=1657922912,https://cdn.akamai.steamstatic.com/steam/apps/1132670/ss_9af57433c57fdcaa5a113e863ddfa6bbfcbfb365.1920x1080.jpg?t=1657922912",
    "Slug": "metal-heads",
    "Meta Title": "Metal Heads: Mar 26, 2021, Otreum Games,Nathan Francis an...",
    "Meta Description": "Looking for information on Metal Heads? Check out the release date (Mar 26, 2021), developer insights from Otreum Games,Nathan Francis, and a complete g...",
    "Alt Text Image": "Official header image for Metal Heads game - Steam 1132670",
    "Canonical URL": "https://gusku.site/game/metal-heads",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Metal Heads\", \"description\": \"Looking for information on Metal Heads? Check out the release date (Mar 26, 2021), developer insights from Otreum Games,Nathan Francis, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Otreum Games,Nathan Francis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Otreum Games,Nathan Francis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1132670/header.jpg?t=1657922912\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}