{
    "AppID": 1356380,
    "Name": "Pendelum",
    "Release date": "Aug 21, 2020",
    "About the game": "'Swing! Swing as if your life depended on it! Or at least your score.' Some wise man, or something One pendulum. One map. One goal. Nothing else should be needed to get you excited. ALTERNATIV Is there anything else you need to get excited? In Pendelum, you cannot move on your own. Only gravity and external influences such as trampolines and fans can help you achieve your goal. Sometimes you’ll need patience, sometimes you’ll need concentration, and sometimes it’s just trial and error - a new challenge is always just around the corner. But they all have one thing in common - at some point you’ll reach your goal. Guaranteed. Probably. Maybe. The Goal Well, reach the goal! This green, glowing box somewhere on the map. That's it! Sounds easy, doesn't it? The Mechanics The basics are quite simple: Once your pendulum is released from its cage it's up to physics. Your only help is that you can fix both ends of your pendulum in any place at any time and independently of each other, so that only the other end can swing freely. You may - no - have to use this advantage to maneuver your pendulum through the world. Whether you’re navigating, interacting or simply swinging around – this game will make you swing into action. (ha - get it? Swing! Hahaha) The Elements There are various interactive elements within the puzzles that will add a lot to your frustration: Buttons and Laser Barriers trigger events. Just be careful not to trigger anything you don't want to! Doors and Force Fields prevent passage. They can be opened and closed - but only by the correct trigger elements, of course... Timers add extra stress to the game Trampolines and Wind Machines are, in addition to gravity, the only other ways to gain energy, height or momentum. Wind machines can be activated and deactivated. Gravity Fields serve to confuse you a little more. The Editor &amp; Community Level Of course, you shouldn't take out your frustration on your keyboard, your desk or even a fellow human being. That is why we have provided you with an opportunity to really drive the sweat on other people's brows and test their vocal cords. We present: The Level Editor ! (editor... editor... tor... tor...) Basically, you only need a spawn point and a goal surrounded by a bit of map to create a playable level. All it takes are a few seconds. But of course you don't have to leave it at that - there are no limits to your creativity! Or rather, almost no limits. Oh yeah - Of course, you can also share your self-created levels with other players by publishing them. NOTE: Publishing your own levels and playing the levels of other players is only possible after you have completed the easy section! We don't want to make it too easy, do we? The Versus mode In case that it seems too boring to just combat with your friends and the world using the leaderboard, there is the Versus mode. 2-6 players can compete against each other to face the same challenges at the same time. May the better win! The Co-Op mode[/] Of course, you don't always have to fight and stray through the world single-handedly. If you have a willing comrade at hand, the Co-Op mode offers a completely different perspective - You have to reach the goal together in specifically designed levels. How you manage that - that doesn't interest the goal! What? That's it?[/] Don't worry - just because the game is the way it is at the moment doesn't mean that it has to stay that way. Pendelum will go through a few more transformations - be it new chapters with new maps, new features or whatever. Stay tuned!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1356380/header.jpg?t=1598010624",
    "Price": 5.99,
    "Developers": "thelaumix productions,Lukas A. Schopf",
    "Publishers": "thelaumix productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1356380/ss_796ba24fdb25bbc1b95caa20b271f7097a40a220.1920x1080.jpg?t=1598010624,https://cdn.akamai.steamstatic.com/steam/apps/1356380/ss_a85d32171e2059449e8a9b84dcea0ab644d8f322.1920x1080.jpg?t=1598010624,https://cdn.akamai.steamstatic.com/steam/apps/1356380/ss_2cfdc4558b83c12b2c3aa795d35564728033482d.1920x1080.jpg?t=1598010624,https://cdn.akamai.steamstatic.com/steam/apps/1356380/ss_0fb9cee42cdfd9e8dfa878e892a2f7732ac09ac1.1920x1080.jpg?t=1598010624,https://cdn.akamai.steamstatic.com/steam/apps/1356380/ss_112ec82adc233514ae6101ecb1e7c3d73e104ac1.1920x1080.jpg?t=1598010624,https://cdn.akamai.steamstatic.com/steam/apps/1356380/ss_a1d811b10608577b5999885cb1dbae37d081e584.1920x1080.jpg?t=1598010624",
    "Slug": "pendelum",
    "Meta Title": "Pendelum: Aug 21, 2020, thelaumix productions,Lukas A. Sc...",
    "Meta Description": "Looking for information on Pendelum? Check out the release date (Aug 21, 2020), developer insights from thelaumix productions,Lukas A. Schopf, and a com...",
    "Alt Text Image": "Official header image for Pendelum game - Steam 1356380",
    "Canonical URL": "https://gusku.site/game/pendelum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pendelum\", \"description\": \"Looking for information on Pendelum? Check out the release date (Aug 21, 2020), developer insights from thelaumix productions,Lukas A. Schopf, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"thelaumix productions,Lukas A. Schopf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"thelaumix productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1356380/header.jpg?t=1598010624\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}