{
    "AppID": 1228490,
    "Name": "Politicking",
    "Release date": "May 30, 2020",
    "About the game": "Politicking is the best way to prepare your self for the election year, by bringing you the chance to settle your political views. You no longer have to feel helpless with only casting a single vote. You can finally log into Steam and do something that really makes a difference. With a gun in your hand and you as your favorite politician, the game play will feel a lot like all those retro type shooters you remembered playing as a kid. There are several weapons to choose from and a lot more planned. The maps have been carefully designed to provide a different strategy for each map. Currently planned game modes are Death Match, Team Death Match, Capture The Fag, Advance And Secure and Gun Mode. Key Features Play as several famous politicians from around the world and from the past. Up to 5 game modes to play. (Adding a new one on each update) Retro shooter game play feel 30 planned arena's to play in Map voting system Historical and foreign leaders Future Plans The plan is to add more characters and even comical ones. The game will also add over the years new political candidates that arise at the polls. A bunch of fun weapons to use against your political foes is also planned to be added. There are currently 5 arenas to play on during early access but there are at least 30 planned. Disclaimer There are no political message agenda being pushed in the game. So what ever your political views are, don't worry. This game wasn't created to send or push any sort of message against any political party on players. (Please Note) The only reason Trump is in the center of some pictures is because he is currently president and that will be updated when that changes. Playable Politicians Trump Putin Mike Pence Lincoln Hillary Obama Bill Clinton George Bush Ronald Reagan Bernie Sanders Richard Nixon Kim Jong-un Merkel Theresa May Edward Snowden Nigel Farage Boris Johnson John MCCain Dick Cheney Jimmy Carter JFK Al Gore Elizabeth Warren Hitler Stalin Churchill FDR Mussolini Haile Selassie De Gaulle Marine Le Pen Emperor Hirohito Joe Biden Tulsi Gabbard Alexandria Ocasio-Cortez Nancy Pelosi Macron Andrew Yang",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1228490/header.jpg?t=1590886179",
    "Price": 29.99,
    "Developers": "26horses",
    "Publishers": "26horses",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1228490/ss_7b060c04a4e22b1711fa4f8e763ff8dba1059d1b.1920x1080.jpg?t=1590886179,https://cdn.akamai.steamstatic.com/steam/apps/1228490/ss_b52ecb156768b2310cc5bd41d7a57c909cd3548d.1920x1080.jpg?t=1590886179,https://cdn.akamai.steamstatic.com/steam/apps/1228490/ss_97e15f7c8e32f2b705a1ebc3a6642e3f6b0e7c09.1920x1080.jpg?t=1590886179,https://cdn.akamai.steamstatic.com/steam/apps/1228490/ss_55fa995128c5e78426b4fee7b1ceb90d7ed8c394.1920x1080.jpg?t=1590886179,https://cdn.akamai.steamstatic.com/steam/apps/1228490/ss_92326f50d64831a4a51dce457a40bef76b3d97d4.1920x1080.jpg?t=1590886179,https://cdn.akamai.steamstatic.com/steam/apps/1228490/ss_5d5efc67d534049e3340115ae4b4036a5a7cd9cb.1920x1080.jpg?t=1590886179",
    "Slug": "politicking",
    "Meta Title": "Politicking: May 30, 2020, 26horses and Full Overview",
    "Meta Description": "Looking for information on Politicking? Check out the release date (May 30, 2020), developer insights from 26horses, and a complete game summary.",
    "Alt Text Image": "Official header image for Politicking game - Steam 1228490",
    "Canonical URL": "https://gusku.site/game/politicking",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Politicking\", \"description\": \"Looking for information on Politicking? Check out the release date (May 30, 2020), developer insights from 26horses, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"26horses\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"26horses\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1228490/header.jpg?t=1590886179\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}