{
    "AppID": 1070150,
    "Name": "SLAYERS FOR HIRE",
    "Release date": "Mar 20, 2020",
    "About the game": "SLAYERS FOR HIRE ® is a free-to-play indie platform fighter with an emphasis on speed, precision, and creative characters. This is a fighting game that rewards creativity more than any other. Whether you're goofing off with friends or pushing your skills to the limit, you can expect an adrenaline-filled experience every time you play. Play online (with rollback netcode!) with up to 16 players or locally versus up to 6 players or AI. Our goal with SLAYERS is to make a game that feels like a step forward for the genre. A game that feels at once familiar, yet novel. EARLY ACCESS FEATURES: Three playable characters: Slugger, Artist, &amp; Spy (with more hot on their heels) - Whether you enjoy rushdown or a more methodical style of play, each character is designed to give players the tools to approach fights any way you like. May creativity be your only limiter! Online play with rollback netcode - No longer do you need a perfect internet connection to have a smooth online experience! Fight against our AI - Don't feel like hopping online? Test your mettle versus our computer players. Unique stages &amp; game modes - Ever wonder what battle royale would look like in a platform fighter? Grab 15 friends and try it out for yourself in our battle royale map. Or give our arena stages a try. It's a cage match! Unique gameplay mechanics - We focused on creating gameplay mechanics that either open up new tools for players to explore ( Focus Attacks , Airdash Cancels ) or solve longstanding issues in platform fighters ( Combo Gravity ). Controller &amp; keyboard support - Currently you can play on Xbox, PlayStation, and GameCube controllers. You can also reconfigure and save your controls if you don't like our defaults. If you prefer tap jump on, that's your call. No hard feelings. Low computer requirements - Runs on toasters! Well, not literal toasters... PLANNED FEATURES: Story mode - Does a local/online coop metroidvania mode sound as good to you as it does to us? Sure hope so, because this is at the top of our list for a reason! More characters! - Other than the six we've already revealed, we've already got concept art for 10 more characters and ideas for many more! Basically, we want to pump out content for this game as long as we're able to! Items - We've got a long list of items we want to put into the game, sourced both internally and from community members. We have one implemented already, which lets you have !! 𝑰𝑵𝑭𝑰𝑵𝑰𝑻𝑬 𝑨𝑰𝑹𝑫𝑨𝑺𝑯𝑬𝑺 !! Awesome training mode &amp; tutorial - We have a bare bones training arena right now, but the plan is to develop a comprehensive in-game tutorial and training tools. Spectator mode &amp; replays - Great for learning and relaxing. In-game tournaments - Robots are going to put tournament organizers out of business one day. Sponsored seasonal leagues &amp; compendiums - Compendiums are the future! Everybody wins when they're set up well. Minigames - There are so many offshoot game modes we want to try, both big and small. For some this is a nice distraction, for others I bet this becomes the main thing they like about the game. Mod support - We're big fans of games with strong mod support, so obviously we want to set up mod support for our game as well. Custom stages - We'd also love to make a system for rating them in-game and rewarding players who make fantastic stages. Cool cosmetics - Always fun to see characters reimagined, and also fun to be able to express yourself in-game. ...and much more! As you can see, there are a ton of features we want to add. Simply put: We want to support this game with content for as long as we can possibly sustain. The community that has supported us so far has been amazing, and we can't wait to continue giving back for years to come. Thank you everyone!!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1070150/header.jpg?t=1632339457",
    "Price": 0.0,
    "Developers": "Meta Games",
    "Publishers": "Meta Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_d401a5489c8c7f0ffe1c3280206f0250da3885cd.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_63aba1ffe426394247d820401b133dbbcb257432.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_c9ba3ab3e4c2dc6bd3c5b7d347fc06a4e0dc87e6.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_6d814f3fb0493f172ef5ee3e98d0875a06b93f68.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_26aee462c426beccd073b84e493895dc4d41b59c.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_c16ab8d10ea457aaadf20c7a5a58da4f2a5146a5.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_75db58346c32ce8820385219e1a5999e81c3cc5a.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_c3427fc6b45630d3d6c1fa358ef59625790b7395.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_445ba07390a10734b974775230acb314ccd9d06c.1920x1080.jpg?t=1632339457,https://cdn.akamai.steamstatic.com/steam/apps/1070150/ss_bb4c78d8a0a35130c93c03f3303bd5e1dc5d6ca2.1920x1080.jpg?t=1632339457",
    "Slug": "slayers-for-hire",
    "Meta Title": "SLAYERS FOR HIRE: Mar 20, 2020, Meta Games and Full Overview",
    "Meta Description": "Looking for information on SLAYERS FOR HIRE? Check out the release date (Mar 20, 2020), developer insights from Meta Games, and a complete game summary.",
    "Alt Text Image": "Official header image for SLAYERS FOR HIRE game - Steam 1070150",
    "Canonical URL": "https://gusku.site/game/slayers-for-hire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SLAYERS FOR HIRE\", \"description\": \"Looking for information on SLAYERS FOR HIRE? Check out the release date (Mar 20, 2020), developer insights from Meta Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Meta Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Meta Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1070150/header.jpg?t=1632339457\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}