{
    "AppID": 1096530,
    "Name": "Solasta: Crown of the Magister",
    "Release date": "May 27, 2021",
    "About the game": "Free Content Update with the release of Lost Valley Online Multiplayer Co-op is now available: Compatible with both official CotM &amp; Lost Valley campaigns, Primal Calling content as well as Custom Campaigns made with the Dungeon Maker! Spellcasting Chants: Your spellcasters are no longer mute when casting spells, and we’ve added an additional spellcasting animation to boot! (you can turn off chants in the option menu) Crafting Feats: Tired of having to pick specific background in order to craft potions and magic items? We’ve added two feats to solve that problem! Surprise System Overhaul: Now more faithful to the tabletop rules with individual perception checks for each surprised enemy, making fights more even! New Quest, Dialog &amp; Custom Loot Table Systems added to the Dungeon Maker, helping creators to make even better and Custom Campaigns! Created and written by lifelong fans of Pen &amp; Paper RPGs, comes Solasta: Crown of the Magister. Bring the authentic Tabletop gaming experience to your PC! Roll for initiative, take attacks of opportunity, manage player location and the verticality of the battle field. Set yourself up for the finishing strike and possibly roll a natural 20 at that key moment of battle.​ In Solasta, you take control of four heroes, each with unique skills that complement one another. Every hero expresses themselves in the adventure, making each action and dialog choice a dynamic part to the story. Players will create their heroes just as they would in a pen-and-paper game by choosing their race, class, personality and rolling for their stats.​ You make the choices, dice decide your destiny. Key Features: An Epic Team Adventure Discover the shattered world of Solasta: explore ruins and dungeons for legendary treasures, learn the truth of an age-old cataclysm - and stop it from happening again. Create your very own party of adventurers with our Character Creation Tool in the classic tabletop RPG tradition. Breathe life into your heroes, and see their personalities reflected in their dialogue. Tailor your squad to your preferred strategy and maximize your party's abilities. The choice is yours. Discover a Mysterious &amp; Dynamic World Delve into long forgotten dungeons to unearth ancient artifacts, but stay watchful of light and darkness: many dangers hide in the dark, but a light can attract monsters. Some enemies have darkvision, some may flee from your torch... Successful adventurers will learn to use it to their advantage. Fight monsters in squad-level, turn-based, tactical combat. Solasta's dynamic environment offers some interesting tactical options. Bridges can collapse, leaving enemies stranded and vulnerable. Walls and columns can be pushed over - on top of your foes, if you do it right. The world is your playground. Prepare to Think in Three Dimensions The dungeons in Solasta are more than flat game-boards. Climb, jump, or fly around obstacles. Evade or surprise foes from above or below. Push them into chasms or drop things on their heads. Position yourself on high grounds to start the fight with an advantage. Size also matters. Escape through narrow passages where bigger enemies won't fit and crawl through tunnels to find secret areas. Take advantage of the environment to find cover suited to your own size. Watch out, though - the monsters are also thinking vertically. Dungeon Maker In Solasta, the adventure does not stop after the campaign is over. Unleash your creativity and craft your own dungeons to play and share with friends with the snap of a finger using the in-game Dungeon Maker! From the room layout, monster composition and treasure the party will find – down to the decoration and lighting of each room or the music track playing – everything is decided by you. Note that the Dungeon Maker is a work in progress and will keep being improved as time goes by, so look forward to more Dungeon Maker features in the future! Solasta Free Content Update with the release of Primal Calling To celebrate the release of the Primal Calling DLC, we're releasing a free content update for all our players - including a much anticipated higher level cap! Level cap increased from level 10 to level 12, unlocking new class features as well as level 6 spells Scars and Facial Paints customization options in character creation Tired of playing through the tutorial? You can now skip it! Rebalanced (harder!) fight at the end of the campaign - prepare for a challenge! New Town Exterior &amp; Town Interior Environments for the Dungeon Maker New Campaign Creator Feature, allowing custom dungeons to be bundled together into a campaign with custom monsters, custom NPCs &amp; merchants and custom items! /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1096530/header.jpg?t=1650563049",
    "Price": 15.99,
    "Developers": "Tactical Adventures",
    "Publishers": "Tactical Adventures",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1096530/ss_34aa096640c07f9081de758a566d7c3dedaaae08.1920x1080.jpg?t=1650563049,https://cdn.akamai.steamstatic.com/steam/apps/1096530/ss_87c2ce426073e4846ea92a7a5b441d158d3961df.1920x1080.jpg?t=1650563049,https://cdn.akamai.steamstatic.com/steam/apps/1096530/ss_e576236ea0ffd8f13e8750f0757bd77c12622bca.1920x1080.jpg?t=1650563049,https://cdn.akamai.steamstatic.com/steam/apps/1096530/ss_d3bbee08b66899caf2a8f3517e77676a146101fe.1920x1080.jpg?t=1650563049,https://cdn.akamai.steamstatic.com/steam/apps/1096530/ss_9717da90481003724e7e2fe95d0774cabfa18372.1920x1080.jpg?t=1650563049",
    "Slug": "solasta-crown-of-the-magister",
    "Meta Title": "Solasta: Crown of the Magister: May 27, 2021, Tactical Ad...",
    "Meta Description": "Looking for information on Solasta: Crown of the Magister? Check out the release date (May 27, 2021), developer insights from Tactical Adventures, and a...",
    "Alt Text Image": "Official header image for Solasta: Crown of the Magister game - Steam 1096530",
    "Canonical URL": "https://gusku.site/game/solasta-crown-of-the-magister",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solasta: Crown of the Magister\", \"description\": \"Looking for information on Solasta: Crown of the Magister? Check out the release date (May 27, 2021), developer insights from Tactical Adventures, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tactical Adventures\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tactical Adventures\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1096530/header.jpg?t=1650563049\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}