{
    "AppID": 1929460,
    "Name": "SOOT",
    "Release date": "May 27, 2022",
    "About the game": "The world has lost its balance and a great danger looms humanity with the impending destruction of a cataclysmic event. The only hope resides in the technology to terraform the planet and reinstate the right conditions to avoid the tragedy. The technology has been lost to the ages, mysticism, and superstition have taken over; but the key to the secret of terraforming lies in the hands of Laura McKenzie, a brave scientist determined to save her homeworld at all costs, and the ancient encoded manuscript that reached her hands in a fateful hour. In SOOT the player takes control of that scientist learning about terraforming through a strategy simulation game with a delicate system of balances and counterbalances and a thrill-filled story with more than one secret about the world and the nature of the coming doom. Each level of SOOT is a different planet, with specific conditions and a particular set of objectives. An ancient journal falls into the hands of scientist Laura MacKenzie, with it she relives the experiences of Captain Cristopher Mason and uncovers the secrets of The Federation, a powerful and forgotten space-faring civilization that used advanced technology to terraform planets. SOOT features a dramatic story filled with mysteries, conflicting interests, and a complex political agenda, all while struggling with the technological challenges of two eras clashing through the pages of the journal. Experience SOOT's story through interactive comic books and in-level dialogs. SOOT features 17 different planets, over 20 structures, and 14 interactive comic book scenes, all of them developed with special care and attention to detail. With a unique steampunk aesthetic, complex 3D modelling, and detailed illustrations, each moment in SOOT is a beauty to behold. Deep thought provoking gameplay that promotes problem solving with a complex simulation system. Level-based progression that challenges the player along the story. Narrative driven with an engaging story presented through gameplay and interactive comic books. Stylized take on the sci-fi genre with a detail-rich Steampunk aesthetic. Mature discussion about how humanity influences the environment through technology.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1929460/header.jpg?t=1655105259",
    "Price": 19.99,
    "Developers": "Ceiba Software and Arts",
    "Publishers": "Badland Publishing,Micropsia Games SpA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1929460/ss_9f56a7987ceffd2419e6a8152e63b6f6639e547a.1920x1080.jpg?t=1655105259,https://cdn.akamai.steamstatic.com/steam/apps/1929460/ss_7a284109f735ba9059183c82a585d4dd0a550234.1920x1080.jpg?t=1655105259,https://cdn.akamai.steamstatic.com/steam/apps/1929460/ss_420a4b7c9882680f2a0a9aaec5edc9a69c084449.1920x1080.jpg?t=1655105259,https://cdn.akamai.steamstatic.com/steam/apps/1929460/ss_0a7f5c2feb6734c2f51c0c956145c08f01855ead.1920x1080.jpg?t=1655105259,https://cdn.akamai.steamstatic.com/steam/apps/1929460/ss_a4bce0c5623ef6ea9ba4863b9a07fd9387f03fc8.1920x1080.jpg?t=1655105259",
    "Slug": "soot",
    "Meta Title": "SOOT: May 27, 2022, Ceiba Software and Arts and Full Over...",
    "Meta Description": "Looking for information on SOOT? Check out the release date (May 27, 2022), developer insights from Ceiba Software and Arts, and a complete game summary.",
    "Alt Text Image": "Official header image for SOOT game - Steam 1929460",
    "Canonical URL": "https://gusku.site/game/soot",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SOOT\", \"description\": \"Looking for information on SOOT? Check out the release date (May 27, 2022), developer insights from Ceiba Software and Arts, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ceiba Software and Arts\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Badland Publishing,Micropsia Games SpA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1929460/header.jpg?t=1655105259\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}