{
    "AppID": 548080,
    "Name": "Space Merchants: Arena",
    "Release date": "Nov 4, 2016",
    "About the game": "2021 UPDATE *** We are currently working on a new update for the VR and AR versions of the game. :) VR will bring full touch controllers support for flying, AR support for Tilt Five (TM). The update should be released in december 2021, stay tuned! :-) *** Space Merchants: Arena is a cross-platform online multiplayer game where futuristic spaceships engage in intense dogfights or tactical play. 3 game modes: Free for all / Team battle (red vs blue) / Capture the Artefact. 4 different maps: Faarlands, Tristar, Jupiter, Naussike system. Platform and global leaderboards. 22 Steam Achievements. 6 Steam Trading Cards. The Story The year is 2510. Time of exploration and colonisation of new planets, bringing chance for new life for many people. Humanity entered the second half of the millennium with hope to end long-lasting conflict between federal Army of Seven Stars and pirates of Black Flags fraction. In the last decades both sides suffered terrible losses in mutual fights and now the Black Flags members are scattered in the outer parts of the galaxy. We will yet lose many lives, colonies and planets before the war will be over. Join the heroes of Army of Seven Stars and become a respected legend among your peers. Detailed game description After each battle player gains experience (to increase his/her skills and stats) and money (to buy and upgrade ships and equipment). Player can play against opponents on all platforms. Best players are shown in leaderboards and their glory persists to the end of days (obviously ;-)). [Game modes] 1) Battle - Free for all, 2-10 players, kill and avoid to be killed. 2) Team Battle - Blue vs Red team, 1 vs 1 to 5 vs 5. - Faarlands map - Teams gain points just for killing opponents. - Tristar map - There is a central 'mining' place where your team can gain a point for each 15 seconds you survive there. - Jupiter map - Capture the Artefact mode, steal your opponents' artefact and deliver it to your base. 3) Training - Training arena, player vs AI player (bot). Experience and money gains are lower than in normal play against human opponents. [Bonuses] Red bonus adds temporary damage (till the end of the battle). Green bonus repairs your armor. Blue bonus adds experience. Yellow bonus adds money. [Ship's Artificial Intelligence Skills] Each skill increases automatically when used. E.g. when aiming at enemy Accuracy skill increases, when collecting bonuses bonus gain effect increases. [Special techniques] Turrets in game maps can be hacked using Turrets communicator tool obtainable from the shop. Hacked turrets will fight for you and destroy your opponents. You can also hack you enemy using Hacker Tools. If the hack is successful (depends on your enemy's AI Firewall skill) he will lose control of movement and firing. [Achievements (23 total)] For everything the player does in the game he/she gains points to achievements table. There is also special everyday reward (experience and money) when starting the game. [Reward points (RP)] For Team Battle victory each player of the winning team receives one Reward Point. Additional Reward Points are given to Best player (most kills) and Best assistant (most assists). Player can exchange Reward Points for special rewards such as Upgrade Tools or in Outpost minigame (see below). [Items Upgrading] Player can use Upgrade Tools to improve existing weapons, shields or armors. [Outpost minigame] Player can build and upgrade his/her outpost which can then be attacked by other players. Player can also choose to crush enemy's outpost (chosen randomly). Winning player is awarded with Reward Points. [Export/Import function] This function enables player to move his/her game profile from existing device to other device or even different platform. Export will save current game profile on our server and wipe it completely on current device. The player will receive secure PIN for import operation. Import will load game profile from our server and overwrite current profile on the device. This is one-time operation, can not be performed with the same PIN second time. [Languages] Player can choose preferred language using Main menu, Settings, Languages. Player can choose from English, Russian, Czech and Slovak at the moment. Privacy policy:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/548080/header.jpg?t=1639512990",
    "Price": 6.99,
    "Developers": "Playito.com",
    "Publishers": "Playito.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_8cc109f036465cefe80d7ae6740a220849e5c1f0.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_7e58bfadee4c73e129ececbfe390b322ec5f7e9c.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_6642e5c85124fc98b5a1ff37e2467a333193537b.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_598b0a0b3c80117e66475e0d59600d0e0fac2bbb.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_e757bece461435074c02dbae4b8b182f240980c3.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_f31826088b36ba786cc0064e5c4d07650b59550f.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_0ffd234e1b6e6187dfcc1a461eeb8e5bdee44fc2.1920x1080.jpg?t=1639512990,https://cdn.akamai.steamstatic.com/steam/apps/548080/ss_36243093a62b6b3ba5300cfdef6434afcad66f12.1920x1080.jpg?t=1639512990",
    "Slug": "space-merchants-arena",
    "Meta Title": "Space Merchants: Arena: Nov 4, 2016, Playito.com and Full...",
    "Meta Description": "Looking for information on Space Merchants: Arena? Check out the release date (Nov 4, 2016), developer insights from Playito.com, and a complete game su...",
    "Alt Text Image": "Official header image for Space Merchants: Arena game - Steam 548080",
    "Canonical URL": "https://gusku.site/game/space-merchants-arena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Merchants: Arena\", \"description\": \"Looking for information on Space Merchants: Arena? Check out the release date (Nov 4, 2016), developer insights from Playito.com, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Playito.com\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Playito.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/548080/header.jpg?t=1639512990\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}