{
    "AppID": 1214640,
    "Name": "StellarX",
    "Release date": "Jan 24, 2020",
    "About the game": "StellarX is a collaborative sandbox that empowers anyone to create their own environments and simulations in AR, VR, and MR. No coding skills required; it’s easy as 1, 2, 3! 1. Build up your Space Choose from one of our thematic template Spaces or kick off with an Empty Space that you can personalize with assets from your personal collection. It’s your Space to enjoy your way, so make it your own. 2. Build your experience Using our visual scripting tool, design an immersive experience... without code. Just open up the Scenario Canvas, map out your idea with interactive and editable Nodes, and connect your components to virtually bring any interactions to life. 3. Build up your team Share your Space with friends and colleagues as you enjoy real-time collaboration, creation, and play! Tackle a complex design problem together, onboard a new employee with safe, hands-on training, or challenge your team with life-like simulations and authentic learning situations. Features: - Easily bring your wildest ideas to life with our drag-and-drop functionalities—no fuss, no code, no problem! StellarX is designed with natural interactions in mind: Grab and place, point and press, set it and forget it — enjoy! - Use a thematic template Space or start from scratch in an Empty Space. Edit terrain and spruce up your Space with StellarX Asset Collections or upload your own so you feel right at home. - Author the mood with spatial audio, play with Toys and Tools inside your Space, experiment with the laws of physics, or even trigger complex mechanics; with editable asset properties, there’s no telling what you’ll discover! - Play animations, create realistic simulations, replicate authentic situations, and training scenarios in VR with the Scenario-building Canvas and Nodes. Mapping out an immersive experience has never been this easy. - 24/7 support from our awesome and caring Customer Support Team! For questions, comments, or to flag any issues, contact us any time via email. - Full access to our online user guide. - Stay up to date with the latest software updates. StellarX Professional StellarX Professional empowers businesses to easily apply and deploy immersive technologies. With the Professional Plan, you can: - Send copies of your Spaces to friends and colleagues - Join sessions in Play Mode to collaborate with others - Use the Web Panel to access your favorite media and browse the web in immersion Princing : $19.50 +tx/month or $210.60 +tx/year save 10%! StellarX Enterprise StellarX Enterprise allows large businesses to easily apply and deploy immersive technologies at scale. With the Enterprise Plan, you can: - Create and share Spaces with your team or clients - Gain unlimited access to the StellarX Masterclass Fundamentals class to fine-tune your experiences and skills - Contact your dedicated team of experts to get the results you want Pricing : Contact us Thanks for joining our growing community! Welcome to our community of artists, geeks, gamers, players, and creators of all sorts! If ever you have a question, comment to share, or a feature suggestion, please feel free to get in touch via email. We’re all ears and we’re all here to help. Our team wants nothing more than for you to enjoy StellarX as you Create and Play in VR. While you’re at it, be sure to leave us a review so that we can work towards improving our platform for you. Again, welcome to our #STXCrew. We look forward to hearing back from you! Cheers, -The StellarX Crew ✨ StellarX was put forward with help from the Canada Media Fund (CMF)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1214640/header.jpg?t=1651009147",
    "Price": 0.0,
    "Developers": "OVA",
    "Publishers": "OVA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_2bb4e3b303a9f995c76ff87f32e538debf9f7d4f.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_a11ceb369cdf03295d3e418d695e86b98109350b.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_f8246f9e24e9274a50c87a0975e2080d94a6f316.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_b591657161d7ff0d1872e93c127296357366cd1e.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_793641e2b1324dd2163dca2f3cb2b5311c6d2a43.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_ad50a0ad559b015304d468fead210d7cba2ce40c.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_3406355941377a1b7d3d1ce3ed2a3d2a4eb14454.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_a1caaab16ca6a8c37856ee6547f878bc9a2ddf6a.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_8291c8455ec157b276aa0c010459235205cdb542.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_6ca139205ed4cab0f71d6c2a9a35ab945c2beb97.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_f0468b7554f0bf749347db4c323e05976de97d7e.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_e9847b12602498d7477e1f50c5e0a479eed717f8.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_1617271971ac426b4c0a5dea5f3dbbb989e2a478.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_b26775b4faa1a8104a1cd3236a39d83b9bcc48d0.1920x1080.jpg?t=1651009147,https://cdn.akamai.steamstatic.com/steam/apps/1214640/ss_c24e6a1db7184f217d6780b2fdc6ba75dc943572.1920x1080.jpg?t=1651009147",
    "Slug": "stellarx",
    "Meta Title": "StellarX: Jan 24, 2020, OVA and Full Overview",
    "Meta Description": "Looking for information on StellarX? Check out the release date (Jan 24, 2020), developer insights from OVA, and a complete game summary.",
    "Alt Text Image": "Official header image for StellarX game - Steam 1214640",
    "Canonical URL": "https://gusku.site/game/stellarx",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"StellarX\", \"description\": \"Looking for information on StellarX? Check out the release date (Jan 24, 2020), developer insights from OVA, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"OVA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OVA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1214640/header.jpg?t=1651009147\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}