{
    "AppID": 1430030,
    "Name": "THE MONSTER OF MEMORY:DESTINY",
    "Release date": "Nov 27, 2020",
    "About the game": "Winning the 8th Golden Manga Award in Taiwan, Visual novel 'THE MONSTER OF MEMORY:DESTINY' has been adapted from the manga of the same name! ●featuring 16 full-colour CGs from the original manga to retain the original flavour, and a total of more than 700 images including costumes, poses and expressions of eight unique characters ●All roles fully voiced in Chinese by a local professional team ●Written by 'Purple Day', a well-known light novel author ●In addition to the manga being completely represented in the form of a visual novel, three new plots and memories have been added Game type description AVG games, also known as 'visual novels' in the West, use text descriptions and character illustrations, full-page illustrations, music, audio, and sound effects to present the story. Players use mouse clicks to advance the story and are given different options to make different decisions for the characters in the story, leading to different endings. Memory... Does it represent all a person has? A railway accident changed Sumi's life... Aiming to be like his brother, Haru, he applied to a special agency for intelligent creatures ── RE614. What kind of impact will this creature, with the same appearance as his brother, give to Sumi? Character introduction Note: All naked characters in this game are adults. This game contains descriptions of gay men. Haru The elder brother of the protagonist, Sumi. His talent for soccer can be considered genius-level. After his father died, he was very demanding of himself and cared greatly for his brother. Trying to be independent, he tries his best not to worry his family. Sumi The protagonist. He greatly admires his brother, Haru. For catching Haru’s notice, he practices soccer very hard. Usually quite easygoing, he loses all control when he hears someone speaking something bad of Haru. Nao Sumi's teammate in the Soccer Club. For some reasons, he considers Sumi as his rival. He is always outspoken and brings troubles upon Sumi no matter the situation. Natsu Sumi's classmate. Very close to Sumi. Having a gentle personality, he often gives Sumi good ideas and is also a teammate in the Soccer Club. Mom Sumi and Haru's mother. Since the death of her husband, she has taken the responsibility of the family's finance alone. With tough working hours, she is often not at home but still takes care of the brothers well. Miru Haru's ex-girlfriend. She gives the image of a gentle and good girl, liking to observe the players through scientific data. Researcher A researcher, giving off a mature and trustworthy image, is in charge of the RE614 project. As such, is responsible for answering questions related to RE614. Izumi A junior of Haru. Soccer is the only thing in his brain. Extremely straightforward, he is easily influenced by others.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1430030/header.jpg?t=1606474798",
    "Price": 18.99,
    "Developers": "Narrator,Tong Li Publishing Co.",
    "Publishers": "Tong Li Publishing Co.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_614eddfe310d7b74cd08a5ab7c38483261fbf77f.1920x1080.jpg?t=1606474798,https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_e810dce499e84ff2c492021040d4c04bd348b8fa.1920x1080.jpg?t=1606474798,https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_7f8acf6fc3dedd9e4d7d3d839c51f2465b8e162c.1920x1080.jpg?t=1606474798,https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_ff58bf975a648320b4bdc8515d556f94ac8b4155.1920x1080.jpg?t=1606474798,https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_4986425cc12f2210999b6ffb6c9064c6eb70e4f1.1920x1080.jpg?t=1606474798,https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_1a5256fd30b031e19853d148e8b3b01175ecee3f.1920x1080.jpg?t=1606474798,https://cdn.akamai.steamstatic.com/steam/apps/1430030/ss_6eee42b79fb00b2eb24d22691468fa744b880eea.1920x1080.jpg?t=1606474798",
    "Slug": "the-monster-of-memory-destiny",
    "Meta Title": "THE MONSTER OF MEMORY:DESTINY: Nov 27, 2020, Narrator,Ton...",
    "Meta Description": "Looking for information on THE MONSTER OF MEMORY:DESTINY? Check out the release date (Nov 27, 2020), developer insights from Narrator,Tong Li Publishing...",
    "Alt Text Image": "Official header image for THE MONSTER OF MEMORY:DESTINY game - Steam 1430030",
    "Canonical URL": "https://gusku.site/game/the-monster-of-memory-destiny",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"THE MONSTER OF MEMORY:DESTINY\", \"description\": \"Looking for information on THE MONSTER OF MEMORY:DESTINY? Check out the release date (Nov 27, 2020), developer insights from Narrator,Tong Li Publishing...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Narrator,Tong Li Publishing Co.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tong Li Publishing Co.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1430030/header.jpg?t=1606474798\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}