{
    "AppID": 1944000,
    "Name": "THE DREADFUL SPACE",
    "Release date": "Apr 30, 2022",
    "About the game": "A very action space war game, the mission is to fight the ships from other planets, the game requires a lot of skill to get rid of enemy shots and counterattack with all the cool features you can get in the game. The combat is intense and very agile, confronting your skills as a Battleship player. The player has the mission to protect the planet Earth against enemy ships, you will destroy many ships, your war will be intense and full of danger and with a lot of emotion. Make your ship very powerful with resources acquired in space when you destroy ships with technologies. Steal their technologies, increase your combat power and complete the most dangerous mission ever sent to a pilot. Enemy ships are dangerous, you will have to have a lot of skill to dodge the shots, it's a very challenging war adventure. use your bombs use your missiles Shoot the Will DESTROY ALL! GAME FEATURES • Game Action - The game contains intense space warfare action, it is very explosive and strategic, with wisdom for the player to use their items and evolve their ship with technology from other planets. • Gameplay – The game contains dynamics of precise and fast movements to accompany the pilot's agility, with a shooting scheme that the player does not need to release the button to shoot or use as he sees fit to attack enemies, a gameplay with accurate and compatible controls. • Your Weapons – The ship's asthma can absorb the technologies of the ships destroyed in space and manage to increase its power, it has several types of weapons that you can acquire during the game, one of them that is very cool, are the guided missiles. • Destruction - Destroying enemy ships is something pleasant, with a feeling of victory with each achievement, defeating the masters of the stage is difficult and requires a good skill for the player, but with your weapons and resources your mission is fine. • The Planet - Your planet needs you very much, if you let the ships from other planets reach planet Earth, your mission will fail and they will chase you even in your dreams until you play again and destroy them all. • Achievements – STEAM achievements are well earned for each specific stage and mission, earn them all by being a good Pilot, the game contains 14 specific achievements. • Graphics – The game has very beautiful and eye-pleasing graphics, with minimalist details, the player will enter a whole new universe and very full of battles. Do your best and make your score the best you can.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1944000/header.jpg?t=1651882988",
    "Price": 0.99,
    "Developers": "Caztellary Studio",
    "Publishers": "Caztellary Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_6d0dea4e0778cf3f7ccc0efeb4663a7c797865f8.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_99ba47a904398e2ce108d01f69f2605047dc583e.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_630c28fc5dad156e3dc315df2ba46406b9b7509e.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_3838150c20ac7774dcb8dfa23da9ac05d1bc202d.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_238b532ac19eadd355ec7e3cc5531ed5b505249e.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_5182b342d77a701566b404254c0067251af37457.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_a65505859041e53f474dc19ac3b23f81b7626da0.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_68666102bad3166be85dbfe2c9bb85ca637747c4.1920x1080.jpg?t=1651882988,https://cdn.akamai.steamstatic.com/steam/apps/1944000/ss_ee76caf9f991b5d29308d50aa4f7ce9e25e3c851.1920x1080.jpg?t=1651882988",
    "Slug": "the-dreadful-space",
    "Meta Title": "THE DREADFUL SPACE: Apr 30, 2022, Caztellary Studio and F...",
    "Meta Description": "Looking for information on THE DREADFUL SPACE? Check out the release date (Apr 30, 2022), developer insights from Caztellary Studio, and a complete game...",
    "Alt Text Image": "Official header image for THE DREADFUL SPACE game - Steam 1944000",
    "Canonical URL": "https://gusku.site/game/the-dreadful-space",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"THE DREADFUL SPACE\", \"description\": \"Looking for information on THE DREADFUL SPACE? Check out the release date (Apr 30, 2022), developer insights from Caztellary Studio, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Caztellary Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Caztellary Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1944000/header.jpg?t=1651882988\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}