{
    "AppID": 751500,
    "Name": "TINY METAL",
    "Release date": "Dec 21, 2017",
    "About the game": "It's WAR in TINY METAL, the revival of Japanese arcade war gaming! The golden age of turn-based tactics returns with a distinct Japanese flavor. A story filled with political intrigue and personal conflict follows the assassination of the Artemesian king. Command your infantry, roll out the tanks, and take to the skies to exact swift retribution against your foes. Artemesia is awaiting your orders! Inspired by turn-based strategy games of the past, TINY METAL takes the finely honed gameplay of classical Japanese war gaming and brings it into the modern era with great graphics, 15 unique units, and never-before-seen gameplay mechanics. TINY METAL is the Japanese arcade war game you wish you had as a kid. Play as Artemisian Lieutenant Nathan Gries as he commands his units to victory against the villainous nation of Zipang. There will be several friends and enemies along the way with varied factions, units, and abilities in the 20 hours of single-player campaign gameplay. Players will have to carefully consider varying terrain, positioning for attacks, and strategic advancements and defenses. Nathan Gries Lieutenant Nathan Gries hails from a family of military lineage. His father died in the last war when Nathan was still young. Col. Lindberg was a friend of Nathan's father and came to offer guidance to Nathan. Nathan is well-regarded by his superiors and peers alike with a promising future and noble intentions... Although Nathan is a model officer, his lack of experience may lead to situations where he could be exploited. Wolfram Commander Wolfram, a fierce, strategic, independent, business-minded soldier, and leader of the White Fangs. She lost her brother in the previous Artemisia/Zipang war. He fought, foolishly, for a nation that cared little for him. Which is irrelevant. He died believing he was fighting for a greater cause. She vowed never to make the same mistake. Wolfram will take any job that is profitable but one never knows what she might have up her sleeve... Isoroku Tsukumo Lord Isoroku Tsukumo ('of 3 million stones'), the leading vassal of the Zipang shogunate. His title is a measure of his greatness, how much he owns, and how many people he supports with his rule. Tsukumo has an extreme obligation to duty and honor. He takes care of his people first and foremost but is always strict and lawful, especially to himself. Campaign mode Follow the gripping story of Nathan and his unit as they struggle with the war and question what is -- and what isn't -- worth fighting for in a 20-hour campaign full of unique characters of various factions. Unique Attack System Use careful planning and strategy to attack from positions behind and beside to inflict more damage, or Focus Fire attacks with multiple units to crush your enemies! Online Multiplayer Soon-to-be-added online mode will test you against other players in 1-on-1 matches online or via local play! Skirmish Matches Jump straight into the action with dozens of skirmish matches that challenge the player with fun scenarios against a variety of foes. Units Take control of 15 unique units, from basic Riflemen to advanced Gunships and Metals, each with their own strengths and weakness. Witness your units get stronger as they gain experience on the battlefield. Terrain Different terrain types offer various bonuses, rewarding players who take advantage of the forest, cities, and factories scattered around the maps. Some terrain even give players access to new units and powerful hero units! Hero Units Powerful units that can be called into battle. Hero units grow stronger over the course of the campaign and can be brought over from mission to mission. Music Bop along to the beats of TINY METAL's upbeat soundtrack composed by the Japanese prodigy Tomoki Miyoshi, whose past works include SOULCALIBUR V, Steins;Gate, and I am Setsuna.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/751500/header.jpg?t=1578462858",
    "Price": 24.99,
    "Developers": "AREA 35, Inc.",
    "Publishers": "Sony Music Entertainment (Japan) Inc. / UNTIES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_34005a7e3c3560a9eaab2b2379ed9b86042507fc.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_ba66bcb235ea9e0af7277e7d2bb91e58740b4679.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_3064895122301ef099a1a77079ae14a1263e1965.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_873344695008451d2db21d35bb31d00e5af078a1.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_48bb458263a4455c17d8c1f704b015724ca99a32.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_f08a6f5e68b5ea05d4ae75be2fb640a178da2a98.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_c8c9e1b116fac37705c6c1512e758e5c7e3960b0.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_117478506de8ef921db31f2751746cb764702116.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_216055435a6a28570c788baea2e0a398662a0622.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_653c2901c62a865331717d9de070f7b403956179.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_18e1d73e5e94c55f7e4ea93d9474b18329f4ba36.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_bfb81c5b590d9b347bff5c0ee3254476c177eef5.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_bb3e18a664c4f5286b701c8ca4fd6f93cf59a56d.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_38602632342453805befe8baf84b1ddf8fa9cbc6.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_89deaf935ce2c6b6daf3338f38ec236483b37576.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_96ea71a43aba5c86c19cfa0b9dcc3b2d03ecbac8.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_0d95de17f41f2e006fdc0b4193fd6d386c67d464.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_d808c0010711dd4b263cb25e157b9ede7efc26c7.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_847709277b96b2f189a572ef2c8a7a17f729f1a8.1920x1080.jpg?t=1578462858,https://cdn.akamai.steamstatic.com/steam/apps/751500/ss_0ecb86fd596af4deb86cf34684db3da1a4b57fa6.1920x1080.jpg?t=1578462858",
    "Slug": "tiny-metal",
    "Meta Title": "TINY METAL: Dec 21, 2017, AREA 35, Inc. and Full Overview",
    "Meta Description": "Looking for information on TINY METAL? Check out the release date (Dec 21, 2017), developer insights from AREA 35, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for TINY METAL game - Steam 751500",
    "Canonical URL": "https://gusku.site/game/tiny-metal",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TINY METAL\", \"description\": \"Looking for information on TINY METAL? Check out the release date (Dec 21, 2017), developer insights from AREA 35, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"AREA 35, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sony Music Entertainment (Japan) Inc. / UNTIES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/751500/header.jpg?t=1578462858\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}