{
    "AppID": 1504630,
    "Name": "Zero-G Revolution",
    "Release date": "Feb 18, 2021",
    "About the game": "Adventure Content in a spaceship for VR ※This game supports only 'VR' game mode. ※This game runs with only VR Gear 1 of those for now, Oculus Rift, Oculus Quest 2, Vive Cosmos, Vive Cosmos Elite. Synopsis : Find, Solve, Escape. In the near future, you're taking place on the spaceship. One day, critical problem on the operation system by anonymous virus. It destroys your spaceship in a hurry. We need to figure out how to fix these emergency situations and try to escape from here. Key Features : Time trial Adventure We should solve various problems in limited time. Find hints and clues near you. The Blue sign will help your target. Also, guide navigation system will help you which is on your 'Left Wrist'. Zero-gravity Basically, the spaceship is in zero-gravity environment. Objects will be glide and rotation freely like those are in the zero-gravity condition. Absolutely you will be the same. Therefore, you would feel your movement would be pretty hard at the moment. Here's a tip. You can 'Grab' the every object such as furniture, wall, machine what near your hands. You could glide in the air when you pull and release the object like you're in the 'Zero-Gravity environment'. You can explore where you want to go in the spaceship and even out of the spaceship! Plus, Press 'X', 'A' button to use hand booster for easy movement. Emergency Situations The spaceship consist of rooms such as Engine Room, Control Room, Escape Room, Laboratory Room, Navigation Room. The operation virus destroys each room and make a emergency situations. You will encounter these emergency situations as Fire, Gas, System Shock, Lack of Oxygen, etc. Try to fix those with tools and clues near you. Various Puzzles You will encounter sort of puzzle contents on your journey. Especially, puzzle could be the one of the clue when the emergency situation. Connect lazer lines or make specific shapes on the board. Try to interact puzzle objects and tools near you then you'll find how it works. These are one of the clue which's you can escape some the situations. Puzzle object are working with your 'Grab', 'Trigger' buttons on your VR controller.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1504630/header.jpg?t=1613705706",
    "Price": 0.0,
    "Developers": "YZPocket",
    "Publishers": "YZPocket",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1504630/ss_36944b3c9a89cf7f8b4787a0783156bc0261afa3.1920x1080.jpg?t=1613705706,https://cdn.akamai.steamstatic.com/steam/apps/1504630/ss_104918aed4fb179d335793a00873b5bbec4a98ac.1920x1080.jpg?t=1613705706,https://cdn.akamai.steamstatic.com/steam/apps/1504630/ss_83523dce659b0aea4334064166c2bede5489d0c0.1920x1080.jpg?t=1613705706,https://cdn.akamai.steamstatic.com/steam/apps/1504630/ss_534ce2d1f44546f7d9f2088af3b55a349b9024fd.1920x1080.jpg?t=1613705706,https://cdn.akamai.steamstatic.com/steam/apps/1504630/ss_426486e3e0172469418b2be480408ffb66a9922c.1920x1080.jpg?t=1613705706",
    "Slug": "zero-g-revolution",
    "Meta Title": "Zero-G Revolution: Feb 18, 2021, YZPocket and Full Overview",
    "Meta Description": "Looking for information on Zero-G Revolution? Check out the release date (Feb 18, 2021), developer insights from YZPocket, and a complete game summary.",
    "Alt Text Image": "Official header image for Zero-G Revolution game - Steam 1504630",
    "Canonical URL": "https://gusku.site/game/zero-g-revolution",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zero-G Revolution\", \"description\": \"Looking for information on Zero-G Revolution? Check out the release date (Feb 18, 2021), developer insights from YZPocket, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"YZPocket\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YZPocket\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1504630/header.jpg?t=1613705706\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}