{
    "AppID": 1014360,
    "Name": "Adventures Diary of Merchant",
    "Release date": "Mar 26, 2020",
    "About the game": "Discord You are aiming to defeat the Grand Devil as your home was once destroyed by him. However, you have nothing except for the way to operate the business from your parents, who were both businessmen. You need to earn coins to recruit excellent adventurers for assistance. You can process agricultural products and raw materials into feed, cloth, herb mud, etc., and then process into more advanced materials to manufacture and enhance weapons and equipment. Reasonably organize the production chain to earn more in the shortest possible time. Adventurers with varied professions and skills can be recruited. Manufacture enhanced equipment or taking booster to promote the adventurers. You can purchase land, grow vegetables, herbs, apple trees, forage grass, cotton, raise alpacas, cows, chickens, and silkworms, and build Synthetic Workshops and Alchemy Workshops. You can process the produced agricultural products into advanced materials to make feed, cloth, cuisine, booster, equipment, etc. You can sell these raw materials at the market in Monarch City, where you may also purchase some animal cubs for breeding or raw materials for processing. Shops, you may build a shop once the fundamental production chain is built. Boosters, cuisine, and other goods can be sold here to adventurers. Along with the upgrade of the shop, the recruitment of adventurers with manager professions will maximize the profit of the shop. Rental, you can build and rent the adventurer's cabin to other adventurers in the village, through which you can not only earning the rental but also increase the visitor volume. Recruit adventurers. You may recruit adventurers when you have saved some coins. Each adventurer has a former profession. Therefore, they can be assigned to factories or combat with the Grand Devil accordingly. Adventurers are divided into the defending, attacking, and recovering systems, of which specific skills at different levels are equipped with each system. The adventurers with high professional skills can be selected through repeated recruitment to assist in product processing, while those adventurers with a large number of skills and high levels can be recruited to adventure. The adventurer's skills are equipped randomly. It might be 6 combos +6 crits +6 splashes, or it may be nothing at all. However, you can recruit a lot of them as long as you have coins, which highlights the importance of organizing the production line properly. Equipment manufacturing, enhancement, and the education of adventurers. You may enhance equipment, take boosters to increase the attributes of adventurers permanently to break through the bottleneck during the adventure. Collection of Treasures: During the adventure, you will have the chance to collect all kinds of treasures. Put these treasures into the Treasure Manual to stock its magic power. The Treasure Manual will award you for doing that.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1014360/header.jpg?t=1610375182",
    "Price": 7.99,
    "Developers": "Superluminal Cat",
    "Publishers": "Superluminal Cat",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_1d6b178dac88f408bcc009a5191717e049be05c6.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_b010a0bcb05bef7f8edb3d7b5a402969c44b834d.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_ce6f068d41a5dc92171b4d827bb31e5479d3305a.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_8e8cc1f23b8d3668312893097d78c29f3d580da7.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_317b2088a9f2c7157fc096bc5aed581962735d4b.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_6b18b7c77c2b79c1c86cb75cad344b6bbe83bd4e.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_52fd348ffec581f0b6db18bb5956f90941da79c2.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_e1ccd9506cac430b6d8738875cb681aa8601ecf3.1920x1080.jpg?t=1610375182,https://cdn.akamai.steamstatic.com/steam/apps/1014360/ss_5ee80b8a382f125ab95cf779274f6dcdb3ce2d28.1920x1080.jpg?t=1610375182",
    "Slug": "adventures-diary-of-merchant",
    "Meta Title": "Adventures Diary of Merchant: Mar 26, 2020, Superluminal ...",
    "Meta Description": "Looking for information on Adventures Diary of Merchant? Check out the release date (Mar 26, 2020), developer insights from Superluminal Cat, and a comp...",
    "Alt Text Image": "Official header image for Adventures Diary of Merchant game - Steam 1014360",
    "Canonical URL": "https://gusku.site/game/adventures-diary-of-merchant",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adventures Diary of Merchant\", \"description\": \"Looking for information on Adventures Diary of Merchant? Check out the release date (Mar 26, 2020), developer insights from Superluminal Cat, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Superluminal Cat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Superluminal Cat\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1014360/header.jpg?t=1610375182\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}