{
    "AppID": 818830,
    "Name": "Asteroid Deflector XL",
    "Release date": "Mar 23, 2018",
    "About the game": "Asteroid Deflector is an indie game based on simple physics. You have to prevent asteroids from hitting a planet by changing their trajectory with various projectiles (shells, laser beams, atomics...) while working with - or against - the gravity of the planet and the sun of this solar system. Whilde doing that, you have to take care of weapon research, the planets economy and population. This is my first game done in spare time. Expect some hours of fun and a good laugh at the goofy story. There is also an endless game mode to hunt for high scores. Please don't expect a refined, multimillion dollar blockbuster game. I'm always open to suggestions and improvements. Features - Career mode with 12 levels. - Endless mode. - 23 technologies for research, including four distinctive weapons and a mighty planetary force field. - Manage money, infrastructure, population and keep the people motivated. - Seven (YouTube friendly) spherical songs will help you get in the flow of deflecting asteroids. - Atmospheric sound effects. - Special endgame in story mode (maybe there is more to the asteroids...). Gameplay - Simple physics-based fun. - Don't destroy the asteroids (lame), deflect them! - Asteroids burning up in the star generate money (because... why not?). - Expensive research will improve your weapons. - Impacts on the planet will decimate the population and their moral (may result in losing the game). - After a first learning curve, the gameplay can get quite hypnotic or meditative. - Unlimited continues in career mode, saves are done after each level. - It's all about gravity, mass and kinetic energy - but in a fun way! FAQ * Are there costly ingame purchases or will there be expensive DLC? - No ingame purchases, it's the full game. * Is this a mobile port? - No, but I may port it to mobile (and remove some features in the base version with the 'XL' in the name, in case you were wondering). * A space cannon would never work!!! - First of all - it's just a game. And you may be up for a surprise, if you do some research on 'Project HARP'. Also keep in mind: the mass of planets differs a lot and so do escape velocities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/818830/header.jpg?t=1586414164",
    "Price": 2.99,
    "Developers": "Andreas Cavazzini",
    "Publishers": "Andreas Cavazzini",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/818830/ss_f007455458903f6291238244f912cab125ac0a01.1920x1080.jpg?t=1586414164,https://cdn.akamai.steamstatic.com/steam/apps/818830/ss_806c0f23ccc28154f1546304eeb3e490ca3440d2.1920x1080.jpg?t=1586414164,https://cdn.akamai.steamstatic.com/steam/apps/818830/ss_37d5464a397fc5f433ee45c9530b0024310de598.1920x1080.jpg?t=1586414164,https://cdn.akamai.steamstatic.com/steam/apps/818830/ss_3b117b05f983ffbe055cdfd603e7cc93a8bdc24c.1920x1080.jpg?t=1586414164,https://cdn.akamai.steamstatic.com/steam/apps/818830/ss_fa79abf71fd0ccc67e660fa80ed16af2c9a54ce6.1920x1080.jpg?t=1586414164",
    "Slug": "asteroid-deflector-xl",
    "Meta Title": "Asteroid Deflector XL: Mar 23, 2018, Andreas Cavazzini an...",
    "Meta Description": "Looking for information on Asteroid Deflector XL? Check out the release date (Mar 23, 2018), developer insights from Andreas Cavazzini, and a complete g...",
    "Alt Text Image": "Official header image for Asteroid Deflector XL game - Steam 818830",
    "Canonical URL": "https://gusku.site/game/asteroid-deflector-xl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Asteroid Deflector XL\", \"description\": \"Looking for information on Asteroid Deflector XL? Check out the release date (Mar 23, 2018), developer insights from Andreas Cavazzini, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Andreas Cavazzini\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Andreas Cavazzini\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/818830/header.jpg?t=1586414164\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}