{
    "AppID": 833740,
    "Name": "Aximion",
    "Release date": "Apr 27, 2018",
    "About the game": "Aximion is a prototype of future desktop and virtual reality user interface environment. Several UI concepts introduced in the Aximion to help users personalize and organize their environments. The Aximion rethinks the idea of the Desktop. In the Aximion Desktop is a place where different aspects of a single project/context/interest can be grouped into a single visual entity. For example, if you have some project you may want to gather all related files, links, remote and other resources in one place and organize them accordingly to your preferences. The Aximion Desktops look similar to regular desktops but contain special elements - Avatars. Each type of Avatar represents some aspect of your particular project/context/interest. Their important feature is to change their look accordingly to its importance for the user or to other needs and this look may vary from simple icons to mini-applications with rich functionality. The user can create as many desktops as he needs. Any application UI can be attached to another. For example, if a top-level UI element of application A is attached to a top-level UI element of application B then if a user opens B, A will show up automatically. The user then can create various application unions which reflect some corresponding contexts. For example, if the user is a software developer then he can create an individual desktop for each of his projects and also create several other desktops that would contain shared tools and resources required for all of his projects. Once any of these project desktops is open all attached desktops with shared tools will appear together with that. The Quick Area is used to place links to needed objects for the current session, much the same way tabs are used in browsers. Middle button click helps the user to place avatars in the form of a link to that area automatically. They do not disappear when the user closes the object so when needed the object is available for reopening. All avatars placed to the Head Area are always available for the user and always stay on top of other objects. Using VR gear this area acts as a Heads-up display, i.e., always in a field of view whenever a user’s head moves. History Area this is a history of user navigation. This function similar to browser history and together with Quick Area effectively replaces a standard Desktop Taskbar behaviour. The Events Area stands for showing events and progress reports, similar to the Windows system tray but with advanced functions. It can show simple notifications about events that require user attention. Also, any user-initiated long time operations should place representation items in this area, so the user has a continuous report about current time-consuming processes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/833740/header.jpg?t=1557095188",
    "Price": 0.0,
    "Developers": "Aximion Research Lab",
    "Publishers": "3d Molier",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_4b7edaa86e059a2506215562d09c7107b55e998f.1920x1080.jpg?t=1557095188,https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_87af5c63280ab0e6ee58c260424eedf86d9b4e45.1920x1080.jpg?t=1557095188,https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_8f57cebbfc3426d76cc302b78160beebf60c9cea.1920x1080.jpg?t=1557095188,https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_e197c8c54e995f9d6807e3b6687af92f22337319.1920x1080.jpg?t=1557095188,https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_d6efb8f293dd3678ab40f8e61914267a6830f849.1920x1080.jpg?t=1557095188,https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_d29c6a69583dcdb71e62f29a363f4ccceb4d4cd9.1920x1080.jpg?t=1557095188,https://cdn.akamai.steamstatic.com/steam/apps/833740/ss_1fcb9ad84f431702c85021b3bfeb1d02ee015b5b.1920x1080.jpg?t=1557095188",
    "Slug": "aximion",
    "Meta Title": "Aximion: Apr 27, 2018, Aximion Research Lab and Full Over...",
    "Meta Description": "Looking for information on Aximion? Check out the release date (Apr 27, 2018), developer insights from Aximion Research Lab, and a complete game summary.",
    "Alt Text Image": "Official header image for Aximion game - Steam 833740",
    "Canonical URL": "https://gusku.site/game/aximion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aximion\", \"description\": \"Looking for information on Aximion? Check out the release date (Apr 27, 2018), developer insights from Aximion Research Lab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aximion Research Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3d Molier\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/833740/header.jpg?t=1557095188\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}