{
    "AppID": 1871790,
    "Name": "Bad Faith",
    "Release date": "Feb 4, 2022",
    "About the game": "In a world filled with insanity, the Haven is a sanctuary. I'm fortunate to be born and raised here. This is a privilege few have. I'm happy that I have it. In the middle of a lake, on an isolated island, lies the Haven. Made up of several young women and their sole, elderly leader, the Haven is a community that shelters those who are pure of heart and mind. In order to protect the Haven from the corruption outside of the island, the community hosts Apologia Assemblies: mandatory gatherings where misdeeds are discussed - and given appropriate punishments. One member, Magda, has complicated feelings about the Haven. She loves living there, but hates its punishments. And so, after one particularly stressful Assembly, Magda wanders through the nearby woods to clear her mind. Then, she discovers a mysterious building, and her curiosity stirs... The protagonist of Bad Faith. Magda is a perceptive yet timid young woman who works within the Haven's Art Sect. Because of past events, she tries her best to follow the Haven's strict rules. A member of the Haven's Architectural Sect and Magda's close friend. Grace is a sensitive, law-abiding soul who adores the Haven, but also cares for her loved ones. A prominent member of the Haven's Writing Sect. Cerise and her stories are highly-regarded, but she acts hostile towards Magda. The prodigious head of the Haven's Research Sect. Eve is a calm and collected individual whose papers are praised for their promotion of Haven values. The head of the Haven's Art Sect. Maria is a wise, nurturing figure to everyone within her sect. The leader of the Haven. Lady Amaris is older than the other Haven members, and maintains a steadfast air. [REDACTED] The full version of Bad Faith contains: - A ~35,000-40,000 word storyline. - Artwork, UI design, code and writing made by Mado. - A soundtrack by 稿屋 隆, 秦暁, Keido Honda, のるこばっと, ハシマミ and かずち. - Accessibility options for dyslexia, visual and hearing impairments. Bad Faith is not suitable for children or those who are easily disturbed. For a list of content warnings, please visit Bad Faith's official website. A DEMO of Bad Faith is available for free. The DEMO covers the first act of the game, and will take around an hour to complete. To check the DEMO's content warnings, please visit Bad Faith's official website.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1871790/header.jpg?t=1643986828",
    "Price": 9.99,
    "Developers": "Mado",
    "Publishers": "Mado",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1871790/ss_f58cfb25bdcd6fcd4e8b0e748e4daf5c6a26c206.1920x1080.jpg?t=1643986828,https://cdn.akamai.steamstatic.com/steam/apps/1871790/ss_9ff616e6798bdff8549d4c6cf3e233c729285370.1920x1080.jpg?t=1643986828,https://cdn.akamai.steamstatic.com/steam/apps/1871790/ss_cb16fe7134db746917c97fdf40bb97c61dbdf3fe.1920x1080.jpg?t=1643986828,https://cdn.akamai.steamstatic.com/steam/apps/1871790/ss_d8b8c0c067d7ee83bfbf5e47bc0524d0de494db9.1920x1080.jpg?t=1643986828,https://cdn.akamai.steamstatic.com/steam/apps/1871790/ss_273f61f2abd68fa5d6e2ea874ff38fda960e6c95.1920x1080.jpg?t=1643986828",
    "Slug": "bad-faith",
    "Meta Title": "Bad Faith: Feb 4, 2022, Mado and Full Overview",
    "Meta Description": "Looking for information on Bad Faith? Check out the release date (Feb 4, 2022), developer insights from Mado, and a complete game summary.",
    "Alt Text Image": "Official header image for Bad Faith game - Steam 1871790",
    "Canonical URL": "https://gusku.site/game/bad-faith",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bad Faith\", \"description\": \"Looking for information on Bad Faith? Check out the release date (Feb 4, 2022), developer insights from Mado, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mado\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mado\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1871790/header.jpg?t=1643986828\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}