{
    "AppID": 889260,
    "Name": "Bonkies",
    "Release date": "Sep 10, 2018",
    "About the game": "Space colonization takes a lot of work and is super dangerous. Far too dangerous for humans, so monkeys will have to do it! Bonkies is a space-monkey simulator where you experience life as a crew of bionic monkeys building the future of humanity among the stars, paid by the hour in bananas. Build moon habitats, rockets and floating space hotels - heck why not a nuclear reactor or two on a lake of frozen methane? Anything is possible when you strap a jetpack on a monkey, equip it with an industrial strength robot arm and wave goodbye to labor rights! Hardcore co-op Do not be fooled by its cute exterior, Bonkies is the base jumping equivalent of a couch co-op game. A Bonkies assignment will require a dedicated team of tough as nails, true space engineers with unparalleled eye-hand coordination. Unless you choose Chill mode , then it becomes more akin to a stroll in the park (if the park was filled with nuclear reactors about to blow, rocket engines spinning out of control and teammates being crushed by several metric tons of construction debris). You will laugh, you will cry, you will assign blame. Robotic precision You have full control with our dual stick joystick controls: A minute to learn, a lifetime to master. You will have little to no control with our sorry excuse for keyboard-controls. Precision and speed is the name of the game when you pilot your Bonkie, and if you or a teammate unwittingly tear down the whole structure, guess what? You only have yourself to blame. Build intricate (read: crazy dangerous) structures that just need to pass the 3-second inspection Get hired by megalomaniacal space moguls (Yes, there are more than one) who will flush you out the airlock as soon as you mention unionization Utilize special building blocks and tools, some more nuclear than others Build on various surfaces : Good old martian soil, islands floating in water, islands floating in lava(!) and in zero gravity Travel across the solar system, from Earth all the way to Pluto, and beyond! ( 70 levels+ ) Unlock a veritable Zoo of the cutest astronauts imaginable (yes, there is a cat) Beat the developer times on each level to earn the coveted Golden Banana Bunch Ace entire planets for special secret rewards Original music track by Philip Dahlstrøm (His chill beats will surely calm your rising blood pressure) There are still economy seats available on the banana shaped rocket!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/889260/header.jpg?t=1656419419",
    "Price": 14.99,
    "Developers": "Studio Gauntlet",
    "Publishers": "Crunching Koalas",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_8b039784f247f7a8d9b8804c59e32dc55d87b672.1920x1080.jpg?t=1656419419,https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_1e36ad1d424fa13db4b287eaca2eea691c9c22d2.1920x1080.jpg?t=1656419419,https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_fef6a347b266f27abf37c04c3fddac32dd2609af.1920x1080.jpg?t=1656419419,https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_098ff1608644d9d9aebdd87535bbfa8153eb0ee4.1920x1080.jpg?t=1656419419,https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_5c330ea47960e7c48c3a2d17406fd2f528f3ff7a.1920x1080.jpg?t=1656419419,https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_3d40f07ded6c7f86e0488a1db8b531ff3fce2cee.1920x1080.jpg?t=1656419419,https://cdn.akamai.steamstatic.com/steam/apps/889260/ss_1583b7c5d82104c111ff54047f7abcff85b3a023.1920x1080.jpg?t=1656419419",
    "Slug": "bonkies",
    "Meta Title": "Bonkies: Sep 10, 2018, Studio Gauntlet and Full Overview",
    "Meta Description": "Looking for information on Bonkies? Check out the release date (Sep 10, 2018), developer insights from Studio Gauntlet, and a complete game summary.",
    "Alt Text Image": "Official header image for Bonkies game - Steam 889260",
    "Canonical URL": "https://gusku.site/game/bonkies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bonkies\", \"description\": \"Looking for information on Bonkies? Check out the release date (Sep 10, 2018), developer insights from Studio Gauntlet, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Gauntlet\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crunching Koalas\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/889260/header.jpg?t=1656419419\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}