{
    "AppID": 379660,
    "Name": "Cakewalk L-Phase Series Plug-ins",
    "Release date": "Jan 24, 2017",
    "About the game": "Mixing and Mastering Designed from the ground up to be used for both mixing and mastering the L-Phase plug-ins allow for mastering level sound quality with internal 64-bit double precision and additionally offer zero-latency non-linear mode for mixing at sample rates up to 192 kHz. Precision Display and Monitoring The L-Phase series feature a powerful interface with a detailed display. 3 different range scales, a configurable spectrum analyzer, and output metering in 16dB, 32dB, 48dB, and 60dB. Both plug-ins feature Stereo and Mid/Side processing and A/B comparison switching. Additionally the L-Phase Multiband features per band input and make-up gain metering built-in to the threshold and output controls. Key Features: Presets - Equipped with professionally crafted presets and the ability to Save, Edit and Organize your own in an intuitive preset manager. Expert Mode - This is where you go under the hood and configure the L-Phase series for whatever you throw at it. Mastering or Mixing &amp; setting the spectrum analyzer to taste, and more. Solo Mode - Solo mode allows for hearing the signal of any independent band. Once in this mode you can click any node to hear its independent frequency band for fine tuning. L-Phase Equalizer The L-Phase Equalizer features 20 color-coded bands, five filter types, and automatically picks the most common filter or EQ curve based on the frequency where the band is created. L-Phase Multiband The L-Phase Multiband features 6 color-coded bands, external sidechain support with audition, Auto Release to minimize pumping, and intelligently sets the attack time based on where the band is created.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/379660/header.jpg?t=1511570402",
    "Price": 0.0,
    "Developers": "Cakewalk",
    "Publishers": "Cakewalk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/379660/ss_959e1c4c22e0c7780cc82cd96c2f0a9394400f37.1920x1080.jpg?t=1511570402,https://cdn.akamai.steamstatic.com/steam/apps/379660/ss_db84f1df0e85a10a630a9fb2aa23792185c201d6.1920x1080.jpg?t=1511570402",
    "Slug": "cakewalk-l-phase-series-plug-ins",
    "Meta Title": "Cakewalk L-Phase Series Plug-ins: Jan 24, 2017, Cakewalk ...",
    "Meta Description": "Looking for information on Cakewalk L-Phase Series Plug-ins? Check out the release date (Jan 24, 2017), developer insights from Cakewalk, and a complete...",
    "Alt Text Image": "Official header image for Cakewalk L-Phase Series Plug-ins game - Steam 379660",
    "Canonical URL": "https://gusku.site/game/cakewalk-l-phase-series-plug-ins",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cakewalk L-Phase Series Plug-ins\", \"description\": \"Looking for information on Cakewalk L-Phase Series Plug-ins? Check out the release date (Jan 24, 2017), developer insights from Cakewalk, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/379660/header.jpg?t=1511570402\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}