{
    "AppID": 693050,
    "Name": "Dumb Stone Card Game",
    "Release date": "Nov 5, 2018",
    "About the game": "Please read before you buy this game... The game wll be removed and no longer supported on steam Dumb Stone is a social discarding card game like other popular card games which can be played by four or two players. Get rid off all your cards or you are the dumb stone! Play clever and be evil, let your opponents take the piled up cards and finish first! Level up ranks, unlock new avatars and have some fun hours with your friends. To win the game you need a bit of luck, tactical decision making and a good memory and if you like card games you will love this one! Duell your friend in exciting and challengine two player duells in the two player mode! Invite three friends and play the four player mode! Join a random room and meet new friends in game! Same as in another popular card game you have to get rid off all your cards first, if you are the last one with a card in your hand you are the DUMB STONE! Wild cards let your opponents take the pilled up cards from the discard pile so you can finish first! Or you can counter the wildcard with another the remove the whole piled up cards and let your opponents be the dumb stone ! Every game is a new challenge as you never know what your opponent is doing next! Level up ranks and unlock new avatars as you progress in the game and enhance your skills to become the best player which will never be the dumb stone! Summarizing it is a great card game which involves a bit of luck, decision making and a good memory to win! So grab three friends and have fun ! The rules are simple and it is easy to pick up but hard to master! Come and join the dumb stone community and have a little in-game chat, find new card game friends or beat your opponents in exciting card games! Features: Sinlge and Online Multiplayer mode, Two or four player game modes Ranking system Crazy unlockable avatars A helping mouse explains you the game rules Disclaimer : The game trailer shows alpha game content, and it is a simple card game... nothing more If something doesnt work how you expect it please feel free to write an email to the support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/693050/header.jpg?t=1555324671",
    "Price": 0.0,
    "Developers": "FlyingCubicle",
    "Publishers": "-",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/693050/ss_5592c894e6a33f81caa9833ff45c73c829457429.1920x1080.jpg?t=1555324671,https://cdn.akamai.steamstatic.com/steam/apps/693050/ss_0963f6ce6a347391772110ab4b99d89c16ce116e.1920x1080.jpg?t=1555324671,https://cdn.akamai.steamstatic.com/steam/apps/693050/ss_1f873503d4dbeb5bb901897ed3e0e08facb62fd6.1920x1080.jpg?t=1555324671,https://cdn.akamai.steamstatic.com/steam/apps/693050/ss_12142dec57eed159e9d8eab39d6980163aa917dd.1920x1080.jpg?t=1555324671,https://cdn.akamai.steamstatic.com/steam/apps/693050/ss_e76cd066830efd4d6845ee477e718d42c5ef4e2b.1920x1080.jpg?t=1555324671",
    "Slug": "dumb-stone-card-game",
    "Meta Title": "Dumb Stone Card Game: Nov 5, 2018, FlyingCubicle and Full...",
    "Meta Description": "Looking for information on Dumb Stone Card Game? Check out the release date (Nov 5, 2018), developer insights from FlyingCubicle, and a complete game su...",
    "Alt Text Image": "Official header image for Dumb Stone Card Game game - Steam 693050",
    "Canonical URL": "https://gusku.site/game/dumb-stone-card-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dumb Stone Card Game\", \"description\": \"Looking for information on Dumb Stone Card Game? Check out the release date (Nov 5, 2018), developer insights from FlyingCubicle, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"FlyingCubicle\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"-\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/693050/header.jpg?t=1555324671\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}