{
    "AppID": 57650,
    "Name": "Dungeons",
    "Release date": "Feb 10, 2011",
    "About the game": "A mighty hero stalks through a dark, dank dungeon making life miserable for hordes of pitiable monsters as he steals anything and everything not bolted to the floor. Been there, done that - about a thousand times? Then it is definitely time to switch sides and show that hero just who's who in the dungeon! Assume the role of a mighty (and mighty evil) Dungeon Lord and create your own diabolical demesnes underground. Dim-witted goblin workers tremble as they await your orders and dig corridors and rooms into the rock at your command. Heroes will visit your dungeon in search of battle and treasure. Naturally, you could always just annihilate them with a snap of your fingers. But isn't it more entertaining and deliciously evil to watch them attain their heart's desire - and then take take it ALL away? So throw them a few treasures and some equipment, give them a couple of fights for entertainment and cherish and look after them. And once they are finally happy enough - it's time for the 'harvest'. For happy heroes have more valuable soul energy for you to gleefully extract from them in your prison or torture chamber! But even though these self-proclaimed warriors for the good are not much more than an excellent source of resources for you, you still should not underestimate them. If you've beaten up too many of their friends, the powerful and vindictive Champions will occasionally make their way to your Dungeon. Perhaps a small sum could persuade them to forget their moral and ethical principles for once? In addition to the heroes, you should also always keep an wary eye on the underground. For the competition never sleeps, and other Dungeon Lords would like to claim your territory for themselves. As if that were not enough, another Dungeon Lord lives one level below you who, to top it all off, is also your boss and bombards you with useless tasks! Of course, it goes without saying that malicious and sneaky beings such as yourself are already hard at work trying to take his place! Story The game revolves around Deimos, foremost of all Dungeon Lords. He falls victim to a devious plot hatched by his vile, nasty, thoroughly vicious ex-girlfriend Calypso, and suddenly finds himself at the bottom of the hierarchy and the top of the dungeon once again. As the story proceeds Deimos tries to regain his old place and have his well-deserved revenge on Calypso. First, however, he will have to deal with his new bosses. On the one hand , there's the Zombie King, who is about as intelligent as your average undead zombie is likely to be, and on the other there's hot-blooded Minos, who likes to solve problems using violence or, alternatively, more violence. Key features: Be insidious! Three different Boss Monsters await in order to give you a real hard time. Get rid of them to become the one and only Dungeon Lord! Get ready for a fight! 10 different classes of heroes dare to enter your dungeon where 15 different monsters lurk in the dark The 17 campaign missions demand your whole cunningness as evil dungeon lord. If you manage to survive them there's still the custom game waiting for you. In a dungeons there's only one way: going down. 3 different levels wait to be conquered by you. Prison cells and torture chambers are ready for your command and await “customers” Create the dungeon of your dreams with 50 different objects Wimpy goblin workers await your commands and create the dungeon after your wishes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/57650/header.jpg?t=1644239699",
    "Price": 9.99,
    "Developers": "Realmforge Studios",
    "Publishers": "Kalypso Media Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_91353c37ed903e1c888e1542b26dbf3462909c3f.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_1bb23bfd3d6ead87e55e2cf442d462f38f09fdb3.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_d0e69dbd8994ccbae044643e51e79a3ed01fa0dd.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_4b6b04099000ff8efe09b43b3904d1fe0289a13d.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_ce467d1d1368e94ab655cbc828140ea45ea6e45b.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_e1e4e94e2823fd9fe42f27fcd6cf9ca69b162c5b.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_af28639c139187ce42b7dd52d83f45c7bf33febb.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_31fda7f1dcd0b3ce19bfd1ae78a6327206f37f42.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_b9c7eb4182d1f434e3fa2a631aae6ae1949058d0.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_76897502bf73841fe7aee1135427a92893601686.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_19a16e7eb4c4bbbc5413c191ab897562cd5dceaf.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_5bbc8eda47cbd5aa18d8fc6ea2ae25c4153d9fe6.1920x1080.jpg?t=1644239699,https://cdn.akamai.steamstatic.com/steam/apps/57650/ss_f3d00d6b883ffa5da28e20150db5113ec227a787.1920x1080.jpg?t=1644239699",
    "Slug": "dungeons",
    "Meta Title": "Dungeons: Feb 10, 2011, Realmforge Studios and Full Overview",
    "Meta Description": "Looking for information on Dungeons? Check out the release date (Feb 10, 2011), developer insights from Realmforge Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Dungeons game - Steam 57650",
    "Canonical URL": "https://gusku.site/game/dungeons",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeons\", \"description\": \"Looking for information on Dungeons? Check out the release date (Feb 10, 2011), developer insights from Realmforge Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2011\", \"author\": {\"@type\": \"Organization\", \"name\": \"Realmforge Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kalypso Media Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/57650/header.jpg?t=1644239699\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}