{
    "AppID": 1119970,
    "Name": "Elf Manor",
    "Release date": "Dec 19, 2019",
    "About the game": "Twitter: @ElfManorGame Facebook: @elfmanor Elf Manor is a strategic survival game, a turn-based adventure game, and also a building game. In the game, you will play as an Elf Master who has the duty to maintain the balance of the world. You will be staying in a sealed world with barely any people around and doing everything by yourself. While you are researching, cooking, handcrafting, and building, you will encounter various events, disasters, enemies, and traveling merchants. The only way to keep the world away from corruption is to finish building the Monster Tower. Stay Alive The first thing you have to keep in mind is——STAY ALIVE! Farm and collect food materials. Cook plenty of food and stay alive. Expand your manor, build your own home, and create more living space. However, it won't be easy. You have to prepare the necessary resources for incoming disasters. Manage Your Life and Works The life of an Elf Master is not easy. You must manage your hunger, emotion, and energy to keep yourself in a healthy lifestyle. However, life is tough. Once you have run out of any one of the three indexes, you will die! Hatch and Train Elves You are not alone in this world. The elves will become your capable helper. Each elf has their own special skills that may help you to grow crops, farm, research, clean, cook, and mine. Remember to train them and let them grow up with you together! Research and Handcraft Items Food, weapons, equipment, talismans, and special materials. These are all you can produce. The features of the final products will be based on the materials you select. Who will claim the title of “Ultimate Blacksmith”? If you have surplus materials and items, don't worry, you can trade with the traveling merchants when they stop by your manor. Explore the World Of course, you will not stay at home all the time. There is an entire world waiting for you. You may take your elves on a tour of the world. Experience all the events, dungeons, landforms, and enemies, but remember to take plenty of supplies. Make sure you bring the treasure back alive. Turn-based Battle You will fight against evil monsters in turn-based battle. Equip the powerful weapons and cast mysterious spells to bring the corrupting world back to balance. Complete Your Mission Building Mode : The world is more stable in this mode which means you have more time to enjoy building and exploring. Build up the Monster Tower to complete your mission! Challenge Mode : The evil energy generates much faster in this mode. You have to arm yourself and collect a team of elves to fight with corruption. Then build up the Monster Tower to complete your mission! The in-game tutorial will help you grow up quickly. Be prepared and enter the world of Elf Manor now!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1119970/header.jpg?t=1582080986",
    "Price": 14.99,
    "Developers": "巫师工作室",
    "Publishers": "GY Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_e3cf523e32fea0cb789a4d68e5359968b1dfd6cb.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_5c18f03eea7e93c8fc1dec422467d53600512cff.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_7364e0ddb1652526203d7b49ee306a741b341b0a.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_2a686040810c132fe8793a92a18fc322e9a551a0.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_01d9b6b9430451e19280f42736d6d98684340d81.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_f62dbc0cd08c2196e5c211b607476464d39aa5fe.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_0cd284b97b1b46b5d5b4c72e2c8208c7cbc4f24f.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_f00e9e227bdb26e712ff36568ed5b4a2f83b6e75.1920x1080.jpg?t=1582080986,https://cdn.akamai.steamstatic.com/steam/apps/1119970/ss_e36174546fa9565e7f6ebb15cd6cd924b29fb297.1920x1080.jpg?t=1582080986",
    "Slug": "elf-manor",
    "Meta Title": "Elf Manor: Dec 19, 2019, 巫师工作室 and Full Overview",
    "Meta Description": "Looking for information on Elf Manor? Check out the release date (Dec 19, 2019), developer insights from 巫师工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for Elf Manor game - Steam 1119970",
    "Canonical URL": "https://gusku.site/game/elf-manor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elf Manor\", \"description\": \"Looking for information on Elf Manor? Check out the release date (Dec 19, 2019), developer insights from \\u5deb\\u5e08\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u5deb\\u5e08\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GY Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1119970/header.jpg?t=1582080986\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}