{
    "AppID": 463530,
    "Name": "Empires of the Undergrowth",
    "Release date": "Dec 1, 2017",
    "About the game": "Empires of the Undergrowth is a fast-paced ant colony strategy game. Underground you will excavate your nest, constructing tunnels and chambers to store resources and raise your brood, before venturing above ground. Here, your ants will claim territory, gather resources and overwhelm fearsome creatures. Nest layout, army size and composition along with knowing when to attack or retreat are key to securing victory for your colony of ants. Features Carve out and construct your underground nest to suit your strategy Engage in fast-paced colony versus colony combat above ground Play as different ant species and explore their unique traits and weaknesses Encounter and overpower dangerous beetles, arachnids and other awesome arthropods The Formicarium The fully-voiced campaign in Empires of the Undergrowth has two elements to it, first is the formicarium where you start with just a queen and a few workers. As the game progresses, you will have to withstand the experiments of a mad scientist, growing stronger and genetically adapting your ants to survive his machinations. The Formicarium also acts as a hub in which you can launch scenario missions, which allow you to take control of a variety of ant colonies. To unlock the next tier of scenarios you must withstand the aforementioned experiments. Documentary Scenarios 'Your queen has set up home beneath a rotting log. She is fat, and vulnerable. Her first brood will need to move quickly if the colony is to survive. Their priority now is to find food, and there is plenty around; but there are other hungry creatures in the undergrowth. The workers will need to be vigilant.' Scenarios are narrated from the perspective of a documentary film maker studying the ants, who offers intelligent insight into the goings-on of the colony and the undergrowth beyond. The scenarios are presented in 'tiers' with five planned for the full release (three are currently live). Each tier's missions are presented in a nature documentary style, and vies to be scientifically accurate whilst also being fun to play. Each tier allows you to play as a different species of ant, each with their own differences and play style. The settings for each level also vary, to reflect the environment in which you would natively find that species. Black Ants A recently-mated black ant queen has burrowed into the substrate underneath a log. After giving birth to her first brood, she must rely on them to find food, further excavate her nest, and battle the deadly beetles and spiders that lurk nearby. Wood Ants A wood ant queen takes over the nest of another ant species by dispatching its queen and taking her place. The close proximity to a beach gives the new colony access to the bounty of the sea, but there are many other hungry creatures and rival colonies on these intertidal flats. Leafcutter Ants Leafcutter ants eat only fungus that they grow from leaf cuttings. A fledgling colony must climb and harvest the nearby vegetation, whilst battling praying mantises, rove beetles and marauding lines of army ants. Huge leafcutter majors can be spawned to keep their enemies at bay. Fire Ants Invasive fire ants are carving out an empire for themselves in the swamps. They can link their bodies to build floating pontoons over water, giving them access to unplundered resources. Huge amphibians and dragonflies are some of the many dangers they will face, but fire ants don't get their name idly - their sting more than makes up for their size. --- Freeplay Freeplay mode offers a potentially endless, more open-ended experience than the campaign levels. Once you've mastered the campaign, take your upgraded colony to new challenges. Some freeplay creatures and colonies can be unlocked by completing extra levels. Extra Levels If you want to take a break from the main campaign and the open ended nature of freeplay, there are a range of extra levels to get stuck into, which offer unique objectives and - in some cases - allow you to take control of other species altogether.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/463530/header_alt_assets_1.jpg?t=1658839963",
    "Price": 19.99,
    "Developers": "Slug Disco Studios",
    "Publishers": "Slug Disco Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_44f0d281c7eb004764dfa6f60f9763e445de0de8.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_072977963dc77645abaafab6308097ec5bf958d5.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_5845bd9a58c4dc92406b2f1de941f012568129e7.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_2cc458426cf345d1da5732ff1e1ab31157b829b3.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_c8f93d6628077ae09fed66b16a7b65e115da35cf.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_58294888f7c8a56896a9ecf0b168c974383f4f31.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_5d7af800d29074af93d6b00438fa68c028617bf4.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_8c4817733100e387b91d3f293c3f13424e8329e4.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_4ab25ece98abd21d82e28d52ae856c17e6fbc2ff.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_3624587825d2c4d86d6c002c2c10028d50eff8ba.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_ad0c1a411335e254815a1216cd0747baa79e390d.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_06234e3fce7a4d8328796308dc4e4b788c834ef5.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_aae8264c3411371505e685612dd8f7a515e11c36.1920x1080.jpg?t=1658839963,https://cdn.akamai.steamstatic.com/steam/apps/463530/ss_01a2951ed6c0afa2497c2cc3e9c42e7cf59f6872.1920x1080.jpg?t=1658839963",
    "Slug": "empires-of-the-undergrowth",
    "Meta Title": "Empires of the Undergrowth: Dec 1, 2017, Slug Disco Studi...",
    "Meta Description": "Looking for information on Empires of the Undergrowth? Check out the release date (Dec 1, 2017), developer insights from Slug Disco Studios, and a compl...",
    "Alt Text Image": "Official header image for Empires of the Undergrowth game - Steam 463530",
    "Canonical URL": "https://gusku.site/game/empires-of-the-undergrowth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Empires of the Undergrowth\", \"description\": \"Looking for information on Empires of the Undergrowth? Check out the release date (Dec 1, 2017), developer insights from Slug Disco Studios, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Slug Disco Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slug Disco Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/463530/header_alt_assets_1.jpg?t=1658839963\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}