{
    "AppID": 1565230,
    "Name": "End of Days",
    "Release date": "Aug 27, 2021",
    "About the game": "Why another zombie survival game We hear it daily, why would we add yet another zombie survival game to the already oversaturated market? Well for us it's not just about going into a world of zombies and trying to survive. This time we are taking survival to the ultimate level of community. End of Days focuses on players uniting together to build an entire compound to rebuild civilization. It's taking 75+ building options and creating your own commune. Research and development will provide new ways for survivors to have something to offer when attempting to join others in the fight for survival. We didn't want just another shoot'em up zombie game with survival aspects. Survival requires everyone to work together to rebuild the world and fight for a new future. From book smarts to street smarts, everyone can play an important role needed to ensure a brighter tomorrow. Where is that you will fit in? Will you do whatever it takes to survive End of Days puts the survival mechanics to the limit, testing your survival skills and at times your social skills. Set in a post apocalyptic world, survivors must learn to work together to survive, or fight against each other for the sake of their own survival. End of Days is a survival game that also features questlines, unlockable items, crafting, camp/fortress building, trading, and more! Features of the game Explore: End of Days features a large constantly changing map that will allow you to find hidden secrets, rare items and hidden entrances to unknown locations. Craft: With hundreds of items to craft, End of Days provides numerous ways to create, mend and change items. Fortress Building: Of course we offer building mechanics, but take it to the next level with fortress building. Build an entire survivor encampment to rebuild a functional society. With 50+ items to build with, the possibilities are endless. Player vs Player: Surviving doesn't always come so easy, not everyone is destined to get along. Our dedicated servers bring over 200 players together to either work with each other or kill each other. That part YOU get to decide. The Infected: End of Days features over 150+ unique zombie looks and designs. Each infected is designed to have different skills or mechanics. Some are your typical one shot and done, and then some will give you a run for your money. Some of them have mutated to have stronger skills, from speed, hearing and sight distances and more can take a good amount of damage before going down. Dedicated Servers: Alongside our official servers, we will also be focusing on a system that will allow our players to host their own dedicated servers with advanced management systems. And so much more: We are just in the early stages of a public release, we plan to continue development and add many more features! With your feedback and input, we will continue to grow and ensure the game is everything you've wanted and more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1565230/header.jpg?t=1652936199",
    "Price": 9.99,
    "Developers": "Archage Studios",
    "Publishers": "Archage Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_97e640ef46b3e0beeeda188533cdd079d4999370.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_651590181c99b3bf70f616013930250498e4aa6e.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_4ea8a0d0433d154fa07782cffd6c390478200e04.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_762784384d511532b69dd37ba80807013715ed0b.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_837de0a6f03b15093ae62e21f02946ab9d85c28a.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_c4cc31f90ae9be8ea44c27925e6b2ff578355d12.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_f43edbdf1bfd12b7812c21b3144d314c411c661c.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_534da165b6beb107273b478bd8a1e56d5a1b9863.1920x1080.jpg?t=1652936199,https://cdn.akamai.steamstatic.com/steam/apps/1565230/ss_ea4cf57b7801ac5b428d01bd91412e9e917f7f84.1920x1080.jpg?t=1652936199",
    "Slug": "end-of-days",
    "Meta Title": "End of Days: Aug 27, 2021, Archage Studios and Full Overview",
    "Meta Description": "Looking for information on End of Days? Check out the release date (Aug 27, 2021), developer insights from Archage Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for End of Days game - Steam 1565230",
    "Canonical URL": "https://gusku.site/game/end-of-days",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"End of Days\", \"description\": \"Looking for information on End of Days? Check out the release date (Aug 27, 2021), developer insights from Archage Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Archage Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Archage Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1565230/header.jpg?t=1652936199\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}