{
    "AppID": 1683960,
    "Name": "Glisten to your heart: The courage within you",
    "Release date": "Jul 22, 2021",
    "About the game": "Meet the Virtues, they are magical beings who live in a secret city above the clouds and whose purpose is to help us, virtuans, learn to express our virtues. They may use their special Instruments (like a whistle) to make us feel brave or friendly in a blink of an eye, but they can only complete their missions if they make us learn how to express virtues by ourselves. Courage is a Virtue with confidence issues who hasn't completed a single mission in her life, but when she has a fateful encounter with you, a spark of hope begins to light in her heart. With your help, she's supposed to make a little boy named Sam face a haunted mansion to make his adventurous friend Andrea happy, but is that the only courage issue on this mission? Or is there something more? [About this game] Glisten to your heart is an emotional story-driven game focused on you! You may be an invisible entity from a world beyond the game, but you’re also one of the main characters in the story and your decisions might get you new conversations, essences and even major story changes. The whole point of the game is to make you feel various emotions, as you get inside this world, play minigames, explore and interact with amazing characters and help them with your words, warmth and jokes. [Main characters] All characters are imperfectly-perfect and I hope you get to like each one of them. Key features A heartwarming tale of courage and hope with over 4-7 hours of gameplay Make small decisions to get new conversations, items, jokes or learn more about the characters Make huge decisions that affect the story (even the characters will remember your past decisions) Get to know the characters with optional Free talks Solve courage issues, like the fear of being yourself or telling your friend you’re too scared to do something Fill up your encyclopedia with Virtues’ vocabulary and rules, life lessons, jokes and fun facts about the characters Play minigames like Face your fears, Choose correct thoughts and more Break the 4th wall! Some characters know you’re just a player and they’re inside a game Emotional licensed and original soundtrack to make you feel like watching a movie Do you like retro stuff? Then you’ll love those Pixel art graphics and 90’s references About the demo version The demo version works just like a shorter version of the full game. In terms of story, it covers a day in the life of Courage until she finally decides to go to our world, Virtuanland. It's a good way to feel the premise of the story It covers 2 of the 4 minigames ('Talk to all' and 'Choose correct thoughts' are not included until later in the game) found on the full game You can make 2 (or 3, depending on your choices) of the main game's big decisions You'll get to meet 5 of the main characters and will have an idea of what should Courage do to complete her mission You'll help your first virtuan (even though he's not technically a virtuan. You'll see xD) All your progress can be transferred to the full game",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1683960/header.jpg?t=1635421111",
    "Price": 2.99,
    "Developers": "Annchan4",
    "Publishers": "Annchan4",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_095b91a20145b77d76ced21c3aa0ebee81161bf7.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_69950b6465fbc26b63851ffe7c61ea72efe75a6b.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_f6cbe8f8f195518b31b5cf8204ac7e3b86658c1e.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_56dce73828a536f065972aff4c3e29ef3670ad19.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_ad6a8ee5fefa55a498b925521ff6036e5edceba5.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_d510bf49bd619c1331c084df8aee2476025a8e3b.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_5cdb6c93840eace66771323cd1bd45d0d6df04c1.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_e98d81d92462c352dab2bf21e91d966225fd9996.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_a7959b09f21c5a8ddd8831a4a845b5e3c95cd105.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_408d23e5c3cc8132403bdbd81ff3bd89d60c5f8b.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_3dd9ffb7e3df456de4a08b54edee37691db294d4.1920x1080.jpg?t=1635421111,https://cdn.akamai.steamstatic.com/steam/apps/1683960/ss_a01ecf3ae81b0bab87373ad49573c8ecc4f22879.1920x1080.jpg?t=1635421111",
    "Slug": "glisten-to-your-heart-the-courage-within-you",
    "Meta Title": "Glisten to your heart: The courage within you: Jul 22, 20...",
    "Meta Description": "Looking for information on Glisten to your heart: The courage within you? Check out the release date (Jul 22, 2021), developer insights from Annchan4, a...",
    "Alt Text Image": "Official header image for Glisten to your heart: The courage within you game - Steam 1683960",
    "Canonical URL": "https://gusku.site/game/glisten-to-your-heart-the-courage-within-you",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Glisten to your heart: The courage within you\", \"description\": \"Looking for information on Glisten to your heart: The courage within you? Check out the release date (Jul 22, 2021), developer insights from Annchan4, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Annchan4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Annchan4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1683960/header.jpg?t=1635421111\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}