{
    "AppID": 1081070,
    "Name": "Gooberries",
    "Release date": "Mar 3, 2021",
    "About the game": "Gooberries is a quirky, futuristic, terrarium farm sim and management game with it's goal set on automation. Take control of your customizable bot. Design and build a colorful universe of tiny terrariums. Fill them up with deliciously, juicy berries. With time and a little tending you'll unlock everything required to fully automate your terrariums and turn your creation into a berry producing machine. Discover the creatures that inhabit your universe. Are they loveable friends or pesky Goobers that can't stop munching on your plants? Collect absolutely every variety and keep them as lively, little pets. Or feed your Goobers so many berries they can't help but burst into a shiny gem that will help you progress through the game. The choice is all yours. ● Handcraft dozens of terrariums. You choose the layout, the foliage, the colorful colors, and even the temperature. You'll need to manage a variety of different environments to take advantage of all the berries you can grow. Each environment you build is its own little slice of terrarium paradise with all sorts of unique ways to make it yours. ● Plant deliciously, squishy berries. Pop a berry straight into the ground. With a little tending you'll soon have a plant capable of producing even more berries that you can sell at the market to earn a few coins, or feed to a pesky Goober that can't stop munching in your gardens. Tend to your plants manually...or automate your terrariums to do the hard work for you! ● React to a world of colorful creatures. Sure the Goobers are cute in an alien sort of way. Gooberries are so tasty you're sure to attract a ton! If you don't keep them under control they are bound to destroy your plants and munch every berry in your terrarium. Collect one of each variety and enjoy a little company while you work. Or burst that Goober with a force so intense it becomes a shiny gem that you can use to unlock each and every item. ● Harvest and sell to earn that coin. With all that hard work you'll surely witness a bountiful harvest. Turn those berries into coins by selling them at the market so you can buy automation equipment, a new terrarium, or even a stock of fresh berries to grow something a little different. Variety is key to keep the value of your berries soaring high. ● Customize your character. Take a trip to the bot customization machine. Choose between different body styles and colors to create the beeping, bopping, character you want to play with. And when you want to change it up. Do it again! ● Create automation magic with machines. Managing multiple terrariums can be alot of work. Fortunately you'll have access to automation equipment that can water your plants, feed your creatures, or even incubate those eggs you found. Don't forget to build a bin that can convert your berries into gems and help you progress through the game even faster! There's all sorts of machines to build if you've earned the coins and gems you'll need to create a truly automated environment. ● And that's not the end. If you can manage to earn enough coins and collect enough gems to unlock all the items in the market. You're sure to be a master gardener. Continue to build an unlimited amount of terrariums. Maybe try your hand at collecting each and every variety of creature. And pat yourself on the back. Because you my friend, got that green thumb for sure!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1081070/header.jpg?t=1614776049",
    "Price": 9.99,
    "Developers": "Ryan Frank",
    "Publishers": "The Gooberverse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_9dfe3f628f55618c90c6d200d7b7a51c41407302.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_f8242162cb5bab4d95359616775f3672dc2cf2b7.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_ff9545e8696f6c34fb958e4244d5e8a21a6a3a98.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_19899b192a8b32b089ecff365c7b68d8622bd00e.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_6c689f1ff9689a843022a51be6475a19feb32263.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_ef53d738e40330272e6e8bdb32e15e6cf0e0dd83.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_8a5cc10731a21b5b9b478d1e31699882a4e8c155.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_0909d8af4083591c3524f2421e4522f6c860d221.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_f317d6c7f521bb96ae972d09593637408c3e84ff.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_30de2ee18ed79dc2d7c06ba1b2b74de9d45a8be8.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_1a236a00cde22014ad9c23145e700cf539ff7a5f.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_04fad3f2fd413e1fa7b20c2a62e819bce4f15cd3.1920x1080.jpg?t=1614776049,https://cdn.akamai.steamstatic.com/steam/apps/1081070/ss_72bded41cf999b3f752fb1341666663acc880d4c.1920x1080.jpg?t=1614776049",
    "Slug": "gooberries",
    "Meta Title": "Gooberries: Mar 3, 2021, Ryan Frank and Full Overview",
    "Meta Description": "Looking for information on Gooberries? Check out the release date (Mar 3, 2021), developer insights from Ryan Frank, and a complete game summary.",
    "Alt Text Image": "Official header image for Gooberries game - Steam 1081070",
    "Canonical URL": "https://gusku.site/game/gooberries",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gooberries\", \"description\": \"Looking for information on Gooberries? Check out the release date (Mar 3, 2021), developer insights from Ryan Frank, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ryan Frank\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Gooberverse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1081070/header.jpg?t=1614776049\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}