{
    "AppID": 1439440,
    "Name": "Gravels of Endless War",
    "Release date": "Jan 29, 2021",
    "About the game": "Gravels of Endless War is a new online turn-based strategy game. There are 1v1 battles like in chess. Each gravel represents one unit. You have to create at least one team to start the online battles (but you can save different presets). Build your uniqe team! There are 18 available units but you can choose maximum 12. Each unit has a cost and you will have a budget so you have to optimize your selection. The unit's cost is very important because it determines how much you can move during the battles. The units are divided into 4 groups: Human Fantasy Mythical Spooky Unit types: Each unit has a type (Melee, LongRange, Magic). But be careful of the relation between the types. One type could be stronger than the other as you can see on the picture below. Each unit has the following properties: Damage Defense HP Visibility Luck Special abilities: Each unit has a special ability like Banshee's curse or Gashadokuro's movement restriction . Summon an elemental! The elemental summoning is the Peasant's special ability. If the peasant can go through the table and reaches the last row it will be able to summon an elemental. There are six elementals (Earth, Fire, Wind, Water, Light, Dark). The elementals are not included in the 18 available units so they can be only summoned by the Peasant. The elementals are much stronger than the other units. Wall You can add Wall to your team. The Wall has very high defense and it has no cost. But use it wisely because you can place maximum 5 walls in one battle. Fight for the War Relics There are 3 war relics in the game. In the beginning the 3 best player will be the relic holders. The relics will be allocated after the first week. If a relic holder looses a battle than the winner gains the relic. A relic holder has to play at least 5 matches in one day or he/she will loose the relic. The relics won't provide any in-game advantage for the relic holders. About Pricing The game is free to play. There won't be loot boxes, advertisements or other p2w elements. But you can be a donater to support and keep the game alive. The free users can use one game mode, they will be able to create new presets and they will be able to manage their teams. Donater 1 status You will be able to purchase the Donater 1 status 1, 2 or 3 months. Users with Donater 1 status will be able to join 2 additional game modes and they will be able to customize their gravels. Their username will be marked with the Donater 1 Tower. Donater 2 status If you want to help more than you can purchase the Donater 2 status. It is an additional payment and it is up to you how much you would like to pay. The username of the users with Donater 2 status will be marked with the Donater 2 tower.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1439440/header.jpg?t=1617287263",
    "Price": 0.0,
    "Developers": "Zolt치n Kucsik",
    "Publishers": "Zolt치n Kucsik",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1439440/ss_c8434e1d5deea338192c45a204d619d5c7c1d451.1920x1080.jpg?t=1617287263,https://cdn.akamai.steamstatic.com/steam/apps/1439440/ss_e6b2f90aa72cd19580df8db69a8a0ead50a33266.1920x1080.jpg?t=1617287263,https://cdn.akamai.steamstatic.com/steam/apps/1439440/ss_641639746c121014570e141065977ffc62f250ad.1920x1080.jpg?t=1617287263,https://cdn.akamai.steamstatic.com/steam/apps/1439440/ss_f0bcd91b86970989d9784f4e0eed60d30dbac28c.1920x1080.jpg?t=1617287263,https://cdn.akamai.steamstatic.com/steam/apps/1439440/ss_9e81e64fba9a9ea9ef13dd04b70fa04ceaec14d7.1920x1080.jpg?t=1617287263",
    "Slug": "gravels-of-endless-war",
    "Meta Title": "Gravels of Endless War: Jan 29, 2021, Zolt치n Kucsik and F...",
    "Meta Description": "Looking for information on Gravels of Endless War? Check out the release date (Jan 29, 2021), developer insights from Zolt치n Kucsik, and a complete game...",
    "Alt Text Image": "Official header image for Gravels of Endless War game - Steam 1439440",
    "Canonical URL": "https://gusku.site/game/gravels-of-endless-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gravels of Endless War\", \"description\": \"Looking for information on Gravels of Endless War? Check out the release date (Jan 29, 2021), developer insights from Zolt\\u00e1n Kucsik, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zolt\\u00e1n Kucsik\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zolt\\u00e1n Kucsik\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1439440/header.jpg?t=1617287263\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}