{
    "AppID": 1999120,
    "Name": "Heroes of Time 2 - Aizack's Return",
    "Release date": "Jun 2022",
    "About the game": "Last episode on RPG Maker MV The trilogy ends using RPG Maker MV engine. The last chapter of this saga totally remastered with MV graphics and systems. A side view battle system that was made for those who prefer seeing our heroes by this way. In this game you will be able to walk through the time constantly. You will choose between travelling in the past or in the future to save the timeline. There will be many tracks to go. Which will be yours? Soon more information about the new system that will be present on the 3rd chapter. Updates will come any time. Direct continuation of Heroes of Time. The story took place between two parallel realities (two of the seven possible endings from the previous game). The first being Aizack, who were defeated by Henzo and his friends in the previous story has now reawakened by the help of Lars, whose goal is to travel further in time, to the future from where he (Aizack) came. The other story took place right after Henzo and his group defeated Cronos, undoing any damage done to the timeline they once fickled. Timeless Game The premise In this third and final episode of the trilogy, it is now possible to travel through both the future and the past through the emblems on the ground that are found in various places around Ágaris. These emblems are time cracks opened due to Aizack's journey with his time machine. The user is teleported to a place known as the temporal dimension. This place connects the past to the present through open time cracks (through the emblems), making it possible to travel at any time to the future where Aizack, and Lars runs their evil schemes, as well as traveling to other emblems scattered in the past, thus giving the player freedom to face Aizack, and Lars at any point in the game. It's now up to the player to decide when they want to face Aizack in the future, only this time, however though, Lars and Aizack would not b e the only threat there, there is another being… the one that were once brought near destruction... in the land of Agaris. HENZO - A little more mature than in the last game, always carrying the Omega pistol in his pocket, he is taken by surprise by the appearance of Aizack, Lars and Gorgos in the middle of a movie session with his friends. WILLIE - Disappointed by the fact of not being remembered by people for the heroism he did in the last game, he faces yet another opportunity to be considered a hero. LENNA - With a guilty conscience for having done what she did to her trusted grandfather, she suspects that her grandfather is only in jail due to the corrections Cronos made, is also caught by a surprise by the arrival of a 'second version' of your grandfather from the past. EROS - Former Prince of Aqala, revived by Lars in events from the previous game, in this sequel he travels to the future precisely to let Henzo, Willie and Lenna know what is happening. AIZACK - Despite being killed long ago, in the year 1130, he is found on the edge of a river by Lars, alive. The two formed alliance and went with a scheme, to get revenge on Henzo and his friends. However, in another reality, in the year 2130, Aizack finds himself in a different situation because of certain someone. LARS - The person responsible for every tragedy that happened, After being defeated in the previous game, he recovers and finds Aizack seriously injured by those who were later known as the Hero of Agaris, with the two have their motives set, devised a scheme to get revenge on those who defeated him, traveling with the help of Aizack's intellect to build a device that takes them to the future where Henzo thought he saved the world",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1999120/header.jpg?t=1658673942",
    "Price": 4.99,
    "Developers": "Metthink",
    "Publishers": "Metthink Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_a42a5608b2eecd2657075bef9f7cfe69e05d9a4b.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_8ed5728293ec5bcea61f8b61259b9384f7ef2fd8.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_17ffb7376714c38a5f157738ce1e332893b87ac0.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_ef94870735d87045dc023ab37af133b9ac1a71b7.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_28f651901501c59bbe0ccbeb31755bcf0574a55f.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_ade8bc7b464c0e970601ce53b085836f9b37f615.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_a3e0dd6133e193ce6812f835642cea2f881e42ab.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_b8c59d83cafcdc2fe33c0bdf1aa770a0342dbbb5.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_f878dd6fc9ed2fb7dcd91f7dcba3c9fc29fbf4eb.1920x1080.jpg?t=1658673942,https://cdn.akamai.steamstatic.com/steam/apps/1999120/ss_9fc98fd2a1e4e89d003a9a9ade28bcc0e14fa28e.1920x1080.jpg?t=1658673942",
    "Slug": "heroes-of-time-2-aizack-s-return",
    "Meta Title": "Heroes of Time 2 - Aizack's Return: Jun 2022, Metthink an...",
    "Meta Description": "Looking for information on Heroes of Time 2 - Aizack's Return? Check out the release date (Jun 2022), developer insights from Metthink, and a complete g...",
    "Alt Text Image": "Official header image for Heroes of Time 2 - Aizack's Return game - Steam 1999120",
    "Canonical URL": "https://gusku.site/game/heroes-of-time-2-aizack-s-return",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heroes of Time 2 - Aizack's Return\", \"description\": \"Looking for information on Heroes of Time 2 - Aizack's Return? Check out the release date (Jun 2022), developer insights from Metthink, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Metthink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Metthink Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1999120/header.jpg?t=1658673942\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}