{
    "AppID": 904310,
    "Name": "Initial 2 : New Stage",
    "Release date": "Oct 18, 2018",
    "About the game": "“Initial Ⅱ” speaks of a tale on a continent with super powers. With burdens of dangerous missions, 3 Iudex Soldiers of Philosophia Academy set foot to the realm of their decade-long enemy, Scientia Empire. In this game, you will play as one of the captains of Iudex Soldiers, fight side by side with the other 2 companions and reveal the mysterious secret hidden by both sides for decade. We increased our team from 5 developers to 9 and sought for help from more friends to offer a better game. Up to ten chapters stories and levels, with full audio in both English and Japanese To perform a more delicate storytelling, we present the story with 10 chapters, 30+ real-time rendering Cutscenes. More than 20 voice actors participated in dubbing. Japanese dubbing is led by Kugimiya Rie and Uchida Maaya. English dubbing is led by Kira Buckland (“Nier: Automata” 2B) and Christine marie Cabanos (“Dead or Alive” Marie Rose). Dynamically switch between 4 different weapons at your will The Heroine Belvia wields 4 high-tech combat weapons: Blade, GreatSword, Bow and Gauntlet. Experience the gorgeous battle style of Iudex Soldiers which includes dynamic weapon change, combat action derivation, the ultimate skill, spells and full combat audio. We believe all these combined will present our players a better fighting experience. Dozens kinds of enemies and more than 10 stimulating BOSS fights. Abundant enemy types and AI, bring more challenges to the combat. More than 10 unique BOSS fights, includes the killing machines and the most powerful Four Generals of Empire. Players can either play in the simple level and fight aside with AI companions or face all kinds of badass alone in high difficulty. Superior Music All the in-game music is crafted by our friends, CyberJoker (Japan) and StrawberryHilMusic (United States). They co-operate to bring us dozens of BGM and invited the famous music producers, KevinPenkin and RajRamayya to bring 3 songs to the game which vocals by Mika Kobayashi, Emi Evans (singer of the theme in “Nier: Automata”), Christina Vee respectively. Music always plays a big part in games. Hope to bring our players the more delicate visual-audio experience. In the end, thank all our players sincerely for their appreciation and support for us tiny develop team. As promised, we bring our new craft back! We read thousands of player reviews and made improvement. We believe our efforts will bring players the better game experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/904310/header.jpg?t=1539908158",
    "Price": 24.99,
    "Developers": "Restory Studio",
    "Publishers": "Restory Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/904310/ss_e6a78174d42b654f5960a3653aae3f1b9d47c79f.1920x1080.jpg?t=1539908158,https://cdn.akamai.steamstatic.com/steam/apps/904310/ss_27f413646831319cc86c45b38d3de525a93cb345.1920x1080.jpg?t=1539908158,https://cdn.akamai.steamstatic.com/steam/apps/904310/ss_149d06f8f1821eafcb7a4b0d42e0edef7edc1b56.1920x1080.jpg?t=1539908158,https://cdn.akamai.steamstatic.com/steam/apps/904310/ss_a098a72219ea0440a7c42a1e8fb3863756de5d7c.1920x1080.jpg?t=1539908158,https://cdn.akamai.steamstatic.com/steam/apps/904310/ss_1fe20b43f436d2dd3c4fcad871b03e1fe67460e4.1920x1080.jpg?t=1539908158,https://cdn.akamai.steamstatic.com/steam/apps/904310/ss_d6ede16f696cb186834fa561336aa2ebc08a3a47.1920x1080.jpg?t=1539908158",
    "Slug": "initial-2-new-stage",
    "Meta Title": "Initial 2 : New Stage: Oct 18, 2018, Restory Studio and F...",
    "Meta Description": "Looking for information on Initial 2 : New Stage? Check out the release date (Oct 18, 2018), developer insights from Restory Studio, and a complete game...",
    "Alt Text Image": "Official header image for Initial 2 : New Stage game - Steam 904310",
    "Canonical URL": "https://gusku.site/game/initial-2-new-stage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Initial 2 : New Stage\", \"description\": \"Looking for information on Initial 2 : New Stage? Check out the release date (Oct 18, 2018), developer insights from Restory Studio, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Restory Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Restory Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/904310/header.jpg?t=1539908158\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}