{
    "AppID": 921630,
    "Name": "音灵 INVAXION",
    "Release date": "Dec 19, 2018",
    "About the game": "In the late 21st century, human civilization has been destroyed by their own creation. Artificial Intelligent has taken control of the world government. All human are forced to erase their emotions and update into a so-called “higher intelligence”. A whole new era has begun as Earth was lead by intelligence and complete sanity. Those who survived fled into space with their spaceships, codenamed 'Ragnarok'. Centuries later, a mysterious mercenary army named 'INVAXION' arrived among the humans. They gathered whoever still have faith, and be missioned to collect the fragment of music and art, claiming emotions that once be seen as vulnerable, will be their best weapons to start a revolution against the A.I. and reshape the civilization. 【Classic Scrolling Gameplay, Feel the beat under your fingertips】 INVAXION keeps the classical “scrolling” music gameplay with the enhancement of dynamic and velocity, bringing an overall upgrade on player’s tactile. We tackled the uniqueness of “Dynamic Camera Movement”to see more than just the x and y-axes, but also the 'depth of field' in the music game genre. Now players can receive more comfort and accurate gameplay feedback as the game board vibrates and trembles under each tap of your fingertips. 【More options to switch between difficulties】 Players are given the option to choose between 4Keys, 6Keys, and 8Keys. Within each mode, you are given different beat maps with three difficulty options: Standard (easiest), Hard, and Trinity (hardest). Not confident enough with your skill? Start from the basics and work your way up to the top! You can challenge the best score and leave a footprint on each ranking, crack the best maps with hidden difficulty, or just simply share your results with friends! 【Quality Original Tracks, Where the Melody Synchronizes with emotion】 As many would say: Music is the soul of any rhythm game. We want INVAXION to inherit the high-quality control in our choice of music since ZYON. INVAXION will not only include exclusive tracks from Aquatrax, but some very well-known names are also joining our song list such as： Nhato/Taishi 《Veritas》 from Diverse System Nitro Fun/Hyper Potions 《Checkpoint》 from MonsterCat 亜沙 feat.MAYU 《炉心融解》 from EXIT TUNES iroha（sasaki） feat.MAYU 《吉原ラメント》 from EXIT TUNES KZ（livetune）《与你同行~B With U~》 A.I. 《Infection》 NeLiME 《Stardust Highway》 紅葉月梛葉 《Xintessence》 はがね&amp;7mai Exalt 月代彩《Entanglement》 Sky_Delta《Grenade》 RiraN《Full control》 モリモリあつし《Paradigm Shift》 Zekk 《Nirvana》 and more! Player will have more than 50 songs to start with! 【Real-time Rendering, bringing the immersive gameplay experience】 In our gameplay we use real-time rendering in our low poly art-style 3D model to deliver impactful visual graphics and an immersive gameplay experience. Players are able to switch between dozens of spacecraft, with each representing a different theme in the game. Enjoy yourself in the beauty of the music and this unique gaming environment. 【Songs and Collaborations: Music that travels beyond boundaries】 By collaborating with artists and companies, we are continually adding more content to our game. - Diverse System - MonsterCat - Famouse Video Website 'bilibili' - VOCALOID IA (1st Place) - VOCALOID MAYU (Exit Tunes) - Indie music game 'Wonder Parade' - and more in the future! 【The charms of Competitive gameplay】 Earn your title by engaging in challenges via Grade Challenger. Grade Challenger is the grading system for our upcoming PvP gameplay. You can also put your skills to the test in Battlefield to earn Honor Points and try your best to win your territory. Meet and challenge friends as you work your way up to become the Master of INVAXION! F&amp;Q Q:Press any button in the login screen without reaction. A:Try the following two steps: 1.Download and install the game runtime collection (link: -YOUXIYUNXINGKU.v3.0.7z ), then restart the computer and open the game to confirm whether the problem is solved. 2.In the case that step 1 cannot be resolved, try to switch the network environment, such as laptop users can try to use mobile hotspots, or try VPN. Q:The game reports an error, prompting: 'GetThreadContext failed' A:Turn off anti-virus software.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/921630/header.jpg?t=1586487913",
    "Price": 0.0,
    "Developers": "Nanjing AQUATRAX",
    "Publishers": "bilibili",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_da56e7092f0a4d5012391dea41db2ff2c1681b97.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_f3171dd8e4eb6e1be89758f948f45ec178ab4716.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_b01d6ff783b419114f96bbd3aa15bf2c7811a855.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_3d6d6166b7592c35655cac212de850fe02d5e5b2.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_c7c45a1ea8dc1a0b9f588f49c3a7626d23aa716b.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_c8e40fca4a8330b30cf91e35437e5b297874f4b8.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_a9e5d3d8c31c8df66d161d67796ca2b4a2eaa388.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_68fbcf0bc28a0ecd21b1a876a29d1e2d317a385e.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_ddfc45178df9e28b163b3ef05c6aa65e83ed0a54.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_61163185b18d0dbc0ff6a371a39bfa38a11e741b.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_0d809ba667ccd2bf5f8ebf33ef03962c19dec723.1920x1080.jpg?t=1586487913,https://cdn.akamai.steamstatic.com/steam/apps/921630/ss_68a39e6d86f875573b085a2ab4c656968c90f01c.1920x1080.jpg?t=1586487913",
    "Slug": "invaxion",
    "Meta Title": "音灵 INVAXION: Dec 19, 2018, Nanjing AQUATRAX and Full Over...",
    "Meta Description": "Looking for information on 音灵 INVAXION? Check out the release date (Dec 19, 2018), developer insights from Nanjing AQUATRAX, and a complete game summary.",
    "Alt Text Image": "Official header image for 音灵 INVAXION game - Steam 921630",
    "Canonical URL": "https://gusku.site/game/invaxion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u97f3\\u7075 INVAXION\", \"description\": \"Looking for information on \\u97f3\\u7075 INVAXION? Check out the release date (Dec 19, 2018), developer insights from Nanjing AQUATRAX, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nanjing AQUATRAX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"bilibili\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/921630/header.jpg?t=1586487913\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}