{
    "AppID": 843760,
    "Name": "Kemonomichi-White Moment-",
    "Release date": "May 3, 2018",
    "About the game": "Adventure novel　game. (English subtitles) Story synopsis： Large sword in hand, a man plans his escape from the organization. Running from his pursuers, he is forced to wander. Then, before his eyes… a girl appears. In the silver-haired girl’s hand, a long sword that seems otherworldly. The moment she sees him, she attacks at blinding speed. Despite his artificially enhanced body, the girl’s attacks move with god-like speed slowly closing in on him… One can only wonder why she is after him as she glares with glowing red eyes that pierce the shadows… “Kemono Michi” is the story of a man who lost his memory and his grueling fight against a sinister organization. ※“Kemono Michi” means beast road. Software Usage Instruction Manual: ———————————————————————— We would like to thank you very much for purchasing “Kemonomichi ~White Moment~”. ———————————————————————— Game functions and explanations: ———————————————————————— Upon game start: -NEW GAME — Select to start a new game. -LOAD GAME — Select to continue your game (from a save point). -EXIT — Select to quit the game. During game play (Click on the icon in the lower right to access the options): -Save — Saves your progress. -Load — Quit your current game and restart from a save point. -Hide the Messages — Temporarily hides the message window. (When viewing CG sequences.) -Skip Reading — Will automatically skip past scenarios that you have already read. -Return to Top Menu — Quit your current game and return to the top menu. *Click on the X button in the upper right corner of the menu to return to the game. Buttons within the game window: -SAVE button — Allows you to access the Save menu screen. -LOG button — Allows you to look over dialogue you’ve already read. This will allow you to read anything you may have accidentally skipped. -AUTO button — Allows you to progress through the game without clicking. The game will pause at selection screens until a choice has been made. --------------------------------------------------------------- [Some programs protrude from the screen and displayed] After disabling multi-monitor support, some programs may be displayed out of the screen. Cause) This phenomenon may occur if the program was displayed on a monitor other than the primary monitor before disabling multi-monitor support. Solution) To solve this problem, use one of the following methods. Method 1) Start the program. Right-click the program on the task bar and click Maximize. Right-click a blank area on the task bar and click [Overlay]. Change the window of the program to the appropriate size. Method 2) Start the program. Right-click the program on the task bar and click [Move]. Move the mouse pointer to the center of the screen. Use the arrow keys on the keyboard to move the program's window to the screen display area. Press the Enter key. Change the size of the window as necessary. Method 3) Note: The following method can not be used if the display adapter of the secondary monitor has been deleted from the computer. Click the [Start] button, point to [Settings], click [Control Panel], and double-click [Display]. Click the Settings tab. In the Display box, click the secondary display adapter. Deselect the Allow Windows desktop to move on this monitor check box and click OK. ※ This phenomenon may also occur when you change the placement of the monitor on the [Settings] tab of [Display Properties].",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/843760/header.jpg?t=1525396316",
    "Price": 9.99,
    "Developers": "MBF FILMs",
    "Publishers": "SouthWorks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/843760/ss_c5e1d5f1ccbbea838a4f053ff82c774a24a03151.1920x1080.jpg?t=1525396316,https://cdn.akamai.steamstatic.com/steam/apps/843760/ss_4226bee9579a2026a535c22904ba10876ca08e58.1920x1080.jpg?t=1525396316,https://cdn.akamai.steamstatic.com/steam/apps/843760/ss_c72b5131e51bab7a77f1eb3639c98f3ec9b2f723.1920x1080.jpg?t=1525396316,https://cdn.akamai.steamstatic.com/steam/apps/843760/ss_b685ca804bd647a943d1cc9d99ad12c158656ffd.1920x1080.jpg?t=1525396316,https://cdn.akamai.steamstatic.com/steam/apps/843760/ss_bddbb74790c484892f574ab0172e41c5e6ee2c78.1920x1080.jpg?t=1525396316,https://cdn.akamai.steamstatic.com/steam/apps/843760/ss_2b2eb82e993d9b9e5e200fddba8a14997c6436ac.1920x1080.jpg?t=1525396316",
    "Slug": "kemonomichi-white-moment",
    "Meta Title": "Kemonomichi-White Moment-: May 3, 2018, MBF FILMs and Ful...",
    "Meta Description": "Looking for information on Kemonomichi-White Moment-? Check out the release date (May 3, 2018), developer insights from MBF FILMs, and a complete game s...",
    "Alt Text Image": "Official header image for Kemonomichi-White Moment- game - Steam 843760",
    "Canonical URL": "https://gusku.site/game/kemonomichi-white-moment",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kemonomichi-White Moment-\", \"description\": \"Looking for information on Kemonomichi-White Moment-? Check out the release date (May 3, 2018), developer insights from MBF FILMs, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"MBF FILMs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SouthWorks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/843760/header.jpg?t=1525396316\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}