{
    "AppID": 429020,
    "Name": "LONE WOLF: Horizon",
    "Release date": "Feb 12, 2016",
    "About the game": "NOTICE Due to altercations and difficulties within development, and outside of development, development on LONE WOLF: Horizon has been halted for the foreseeable future. SUMMARY LONE WOLF: Horizon is an open-world survival army-management first person shooter. Play as the military leader of the United World Army to take down the terrorist organization known as the Separated Nation Army. OVERVIEW LONE WOLF: Horizon takes place on an isolated island on planet Alice-43b, an alien planet full of flora and fauna. A rebellious and fierce terrorist organization, named the Separated Nation Army, fled to Alice-43b, to set up a headquarters to build an army. Earth's united army, known as the United World Army, took off after the Separated Nation Army. For several decades these two forces have been in an intense war with each other across the galaxy. In LONE WOLF: Horizon you play as the currently deployed military leader. You fight on the battlefield, trying to bring the UWA's influence up to take over the SNA. You have a bank balance which always has money in it; however, the amount of soldiers you have determines the bank balance. The higher number of soldiers in your army, the bank balance will decrease as you pay those soldier's salaries. You can fire soldiers to gain extra money, to buy weapons at the city center located on the island. However, firing these soldiers anger them, leading them to join the rebels, increasing the enemy influence, and bringing the UWA influence down. This lets you choose two paths: a large army, working together to defeat the terrorist organization, and claiming no fame, or going in as a lone wolf, with a shiny, powerful weapon, against a highly skilled and powerful terrorist army. FEATURES Player vs AI Player vs Environment Huge firefights in an open world Weapon loot Weapon rarity system Ranking system Army management system Weapon purchasing Army influence system Planetary warping Unique world events PROMISES FREE updates to the main game: The main game will have FREE updates forever, but DLC may be added as expansions to the universe, such as more planets to warp to or side missions. However, not having these DLCs, will not limit you in anyway in the main game. No microtransactions: DLCs are not microtransactions, however, mobile-like microtransactions will never be placed into the game. No DMCA takedowns on YouTube videos: Want to make a video bashing the game? Go ahead. Want to make cool videos about the game? Go ahead. It's fair game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/429020/header.jpg?t=1563400203",
    "Price": 0.0,
    "Developers": "m4g",
    "Publishers": "M4GDEV",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_aeca2a2354fc8a99aac44fc05de2092c6882e65b.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_74d0638c4e233126e19ef2f33eb15953f2b03891.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_d79ce4bf60a679ce02078180d472fba2f8b69218.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_809378e2dbe62295a34a80c5dc1426d8ee184174.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_517bce3fe7066ab7474c5368202c8cba2f763611.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_ccddeef9a86902452615b417324b70be7eb5abff.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_fc65c0b24812887abab841ebca28782245bac2a8.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_4d932eb9953b75640387eb1f7d2f5fc9e2a431b9.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_6622ec175fd5ceaab7bfc2d608344227422de34b.1920x1080.jpg?t=1563400203,https://cdn.akamai.steamstatic.com/steam/apps/429020/ss_832708aebffa265f1e7c0480f013920c9ac295a1.1920x1080.jpg?t=1563400203",
    "Slug": "lone-wolf-horizon",
    "Meta Title": "LONE WOLF: Horizon: Feb 12, 2016, m4g and Full Overview",
    "Meta Description": "Looking for information on LONE WOLF: Horizon? Check out the release date (Feb 12, 2016), developer insights from m4g, and a complete game summary.",
    "Alt Text Image": "Official header image for LONE WOLF: Horizon game - Steam 429020",
    "Canonical URL": "https://gusku.site/game/lone-wolf-horizon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LONE WOLF: Horizon\", \"description\": \"Looking for information on LONE WOLF: Horizon? Check out the release date (Feb 12, 2016), developer insights from m4g, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"m4g\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M4GDEV\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/429020/header.jpg?t=1563400203\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}