{
    "AppID": 1087050,
    "Name": "Mondrian - Plastic Reality",
    "Release date": "Sep 22, 2020",
    "About the game": "Mondrian's back, and he's taking his friends for a spin through the Plastic Reality. In this sequel to the award-winning Mondrian - Abstraction in Beauty , you play as five great 20th Century artists as you uncover the lost masterpieces of the Modernist movement. Mondrian's orbital brickbreaking gameplay returns with all new additions, improvements, and challenges; build your own Art Museum, a hub world for your artistic collection; and create levels to challenge your friends using Steam Workshop and the all new Mondrian Maker level editor. The canvas is waiting, are you ready to explore its mysteries? Episodic Art Heists Jump into paintings to discover lost works of the 20th Century, build your Art Museum, and make new friends on the way. Storyline episodic content is released for free, and side stories/exhibits cover the works of independent artists from around the globe. Modernist Arcade Gameplay Mondrian - Plastic Reality takes classic arcade, brickbreaking gameplay and gives it some serious twists. Orbit around levels that run the gamut from traditional, abstract block forms to recreations of Renaissance masterpieces. But be careful, there are no second chances, and losing your ball means getting tossed back to the Museum. Express Yourself Freely Feeling creative? The included Mondrian Maker level editor lets you create your own Mondrian levels in seconds! Take a few minutes and make them crazy challenges for your friends or highly detailed artistic works (or both at the same time). Play your level in Test Mode and design thumbnails (or prints and social media posts) in Mondrian Studio to share on Steam Workshop ! See the Anyone Can Create section below for more info. Play Your Way Play over 100 levels in any of the game's Quick Play modes, including Endless (no punishment for losing), Gem Hunt (double or nothing in between rounds), and Arcade (compete for Leaderboard spots) modes. Choose from five different characters, adjust Options and accessibility settings, play levels, build worlds, and experience art from every possible angle. Community for Creatives Challenge your friends or create stunning works in Mondrian Maker and Steam Workshop. Build your own Art Museum. Discover works from artists worldwide in downloadable exhibits (coming soon). Take part in creative events like Makersmas that celebrate creativity in all forms. Join the community, express yourself, and be a part of the Plastic Reality family of artists today! Always wanted to try your hand at art or level design but could never get started? Mondrian - Plastic Reality comes with TWO design suites to help you get in touch with your creative side. Mondrian Maker is a drag-and-drop level editor designed from the ground up to be as user-friendly as possible! You'll be building levels in seconds, and the included Mini Manual and Tooltips are there to help you in case you get lost. Mondrian Studio is an intuitive graphic design toolchest to help you present your creations in any form. Change your image's size, colors, background, and visual effects with just a few sliders and button clicks, and instantly save out Steam Workshop thumbnails, or copy the image to your clipboard to share on social media. Share your creations on Steam Workshop in just a couple clicks, right from inside the game. With Mondrian Maker and Mondrian Studio , we truly believe anyone can create, and we can't wait to see what you come up with! All owners receive Mondrian Maker AND Mondrian Studio free of charge. We encourage you to build and submit levels on Steam Workshop ! How is Plastic Reality different from Abstraction in Beauty ? Plastic Reality takes the original game's gameplay to a brand new level. We have introduced five playable characters, brand new obstacle types, Block Modifiers which can be added to and layered on any block, mod compatibility, an easy-to-use level editor, revamped animations, new sound effects, and a whole lot more. Basically, if you liked the first game, you're going to love this one. What languages does the game support? At the moment, the only language supported is English, but we plan to localize into others, and have already developed the backend to support localization soon! What OS's does the game support? Windows-only at the moment. We do plan to bring this one to more platforms in time. Stay tuned! What accessibility options are available? You can control the game speed, screenshake, and controller rumble levels in the Options menu. There are 4 difficulty selections when you start a new game. You can also control the game via keyboard, mouse, controller, or touchscreen simultaneously. How do I use Mondrian Studio ? Simply open your level in Mondrian Maker , click the 'Play Your Level' button, and choose 'Open in Studio.' For in depth instructions on each tool, you can view our Mondrian Studio tutorial on YouTube . What do I do if a find a bug? Please visit the Bug Reports forum on the Steam Community. We promise we do everything we can to fix any issues found in as speedy a time as possible. We would appreciate it if you not use a Steam Review to report bugs, as we consistently check the Bug Reports forum for any new issues that have appeared. Thank you for understanding and cooperation. What do you mean by 'Partial Controller Support?' You can currently use a controller (and even a Steam Controller) to start the game, play quick play modes, access the menu, change options, walk around in and modify the museum, etc. You cannot currently use a controller in Mondrian Maker. These are areas we're addressing as we get to them and are fully committed to bringing the game back up to Full Controller Support ASAP. Update: As of version 1.0.10f5, you can use a controller to decorate your Museum!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1087050/header.jpg?t=1658847545",
    "Price": 14.99,
    "Developers": "Lantana Games",
    "Publishers": "Lantana Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1087050/ss_767224a83cc93a57b431454f2f4fdd7534934551.1920x1080.jpg?t=1658847545,https://cdn.akamai.steamstatic.com/steam/apps/1087050/ss_2592698c38e6a57822a412851d090e6b2ea97a0b.1920x1080.jpg?t=1658847545,https://cdn.akamai.steamstatic.com/steam/apps/1087050/ss_f4dd7b852b116140ea30eae1e68feca0d3f5e381.1920x1080.jpg?t=1658847545,https://cdn.akamai.steamstatic.com/steam/apps/1087050/ss_7f727184cd06442a0fd35257654df6a3b797e7f9.1920x1080.jpg?t=1658847545,https://cdn.akamai.steamstatic.com/steam/apps/1087050/ss_1fdb245f42f5c433341efe333aa1c4b3e13461d5.1920x1080.jpg?t=1658847545",
    "Slug": "mondrian-plastic-reality",
    "Meta Title": "Mondrian - Plastic Reality: Sep 22, 2020, Lantana Games a...",
    "Meta Description": "Looking for information on Mondrian - Plastic Reality? Check out the release date (Sep 22, 2020), developer insights from Lantana Games, and a complete ...",
    "Alt Text Image": "Official header image for Mondrian - Plastic Reality game - Steam 1087050",
    "Canonical URL": "https://gusku.site/game/mondrian-plastic-reality",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mondrian - Plastic Reality\", \"description\": \"Looking for information on Mondrian - Plastic Reality? Check out the release date (Sep 22, 2020), developer insights from Lantana Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lantana Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lantana Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1087050/header.jpg?t=1658847545\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}