{
    "AppID": 1412500,
    "Name": "Paralyzed",
    "Release date": "Dec 18, 2020",
    "About the game": "Paralyzed has over twenty unique levels with a large variety of obstacles and enemies. As you progress through the game the challenge increases, always keeping you on your toes and ensuring satisfaction upon level completion. Beating a level unlocks 1-2 new levels, making sure you never get stuck with only one level left to play. Level Themes The game has five different themes, each one with four levels of increasing difficulty. Cube To make an enemy cube jump out of your way, all you have to do is match the color and press space , simple right? If you're curious you could also find out what happens if you do that while you're on top of it... Laser The lasers are simpler than the cubes, all you have to do is match their color and you'll phase right through them. Be on the alert though, these 'simple' obstacles combined with the cubes can be a deadly combination! Fire These work like reverse lasers, meaning they're only dangerous when you match their color. It may sound easy but they're not something you should play around with, or you might very well get burnt. Car Cars are handled the same way as the cubes but with the caveat that while other obstacles are stationary, these move. In other words you'll need even faster reflexes if you don't want to crash. All All is... you guessed it, a combination of everything! These levels are the ultimate test of your skills combining all obstacles, resulting in the hardest levels by far. The fourth and final level of this theme is the FINALE of the game, if you beat that level you will have mastered Paralyzed. Endless Mode After beating Car-1 you'll unlock endless mode. In endless mode you'll get a new randomized level every time, keeping the experience fresh. The level will get harder and harder the further you go until you eventually die. Battle against the best players on the leaderboard to see who's the king of Paralyzed! Practice Mode If a level is too challenging to finish in one go, you have the practice mode available for training. Put down as many checkpoints as you want to get sense of the whole level, or combine them with the use of self-destruct to practice specific parts. Levels finished in practice mode won't count towards the normal game progress, but hopefully it will help you prepare for the real deal. Colorblind support The four main colors have been chosen to be easily distinguishable, no matter if you're colorblind or not. The background colors can be disabled in favor of a plain white background, should the colors be too distracting. Stats and Settings We both know what kind of person you are if you're still reading this, and we've got you covered with all the statistics you could want. See which obstacles or colors are the deadliest, track how many times you've died, 'jumped', switched color and much, much more. For settings we have the option to bind the colors to whatever you want, including a controller if that's your preference (don't do that though, playing with a controller is very hard). Multiple ways to 'jump' is also available in the settings, be sure to experiment to find what suits your playstyle the best. More features are also planned as free updates coming in 2021, so be on the lookout for those!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1412500/header.jpg?t=1655424861",
    "Price": 3.99,
    "Developers": "Alexander Lahti",
    "Publishers": "C Horse Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_fde4156f06a09cd28c6eb3b74891db000ba69c9d.1920x1080.jpg?t=1655424861,https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_88c4586fea0cc7284af353d8baef8d0ce32deefd.1920x1080.jpg?t=1655424861,https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_65e04fb1f5a16e5f25e9fd7790eaa440550a444f.1920x1080.jpg?t=1655424861,https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_e54d4ebcec7b189e1fe36a753e24b0075bcc8cd7.1920x1080.jpg?t=1655424861,https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_5e24b6227aa4c29444e1883b89d1150c978b7ae1.1920x1080.jpg?t=1655424861,https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_4225c79b046dcffa4d5a20b2bd10d90a6f01f6d8.1920x1080.jpg?t=1655424861,https://cdn.akamai.steamstatic.com/steam/apps/1412500/ss_804cb589ab8deb88fc9aece9ebe7dd88edd9ee7a.1920x1080.jpg?t=1655424861",
    "Slug": "paralyzed",
    "Meta Title": "Paralyzed: Dec 18, 2020, Alexander Lahti and Full Overview",
    "Meta Description": "Looking for information on Paralyzed? Check out the release date (Dec 18, 2020), developer insights from Alexander Lahti, and a complete game summary.",
    "Alt Text Image": "Official header image for Paralyzed game - Steam 1412500",
    "Canonical URL": "https://gusku.site/game/paralyzed",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paralyzed\", \"description\": \"Looking for information on Paralyzed? Check out the release date (Dec 18, 2020), developer insights from Alexander Lahti, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alexander Lahti\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"C Horse Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1412500/header.jpg?t=1655424861\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}