{
    "AppID": 386740,
    "Name": "Puzzle Strike",
    "Release date": "Dec 21, 2015",
    "About the game": "Puzzle Strike is a deckbuilding puzzle game played amongst Fantasy Strike characters. It's inspired by puzzle games such as Puzzle Fighter. Gems fall into each player's gem pile every turn, and whoever's gem pile fills up first loses. Improve your deck (of chips!) by purchasing new chips as the game unfolds. Will you go heavy on economy, offense, or build an intricate engine? In any case, make sure to adapt to your opponents because Puzzle Strike has a lot more interactivity than most other deckbuilders. And like the other games in the Fantasy Strike universe, Puzzle Strike is designed to hold up to thousands of games at the expert level, and we fully embrace the philosophy of even-playfield competition. The new Steam version of Puzzle Strike (as well as the upcoming iOS release) have these new features: Runs natively on Mac, PC, and Linux (new!) Cross-platform play with players on iOS Chips have 4x the resolution as the web version Issue challenges to people on your Steam friend list Climb the leaderboards in Quick Match and check out replays of top players to improve your game! New Puzzle Challenge mode: learn advanced character tactics and think outside the bag! Beat these advanced challenges to become a real Puzzle Striker! Complete your Daily Quests to earn Jewels, then spend them to play 'Puzzle Smash', a high-powered version of Puzzle Strike Contains all 48 Puzzle chips from both Puzzle Strike Third Edition and Puzzle Strike: Shadows, as well as the promo chips, Combinatorics, Dashing Strike and Custom Combo Practice offline against AI Puzzlebots for the first time! Launching with English and French language support, with German and Japanese localization on the way The base game comes with the first ten characters (Grave, Jaina, Midori, Setsuki, Rook, DeGrey, Valerie, Geiger, Lum, and Argagarg), and the ten Shadows characters are available as an expansion",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/386740/header.jpg?t=1572487096",
    "Price": 14.99,
    "Developers": "Sirlin Games",
    "Publishers": "Sirlin Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/386740/ss_a607e798a3abc780ae77bd9418de9bfe3b2a94fa.1920x1080.jpg?t=1572487096,https://cdn.akamai.steamstatic.com/steam/apps/386740/ss_aa32a2d7e797ab871902872169f1d8c3f42d2df1.1920x1080.jpg?t=1572487096,https://cdn.akamai.steamstatic.com/steam/apps/386740/ss_2af8df83f62a714f78ba0f4944454442803f017c.1920x1080.jpg?t=1572487096,https://cdn.akamai.steamstatic.com/steam/apps/386740/ss_880dabb645d62e886782d72b65ddc266ef027197.1920x1080.jpg?t=1572487096,https://cdn.akamai.steamstatic.com/steam/apps/386740/ss_282777644901db5d74c805225fc1a7c2bdd043d3.1920x1080.jpg?t=1572487096",
    "Slug": "puzzle-strike",
    "Meta Title": "Puzzle Strike: Dec 21, 2015, Sirlin Games and Full Overview",
    "Meta Description": "Looking for information on Puzzle Strike? Check out the release date (Dec 21, 2015), developer insights from Sirlin Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Puzzle Strike game - Steam 386740",
    "Canonical URL": "https://gusku.site/game/puzzle-strike",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Puzzle Strike\", \"description\": \"Looking for information on Puzzle Strike? Check out the release date (Dec 21, 2015), developer insights from Sirlin Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sirlin Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sirlin Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/386740/header.jpg?t=1572487096\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}