{
    "AppID": 1059150,
    "Name": "Ritual: Crown of Horns",
    "Release date": "Nov 7, 2019",
    "About the game": "Ritual: Crown of Horns is: HORDE MODE GAME based on GUT INSTINCT TACTICS FAST PACED | 3D TOP-DOWN | WITCH DEFENSE SHOOTER WEIRD WESTERN AESTHETIC | ARCADE GAMEPLAY | SKILL BASED Ritual: Crown of Horns is a slaughterhouse: a fast-paced action game set in an alternate Wild West, a demonic version of a hellish frontier. This arcade-inspired title unravels a tale about an unlikely duo: a bounty hunter who comes back from beyond the grave, yearning to exact revenge on his killers and a witch who aids him with a series of powerful rituals to further her own agenda. Push back hordes of enemies, while the witch performs her ritual. Use a whole arsenal to your advantage: mindfully swapping between weapons and spells. Unlock new tools and powerful items boosting your character. Travel throughout the Weird West picking your missions and planning future unlocks to finally exact your revenge! Ritual: Crown of Horns is a skill based game, where split-second decisions and planning on the go are more powerful than button mashing and throwing yourself mindlessly at enemies. We have A unique auto-aiming system that distinctly sets itself apart from your average twin-stick shooters : instead of spraying and praying, you are an elite gunslinger who makes every shot count. A satisfying arsenal : shotguns, six-shooters, rifles, crossbows, and a few surprises that are a little less era-appropriate. Outrageous enemies : brainwashed cultists, supernatural legendary creatures, bizarre murderous contraptions – you name it. Gear : mysterious capes, hoods and amulets that you can customize and get powerful buffs for your character. Creative spells and power-ups that can violently alter the way you approach each combat encounter. Plenty of insane levels for you to master, each complete with unique challenges tailored to push the combat system to its limits. A unique gothic-horror-meets-weird-western artstyle. It's 18XX You were a lawman on a mission to track down a dangerous witch. Upon reaching your goal, you found yourself in a fatal ambush prepared by horned beast-like men. Your death was probably just collateral damage, quickly brushed under the carpet. Now, brought back from beyond the grave by the dark magic of the witch you were supposed to take out, you find yourself in a forced alliance against a common enemy. Understand the powers responsible for your misery and get rid of them once and for all. Make friends and enemies along the way. Traverse the entire United States of America to exorcise its demons. Ritual: Crown of Horns is a game about wrecking havoc on history, seeing through false narratives and embracing your inner monster.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1059150/header.jpg?t=1626266253",
    "Price": 19.99,
    "Developers": "Draw Distance",
    "Publishers": "Feardemic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_7458fc4827d4dbff471ac7c78cd13f694eafb3e0.1920x1080.jpg?t=1626266253,https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_a99f686df4cbe750b9c128838f514804460dc069.1920x1080.jpg?t=1626266253,https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_f4728d92ac85beea40ce6051378f700550d13fa3.1920x1080.jpg?t=1626266253,https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_199aec5f6202442429b09f0eca39316cae493034.1920x1080.jpg?t=1626266253,https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_c6e179e21d9d1b36cc6782c1a01132b22b412b29.1920x1080.jpg?t=1626266253,https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_20154f0b26554408f9a5e900fda4313dbc5f81d9.1920x1080.jpg?t=1626266253,https://cdn.akamai.steamstatic.com/steam/apps/1059150/ss_b3080b74d9b94a25126769877102d9bab20f6e35.1920x1080.jpg?t=1626266253",
    "Slug": "ritual-crown-of-horns",
    "Meta Title": "Ritual: Crown of Horns: Nov 7, 2019, Draw Distance and Fu...",
    "Meta Description": "Looking for information on Ritual: Crown of Horns? Check out the release date (Nov 7, 2019), developer insights from Draw Distance, and a complete game ...",
    "Alt Text Image": "Official header image for Ritual: Crown of Horns game - Steam 1059150",
    "Canonical URL": "https://gusku.site/game/ritual-crown-of-horns",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ritual: Crown of Horns\", \"description\": \"Looking for information on Ritual: Crown of Horns? Check out the release date (Nov 7, 2019), developer insights from Draw Distance, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Draw Distance\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Feardemic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1059150/header.jpg?t=1626266253\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}