{
    "AppID": 884610,
    "Name": "Road Rage Royale",
    "Release date": "Oct 12, 2020",
    "About the game": "Road Rage Royale is a tactical race car combat game set in a cyber-punk post-apocalyptic world. You’re a cyborg at the wheel of an indestructible vehicle fueled by his own rage. You’re on the grid of a short track, surrounded by walls, the race is about to start. I mean, you know that it’s not a race, but you still want to be in the lead, you can’t help it, it hurts you when you’re not, truly. And since it’s a fight, you should probably try to hurt your opponent’s more than you hurt yourself. Hit them, make them rage, smash them against walls or obstacles, knock them out. There can be only one winner of the Road Rage Royale. Be the “last Man Racing” Update 2 new Features: Car Customization: Customize your vehicle with various parts and colors. Spectators: A diverse crowd is cheering for you. Update 1 new Features: New training mode (solo mode): Fight against an AI Pilot much like in multiplayer mode. Handicap system that allows you to balance games when playing against a much stronger opponent or a beginner. New sound effects: skidding, scratching the wall, boosts and menu sounds have been added. Collision sounds have been reworked. Improved Graphics: Game visuals have been enhanced with updated shaders, 3D models have been reworked and optimized. Nickname customization: Change your nickname for a more personal experience. Lots of small playability improvement s and minor bugs fixes . Overall fluidity improvement and GPU power consumption reduction . Key Features: Local Multiplayer: Gather around the same computer and challenge your friends or family in fast, action packed, tactical race car combats. Use Steam Remote play together to play online with your friends with only one copy of the game Drift: Metal wheels on metal tracks for sliding and fun car handling. Combos: Hit your opponents, push them against walls or obstacles to knock them out. Dodge: Evade attacks with hasty feints and mind games. Boost: Use you active skills wisely to make the difference. Smash: Pick up speed to inflict massive damages. One last for the road: Deadly obstacles will spawn at random, making each game unique. The Rage Overdrive Engine: All cars are powered by their driver’s rage, the more distance between the race leader and you, the more rage you generate. The more rage you generate, the more engine power you get, but it also causes you more damage over time. Be careful. Hear the squeal: Original cyber-punk post apocalyptic (again) rock music that is partially generated in real time. Feel the steel: Isometric 3D hand-drawn cyber-punk post-apocalyptic art style. Few explosions, many sparks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/884610/header.jpg?t=1602507919",
    "Price": 17.99,
    "Developers": "Neural Oscillations Games",
    "Publishers": "Neural Oscillations Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_549f49c0178237cd7feb696bd356fc7c02ba83e2.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_3b3e00940381bb9154d795afb9d643422e542e66.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_a5023e233b70a717df8ea4e15305bb050e1d463a.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_80da82cb9df5a3b41013b3d0e15c8b1bee5e6aac.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_0e4ddb215b6ef3ddce31724030123e2b7bf8e856.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_3cb6b329a8c595cf69aadad9d8f4dd561020f3d5.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_ff19b33b20adfcc1029a7e4a31e0be2d740642c4.1920x1080.jpg?t=1602507919,https://cdn.akamai.steamstatic.com/steam/apps/884610/ss_1225d33dfce64edde366c3419a334736e6f71cec.1920x1080.jpg?t=1602507919",
    "Slug": "road-rage-royale",
    "Meta Title": "Road Rage Royale: Oct 12, 2020, Neural Oscillations Games...",
    "Meta Description": "Looking for information on Road Rage Royale? Check out the release date (Oct 12, 2020), developer insights from Neural Oscillations Games, and a complet...",
    "Alt Text Image": "Official header image for Road Rage Royale game - Steam 884610",
    "Canonical URL": "https://gusku.site/game/road-rage-royale",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Road Rage Royale\", \"description\": \"Looking for information on Road Rage Royale? Check out the release date (Oct 12, 2020), developer insights from Neural Oscillations Games, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Neural Oscillations Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Neural Oscillations Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/884610/header.jpg?t=1602507919\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}