{
    "AppID": 1202310,
    "Name": "Sakura Succubus",
    "Release date": "Mar 31, 2020",
    "About the game": "Ogasawara Hiroki is a thoroughly average man. A photographer by trade, he works long and demanding hours every day, all the while overseen by his tyrannical boss. Living in the middle of Tokyo on a paltry salary, Hiroki resides in a small, run-down apartment, and eats instant noodles to survive. His life can hardly be called ‘glamorous’… Until one day, that is, when he’s tasked with taking photos of Japan’s top idol, Ikue Ayu. One thing leads to another, and Hiroki soon finds himself at the mercy of three beautiful women – all of them celebrities. There’s the cute idol Ayu, the sultry businesswoman Marina, and the airheaded social media star Cosmos. They’re all rich, famous, and extremely well-endowed, and they should be utterly unattainable… But, for some reason, they’re insatiably attracted to Hiroki! According to Marina, these three women are all succubi, and they find Hiroki’s scent intoxicating. They can’t get enough of him – and soon, Hiroki’s average life becomes anything but. Ayu is a super famous idol whose name is known across Japan. She’s revered for her cute stage persona and her seemingly humble nature. During her concerts, she never fails to thank her fans, and her enthusiasm is contagious! ...That’s just how it appears, however. Deep down, Ayu is a scheming vixen who regards her fans as mere stepping stones, and values money above all else. She’s so avaricious, she claims to be ‘moneysexual’, and she spurns the advances of men… At least, she did, until she met Hiroki. Marina is a wealthy businesswoman who owns a well-known clothing company. Though she’s only thirty-one, she’s one of the richest women in Japan, and she’s respected by men and woman more than twice her age. Marina is a coolly confident beauty. She isn’t the sort to fluster easily, and she has no qualms about taking whatever she wants. She’s domineering, with a sadistic streak, but she has a motherly side, and she’s good at dispensing advice. Cosmos is a popular social media star, with over three million followers on RapidPound. Cosmos shot to stardom after posting a series of semi-nude photos of herself online, which went viral. Since then, she’s been revered as the sexiest, most daring RapidPounder of all time. Though Cosmos dresses and acts in a provocative manner, this isn’t entirely intentional. At heart, she’s a naïve girl, with no genuine understanding of the effect her half-naked body elicits in the opposite (and, in some cases, same) sex. This often gets her in trouble, though she can’t fathom why. Cosmos is known for lewd photos, but she’s a sweetheart who believes in true love. She dreams of one day meeting a handsome prince who’ll sweep her off her feet.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1202310/header.jpg?t=1614340456",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_e1b5df0ab988f5ed48aee85e593b9c1eeded5625.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_91ee5bd346502422f563788572967b4487b883d8.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_e9d9c15be6014e0a928d21e5838b3cc8e2925771.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_76d6ed61f076ee5b9b7fe36323385ac9abacf46d.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_08280d67b3e78d37bfc4e8c601e0dcb348016a88.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_32c7eef7f6658d933c016788fb59141fb80f2e21.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_be6a113dd218afc912f7facdbbf2af43c98017cf.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_b82b3e7bf170aaefde93b464534cb9373e2be238.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_b8e07ae6ee49dbd66c1e2820ff88faf1c8c48fbb.1920x1080.jpg?t=1614340456,https://cdn.akamai.steamstatic.com/steam/apps/1202310/ss_f1b20d29d7d78e08a9708b81820c9972b198558e.1920x1080.jpg?t=1614340456",
    "Slug": "sakura-succubus",
    "Meta Title": "Sakura Succubus: Mar 31, 2020, Winged Cloud and Full Over...",
    "Meta Description": "Looking for information on Sakura Succubus? Check out the release date (Mar 31, 2020), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Succubus game - Steam 1202310",
    "Canonical URL": "https://gusku.site/game/sakura-succubus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Succubus\", \"description\": \"Looking for information on Sakura Succubus? Check out the release date (Mar 31, 2020), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1202310/header.jpg?t=1614340456\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}