{
    "AppID": 1248840,
    "Name": "Sephonie",
    "Release date": "Apr 12, 2022",
    "About the game": "Memories linger across time, deep beneath the island’s surface... In this story-driven 3D platformer, explore Sephonie Island's massive cave network, and link with unidentified species using the novel Puzzle Grid system. Explore the island's depths as shipwrecked biologists Amy, Ing-wen, and Riyou, whose personal histories come to bear on the shifting spiritual landscape of the island depths. Parkour-esque platforming Use an acrobatic moveset to navigate lush, jade canopies and rusty sandstone spires. Fling yourself over high ledges using the satisfying Teledash Vault and deftly Wallrun across dangerous outcroppings. Grapple through the air with the help of long-tongued Ribbats or climb tall cliffs via sticky-ridged Gripshrooms. Linking with certain creatures will grant you new abilities to reach the farthest depths of the island. The Relaxing and Casual Puzzle Grid System The trio must research the island's unknown creatures by Linking with them. Using the one-of-a-kind 'Puzzle Grid' system, you'll rotate and place a series of multi-colored pieces onto the board to create large, same-colored islands. Each creature has different challenges to overcome! There's no 'right' solution to Linking: use your intuition to react to the creature's moves and what appears on the board, and you will soon be on your way to success! A Research Trip Gone Awry In the near future, three biologists are on a joint mission to use their state-of-the-art ONYX implants to research the creatures of the uninhabited Sephonie Island. But as they approach the island, a sudden storm leaves them shipwrecked. Amy Lim, Taiwanese-American and bold leader, hails from the midwestern USA town of Bloomington. Riyou Hayashi, an analytically-minded Japanese-Taiwanese researcher, calls the bustling Tokyo his home. And Ing-wen Lin, a kind and considerate Taiwanese scientist, lives in Taipei. The trio will find their motivations and loyalties put to the test as they navigate Sephonie’s caverns, facing not only physical challenges but also their deepest memories and dreams. As they grow more intimate with each other and the island, an ancient force, brewing deep in the island's abyss, may threaten their newfound relationship, and the world... Features A deep, emotional story about the close bonds of a trio, the priorities of nations, and the delicate connection of humans and nature. A human experience crafted entirely by the IGF Grand Prize-nominated duo of Marina Kittaka and Melos Han-Tani, behind works such as Anodyne 1 &amp; 2, Even the Ocean, and All Our Asias. Master a parkour-esque moveset to sprint, wallrun, jump, and fling yourself through Sephonie Island’s rocky and physical caverns! A novel and accessible Puzzle Grid system that will stretch your brain in fun ways. A screenshot mode that lets you pose the characters and creatures you meet in the game, and then take fun photos! A beautiful and varied cave system filled with all manner of large and surprising creatures, visually brought to life by Marina Kittaka. A lush, melodic and ambient soundtrack by Melos Han-Tani. The postgame “Bubble Adventure” and fiendish hidden items provide a fun challenge for advanced spelunkers. Join us on Discord to chat about the game! (Link on the sidebar). Or, join our newsletter to stay up to date on the game's news! (Link also on the sidebar!) --- Sephonie does not support square resolutions (Less wide than 16:10). Sephonie will run fine with these resolutions but some UI may be cut off, which you can fix by using the in-game UI Scaling option or by running the game in a 16:9/16:10 windowed resolution. The same goes for UWHD resolutions in fullscreen. Sephonie only officially and natively supports certain controllers (PS4/5, XB1/XB360). Other controllers may work with Steam Input, but functionality not guaranteed. In particular the Nintendo Switch Pro Controller is NOT supported although players have gotten it working. See forum for details. Sephonie has been tested to work on Linux with Proton, although there may be some lighting errors depending on your OS so we have chosen to not have an officially supported Linux version.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1248840/header.jpg?t=1649961869",
    "Price": 29.99,
    "Developers": "Melos Han-Tani,Marina Kittaka",
    "Publishers": "Analgesic Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_7fc9d8d1cb0f9a6a723cff8cd87add25591790df.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_017a2b33e379f2068cc4ec085d43019bfead7568.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_0efb7481a0b67594b5920295a786e3d6bd55a38c.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_de5378bd2b1950b66df7f6c4df2937cbfc4e8b86.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_5bc745f898e348d85706a3fd5a8a7d34e4db6063.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_d5d20a8baf95d2e0e542db0dc68a66915a09efc1.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_070d79af7affc6aae1211f91b4093207fccce371.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_00f43969291e2f1f2c0fb001552fc617d5cdcebe.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_6afafdee976d31434593eef93e291591a34f4940.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_b4e983884da1365291b861722ca0177e31a6539c.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_b3d911a748bd2758786a1d94c33d3f6b371ac919.1920x1080.jpg?t=1649961869,https://cdn.akamai.steamstatic.com/steam/apps/1248840/ss_46fab3900b55007fb7550136fc10aa5753001cd6.1920x1080.jpg?t=1649961869",
    "Slug": "sephonie",
    "Meta Title": "Sephonie: Apr 12, 2022, Melos Han-Tani,Marina Kittaka and...",
    "Meta Description": "Looking for information on Sephonie? Check out the release date (Apr 12, 2022), developer insights from Melos Han-Tani,Marina Kittaka, and a complete ga...",
    "Alt Text Image": "Official header image for Sephonie game - Steam 1248840",
    "Canonical URL": "https://gusku.site/game/sephonie",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sephonie\", \"description\": \"Looking for information on Sephonie? Check out the release date (Apr 12, 2022), developer insights from Melos Han-Tani,Marina Kittaka, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Melos Han-Tani,Marina Kittaka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Analgesic Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1248840/header.jpg?t=1649961869\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}