{
    "AppID": 2500,
    "Name": "Shadowgrounds",
    "Release date": "May 8, 2006",
    "About the game": "Shadowgrounds breathes fresh air into the action genre with explosive combat sequences, an innovative weapon upgrade system, and an intriguing storyline. The adrenaline-pumping, top-down gameplay and audiovisual fireworks set the scene for this new action experience which also includes single computer (split keyboard or joystick) co-op play. UPGRADE THOSE WEAPONS! Use a devastating arsenal of high-tech weaponry to dispose of the alien threat. Each weapon has multiple upgrades that maximize the carnage. Unleash the flames of the Flamethrower's Fuel Trap, cause mayhem with the Grenade Launcher's Poison Grenades, slash and dice the monsters with the Laser Rifle's Pinpoint Laser - and many more! WHAT LURKS IN THE SHADOWS? Shadowgrounds uses cutting-edge realistic lighting and glow technology to light up the battlefield and create detailed shadows producing an atmosphere of fear. But the lighting and the flashlight also affect some aliens' behavior - take advantage of that and you can turn the tide in the game of fear by using your flashlight effectively. DESTRUCTIBLE ENVIRONMENT! What good are weapons and special effects if you can't wreak havoc on the environment? Shadowgrounds lets you go all-out - glass shatters, ground shakes, trees fall, barrels explode and furniture blows to smithereens. You can use the environment to your advantage. THEY'RE BIG AND NASTY! Big, brutal monsters await you. Prepare to face many different bosses who will do anything to stop your journey. They're nasty, blood-thirsty beasts, but don't give in to fear - remember to use the environment and the lighting to your advantage! Upgrade weaponry with powerful modifications. Face enormous monsters in boss battles. Destructible environment allows you to wreak havoc with your arsenal. Visit many exciting locations, including a secret military base and the alien-infested colony New Atlantis. Fight side-by-side with NPC allies against the massive alien hordes. Check security cameras and computer logs to investigate alien origins. Realistic lighting with gameplay effects bring the aliens out of the shadows. Enjoy horrifying sound effects and a thrilling music soundtrack made exclusively for Shadowgrounds.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2500/header.jpg?t=1591182513",
    "Price": 6.99,
    "Developers": "Frozenbyte",
    "Publishers": "Frozenbyte",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2500/0000000293.1920x1080.jpg?t=1591182513,https://cdn.akamai.steamstatic.com/steam/apps/2500/0000000294.1920x1080.jpg?t=1591182513,https://cdn.akamai.steamstatic.com/steam/apps/2500/0000000295.1920x1080.jpg?t=1591182513,https://cdn.akamai.steamstatic.com/steam/apps/2500/0000000296.1920x1080.jpg?t=1591182513,https://cdn.akamai.steamstatic.com/steam/apps/2500/0000000297.1920x1080.jpg?t=1591182513",
    "Slug": "shadowgrounds",
    "Meta Title": "Shadowgrounds: May 8, 2006, Frozenbyte and Full Overview",
    "Meta Description": "Looking for information on Shadowgrounds? Check out the release date (May 8, 2006), developer insights from Frozenbyte, and a complete game summary.",
    "Alt Text Image": "Official header image for Shadowgrounds game - Steam 2500",
    "Canonical URL": "https://gusku.site/game/shadowgrounds",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadowgrounds\", \"description\": \"Looking for information on Shadowgrounds? Check out the release date (May 8, 2006), developer insights from Frozenbyte, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2006\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frozenbyte\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Frozenbyte\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2500/header.jpg?t=1591182513\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}