{
    "AppID": 1164660,
    "Name": "SHOOTING CHICKEN BRUTAL SUCKERS",
    "Release date": "Jul 11, 2020",
    "About the game": "◆ Note ◆ ※ This game uses a lot of resources. It will take some time to start the game, so please wait until it starts. ※ If it doesn't start due to lack of dll, you need to install VC2010 redistribution, VC2012 redistribution, VC2013 redistribution, and VC2015 redistribution respectively. In case of Windows 7 or 8, you need to apply Windows Update before installing each redistribution of VC. ※ This game supports Steam Cloud Save. You can take over the data and play on any device that has Steam installed. Makoto Yonekura, a new waitress, is a bright girl in Noh weather. Contrary to its appearance, it is a survival game girl who uses powerful weapons! She will do her best to crush the rampaging chickens for the beloved chief! ①HP gauge : Decreases when taking damage. I will retire when this gauge is gone. ②Retry gauge : If you have this gauge, you can retry even if you retire. If you retire without this gauge, the game is over. You can easily switch weapons with the controller's Right stick. Use your weapons according to the situation and fight for your advantage! Defeat chickens to earn a score. YAKITORI COMBO is a technique that can achieve a large amount of scores. YAKITORI COMBO is completed by defeating the chicken according to the determined procedure. ① Attack a white chicken with a shotgun to make it a naked chicken. ② Burn the naked chicken with a flamethrower to make it a grilled chicken. ③ Attack and defeat grilled chicken with Magnum. There will also be a time bonus for every fixed score, so if a white chicken appears, let's aim aggressively! ◆ Sawed-off shotgun The main weapon of this game. It can attack a wide range, but the power is greatly reduced in a long-range attack. Shooting wings at close range allows you to peel off wings. Ammo is unlimited! Shoot without worrying about the remaining bullets! ◆ Submachine gun An easy-to-use gun that has low attack power but is capable of continuous fire. Like a shotgun, the power drops at long distances. Since you can get a lot of ammunition, use it aggressively! ◆ Magnum A handgun boasting tremendous power. The strongest gun that has the power to penetrate a chicken and does not drop its power at a distance. There are not many ammunition items available, so be careful with the remaining ammunition. Use it in battle with strong enemies. ◆ Flamethrower A powerful weapon that uses fuel gas to burn out enemies. Like the submachine gun, it can fire continuously, but the range is short. When used against chickens, it can be made into grilled chickens, and when attacked, chickens become charcoal. The released flame will also ignite the ground and walls and will last for a short time. ◆ Hand grenade The strongest weapon that explodes in a certain amount of time after throwing and repels a chicken with a shock wave. However, be careful because its power can destroy the ground and walls. Since there are not many available, use it in the battle with a strong enemy like Magnum. ◆ 9mm bullet Ammo used with submachine guns. Taking this will replenish the submachine gun ammunition. ◆ .50 Action Express Ammunition used in Magnum. Taking this will replenish Magnum ammunition. ◆ Fuel gas Fuel used in flamethrowers. Taking this will refill the fuel of the flamethrower. ◆ Hand grenade Box A box filled with hand grenades. Take this to replenish hand grenade. ◆ Ammo box A box filled with 9mm bullets, .50AE, fuel gas, and hand grenades. Can replenish ammunition to all weapons. ◆ Fried chicken small Spicy delicious fried chicken. Take this to restore 10% of HP. ◆ Fried Chicken Large Spicy delicious fried chicken set. Take this to restore 50% of HP. ◆ Heart Beautiful pink heart. If this is taken, the number of retries will be increased by 1 and HP will be fully recovered. ◆ Hourglass A mysterious hourglass that increases the time limit when you get it. There are two types of sand, blue and gold. Blue increases by 10 seconds and gold increases by 20 seconds. / / / / This game is made with Pixel Game Maker MV. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1164660/header.jpg?t=1594533825",
    "Price": 14.99,
    "Developers": "KoheiGallery",
    "Publishers": "KoheiGallery",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_ac527e8f529a4e8f234d719473b586eb4c71de71.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_3de67e7207157e6b288b783bc2756867eb34f834.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_da5ae38f89befa949509256c3c06ebc22614c7be.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_d75cff8ce80403440e35e1064593442c9f567c52.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_f366b7363613bb08431424369b2408e7117e054c.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_73e9b8178efb4f5239253f667be6d0a73d491a2f.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_e38259715dad7c962da2efe7c98b1b3c870e4e20.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_daea898a5ba7d4aecd1e161384510f85772fd270.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_d76611646adeff018404d0e4c318827eca174312.1920x1080.jpg?t=1594533825,https://cdn.akamai.steamstatic.com/steam/apps/1164660/ss_fe1e9a076fd35cb300fe18adca5a7ef2343fac50.1920x1080.jpg?t=1594533825",
    "Slug": "shooting-chicken-brutal-suckers",
    "Meta Title": "SHOOTING CHICKEN BRUTAL SUCKERS: Jul 11, 2020, KoheiGalle...",
    "Meta Description": "Looking for information on SHOOTING CHICKEN BRUTAL SUCKERS? Check out the release date (Jul 11, 2020), developer insights from KoheiGallery, and a compl...",
    "Alt Text Image": "Official header image for SHOOTING CHICKEN BRUTAL SUCKERS game - Steam 1164660",
    "Canonical URL": "https://gusku.site/game/shooting-chicken-brutal-suckers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SHOOTING CHICKEN BRUTAL SUCKERS\", \"description\": \"Looking for information on SHOOTING CHICKEN BRUTAL SUCKERS? Check out the release date (Jul 11, 2020), developer insights from KoheiGallery, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"KoheiGallery\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KoheiGallery\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1164660/header.jpg?t=1594533825\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}