{
    "AppID": 500500,
    "Name": "Simple VR Video Player",
    "Release date": "Jul 19, 2016",
    "About the game": "Watch your videos in virtual reality with Simple VR Video Player, an easy to use video player with a full motion controller interface. Simple VR Video Player can play your saved video files with 2D/180°/360° and 3D/SBS/OU support. MAIN FEATURES 2D/180°/360° Videos 3D Side By Side(SBS)/Over Under(OU) Video Support 180° Fisheye Motion Control with HTC Vive Adjust Brightness/Contrast/Color/Gamma/Hue Settings Full Tilt/Distance/Height controls Scalable Super Sampling Resolution 'Super Enhanced' Mode For Sharper Image Fidelity Saveable 180/360 Settings Unique For Each Video Virtual Play/Pause/Stop Buttons 3D Menus &amp; File Navigation Haptic Feedback One-Handed Controls Curved Screens Multiple decoding engines including MediaFoundation and DirectShow Environments Mouse Control Support for Non-Motion Control Users DETAILS Motion Controls First The software was designed specifically for the HTC Vive with a 'motion controls first' design philosophy. Unlike other VR video players, our interface is keyboard and mouse free so you can be completely immersed in VR without having to take off your headset to reach for obscure keyboard shortcuts. Easy Intuitive UI Play/Pause/Stop buttons using full hand motion controls and simple point &amp; drag controls to customize your screen size and distance 180° / 360° Videos Maximize your 180 and 360 degree video experience with full customizable settings for Distance, Tilt, and Height 3D File Navigation Find your files quickly with our file browser rendered in 3D space Individual 180/360 Video Settings Achieve your perfect scale and save your settings that are unique for each video. Drag To Resize Do you want to watch a movie on a 100ft screen? Now you can can with a flick of your wrist using Simple VR Video Player's drag and resize controls using motion controllers. Advanced Features Even though Simple VR Video Player was designed to be easy and simple to use application for normal users, under the hood, there is a tremendous amount of advanced features you can explore and experiment with, especially for power users with high-end computers. Super Sampling Resolution Super sampling is a brute force rendering technique that greatly improves image quality in virtual reality headsets. It works by rendering the 3D scene an X percentage higher than the physical resolution of the display and then resizing/downsampling the image back to your display. This results in an expensive form of high quality anti-aliasing that delivers a cleaner looking rendered image. You can fine tune super sampling settings in real-time. Introducing Super Enhanced Mode Simple VR Video Player is excited to introduce Super Enhanced Mode! Sharpen your video and drastically improve image fidelity by enabling 'Super Enhance' in the options. The Super Enhance technique utilizes an intelligent sharpening algorithm to enhance contrast and details while maintaining image quality. This feature when combined with high Super Sampling effectively upscales, sharpens, and downscales the video for greatly improved clarity especially on virtual reality headsets. Multiple Video Decoding Options Supports Microsoft Media Foundation, DirectShow, LibVLC, and PopMovie for multiple video decoding solutions. What Can It Play? Simple VR Video Player was built to take advantage of multiple video decoding engines in the backend to offer the greatest compatibility. As a general rule of thumb, if your Windows Media Player can play the movie, so can Simple VR Video Player. Media Foundation (Win 8/10) is a super optimized DX11 hardware accelerated decoder built into the latest versions of Windows with full h264 decoding support. For more advanced users, you can change the video decoding engine to use another video backend such as DirectShow which allows you to use DirectShow decoders, filters, and splitters such as LAV and ffdshow. Just choose the best decoding option for you! * Note: The player can't play Blu-ray discs since they are DRM'd and encrypted! It's Simple! We wanted to create the first simple and easy to use VR video player to take advantage of the Vive and it's hand motion controls. We also wanted to make it powerful and customizable using familiar controls. No other video player for the Vive compares to Simple VR Video Player for its simplicity and ease of use. More Info For more detailed information on features, go here: * Thanks to to the Blender Foundation's Big Buck Bunny and Tears of Steel for their open source films used in our videos and screenshots. (www.blender.org)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/500500/header.jpg?t=1469479011",
    "Price": 7.99,
    "Developers": "simplevr.pro",
    "Publishers": "simplevr.pro",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_d6c834decc4c30e884baceea498ff28172fe53a8.1920x1080.jpg?t=1469479011,https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_cdcb50cde4766fd7dd6b1fda978d723f35ffd174.1920x1080.jpg?t=1469479011,https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_fc36104e0a4782bb151f0205e09c67082d7944f7.1920x1080.jpg?t=1469479011,https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_0791241cdb902b0f86ccb58035dbd52a1727cb72.1920x1080.jpg?t=1469479011,https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_9ecf6b3aad2d69359a2c95bd35ccbb98f5b3a899.1920x1080.jpg?t=1469479011,https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_cd7ba96e91f5358114e08ac08e952cd8e8a49ed6.1920x1080.jpg?t=1469479011,https://cdn.akamai.steamstatic.com/steam/apps/500500/ss_50752104f0315868489fb93fb1a076d829d3da98.1920x1080.jpg?t=1469479011",
    "Slug": "simple-vr-video-player",
    "Meta Title": "Simple VR Video Player: Jul 19, 2016, simplevr.pro and Fu...",
    "Meta Description": "Looking for information on Simple VR Video Player? Check out the release date (Jul 19, 2016), developer insights from simplevr.pro, and a complete game ...",
    "Alt Text Image": "Official header image for Simple VR Video Player game - Steam 500500",
    "Canonical URL": "https://gusku.site/game/simple-vr-video-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Simple VR Video Player\", \"description\": \"Looking for information on Simple VR Video Player? Check out the release date (Jul 19, 2016), developer insights from simplevr.pro, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"simplevr.pro\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"simplevr.pro\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/500500/header.jpg?t=1469479011\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}