{
    "AppID": 595430,
    "Name": "Sky Knights",
    "Release date": "Jul 27, 2017",
    "About the game": "Sky Knights is an action-packed top-down online multiplayer dogfighting game. Enjoy thrilling head-to-head aerial combat in 4 vs 4 team fights and outmaneuver opponents with tricks and well-timed afterburner boosts. The goal of the team battles is to take out the enemy bases. This must be done while fighting off the enemy players. You will also need to carefully manage your ammo and fuel supply. Rearm and refuel by performing skillful landings in the home base. To be successful, your team must perfect a balance between attack and defense; engage the enemy in combat while supporting your allies in the air as well as on the ground. Tactically choose the fighter jet to fit your play style and your team’s needs. There are nine different aircraft - ranging from the F-16 to the A-10 Warthog - each offering their unique weaponry, stats, strengths and weaknesses. You can further customize your pilot profile with one of eight avatars, and level up to unlock more than 15 aircraft upgrades, six permanent traits and countless visual aircraft customizations. Sky Knights is made by Hampus Bankler, an ex-military fighter jet mechanic and professional game developer. Before combining his two passions into creating Sky Knights, he worked on games like Bionic Commando: Rearmed 2 , Angry Birds 2 and was recently also involved in Project Wight . FEATURES Compete in fast-paced 4 vs 4 top-down online multiplayer dogfights Be part of a friendly and active Discord community, filled with aviation and gaming enthusiasts Fight in multifaceted objective-based team battles over four different maps. Take out the enemy bases while combating other aircraft and ground forces Learn to utilize vertical maneuvers and high-G turns without blacking out Manage ammo and fuel and restock them after performing skillful landings in the home base Master different aircraft types with unique strengths and weaknesses F-16, F-15, A-10, MiG-29, Su-27, Su-25 available from start. Unlockable aircraft include F-5, AJS 37 Viggen, MiG-21 and Su-17. Skillfully use your full arsenal including guns, heat-seeking missiles, bombs and more Play against other players, or start a co-op match vs bots Level up and unlock over 15 aircraft upgrades and six permanent traits to tailor your aircraft and character to your playstyle Unlock modifications for your aircraft to tweak their performance Personalize your pilot profile with eight different avatars and unlock countless visual aircraft customizations Discover plenty of tricks to get the upper hand in battles Fight your way up the global leaderboard, and try to become the best of the best every monthly season Twitch integration lets your viewers join the battle as ground forces Frequent content and polish updates Easy direct contact with the developer through Discord",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/595430/header.jpg?t=1653756438",
    "Price": 9.99,
    "Developers": "Mudpike",
    "Publishers": "Mudpike",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_9e347b7ad0bccdf2aece8dde93856632c7763b71.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_d89603a1ea6880cd6c9dd5e29087a7c737054ec2.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_e4470cac22e89aef055de47ac2f2abfba5e856b0.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_3a54b4a6602ac0c4f796dc90541d11a7ffe56273.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_b586abdbc5304cd5fba2f7228f85b1f3450cef06.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_07f99a87f2fd5fc66fe844db245c59220dd58264.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_6e75052fd610bfa4bdf849af00fe18d6c074a8d5.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_987741cf929fdbdbc2891f46942ffb50c1633ff3.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_bdf081de05763119a835eefda30fa13e8e24ce77.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_81375366ed6630732910a6f61d9c99bf35195488.1920x1080.jpg?t=1653756438,https://cdn.akamai.steamstatic.com/steam/apps/595430/ss_88bbddb44ab9ac73ef17527b236fabb3d5426138.1920x1080.jpg?t=1653756438",
    "Slug": "sky-knights",
    "Meta Title": "Sky Knights: Jul 27, 2017, Mudpike and Full Overview",
    "Meta Description": "Looking for information on Sky Knights? Check out the release date (Jul 27, 2017), developer insights from Mudpike, and a complete game summary.",
    "Alt Text Image": "Official header image for Sky Knights game - Steam 595430",
    "Canonical URL": "https://gusku.site/game/sky-knights",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sky Knights\", \"description\": \"Looking for information on Sky Knights? Check out the release date (Jul 27, 2017), developer insights from Mudpike, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mudpike\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mudpike\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/595430/header.jpg?t=1653756438\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}