{
    "AppID": 1915220,
    "Name": "SpectrumGames",
    "Release date": "Mar 21, 2022",
    "About the game": "SpectrumGames with Mafia Room is a platform for Mafia for 9 people, consisting of: three Citizens, a Special Officer, a Doctor, a Detective, three Mafia members. It is a team game (team of the peaceful city against the mafia team), which requires a leader from among the users. The goal of the mafia: to stay in equal numbers against the non-shooting peaceful roles. The goal of the peaceful city: to get the entire mafia out from behind the game table. How it happens: - The peaceful players analyze the players' statements during the day, the voting process, the results of the night's actions, and try to determine who plays for the mafia, and then take those players out from the game table. By voting, and by the city's firing roles, also by night actions. - Players playing for the Mafia try to take out as many peaceful players as possible by night actions and by voting. Sometimes set up their 'weakest link' in order to remove suspicion and gain a foothold at the game table. - By removing from the table a peaceful role that has the ability to take night actions, the Mafia gains a strategic advantage. - Players leaving the game table reveal their roles. - The game ends with a victory for the mafia when there are as many mafia players left at the table as there are peaceful players with a non-shooting role. Draw when the table remains 1 mafia and 1 firing peaceful role. In other cases - the victory of the peaceful city. - At the game table there is a set of ethical rules (no profanity, etc.) at the discretion of the host. What you can do in SpectrumGames: 1. Choose an avatar from ready-made avatars or generate an avatar from a photo and customize it. You can create any number of avatars, customize them and choose a new image for each game. 2. use emoji and gestures in addition to voice and text chat (we will increase the arsenal of emotions). 3. Interact with the environment. You can move some objects, move around the room (with the presenter's permission, of course). Possibilities for the Game Master: to upload his files (pdf, audio and 3D objects), create a closed or open room for the game with the subsequent invitation of players to it, moderate the game. Mafia is possibly the best team discussion game for boosting communication skills. It may be used for corporate team-building events and friendly parties. In our application, the Game Master can brand the space and build the game atmosphere like in real life!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1915220/header.jpg?t=1653039240",
    "Price": 0.0,
    "Developers": "Omega Company Limited",
    "Publishers": "Omega Company Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1915220/ss_be77937dcb23d9614185a13e3ca97537aada27dd.1920x1080.jpg?t=1653039240,https://cdn.akamai.steamstatic.com/steam/apps/1915220/ss_1f3e3dc27a380d0dcb7a9c87695ded1c1fec1469.1920x1080.jpg?t=1653039240,https://cdn.akamai.steamstatic.com/steam/apps/1915220/ss_40ff0a08220b283a83f17963e31855db77d025da.1920x1080.jpg?t=1653039240,https://cdn.akamai.steamstatic.com/steam/apps/1915220/ss_d75b4b875c0681a1bde6af751cefe50db8fcd6b4.1920x1080.jpg?t=1653039240,https://cdn.akamai.steamstatic.com/steam/apps/1915220/ss_e7a56c83806cf0036ba89566596758a5c575db30.1920x1080.jpg?t=1653039240,https://cdn.akamai.steamstatic.com/steam/apps/1915220/ss_3764ac96edfb30a970b1da69a415fd7c5e115855.1920x1080.jpg?t=1653039240",
    "Slug": "spectrumgames",
    "Meta Title": "SpectrumGames: Mar 21, 2022, Omega Company Limited and Fu...",
    "Meta Description": "Looking for information on SpectrumGames? Check out the release date (Mar 21, 2022), developer insights from Omega Company Limited, and a complete game ...",
    "Alt Text Image": "Official header image for SpectrumGames game - Steam 1915220",
    "Canonical URL": "https://gusku.site/game/spectrumgames",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SpectrumGames\", \"description\": \"Looking for information on SpectrumGames? Check out the release date (Mar 21, 2022), developer insights from Omega Company Limited, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Omega Company Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Omega Company Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1915220/header.jpg?t=1653039240\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}