{
    "AppID": 1196450,
    "Name": "Stop Sign VR Tools",
    "Release date": "Dec 17, 2019",
    "About the game": "Stop Sign VR Tools has grown into a set of tools that run while you play a SteamVR game. Each tool can be enabled and configured separately. Currently, there are four main tools and a few extras: Cam Circle uses the headset cameras to show a live view of the real world in a circle in front of you. It has easy shortcuts and activates almost instantly. You can activate Cam Circle by double tapping the headset , or by pressing both grip buttons at the same time. Cam Circle is very useful for quick looks outside the headset and for picking up the controllers after putting on the headset. You can even set it to automatically activate when you put on the headset. If you use an Index or Vive Pro, Cam Circle can show the pass-through video in 3D . On a Vive it's monoscopic (2D). Cam Circle is not (yet) available for WMR or Oculus headsets. Boundary++ is a new warning grid system that will show up when you approach your walls and ceiling. It works with native SteamVR headsets, Windows Mixed Reality (WMR) headsets, Oculus PC connected headsets and 'Mixed VR' sets (e.g. a WMR headset with Valve Index controllers). It will automatically import the WMR boundaries or Oculus Guardian (when using a Rift-S). Boundary++ will not light up the whole play area, but it will only show where you are actually near your boundaries. It can be used together with the default SteamVR chaperone, or just by itself. Warning Boxes are virtual boxes that you place around your valuable real equipment, such as TVs, ceiling fans, room lighting and so on. They help you avoid hitting real stuff in and around your VR play area. While you are playing a game a prediction algorithm warns you of possible impacts using sound, images and haptic feedback. The boxes will fade out when you move away from them. The fade-out and full-visibility distances can be configured for each box separately. If you can't find your boxes because they're faded out, press the system button and look around. The HUD is a Heads-Up Display that will show up when you are moving backwards into a wall or other boundary object, such as a Warning Box . Extras and other info: A box can be configured to show content by other overlay apps. E.g. a box can show the fpsVR overlay on one of its sides, or it can show the content of a Desktop+ overlay. More about this feature here . Do you use a Mixed VR set and experience grey screens with seated games? This app has a fix for that problem. You can find it on the Boundary++ settings page on the SteamVR dashboard. All basic settings are accessible on the SteamVR dashboard pages for Stop Sign VR . Next to the basic settings there are many things that can be configured and fine-tuned using the separate Settings Editor program in Windows (not in VR). Also use this Settings Editor to add more virtual boxes, delete or edit them. You can start the Settings Editor from the Windows System Tray , next to the clock in the bottom right corner of your desktop. The Stop Sign VR Tools runtime is 100% coded in C++ and optimized to spend very little CPU/GPU cycles. It does not harm the performance of other VR software. The alert sounds are spatialized by Steam Audio's HRTF-based binaural rendering so you will hear where the closest wall or object is, even if you can't see it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1196450/header.jpg?t=1625146654",
    "Price": 5.99,
    "Developers": "Reality Inside Ltd.",
    "Publishers": "Reality Inside Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_fcad5e9128e63d5755952291773ba6a2a5b8ab5d.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_9c8cfe5eab3105d40693df47d2e51dd7826a9b6a.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_ce9ff3f9aacc4481188ec22020454a4903f85891.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_99d020f5b274912e79c1c2671e2981770b2d43b5.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_d107892f284397c73def666ea18e8c59dfcaae19.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_d482a3e2ea0a9149ddf1430ef1914c4502e7bb7b.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_4eae560fddecaa291d458cb3de8f0d8b078fe62b.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_1afa0e53f943e080af9055f9c07b09a88dfc55b4.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_34e9b37fed3146d693c625e841b40deeb0080e43.1920x1080.jpg?t=1625146654,https://cdn.akamai.steamstatic.com/steam/apps/1196450/ss_82de09eca3327e864cff982734ada850627fce9d.1920x1080.jpg?t=1625146654",
    "Slug": "stop-sign-vr-tools",
    "Meta Title": "Stop Sign VR Tools: Dec 17, 2019, Reality Inside Ltd. and...",
    "Meta Description": "Looking for information on Stop Sign VR Tools? Check out the release date (Dec 17, 2019), developer insights from Reality Inside Ltd., and a complete ga...",
    "Alt Text Image": "Official header image for Stop Sign VR Tools game - Steam 1196450",
    "Canonical URL": "https://gusku.site/game/stop-sign-vr-tools",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stop Sign VR Tools\", \"description\": \"Looking for information on Stop Sign VR Tools? Check out the release date (Dec 17, 2019), developer insights from Reality Inside Ltd., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reality Inside Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reality Inside Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1196450/header.jpg?t=1625146654\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}