{
    "AppID": 1331240,
    "Name": "摇摆地牢 Swing Dungeon",
    "Release date": "Sep 9, 2021",
    "About the game": "'Swing dungeon' is a special independent game. The game has a novel method of play, it is actually 'swing jump' under the platform, and the control is simple, but the playing method has the depth of challenge. There is no direction key in the game. Players only need to grasp the timing and rhythm of the keys, and they can explore and move freely with one key. The player will play a frog who likes to spit out his tongue. He can freely explore the dungeon with his flexible tongue, find strange props, challenge cute and changeable monsters, solve puzzles and creative mechanisms, and obtain rich treasure. Let's swing together and break into the dungeon!! Thank you for your attention, I'm sorry, I decided to delay the release of the game, hope to polish it better, I'm very sorry! Friends who have key have owned this game for life. They are not affected by the release time. They can try the current version first and follow the update. Please feel free to play. Warning: this game is adventurous and innovative, some players may be difficult to start! ( ˘•ω•˘ ) Share some tips: (station B has my own video strategy, I am also a hand disabled player, but I can pass the whole star) 1: Look at the position of the frog's mouth: as long as the point of the mouth coincides with the square, then press and hold it and it will stick. 2: To be able to jump: master the rhythm, not afraid, try not to swing in one place for half a day. 3: The orientation of the tongue is the orientation of the frog's head. Instructions: 1: Due to the innovation of operation mode, the game will feel more difficult at the initial stage, which requires patience and practice of players to overcome difficulties. 2: In fact, as long as you master a certain point according to the rhythm and jumping angle, players can freely and quickly swing and move, show the flying. 3: The game does not provide long-lasting guidance to encourage the players to play their curiosity; so when you see different bricks, please try to touch them and attack them. (in fact, there are hints) 4: There are still some traditions of platform jumping Games: to break right, try to eat stars to get full star evaluation, unlock new levels, etc., which are the basic mechanism of the game. 5: Enter the game settings page, there is a flag button in the lower right corner, click to switch the language. 6: At present, the game also supports mouse operation, which can be viewed in the settings page. 7: Life value can be inherited (gold coins and props are also included), not every level gives 3 lives. It's very easy to add life (to eat gold coins and life enhancing props) during playing, so don't worry about the lack of life value. Explore collection puzzle solving fight bravely crazy Parkour you can also, on the edge of danger, jump across again and again! How to play is your freedom! Thank you very much for your support!! 'Swing dungeon' is an independent game made by myself. The idea of the game is to use the simplest control possible to make the players feel happy. At present, the game is in hot development. Like other developers, I have a dream of independent games. In fact, I think I'm still a young rookie, and I want to fly very high. I'd like to make a good game with excellent playing method, beautiful pictures and enough volume, which won't lose 3A abroad. But I'm just a person, and I don't have the strength of a large factory, so I decided to start with a small game; first, I focused on the core playing method, and gradually built everything around her, hoping to make a little new, a little fun little game. At present, the game is only the initial version, and all aspects are not mature, including art, program, sound effect, play method, level design and so on. It's a long way to go. I will continue to make this game and try my best to give full play to her potential. Therefore, the current version does not represent the final quality of the game, and all kinds of immaturity. We welcome and thank all players and developers for their criticism and correction. Finally, thank you again for your support~ This game has been released by light language game, please contact: s Jun of light language game business QQ: 213630038",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1331240/header.jpg?t=1633889372",
    "Price": 0.99,
    "Developers": "Southfish Studio",
    "Publishers": "Southfish Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_b8b04926a8d83b7b27d06b4ed1d68cfdbb41a0db.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_ae7ba87a00e31f5b5e19a36066668aad78836974.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_87a2b3cf460a0f34c5025ae00ca04abe09e142a2.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_675d4975c2b3f626490feac32314afd8ebedcb97.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_db1e9eb66461023a1c7fd13ebd898302afed19ed.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_b51701fa5ae73359ff661d32d89fe46c5eab2456.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_85f4b3e5ec493326a26adcb0f385853df993af89.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_baf8211a7e95214797a87aeaca4f40a0da7b2c60.1920x1080.jpg?t=1633889372,https://cdn.akamai.steamstatic.com/steam/apps/1331240/ss_a58b19006aed64b9878d762bff2ca0c4a7ed6c95.1920x1080.jpg?t=1633889372",
    "Slug": "swing-dungeon",
    "Meta Title": "摇摆地牢 Swing Dungeon: Sep 9, 2021, Southfish Studio and Ful...",
    "Meta Description": "Looking for information on 摇摆地牢 Swing Dungeon? Check out the release date (Sep 9, 2021), developer insights from Southfish Studio, and a complete game s...",
    "Alt Text Image": "Official header image for 摇摆地牢 Swing Dungeon game - Steam 1331240",
    "Canonical URL": "https://gusku.site/game/swing-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6447\\u6446\\u5730\\u7262 Swing Dungeon\", \"description\": \"Looking for information on \\u6447\\u6446\\u5730\\u7262 Swing Dungeon? Check out the release date (Sep 9, 2021), developer insights from Southfish Studio, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Southfish Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Southfish Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1331240/header.jpg?t=1633889372\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}