{
    "AppID": 1206480,
    "Name": "Swordsman VR",
    "Release date": "Sep 24, 2020",
    "About the game": "The Jötunn wields seemingly infinite power: Hellfire. Journey through medieval Earth to stop him from taking over the world. Defeat him and become the ultimate Swordsman in VR. Swordsman's physics engine offers a visceral combat experience. Our physics-based approach to weapons, armor, objects and bodies will challenge you and make you feel unstoppable at the same time. We're currently working on the game-changing 'Advanced Combat' update. To save humanity, you'll have to defeat armies from all over the world. Knights, Vikings, Mongols, Samurai, Pirates and more. Epic battles on ships in the Caribbean, duel to the death in the Gobi desert or clash with Hel, the goddess of the Underworld. Visit the Blacksmith to purchase weapons or take down powerful bosses to unlock their unique weapons and their special abilities. Gear up for increasingly difficult fights on your quest to find the Jötunn. Experience our released 'Advanced Weapon Handling' update. Weapons alone will not be enough to defeat the Jötunn and his armies. Visit the Skill Master to upgrade your stats and skills and the Armorer to equip yourself with better armor. Be strategic and build your ideal character build to suit your unique playstyle. Advanced combat mechanics with intelligent opponents that can engage in real sword-play Seven different thematic combat environments Dismemberment, armor physics, hand-to-hand combat and advanced weapon handling Factions, including: Knights, Vikings, Mongols, Samurai, Pirates and eight different bosses Horde: a zombie survival mode Various weapon types Player progression and RPG elements Dozens of armors, weapons and shields (including powerful boss weapons) Campaign, Arena and Event modes Lots of stats and skills to upgrade for your ideal character build Chronokinesis to slow time down (with a modifier to let you do it whenever you want) Gameplay modifiers to change the core game in fun and exciting ways Participate in real-life events for real-life prizes Click above and join us on Discord to chat with the developers, get the latest news on Swordsman, and participate in contests and giveaways. Eager to see you there!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1206480/header.jpg?t=1657054665",
    "Price": 19.99,
    "Developers": "Sinn Studio Inc.",
    "Publishers": "Sinn Studio Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_65e8fa2e0996cd6373656b67048a827188bfa515.1920x1080.jpg?t=1657054665,https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_7ffc0dd3c7686eecde99515c6efaa155b7e87803.1920x1080.jpg?t=1657054665,https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_c63cad4e881d2d72b657aecf4e12347cd7ac6ea3.1920x1080.jpg?t=1657054665,https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_8cf7839eab326c8cb9c158f81c81a072e75ecf1f.1920x1080.jpg?t=1657054665,https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_38f46e38e7997a99ba195a4c3060b65a6afb829c.1920x1080.jpg?t=1657054665,https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_682e7fee9d248c02ea2f2b916d88b0bf903cd09e.1920x1080.jpg?t=1657054665,https://cdn.akamai.steamstatic.com/steam/apps/1206480/ss_6ee8e312b82d04204289769b62329e505febeb82.1920x1080.jpg?t=1657054665",
    "Slug": "swordsman-vr",
    "Meta Title": "Swordsman VR: Sep 24, 2020, Sinn Studio Inc. and Full Ove...",
    "Meta Description": "Looking for information on Swordsman VR? Check out the release date (Sep 24, 2020), developer insights from Sinn Studio Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Swordsman VR game - Steam 1206480",
    "Canonical URL": "https://gusku.site/game/swordsman-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Swordsman VR\", \"description\": \"Looking for information on Swordsman VR? Check out the release date (Sep 24, 2020), developer insights from Sinn Studio Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sinn Studio Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sinn Studio Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1206480/header.jpg?t=1657054665\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}