{
    "AppID": 2005430,
    "Name": "The Call of Krul'ar",
    "Release date": "Jun 8, 2022",
    "About the game": "Survive the horrors of the unknown as you expand your lands to keep from being dragged into the darkness; and devoured by that which lurks inside. Every time you make an action, the world around moves forward too. So be strategic in your choices, and be sure they are worth it. COLLECT Time moves with you. When you make an action, the world around you also moves forward. So be careful with your actions. And to help you manage time, place your workers to help collect resources. COMBINE Discover and Collect various cards found on the islands to Combine them into structures and to expand your lands. With the more resources you collect and combine, the more you can build from collecting and combining. EXPAND Build up your kingdom to the right as you craft new islands, and keep from being swallowed by the darkness that is always moving closer from the left. The more you expand your lands, the further the distance between you and the darkness. DEFEND Send out your soldiers to bide for more time. Make units from your structures as you expand, and place them on the front-lines to fight off the enemies that appear from the darkness. But be wary of the different beings that will appear... A DIRE WARNING Not much is known of all the creatures from the darkness, and you may have to learn how to deal with them on your own. And you can escape... But how to do so is unknown, as those who have lived have all lost their minds. The only advice that can be given to prepare you is the basics of surviving in this land. Collect, Combine, Expand, and Defend. But... do not think light of such simple instructions. Survival is far more an arduous task than one would first assume. As there have been tales of others being dragged into the darkness. So make a goal of not underestimating this world... Less you too become another tale of hubris and woe... And another tale of one that has been taken by... THE CALL OF KRUL'AR! if you want to share feedback, find bugs, or have thoughts on the game, you can: - Message me on the Steam Community Forums for the game, - Message me on the Itch.io Community Forums for the game. - or:​ /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2005430/header.jpg?t=1657674996",
    "Price": 2.99,
    "Developers": "Devious Oatmeal",
    "Publishers": "Devious Oatmeal",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2005430/ss_dd8e8a478d4e4d2175d7e28a4577d769a715dc03.1920x1080.jpg?t=1657674996,https://cdn.akamai.steamstatic.com/steam/apps/2005430/ss_fab93c8826daa4dcf8c47290b4a44ad61a941acd.1920x1080.jpg?t=1657674996,https://cdn.akamai.steamstatic.com/steam/apps/2005430/ss_521c33794174fb9e486ebd39c63a43d19aca9856.1920x1080.jpg?t=1657674996,https://cdn.akamai.steamstatic.com/steam/apps/2005430/ss_5bf40d59e76f12596d375a98e34984e82e3bdde0.1920x1080.jpg?t=1657674996,https://cdn.akamai.steamstatic.com/steam/apps/2005430/ss_ef6caaf10a86f052384bf026ab9853f86f759687.1920x1080.jpg?t=1657674996",
    "Slug": "the-call-of-krul-ar",
    "Meta Title": "The Call of Krul'ar: Jun 8, 2022, Devious Oatmeal and Ful...",
    "Meta Description": "Looking for information on The Call of Krul'ar? Check out the release date (Jun 8, 2022), developer insights from Devious Oatmeal, and a complete game s...",
    "Alt Text Image": "Official header image for The Call of Krul'ar game - Steam 2005430",
    "Canonical URL": "https://gusku.site/game/the-call-of-krul-ar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Call of Krul'ar\", \"description\": \"Looking for information on The Call of Krul'ar? Check out the release date (Jun 8, 2022), developer insights from Devious Oatmeal, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Devious Oatmeal\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Devious Oatmeal\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2005430/header.jpg?t=1657674996\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}