{
    "AppID": 1883320,
    "Name": "剑与桃花 the sword and peachblossom",
    "Release date": "Jul 22, 2022",
    "About the game": "The game is introduced This is a country strange theme of short visual novel. The game tell the story of the protagonist, who is about to graduate from university, returned to his long-lost hometown and returned to his cousin. Later, the hero is in danger in the mountain-forest. Take this opportunity to explore the myths and legends of the village spread for a long time, learned the story of “the sword and peach-blossom”, but also opened the past that led to his childhood away from home. In the investigation, the distance between the hero and his cousin is also getting closer, and they finally put the past behind them and move forward towards a new future. producer's introduction to the game What kind of mood do you have when leaving others alone? Since I left, why do I come back again? For the people left behind? Hard to give up hometown? Or for those forgotten memories. The more compact plot reduces a lot of boring daily life, and inadvertently buries suspense and clues. About 70000 words of text, more than 20 exquisite CG and scene pictures; Two songs made according to the plot, three self-made BGM songs suitable for the theme, and two self-made high-quality PV songs; 99% of the characters are fully voiced, with two branches and different choices, to uncover the story of 'sword and peach blossom' in two aspects. After passing the customs, there are more stories of NPC. Producer remarks This is the first visual fiction game made by Wind Chime Hall, and due to the lack of experience and technology, there may be some bugs and unsatisfactory aspects. If you find this game unsatisfactory , feel free to speak up. We readily accept any reasonable criticism and negative comments, and should strive to do so. We are going to take some ideas and suggestions from that game and try to make it a great game for everyone. Other The game has part of the text of classical Chinese. This game is purely fictional and has nothing to do with real history. If you don’t like the game, you can post a bad review in the comments section and submit a refund request to Steam customer service . If you like the game it has realized its valve. We hope to hear from you favorably comments, if it is convenient for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1883320/header.jpg?t=1658751066",
    "Price": 3.19,
    "Developers": "風鈴堂",
    "Publishers": "風鈴堂",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_50235b92351e5d6e4b81c3b8dc372515f80748ff.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_3d396dc0a9fc6e26a2fdc0a21c5edf8c8b742d48.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_766270c44f39b8d365ccb7941590c27a6470da8d.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_e45c7d725a341b8b02e37aed406db18b7e6ae173.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_db41a21e1dce875d1b33cd5d3d0108a9f340effe.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_64e2240b37ccc86855aa4ec028b29604a4b322f0.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_24b406e9877e1e5b445c6dda270c3abf011e83e5.1920x1080.jpg?t=1658751066,https://cdn.akamai.steamstatic.com/steam/apps/1883320/ss_ab21d4a50ee47f8b2a5c9a5b1b93fe85a46f0386.1920x1080.jpg?t=1658751066",
    "Slug": "the-sword-and-peachblossom",
    "Meta Title": "剑与桃花 the sword and peachblossom: Jul 22, 2022, 風鈴堂 and Fu...",
    "Meta Description": "Looking for information on 剑与桃花 the sword and peachblossom? Check out the release date (Jul 22, 2022), developer insights from 風鈴堂, and a complete game ...",
    "Alt Text Image": "Official header image for 剑与桃花 the sword and peachblossom game - Steam 1883320",
    "Canonical URL": "https://gusku.site/game/the-sword-and-peachblossom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5251\\u4e0e\\u6843\\u82b1 the sword and peachblossom\", \"description\": \"Looking for information on \\u5251\\u4e0e\\u6843\\u82b1 the sword and peachblossom? Check out the release date (Jul 22, 2022), developer insights from \\u98a8\\u9234\\u5802, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u98a8\\u9234\\u5802\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u98a8\\u9234\\u5802\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1883320/header.jpg?t=1658751066\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}