{
    "AppID": 1730190,
    "Name": "The Patient S Remedy",
    "Release date": "Sep 29, 2021",
    "About the game": "English support Language switching between Japanese and English is available. ABOUT An adult BL game featuring blinking and lip-syncing animations in Full HD, which expresses the emotions and charms of the characters in a lively manner. Presented by Mada labo &amp; Tougo Mito, who attracted a lot of attention in his first work, Naked Butlers. STORY Progressive Cell Degeneration - commonly known as candle disease, is a strange disease in which the body melts or hardens like a candle, and typically leads to death within 5 years. Sota Sasaki was diagnosed with 'candle disease' and became a patient himself. However, it turns out that his semen might be a cure...!? Due to his bodily fluids’ miraculous nature, and in exchange for participating in research, he was given a special privilege: he will be treated like a king within this closed-off hospital world. However… it has no effect on myself... Do you sacrifice yourself for others and save? CHARACTER 佐々木 空歌　Sasaki Sota CV.伊吹島太郎　Ibuki Shimataro A university student, 22 years old. An ordinary young man who goes out with friends, loves making noise at drinking parties, and occasionally studies, too. He was infected by candle disease one day, and through desperation from his illness, begins displaying a wicked sadism… 三島 春輝　Mishima Haruki CV.姫咲遙　Himesaki Haruka An 18-year old-boy, ephemeral as if he had come out of a painting. Because he is naturally weak and shy, he has no friends and only reads books. 皆川 学　Minagawa Manabu CV.並木澪遠　Namiki Mion A 29-year-old elite office worker who works for a major management consulting company after having graduated from a prestigious private university. He has incredible talents, but his personality is terrible. He always looks down on others. 安田 光雄　Yasuda Mitsuo CV.床魔乱夢崇矢　Tokomara Musuya A 40-year-old candle disease patient. He lost his beloved wife in a car accident and has no children, so he has resigned himself to his illness, saying 'I will have no regrets when I die.' He is more concerned about the wellbeing of the people around him than his own. 渋澤 秀司　Shibusawa Shuji CV.平井達矢　Hirai Tatsuya A 38-year-old doctor and research officer at the Okuseyama Institute of Medical Science Hospital's Clinical Research Department. He has quite an attitude and a foul mouth to boot, which was why he was sent off to Okuseyama. However, he seems to be a sincere and skilled doctor who treats his patients passionately, without being afraid of catching their disease. SPECIAL CONTENTS Newly drawn digital poster A new short story, 'Playing Doctor'. *The bonus novel is in Japanese text only. Please understand. *The bonus content is stored in a directory folder when the game is downloaded. Library-&gt;患者Sの救済(Right click)-&gt;Properties-&gt;Local Files-&gt;reference-&gt;Special_Steam",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1730190/header.jpg?t=1655999922",
    "Price": 39.99,
    "Developers": "MADA labo",
    "Publishers": "MADA labo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1730190/ss_3d9d95d1308617261f5056de75cd5fc0b97fc08b.1920x1080.jpg?t=1655999922,https://cdn.akamai.steamstatic.com/steam/apps/1730190/ss_c403d38f553755d0e1f5d905ebea8f8953e3d8fb.1920x1080.jpg?t=1655999922,https://cdn.akamai.steamstatic.com/steam/apps/1730190/ss_920dfa074aa2addf9885b6815d28ccf4572ade48.1920x1080.jpg?t=1655999922,https://cdn.akamai.steamstatic.com/steam/apps/1730190/ss_064ee41c7b260efcd79595998c8f696deb76fc6e.1920x1080.jpg?t=1655999922,https://cdn.akamai.steamstatic.com/steam/apps/1730190/ss_e7dadd0186d3aa460d10245bfd0524ce6b223ffc.1920x1080.jpg?t=1655999922,https://cdn.akamai.steamstatic.com/steam/apps/1730190/ss_036a7cc31e53f1f9914525e19e0a948c54c79f67.1920x1080.jpg?t=1655999922",
    "Slug": "the-patient-s-remedy",
    "Meta Title": "The Patient S Remedy: Sep 29, 2021, MADA labo and Full Ov...",
    "Meta Description": "Looking for information on The Patient S Remedy? Check out the release date (Sep 29, 2021), developer insights from MADA labo, and a complete game summary.",
    "Alt Text Image": "Official header image for The Patient S Remedy game - Steam 1730190",
    "Canonical URL": "https://gusku.site/game/the-patient-s-remedy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Patient S Remedy\", \"description\": \"Looking for information on The Patient S Remedy? Check out the release date (Sep 29, 2021), developer insights from MADA labo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MADA labo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MADA labo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1730190/header.jpg?t=1655999922\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}