{
    "AppID": 957790,
    "Name": "War Dust VR",
    "Release date": "May 6, 2020",
    "About the game": "Welcome to New War Dust This is War Dust completely reworked from the ground up. We've spent many, many months working to bring you the best possible VR experience. Our development team has expanded to include experienced players, so New War Dust is developed by players for players. We've focused on enhancing visuals, increasing immersion, improving performance, fixing bugs and most of the issues that were reported by users in the past couple of years. Currently there are 12 maps in Official Rotation with 10 more under development! We offer robust modding capabilities for those who want to create their own battlefields to fight against bots or share with the community. New War Dust will deliver some of the most epic moments you have ever experienced in VR, with an active player community fighting on endless possible battlefields! Large-Scale Tactical Warfare in Virtual Reality In New War Dust, we want to push the boundaries of Virtual Reality and create intense battles on a scale that has never been reached before. A total immersion experience that throws you into a breathtaking action film, full of explosions and requiring dynamic tactics to be victorious. The opportunity to fight in incredible situations where armies clash with explosive results, and you are right in the middle of the excitement. The feeling of being a part of a real epic war is now possible in immersive VR! 64 Soldiers Our goal is to create large-scale battles, rather than small skirmishes, which is why New War Dust gives you the opportunity to join a company of 32 soldiers. With 64 fighters on the battlefield, New War Dust will take you into the largest online battles that have ever been made in VR. Everyone has a role to play on the battlefield: one single soldier, at the right place at the right time, can make a decisive difference. Get ready to be this difference, to dare, to fight, and defeat your enemies. Solidarity, rivalry, cooperation, confrontation: enjoy virtual reality from a new perspective. We look forward to sharing these experiences with you! VEHICLES We wanted to create a game that makes your heart pound faster and gives you the opportunity to use everything you can for your team to win: aircrafts, rocket launchers, grenades: the possibilities are endless and no two battles are alike. Each vehicle available brings a new gameplay and has a major impact on the battle. In New War Dust you can experience the conflict from various points of view. The game is not restricted to ground combat but also it includes aerial fighting; as a plane or helicopter pilot, you will be responsible for supporting your allies on the ground. We are particularly proud of the aerial combats that give incredible sensations when you fly across the battlefield. Enjoy the thrill of a tense dogfight or help your teammates from far above. Get ready to storm the enemy lines, to cut through their defenses under the cover of a tank, to cross the battlefield at full speed on a quad to join your allies, to push the offensive with a helicopter or show dexterity dodge a missile in a plane... Surgical strike or massive attack, you will have to choose your strategy and organize quickly. Huge Battlefields Our goal at Raptor Lab is add a new dimension to virtual reality. We wanted to bring combat to a scale that has never been seen before. To do this we had to create large and rich battlegrounds to give 64 soldiers access to a multitude of different gameplays and possible strategies. Cooperation &amp; Synergy There are four classes, each with their own features and a specific role to play on the battlefield. The battle can only be won as a team. You will have to strategically communicate and interact with your teammates in order to crush your opponents. JOIN THE CLUB ON OUR DISCORD!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/957790/header.jpg?t=1658867649",
    "Price": 24.99,
    "Developers": "raptor lab",
    "Publishers": "raptor lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_09c81fac28f9c9925f14ce2c4c3bb725e8bea030.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_2bec61470c5dac3cb48f463ab1117c97aa90488d.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_c6096327be3c9e03fdcf55c14cb856ab30a59de9.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_06eb47f13517d75d18ceb5f8218a6b73cbbbce15.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_e50045b1892cccc97172fcae47bdbb8a999edb1c.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_8f6358a88e57917aa6b99b4df79ba65621d08f7b.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_760d809a6de2ae284298807e61e0d3df3b848330.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_b5f17f173dab8b8964cc63f85e33c34d2ebc94cc.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_61c4910c5327e625f1aea3b49e41ba7a0210e279.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_6096cd8e9a423511b463cb7a6b0210cd8b520bd3.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_40cecfb903da1e75e3a096c399ec560e35ed4a81.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_1d1fa8a9efa7abac4ab3c90e0214b326497e91c8.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_9de8e75dbc99afe1ce83742f8b244d3c105cf385.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_aa743bc3f3d5f8cd14543f0a1e20f7f0798205dc.1920x1080.jpg?t=1658867649,https://cdn.akamai.steamstatic.com/steam/apps/957790/ss_d61939addf44c9a7f5e09c87f6b116e86aee1639.1920x1080.jpg?t=1658867649",
    "Slug": "war-dust-vr",
    "Meta Title": "War Dust VR: May 6, 2020, raptor lab and Full Overview",
    "Meta Description": "Looking for information on War Dust VR? Check out the release date (May 6, 2020), developer insights from raptor lab, and a complete game summary.",
    "Alt Text Image": "Official header image for War Dust VR game - Steam 957790",
    "Canonical URL": "https://gusku.site/game/war-dust-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"War Dust VR\", \"description\": \"Looking for information on War Dust VR? Check out the release date (May 6, 2020), developer insights from raptor lab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"raptor lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"raptor lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/957790/header.jpg?t=1658867649\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}