{
    "AppID": 761280,
    "Name": "White Pearl",
    "Release date": "Dec 23, 2017",
    "About the game": "Story-central RPG with turn based combat, 25+ hour story, turn-based combat, sidequests and crafting system! For the full credits and copyright of the game, please view the game manual. White Pearl can only be downloaded for PC Windows systems. Expand this section to learn everything you need to know about the game. If you enjoyed or didn't, leave a review! :) *Please view the game manual for full credits of the game. Features *Some features discussed here have been added in post-launch patches to the game (2018-2020). White Pearl is an ambitious deep RPG, best described as being designed similar to the earlier Final Fantasy titles, with a strategic turn-based combat system to explore, several character stories and a focused main plot-line which all connects together by the end of the game. Set in the huge world of Ottrea and tasked with preventing the fifth time of calamity that will destroy the world and rebirth it entirely, you will explore several varied regions in both the Overworld and Underworld of Ottrea - with polished, 2D pixel-art map graphics created by veterans of the RPGMaker community. White Pearl has been designed in such a way to make it more accessible to a modern audience: - Adjustable random encounter rate - Adjustable experience gain rate - Skippable cutscenes - Toggle battle animations and text speed Can you challenge your fate? Or will you find another way to overcome it? A long, epic tale is waiting to be experienced in White Pearl. White Pearl features: - 35 hours of playtime - Hours of additional content - A story which deeply explores the characters, and also the world around them. -&gt; The story focuses on multiple perspectives of the characters which all eventually join up. - A crafting system (infusing materials with elements, creating gear based from this, and reinforcing existing gear) - Turn based battle system with interesting abilities and effects, cooldowns, and cast times. - Interesting gameplay - An alternate ending in addition to the main ending Synopsis The game's story revolves around destroying a cycle of cataclysmic events of the world, known as Dark Eras, which change/rebirth the world after each Era.​ White Pearl follows the story of Pearlto and the unlikely allies he meets up with. With a preordained meeting - Pearlto has become tasked with preventing the forthcoming of the Fifth Dark Era. This, coupled with the looming threat of the Priori (who are the antagonists of the game), means Pearlto is under immense stress in order to keep peace within Ottrea - unless calamity happens a fifth time. Even so, the origins of the world still lie in mystery, but a certain someone is there to discover it all. Each character has their own backstories and connections, but what will you discover during your journey in Ottrea? Main Characters Pearlto Divinia: A man of a religious folllowing, childhood friend of Katkin's and person of authority and empathy. Even when faced with a dark threat he is tasked to destroy, he feels regret. Should he question his faith? Katkin Elderflower: A friend which Pearlto needed. Born and raised in a restrictive and nobled family just like Pearlto, the two became friends quickly. However, she conceals her family's purpose and origin to the party. Will she tell them, or will her past continue to haunt her. She will have to learn to deal with the past. Elrise Valenheart = Brother to Elsay, his outward appearance appears to be morbid and cold, however a traumatic experience has formed him into what he is. He harbours a dark secret unknowingly. Cassopeia = A woman skilled in the arts of dark magic, she has lost any recollection of her childhood, but then she quickly learns of her identity and connection to a figure long forgotten. Kurone = Residing in the yet-uncharted lands of the Underworld, this young woman spends most of her days chronicling events that transpire in the world. A childhood friend of Elrise, the two kept in touch until they went their separate ways. It just so happens that fate will eventually bring them together. She is also the woman who knows Cassopeia's past... Many more to meet... Gameplay - Combat A large brunt of the gameplay in White Pearl is careful decision-making in and outside of combat. What equipment do you think is most optimal for each character based on their strengths and weaknesses? When in combat, the player will decide what action each character would take. When all actions have been decided, the turn will begin - along with the enemy's. Some skills have a charge time, meaning that the character who is charging the skill cannot take any actions while they are charging the skill during their turn, and must wait for it to finish to execute the skill. Furthermore, some skills have a cooldown - meaning they will have to be used strategically. Gameplay - Field Players may interact with objects in the field, outside of combat. Most of the time, interaction with these objects is crucial to progression within the game - such as solving a puzzle. Also, there are lore books around the world of Ottrea which can be found and read by the player. These lore books detail more about the mythology and history of Ottrea - but aren't necessary to read as the main story will cover more than enough. Gameplay - Content Besides from the main quest, there are also numerous sidequests you can complete - and areas to unlock and find. Doing this additional content will reap great rewards! There is also crafting within the game, which is unlocked once the first chapter is complete. You can make entirely new gear, or reinforce gear which you already own. You do all this by using materials, with certain ones being dropped by enemies and materials such as leather or cloth available at shops. Additional Features and Systems Combat Log View the situation of combat at any time by looking at what has occurred during battle. However, active debuffs and buffs, as well as health and MP, are always displayed on the combat UI without the need to access the battle log. Use this feature to see what exactly has occured in order to fine-tune your strategy. No Unexpected Points of No Return Because White Pearl is a very story-focused game, there are many points where the open world will be stripped away from you for a time, or certain areas might not be accessed later on. Thankfully, the game will notify you when this is about to happen and you can choose to proceed through the story. You can also view the recommended level you should be at that point. [/b]Linear and Unique Progression[/b] All main characters gain a unique skillset gradually by levelling up, but some skills are shared. Stat progression is advanced in a linear and set path - for example, a character's MP may only increase by a small amount by each level. The frequency of each stat can be checked on 'Character Overviews', an in-game item. In addition, sometimes characters gain new skills as the story develops and their character progresses, too.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/761280/header.jpg?t=1605779587",
    "Price": 0.0,
    "Developers": "Harry Gill",
    "Publishers": "Harry Gill",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_37de38238602435873d8dc51ed064ee32e31d17b.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_ece65752fd8236accb86e877e84b85fa04a67ea5.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_b994923caba5bd990a31633836874273f73a714d.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_373c17c7cb2d3d52e30948efeeb2bf47e741c5af.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_122607a6c6d83ad89ce65e478b6f2a433ff972b2.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_ac1788421d015e41453aa3ce0c78f3bb231eb2af.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_eac8b7370fd73f14a054a5f7bce12bb3aef85903.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_53ceed82473a635b5e9d84709288b018b0310025.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_d7ab4e27e5421b919dfbea91ff032bbdfd5c3fdf.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_c29c2c0d667d4b22f76e7ad2423bed77491336f1.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_0afcab99e3c2a1e46b09798297f881662ee8912c.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_5a2ddcd7a4294e40e2e68acb6829bc7da6afc786.1920x1080.jpg?t=1605779587,https://cdn.akamai.steamstatic.com/steam/apps/761280/ss_ae625acc85e55e9ca9c0205f09b8993734d175ab.1920x1080.jpg?t=1605779587",
    "Slug": "white-pearl",
    "Meta Title": "White Pearl: Dec 23, 2017, Harry Gill and Full Overview",
    "Meta Description": "Looking for information on White Pearl? Check out the release date (Dec 23, 2017), developer insights from Harry Gill, and a complete game summary.",
    "Alt Text Image": "Official header image for White Pearl game - Steam 761280",
    "Canonical URL": "https://gusku.site/game/white-pearl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"White Pearl\", \"description\": \"Looking for information on White Pearl? Check out the release date (Dec 23, 2017), developer insights from Harry Gill, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Harry Gill\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Harry Gill\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/761280/header.jpg?t=1605779587\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}