{
    "AppID": 1630500,
    "Name": "Would you like to run an idol café? 2",
    "Release date": "Sep 27, 2021",
    "About the game": "In this Visual Novel Yokoyama Naoya works as a waiter a small seaside café owned by the flirtatious Miss Miyamori. Alongside his co-workers, the serious Mayuki and the spacey Kuu, Naoya is happy to while away his days with honest labor... At least, until he learns that The Seaside Café is in the red, and runs the risk of closing. Wanting to save the café from being shuttered, Naoya turns to his childhood friend, Ichigo, for advice. After giving the predicament some thought, Ichigo decides that what The Seaside Café is lacking is its own idol group. Bright, shining, sparkling idols should be more than enough to rescue the café from obscurity, and bring about a huge influx in potential customers! Ichigo enlists Kuu and Mayuki's help, and together they form an idol unit to represent The Seaside Café: Sweet Shoreline. Things seem to be going well, but there are a few snags with Ichigo's wonderful plan. Firstly, Mayuki and Kuu have no experience singing and dancing - and secondly, there's a rival idol group in town, Honey Devil, who seem determined to undermine all of Sweet Shoreline's efforts. Will Sweet Shoreline be able to succeed, or will they self-destruct before accomplishing their noble goals? That's for Naoya's actions to determine! Suzuki Ichigo is Naoya's childhood friend. She's a cheerful, bubbly girl with no shortage of energy. She's almost perpetually optimistic, but she has a bad habit of pushing herself. She has a tendency to take on more work than she should, and Naoya often worries that she'll burn herself out. Ichigo acts as the leader of Sweet Shoreline. She adores idols herself, being a huge fan of Hoshizora Shiori, and works tirelessly on polishing her singing and dancing. Shinonome Mayuki is a serious girl Naoya first met when he began to work at The Seaside Café. Though he and Mayuki got off to a rocky beginning, after he accidentally tripped her on his first shift, Mayuki soon softens towards him. Mayuki might act uppity and aloof, but this is largely a veneer to hide her own lack of self-confidence. She's a shy girl who worries how others will perceive her, and while undoubtedly gifted at academics, she's lacking when it comes to common sense. Yamashiro Kuina, known to her friends as Kuu, works as a waitress at The Seaside Café. She rarely speaks or smiles, but she isn't shy: she's prone, instead, to getting lost in her own world. Kuu is a close friend of Mayuki's, and the pair have known one another since preschool. Mayuki might be Kuu's only friend, in fact, for the other waitresses at The Seaside Café tend to keep their distance. Kuu has a vested interest in fortune-telling, but the fortunes she often tells are steeped in mundane misery. She talks about macabre subjects often, has truly bizarre tastes in 'music', and when she does speak, it's to utter unnerving portents about the future which make Naoya shudder. Enoshima Rina is an elegant, demure young lady who works as a waitress at Café Pleiades. She forms one half of the popular idol unit Honey Devil, alongside her friend Hasaki. Rina's mannerisms are unfailingly polite, yet behind her demure smile there lurks something unsettlingly sadistic. She seems to have taken quite a liking to Naoya, and keeps trying to pursue him, much to Naoya's unease. Ebihara Hasaki is a gothic girl who fancies herself as 'the dark one', and a servant of 'The Dark Lord'. Like Rina, she works as a waitress at Café Pleiades, and makes up the second member of the idol duo Honey Devil. Hasaki is an attractive girl, as far as appearances go, but her personality leaves much to be desired. She talks like she inhabits a different reality to everybody else, and perhaps she does. Trying to understand her ramblings is a hassle liable to induce headaches, and the best way to deal with her would be to ignore her.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1630500/header.jpg?t=1642686487",
    "Price": 9.99,
    "Developers": "StarlightTree Games",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_f2d3e24d39046be95cfb2b8486adb9edf463a958.1920x1080.jpg?t=1642686487,https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_a16787fe92f4a2b793a8c3d6f55b95db56e663dc.1920x1080.jpg?t=1642686487,https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_908667f5cca1ac105c15b4ca96ee6e2d11a3e2eb.1920x1080.jpg?t=1642686487,https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_dbd24b747e6fc8f10186fcdca235065706ce652f.1920x1080.jpg?t=1642686487,https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_924b18034e5f9990e3113afbde60cb98a0e08829.1920x1080.jpg?t=1642686487,https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_c21350591874fea7e52c105eefa809d6c8fdf91f.1920x1080.jpg?t=1642686487,https://cdn.akamai.steamstatic.com/steam/apps/1630500/ss_dc980bf638c515bd4bdbeea0004cf1ead79a00e3.1920x1080.jpg?t=1642686487",
    "Slug": "would-you-like-to-run-an-idol-caf-2",
    "Meta Title": "Would you like to run an idol café? 2: Sep 27, 2021, Star...",
    "Meta Description": "Looking for information on Would you like to run an idol café? 2? Check out the release date (Sep 27, 2021), developer insights from StarlightTree Games...",
    "Alt Text Image": "Official header image for Would you like to run an idol café? 2 game - Steam 1630500",
    "Canonical URL": "https://gusku.site/game/would-you-like-to-run-an-idol-caf-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Would you like to run an idol caf\\u00e9? 2\", \"description\": \"Looking for information on Would you like to run an idol caf\\u00e9? 2? Check out the release date (Sep 27, 2021), developer insights from StarlightTree Games...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"StarlightTree Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1630500/header.jpg?t=1642686487\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}