{
    "AppID": 241790,
    "Name": "Z3TA+ 2",
    "Release date": "Sep 9, 2013",
    "About the game": "The legendary waveshaping sound of Z3TA+ (zay'-ta) is back – and better than ever. New filters, modulatable waveshapers, flexible effects, expressive control and a gorgeous new interface make Z3TA+ 2 one seriously powerful synth. It’s not often that a soft synth can be called a classic, but in the case of Z3TA+ it’s definitely appropriate. Used on countless tracks over the past decade, Z3TA+’s distinctive sound has been a staple of electronic artists the world over. Waveshaping Synthesis for the PC Ultimate waveshaping control with dozens of sonic tools Intuitive and graphically responsive interface 2,000+ professionally crafted presets Built-in fully customizable studio quality FX. New in Z3ta+2.2 We've recently updated Z3TA+ 2 , introducing a wealth of new features and enhancements for Windows users. AAX Support for Pro Tools users Windows 10 Support VST3 Support 4 Stage Phaser Arpeggiator Bypass Improved Search Functionality Load FX from another program Mod Matrix Additions Dozens of fixes and enhancements Waveshaping Synthesis Choose, tweak, and fine-tune your waveform Free and adaptive pitch-bending analog style performance grid 14 continuously variable dual-stage filter types Envelopes to control any parameter 6 Powerful LFOs for individual or universal control Straightforward Mod Matrix and Arpeggio tools Global control for a crushing brickwall limiter, level, tuning, and polyphony Built-in Effects 5 distortion types, plus routing options and continuously variable controls Slow, Medium, and Fast compression with threshold, ratio, and makeup gain controls Totally tweakable Room, Hall, and Plate reverbs 7-band graphic eq with variable band settings and colorful Simulator Mode 9 adjustable Chorus, Phaser, and Flanger effects 4 Stereo Delay types with Sync and EQ controls Drag-and-drop effects in any order Supported in the following DAW Software SONAR Music Creator Cubase Protools FL Studio Studio One Additional VST/AAX Compatible Hosts",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/241790/header.jpg?t=1511595559",
    "Price": 0.0,
    "Developers": "Cakewalk",
    "Publishers": "Cakewalk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/241790/ss_038b65c158a11e38665027dc4dd57fdf5123460a.1920x1080.jpg?t=1511595559,https://cdn.akamai.steamstatic.com/steam/apps/241790/ss_5495cea3fbdd115f189c19034e90d00d922c064a.1920x1080.jpg?t=1511595559",
    "Slug": "z3ta-2",
    "Meta Title": "Z3TA+ 2: Sep 9, 2013, Cakewalk and Full Overview",
    "Meta Description": "Looking for information on Z3TA+ 2? Check out the release date (Sep 9, 2013), developer insights from Cakewalk, and a complete game summary.",
    "Alt Text Image": "Official header image for Z3TA+ 2 game - Steam 241790",
    "Canonical URL": "https://gusku.site/game/z3ta-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Z3TA+ 2\", \"description\": \"Looking for information on Z3TA+ 2? Check out the release date (Sep 9, 2013), developer insights from Cakewalk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/241790/header.jpg?t=1511595559\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}