{
    "AppID": 979000,
    "Name": "Abrakadaboom",
    "Release date": "Apr 18, 2019",
    "About the game": "Welcome in the world of Abrakadaboom, a world overflowing with magic, so much that everyone here is a wizard. In their quest for power, some scholar wizards started to study odd artifacts called orbs that could focus the elemental magic around them. After a series of experiments ending in quite impressive magic explosions, the scholar realized the orbs where too unstable. The novice wizards, who were quite bored in their magic studies, had different conclusions: one, those orbs would make quite a show as weapons, and two, we need a magic fight club! Face off your friends in battles up to 4 players (humans or bots) either alone or as a team. Navigate your way through the arena, trap your enemies with magic infused exploding orbs while outsmarting them, gather power-ups to lay more orbs and give them greater reach, use your dash to avoid danger or surprise your opponents and exploit everything the arena gives you, like the way your orbs explode, your elemental spell and even some environmental hazards! Gameplay easy to learn, rich and fast-paced. 1 to 4 players in free for all or team versus team. 4 game modes : ◦ Sudden death: You’ve got one life and there can only be one survivor. Be fast or the arena will try to kill you all. ◦ Extra lifes: Kill, die, respawn… but not too many times! ◦ Witch hunt: Hunt your friends and steal their magic wand! ◦ Keep the runes: Get points by carrying runes, but be warned, they will slow you down. Multiple skills : ◦ Exploding orbs (works as bombs) that varies with the environment and can be upgraded with power-ups. ◦ Magic power that varies with the environment and can be offensive or defensive. ◦ Grab and throw the orbs, target it right and stun your enemies. ◦ Dash to avoid danger or surprise your opponents... and discover this skill other uses! In Abrakadaboom's world, magic affects everything including the environment. Fight in the heart of the elements, but be careful about the dangers the instabilities those magic flows can cause. 5 magic types and environment: ◦ Master the pure Arcana magic in the crystal swamps and under the watch of the full moon. ◦ Use the Earth magic to bury your victims in the heart of deepest runic mines. ◦ Blow your opponents with the Wind magic on floating islands swayed by the winds high above the clouds. ◦ Burn everything with the Fire magic on an erupting volcano while being surrounded by melting lava. ◦ Drown your foes with the Water magic at the bottom of the sea while surrounded by water walls.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/979000/header.jpg?t=1564667096",
    "Price": 19.99,
    "Developers": "Argonauts Studios",
    "Publishers": "Argonauts Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_32e45446ca27be63b072c7c495b823c0c69eee9e.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_ee1893a43ce00238090e9b37d102e42503569a8b.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_882e63e719e71832f319228fa318e4335f08cd1e.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_fc7cc816dd1feb399e29e03e63bebe79b5f27774.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_0ae2bb709bdd85a924bbc8709f5f0a70f9813441.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_2adb6b2cfe7907700c9e6a93cb113855ddf8c87d.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_636cfdbf879637c6d1ab7630043fd51f872ca337.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_5aa57707d11495fbdd5276f2219430b4b901ee76.1920x1080.jpg?t=1564667096,https://cdn.akamai.steamstatic.com/steam/apps/979000/ss_d59958d4ddd47c6c21a88c14a70527f11a187e55.1920x1080.jpg?t=1564667096",
    "Slug": "abrakadaboom",
    "Meta Title": "Abrakadaboom: Apr 18, 2019, Argonauts Studios and Full Ov...",
    "Meta Description": "Looking for information on Abrakadaboom? Check out the release date (Apr 18, 2019), developer insights from Argonauts Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Abrakadaboom game - Steam 979000",
    "Canonical URL": "https://gusku.site/game/abrakadaboom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Abrakadaboom\", \"description\": \"Looking for information on Abrakadaboom? Check out the release date (Apr 18, 2019), developer insights from Argonauts Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Argonauts Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Argonauts Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/979000/header.jpg?t=1564667096\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}