{
    "AppID": 747540,
    "Name": "AcChen - Tile matching the Arcade way",
    "Release date": "Dec 20, 2017",
    "About the game": "AcChen is a simple to learn, arcade style 'find the matching tile' game. Master the 60 different level and various bonus maps in the single player campaign. Unlock new levels by beating the clock or play in 'chill mode' without any pressure: no timer, no score just happy tile hunting ( but also no level unlocking ). Feature list fast arcade style 'find the matching tile' game two game modes: arcade and 'chill' mode 60 levels + various bonus maps 3 different bonus level types: fill the board, spot the match, find the match three relaxing sound tracks Steam Leaderboard 8 unlock-able achievements Rules Clear the board by finding two items with identical symbols. The tiles will disappear when you can 'connect' them with a line, which has two or less corners ( right angles ) in it and no other part is blocking the way. Advance to the next level by clearing the board. If you run out of time before you finish a map, you lose. A map can contain tiles in up to 3 layers. You might combine tiles of different layers. If you pick one tile from the top layer and one from the bottom layer, only tiles on the top layer block the way. In general: if you pick items from different layers, the upper most selected items layer is used for the search algorithm. Sounds difficult but if you give it a try, you will figure in no time... ;) Tiles with the same symbol might be located on top of each other. So the fastest pick is not always the best. Bonus Level Every 3rd level you play is a bonus level. There are three different types of bonus level: 1.) You start with 4 tiles and have to fill up the map. Every time you remove a pair, 4 new tiles will appear. 2.) Two visible tiles swap its places quickly for several times. Spot the last position. 3.) Classic 'find a matching pair' on the turned deck. If you manage to complete a bonus level, you receive a 100 point bonus. If the time runs out, you advance to the next level. After finishing a bonus level you receive an extra Hint-Item ( see below ). If you are not up for bonuses, you can skip the bonus level. Special Items Solid Tiles Solid tiles cannot be removed. Yin Yang If you pick a pair of Yin Yang the next picked symbol will disappear from the current map. If the Yin Yang is the last pair you pick, you can use this special on the next map. Time Bonus Item From time to time animated hourglasses appear on a symbol for a few seconds. If you manage to remove this item you receive 15 extra seconds. Hint Item If you need a hint during the game, tap the Hint Item. If available, a matching pair will be selected. It will disappear if you tap on it. After finishing a Bonus Level you receive an extra Hint Item. You can collect up to 3 Hint Items. Scoring The first successful pick scores 0 points. The next pick within 3 seconds, scores 4 points, within 5 seconds 2 point. After finishing a level, the remaining time is added to you score. Highscore and Achievements AcChen uses Steams Leaderboard - you can share your score with players around the world. Discover the 8 unlock-able achievements. Game History In the early 90s I played a game called 'Match It' at the local Arcade - I spent quite some coins on it :o. A few years later three friends and me picked up the game mechanics. We coded a version for the Atari ST and Amiga. The game-play was extended in may ways. It was released under the name 'Sarakon'. The game was programmed in 68k assembler. After I got a NEXTSTATION I did rewrite the game and released it under the name AcChen. Over the time I did also port it to the NintendoDS, iOS and OSX. Have fun :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/747540/header.jpg?t=1583312233",
    "Price": 3.99,
    "Developers": "Stefan Preuss",
    "Publishers": "Stefan Preuss",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_311b2766b8072757c294a1bbd7df5e3504106206.1920x1080.jpg?t=1583312233,https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_57a0513c6061889ab21e46451c64591a14300e46.1920x1080.jpg?t=1583312233,https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_01330c7fa1347d250e6ebf4bd0f40d4624e9037a.1920x1080.jpg?t=1583312233,https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_49fe1649f32de17923e37c62babb9e364760404d.1920x1080.jpg?t=1583312233,https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_64622e50f4c2fb974d1b51f3ad4fb5bbc9cbab39.1920x1080.jpg?t=1583312233,https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_16698771c783163a94142a5ef1107f1bf3adb22a.1920x1080.jpg?t=1583312233,https://cdn.akamai.steamstatic.com/steam/apps/747540/ss_d413371e35ce4223adbf1108a7f47102fa0f4c62.1920x1080.jpg?t=1583312233",
    "Slug": "acchen-tile-matching-the-arcade-way",
    "Meta Title": "AcChen - Tile matching the Arcade way: Dec 20, 2017, Stef...",
    "Meta Description": "Looking for information on AcChen - Tile matching the Arcade way? Check out the release date (Dec 20, 2017), developer insights from Stefan Preuss, and ...",
    "Alt Text Image": "Official header image for AcChen - Tile matching the Arcade way game - Steam 747540",
    "Canonical URL": "https://gusku.site/game/acchen-tile-matching-the-arcade-way",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AcChen - Tile matching the Arcade way\", \"description\": \"Looking for information on AcChen - Tile matching the Arcade way? Check out the release date (Dec 20, 2017), developer insights from Stefan Preuss, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stefan Preuss\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stefan Preuss\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/747540/header.jpg?t=1583312233\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}