{
    "AppID": 1672690,
    "Name": "Across the Galaxy: Stellar Dominator",
    "Release date": "Dec 2, 2021",
    "About the game": "Across the Galaxy: Stellar Dominator is a game that combines space stronghold contention strategies and horizontal flight shooting elements. It’s up to you to help one of the camps claim dominion over a star in the galaxy. To assist the friendly camp in occupying resource-rich strongholds and breaking through the enemy camp base, you will drive an experimental spaceship to shuttle between planets and satellites. The resources and technology of each camp are constantly developing. You’ll need to continuously intensify the power of the friendly camp and weaken the power of the enemy camp to win the war. Boost your own strength, develop more advanced spaceships and more powerful weapons and equipment and recruit excellent crews so that you can deal with enemy fleets and break through the siege. During the flight, you will also encounter various emergencies that need to be dealt with. Handle them carefully; their impact on the battle can’t be ignored. * Randomly generated galaxy maps, planets, satellites, strongholds and characters are different in each round * Combining two different dimensions of war strategy and horizontal shooting can be very useful in macro wars and local battles * The entire game world will develop dynamically as each faction collects resources, produces fleets, develops technology and is affected by player behavior * Players can develop more powerful ships, weapons and devices through technological upgrades * Randomly generated emergencies play various roles in the game * Various battle scenes from vast space to a barren planet surface, to large cities, to small towns; all map environments have corresponding scenes in battle * Various weapon systems that players can freely match according to their own preferences; strategically matching different battle situations can make the fight easier * An excellent crew can make the player's combat effectiveness stronger. The crew can be recruited and hired in strongholds We are an independent studio from China dedicated to the development of fun and distinctive games. We developed Across the Galaxy: Stellar Dominator hoping to bring players a different gaming experience. Players are welcome to follow our social accounts to learn more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1672690/header.jpg?t=1645973136",
    "Price": 8.49,
    "Developers": "GameTrail Studio",
    "Publishers": "GameTrail Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1672690/ss_6f025c27bab8020c1607f74995ec228a3023532e.1920x1080.jpg?t=1645973136,https://cdn.akamai.steamstatic.com/steam/apps/1672690/ss_971fda838504bb05a0338c6b7bb32f94dac8460f.1920x1080.jpg?t=1645973136,https://cdn.akamai.steamstatic.com/steam/apps/1672690/ss_c8c6195207bc454076f7a1f305bdf514f09be427.1920x1080.jpg?t=1645973136,https://cdn.akamai.steamstatic.com/steam/apps/1672690/ss_cede49b7fa2b2c18d81b6f4c1be8998f66a7b7d1.1920x1080.jpg?t=1645973136,https://cdn.akamai.steamstatic.com/steam/apps/1672690/ss_b62d045dcc0098734debd2765bdf18b1292469e3.1920x1080.jpg?t=1645973136,https://cdn.akamai.steamstatic.com/steam/apps/1672690/ss_be0b5385868c066042e3218ff194b85401415adf.1920x1080.jpg?t=1645973136",
    "Slug": "across-the-galaxy-stellar-dominator",
    "Meta Title": "Across the Galaxy: Stellar Dominator: Dec 2, 2021, GameTr...",
    "Meta Description": "Looking for information on Across the Galaxy: Stellar Dominator? Check out the release date (Dec 2, 2021), developer insights from GameTrail Studio, and...",
    "Alt Text Image": "Official header image for Across the Galaxy: Stellar Dominator game - Steam 1672690",
    "Canonical URL": "https://gusku.site/game/across-the-galaxy-stellar-dominator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Across the Galaxy: Stellar Dominator\", \"description\": \"Looking for information on Across the Galaxy: Stellar Dominator? Check out the release date (Dec 2, 2021), developer insights from GameTrail Studio, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"GameTrail Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GameTrail Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1672690/header.jpg?t=1645973136\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}