{
    "AppID": 694870,
    "Name": "All Contact Lost",
    "Release date": "Mar 22, 2018",
    "About the game": "The News The moon is now a financially feasible place to travel to, several conglomerates have staked out plots of land and encroachment has caused major conflicts, reports of a large and deadly organism living on and underneath the lunar surface have been confirmed and named the ‘Acari’. The Objective You and up to four other mercenaries will be dropped off to build an outpost into a military facility, the Acari have proven very territorial and will defend their habitats no matter the cost. A dropship will arrive as often as possible to drop new supplies for you and your team to delegate upgrades, make sure your overall strategy is sound otherwise you may find yourself lacking the proper means to defend an assault. The Rewards As you fight for your company, you will be promoted and given camouflages to diverge yourself from the grunts. The Features - Swarm, our first game mode will have you fighting against waves of enemies, on your own or with up to four other players. Upgrades will arrive every five rounds but requires a vote from the team to decide what you get, enemies will become bigger and stronger over time and will force you to adapt your strategy or become overrun. - Raid, our second game made allows you and a party of up to four other players to invade a swarm game at any time and attempt to kill the occupants for a quick exp boost and ruin their hard earned progress. - Upgradable; weapons, armours, turrets and fortifications will have you choosing between an automated base defence or relying on your own skill. - Level progression will have you promoted through 50 ranks with camouflage, sidearm and attachment rewards - Three maps will allow you to choose your preferred landing site; each with their own backstory. - Last Stand Protocol can be activated to give you one last chance at survival, this will weld the doors and deploy internal turrets - Events and Objectives can occur in game, whether you are hit by a devastating dust storm or refuelling a combat dropship to assist you in battle.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/694870/header.jpg?t=1572343846",
    "Price": 0.0,
    "Developers": "1st impact games",
    "Publishers": "1st impact games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/694870/ss_74a44ef76212c5fc2b0465d12a427e9b11d25949.1920x1080.jpg?t=1572343846,https://cdn.akamai.steamstatic.com/steam/apps/694870/ss_b2ef87c181a95ddafd525c262593efbe42acf8d4.1920x1080.jpg?t=1572343846,https://cdn.akamai.steamstatic.com/steam/apps/694870/ss_887b25c9823cc73a9289d9d7f15352623b1f0338.1920x1080.jpg?t=1572343846,https://cdn.akamai.steamstatic.com/steam/apps/694870/ss_0b541c3cc29cb6ff09a153a1cd6179b25980b43f.1920x1080.jpg?t=1572343846,https://cdn.akamai.steamstatic.com/steam/apps/694870/ss_97fb3225d9e1be858a6c5a04084aad56fee369a2.1920x1080.jpg?t=1572343846",
    "Slug": "all-contact-lost",
    "Meta Title": "All Contact Lost: Mar 22, 2018, 1st impact games and Full...",
    "Meta Description": "Looking for information on All Contact Lost? Check out the release date (Mar 22, 2018), developer insights from 1st impact games, and a complete game su...",
    "Alt Text Image": "Official header image for All Contact Lost game - Steam 694870",
    "Canonical URL": "https://gusku.site/game/all-contact-lost",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"All Contact Lost\", \"description\": \"Looking for information on All Contact Lost? Check out the release date (Mar 22, 2018), developer insights from 1st impact games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"1st impact games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"1st impact games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/694870/header.jpg?t=1572343846\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}