{
    "AppID": 266430,
    "Name": "Anarchy Arcade",
    "Release date": "Sep 3, 2014",
    "About the game": "Anarcy Arcade is a shortcut launcher, just like your regular desktop. It replaces your 2D wallpaper image with a 3D world, and replaces your 2D shortcut icons with 3D objects. It transforms our PCs into 3D metaverses that we can explore with our friends while still getting work done. Performance is always put first. It will not lag your games down. Use AArcade as your everyday desktop, or use it to manage your massive game, movie, or image collection and share with your friends. Menu-less Browsing AArcade is a 'game between games' where you walk up to what you want and click LAUNCH. No more down-time between games! Customize Easily spawn in new shortcuts or props, modify their properties, and build your dream arcade! Full Version Games &amp; Apps AArcade launches ANYTHING that you can run on your PC and runs them at full quality &amp; speed. You'll NEVER have to choose between AArcade or running your games well. Addons &amp; Modding Use the maps &amp; models from over 30 of your favorite Source engine games as your 3D desktops! Over 50,000 compatible maps and many thousands of compatible props! Steam Workshop Share your customizations or your creations with the rest of the community with AArcade's BUILT-IN workshop publishing tool! Well over 1,000 items already shared! Explore Discover how deep each rabbit hole goes when exploring the massive creations of other players, past &amp; present. Multiplayer Host any one of your 3D desktops in multiplayer mode. Watch videos with your friends, give tours of your collection, or just hang out on your desktop! (Note that port 27015 must be open to host a public server.) Virtual Reality (OPTIONAL) Truly experience the metaverse in 3D using your Oculus Rift, HTC Vive, or other VR devices. The tidal wave of the future is about to hit! Be Productive AArcade lets you use your Start menu, alt+tab, use your favorite programs, etc. The things you launch open right on top of AArcade, just as if it was your desktop wallpaper image. Sleep Mode When it needs to, AArcade goes into a deep sleep mode where it releases all of its textures, 3D models, etc. so that your PC is free to run what matters most: the stuff you launch. Steam Stats &amp; Achievements Compare the size &amp; stats of your collections with your friends. Earn achievements for reaching milestones, and for ever leave your mark on a map by being the 1st person to load it up in AArcade! Free &amp; Indie AArcade is 100% free and developed by just 1 guy. It does NOT have built-in ads and is not a corporate attempt to sell you junk. It is made specifically to enhance your PC experience. Features Supports the Oculus Rift for a virtual reality experience! Works with Steam games, non-Steam games, movies, YouTube videos, pictures, websites, etc. Launches your files &amp; programs. just like normal! Instantly ALT+Tab to switch between programs. Goes into sleep mode while you play other games. (Doesn't lag you down!) Emulators are supported! (But not included.) Automatically finds YouTube trailers and HD boxart to use on 3D shortcuts. Does not interfere with Windows or your normal computer use. Anarchy Arcade does NOT come bundled with any additional games or movies. It simply is a fun &amp; entertaining way to access your personal media collection and share the experience with your friends. Merging Reality with Virtual Reality Anarchy Arcade lets you spawn real-life games, movies, pictures, and other media (directly from your PC or the internet) into the virtual world. In the screenshots here on the Steam Store page, we have labeled these real-life media items with a [CENSORED] sticker so you can easily see them. Just imagine your favorite stuff under those stickers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/266430/header.jpg?t=1579563618",
    "Price": 0.0,
    "Developers": "Elijah Newman-Gomez",
    "Publishers": "Elijah Newman-Gomez",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/266430/ss_2c0765f0e3ff88db9b0dcf5555c561a38da90374.1920x1080.jpg?t=1579563618,https://cdn.akamai.steamstatic.com/steam/apps/266430/ss_de4086c57c11060d9374fbed715f5878c404dd28.1920x1080.jpg?t=1579563618,https://cdn.akamai.steamstatic.com/steam/apps/266430/ss_aed58376a4f11c7639ed7e3704336335162ef405.1920x1080.jpg?t=1579563618,https://cdn.akamai.steamstatic.com/steam/apps/266430/ss_c4e2abed38e1ab732199d7bc9218896ca8283f50.1920x1080.jpg?t=1579563618,https://cdn.akamai.steamstatic.com/steam/apps/266430/ss_241a1ad4bae8289a98733bbe2b35e2757d0872da.1920x1080.jpg?t=1579563618",
    "Slug": "anarchy-arcade",
    "Meta Title": "Anarchy Arcade: Sep 3, 2014, Elijah Newman-Gomez and Full...",
    "Meta Description": "Looking for information on Anarchy Arcade? Check out the release date (Sep 3, 2014), developer insights from Elijah Newman-Gomez, and a complete game su...",
    "Alt Text Image": "Official header image for Anarchy Arcade game - Steam 266430",
    "Canonical URL": "https://gusku.site/game/anarchy-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Anarchy Arcade\", \"description\": \"Looking for information on Anarchy Arcade? Check out the release date (Sep 3, 2014), developer insights from Elijah Newman-Gomez, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Elijah Newman-Gomez\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Elijah Newman-Gomez\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/266430/header.jpg?t=1579563618\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}