{
    "AppID": 866430,
    "Name": "AS+CEND",
    "Release date": "Sep 26, 2018",
    "About the game": "AS+CEND is a space shooter where you pilot powerful combat ships in ferocious clashes against other players in a fully 3D environment. Fight in complex arenas with six degrees of freedom using different ships, weapons and abilities. Each match in AS+CEND is a deliberate battle of deadly intent that can quickly become a frantic fight for your life, or resolve into a satisfying kill when all goes according to plan. Think in all directions! Each side of an AS+CEND ship has a shield which protects you from attacks from that direction. Some of these facings also have weapons mounted. Attacking with these weapons will let you strip the shields from you enemies, but it will also drop the shields on that side. Claim victory by exposing your opponent's hull while protecting your own weaknesses. We're working hard to bring more tools of destruction to the table. New ship frames will offer different movement styles and ultimate abilities to confound your enemies. New weapons will impose a variety of deadly threats in your conflicts. New abilities will create more opportunities for you to trick your opponents. Regularly Updated Content Ship Frames We plan to introduce new ship frames each with a unique layout of equipment slots, movement power and ultimate ability. Weapon Modules We're going to regularly add new weapons to the existing weapon types as well as introduce brand new archetypes. Ability Modules We'll be adding new and interesting abilities to the game to mix up the combat formula and keep fights from getting too comfortable. Combat Arenas We'll be developing more maps, generally timed against other major feature releases. Maps will be introduced in sets of combat arena that are all similarly themed and will be used in most of the game modes. Upcoming Features Patrols Patrols are single player activities designed for players who want to challenge their combat skills but don't have the time or desire to compete directly against other players. This game mode will features progression and randomization for a different challenge each run! Battles Battles will be 3 vs 3 matches that will give players the chance to emphasize their teamplay in more goal-oriented game modes. Customization Everything from cosmetics to custom ship layouts, we're planning on allow players to tailor their equipment to their own desired play style. Ranked Play We're planning on having seasonal ranked options for players who wish to play with and against similar skilled players and challenge themselves to rise through the ranks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/866430/header.jpg?t=1593724584",
    "Price": 4.99,
    "Developers": "Whimsy Games",
    "Publishers": "Whimsy Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/866430/ss_0fc0cbbf06103f53a4ae58ee92dc226ea8a4b074.1920x1080.jpg?t=1593724584,https://cdn.akamai.steamstatic.com/steam/apps/866430/ss_f31b9fdcea9ca7199504d023285e0dc659efcb35.1920x1080.jpg?t=1593724584,https://cdn.akamai.steamstatic.com/steam/apps/866430/ss_d6f9f287e608d8139ee7be9b46b180a55bcb22b7.1920x1080.jpg?t=1593724584,https://cdn.akamai.steamstatic.com/steam/apps/866430/ss_6320aef37375a49fb90917bc27a2898c48af6d74.1920x1080.jpg?t=1593724584,https://cdn.akamai.steamstatic.com/steam/apps/866430/ss_f60808bf27e56df514dec012a3e06aa7b0ffc297.1920x1080.jpg?t=1593724584,https://cdn.akamai.steamstatic.com/steam/apps/866430/ss_55d3d19e8f5e4d65f486e1480031395d163cebae.1920x1080.jpg?t=1593724584",
    "Slug": "as-cend",
    "Meta Title": "AS+CEND: Sep 26, 2018, Whimsy Games and Full Overview",
    "Meta Description": "Looking for information on AS+CEND? Check out the release date (Sep 26, 2018), developer insights from Whimsy Games, and a complete game summary.",
    "Alt Text Image": "Official header image for AS+CEND game - Steam 866430",
    "Canonical URL": "https://gusku.site/game/as-cend",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AS+CEND\", \"description\": \"Looking for information on AS+CEND? Check out the release date (Sep 26, 2018), developer insights from Whimsy Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Whimsy Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Whimsy Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/866430/header.jpg?t=1593724584\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}