{
    "AppID": 632800,
    "Name": "Beyond Eden",
    "Release date": "Oct 6, 2017",
    "About the game": "Beyond Eden is a visual novel set in the Victorian era, centering on the themes of 'love-hate' and 'revenge.' The player enters the shoes of Alex Wake, a young businessman who returns to a Baron’s mansion where he stayed as a boy. Bearing a deep grudge against the Baron and his family, Alex seeks to manipulate them and their employees in order to lead the family down the path of destruction. Alex can develop dark and complex relationships with 6 male characters. It depends on you, the player, to steer the story towards foreseeable tragedies or help Alex discover the faint chance of redemption. Description A psychological thriller centered on revenge. Homosexual romance between men based on the dark themes of love and hate. Warning: Features dubious consent/non-consensual sex between adult men. Develop relationships with 6 male characters (5 romantic interests) of various age, personality, and physique: the austere eldest son and heir apparent, the cold and silent second son, the pure and innocent youngest son, the kindly family doctor, the impeccably polite butler, and the social butterfly friend. More than 20 in-game events with sexual content. (Note: Does not include sexual depictions of women or minors.) Individual stories for all romantic interests. Clearing every route will uncover the full truth behind the tragedy that transpired at the Baron’s mansion more than a decade ago. 17 different endings. More than 70 elaborately illustrated event graphics. Beyond Eden provides voices by Korean professional voice actors during major in-game events. Beautiful original score in tune with the period drama. Over 30 tracks. 15~25 hours of gameplay. 5 romantic interests Befriendable character (non-romantic story route) (Note: Jeremy is not a romantic interest, but Alex can still form a certain type of relationship with him. Jeremy has his own story route and endings as well.) Story It is the late Victorian era, a time of drastic social upheaval and shifting values. Yet everything seemingly remains routine and unchanged in 'Ashgrove Park,' a stately mansion surrounded by a vast forest. But then a man arrives to disturb its tranquility—a man who spent his boyhood at the estate has now returned after 10 years. The Baron Edenic—the master of the house—and his four sons, the doctor, and the servants greet him with wariness, joy, or unfamiliarity. A story of discord and destruction between and the people of the mansion and a man who hides his thirst for revenge beneath a calm demeanor. Does the fall await beyond Eden? Or—",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/632800/header.jpg?t=1608570264",
    "Price": 34.99,
    "Developers": "Studio Pieplus",
    "Publishers": "Studio Pieplus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_943280c77f93e16c83ed5a3937c954d8e49839fc.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_0d9c3ad8324731ac759f545005c4188a92aaa0a7.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_1d37a92b4a8bf2d935262a3752bca6208419e072.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_bc3cb9471bead88c84e42c470912711360ac90e6.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_246eceb2394ece2bb855db501836654fd8facbb3.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_7f928c3b3354bae5855ce4bf9d6c5d8faa077ece.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_4b8b3033cecfa223c1c5f39774d957ff2b40090e.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_492ac7bd1430550a255cd1381eebfa9f89f29efa.1920x1080.jpg?t=1608570264,https://cdn.akamai.steamstatic.com/steam/apps/632800/ss_0335833cb2dbbb480ae114edc7e9d0c1b43ed30e.1920x1080.jpg?t=1608570264",
    "Slug": "beyond-eden",
    "Meta Title": "Beyond Eden: Oct 6, 2017, Studio Pieplus and Full Overview",
    "Meta Description": "Looking for information on Beyond Eden? Check out the release date (Oct 6, 2017), developer insights from Studio Pieplus, and a complete game summary.",
    "Alt Text Image": "Official header image for Beyond Eden game - Steam 632800",
    "Canonical URL": "https://gusku.site/game/beyond-eden",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beyond Eden\", \"description\": \"Looking for information on Beyond Eden? Check out the release date (Oct 6, 2017), developer insights from Studio Pieplus, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Pieplus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Pieplus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/632800/header.jpg?t=1608570264\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}