{
    "AppID": 1822300,
    "Name": "Bounce Ball: Neon Party Arcade",
    "Release date": "Feb 4, 2022",
    "About the game": "Bounce Ball: Neon Party Arcade is reimagining a videogame classic: Play virtual table tennis with up to 4 players in a futuristic visual style using new gameplay elements like power ups and randomly generated arenas. Experience a fast-paced multiplayer game in which even the arena can change from moment to moment. Will you keep cool and come out on top? Bounce Ball: Neon Party Arcade has been developed by an interdisciplinary team of students as a semester project within a time frame of four months. We hope you enjoy our final results! A video game classic reimagined Chances are, you know the drill: You have a paddle to guard your goal. There is a ball. You try your best to bounce that ball into your opponent's goal. But what if there are not two players, but four? Three balls instead of one? Not to mention items, arena elements – and did you know that the arcade sometimes likes to change? More players! More items! More chaos! More fun! Up to four players Invite your friends and have fun in the chaotic arena of Bounce Ball: Neon Party Arcade. Supporting both multiple controllers and all-on-one-keyboard amateur wrestling, you can play it whenever you have friends around. And should your friends not be available, you can play against three different difficulties of AI opponents. Your friends do have time, but they live too far away? No need to worry, as Bounce Ball: Neon Party Arcade supports Steam Remote Play Together! Only you have to own the game to play with up to three friends via the internet. Chaos ensues Do you think four players in one arena is not enough chaos? So do we! That's why we added a bunch of items, both to help you and to hinder your opponents. Make the next goal count twice as much! Switch out the arena elements! Boost your paddle speed! And if that is not enough, there are the arena elements. They spawn randomly at the start of the game and might reflect your shot in a totally unexpected way. But they might also be perfect to hit your opponent from a different direction. Just be careful to keep an eye out or you will be the one who gets hit! Multiple game modes to keep things fresh You think you have mastered the game? Are you beating your friends in every match? Why not change it up by making the paddles smaller or speeding up the ball! You can have multiple balls, turn items on and off and even have the arena change at random. You can also choose between the two radically different modes of Score, where you try to get the most points before a timer runs out, and Survival, where you have a limited amount of lives. But don't worry if your friends are the ones who are always beating you: Even when you have lost all your lives, you will still be able to participate and make their lives harder with well timed items.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1822300/header.jpg?t=1657886277",
    "Price": 0.0,
    "Developers": "LabOne48",
    "Publishers": "LabOne48",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_4b6b9a629b07910860ed66264d45f4b81e2818f8.1920x1080.jpg?t=1657886277,https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_32ddce326c176306942817f068b0284d2fad5f9a.1920x1080.jpg?t=1657886277,https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_b47150863b8fc74f70cea286f1d36a283abe791e.1920x1080.jpg?t=1657886277,https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_7770d69b6682896432aa6a2113c4a5f565931e89.1920x1080.jpg?t=1657886277,https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_bcf7efa6c88ef5a3e9be82aa491f0ddf53ffc6e2.1920x1080.jpg?t=1657886277,https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_bf8f404ab1c5b6db93c1a8023d91030b806e2e1d.1920x1080.jpg?t=1657886277,https://cdn.akamai.steamstatic.com/steam/apps/1822300/ss_b7fa6cf8569beab1eedf22305524b0f55dc1b81b.1920x1080.jpg?t=1657886277",
    "Slug": "bounce-ball-neon-party-arcade",
    "Meta Title": "Bounce Ball: Neon Party Arcade: Feb 4, 2022, LabOne48 and...",
    "Meta Description": "Looking for information on Bounce Ball: Neon Party Arcade? Check out the release date (Feb 4, 2022), developer insights from LabOne48, and a complete ga...",
    "Alt Text Image": "Official header image for Bounce Ball: Neon Party Arcade game - Steam 1822300",
    "Canonical URL": "https://gusku.site/game/bounce-ball-neon-party-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bounce Ball: Neon Party Arcade\", \"description\": \"Looking for information on Bounce Ball: Neon Party Arcade? Check out the release date (Feb 4, 2022), developer insights from LabOne48, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LabOne48\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LabOne48\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1822300/header.jpg?t=1657886277\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}