{
    "AppID": 686100,
    "Name": "CanBoom VR",
    "Release date": "Aug 22, 2017",
    "About the game": "Dark space. Knock down all the cans for escape. But, don't be careless. If you break stages, you encounter more difficult obstacles and cans. Now, you start. And be boast your scores to your friends. Game Play This game is to knock down all the cans on shelves. Player knocks down all the cans on the shelves by the specialized gun. A gun and 20 balls as using bullets is provided basically to player. Game level will be raised as the player can't knock down the cans. For example, moving obstacles interrupt the bullets to cans. Player executes the game with the limited bullets and game is over if he finish all the stages. Game is mixed with shooting and puzzle. Game control 'Can Boom' is specialized game for HTC Vive. You can just play only using Vive controller. In addition, 1 controller is used only not 2. Menu choice : Trigger Shooting : Trigger Bullet menu activation : Grip button Bullet choice : R/L button of pad. Store system Accumulated score by getting game play can use at the store in this game. The way to raise score is to clear many stages or to get scores through many games. Selling items at store are many kinds of balls as bullets for shooting. Tennis ball(2000 points) : Hit the cans closely at small area. Soccer ball(6000 points) : Hit the cans roughly at wide area. Ice ball(20000 points) : Hit the cans makes ice explosion. Watermelon(30000 points) : Hit the cans makes watermelon explosion. Thorn ball(40000 points) : Most strong ball to explode. Blowfish(50000 points) : Hit the cans makes expansion. Purchased balls are change available at any time to push controller during games. Using suitable balls to save balls as bullets upon knocking down cans. Game instruction 1. Everybody enjoys with simple operation. * It's so simple game by shooting with gun in the screen. Player just pull the trigger after aiming. 2. You encounter bombing, elctricity, ice, bonus, death and transperant can. * Bonus can : Take more balls as using bullets. * Bombing, elctricity, ice can : If you hit them, near of cans will be knock down by explosion. * Death can : If you hit it, game is over. * Transparent can : If you hit it, near of cans will be changed to invisible. 3. You get more powerful balls with your accumulated scores. * You get certain scores after felling cans and more high scores as stages high. * Scores are accumulated as you play games more and you can get various of balls as using bullets in the store which located in main screen. * Tennis ball, soccer ball, ice ball, iron ball, blowfish, watermelon ball are displayed in the store. 4. You encounter various of obstacles as you play high stages. * Various obstacles of tree and iron is appeared for difficult aiming. * Pay attention to shoot for moving obstacles. 5. Ranking * You can put in scores after game.. * You can compete with your family and friends. 6. Search for hidden function * You can get other guns when you search carefully main screen. * Many instructions are appeared if you click the help can in main screen. 7. Caution * Never throw controller although you can't break stages. * Please paly game with taking line of controller on your wrist. * Pay attention to shoot because you start again form first stage after game over.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/686100/header.jpg?t=1503392800",
    "Price": 7.99,
    "Developers": "eiNpictures",
    "Publishers": "eiNpictures",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/686100/ss_97125bfb5347cff99888be5e88ca11c494457068.1920x1080.jpg?t=1503392800,https://cdn.akamai.steamstatic.com/steam/apps/686100/ss_54ff53a6fe40baac57f14531460ddd2835233553.1920x1080.jpg?t=1503392800,https://cdn.akamai.steamstatic.com/steam/apps/686100/ss_0cac801facb1efae504d17a81c0ada007185ad04.1920x1080.jpg?t=1503392800,https://cdn.akamai.steamstatic.com/steam/apps/686100/ss_2e516b4da035f1d2452178e0feb3b08320b0db15.1920x1080.jpg?t=1503392800,https://cdn.akamai.steamstatic.com/steam/apps/686100/ss_a10e51145d92a1ddba75445e172c9c3f939655f6.1920x1080.jpg?t=1503392800,https://cdn.akamai.steamstatic.com/steam/apps/686100/ss_dedb80494a82b0665bef16dea9740efd05a05b83.1920x1080.jpg?t=1503392800",
    "Slug": "canboom-vr",
    "Meta Title": "CanBoom VR: Aug 22, 2017, eiNpictures and Full Overview",
    "Meta Description": "Looking for information on CanBoom VR? Check out the release date (Aug 22, 2017), developer insights from eiNpictures, and a complete game summary.",
    "Alt Text Image": "Official header image for CanBoom VR game - Steam 686100",
    "Canonical URL": "https://gusku.site/game/canboom-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CanBoom VR\", \"description\": \"Looking for information on CanBoom VR? Check out the release date (Aug 22, 2017), developer insights from eiNpictures, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"eiNpictures\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"eiNpictures\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/686100/header.jpg?t=1503392800\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}