{
    "AppID": 613830,
    "Name": "CHRONO TRIGGER®",
    "Release date": "Feb 27, 2018",
    "About the game": "The timeless RPG classic returns loaded with upgrades! Journey to the forgotten past, to the far future, and to the end of time. A big adventure to save the planet, now begins… CHRONO TRIGGER is the timeless role-playing classic developed by the ‘Dream Team’ of DRAGON QUEST creator Yuji Horii, Dragon Ball creator Akira Toriyama, and the creators of FINAL FANTASY. As the story unfolds, embark on a journey to different eras: the present, the middle ages, the future, prehistory, and ancient times! Whether you're a first-time player or a longtime fan, this epic quest to save a planet's future promises hours of enthralling adventure! As the definitive version of CHRONO TRIGGER, not only have the controls been updated, the graphics and sound have also been revamped to make your adventure even more fun and enjoyable to play. To complete your journey, also included is the mysterious ‘Dimensional Vortex’ dungeon and the forgotten ‘Lost Sanctum’ dungeon. Meet the challenges presented to you and long-lost secrets may be revealed... Story: A chance encounter amid the festivities of Guardia's Millennial Fair in Leene Square introduces our young hero, Crono, to a girl by the name of Marle. Deciding to explore the fair together, the two soon find themselves at an exhibition of the Telepod, the latest invention by Crono's longtime friend Lucca. Marle, fearless and brimming with curiosity, volunteers to assist in a demonstration. An unanticipated malfunction, however, sends her hurtling through a rift in the dimensions. Taking hold of the girl's pendant, Crono bravely follows in pursuit. But the world into which he emerges is the one of four centuries before. Journey to the forgotten past, the distant future, and even to the very End of Time. The epic quest to save a planet's future makes history once again. KEY FEATURES: Active Time Battle Version 2 During battle, time will not stop, and you can enter commands when the character's gauge is full. The enemies' positions will change as time passes, so choose your actions based on any given situation. ‘Tech’ moves and combos During battle, you can unleash special ‘Tech’ moves, including abilities and/or magic and characters can combine these abilities to unleash all new combo attacks which are unique to them. There are over 50 different types of combos that you can execute between two and three characters! Experience the 'Dimensional Vortex' and the 'Lost Sanctum' dungeons The Dimensional Vortex: a mysterious, ever-changing dungeon existing outside of space and time. What wonders await you at its center? The Lost Sanctum: enigmatic gates in prehistoric and medieval times will lead you to these forgotten chambers. Meet the challenges presented to you and long-lost secrets may be revealed... Graphics and sound While keeping the atmosphere of the original, the graphics have been updated in higher resolution. As for the sound and music, under the supervision of composer Yasunori Mitsuda, all songs have been updated for an even more immersive gameplay experience. Comfortable controls Whether you play with a gamepad or a keyboard, the controls have been updated for a more pleasant gameplay experience. Autosave In addition to saving at a save point or choosing to quit from the menu, your progress is saved automatically while traversing the map.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/613830/header.jpg?t=1646911047",
    "Price": 14.99,
    "Developers": "Square Enix",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_b92c46019720da5518bf69492c1f646f9c67dc29.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_fe62096054041c5faf8f8d28b685bcc9bc5cdd77.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_0e2d9f93550aa58ec19e3163d120fa6fa4b88189.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_9f190f88109757e3212aa39ad6df16b57d6deb81.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_3f6ae8e53d1c0e779a863ef3a05c4f5cdafb95a8.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_ee66f177d4985e6ad41965090cb67c1586f31dda.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_2f06f5ac4b740f59c43ad0c9ce134d9a0a1d3762.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_07d70e01002895a8fff9f7221ca0169f2cef343d.1920x1080.jpg?t=1646911047,https://cdn.akamai.steamstatic.com/steam/apps/613830/ss_96e32d319c4a6e86e73c2c4dd77bd964480a44d4.1920x1080.jpg?t=1646911047",
    "Slug": "chrono-trigger",
    "Meta Title": "CHRONO TRIGGER®: Feb 27, 2018, Square Enix and Full Overview",
    "Meta Description": "Looking for information on CHRONO TRIGGER®? Check out the release date (Feb 27, 2018), developer insights from Square Enix, and a complete game summary.",
    "Alt Text Image": "Official header image for CHRONO TRIGGER® game - Steam 613830",
    "Canonical URL": "https://gusku.site/game/chrono-trigger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CHRONO TRIGGER\\u00ae\", \"description\": \"Looking for information on CHRONO TRIGGER\\u00ae? Check out the release date (Feb 27, 2018), developer insights from Square Enix, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/613830/header.jpg?t=1646911047\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}