{
    "AppID": 1680890,
    "Name": "Coldage",
    "Release date": "Jul 1, 2022",
    "About the game": "We are happy to announce that we have successfully completed our Kickstarter campaign on the 2nd of March. We are grateful to the people who backed Coldage and continue to support us throughout this journey. Start at the End of Human Civilization Let me tell you a story. It is in the far future after humans have peeked and vanished; after their cities and monuments have been reduced to ruins; their greatness disintegrated into oblivion. What remains is hunger, hopelessness, and an inferior continuation of the human race; the children of Terra. There are a lot of Children dispersed in this world, sheltered in their factions, separated from each other by their conviction and mistrust. Five Protectors in Service of Repentance Today, I'll tell you about one group of Children, the Protectors, five of them to be exact. They are departing from a Protector settlement named Repentance. Sent by their elders to find the truth about a rumor that would not die about a place of great technology and resources. The Refinery. These five are an odd band, not your classical heroes; in fact, there are not many heroes in this story.. Blackjack One of them, an old warrior, leads them through the ruins avoiding many dangers; his name is Blackjack. He was never not a warrior.. and it was all he would ever be. His violence is directed at everyone, friend or foe. He is kept in check by a very old woman, the only one he listens to. Elle The woman is too old by any measure to be on such a journey. But she is an elder in the settlement, and none dare to oppose her. Her name is used to scare small children into obedience. Skilled in medicine, alchemy and could see the future. Her name is Elle; no one ever remembered a time when she was not old. Rake Elle brought along with her an apprentice; he is a weird boy. No one would think of him as anyone's apprentice. He has no mind for healing; many would say he has no mind for anything. He was found as a toddler and grew very strong, trained as a soldier but could never follow orders. When he was about to be banished, Elle took him in. He was never named but referred to as Rake for his recklessness. Rake is unable to take life or suffering seriously, a constant trickster and joker. Jump scares or throwing rocks at sleepers. Simple humor never gets old to him. Rake has always been considered a freak in his settlement by his suspiciously bigger physique..... the only one who found a kindred spirit in him is Adana. Adana Adana is a young, innovative, and lithe warrior. Many regard her as a great future leader, as she cares about the wellbeing and survival of everyone. She dreams of a better future where all the Protectors are united in one settlement, where she doesn't have to run for her life anymore. Trained by the best, she is a warrior to be reckoned with. Sophronius Last among them is a nobleman's son that had fallen from his high station; he is a scholar and a tinkerer of the Ancients' technology, the human technology. He believes that the Ancients' technology is the solution to all their problems. His name is Sophronius, a sensible man who can't fend for himself. However, he could be the key to finding the way. Discover the Rest of the Story Now, you know the story of our non-heroes, their origin, and their destination. How their story unfolds through the ruins is in your hands to shape. Their fate on this mission depends on your choices and how you play the game. It is time now for you to continue the narrative.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1680890/header.jpg?t=1657044668",
    "Price": 13.99,
    "Developers": "Roosterlandia",
    "Publishers": "Roosterlandia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1680890/ss_03a107291288d25908ef9e51aceb03632dec169e.1920x1080.jpg?t=1657044668,https://cdn.akamai.steamstatic.com/steam/apps/1680890/ss_bd6f403a17cdc60b074977e7df566605d2a47287.1920x1080.jpg?t=1657044668,https://cdn.akamai.steamstatic.com/steam/apps/1680890/ss_f2a41aa50a12d810ba4a96f7214ccc5b5579a2d1.1920x1080.jpg?t=1657044668,https://cdn.akamai.steamstatic.com/steam/apps/1680890/ss_3b4f955dbb7ae4c471e7850426f60865d93ec58d.1920x1080.jpg?t=1657044668,https://cdn.akamai.steamstatic.com/steam/apps/1680890/ss_a1e7d59a71e1c40ba698005bdbdb0e061db73425.1920x1080.jpg?t=1657044668,https://cdn.akamai.steamstatic.com/steam/apps/1680890/ss_19a762d0b233172b1b80ff0ff679df3cbbfa05a3.1920x1080.jpg?t=1657044668",
    "Slug": "coldage",
    "Meta Title": "Coldage: Jul 1, 2022, Roosterlandia and Full Overview",
    "Meta Description": "Looking for information on Coldage? Check out the release date (Jul 1, 2022), developer insights from Roosterlandia, and a complete game summary.",
    "Alt Text Image": "Official header image for Coldage game - Steam 1680890",
    "Canonical URL": "https://gusku.site/game/coldage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Coldage\", \"description\": \"Looking for information on Coldage? Check out the release date (Jul 1, 2022), developer insights from Roosterlandia, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Roosterlandia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Roosterlandia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1680890/header.jpg?t=1657044668\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}