{
    "AppID": 1377680,
    "Name": "CROSSFIRE II (2002)",
    "Release date": "Aug 27, 2020",
    "About the game": "Crossfire II is an Retro / Arcade/ Top-Down Shooter, originally released in 2002 for Amiga and was our first commercial game. We still love it and decided to convert, update and release it on PC now. We hope, you also can still enjoy the game as we do. SINGLEPLAYER CAMPAIGN CFII offers three different game modes. The most important one is the story mode. In this story you play the role of Karsten, a young rebel pilot. You have to play through a number of missions that couldn't be more manifold. Space battles alone or as part of a fleet, espionage and escort missions or hidden operations behind the enemy lines - no mission is like the other and even who's friend and who's the enemy is not always clear. Between and during the missions the story is told, important events are illustrated by short films. The large number of different ships suits to this qualities. Fast fighters, heavy bombers and large capital ships with independent turrets atop battle each other in space or at the planet's surface. Somewhere inbetween transports try to get cover and stationary turrets defend important places. Here is where you can experience what it feels like being in a slow transport amidst a large battle. One time you will even drive a tank. MULTIPLAYER If you have some additional players at hand or if you just want to let the weapons speak unladen by a story and mission aims, the other two game modes of Crossfire II are for you. The survival mode offers entertaining battles to one to four players against hordes of computer controlled enemies. Although teamwork is top priority here the one dealing most damage will win the round. This offers room for plenty of dirty tricks. Some friendships already broke on 'He shot the shield item right before my nose!' The third game mode is the classic dogfight mode. Two to four ships enter the arena and the last player alive is the winner. An unbelievable range of weapons, items and hazards like gravitonic mines, asteroids, black holes and much more make sure the game won't get boring for many hours. In addition nearly any aspect of the gameplay of both modes can be configured. The frequency and kind of items, the preferences for the weapon shop or the number and intelligence of the enemies - everythings adjustable. In Crossfire II nobody has to live with something he doesn't like. AMIGA REVIEWS AMIGA Arena 'I can just recommend Crossfire II to all friend of shooter games.' Amiga Future 'Equal what you think of shooter games, Dreamworlds have done a good job and deserve respect for this game.' AMIGA Plus 'At first the simple installation was noticed positive... crashes were also non-existent. Larger field for criticism can't really be found... Crossfire II, although technically only average, offers a great deal of fun to single and multiplayer gamers. If you always wanted to play a entertaining mix of Super Cars and Wing Commander, you should go for Crossfire II.'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1377680/header.jpg?t=1602680932",
    "Price": 3.99,
    "Developers": "Dreamworlds",
    "Publishers": "1999UEM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_b0cbe757ca26d9e3680b09766e4999fa8c512e66.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_07ff864108a50be69fbe74a29ed10b6e4d6c2bde.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_bea31fc67936672fb379942f9771bb89cb2ed87e.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_2267b7db3245b9857249c7e84746159028663d63.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_510872076f564fb28d349809e8aa8d9640cfc8a4.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_49f5ee55b1e62f81f1a4328b487923a9c932a72a.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_0490bca8f7ba3c46fb26a4039b772d1bef477410.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_03e39e0056b21a996c7fe805a40e303249546e9b.1920x1080.jpg?t=1602680932,https://cdn.akamai.steamstatic.com/steam/apps/1377680/ss_229f17cc1d6326c73851f4f74496709b36b461ec.1920x1080.jpg?t=1602680932",
    "Slug": "crossfire-ii-2002",
    "Meta Title": "CROSSFIRE II (2002): Aug 27, 2020, Dreamworlds and Full O...",
    "Meta Description": "Looking for information on CROSSFIRE II (2002)? Check out the release date (Aug 27, 2020), developer insights from Dreamworlds, and a complete game summ...",
    "Alt Text Image": "Official header image for CROSSFIRE II (2002) game - Steam 1377680",
    "Canonical URL": "https://gusku.site/game/crossfire-ii-2002",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CROSSFIRE II (2002)\", \"description\": \"Looking for information on CROSSFIRE II (2002)? Check out the release date (Aug 27, 2020), developer insights from Dreamworlds, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dreamworlds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"1999UEM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1377680/header.jpg?t=1602680932\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}