{
    "AppID": 679580,
    "Name": "CyberLink AudioDirector 8 Ultra",
    "Release date": "Oct 31, 2017",
    "About the game": "Audio Editing for Video Projects Audio is half of the movie experience, and improving the audio in video projects dramatically enhances the final result. AudioDirector contains cutting-edge tools that make editing and fixing audio tracks fast and simple. With end-to-end audio features and seamless integration with PowerDirector, AudioDirector is a must-have application for extreme video makers. Round-trip Editing UNIQUE AudioDirector works flawlessly with PowerDirector, providing effortless round-trip editing. With round-trip editing there is no need to export your modified sound tracks and then re-import them your into your video project. 360º Video Support NEW AudioDirector lets you import 360º videos for audio editing1. With round-trip editing, you can send your finished work back to PowerDirector to apply some final touches and produce your masterpiece! Codec Preview NEW Preview the final result and any artifacts from lossy encoding before you produce so you can make smart processing decisions and create better sounding audio tracks. Precision A/V Syncing Visual editing tool lets you accurately synchronize voice-overs or audio effects to specific video frames, while automated dialogue replacement helps you to seamlessly align post-recorded audio to your video. 4K Video Rendering Add high-quality audio to your Ultra HD resolution videos with support for both 2K and Ultra HD 4K video production. Faster Loading &amp; Conversion AudioDirector lets you get to work quicker with less resource instensive loading and importing. Once you're done, outputting your work to whatever format you choose is a breeze, even if you have to convert the original file to a new format. Virtual Surround Sound Ambience Creator NEW Instantly generate ambient noise for soundless clips so that they blend seamlessly with neighboring footage. Total Output Control Enjoy precise control over speaker output, including setting timed repeats of established sound pans. Upto 7.1 Channel Audio Produce your audio files with support for upto 7.1 channel audio, bit rates upto 192kHz and 32-bit depth for clarity and fidelity. Surround Sound Panner Create sophisticated surround sound projects using dynamic panning technology. Add Creative Audio Effects Auto-Fit Background Music NEW Automatically adjust backing music tracks to fit the length of your video. Pitch Bender Set keyframe points and accurately transform the pitch of audio tracks to give your recordings the exact effect you're after. Vocal Transformer Vocal Transformer lets you alter existing vocals into the voice personality of your choice. Choose from five existing presets or create your own. Stereo Expander Use new Stereo Expander to virtually give tracks a wider stereo presence and sound fuller. Remove Clicks, Hums &amp; Noise Restoration Adjustment Tools NEW Visual Repair Choose between waveform and frequency spectrum visual interfaces, which highlights audio imperfections and allows you to fix them using Visual Repair. Noise Profile Presets Once you have successfully repaired audio using hum or hiss removal, you can save the repair function settings as a preset for future use on other audio tracks. Multitrack Mixing Group Track Selection for Adjustments Speed up the editing process by selecting and applying audio adjustments to multiple tracks with just a click. Multi-channel Device Recording NEW Record from multiple audio channels at the same time directly into AudioDirector. You don't need to spend time syncing channels, so you can start editing right away. Group Track Selection for Adjustments Speed up the editing process by selecting and applying audio adjustments to multiple tracks with just a click. 99 Tracks with Icon Track Control Convenient control buttons on each individual audio track—up to 99 tracks—for full control at your fingertips. Select a track icon, mute, record, add volume keyframes and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/679580/header.jpg?t=1568766505",
    "Price": 0.0,
    "Developers": "CyberLink",
    "Publishers": "Koch Media,CyberLink",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/679580/ss_273c22cde08c4325e506fc83486e86a8c074128e.1920x1080.jpg?t=1568766505,https://cdn.akamai.steamstatic.com/steam/apps/679580/ss_67a1dc0cf9112e1837662a2aec86f1d63ce637e1.1920x1080.jpg?t=1568766505,https://cdn.akamai.steamstatic.com/steam/apps/679580/ss_263d4a31a1b2b56294b96060380daced3e9f0cae.1920x1080.jpg?t=1568766505,https://cdn.akamai.steamstatic.com/steam/apps/679580/ss_23d390ff802a04836d727be4501f1a8ce8f488a8.1920x1080.jpg?t=1568766505,https://cdn.akamai.steamstatic.com/steam/apps/679580/ss_697cb418014a00e8d945014ec661bce82d0e3045.1920x1080.jpg?t=1568766505",
    "Slug": "cyberlink-audiodirector-8-ultra",
    "Meta Title": "CyberLink AudioDirector 8 Ultra: Oct 31, 2017, CyberLink ...",
    "Meta Description": "Looking for information on CyberLink AudioDirector 8 Ultra? Check out the release date (Oct 31, 2017), developer insights from CyberLink, and a complete...",
    "Alt Text Image": "Official header image for CyberLink AudioDirector 8 Ultra game - Steam 679580",
    "Canonical URL": "https://gusku.site/game/cyberlink-audiodirector-8-ultra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink AudioDirector 8 Ultra\", \"description\": \"Looking for information on CyberLink AudioDirector 8 Ultra? Check out the release date (Oct 31, 2017), developer insights from CyberLink, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Koch Media,CyberLink\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/679580/header.jpg?t=1568766505\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}