{
    "AppID": 1496150,
    "Name": "Fury Fight",
    "Release date": "Apr 13, 2022",
    "About the game": "This is an action arcade game with hand feeling and retro action. By running three different characters, we constantly defeat the assassins who are going to kill them, solve the mystery and save the city.And from the three protagonists different plot, pieced together the whole story of the whole picture. Inspiration comes from 'Captain Commando' and 'Cadillacs and Dinosaurs'. We have learned and learned from some of the mechanisms, so that the fighting in fury fight can restore the sense of operation of the arcade in the 1990s as much as possible, hoping to awaken the happiness brought by the arcade to the players in that year. Smooth cool arcade experience, real clean fighting. To salute the classic era of remembrance, let's have a simple and direct experience of happiness. Exciting Boss confrontation,electro optic flint style competition. Each Boss has distinct features (or teases). More powerful, very stunting, assault or evading? Let's do some extreme operations! Two players work together, brothers, my back to you! Do you still remember the joy of playing with your brothers in the arcade hall? Here it is. Help your teammates out of the danger, or rob your teammates's meat? There are many difficulties to choose from You can trigger a dialogue with the enemy in the level to explore different branch plots A game gallery that can be unlocked Endless universe, endless conflict It's a story of searching, all your life, no matter the cost; It's a story of guardianship, across time and space, be black and blue; It's a story about justice, hot-blooded boy, advance bravely; It's also a story of love and evil, crime and punishment, spirit and flesh. Three heroes together in strange fate, conspiracy, crisis, they can escapes? A void planet hanging high above the sky, A glitzy, bustling city, Bloodthirsty strange laughter in the dark tunnel, Mysterious beautiful female doctor in the base, Desert over the sea in the morning sun...The dead are like rivers, Everything is not yet start, everything is over. And the man, all over the universe, exhausted blue void, what kind of answer will fate give when his thoughts and desires will be within reach? Hawk Eye Angry hair curling dark cloud, Power fist smash titanium gold. Hawk Eye is a sheriff with a sense of justice and a strong Indian fighter. In order to find his missing sister, he followed the clues to the city. His attack is full of strength and has many powerful throwing skills. Because of his special lineage, his block can invalidate most of the enemy's attacks. --------------------------------------------------------------------------------------------- Arado Moving instant as flash boom, running valiant over meteor stream. Arado is a sports star in school, pure and hot. Soon after being transferred to school, he was involved in the incident because he was too conspicuous to be picked up by the captain of the school basketball team. His athletic ability makes him very flexible, dodging and two jumps to allow him to swim between enemies. He can also use dazzle cool skills to vertigo around the enemy. --------------------------------------------------------------------------------------------- Red Sheep Phantom gone with high gale, crack surely will banish the evil. Red sheep is not her real name, but a code name. Her identity and past are mysteries. She may be a secret agent, but no one knows her goal. She has superb fighting skills and can perform complex attacks. By starting overclocking, she can get beyond the limit of terrible power in a short time. We are very clear that the visual performance of Fury Fight is very rough at this stage, which is why we have not launched the game. But with the encouragement of enthusiastic players, we finally decided to launch this game. To this end, we will set a low and reasonable price to make every player buy value for money. And we promise, with Grandpa's name, that we will put all our income into the improvement of game and the development of new content. Please wait and see. Love classic games, but we are not old-fashioned. Keen to develop games, but we do not fish for fame. We have a small team and limited funds, but these do not affect our seriousness, persistence and modesty. Thank you for seeing this page. We sincerely look forward to hearing from you. Please contract us in steam. Our ideal is to develop the game you want! Contact us in E-mail： admin@ml.yxjhtech.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1496150/header.jpg?t=1652150144",
    "Price": 12.99,
    "Developers": "YoXia Game Studio",
    "Publishers": "YoXia Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1496150/ss_9cac27b180661009722655c627777da252bd4e22.1920x1080.jpg?t=1652150144,https://cdn.akamai.steamstatic.com/steam/apps/1496150/ss_f402d1eb57338124bf93339fba9a97de332cda20.1920x1080.jpg?t=1652150144,https://cdn.akamai.steamstatic.com/steam/apps/1496150/ss_15f177bed7476fe7b81ec7b0940fd0579cdcc271.1920x1080.jpg?t=1652150144,https://cdn.akamai.steamstatic.com/steam/apps/1496150/ss_d2d2b4143eab4320bbd728528d185875d8852d3f.1920x1080.jpg?t=1652150144,https://cdn.akamai.steamstatic.com/steam/apps/1496150/ss_ea6828872e59e391fe2a72fa3b5a16e47160d013.1920x1080.jpg?t=1652150144,https://cdn.akamai.steamstatic.com/steam/apps/1496150/ss_d5a767e15fbcb5acd78f94b8ca67dfa59aa9373c.1920x1080.jpg?t=1652150144",
    "Slug": "fury-fight",
    "Meta Title": "Fury Fight: Apr 13, 2022, YoXia Game Studio and Full Over...",
    "Meta Description": "Looking for information on Fury Fight? Check out the release date (Apr 13, 2022), developer insights from YoXia Game Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Fury Fight game - Steam 1496150",
    "Canonical URL": "https://gusku.site/game/fury-fight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fury Fight\", \"description\": \"Looking for information on Fury Fight? Check out the release date (Apr 13, 2022), developer insights from YoXia Game Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"YoXia Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YoXia Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1496150/header.jpg?t=1652150144\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}