{
    "AppID": 1056650,
    "Name": "Haunted Jail: Alcatas",
    "Release date": "Apr 19, 2019",
    "About the game": "Haunted Jail: Alcatas is a 2D Survival Horror Game based on the paranormal events of the oldest and the most haunted prison in Alcatas, witnessed by those who set foot inside the place. Alcatas island is famous for the dark history associated with the most haunted prison in Alcatas. The prison was built in 1859 initially as the U.S. Military defense and then as long-term military prison during 1868. Long before the prison was even built on the land, there was a rumor going around that the land was haunted. The place had an unpleasant feeling from the very beginning as the earliest inhabitants of the land were the Native Americans. Fast forward to the early 1940s, it was reported that there were some prisoners who were shot to death by jail guards, some of them were punished inside a punishment chamber by various means including the beatings, electric shock treatment etc. It had resulted in deaths of some of the prisoners and their spirits were trapped inside the prison. Now, the majority of the jail is closed due to various reasons except the A-Block. No prisoners are kept in B, C and D-Block due to many reports of the paranormal events. It is reported that sounds of cell door slamming, voices, gunshots, scream etc. can still be heard to this day. Anyone who enters the building has some sort of unexplained paranormal experiences even though the people at the Alcatas main office located in the west of Alcatas Island are in denial about the paranormal. At present, only two jail guards are recruited to maintain the tight security of the prison. No one usually visits the punishment chamber due to lots of tragedy, pain, suffering which are associated with it. You play as one of the jail guards whose mission is to secure the building. It is easier said than done because you never know what else is waiting for you in the Haunted Prison. Key Features: Explore the Haunted Prison and experience the paranormal. Face your fears while you are exploring the creepy corridors and secret rooms. Explore the Spirit world. Lots of spirits and demons lurking in the shadows. Nearly Half an hour duration of Paranormal Investigation. Note: I am a solo indie game developer and I have done all of the graphics, artwork, animation, level design, and programming except for the music. I hope you will enjoy the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1056650/header.jpg?t=1613573353",
    "Price": 0.54,
    "Developers": "Anamik Majumdar",
    "Publishers": "Anamik Majumdar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1056650/ss_f21e40266bed627dfbcafb111f97af97b4883417.1920x1080.jpg?t=1613573353,https://cdn.akamai.steamstatic.com/steam/apps/1056650/ss_eae9c6b8eb09aa92797c340b6e99b27be79cad3f.1920x1080.jpg?t=1613573353,https://cdn.akamai.steamstatic.com/steam/apps/1056650/ss_9d1f204c7abcc523a5e0b2bdd48e4933a45fdec6.1920x1080.jpg?t=1613573353,https://cdn.akamai.steamstatic.com/steam/apps/1056650/ss_176ce01cd12c2746ae6dc93d238cf71c0c10dc16.1920x1080.jpg?t=1613573353,https://cdn.akamai.steamstatic.com/steam/apps/1056650/ss_16c0c3171dd445ead2e2c659f1c6739994c38e22.1920x1080.jpg?t=1613573353,https://cdn.akamai.steamstatic.com/steam/apps/1056650/ss_2ccc207ad8b45893fede166a7445f704badf78f0.1920x1080.jpg?t=1613573353",
    "Slug": "haunted-jail-alcatas",
    "Meta Title": "Haunted Jail: Alcatas: Apr 19, 2019, Anamik Majumdar and ...",
    "Meta Description": "Looking for information on Haunted Jail: Alcatas? Check out the release date (Apr 19, 2019), developer insights from Anamik Majumdar, and a complete gam...",
    "Alt Text Image": "Official header image for Haunted Jail: Alcatas game - Steam 1056650",
    "Canonical URL": "https://gusku.site/game/haunted-jail-alcatas",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Haunted Jail: Alcatas\", \"description\": \"Looking for information on Haunted Jail: Alcatas? Check out the release date (Apr 19, 2019), developer insights from Anamik Majumdar, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anamik Majumdar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Anamik Majumdar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1056650/header.jpg?t=1613573353\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.54, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}