{
    "AppID": 1576130,
    "Name": "IdolDays",
    "Release date": "Aug 5, 2021",
    "About the game": "※All characters involved in sexual content are over the age of 18. About A love-adventure game where you can enjoy the heart-pounding roommate life of a rookie producer and a delinquent girl turned idol. The 'E-mote' engine that can move illustrations smoothly and three-dimensionally is used for standing pictures in the game. The characters displayed on the screen move as if they were alive. STORY A young man working at an Akihabara-based agency that manages underground idol groups has been ordered to discover new idols by his boss. Now, he's at the end of his rope. The protagonist is at a loss, finding that girls with the talent to become the kind of idol he's picturing are few and far between. He's sitting defeated on a park bench when he comes across a girl singing to herself while feeding some cats. The girl's song is delicate, but her voice shakes him to the core. His heart stolen in an instant, the protagonist turns to the girl and tries to scout her to become an idol. However, the girl flatly refuses him, saying the idea is stupid, only to then disappear. The next day, the protagonist gets called into the office, where he learns that the daughter of their sponsor has been hired as a member of staff and gets assigned to be her training supervisor. The girl who appears before the bewildered young man is the same one who turned down his scouting offer the day before. The girl's name is Tsubaki Akanesaki. Though she's had several jobs, she got fired from all of them for getting into fights. What does fate have in store for a young man who's been assigned to train a girl whose a total delinquent?! CHARACTER Tsubaki Akanesaki CV:Mashiro kazahana A delinquent girl who's as strong as any man. She may be a delinquent, but her strong sense of justice means she never bullies the weak or gets involved in crime. Even so, the way she looks and talks often causes people to misjudge her. Lacking any dreams or ambition, she spends her life wandering aimlessly from day to day. She secretly feels jealous when she sees people going after their dreams or being passionate about something, leading her to search for something that she can also devote herself to. She's the granddaughter of a high-profile figure in the entertainment industry, and when a senior producer is asked to offer her a position, he half forces the job of looking after her on the protagonist. Not having even a place to live, she somehow ends up living under the same roof as the protagonist. While on the job, she slowly starts getting interested in idols after seeing them shine on stage. But... Feature ・Smooth character animation via the E-mote system ・Different routes and ED ・High quality event CG ・Story set in an actual Japanese town STAFF ・Illustration :Atsuto Shinozuka ・Scenario :Linkedbrain Inc. ・Producer/Planner :Yujiro Usuda",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1576130/header.jpg?t=1628186463",
    "Price": 12.99,
    "Developers": "iMel,qureate",
    "Publishers": "qureate",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_052737e192a6900539b02d1c0ca74291f029aebf.1920x1080.jpg?t=1628186463,https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_c012781c07b808a1b3151a24f817da6a51fe8ce2.1920x1080.jpg?t=1628186463,https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_bd4f60624f4586b515ef24fe14ad93f9c066f276.1920x1080.jpg?t=1628186463,https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_a87d5a8e63d3105aedebb36546b3a0594ed3fe6a.1920x1080.jpg?t=1628186463,https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_60ce0851cc29cb263d5237a4bb5a5a4a763226aa.1920x1080.jpg?t=1628186463,https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_d21733fb60dd930a2f919bc0db41c542e4e0de1f.1920x1080.jpg?t=1628186463,https://cdn.akamai.steamstatic.com/steam/apps/1576130/ss_5cdf42c14aaef7f63e21fcd3bf7a62c9481fb687.1920x1080.jpg?t=1628186463",
    "Slug": "idoldays",
    "Meta Title": "IdolDays: Aug 5, 2021, iMel,qureate and Full Overview",
    "Meta Description": "Looking for information on IdolDays? Check out the release date (Aug 5, 2021), developer insights from iMel,qureate, and a complete game summary.",
    "Alt Text Image": "Official header image for IdolDays game - Steam 1576130",
    "Canonical URL": "https://gusku.site/game/idoldays",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"IdolDays\", \"description\": \"Looking for information on IdolDays? Check out the release date (Aug 5, 2021), developer insights from iMel,qureate, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"iMel,qureate\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"qureate\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1576130/header.jpg?t=1628186463\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}