{
    "AppID": 1109880,
    "Name": "Just Random Squares",
    "Release date": "Aug 23, 2019",
    "About the game": "In this game you will control square unit to defeat 100 waves of square enemies and achieve highest score you can. WHAT ? It is a simple arcade bullet hell action game. It may be frustrating, sometimes even unfair. It is definitely something that you can play for 20 minutes, quit, and then come back one hour later. It is NOT an epic open world experience with photorealistic graphics and rich story. There is no open world, no story, and definitely no photorealistic graphics FEATURE SUMMARY Multiple game modes with ability to create custom one by adjusting available parameters Progression system - over 25 permanent perks along with quick level ups during the run 5 types of player units, each with different stats and skills 7 different weapons to be used by player unit, each with different shooting pattern (such as shotgun or railgun) 100 randomly generated waves to beat - each playthrough is unique unless the same rng seed is used 4 bosses with multiple phases and patterns 5 types of enemies, each with different stats, skills and 5 tiers of power Over 10 types of weapons to be used by enemies Over 25 kinds of enemy behavior which decide how enemy move and use it's weapons Achievements, local leaderboards, adjustable settings GAMEPLAY You start the game by picking one of few pre-defined game modes . Each one differs in difficulty and may enforce other rules , such as increased currency income. There is also custom game mode which can be used to adjust all available properties to your liking. Next you are taken to loadout, which is used to make preparations for the next run. There you choose unit - weapon combination from the list of currently available ones. This unit will be used for your next run. After that you can spend currency earned during the previous runs to buy consumables which boost your next run only, and upgrade perks which are permanent improvements. After all preparations are finished, you start the actual game. During the run you beat wave after wave by defeating enemies and achieving scores which depend on amount of enemies defeated and amount of damage taken during the wave. Defeated enemies drop power ups : healing, energy and currency. Healing restores your unit's health points. Energy is used to level up your unit's stats (which are not permanent, once you are defeated they are gone!) or use skills . Each unit has 3 different skills which should be used strategically to survive as long as possible. Currency collected persists through defeat and is used in loadout. Eventually you get defeated or actually win the game by beating final boss. In case of defeat you are sent back to loadout where you prepare and start next run. When you win, well, you win - you can save your achieved score and test your skills in new playthrough on a higher difficulty level.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1109880/header.jpg?t=1571159131",
    "Price": 6.99,
    "Developers": "PN",
    "Publishers": "PN",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1109880/ss_983a1b1977d82ca0dce2063047b9e6972d11eb1d.1920x1080.jpg?t=1571159131,https://cdn.akamai.steamstatic.com/steam/apps/1109880/ss_9b835c9db37601409d1cce957e5ae1330c837854.1920x1080.jpg?t=1571159131,https://cdn.akamai.steamstatic.com/steam/apps/1109880/ss_6de5f761ef015426ef2b3729eb45815519409267.1920x1080.jpg?t=1571159131,https://cdn.akamai.steamstatic.com/steam/apps/1109880/ss_01d8518ba68032f4be6b89b6e59aab5ef5e9a4ca.1920x1080.jpg?t=1571159131,https://cdn.akamai.steamstatic.com/steam/apps/1109880/ss_d3f652bc59098148153a205522dfa2b0c85c4874.1920x1080.jpg?t=1571159131,https://cdn.akamai.steamstatic.com/steam/apps/1109880/ss_23d85eb62ce84107a290c51746c9fc0f7e9fb623.1920x1080.jpg?t=1571159131",
    "Slug": "just-random-squares",
    "Meta Title": "Just Random Squares: Aug 23, 2019, PN and Full Overview",
    "Meta Description": "Looking for information on Just Random Squares? Check out the release date (Aug 23, 2019), developer insights from PN, and a complete game summary.",
    "Alt Text Image": "Official header image for Just Random Squares game - Steam 1109880",
    "Canonical URL": "https://gusku.site/game/just-random-squares",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Just Random Squares\", \"description\": \"Looking for information on Just Random Squares? Check out the release date (Aug 23, 2019), developer insights from PN, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"PN\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PN\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1109880/header.jpg?t=1571159131\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}