{
    "AppID": 1725860,
    "Name": "Keng's Little Universe",
    "Release date": "Jan 13, 2022",
    "About the game": "This is a game that simulates the survival, development and exploration of civilization in the game. The game is divided into three parts. Part one, sky of chaos. Simulated civilizations exist in a three body to nine stars system. The player controlled civilization on a planet, the operation of multiple stars and the change of gravity will cause high or low temperature, leading to the demise of civilization. Civilization needs to develop from ancient civilization to cosmic civilization to win. Civilization perishes on the planet, and the next civilization can only be born in a suitable environment for a certain period of time. And if the planet dies, the game will end. The reasons for the demise of planets are: being swallowed by stars, alien attacks, environmental demise, etc. The game is divided into eternal era and chaotic era. The longer the eternal era, the faster the development speed, and the opposite is true for chaotic era. The eternal era is determined according to the change of the average temperature of the planet. The temperature must be within the appropriate range and change little. Civilization can only be produced when a planet is captured by a sun. If the operation of the sun causes too much change in gravity, the planet will be thrown out and enter a wandering state. Players can choose a different number of stars at the beginning, 3-9. You can also choose random or the same stellar mass. Civilization will launch some events at random: In ancient times and industrial times, a certain era has the opportunity to launch war and produce scientific and technological explosion, but war may also bring plague and lead to scientific and technological retrogression. In ancient times, prophecy events can also be generated. The prophet will provide players with different prophecies, and players can choose. In the information age, civilization can choose to develop nuclear technology or the prophet program. Nuclear technology can accelerate the development of civilization, but it may also lead to nuclear war, which will perish or survive. The next civilization after extinction will mutate. The development speed of mutated civilization is very slow, but the resistance is very high. The prophet plan is to launch the prophet satellite, which can improve the speed of refuge after completion, but it is also possible to send a broadcast to outer space, exposing the coordinates of our own star system and causing a blow to alien civilization. Some events will happen randomly. Of course, players can launch them themselves, but they need to meet certain conditions. Part two, galaxy of slaughter. Simulate a large number of civilizations fighting in the galaxy, and finally only one civilization can win. The civilization controlled by players needs to develop and expand in a galaxy, and will face the great threat of other civilizations at the same time. Civilization can choose war, expansion, scientific research and other actions. After each civilization upgrade, players can add technology points and focus on different development. In addition to occupying each other's planets, civilizations can also directly destroy star systems with Nova bombs. Civilizations can form alliances. The closer the civilization level is, the easier it is to form alliances. Wars in galaxies may also lead to great disasters such as Galaxy pulses. The third part, twilight of gods. Simulate god civilization and explore the ultimate mystery in the universe. Players control a spaceship of divine civilization, navigate in the vast universe, encounter various cosmic events, conduct cosmic level experiments, and explore the ultimate mystery of the universe. The third part is still in the development process, and the game content is not much.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1725860/header.jpg?t=1647572608",
    "Price": 3.99,
    "Developers": "Keng7",
    "Publishers": "Keng7",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_181b2a4769b3072946dd55f5ce5de956ad0989cb.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_bf0ad67810f79e2cdd8c9e1837201736301849fd.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_fb426e7adeb0cae0495fa3b0b807cb30923626f6.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_3f84134be222a4ec2537edaa9dd04ea3d4e884a1.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_071fd1dbe6e99d4244ebf7c2bfbd4eb71e593378.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_9803a8258866c98e895dc5ecd2f3f53024a3e815.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_92885b7bda4f3aaf6d5e4a1f0b30f598b87a154b.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_8b710d0c94d77a73bc89947384d21000df1cb20d.1920x1080.jpg?t=1647572608,https://cdn.akamai.steamstatic.com/steam/apps/1725860/ss_cab492a04794e09f7f8732525c83f04efef1f79a.1920x1080.jpg?t=1647572608",
    "Slug": "keng-s-little-universe",
    "Meta Title": "Keng's Little Universe: Jan 13, 2022, Keng7 and Full Over...",
    "Meta Description": "Looking for information on Keng's Little Universe? Check out the release date (Jan 13, 2022), developer insights from Keng7, and a complete game summary.",
    "Alt Text Image": "Official header image for Keng's Little Universe game - Steam 1725860",
    "Canonical URL": "https://gusku.site/game/keng-s-little-universe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Keng's Little Universe\", \"description\": \"Looking for information on Keng's Little Universe? Check out the release date (Jan 13, 2022), developer insights from Keng7, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Keng7\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Keng7\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1725860/header.jpg?t=1647572608\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}