{
    "AppID": 650740,
    "Name": "Leap of Champions",
    "Release date": "Feb 2, 2020",
    "About the game": "Game Description Leap of Champions is a competitive sci-fi FPS multiplayer game, with a solid background which it will be explored in a single player campaign. LOC strongpoints are a fluid gameplay and solid graphics effects powered by Unreal Engine. Leap Of Champion is able to work well even on outdated machines. The game is setting in a futuristic version of our universe and Klepsydria is what we will be calling home. It is the name of the eternal city out of time and space that hides and protect powerful elder artefacts able to control the Flow of Time while the ancient order of Champions, The Order of Klepsydria watch over them. Title: Leap of Champions Game Mode: Competitive and cooperative multiplayer online; single player story mode; multiplayer simulation with bots Genre: First person shooter Players: From 1 to 32 per Game (max 8 bots available per team) Technology: Unreal engine 4 Platform: Pc Mods: deathmatch – team deathmatch - dominion - capture the flag Setting: Sci-Fi universe Target: players 13+ Expected rating: teen [ESRB] Language: English The Settings Thousand of centuries ago (or maybe in the future, cause time is meaningless in Klepsydria) some members of the Order questioned the sacred laws of the city by invoking the right of changing the Flow of Time if absolutely necessary to preserve life in the universe. As the tension arose, the Order has split in two factions: The stoic Alphas, and the rebels Omegas. The Omegas are considered by Alphas a sort of anarchic time’s manipulators that follow their own egoistic purposes while the Omegas see the Alphas as cold dictators without any kind of conscience. The consequent and unavoidable war is still in place, and his resolution could change the entire universe. CHOOSE A FACTION AND START FIGHTING. SINGLE PLAYER CAMPAIGN (Now Available) The Single Player Story Mode focuses on the story of Mehens, once human and now one of the fearsome Champions of Klepsydria. His goal is becoming one of the members of the High Council of Champions, but to be admitted, he must prove his valor in battle leading his team to victory. During a difficult fight, Mehens had a strange vision of his old life as human, and in particular, some anguishing memories of his beloved wife Apopi, that makes him reconsider his life choices. But the fights keep coming and the Eternal Conflict seems evolving in directions that the Champion could have never expected. WEAPONS AND TACTICS THE POWER OF CHAMPIONS All Champions have incredible skills: they have access to advanced technology as well as arcane ancient knowledge, both at the same time advanced and unattainable for anyone in the universe. Since they cannot be killed, Champions have forgotten the fear for death. Finally, Champions have the ultimate power: the Leap. Thanks to the this incredible skill, all Champions can reach any place, in time and space and doing so, they are even able to escape death. WEAPONS Assault rifle (1.0) Standard medium-long range rifle, used by the Champions of the assault team. It ease aiming in mobility and it’s suitable for fast-paced frantic conflicts when you need high speed and precision. It is forged with metals from distant galaxies originated in the cold shade of dead stars. It allows you to fire bursts without overheating the barrel. The bullets used to fire are made from the same alloy of the armor of Champions, so they can easily pierce their defences. Info: Automatic 34 damage per bullet 30 cartridges per loader Shotgun (1.0) A devastating gun from the short distance and it’s the secondary weapon that is generally supplied to every Champion. It is used for short range conflicts where space is limited and responsiveness is crucial. It doesn’t require great aiming skills, but just to be at the right distance. Center the target but, above all, try to shoot first! To reduce to a minimum the recoil of their powerful and  lethal bullets, every Shotgun is assembled from the most elastic and resistant chemicals of a particularly scars and mysterious mineral. Info: Semi-Automatic 35 damage per bullet 8 cartridges loader Sniper rifle (1.0) This gun is generally supplied to the long-range surveillance team because of its  excellent precision from long the distance. It’s the favourite tool by those who prefer precision and instant death. The slow rate of fire is well balanced by its lethal power of its piercing blows so it is considered the perfect weapon for long-range fights. It encapsulates the arcane magic of a white dwarf allowing the gun to release a deadly piercing bullet able to maintain its  trajectory without any curvatures for a distance up to four parsecs. It has been tested by the best shooters hitting a target from one galaxy to another. Info: Semi-Automatic 100 damage per bullet 5 cartridges loader Machinegun (1.2) The Machinegun provided to Champions is a powerful heavy but extremely fast gun used to harvest enemies’ life like there were ears of wheat in summer. The high rate of fire allows them to hit enemies with a deadly rain of piercing bullets. It is generally the favorite weapon to those Champions who love to bring absolute chaos on the battlefield. It is not the most precise weapon in Champions’ arsenal, but who cares when you can shoot bullets like crazy to whatever crosses your sight?! For sure you will be hitting something, right?! Info: Automatic 19 damage per bullet 150 cartridges loader CLASSES Assault The assault class is ideal for Champions who love adrenaline and frenetic confrontation. The armor has been modified to allow greater agility, with the possibility of taking one shot for three seconds. The assault Champions are very quick and thanks to their high mobility they are difficult to hit during one confrontation. Support The support class is for Champions who prefer a more reasoned and cautious approach to confrontation, perhaps providing coverage support and protecting strategic positions with the use of the mines in their supply. Doctor The medical class allows Champions to have more security during the clashes thanks to the chance to call a Medical Support Robot to quickly heal his wounds. Scout Thanks to the Jetpack Modification of the armor, the scout class allows Champions to explore the battlefield to find favorable strategic points in the battlefield.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/650740/header.jpg?t=1604086721",
    "Price": 7.99,
    "Developers": "LEAF games and software",
    "Publishers": "LEAF games and software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_67325955dc1e4117a1c55e9b569c5d7331ac4a17.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_6bce950444ce904f1a4548089a1ee5b0629f169f.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_d5e316cee9d49ae17fe98e1f0e3c8506c1778c45.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_b74a9c65c088aa881a8565b4e7a6786324d9ac28.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_e5477ad3dec5bde75b4eb91db821dd86f66ea166.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_3173e7815a2f400a82e93468e8ce820ee33e042e.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_b520f13686fab81313e8c7f18eceba63c342fe4a.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_e356c9b424adea738e0f36678274200d2e784a37.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_db0a077a59410271fbb3e1f9384d9653f8c03c9f.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_0b6dc0908b18f8d4069765921d0fc455f6218398.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_d9a49649ad07debbe9e76d2caaba45a2fd7ac26f.1920x1080.jpg?t=1604086721,https://cdn.akamai.steamstatic.com/steam/apps/650740/ss_5559fde9ea3b397655dda8f20ae41b6893e22ad2.1920x1080.jpg?t=1604086721",
    "Slug": "leap-of-champions",
    "Meta Title": "Leap of Champions: Feb 2, 2020, LEAF games and software a...",
    "Meta Description": "Looking for information on Leap of Champions? Check out the release date (Feb 2, 2020), developer insights from LEAF games and software, and a complete ...",
    "Alt Text Image": "Official header image for Leap of Champions game - Steam 650740",
    "Canonical URL": "https://gusku.site/game/leap-of-champions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Leap of Champions\", \"description\": \"Looking for information on Leap of Champions? Check out the release date (Feb 2, 2020), developer insights from LEAF games and software, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"LEAF games and software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LEAF games and software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/650740/header.jpg?t=1604086721\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}