{
    "AppID": 401090,
    "Name": "MODO indie",
    "Release date": "Sep 24, 2015",
    "About the game": "Creative 3D modeling, texturing, animation and rendering tools. Modo’s powerful and flexible 3D modeling, texturing, animation and rendering toolset empowers artists to explore and develop ideas without jumping through technical hoops. Whether you’re creating real-time content for immersive experiences like games or virtual reality; iterating on concepts; using 3D to communicate, visualize or sell an idea, Modo® is your starting point for creative exploration. Introducing Modo Indie 14 With meaningful features and enhancements across the application, Modo Indie 14 has been engineered to accelerate your everyday creativity. The addition of USD, Cryptomatte, Rig Clay and over sixty more unique features and workflow enhancements marks this release as an essential part of any 3D artist’s toolbox. Modo Indie 14 highlights include: Direct Modeling - Modo’s direct modeling toolset has long been renowned for its shared focus on workflow and technical innovation. The new Edge Chamfer tool has now reached feature parity with bevel. Add point and Unbevel offer improved revision capabilities. Polygon Bevel Autoweld provides the automated decision-making that artists expect from modern modeling tools. With over 17 total features and enhancements in this area, direct modeling has never been easier, faster or more flexible. Procedural Modeling - Introduced in Modo 10, the procedural modeling tool sets have provided modo with a system built for the future of modeling. The vast majority of direct modeling features that have been added in this release have also been added to the procedural system. With meaningful additions to MeshFusion via embossing and sharp corners, Procedural Vmaps and Keep Vertices for Deleted Geometry, procedural modeling continues to grow more powerful. Rendering &amp; Shading - A painter is never actually done with a painting. The same is true with a renderer, there’s always room for new capabilities and enhancements. With GPU acceleration via Optix 7, the addition of intel embree support, cryptomatte for intelligent and lightweight automated masking, and shading workflow enhancements from the PBR Loader, mPath has rapidly grown into a powerful renderer that artists can rely on. UV Enhancements - Modos UV tool set has long enabled mapping wizardry. With each release, this set of tools both grows and refines. UV Relax has been added to the procedural system. Unwrap and Relax combines two tools that are commonly used in sequence to improve workflow and the addition of Real World Size makes Modos UV tools an indispensable part of any 3D design arsenal. Animation &amp; Rigging - Modo has one of the most novel Rigging and Animation systems on the market today. By adding streamlined IK/FK switching for planar IK, Rig Clay for animators to more interactively manipulate shapes or set keys, and USD import/Export for industry-standard exchange, Modo is poised to redefine rigging and animation workflows across design and entertainment industries. Performance - There’s always room for more performance and Modo 14 delivers on this notion. The advanced viewport has been optimized for faster shader tree processing. Booleans have been accelerated by as much as 380x in complex examples. Component selection is twice as fast and edge removal operations have shown improvements as high as 100x. Viewport - The 3D viewport is an essential part of any 3D application. It’s where artists spend most of their day. Upgraded Transparency rendering accelerates and improves the quality of these complex effects.Ghost and Xray offer practical visualization options to improve every day tasks like modeling, layout and rigging. The new Topology presets leverage Ghost and Xray to provide a dramatically superior retopo experience. Workflow and User Experience - Without proper attention to workflow, a powerful tool is little more than a digital paper weight. Modo 14 continues to expand on artist focused workflows with many relevant enhancements. Select partial expands on Modos extraordinary selection tools. Form Presets enables anything in a form to be saved to a preset. Alt-Click for Inactive Mesh settings further streamlines interaction For the full list of Modo 14 features and enhancements, please see the application documentation. Differences between MODO indie and full Modo OBJ, FBX, glTF 2.0 export limited to 100k polys Bake and render resolution limited to 4k Command eval options unavailable Command, scripts, and command history panel results unavailable except “undo” and “history” Python editor, third-party scripts, and third-party plugins unavailable Can import all formats, but can only save in .lxf format Export formats limited to OBJ, FBX, USD, and glTF 2.0 Image save formats limited to .png, .jpg, .tiff, .tga and .exr Network Rendering is disabled Limited to individual use",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/401090/header.jpg?t=1619023711",
    "Price": 14.99,
    "Developers": "Foundry",
    "Publishers": "Foundry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_3bebf8f1951fefa5bc3ddf92db60b5f1401827e9.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_b037fb57670e831d4070577d43535f1ab3c4a2f8.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_ddb519fa0821faebe0e4272ab89bea0c03c1d524.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_26890eef9fb085ae677bc36ae5a3bc61dab06754.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_467dcb699cf62a229782e7c9d5ec131c0b10b609.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_3684716665388d5f86e2012d07ee628384edab2c.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_d3d806b20c781284cfd4987d0e0af38e1ce01af4.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_abb5a0f71af431c9c66350b1bca0a486c652c60b.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_0f49743fa62aec883690d730ceccab2a77f193c2.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_c23fe4b076e57acb7b86bbf6edc947d7b0477820.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_6eedb6ca019a7d7a01592d4ad2fcd66e49066346.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_55b625dc922ea04e33f3236202c41f0e1dab3569.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_f03de11a81bb6bee908ba05f691817b194b20d8d.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_ec0392ce047fc812b3eb142542228cdfc66618cd.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_2414a99a90cc18eec3eac1d57cd6a8d3abab3109.1920x1080.jpg?t=1619023711,https://cdn.akamai.steamstatic.com/steam/apps/401090/ss_de54c09dcc9d258ed96521058165fd8a096b4d63.1920x1080.jpg?t=1619023711",
    "Slug": "modo-indie",
    "Meta Title": "MODO indie: Sep 24, 2015, Foundry and Full Overview",
    "Meta Description": "Looking for information on MODO indie? Check out the release date (Sep 24, 2015), developer insights from Foundry, and a complete game summary.",
    "Alt Text Image": "Official header image for MODO indie game - Steam 401090",
    "Canonical URL": "https://gusku.site/game/modo-indie",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MODO indie\", \"description\": \"Looking for information on MODO indie? Check out the release date (Sep 24, 2015), developer insights from Foundry, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 24, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Foundry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Foundry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/401090/header.jpg?t=1619023711\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}