{
    "AppID": 1473940,
    "Name": "MultiVerse",
    "Release date": "Mar 19, 2022",
    "About the game": "Welcome to Multiverse: the game, Be Aware that this is only a prototype for the game and will have A lot off features will be released in the near future Multiverse is a game made by Hero studio via unreal engine, the game idea has been there since 2010 and we started working in 2014, now the game basis is already there, it is a first shooter game mixed with RPG, we made it this way to increase the excitement. The game now is show off and it's free to play and other contents will be added gradually. There are some characters and vehicles, some are playable, some are AI and the rest are just decorations. The main goal of our game is that you can experience new things in the gaming world and not only waste your time searching for loot. There are many things that make a game boring, one of those things is the difficulty of finding a weapon, so in our game we made it very easy to find weapons, even in killing monsters, animals or plants you can find weapons as well as increasing your rank. Now lets talk about some features that are ready to play. Main character: It is the character that you play with, you will be spawned with a gun and start playing and find more guns and win the game. Demons: For now, demons are only AI, they can be found in caves, underground and forests. They are dangerous and aggressive, but killing them will give you a special loot. Map: The map is ready to play it has many houses, cars, vegetation and others Stats of development We have already managed to make the basics of the game play, AI and we will bring a lot in the coming months. Balancing is important in competitions, but sometimes it's fun and challenging to play an unbalanced game, so in some non-ranked games we will remove the balance. There are a lot of fun and interesting things that will be added to our game, and of course we will listen to our community, there must be some suggestions we can take advantage of. Stages: Our plan has multiple stages, Stage 1 Design the main map, characters, weapons and A.I Design basic gameplay with basic simple map ( we are here) Stage 2 Add new mods, maps, news bar, streaming and make competitions. adding multiplayer functionality Stage 3 Making a new neutral place for players it will be a small map where we will put markets for weapons, armors, pets and potions. In addition, there will be an area for users to create their own mods and build their own places such as houses, markets, etc.. Furthermore, the neutral land will have portals to other worlds where you can start your online game or finish an extra mission. This stage will be really interesting for everyone. Best regards, Multiverse game team",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1473940/header.jpg?t=1647690045",
    "Price": 0.0,
    "Developers": "Hero Studio",
    "Publishers": "Hero Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1473940/ss_3ab17886a8f849eef7e99bf27cdd82b08b8a110f.1920x1080.jpg?t=1647690045,https://cdn.akamai.steamstatic.com/steam/apps/1473940/ss_1512f5cb7e6fb0daa793b44e4dc99e74a4723759.1920x1080.jpg?t=1647690045,https://cdn.akamai.steamstatic.com/steam/apps/1473940/ss_30dfe1ac32401561c93176b1a0705cba6457c4b1.1920x1080.jpg?t=1647690045,https://cdn.akamai.steamstatic.com/steam/apps/1473940/ss_cc7606dcc3caf5dd0dc82e020558502ead4f6855.1920x1080.jpg?t=1647690045,https://cdn.akamai.steamstatic.com/steam/apps/1473940/ss_f28ba94d39733f99d18c6cb8525c0d3b85d1420a.1920x1080.jpg?t=1647690045",
    "Slug": "multiverse",
    "Meta Title": "MultiVerse: Mar 19, 2022, Hero Studio and Full Overview",
    "Meta Description": "Looking for information on MultiVerse? Check out the release date (Mar 19, 2022), developer insights from Hero Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for MultiVerse game - Steam 1473940",
    "Canonical URL": "https://gusku.site/game/multiverse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MultiVerse\", \"description\": \"Looking for information on MultiVerse? Check out the release date (Mar 19, 2022), developer insights from Hero Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hero Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hero Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1473940/header.jpg?t=1647690045\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}