{
    "AppID": 1523260,
    "Name": "迷霧國度: 傳承 Myth of Mist：Legacy",
    "Release date": "Jan 27, 2022",
    "About the game": "Myth of Mist: Legacy Introduction: In the mist-surrounded City of Time and Eternity, you are the son of a noble family, going between various factions aiming to fight against the upcoming disaster of the Mist of Doomsday. This game is for players who love SLGs and multi-ending RPGs. Join us and write your own legend! About this game: Summary 'Myth of Mist: Legacy' is an epic fantasy game designed for CRPG and SLG lovers. You will play as an anonymous traveler in the City of Time and Eternity who going between different faction and heroes. Apart from uncovering the mystery behind the entire world, you have to find the way to defeat the King of Mist and its monster army before the disaster of the Mist of Doomsday comes. Will you push forward with your comrades, or fight alone? It's all up to you. Experience There are more than 20 unique heroes and heroines to join your party. Free transfer, skill talents improvements and various weapons allow you to demonstrate your unique tactics on the full 3D battle map. Explore freely in many adventure maps of different styles, and decide the fate of different heroes and heroines with your choices. Even the fate of the city lies in your hand. At the end of the day, are you going to be the champion that saves the world, the arch-demon that destroys the world, or something else? Game Features ■Multi-tier class system and free transfer From basic to advanced classes, you could learn and improve the unique skills of different classes, creating a combat style of your own. ■ A weapon matching system without restriction Pair up various types of weapons freely to suit your taste. You could equip a machete and a musket simultaneously, or equip two swords for fast stream attack. You can even equip two shields, one for each hand! ■Unique heroes and heroines of different species and factions More than 20 heroes and heroines with unique portraits and exclusive skills for you to recruit to join your party. In addition, there are mercenaries who don't belong to any specific faction. They will offer you their help if you could meet their needs. Think carefully before making any decision, because when you win someone's favor, you may have enraged another person. ■A colorful adventure world for you to explore freely Explore several areas with distinctive characteristics freely. Beside the adventure world, you have to enter the Dream World, which has its own special sets of rules. By the way, we have removed the limitation of gravity for you. So, yes, you can 'jump' as much as you like during your adventure. ■Fantasy story with multiple routes and endings Each decision you make will determine the fate of the city and the hero. Your choices will lead you to different paths and ending. Besides, if you neglect the influence of those important decisions, you may even face your tragedy early on your adventure. Raise your sword and put on your gear. Experience this heroic epic that belongs to you and you alone!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1523260/header.jpg?t=1643341438",
    "Price": 24.99,
    "Developers": "赫米兔娛樂Skvader Entertainment",
    "Publishers": "英特衛多媒體股份有限公司Interwise Multimedia Corp.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_f3d4d034d07d178e58e58a6e8b9447f22425171e.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_868557a24644ef42c3354d3766a75ea3ee5db6a8.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_6b5a1961bc4f3c05b5238f68b3266eb4201afcbe.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_e1adf88716ad6b9c0d74eae9a376bb43a7889064.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_eb3fd78a0d18cfbe6aab803fc3c87f8fa92504f7.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_8bd782dba18ec0a846a02420114fa0d89d149162.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_7e2534efe50009a67b2e79ff0e50419ac53779df.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_498a2a39b8bc0cc67ec27a20bb041cea15a26ea5.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_0e74810fb81ee1fd3f6eaf9b5e13893813552fbf.1920x1080.jpg?t=1643341438,https://cdn.akamai.steamstatic.com/steam/apps/1523260/ss_67d190efda68d9d5f2f2e7a0b031d71453644e29.1920x1080.jpg?t=1643341438",
    "Slug": "myth-of-mistlegacy",
    "Meta Title": "迷霧國度: 傳承 Myth of Mist：Legacy: Jan 27, 2022, 赫米兔娛樂Skvader ...",
    "Meta Description": "Looking for information on 迷霧國度: 傳承 Myth of Mist：Legacy? Check out the release date (Jan 27, 2022), developer insights from 赫米兔娛樂Skvader Entertainment, ...",
    "Alt Text Image": "Official header image for 迷霧國度: 傳承 Myth of Mist：Legacy game - Steam 1523260",
    "Canonical URL": "https://gusku.site/game/myth-of-mistlegacy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u8ff7\\u9727\\u570b\\u5ea6: \\u50b3\\u627f Myth of Mist\\uff1aLegacy\", \"description\": \"Looking for information on \\u8ff7\\u9727\\u570b\\u5ea6: \\u50b3\\u627f Myth of Mist\\uff1aLegacy? Check out the release date (Jan 27, 2022), developer insights from \\u8d6b\\u7c73\\u5154\\u5a1b\\u6a02Skvader Entertainment, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u8d6b\\u7c73\\u5154\\u5a1b\\u6a02Skvader Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u82f1\\u7279\\u885b\\u591a\\u5a92\\u9ad4\\u80a1\\u4efd\\u6709\\u9650\\u516c\\u53f8Interwise Multimedia Corp.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1523260/header.jpg?t=1643341438\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}