{
    "AppID": 511570,
    "Name": "NIGHTSTAR",
    "Release date": "Mar 7, 2017",
    "About the game": "NIGHTSTAR: ALLIANCE NOW AVAILABLE Get the sequel to NIGHTSTAR: Starfighter now! --- What is NIGHTSTAR? This VR title is a retro inspired, room-scale third-person shooter. You play by moving your Vive Motion Controller in space, shooting a vast variety of enemies, and avoiding obstacles and enemy fire. You progress through the levels by collecting upgrades that not only make your starfighter more powerful but also make the enemies more angry at you. BACKSTORY Planet Earth. 1983. You've been selected among millions of gamers to pilot the NIGHTSTAR, an ultimate starfighter with enough firepower to hold back the Drone Coalition. Will you accept the challenge? ARE YOU A BAD ENOUGH DUDE TO SAVE OUR GALAXY? NIGHTSTAR brings all the best elements of the classic Arcade Shoot'em Up games to the age of Virtual Reality. Built from the ground up for VR and polished to exhaustion to achieve perfect balance, NIGHTSTAR will take you back to the golden age of arcades, but this time in complete immersion. Intuitive controls and a great variety of well-designed enemies are waiting for you on the other side. FEATURE LIST Intuitive Controls You grew up playing with airplane toys. Piloting the Nightstar is just like that. Realistic toys. That shoot lasers... In space. And will eventually explode. Do I have to say more? Upgrade. Adapt. Evolve. Make your way through the restless enemy waves, and show them you're here for serious stuff. Upgrade your weapons, expand your defenses and give that extra punch. None shall stay in your way. Smart, Adaptable Enemies Don't get too comfortable. The enemies will learn your moves, and will attack you with everything they have. Battle enemy starfighters, armed asteroids, bounty hunters, torpedo gunships, and giant battleships. Original 80s Inspired Soundtrack The synthwave is strong in this one. Get ready for this fully immersive soundtrack that adapts to the gameplay in real time. Composed by the amazing Thiago Adamo, AKA PXLDJ. Online Leaderboards Who's the best Nightstar pilot on the planet? Let's find out.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/511570/header.jpg?t=1534869651",
    "Price": 9.99,
    "Developers": "SOLIDMESH",
    "Publishers": "SOLIDMESH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/511570/ss_574183ba913da8fad6e660405e58475c08b446e5.1920x1080.jpg?t=1534869651,https://cdn.akamai.steamstatic.com/steam/apps/511570/ss_85125f5f7b30dc39f808c3eee0ba538d2f9d3bd7.1920x1080.jpg?t=1534869651,https://cdn.akamai.steamstatic.com/steam/apps/511570/ss_c1598e5461db55002f0e64b255953cf8e83c972b.1920x1080.jpg?t=1534869651,https://cdn.akamai.steamstatic.com/steam/apps/511570/ss_5f11ee1001ee4f110cb136a19b3b63d042d6a5a6.1920x1080.jpg?t=1534869651,https://cdn.akamai.steamstatic.com/steam/apps/511570/ss_c56243a9baec08a2ec6c3a8b609eddc83c879235.1920x1080.jpg?t=1534869651",
    "Slug": "nightstar",
    "Meta Title": "NIGHTSTAR: Mar 7, 2017, SOLIDMESH and Full Overview",
    "Meta Description": "Looking for information on NIGHTSTAR? Check out the release date (Mar 7, 2017), developer insights from SOLIDMESH, and a complete game summary.",
    "Alt Text Image": "Official header image for NIGHTSTAR game - Steam 511570",
    "Canonical URL": "https://gusku.site/game/nightstar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NIGHTSTAR\", \"description\": \"Looking for information on NIGHTSTAR? Check out the release date (Mar 7, 2017), developer insights from SOLIDMESH, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"SOLIDMESH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SOLIDMESH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/511570/header.jpg?t=1534869651\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}