{
    "AppID": 1905180,
    "Name": "OBS Studio",
    "Release date": "Mar 21, 2022",
    "About the game": "OBS Studio is a free and open source program for livestreaming and video recording. Create scenes with multiple types of video sources, including your computer display, video games, webcams, video files, and more. Stream your video productions on sites like Twitch, YouTube, or Facebook live, or record your videos locally to share. Features Livestream video to sites like Twitch, YouTube, Facebook Live, and many more, including your own custom servers Record videos to save to your hard drive and share with friends High performance real time video/audio capturing and mixing. Create scenes made up of multiple sources including window captures, images, text, browser windows, webcams, capture cards and more Set up an unlimited number of scenes you can switch between seamlessly via custom transitions Intuitive audio mixer with per-source filters such as noise gate, noise suppression, and gain. Take full control with VST plugin support Powerful and easy to use configuration options. Add new Sources, duplicate existing ones, and adjust their properties effortlessly Streamlined Settings panel gives you access to a wide array of configuration options to tweak every aspect of your broadcast or recording Modular 'Dock' UI allows you to rearrange the layout exactly as you like. You can even pop out each individual Dock to its own window Choose from a number of different and customizable transitions for when you switch between your scenes or add your own stinger video files Set hotkeys for nearly every sort of action, such as switching between scenes, starting/stopping streams or recordings, muting audio sources, push to talk, and more Studio Mode lets you preview your scenes and sources before pushing them live. Adjust your scenes and sources or create new ones and ensure they're perfect before your viewers ever see them Get a high level view of your production using the Multiview. Monitor 8 different scenes and easily cue or transition to any of them with merely a single or double click",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1905180/header.jpg?t=1654173198",
    "Price": 0.0,
    "Developers": "OBS Project",
    "Publishers": "OBS Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1905180/ss_ed75900b7bd34ef638e515402b646f798bb21d6e.1920x1080.jpg?t=1654173198,https://cdn.akamai.steamstatic.com/steam/apps/1905180/ss_8375d65af3cc02a76613ddc32c09357731a5ef8c.1920x1080.jpg?t=1654173198,https://cdn.akamai.steamstatic.com/steam/apps/1905180/ss_f7aa6c7a804e0a06ea5a9742a9afc15f637d498e.1920x1080.jpg?t=1654173198,https://cdn.akamai.steamstatic.com/steam/apps/1905180/ss_f6e4120787729b94b8842d76a617c92bffcf51dc.1920x1080.jpg?t=1654173198,https://cdn.akamai.steamstatic.com/steam/apps/1905180/ss_4c7b9eaef4a3dd148a1e7dcfc82afa4160e791ab.1920x1080.jpg?t=1654173198,https://cdn.akamai.steamstatic.com/steam/apps/1905180/ss_1b6b52c758ca5b43eef0f8da3033f4825118f98e.1920x1080.jpg?t=1654173198",
    "Slug": "obs-studio",
    "Meta Title": "OBS Studio: Mar 21, 2022, OBS Project and Full Overview",
    "Meta Description": "Looking for information on OBS Studio? Check out the release date (Mar 21, 2022), developer insights from OBS Project, and a complete game summary.",
    "Alt Text Image": "Official header image for OBS Studio game - Steam 1905180",
    "Canonical URL": "https://gusku.site/game/obs-studio",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"OBS Studio\", \"description\": \"Looking for information on OBS Studio? Check out the release date (Mar 21, 2022), developer insights from OBS Project, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"OBS Project\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OBS Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1905180/header.jpg?t=1654173198\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}