{
    "AppID": 312450,
    "Name": "Order of Battle: World War II",
    "Release date": "Apr 30, 2015",
    "About the game": "The free version of the game gives you access to the unique Boot Camp campaign as well as a taste of the first chapter of every other campaign pack. This means that new free missions will appear as soon as a new campaign gets released! Order of Battle: World War II is a breath of fresh air for all strategy fans. It is a game that takes wargaming to a new level by upgrading every single game element and rebooting the genre for a new generation of players. Detailed terrain, rich animations and a slick interface, all within a traditional setting and with the elements that are familiar to experienced players - Order of Battle: World War II follows in the footsteps of all time classics, such as Panzer General. With a selection of over 700 unique looking and behaving units , players can build and manage their army, fleet and air force throughout the campaigns set in the various theatres of operations during WW2. A unique system of specializations allows players to customize their forces with special units, bonuses and abilities that reflect the difference in strategies and mentality of the various factions. A set of unique Commanders – split between Generals, Pilots and Captains – is gradually unlocked in the campaigns. These can be attached to specific units to provide unique bonuses to anything in their command range. While good use of unit types and tactics remains the player's priority, clever use of Commanders can tip the balance in an offensive operation or buy just enough time in defense to turn the tide to your favor. In Order of Battle: World War II , a unique supply system also plays a key factor that directly affects the combat efficiency of the units. Landing on an enemy island without any support ships will prevent the invasion forces from building a solid beachhead, and breaking the supply lines of your opponent, isolating his units and making encirclement maneuvers are the strategies required to achieve an ultimate victory. Add an intuitive in-game scenario editor, up to 4 player multiplayer support through Hotseat or Slitherine's PBEM++ server system and you have a game with endless re-playability. Classic turn based, hex based gameplay with an intuitive UI and great depth. Play in dynamic campaigns with unit carryover and multiple 'what-if' scenarios. A rich 3D world with detailed animations and effects. Turn-based wargaming has never looked this good! 20 different Specializations give a unique feel to each faction including Banzai Charge, Bushido Code and even the Manhattan Project. Over 700 different unit types, including infantry, tanks, ships and aircraft, each with unique visuals and animations Attach unique commanders to your units to give them additional offensive and defensive bonuses A deep but intuitive supply system allowing breakthroughs &amp; encirclements. 4 player multiplayer over PBEM++ and hotseat, supporting last-man-standing, teamplay and cooperative against AI scenarios. An extensive, user-friendly in-game scenario editor with a what-you-see-is-what-you-get design.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/312450/header.jpg?t=1633615404",
    "Price": 0.0,
    "Developers": "The Artistocrats",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_c8c3b4f5d38115d944a07ed94fe967c0f945bd37.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_ccf24c57b9971d09ceadf46949be650093afdf90.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_a22d9681476c23681689065e1c6e87e8398dcdc4.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_a6badc6f05f362c02142fd8913d00c1fb2b32274.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_cc8d99fab6f44e2bca985fbcedbc47628a5bcf50.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_9d44f6ea951bb0f7d32211c2d753055b5eb2683e.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_23a51254d37af08c3e3ccfe6c9b6e69df670b6b7.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_97fd14a22007b6dbc88a8eb028cefc84e6f67976.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_abd27b3319bfbdaf394b48742771d9666a4b8fe7.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_e66f22f8a6aea0eaa8fb683c3a7fac601346567c.1920x1080.jpg?t=1633615404,https://cdn.akamai.steamstatic.com/steam/apps/312450/ss_7a41a88132fb253a56b534b56ae360bc3f65677d.1920x1080.jpg?t=1633615404",
    "Slug": "order-of-battle-world-war-ii",
    "Meta Title": "Order of Battle: World War II: Apr 30, 2015, The Artistoc...",
    "Meta Description": "Looking for information on Order of Battle: World War II? Check out the release date (Apr 30, 2015), developer insights from The Artistocrats, and a com...",
    "Alt Text Image": "Official header image for Order of Battle: World War II game - Steam 312450",
    "Canonical URL": "https://gusku.site/game/order-of-battle-world-war-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Order of Battle: World War II\", \"description\": \"Looking for information on Order of Battle: World War II? Check out the release date (Apr 30, 2015), developer insights from The Artistocrats, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Artistocrats\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/312450/header.jpg?t=1633615404\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}