{
    "AppID": 650070,
    "Name": "OVERTURN",
    "Release date": "Oct 17, 2017",
    "About the game": "You’ve found yourself inside a futuristic laboratory with no memory of who you are or how you got there. You begin to wonder - are there others like me? Find your way out of the confines of the laboratory and unravel the story to understand what’s going on. You’ll meet Magi, a mysterious girl with a dark history equipped with special skills and abilities during your journey - work together to escape and reveal the secret of OVERTURN ! OVERTURN is a first-person shooter (FPS) action-puzzle adventure game developed specifically for Oculus Rift and HTC Vive, offering players a chance to experience an immersive action-packed VR world. Choose from an extensive arsenal of weapons to destroy your foes, from beam rifles, swords, or even your bare fists. OVERTURN ’s tight and responsive combat system offers players free movement to fight and defend themselves. Enter OVERTURN to experience the ultimate action experience within a dangerous fantasy world filled with towering bosses and a story that will keep you playing until the very end. An immersive FPS that combines adventure with puzzle elements. OVERTURN is a full-blown VR FPS game that immerses players into a fantasy world where quick reactions and sharp shooting are needed to stay alive. A mysterious and unique story that you can’t just ‘stop playing’. How will you escape the laboratory holding you prisoner? With full character narration, start to unravel the complex story behind your imprisonment within the facility. Employ a vast arsenal of weapons at your disposal for the ultimate VR FPS experience. Choose your weapon! From beam rifles, melee weapons like swords or even using your bare fists, you’ll be challenged from the beginning to use any weapon available to destroy your enemies. Bonus Content Fan-art from community contributors. Find and unlock wonderful OVERTURN illustrations displayed in-game that have been created by famous artists. Meet Magi, your companion throughout your journey! Magi possesses special skills and abilities that can assist you during your mission to escape the laboratory. Still, questions remain - who is Magi really, and can you ultimately trust her? SKILLS INFINITE CHARGING : Allows you to fire charged shots instantly, allowing you to defeat enemies with just one shot of your powerful beam rifle. TIME SLOW : Slows down time which impacts everything around you. Move quickly to unleash deadly attacks on your foes! SHIELD : Creates an invincible shield for a few moments. Deflect enemy attacks and fire away without fear of taking any damage. ITEM - HP : Magi will create an HP item for you, which instantly recovers your full health during battle. ITEM - GRENADE : Magi will create a grenade that you can throw at enemies - watch it detonate and blow your adversaries to shreds! BATTLE MAGI : Magi to the rescue! Magi will transform into battle mode for a limited time and help clear the area of all enemies. Update plan (COMING SOON) • Multiplayer - PVP ARENA MODE : Join other players and step inside the competitive multiplayer modes for up to 6 players. Survive till the end and be on top of the world rankings!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/650070/header.jpg?t=1607928898",
    "Price": 29.99,
    "Developers": "STUDIO HG",
    "Publishers": "YJM GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_5e4f1a896975ae984a2f3773ac83d4e4f74e98b5.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_fbc05ffbe606b006bdbb791cce624702fa7bedc5.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_04bd5e84280058ff0cba3e9015a68a0c746d5500.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_aeda493bf456ad474c23088759bf1b0435262e53.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_aaa4059e3778b13cf1cb38c2369870dff6014233.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_c78b79ec2d23e3acec0de785c389edeca03392cf.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_b7d5e9d57b8b01511dada4c5b7be1938cebc42ef.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_7e0dd0e2e8f88398ee1ec288f119ad38a41b0724.1920x1080.jpg?t=1607928898,https://cdn.akamai.steamstatic.com/steam/apps/650070/ss_54e17b6dae65e0ffda0760181a392d13c71aed59.1920x1080.jpg?t=1607928898",
    "Slug": "overturn",
    "Meta Title": "OVERTURN: Oct 17, 2017, STUDIO HG and Full Overview",
    "Meta Description": "Looking for information on OVERTURN? Check out the release date (Oct 17, 2017), developer insights from STUDIO HG, and a complete game summary.",
    "Alt Text Image": "Official header image for OVERTURN game - Steam 650070",
    "Canonical URL": "https://gusku.site/game/overturn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"OVERTURN\", \"description\": \"Looking for information on OVERTURN? Check out the release date (Oct 17, 2017), developer insights from STUDIO HG, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"STUDIO HG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YJM GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/650070/header.jpg?t=1607928898\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}