{
    "AppID": 330880,
    "Name": "Redemption",
    "Release date": "Aug 11, 2016",
    "About the game": "***'Redemption' is an Early Access title. It is currently in progress of development and is yet unpolished. Buying 'Redemption' now in EA will support Team Redemption to polish and improve the game with various, new upcoming features.*** Before You Play *We highly recommend using a controller (Xbox 360) when playing Redemption.* The thrill will double . What kind of a game is Redemption? Redemption is an Action Role-Playing Game (ARPG) set in a post-apocalyptic world. Since the end of World War III, the world unites as one under the name of 'World Government' hoping for mankind's eternal properity and peace. The peace successfully remains - until 'The Judgement Day'. Full story is to be added in a future update. Stay tuned! Players may clear dungeons alone, or they may form a party with others to enjoy the thrill together. PvP battles are also available - battle against other players in individual/team deathmatches. 1v1 through 5v5 battles are available. Current Features in Redemption Dungeons: PvE fields for players to develop characters. Currently, there are 2 major dungeons and 11 stages in total. Party-play available. Survival: It is a part of [Challenge Mode] and the ultimate goal for the player is to 'survive' from waves of mutants in a set time limit. Players will receive special rewards if he/she has survived until time limit. Boss Rush: It is the second part of [Challenge Mode]. Given a time limit, the ultimate goal is to defeat all bosses. If even the very last boss has been defeated, special rewards are provided. PvP - [Annihilation]: 1v1 through 5v5 battles are available. It is an individual/team deathmatch - the first one/team to reach a certain number of kills wins. Upcoming Features Characters: 10+ more characters Dungeons: 1 additional dungeon with 5~7 stages (and more in the future) PvP - [Destruction]: New PvP battle mode Story - Full background stories of the game and the characters Quests: Quests are expected to be added - check out the background stories and receive rewards from completing quests. Achievements: Achievement titles with required conditions (special rewards available - only receivable from achievement titles) Costumes: Special costumes/avatars for characters - express your individuality and uniqueness! *We cannot fully guarantee that these features will be applied in the future. Team Redemption and the Development 'Redemption' is brought to you by Team Redemption, a team made of passionate and game-loving developers under Move Games. Our developers will spare no efforts to constantly improve the game. Also, please note that we are aiming for 3~4 updates per month (in average) and we will be posting update notes every time. Lastly, if you have any suggestions/feedbacks for us, please kindly let us know. We would love to hear your opinions. We truly appreciate your support. -Team Redemption Email: steam@movegames.co.kr",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/330880/header.jpg?t=1484656028",
    "Price": 14.99,
    "Developers": "Move Games Co., Ltd.",
    "Publishers": "Move Games Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/330880/ss_c43851a98f24e424ccc5e2cf5522c17c4a809bee.1920x1080.jpg?t=1484656028,https://cdn.akamai.steamstatic.com/steam/apps/330880/ss_a7d5568d98054f2e90ceecf3ec6f3973a79fa817.1920x1080.jpg?t=1484656028,https://cdn.akamai.steamstatic.com/steam/apps/330880/ss_e8125d2274388f90bbca942aac91ca8a77c3c407.1920x1080.jpg?t=1484656028",
    "Slug": "redemption",
    "Meta Title": "Redemption: Aug 11, 2016, Move Games Co., Ltd. and Full O...",
    "Meta Description": "Looking for information on Redemption? Check out the release date (Aug 11, 2016), developer insights from Move Games Co., Ltd., and a complete game summ...",
    "Alt Text Image": "Official header image for Redemption game - Steam 330880",
    "Canonical URL": "https://gusku.site/game/redemption",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Redemption\", \"description\": \"Looking for information on Redemption? Check out the release date (Aug 11, 2016), developer insights from Move Games Co., Ltd., and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 11, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Move Games Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Move Games Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/330880/header.jpg?t=1484656028\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}