{
    "AppID": 732510,
    "Name": "Rise of the Foederati",
    "Release date": "May 4, 2020",
    "About the game": "Rise of the Foederati is an online, massive multiplayer strategy game that combines real-time strategy with turn-based combat. You play as a leader of one of the many tribes surrounding the Roman borders in mid-5th century AD, and your objective is to lead your warriors into raids, skirmishes and battles to survive. More important than winning battles, however, is to wade through the intricacies of managing your warband, as your soldiers will support your leadership as long as you bring them loot and glory. A weak leader, however, may face discontent warriors that will desert, abandon formations, disrespect your commands, or even challenge you to take control of your group! Spine-chilling, realistic immersion What you hear is what it is. A knife stab. A shield blocking an incoming sword. The jingling sound of coins inside a bag. Nearly every sound you hear in Rise was recorded in studios to be as realistic as possible. The eerie feeling before a battle now feels more tense than ever, with dynamic music that shifts with a battle's progress. Deep, intricate, and tactical gameplay Witness your soldiers improve as they wage wars with you. Historical accuracy The Dark Ages (or, more accurately, Migration Period) as you have never seen before. Rise of the Foederati has historical accuracy down to the most minimal detail. From the pronounciation of one of the dozen extinct languages of the period to the design of warriors' armaments, the experience you have is as historically accurate as it gets. Politics paved with power and casualties An ever-changing political scene awaits you. Within each swing of the pendulum of power, you'll be forced to make decisions that may have long-term repercussions. For example, if a huge force from a previously neutral tribe attacks your own, it may require your warband to ally itself with old enemies against this new threat. Rally your friends, raid your enemies, protect your tribe* Hundreds of players are present at the same time in Rise. Your movements and battles are present in real-time; there are no instances in the world. Your actions make a mark in the world. The more people you bring to your side, the bigger your actions are. * To be added during Early Access",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/732510/header.jpg?t=1639339788",
    "Price": 8.9,
    "Developers": "Genos Studios",
    "Publishers": "Genos Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/732510/ss_c4db046a059b3eae04fdb60bc7ce2d077bb19f2d.1920x1080.jpg?t=1639339788,https://cdn.akamai.steamstatic.com/steam/apps/732510/ss_47b59a15db3a4a384de4fce4b71f9c91a2738744.1920x1080.jpg?t=1639339788,https://cdn.akamai.steamstatic.com/steam/apps/732510/ss_b422ddbf8e16c863b7e4cfa2758fcf106c544a0d.1920x1080.jpg?t=1639339788,https://cdn.akamai.steamstatic.com/steam/apps/732510/ss_69b083089ae25671db3e5b317a2ef98e11bd870f.1920x1080.jpg?t=1639339788,https://cdn.akamai.steamstatic.com/steam/apps/732510/ss_9d49299fe3c34497f2635fa395db7aa4aa8ef7d5.1920x1080.jpg?t=1639339788,https://cdn.akamai.steamstatic.com/steam/apps/732510/ss_b98a81ec4592ee6b91b6917b159eecd44c5d5d78.1920x1080.jpg?t=1639339788",
    "Slug": "rise-of-the-foederati",
    "Meta Title": "Rise of the Foederati: May 4, 2020, Genos Studios and Ful...",
    "Meta Description": "Looking for information on Rise of the Foederati? Check out the release date (May 4, 2020), developer insights from Genos Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Rise of the Foederati game - Steam 732510",
    "Canonical URL": "https://gusku.site/game/rise-of-the-foederati",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rise of the Foederati\", \"description\": \"Looking for information on Rise of the Foederati? Check out the release date (May 4, 2020), developer insights from Genos Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Genos Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Genos Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/732510/header.jpg?t=1639339788\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.9, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}