{
    "AppID": 1743110,
    "Name": "Sidequest",
    "Release date": "Nov 22, 2021",
    "About the game": "once up a time in a world far far away, there lived a group of heroes bound together by fate, chosen to battle dark forces, on an epic adventure. THIS IS NOT THAT STORY Join, magog of morskar, Faiza Ikrum, Arcturus of Sarthos, and Laira final solution Windfarter III, on a journey the likes of which, has admittedly been seen many times. travelling through morskar, in a world breathed of the finer things like not having everything wanting to kill you. Your foe, Ka-ren Scojus a Noble of Morskar who through some advanced artifice has come across the earthrealm and seen Magog's plan to conquer it. Ka-ren with little skills outside of artifice, enchantment, and shadow puppetry, Ka-ren, found a discarded Veil Crystal and partially reactivated it allowing him to see Magog and Crew, and worse their browser histories. Truly disturbed by their plan to conquer the earth realm, Ka-ren has made it his goal to pierce the Veil before Magog. -4 Character RPG, with Active turn battle - Magog of Morskar, a Necromancer most noted for peering into another world. Through the Veil crystal he has found a Paradise compared to the dismal world of Voth. A master of magic Magog, with a undead grim raven named Poe, has recruited people across the Voth to gather information, and help bleed the earth realm of recourses by means of a online comedy show connected to the ether network of their world and has created a name for himself in both worlds but his end goal is to come to the Earth realm to conquer it. - Faiza Ikram, Born a Slave in Akakesh fought her way to freedom as a Gladiator, now she fights as a mercenary making coin where she can, only one quarter orc, she still provides the muscle where needed equipped with her sword 'Baby Spinebreaker' and her skills (and adorable little doggo) she can fight her way out of almost any situation - Laira 'Final solution' Windfarter the third, A Elf, an autist, Laira comes from the elf kingdom of Valamar, cast from her village because of an alleged toot that brought the literal house down. she learned how to survive in the forest, with her bow probably named 'the weenie pewer', one day she came across a camp of gnomes who she quickly enslaved and does organ harvests on. - Arcturus of Sarthos, is a renaissance man, most notable is his involvement in politics, alchemy, and mathematics, feared by his enemies who called him the black compass, Arcturus took to the name, and has it as part of his signature look, his experience with potions, poisons, subterfuge, seduction (unintentionally), human supremacist groups, new world order organizations, art, literature, hating elves, architecture, really hating elves, being better than peasants, backstabbing, backstabbing, paranoia, and more. -References to both the show and pop culture Galore - Each character has four classes which act as a specialization of skills for battle - professional and custom made art sprites and skills. - 160+ different attacks with unique animations including 32 extremely powerful Limit attacks - 80+ enemies to fight (more will be added) -9 boss fights - 2 side stories -Visit the Guild in Morgoth to unlock new classes making battles more dynamic. -Sidequests (when added) will give accessories which will unlock new skills that any character could hypothetically use -Side Stories to pay homage to other cast members past and present, or have fun with characters currently -Sidequest and Side stories that feature other members of the Sidequest show. to foil the plot of the goody two shoes Ka-Ren Scojus, to tattle on the earth realm, i.e. your world. Play through the game to experience, what Voth has to offer, dragons, demons, and worst of all wraith squirrels. -As time goes on new content will be added including, the main story, side quests, side stories, enemies, allies, skills, puzzles, and secrets.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1743110/header.jpg?t=1656895194",
    "Price": 14.99,
    "Developers": "Angry-fromun",
    "Publishers": "Angry-fromun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1743110/ss_e8fd2349d1682d9f15f935ce49c6cf87cd647e3d.1920x1080.jpg?t=1656895194,https://cdn.akamai.steamstatic.com/steam/apps/1743110/ss_9648d7b5a450eb786c1699f4df960317da96cef3.1920x1080.jpg?t=1656895194,https://cdn.akamai.steamstatic.com/steam/apps/1743110/ss_f57cacae4eb84dbbdc65182ceea9797659879277.1920x1080.jpg?t=1656895194,https://cdn.akamai.steamstatic.com/steam/apps/1743110/ss_0e0f91d38b24d56791303df7fb66fc7cfe5a7793.1920x1080.jpg?t=1656895194,https://cdn.akamai.steamstatic.com/steam/apps/1743110/ss_45f4d0f8535400235df9f7c50be7a9572125aef1.1920x1080.jpg?t=1656895194",
    "Slug": "sidequest",
    "Meta Title": "Sidequest: Nov 22, 2021, Angry-fromun and Full Overview",
    "Meta Description": "Looking for information on Sidequest? Check out the release date (Nov 22, 2021), developer insights from Angry-fromun, and a complete game summary.",
    "Alt Text Image": "Official header image for Sidequest game - Steam 1743110",
    "Canonical URL": "https://gusku.site/game/sidequest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sidequest\", \"description\": \"Looking for information on Sidequest? Check out the release date (Nov 22, 2021), developer insights from Angry-fromun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Angry-fromun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Angry-fromun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1743110/header.jpg?t=1656895194\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}