{
    "AppID": 929450,
    "Name": "Sky Brawl",
    "Release date": "Oct 29, 2018",
    "About the game": "SkyBrawl is a VR-game for players that love the Defence genre. Stunning graphics, nice music and exciting gameplay will make you a part of incredibly realistic battle! Are you ready to dive in the 3D-fight in the comfort of your home? It's time to fight in a ruthless battle and defend your territory. The walls of the castle are strong, but there are too many enemies. Your main task is to save the crystals in the citadel and withstand the onslaught of invaders arriving simultaneously from 3 portals. Each level of complexity needs its own strategy. Think over tactics, choose your weapon and use different types of strikes, starting from single ones - a sword, a hammer, an ax, a crossbow to massive ones - a bomb or a castle cannon. To withstand the chain of attacks look for the different types of weapons on the battlefield and cause even greater damage to your enemies. If the enemy has advantage, teleport to the castle and help your folks with long-range weapons. The attack can be strengthened with cannon volleys or with the help of a freeze spell by clicking on the Magic Book on the balcony of the castle. Crystals are a non-renewable citadel resource. Protect them carefully from destruction and enemy's attacks. By approaching the crystal, you can reload your crossbow. To recover you from a bad battle one crystal must give all its power. SkyBrawl Features: High-quality graphics and the effect of real presence will make your feel completely plunged into the gameplay. Arsenal of short-range and long-range weapons Take a steel sword in your hands and lead the attack or arm yourself with the long-range weapons to cover your folks from afar! Friendly Fire mode Want it to be even more realistic? By activating the friendly fire mode, you will be able to cause damage not only to your enemies, but also to your allies. Various difficulty levels Does the game seem too simple to you? Get to the next level of difficulty! Starting from the medium level, try to crush the Skeleton Knight, who is twice your size! Day and night mode",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/929450/header.jpg?t=1540809010",
    "Price": 10.99,
    "Developers": "Rarebird Studio",
    "Publishers": "Rarebird Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/929450/ss_e69b6924dfa6ccb3c5f7bf1cb4466de52005e34d.1920x1080.jpg?t=1540809010,https://cdn.akamai.steamstatic.com/steam/apps/929450/ss_fad8c665565f9063021ca832292b1964f009de98.1920x1080.jpg?t=1540809010,https://cdn.akamai.steamstatic.com/steam/apps/929450/ss_7eae11b9b3afcf3f3b666451bd99bf1c927b2e8b.1920x1080.jpg?t=1540809010,https://cdn.akamai.steamstatic.com/steam/apps/929450/ss_b1cf284de17f49268633f5b17bc34569ee1b1cf1.1920x1080.jpg?t=1540809010,https://cdn.akamai.steamstatic.com/steam/apps/929450/ss_3569316f17dbc865ea5a1634947e451217d368af.1920x1080.jpg?t=1540809010",
    "Slug": "sky-brawl",
    "Meta Title": "Sky Brawl: Oct 29, 2018, Rarebird Studio and Full Overview",
    "Meta Description": "Looking for information on Sky Brawl? Check out the release date (Oct 29, 2018), developer insights from Rarebird Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Sky Brawl game - Steam 929450",
    "Canonical URL": "https://gusku.site/game/sky-brawl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sky Brawl\", \"description\": \"Looking for information on Sky Brawl? Check out the release date (Oct 29, 2018), developer insights from Rarebird Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rarebird Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rarebird Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/929450/header.jpg?t=1540809010\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}