{
    "AppID": 866770,
    "Name": "Spaceteam VR",
    "Release date": "May 21, 2020",
    "About the game": "DON'T PANIC! Even if this is your first space flight, it's ok, the ship will give you instructions, it's just that they might not apply to a control on the console in front of you. They might be for a control on a teammate's console so you will need to tell them, quickly, and probably loudly. If your Spaceteam is able to complete enough instructions successfully in a sector you will progress to the next, each sector becomes increasingly difficult and as the ship becomes harder to control and eventually, inevitably, you will explode. YOUR COMET INNOVATIONS TOOL KIT Floating within arms reach to your right and left are your trusty tools which will, hopefully, help you to deal with the myriad of threats and anomalies that take place onboard the ship. Repair Hammer – used to repair broken controls Ray-Gun – used to shoot enemy invaders Steri-Sponge 3000 – used to clean up the enemy invaders slime Fire Extinguisher – used to extinguish the unavoidable fires Airhorn – for use when instructed by the Ship SPACE IS A DANGEROUS PLACE Anomalies and aliens pop up when you least expect it, often adding to your workload and bringing your inexorable doom ever closer. Some that you may encounter include... UFOs Small flying saucers appear at the outer edges of the play area and shoot at player’s controls, setting them on fire. Player’s use their ray guns to shoot back! SLIMES Floating green alien monsters who spit goop onto player’s consoles, players need to wipe the goop up with the sponge and shoot the Slimes down with their ray guns. ROBOT FRIENDS The robots that live on the ship are friendly and try to be helpful. They are responsive to players – if you wave at them, they wave back, and don’t take kindly to being shot at. They play games with each other and explore the ship at their leisure during down-time. There are three ways to play Spaceteam VR: FULL VR MULTIPLAYER Up to six players, connected to the internet, in any popular VR headset join in a cooperative game of trying to avoid their binding doom. FACE TO FACE Up to six players play locally with at least one VR headset and connected smart devices, this offers an experience much like the original Spaceteam game. In the VR game each mobile player is represented by a robot. SINGLE PLAYER If you don’t have any friends around or there's no one online you want to play with head to the Practice Mode and you and two of our trusty robots will form your Spaceteam.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/866770/header.jpg?t=1654609769",
    "Price": 12.99,
    "Developers": "Cooperative Innovations",
    "Publishers": "Cooperative Innovations",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_f960f02275320dbf9c661e870828741487082c9f.1920x1080.jpg?t=1654609769,https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_060cad4dd32bd8435ef6964220098c043df9bce1.1920x1080.jpg?t=1654609769,https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_53faa57fba5ec3bafa921124754600e11719db46.1920x1080.jpg?t=1654609769,https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_cf69413e32cd3c9eb104621bb0dc5e02a384b668.1920x1080.jpg?t=1654609769,https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_637eb990b1a11189a953fdf5e6d3c771fbe21240.1920x1080.jpg?t=1654609769,https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_252e40e9132e469b349c905309580013b7cfed4e.1920x1080.jpg?t=1654609769,https://cdn.akamai.steamstatic.com/steam/apps/866770/ss_096b1a6e147d67a881c754c7568e2518e31701e9.1920x1080.jpg?t=1654609769",
    "Slug": "spaceteam-vr",
    "Meta Title": "Spaceteam VR: May 21, 2020, Cooperative Innovations and F...",
    "Meta Description": "Looking for information on Spaceteam VR? Check out the release date (May 21, 2020), developer insights from Cooperative Innovations, and a complete game...",
    "Alt Text Image": "Official header image for Spaceteam VR game - Steam 866770",
    "Canonical URL": "https://gusku.site/game/spaceteam-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spaceteam VR\", \"description\": \"Looking for information on Spaceteam VR? Check out the release date (May 21, 2020), developer insights from Cooperative Innovations, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cooperative Innovations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cooperative Innovations\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/866770/header.jpg?t=1654609769\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}