{
    "AppID": 335620,
    "Name": "Star Traders: Frontiers",
    "Release date": "Jul 31, 2018",
    "About the game": "Command your ship and crew as a space pirate, merchant, bounty hunter, and more in Star Traders: Frontiers – an epic space RPG from Trese Brothers Games. Venture forth into a massive open universe, rich with adventure and the lore of the Star Traders. Choose your path by assembling and commanding your custom crew and spaceship in a constantly evolving galaxy torn by internal strife, political intrigue, and alien threats. Will you fly as a pirate terrorizing shipping lanes, join the solar wars as a military captain, or track targets across the stars as a fearsome bounty hunter? Explore a rich, open universe: Discover endless procedurally-generated galactic maps, meet unique characters, and take on enemies to conquer the galaxy! Become an intergalactic captain: Take on the role of a spy, smuggler, explorer, pirate, merchant, bounty hunter, and more (33 jobs total)! Customize your own spaceship: Choose from more than 350 upgrades and 45 ship hulls to build your very own vessel to venture across the vast reaches of space. Assemble your wing fleet: Outfit your capital ship as a carrier and launch interdictors, bombers and shuttles into space combat against your enemy Assemble and tailor a loyal crew: Assign talents and equip specialized gear for every spaceship crew member. Experience an ever-changing narrative: Decide to make friends or foes with other factions and influence political, economic, and personal vendettas. Varied Difficulty Options! play with save slots to try out different builds or storylines or turn on character permadeath and enjoy classic roguelike experience Achievement Unlocks: accomplish story and challenge goals to unlock additional optional (but not better) content like new starting ships and new starting contacts. Or simply load the moddable version of the game to skip this entirely! Mold the crew by your choices: As you make decisions and set the tone for your ship, your crew will grow and change to match. Destroy enemy ships with all hands on deck and your crew will become more bloodthirsty and savage. Explore distant worlds and loot dangerous wastelands and your crew will become intrepid and clever ... or scarred and half-mad. First there was the Exodus – when survivors of a great war left the ruins of the Galactic Core behind in search of a new home in the stars. Scattered worlds were claimed on the fringe of the galaxy. Each pocket of survivors held on to an isolated set of worlds while trying to rebuild under the great law of Shalun. Three centuries later, technology has brought them back together again. Discovery of the hyperwarp has bridged what was once an unimaginable distance between far-flung colonies, long-lost families, and political factions. With that reunification has come great economic prosperity. The hyperwarp reestablished the transportation of cargo, goods, and technologies between the quadrants – but it has also brought great strife. Political rivalries have been rekindled, blood has been shed in age-old feuds, and the fires of war have been stoked. Amidst the political infighting, a ruthless revolution is rising – and the fervent explorers of the hyperwarp have awoken something that was better left asleep. Our very first game, Star Traders RPG, took hundreds of thousands of gamers on an interstellar adventure. Star Traders’ success and overwhelmingly positive reception helped to launch Trese Brothers Games. It was the adventures of our community’s star-crossed captains that put us on a trajectory to share more of our worlds, ideas, and dreams. We set out to capture the loneliness, bravery, and camaraderie of people living together in a spaceship sailing across the stars. It is with great pride that after releasing four other games in the Star Traders universe, we’ve created a sequel to the original Star Traders RPG. Step onto the bridge of your starship, take to the stars, and create your own story in Star Traders: Frontiers .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/335620/header.jpg?t=1656215143",
    "Price": 14.99,
    "Developers": "Trese Brothers",
    "Publishers": "Trese Brothers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_1add2f3c311dd7a8eff9e7e361be8b909f33be37.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_ea7b6ef95cbced90c6a8a65c76722876a582061a.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_505b2327c3fe0018fe8b1d8d7b114dfd5ab8b651.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_f3f1d980f3b5aef0367d65bdf38c7c2cf539e3a6.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_bf7e0085242c6f7929351eceb231bb2d13f49804.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_ea2c2be63e653465970570b78c29fba3e6f01fed.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_9c0717007e28a1bb5765b7625cdcf3d4b1b259cb.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_588d98af6a15b168f53615d5f40a0f0b9a375890.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_b3bd0384e4a2853beecd79991560ce6faccfce35.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_3c892dce8a31b83d55e1767e7373ba532cbed201.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_566ff5f3b5772b37afd1eeb452b8a5e36581dd31.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_7d9440f88a16cfb1b0a8e468ba7f57a9127d9d10.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_7b2d6f6fde105ab7e6021db757e58baef9130a23.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_5ad2aad19140ba499824b26d99812e3dfb709d9a.1920x1080.jpg?t=1656215143,https://cdn.akamai.steamstatic.com/steam/apps/335620/ss_703d5c66abe57fe6633439b79c9ad16ae7ae8fb1.1920x1080.jpg?t=1656215143",
    "Slug": "star-traders-frontiers",
    "Meta Title": "Star Traders: Frontiers: Jul 31, 2018, Trese Brothers and...",
    "Meta Description": "Looking for information on Star Traders: Frontiers? Check out the release date (Jul 31, 2018), developer insights from Trese Brothers, and a complete ga...",
    "Alt Text Image": "Official header image for Star Traders: Frontiers game - Steam 335620",
    "Canonical URL": "https://gusku.site/game/star-traders-frontiers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Star Traders: Frontiers\", \"description\": \"Looking for information on Star Traders: Frontiers? Check out the release date (Jul 31, 2018), developer insights from Trese Brothers, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Trese Brothers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Trese Brothers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/335620/header.jpg?t=1656215143\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}