{
    "AppID": 833990,
    "Name": "Stonewall Penitentiary",
    "Release date": "May 13, 2018",
    "About the game": "Stonewall Penitentiary is an indie murder mystery adventure that is presented in the visual style of graphic novels. It pays tribute to Agatha Christie's classic And Then There Were None and horror thrillers like Scream and Saw . Discover why you and six others were kidnapped by an unknown captor as you search an eerie prison and solve mind-bending puzzles to determine 'whodunit!' Will you survive Stonewall Penitentiary and its many mysteries, or will it be your tomb? Stonewall Penitentiary is a traditional 2D point-and-click first-person adventure game with a focus on exploration and narrative. It features beautiful graphic novel-style artwork and cinematic music. Explore an abandoned prison by navigating from room to room. Separate inventory, map, journal, and character screens are available at the push of a button. Stonewall Penitentiary plays like an interactive novel. Throughout the game, you will make choices that can affect the outcome. The game features all standard adventure game mechanics, including locations to explore, items to collect and use, characters to meet and interact with, and puzzles to solve--all without any major pixel hunting! You wake up. The last thing you remember is lying in bed at home. But you aren't home anymore. Looking around, you quickly establish four things: you're in a prison; your clothes are missing; your hands are tied; and you can't remember how you got here. You are William Thane, a middle-aged man struggling with depression and alcoholism. You, along with six others, are trapped in an abandoned prison, held captive by a sociopath obsessed with justice. But there's a catch: one of you is the killer! Can you escape? Success lies in your hands! In Stonewall Penitentiary , there are seven suspects...and any one of them could be the killer. Who is it? You'll have to use your detective skills to find out! Becca Ronni Becca is a no-nonsense lawyer who is guarded and mistrustful. She didn't wake up in the same place as the others. What is she hiding? Gerard Auberon Gerard is a hard-to-read loner, and he likes it that way. He doesn't say much, but he seems loyal. Or is that an act? Grayson Wilford Grayson is a take-charge businessman who isn't shy about barking orders. But is he authoritative or self-serving? Jessie Bartlett Jessie is a friendly, inquisitive teen girl who doesn't hesitate to let others know what she thinks of them. Does she have a dark side? Louis Algar Louis Algar is a D-level actor with a sick sense of humor and a huge ego. Could this all be a game to him? Sonny Peyton Sonny is a shy computer programmer who, despite being terrified, is quite resourceful. Why is he so helpful? William Thane Will is a down-on-his-luck painter who is currently unemployed and struggling with both alcoholism and depression. Throughout the game, you play as Will...but that doesn't mean he isn't also a suspect! EXPLORE an abandoned prison and uncover its dark secrets INTERACT with many interesting, fully-voiced characters SOLVE a multitude of challenging puzzles DISCOVER plenty of optional content that will test your detective skills--all without any major pixel hunting! ACHIEVE two different endings, depending on your actions (or inactions) UNLOCK all 27 achievements to view a special post-game bonus scene DETERMINE 'whodunit' in a 10+ hour story that pays tribute to Agatha Christie's And Then There Were None and horror thrillers like Scream and Saw",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/833990/header.jpg?t=1581811873",
    "Price": 11.99,
    "Developers": "Storycentric Worlds",
    "Publishers": "Unimatrix Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_fb6329c79dcdb9d6099011d48f0457cfef4947d6.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_fe1955bf42d99da9a498a7929500a44fab356f73.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_0412fe0103120dd3084e7af31c50098a3896686a.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_bd98a9c3e32dd57e6914756940b92d31e7cd9a76.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_f008af86921e1a639b21673962273ab7b908fe81.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_954844dc71742eb1bd06e5f8d8ffce57e226f9b8.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_0c9189324655631127074bb4d632d98c0f5798d8.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_1b819be6e6082805ffde74d1ddac42fb7f12b4d3.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_fa17588dac5ed4e1f758b0ac0805cc3f2eede81a.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_a8c8ce96a7ebd8fe8a5ec0e80c6ddaea7412a756.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_579aa0415f9f625ceb4d753234601d4c704815e2.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_a0b15e94e78bceecfd07a591761fb265628bdfd5.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_071f9a738c90f91ffb73fd0980b3c313c4355d3e.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_15790a01ec373252387dd50bd9183e30df284c25.1920x1080.jpg?t=1581811873,https://cdn.akamai.steamstatic.com/steam/apps/833990/ss_2942886cb903dafff28f7c99ec03f7389bb2322d.1920x1080.jpg?t=1581811873",
    "Slug": "stonewall-penitentiary",
    "Meta Title": "Stonewall Penitentiary: May 13, 2018, Storycentric Worlds...",
    "Meta Description": "Looking for information on Stonewall Penitentiary? Check out the release date (May 13, 2018), developer insights from Storycentric Worlds, and a complet...",
    "Alt Text Image": "Official header image for Stonewall Penitentiary game - Steam 833990",
    "Canonical URL": "https://gusku.site/game/stonewall-penitentiary",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stonewall Penitentiary\", \"description\": \"Looking for information on Stonewall Penitentiary? Check out the release date (May 13, 2018), developer insights from Storycentric Worlds, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Storycentric Worlds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unimatrix Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/833990/header.jpg?t=1581811873\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}