{
    "AppID": 1125340,
    "Name": "Tales of Lazo",
    "Release date": "Nov 11, 2019",
    "About the game": "It's a unique game in pixel graphics with different concepts and ways of interaction. There is no other RPG or Indie game like this. In Tales of Lazo, you will be telling the story of the brave hero Lazo. You can use any words in between to make the adventure truly sound like a story! Write perfectly the tales of Lazo to survive till the end of the level by following your instructions! That's how you will achieve the 'PERFECT' score. Different objects in the world can be used as anchor points that you can tell Lazo to approach. For example, you can instruct him to walk forward until he reaches a camp fire. Key Features: The character is controlled by certain keywords. STORY NOTES: the list of all keywords Hover over item: shows up its name Hidden words that will trigger certain bonus effects for Lazo. To get a 'perfect score' for a level, you will need to complete it in 'one story'. You can write the story step by step. After game completion, you can download the Full edition of your 'Tales of Lazo' Special Commands: Type BRAVELY + ATTACKED to see Lazo's Super Powers (It's a command, once per story) Main Options: Undo Last - Revert the story to make it better. Tutorial - the place to get help. Skills: 1. BLAST REQUIRES 2 SKILL POINTS fires a mid-range blast, dealing damage equal to 5 normal hits to the first enemy it hits 2. TYPHOON REQUIRES 3 SKILL POINTS Аttacks all enemies in front viciously, dealing continuous damage up to 10 normal hits 3. DZVER REQUIRES 3 SKILL POINTS summons a fiery beast that travels through the level and damages everything in its path, equal to 3 normal hits Each Skill has power stars (which are skill points). If you hit someone, you'll earn a skill point. Once you achieve all the stars, you can use the Skill. Note: If you find a magical elixir, you can use a Skill by your choice (without collecting all skill points). Symbols: Heart - Your life level (3 by default, with options to upgrade to 6). You have 2 to 5 more chances to retry a task after failing. Gold - the amount of all collectibles during the game. Task: Make a Perfect Score and create a story with a happy end (without losing any 'heart'). At the end you can get a full copy of Lazo's Tales. The character follows the instructions written in your story and acts accordingly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1125340/header.jpg?t=1576853566",
    "Price": 4.99,
    "Developers": "DYSTANT Games",
    "Publishers": "DYSTANT Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1125340/ss_d14b421b248216401770e21b7c780a755eb0251f.1920x1080.jpg?t=1576853566,https://cdn.akamai.steamstatic.com/steam/apps/1125340/ss_77a59456695f7d5d768afe194352fcd22ac6c3b6.1920x1080.jpg?t=1576853566,https://cdn.akamai.steamstatic.com/steam/apps/1125340/ss_499b66d45f66665a7ca336ed92feb3e97cb73b0d.1920x1080.jpg?t=1576853566,https://cdn.akamai.steamstatic.com/steam/apps/1125340/ss_b1dd4c22900a2c0ad32f65fc5264809ca41bf101.1920x1080.jpg?t=1576853566,https://cdn.akamai.steamstatic.com/steam/apps/1125340/ss_6ac3f1f55722ab1203ce7fcc6ed03d249fa920af.1920x1080.jpg?t=1576853566",
    "Slug": "tales-of-lazo",
    "Meta Title": "Tales of Lazo: Nov 11, 2019, DYSTANT Games and Full Overview",
    "Meta Description": "Looking for information on Tales of Lazo? Check out the release date (Nov 11, 2019), developer insights from DYSTANT Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Tales of Lazo game - Steam 1125340",
    "Canonical URL": "https://gusku.site/game/tales-of-lazo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tales of Lazo\", \"description\": \"Looking for information on Tales of Lazo? Check out the release date (Nov 11, 2019), developer insights from DYSTANT Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"DYSTANT Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DYSTANT Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1125340/header.jpg?t=1576853566\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}