{
    "AppID": 460960,
    "Name": "The Deed: Dynasty",
    "Release date": "May 10, 2016",
    "About the game": "The Deed is a game in which you must commit a murder and then, through a process of making the right choices and planting the appropriate evidence, convince the authorities of your innocence and somebody else's guilt. The stand-alone expansion Dynasty offers three new scenarios based on this original concept. Taking place in three different eras, each of these new scenarios allows you to explore the sordid ancestry of the Bruce family as you take control of a character who aims to commit a murder and escape free of suspicion by framing one of the other characters in the game. You will explore a 15th century English castle and a wild west frontier saloon, before finally returning to Dunshiel House fifty years prior to the events of the original game. Just as in The Deed, every decision you make can influence the outcome and lead to one of many possible endings, which are even more varied and numerous this time. There are many ways to do the deed, multiple pieces of evidence to use to your advantage and a wide selection of characters to frame for your crime. Explore the Setting This expansion aims to provide richer and more varied environments which immerse the player in the various historical time periods of the game, whether it's Medieval England under the reign of Henry IV, a violent frontier town in the Old West or a grand old estate in the Victorian era. Meet the Characters Each scenario contains a number of non-player characters, some of whom are based on real historical figures, and almost all of whom can be framed for the murder. The conversation system has been developed and improved, offering a greater amount of control for the player and more branching options which will lead to a more unique experience every time. Choose the Murder Weapon Choose from various murder weapons appropriate to the time period in which you find yourself, whether it's a medieval greatsword, a pair of household scissors or a good old-fashioned six-shooter. Figure out which method of murder is likely to point towards a character other than yourself. Plant the Evidence Items of evidence can be used in multiple ways to raise the suspicion of the authorities. Think carefully about which piece of evidence could be used to frame which characters, depending on where you plant it. Face the Authorities There's no question that the stakes are higher this time. Life in prison is one thing - but what about finding yourself on the headsman's block or strung up at the gallows for a grisly public execution? Life could be brutal in the olden times, and so could the death of a convicted criminal. Can you manage to do the deed while also avoiding such a terrible fate?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/460960/header.jpg?t=1631959444",
    "Price": 1.7,
    "Developers": "Pilgrim Adventures",
    "Publishers": "GrabTheGames,WhisperGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/460960/ss_25a9de8d7f4ef015b631f23013a0d43dea67a14f.1920x1080.jpg?t=1631959444,https://cdn.akamai.steamstatic.com/steam/apps/460960/ss_3f70ac103f455cb75f793eb78a69895b3625db3a.1920x1080.jpg?t=1631959444,https://cdn.akamai.steamstatic.com/steam/apps/460960/ss_dd4f439af47097be228270a6361297f2df885c5e.1920x1080.jpg?t=1631959444,https://cdn.akamai.steamstatic.com/steam/apps/460960/ss_932761457ed11a447b0ae7fb208b9ff1f9529b88.1920x1080.jpg?t=1631959444,https://cdn.akamai.steamstatic.com/steam/apps/460960/ss_f0bdac2c726e229006842b1f273c898b2485a2b9.1920x1080.jpg?t=1631959444,https://cdn.akamai.steamstatic.com/steam/apps/460960/ss_ba5ea53b4d9a1bd6cb2329280d1789b690b3f9e9.1920x1080.jpg?t=1631959444",
    "Slug": "the-deed-dynasty",
    "Meta Title": "The Deed: Dynasty: May 10, 2016, Pilgrim Adventures and F...",
    "Meta Description": "Looking for information on The Deed: Dynasty? Check out the release date (May 10, 2016), developer insights from Pilgrim Adventures, and a complete game...",
    "Alt Text Image": "Official header image for The Deed: Dynasty game - Steam 460960",
    "Canonical URL": "https://gusku.site/game/the-deed-dynasty",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Deed: Dynasty\", \"description\": \"Looking for information on The Deed: Dynasty? Check out the release date (May 10, 2016), developer insights from Pilgrim Adventures, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pilgrim Adventures\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GrabTheGames,WhisperGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/460960/header.jpg?t=1631959444\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.7, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}