{
    "AppID": 666630,
    "Name": "The Captives: Plot of the Demiurge",
    "Release date": "Oct 11, 2018",
    "About the game": "Characters The Captives: Plot of the Demiurge is an action-adventure game with a variety of carefully crafted levels. You will start by creating your character for each particular level. You can customize the character’s name, stats, weapon and appearance, giving each character you play a unique feel. After each level your personalized character gets added to the story’s cast of NPCs whom you can then talk to and interact with. As the story grows, so too does your cast of previous player characters. Setting The Captives: Plot of the Demiurge is set during a struggle between two opposing ideologies. After Prince Pico and the city-state of Volturno leave the anti-magic Tetrarchy to explore the alluring possibilities of the magic sciences, the other states band together to retake Volturno and stop whatever scheme Pico may have begun with his newly-acquired arcane knowledge... Story You play as convicted prisoners, drafted into the Tetrarch’s army to undertake missions against Prince Pico’s forces and collect intelligence concerning his masterplan. While each prisoner has their own individual personality and backstory, all share one goal: to complete their assigned objectives and earn their freedom. Customization When you create your character you will choose from a variety of weapons and distribute your skill points amongst four stats. Since your available skill points are limited, you will have to think carefully about how you invest them. The four stats of the Captives are: Health Health helps your character survive damage – pretty straight forward! A character with lots of health will allow you more room for mistakes while a character with little health will have to be more careful to avoid damage. Stamina Stamina is used for each action in the game: attacking, defending and dodging. A character with lots of stamina will be able to chain together many attacks while a character with little stamina will have to be more tactical and patient. Focus Focus prevents your character from being staggered by enemy attacks. A character with lots of focus will be able to shrug off damage while swinging away at enemies while a character with little focus should try to fight enemies one at a time. Movement Movement determines the speed at which your character moves. A character with a lot of movement will be able to dance around their foes while a character with little movement will have to time their aggression carefully. Playstyle All the numbers in The Captives are very low so that the difference between spending a single stat point in health over movement can change the feel of how your character plays significantly. It’s not possible to create a character that is good at everything. Because you will play as multiple characters you can experiment with different weapons and stats and explore what the combat has to offer within a single playthrough, instead of being locked into one playstyle for the entire game. Combat The combat of The Captives is real-time tactical action in the style of the Zelda or Souls games. Anticipation and timing is a consistent key to success, although each character you create will require different approaches depending on how you invested your skill points. Gameplay Modifiers Replay the game with special Challenge Runs, combinations of unique modifiers to the game. These include Roguelike Challenge which randomises your build each time you play through the dungeons and Soul Challenge which restricts the number of checkpoints in the game and changes how healing works. With a variety of individual modifiers you can also tweak the game to create your own challenge runs or make things a little easier if you get stuck. When does this game release? October 11th 2018",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/666630/header.jpg?t=1569227582",
    "Price": 15.99,
    "Developers": "Prism Game Studios Ltd.",
    "Publishers": "Prism Game Studios Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_de17b57a629fd38569040cd51e48281d283dce04.1920x1080.jpg?t=1569227582,https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_a66e727f2c015f3dfde3f41e6a6e428b690a7922.1920x1080.jpg?t=1569227582,https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_5e411ad35b5fe703250bda0b135c04b2944b2cd8.1920x1080.jpg?t=1569227582,https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_e34d1ec845efbc0cedf95c5f59543eaf5a1a3918.1920x1080.jpg?t=1569227582,https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_ac72626541db7772a4231e49496c22a83c063baa.1920x1080.jpg?t=1569227582,https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_c14e9c28fd2a6ef87e20b104bf15e47471ce189e.1920x1080.jpg?t=1569227582,https://cdn.akamai.steamstatic.com/steam/apps/666630/ss_915bd9264a00acdba90ceb90397bacdefdf90ac0.1920x1080.jpg?t=1569227582",
    "Slug": "the-captives-plot-of-the-demiurge",
    "Meta Title": "The Captives: Plot of the Demiurge: Oct 11, 2018, Prism G...",
    "Meta Description": "Looking for information on The Captives: Plot of the Demiurge? Check out the release date (Oct 11, 2018), developer insights from Prism Game Studios Ltd...",
    "Alt Text Image": "Official header image for The Captives: Plot of the Demiurge game - Steam 666630",
    "Canonical URL": "https://gusku.site/game/the-captives-plot-of-the-demiurge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Captives: Plot of the Demiurge\", \"description\": \"Looking for information on The Captives: Plot of the Demiurge? Check out the release date (Oct 11, 2018), developer insights from Prism Game Studios Ltd...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Prism Game Studios Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Prism Game Studios Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/666630/header.jpg?t=1569227582\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}