{
    "AppID": 1831870,
    "Name": "The Hotel",
    "Release date": "Jun 17, 2022",
    "About the game": "The Hotel - is a psychological horror thriller in which the player will have to face the evil living in a lonely hotel. But more importantly, you will have to decide what this evil is to you. Maybe it is just something to run and hide from, or maybe the nature of this evil is deeper than it seems at first glance. Synopsis The darkness.. the hopeless darkness seemed like an eternity to him. But now it was dissipating.The man was in a room in an unknown hotel. The room had no windows, and the closed door of the room separated him from the rest of the world.Why is he here, how long has he been here? Millions of questions create billions of assumptions. But the man whose prison has become a small hotel room doesn't need to know the answers. Because even knowing the answer to each of his questions, he can't change anything. A lonely man was waiting, not knowing what, in an unknown hotel room... suddenly there was a knock on the door. About gameplay: - Stress and Health Your character can go insane. A character's mental health depends on the stress he experiences. A character is stressed every time something paranormal happens. The more stressed the character is, the faster the character will go insane. Don't let this happen. - Every failure carries consequences Each of your failures, makes the inhabitant of the hotel stronger, and eventually, they can lead to permanent death. - The Hotel The hotel is constantly changing. Any action or movement of the camera, can cause the door through which you came to turn into a wall, and the place where a moment ago was a dead end, becomes a new path. - A questionnaire for each hotel guest Each guest of our hotel is invited to take a short questionnaire, in order to find an individual approach to everyone. Throughout the game, you will be asked to take a short survey. Should your answers be answered by the hotel, will your answers be honest, or should you refuse to answer? Everyone will have to make a decision. - The One Who Leads You An enigmatic observer, will communicate and comment on the player's actions with messages. Who is he, is he worth trusting, and what does he want? - Message from the author: Hello, my name is Konstantin and I'm the developer of The Hotel game. I want to say thank you to each of you for taking the time to play this game, this is my first experience and for me it is a very important project. Your opinions on it are very important to me too, each one of you. This is the only way for me to understand how good the project is and whether I need to do it further, and it will allow me to consider mistakes and become a better writer of games. For this reason, I would like to ask you to leave your feedback, even a small one, I really want to know your opinion. Thank you :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1831870/header.jpg?t=1657906660",
    "Price": 1.39,
    "Developers": "Constant_Art",
    "Publishers": "Constant_Art",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_4d02f7769d392c3e2a0e03d28053bbe7e9dfe216.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_e7c8b630e6fc26a1b99ccbba74469a5691c6dde0.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_c76bf93a3610286f55cb961fa7e95709d7fff822.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_e91e6fa0a0ad941f96f79eaebe394ab432704658.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_6228ea44ba57728178c6ec6191ee71e722724ca2.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_e8de8a2e498b9432b1362ec9c07cb6831acd643d.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_a5b861aa9832c61db37e0e708e83862fd273fbac.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_a27ec7aee233571c4dd8e5676073d5dfe914eaa0.1920x1080.jpg?t=1657906660,https://cdn.akamai.steamstatic.com/steam/apps/1831870/ss_be60fb7d8d246aa6a26375344de0c56f7780b23b.1920x1080.jpg?t=1657906660",
    "Slug": "the-hotel",
    "Meta Title": "The Hotel: Jun 17, 2022, Constant_Art and Full Overview",
    "Meta Description": "Looking for information on The Hotel? Check out the release date (Jun 17, 2022), developer insights from Constant_Art, and a complete game summary.",
    "Alt Text Image": "Official header image for The Hotel game - Steam 1831870",
    "Canonical URL": "https://gusku.site/game/the-hotel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Hotel\", \"description\": \"Looking for information on The Hotel? Check out the release date (Jun 17, 2022), developer insights from Constant_Art, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Constant_Art\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Constant_Art\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1831870/header.jpg?t=1657906660\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}