{
    "AppID": 1315980,
    "Name": "Tin Can",
    "Release date": "May 12, 2022",
    "About the game": "'In space, tech support can't hear you scream!' Get your hands dirty! 'What a mess! The oxygen generator refuses to start up...I hope it's just the fuse cutting down the power and not some kind of issue with the atomic pile!' All the systems inside your escape pod are made up of many different components, from fuses to air filters. They are all interconnected and have their own critical function. Listen to your body! 'My vision has been blurry for a while now and it's getting worse! I really need to find that leak before I pass out!' When all your systems are failing, in the dark, only the sound of your heartbeat and your shallow breathing will alert you of your imminent death. O², CO², atmospheric pressure, and temperature are realistically simulated for maximum immersion. Your life hangs by a thread...don't lose focus! 'These incomprehensible error codes again!? Where is the damn manual? This pod’s a mess! Ah! Here it is!' The manual inside your pod is filled with detailed information that could very well save your life. Plan ahead! 'What a view! Is it me or it is getting hot in here, though?' From asteroid fields to nebulae, these cosmic monsters will wreak havoc on your systems and won’t give you a lot of time to breathe... Good luck! Strong Points Manage pod systems down to every single component. Numerous systems which all have their own unique function and serve to ensure your survival. Every system is interconnected, from the oxygen generator to the emergency lights. Over a dozen different components, all having their own specific function and causing different problems when damaged. Ex : Defective buttons won’t trigger properly when pressed, while faulty electrical connectors won’t deliver enough power. Organic failures thanks to the simulated nature of resources and components inside the game. You will have to figure out what is wrong and retrace failures back to the source. Dismantle, swap and fix anything inside the pod. Realistic management of vital resources, such as oxygen, carbon dioxide, temperature and radiation. There are no arbitrary numbers here. The levels of these resources required for survival are based on real life! An onboard manual providing detailed information about your escape pod. Real medical symptoms instead of health bars. For example, hypoxia (lack of oxygen) will make you breathe faster and stronger, will make your vision blurry and will slow down your movements until you fall unconscious. Cosmic events will strike your pod and will have different types of impact on its systems. From flying near the surface of a star that will cause overheating to asteroid fields that will pierce your hull, you need to anticipate and deal with the situations as they come to avoid certain death. Background: As a random member of your colony's space program, you leave Mars aboard a large transport ship, only for its reactor to go critical in the middle of your journey to new horizons. All your time spent in the simulator did not prepare you for such a dire situation! Now, drifting in your escape pod, without any FTL capabilities, you realize that an easy way out was not included. Use your own wits to fix systems in a similar way you would fix and build your own PC, by swapping and fixing individual components. With a bit of luck, you might be able to finally find a safe haven.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1315980/header.jpg?t=1654521362",
    "Price": 19.99,
    "Developers": "Tin Can Studio",
    "Publishers": "Tin Can Studio,IndieArk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_e6050633746e3aa116a06a325b04c82638d339f0.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_d8aad0e4079913c390bd4f893ec52e5dcae60fa0.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_38272d5e00751bd40db3b2ccc79d5860d52bfb68.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_880f70c341b54b24a34894033febb09965996b79.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_039701bdcc7d658237afae3d80d23ea379400c1d.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_9b743c6136f0145ab97e99bb6a21f9459ed93bda.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_f1c55594dd7b011151be3a74d3b6b03f75fa2a46.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_c2d0d95fc4ceb8754468d13adee6122e340524ce.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_79a929f71cb1d28457432c10695148a73f090684.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_a085a496aa7605a505120feaa756e098280f8cb7.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_01af7f24efc1409dc02d91297f5b6b7015190792.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_76c1105f3ae22b9a8be8a22c287ee10411b7a644.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_04d230bc6cbf4228cf23200b6afe6ca89a9365ce.1920x1080.jpg?t=1654521362,https://cdn.akamai.steamstatic.com/steam/apps/1315980/ss_0e16c9fb3e0fbfa2c6f508488a6fa7924ca8ce11.1920x1080.jpg?t=1654521362",
    "Slug": "tin-can",
    "Meta Title": "Tin Can: May 12, 2022, Tin Can Studio and Full Overview",
    "Meta Description": "Looking for information on Tin Can? Check out the release date (May 12, 2022), developer insights from Tin Can Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Tin Can game - Steam 1315980",
    "Canonical URL": "https://gusku.site/game/tin-can",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tin Can\", \"description\": \"Looking for information on Tin Can? Check out the release date (May 12, 2022), developer insights from Tin Can Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tin Can Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tin Can Studio,IndieArk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1315980/header.jpg?t=1654521362\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}