{
    "AppID": 1420810,
    "Name": "Touhou Kaeizuka ～ Phantasmagoria of Flower View.",
    "Release date": "Apr 24, 2022",
    "About the game": "１．概要 東方Project 第九弾!! 「東方花映塚　～ Phantasmagoria of Flower View.」は対戦している振りをする弾幕シューティングです。ティンクルスタースプライツの皮を被った変な弾幕ゲームなのです。それだと思って手を出すとえらい目に遭うおまけ付き 妖精が蠢く幻想郷の、最も暢気な人間と最も花に浮かれた妖怪達の弾幕開花宣言。 敵を倒す前に倒されるな！　攻撃するなら避けろ！！ 幻想を見る人には、鋭い攻撃よりジェントルメンな回避が良く似合う。それはもう消極的な ＊このゲームには過激な弾幕シーンが含まれております 　小さなお子様や、弾幕アレルギーの方はアレしてください。 ２．バックストーリー ――幻想郷が蘇生した。 冬の白色は春の日差しに彩られ、幻想郷は完全に生の色を取り戻していた。 冬の間眠っていた色の力が目覚め、幻想郷を覆う。 花と同時に妖精達も騒がしくなる。 その異常な美しさの自然は、幻想郷に住む者全てを驚かせた。 彼女たちはいち早くその異変に気が付いた。 桜、向日葵、野菊、桔梗…… まだ春だというのに、一年中全ての花が同時に咲き出していたのだ。 多くの人間と全ての妖精は、自然からのプレゼントと受け取って暫くその光景に浮かれていた。 だが、幻想郷でもっとも暢気な人間は珍しくあわてていた。 「こんなに判りやすい異変じゃあ、早く解決しないといけないわ。 　じゃないと、私が怠けているってみんなに言っているようなもんじゃない！」 いつも通り、当てもなく勘で神社を飛び出したのだった。 幻想郷自体が蘇生した。 彼女たちも自然の一部。妖精の力は自然の力。自然には抗えないことを、皆知っていた。 　　　　　　　　　　　　　　　　　　　　東方花映塚　～ Phantasmagoria of Flower View. ３．プレイヤーキャラ紹介 楽園の素敵な巫女　博麗 霊夢（はくれいれいむ） 博麗神社の巫女さん。 境界に住む人間。空を飛ぶ程度の能力を持つ。 のんきなのか何も考えていないのか、そういう巫女さん。 異変が起こるとすぐに駆けつけ解決しようとするが、彼女の周りには異変が絶えない。 むしろ、異変を呼び込んでいるのではと疑わしい 　 基本性能 　移動速度　　　　　★ 　チャージ速度　　　★★★★★ 　低速移動速度　　　★ 　吸霊有効範囲　　　円形（大） 　特技　　　　　　　あたり判定が小さい 　チャージショット　博麗アミュレット 　ＥＸ攻撃　　　　　陰陽玉 　 備考 　チャージ速度の速さと広くて使い易い吸霊フィールドが最大の特徴。 ネックになる足の遅さを除けば、避けに徹し易く、最も使い易い。 反面、カード攻撃は比較的避けられやすい。 普通の魔法使い　霧雨 魔理沙（きりさめまりさ） 魔法使いさん。 魔法の森に住む人間。魔法を使う程度の能力を持つ。 幻想郷中を花で包んだ今回の異変も、魔法の森にはその効果が及ばなかった。 森にはそんな気の利いた植物など似合わないのである。 ただ、彼女は森の外で花を楽しんでいるのであまり関係はなかった。 　 基本性能 　移動速度　　　　　★★★★★ 　チャージ速度　　　★★★ 　低速移動速度　　　★★★ 　吸霊有効範囲　　　前方無限 　特技　　　　　　　ゲージが溜まる量が多い 　チャージショット　イリュージョンレーザー 　ＥＸ攻撃　　　　　アースライトレイ 　 備考 　直線的でスピードのある攻撃が特徴。 アースライトレイで画面が埋まると相手は手も足も出なくなる。 反面、チャージショットはちょっと使いづらい。 完全で瀟洒なメイド　十六夜 咲夜（いざよいさくや） 悪魔に仕えるメイドさん。 紅魔館に住む人間。時を操る程度の能力を持つ。 あか抜けた性格だが、余裕なのか惚けているのかちょっとずれた面も見せる。 花の異変に関しては、さほど危険を感じていない。 　 基本性能 　移動速度　　　　　★★★ 　チャージ速度　　　★★★★ 　低速移動速度　　　★★★★★ 　吸霊有効範囲　　　進行方向逆扇形 　特技　　　　　　　活性化した霊がその場で動かなくなる 　チャージショット　ジャック・ザ・リッパー 　ＥＸ攻撃　　　　　アナザーマーダー 　 備考 　自分のフィールド外から飛んでくるＥＸ攻撃がかなりいやらしい。 カード攻撃も時間を停止させる能力を持つ為、攻守共に優れている。 反面、吸霊はかなり癖があり慣れないと振り回されてしまう。 半人半霊の半人前　　魂魄 妖夢（こんぱく ようむ） 人間と幽霊のハーフさん。 冥界にある白玉楼の庭師。剣術を扱う程度の能力を持つ。 本来はお嬢様の剣の指南役である。 幻想郷は花でいっぱいであることを知り、ちょっと様子を見に出て きた。花に隠れて幽霊も多くなっていることに気付いたが、取りあえ ず見て見ぬふりをしていた。 　 基本性能 　移動速度　　　　　★★★★★ 　チャージ速度　　　★ 　低速移動速度　　　★★★ 　吸霊有効範囲　　　円形特大 　特技　　　　　　　剣で弾が消せる 　チャージショット　断迷剣 　ＥＸ攻撃　　　　　未断の魂 　 備考 　ゲージの消費もなく敵弾を消すことが出来る唯一のキャラ。 敵弾どころか殆どのＥＸ攻撃すら消せるので、かなり心強い。 反面、自分のＥＸ攻撃は大人しめ。 狂気の月の兎　　鈴仙・優曇華院・イナバ（れいせん・うどんげいん・イナバ） 月に住む兎。 赤い瞳は地上の兎の何倍もの狂気が宿る。 幻想郷中に花が咲いてから、永遠亭の兎が騒ぎ出した。これでは調べないわけにいかない、と言う事で調査に出た。 ついでにてゐが居なくなっていたのを連れ戻そうともしていた。 　 基本性能 　移動速度　　　　　★★★ 　チャージ速度　　　★★★ 　低速移動速度　　　★★★ 　吸霊有効範囲　　　回転瞳型 　特技　　　　　　　活性後の霊の上昇速度が速い 　チャージショット　マインドエクスプロージェン 　ＥＸ攻撃　　　　　メタフィジカルマインド 　 備考 　ＥＸ攻撃は近づくと爆発する攻撃で、横で爆発されるとかなり嫌らしい。 溜うちは若干癖があるが威力は高い。平均的に強い。 ４．操作方法 操作系統はキーボードFULL, キーボード一部、パッド（推奨）を１Ｐ、２Ｐ別々に選択できます。 ＊人対人の場合はパッド同士で対戦する事をおすすめします。 また、タイトル画面などや、ストーリーモード、及びマッチモードでCPUと戦う時（つまり一人で遊ぶ時）は、コンフィグに関わらず二つのパッド、キーボード(FULL)どちらでも操作できます。 パッドでの操作(PAD1, PAD2) 1P2P併せて同時に二つまで使用可能です。ボタンはキーコンフィグ可能。 ・レバー　　自機の上下左右の移動、カーソルの上下左右の移動 ・ボタン１　ショット、決定 ・ボタン２　クイックカードアタック、キャンセル ・ボタン３　低速移動＋吸霊展開　or　チャージボタン（キーコンフィグで切り替え可能） ・ボタン４　メッセージのスキップ ・ボタン５　ポーズ、ポーズ解除 キーボード(FULL) 一人でキーボードを全面使用します。 一人で遊ぶ場合や、パッド対キーボードで対戦したい場合に使用します。 ・カーソルキー　or　テンキー　自機の上下左右の移動、カーソルの上下左右の移動 ・Ｚキー　ショット、決定 ・Ｘキー　クイックカードアタック、キャンセル ・Ｓｈｉｆｔキー　低速移動＋吸霊展開　or　チャージボタン（キーコンフィグで切り替え可能） ・ＥＳＣキー　ポーズ、ポーズ解除 ・Ｃｔｒｌキー　メッセージのスキップ キーボード(LEFT) キーボードの左側だけで操作します。 パッドが一つもない状態で対戦したい場合、仕方が無く1P側で使用します。 ・Ｔ Ｒ Ｆ Ｖ Ｂ Ｎ Ｈ Ｙキー　自機の上下左右の移動、カーソルの上下左右の移動 ・Ｚキー　ショット、決定 ・Ｘキー　クイックカードアタック、キャンセル ・Ｓｈｉｆｔキー　低速移動＋吸霊展開　or　チャージボタン（キーコンフィグで切り替え可能） キーボード(RIGHT) キーボードの右側だけで操作します。 パッドが一つもない状態で対戦したい場合、仕方が無く2P側で使用します。 ・テンキー　自機の上下左右の移動、カーソルの上下左右の移動 ・↓キー　ショット、決定 ・→キー　クイックカードアタック、キャンセル ・←キー　低速移動＋吸霊展開　or　チャージボタン（キーコンフィグで切り替え可能） チャージタイプについて チャージショットと低速移動の操作方法は、オプションで変更する事が出来ます ・Slow（デフォルト）　Slowボタンを押すと低速移動、ショットボタン押しっぱなしでチャージ ・Charge　ショットボタン押しっぱなしで低速移動、Chargeボタンを押すとチャージ（その間ショットは出せません） ６．対戦ルール １．勝敗判定 　敵弾に当たると画面上部の体力が減り、先に０になるとラウンド終了となります。 後一回ミスをすると必ず負けとなる時に警告が出ます。警告なしで体力が０になる事 はありません。また、体力は回復しません。 　ストーリーモードの場合は、この上に残機が存在します。一回負けると残機が減り、 ラウンドを切り替えてもう一度再挑戦します。残機が０の時に負けるとゲームオーバーです。 　マッチモードの場合は、２本先取で勝ちとなります。 ２．プレイヤー基本動作 　ショットで次から次へと来る妖精を倒します。 　妖精の爆発は、再び妖精を倒したり、白弾を消すことが可能ですので、敵弾の多い 所で倒すようにすれば、攻撃と防御を同時に行う事が出来ます。 　また、吸霊展開ボタンを押すと移動速度が遅くなります。 　ショットボタンを押しっぱなしにするとチャージ行動を取ります。カードアタック は、周りの敵弾を消す効果もありますので、惜しまず使っていくことが勝利への鍵と なります（ただしゲージを消費します） ３．相手への攻撃 　相手への攻撃は以下の物があります。 ・弾幕アタック ・幽霊アタック ・ＥＸアタック ・カードアタック ・ボスカードアタック 　 ３－１．弾幕アタック 　　妖精を倒したり、白弾を妖精の爆風で巻き込むと相手に白弾を送り込む事が出来ます。 　白弾は同じように送り返されることもありますが、何度か送りあっているうちに 　大型弾に変化することがあります。 　　大型弾は送り返し不可能です。 　 ３－２．幽霊アタック 　　妖精を連続で爆破させたり、幽霊を倒すと敵に鳥形の幽霊を送る事が出来ます。幽 　霊は硬くて、ショットで打ち落とすのは困難な上、爆風で白弾を消すことが出来ません。 　　ただし、吸霊フィールドを当てると幽霊が活性化して人魂型になり、その場のとど 　まろうとします（自爆霊） 　　活性化するとショットで簡単に撃ち落とせるようになり、爆風も妖精と同様の効果 　を持つようになります。その代わり一定時間で落とさないと自爆してしまうので注意。 　 ３－３．ＥＸアタック 　　主に大きな幽霊を倒したりしていると、キャラ固有の特殊攻撃を送り込むことが出 　来ます。 　　この攻撃の量や効果はキャラクター毎まちまちですが、他の攻撃に比べ強力なもの 　ばかりです。 　 ３－４．カードアタック 　　ゲージが二目盛り以上溜まっているときに、そのレベルまでチャージするとゲージ 　を消費し、カードアタックが発動します。この攻撃はキャラクタ固有の技で、効果も 　難易度も様々です。 　　２目盛りで反撃を受けることのあるカードアタック。３目盛りで反撃を受けること 　のない強力なカードアタックを発動します。 　　ゲージの消費量はそれぞれ１目盛り、２目盛りです。 　＊また、これらの攻撃には緊急回避の効果もあり、自分の周りの敵弾、幽霊、ＥＸ 　　攻撃をかき消す事が出来ます。 　＊クイックカードアタックについて 　　クイックカードアタックボタンを押すと、ゲージを完全に消費し、瞬時にカードア 　　タックを発動出来ます。またレベルを選ぶ事は出来ず、その時の最大のレベルのカ 　　ードアタックを発動します。 　　敵弾に囲まれてしまった時などにほどよく使ってください。 　 ３－５．ボスカードアタック 　　ゲージをマックスまで溜めるか、スペルポイントを10万、30万、50万以上まで溜め 　ると、相手フィールドに自分の幻影を送り込む事が出来ます。 　　かなり強力な攻撃を自動的に仕掛けますので、積極的に送り込んでいきましょう。 　　また、ゲージを消費してで発動させた場合、自分フォールドの敵弾もほぼ全て消す 　事が出来ます。 　＊同時に二体以上送ることは出来ません。 　＊ボスリバーサル 　　自分のフィールドにボスが送り込まれている場合、ボスを発動するとそのボスを倒 　　してさらに送り返すことが出来ます。 ４．コンボ 　左上にコンボ表記があります。 　ショットで妖精を一匹倒すと1Hitです。その爆風で妖精を倒すと2Hit、白弾を５発 巻き込むと2+5=7Hitです。このとき、ショットで倒さずに連続で倒した数（白弾を巻 き込んだ数）がHit数になります。 　Hit数が増えると、スペルポイントの増加が早まったり、敵に送る白弾、幽霊、ＥＸ の数が増加します。 　目指せ999Hitオーバー！ ＊ショットで倒したり、ダメージを喰ったりするとヒットは０に戻ります。 ５．スペルポイント 　左上のコンボ表記の隣にある６桁の数字がスペルポイントです。 　コンボを繋いだりすると増加します。この得点は、コンボが途切れても一定時間内 に次のコンボを開始すると、さらに継続して増加させることが可能です。 　このスペルポイントが10万,30万,50万を超えると、自動的にボスカードアタックが 発動します。 　スペルポイントの継続時間が終了したり、ダメージを喰らったりすると、このポイ ントはそのままスコアに加算されます。 ＊ダメージを喰らった瞬間、スペルポイントはリセットされます。 ＊スペルポイントが999990を超えると、その時点で増加は停止し、1Hitに付、5000点 　スコアに加算されます。弾幕開花宣言。 ６．妖精リリー現る 　長期戦になったり試合に変化がなくなってくると、自分、相手フィールド両方に、 春を伝える妖精「リリーホワイト」が出現します。 　リリーホワイトは大型弾＋白弾を、ばらまくだけばらまいて去っていきます。迷惑 です。 　ショットで撃ち落とす事も可能で、撃ち落としに成功すれば大量にＥＸ攻撃を相手 に送ることが出来ます。 　倒しても逃げられても、何度でも出てくるやっかいな特殊妖精です。 ７．アイテム 　リリーやボスをショットで撃破すると、アイテムが出ます。 ・点　　……　スペルポイントが上昇する ・弾　　……　破壊不能の敵弾を相手に送る ・ＥＸ　……　ＥＸを相手に送る ・Ｇ　　……　ゲージがマックスまでたまる ８．エクステンド ストーリーモードでは得点でプレイヤー数が増えることがあります。 ストーリーでは、1000万、3000万、5000万、7000万、9000万で増えます。 エキストラでは、500万エブリで、4000万まで増えます。 ７．ヒント カード攻撃は惜しまない！ 　２目盛り以上溜めると発動できるカード攻撃は、敵弾を消すと同時に敵に攻撃が出来ます。 ゲージの回復は速いので、危なそうになる前に積極的に使っていきましょう。 　また、カード攻撃にはレベルが存在します。使えば使うほどレベルが上がり強力な 攻撃となるので、がんがん使うことが勝利への道です。 クイックカードアタックよりチャージしてカードアタック！ 　クイックカードアタックを使うと、次のカードアタック分のゲージが溜まるまで かなり時間を要します。その間ピンチに陥るので、クイック以外どうしようも無くなる前に、 予め敵弾を消していくようにしましょう。 　特に長期戦になるとピンチの連続なので、クイックを使用するとその後死の危険が 高まります。 幽霊の活性化で白弾を自在に消せ！ 　鳥形の幽霊はひっきりなしに飛んでくるので、これを好きな場所で活性化させて、 分厚い弾幕に重なった時に倒しましょう。これで、弾幕の壁に穴が開くので、容易に 回避出来ます。 　ただし、活性化させた幽霊は確実に倒すようにしないと、自爆の手痛い攻撃を喰らいます。 自分より後ろや横の幽霊を活性化させるときは要注意。 ワーニングカットインの時に逃げ道を探せ！ 　一瞬停止するカットインは、邪魔そうに見えて重要な間です。その瞬間で活路を見 いだせるようになれば、超人避けも不可能では無いでしょう。 パニック症候群は負け組 　時として通常のＳＴＧではあり得ないような、分厚く不規則な弾幕が飛んでくる事 があります。こういうときに、一瞬でも無理だと思うとまず勝てません。 　こういうときは逆に反撃のチャンスです。白弾を大量に送り返すチャンスであり、 送り返すとスペルポイントもたまり、ボスを送る事も出来、一気に勝利への道が見え てきます。 　ゲージも無く、妖精も幽霊も居ない状態でも気合いで避けれてしまう人間も居るので、 　そういう人を見かけたら尊敬しても良いかもしれません。 白弾、大型弾、幽霊は実はランダムではない！ 　白弾も大型弾も幽霊も、完全なランダムばかりではなく、それぞれある法則に則って 飛ぶ角度、速度が決定されます。 　全体を見て、その傾向が何となく掴めると、一気にマスターへの道が見えてきます。 自分の周りばかり見ているのではなく、全体を何となく意識してみると、もうパニッ クは起こさないでしょう。 ラウンドの切り替わりに注意！ 　長期戦になると１ラウンドで燃え尽きる人もいます。２ラウンド目からは、最初から 若干難易度が上がり、どんどんと短期決戦になりますので、ここで気がゆるむと負けます。 対戦中はポーズは厳禁！ 　このゲームは、かなりテンポ良く次の手を見ないといけないゲームなので、 連続で遊ぶことでどんどんと自分のクロックアップが出来ます。 　ここで勝手にポーズをかけると、相手が調子狂わされたと言って険悪ムードになり、 後に殺人にまで発展しかねないので、自分勝手なポーズは極力避けましょう。 ストーリーモードのCOMも人（妖怪）の子 　時折、COMにこてんぱんにやられることがあります。すぐに次のラウンドになるわけですが、 もう勝てそうにありません。そう思うとがっかりです。 　実はCOMも人の子、連続で勝ち続けるとやっぱり疲れます。COMが油断した所を付けば、 次のラウンドはあっさりと勝てたりしますので、諦めずに再挑戦しましょう。 マッチモードのルナティックのCOMは遊ばない 　アレと対戦するとはっきり言ってなかなか死んでくれないので結構嫌な気分になり ます。ＳＴＧの腕が有り余っている方以外は、やめておいた方が無難です。 　また、それでもCPUが弱すぎる、と感じたら対戦時ですね。",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1420810/header.jpg?t=1650869433",
    "Price": 14.99,
    "Developers": "上海アリス幻樂団",
    "Publishers": "Mediascape Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_808674706d079b10593e4f7508542ab5af6243f1.1920x1080.jpg?t=1650869433,https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_f7e392de794b73129c41616215383047b11a196a.1920x1080.jpg?t=1650869433,https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_384534db6f49e920d65a811a5094715db5e698d7.1920x1080.jpg?t=1650869433,https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_eb784ae6a6aa02e756b209bd3911f6d5c7223f42.1920x1080.jpg?t=1650869433,https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_db70eefced5b6901738e61678e8e1ef5a5f7b7de.1920x1080.jpg?t=1650869433,https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_b883f257d5a77dd608d3658fd2e03a0b2fcc1187.1920x1080.jpg?t=1650869433,https://cdn.akamai.steamstatic.com/steam/apps/1420810/ss_38ab16ee679da1e38a140aa5df77d74e01ce9907.1920x1080.jpg?t=1650869433",
    "Slug": "touhou-kaeizuka-phantasmagoria-of-flower-view",
    "Meta Title": "Touhou Kaeizuka ～ Phantasmagoria of Flower View.: Apr 24,...",
    "Meta Description": "Looking for information on Touhou Kaeizuka ～ Phantasmagoria of Flower View.? Check out the release date (Apr 24, 2022), developer insights from 上海アリス幻樂団...",
    "Alt Text Image": "Official header image for Touhou Kaeizuka ～ Phantasmagoria of Flower View. game - Steam 1420810",
    "Canonical URL": "https://gusku.site/game/touhou-kaeizuka-phantasmagoria-of-flower-view",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Touhou Kaeizuka \\uff5e Phantasmagoria of Flower View.\", \"description\": \"Looking for information on Touhou Kaeizuka \\uff5e Phantasmagoria of Flower View.? Check out the release date (Apr 24, 2022), developer insights from \\u4e0a\\u6d77\\u30a2\\u30ea\\u30b9\\u5e7b\\u6a02\\u56e3...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e0a\\u6d77\\u30a2\\u30ea\\u30b9\\u5e7b\\u6a02\\u56e3\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mediascape Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1420810/header.jpg?t=1650869433\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}