{
    "AppID": 1992730,
    "Name": "Trail of Ayash: Prologue Demo",
    "Release date": "Jun 13, 2022",
    "About the game": "About The Game | This Project is Developed by Two People Trail of Ayash is an innovative and exciting open world game focused on the indigenous people, their sturggles and their stories in the Pre-Columbian era. Our world is a unique version of the western land dominated by the myths and legends of Its Inhabitants. Various tribes interact with one another, engaging in diplomacy, war, and expansion. We have crafted an open world rife for exploration and conflict . You will interact with the various tribes of indigenous people. That alone can make for a compelling gaming experience, but there is something more. Something much darker that lurks in the forests and wilderness. In the corner of your eye and the slight cracks in the earth. They hunger. Also, to survive alongside your fellow tribals , You will have to battle the stuff of nightmares. Creatures born from the minds of men and spirits that terrify the soul talked about in hushed voices around campfires by storytellers and shamans. The world of Ayash they are very real and the monsters of this world must be fought lest you lose your life or your soul to beasts both natural and profane. List Of Included Monsters: Djiein Chenoo Bloodflies Djien Kutze-ce-te-ut Saumen Kar Wendigo Werebear Werewolf Wudie Tizheruk Walking Head Tsul Kaulu Cavemen All of them come with their characteristics and lifestyle . No two types of the enemy will behave the same. You must change your tactics to survive the everchanging world around you. You are prey. Become the hunter or die alone and forgotten. Unique sacred medicine implemented into healing system. Our accuracy doesn't stop at simulating AI and environments. We have incorporated the rituals of indigenous into our gameplay mechanics. Quests, Myths, Ordeals Quests are basing on native legends, myths, and ordeals. Unnatural forces dominate the world. You have the opportunity to save it, or perhaps you crave domination yourself? You can also subjugate the land becoming a worst beast than anything else in the world, or maybe You want to get by. You want to survive in our open questing system anything is possible. Be who You want to be. Do you get a nearby friendly tribal to help you build a bridge over a lake? He may ask you something in return but be wary. Not all tribes are friendly. Some beasts walk and talk in the shape of men as part of our historical accuracy we have to acknowledge the darker part of native culture. Some tribes engaged in cannibalism, sacrifice, and executions . These all exist in the world and are hostile towards you. Do you fight them or sneak around them? Do you commune with their spirits to hide from them? It's up to you, but you may die in the attempt. You will not be missed. The Plot Become Ayash . Once a respected member of his tribe until a trusted family member betrayed and framed him. Alone and without aid Ayash must redeem himself amidst the intrigue of tribal society and the monsters lurking in the wilderness or perhaps avenge himself on those who abandoned him. The story is open-ended. You control Ayash; You decide who will live and who will pay, You choose how Ayash fairs on his trail. Join our to share your ideas that will influence the final shape of the game. Discord Server",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1992730/header.jpg?t=1655136990",
    "Price": 0.0,
    "Developers": "Nowsky",
    "Publishers": "RockGame S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1992730/ss_0482282692b746f1f0111fa350c0a30801a03855.1920x1080.jpg?t=1655136990,https://cdn.akamai.steamstatic.com/steam/apps/1992730/ss_bfb5ea6d2ac636675f3a96d07db067549492d80c.1920x1080.jpg?t=1655136990,https://cdn.akamai.steamstatic.com/steam/apps/1992730/ss_998870882b9a9d91f204c842ce36399ff6075c83.1920x1080.jpg?t=1655136990,https://cdn.akamai.steamstatic.com/steam/apps/1992730/ss_c4b76e484e0601a74bb63c60ee51f60cc384223e.1920x1080.jpg?t=1655136990,https://cdn.akamai.steamstatic.com/steam/apps/1992730/ss_1464e7dce905687ef5fdba3f5462c554e102034a.1920x1080.jpg?t=1655136990",
    "Slug": "trail-of-ayash-prologue-demo",
    "Meta Title": "Trail of Ayash: Prologue Demo: Jun 13, 2022, Nowsky and F...",
    "Meta Description": "Looking for information on Trail of Ayash: Prologue Demo? Check out the release date (Jun 13, 2022), developer insights from Nowsky, and a complete game...",
    "Alt Text Image": "Official header image for Trail of Ayash: Prologue Demo game - Steam 1992730",
    "Canonical URL": "https://gusku.site/game/trail-of-ayash-prologue-demo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trail of Ayash: Prologue Demo\", \"description\": \"Looking for information on Trail of Ayash: Prologue Demo? Check out the release date (Jun 13, 2022), developer insights from Nowsky, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nowsky\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RockGame S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1992730/header.jpg?t=1655136990\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}