{
    "AppID": 733710,
    "Name": "YOUFIGHT",
    "Release date": "Nov 2, 2017",
    "About the game": "A unique and innovative video game thanks to integrated reality! Discover integrated reality with this game in 2D based on your videos which allows you to play your own character! Keep your real appearance and become an outstanding boxer in the game thanks to an automated video cutting technique which allows to show some animations from your video capture. For the first time, be in a fighting video game and compete against real fighters! Challenging true champions has never been easier... They are all gathered in the YouFight game, ready to face you! Face or select a real fighting sport expert in this epic game! Create your own legend... You too, defy a lot of champions by entering the ring with your own appearance! Meet fighters from every (most) combat discipline(s) and choose your favorite! Disciplines represented the game : French boxing, English boxing, Thai boxing, but also taekwondo, krav-maga, Kali, Jeet Kune Do and many others. Combat sports clubs will challenge each other through their own experienced fighters. Choose one of your city’s clubs and challenge your neighbors! Dreaming big? Select your favorite champion and knock out the most serious rivals! In this game gathering all fighting disciplines, defend your favorite! A lot of them are represented: French boxing, English boxing, Thaï boxing, Muay-thaï, K-One, Full Contact, Taekwondo, Kung-fu, Jeet Kune Do, Krav-maga, Kali. Fighting sport clubs can organize competitions. ANALYSE AND REPRODUCE Keep your real appearance and become an outstanding boxer in the game thanks to an automated video cutting technique which allows to show some animations from your video capture. &gt; Step 1 : Film yourself in 30 seconds with a Smartphone, a webcam or another camera by doing the punches required for the game, by following the video tutorial given below &gt; Step 2 : Download the video in the game thanks to an integrated animated editor, match each video image with the punches asked in YouFight. In a few minuts, your fighter produced from your video is ready to challenge the best ones! &gt; Step 3 : Play! Defy your friends and the others fighters, locally or online!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/733710/header.jpg?t=1618846880",
    "Price": 0.0,
    "Developers": "OPENCAP STUDIO",
    "Publishers": "OPENCAP STUDIO",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/733710/ss_d19670b47e3d8ce1a317c8f508f198075f513dc9.1920x1080.jpg?t=1618846880,https://cdn.akamai.steamstatic.com/steam/apps/733710/ss_ad1ffb92cce4819fe2b7c837ebf75e4303b75ea4.1920x1080.jpg?t=1618846880,https://cdn.akamai.steamstatic.com/steam/apps/733710/ss_02a21a89d0a4413085598ec4ebac47d3f018b95f.1920x1080.jpg?t=1618846880,https://cdn.akamai.steamstatic.com/steam/apps/733710/ss_6d16f4be62f56f762144ca17b847d6273ca4aba0.1920x1080.jpg?t=1618846880,https://cdn.akamai.steamstatic.com/steam/apps/733710/ss_377e94b5300795c12eb7677c4471eb22a095dd28.1920x1080.jpg?t=1618846880",
    "Slug": "youfight",
    "Meta Title": "YOUFIGHT: Nov 2, 2017, OPENCAP STUDIO and Full Overview",
    "Meta Description": "Looking for information on YOUFIGHT? Check out the release date (Nov 2, 2017), developer insights from OPENCAP STUDIO, and a complete game summary.",
    "Alt Text Image": "Official header image for YOUFIGHT game - Steam 733710",
    "Canonical URL": "https://gusku.site/game/youfight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"YOUFIGHT\", \"description\": \"Looking for information on YOUFIGHT? Check out the release date (Nov 2, 2017), developer insights from OPENCAP STUDIO, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"OPENCAP STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OPENCAP STUDIO\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/733710/header.jpg?t=1618846880\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}