{
    "AppID": 805710,
    "Name": "Alien Worms Invasion",
    "Release date": "Mar 12, 2018",
    "About the game": "overview Alien Worms Invasion is a game of futuristic exploration and tower defense. In the game, you can explore unknown areas and build bases and units to defense the attack of the worms which would be killed in the end. At the same time, you can produce various kinds of soldiers by rescuing the tripped people in the wild or building the armies in order to protect the base and even to attack the worms’ nests. The longer time you play the game for, the stronger the enemies will be in the game. Whether you can finish the tasks in the game depends on how to balance the power between the defense and the attack. Background setting With the high development of the society in the future, the earth is invaded by the worms.The human beings fought fiercely and were defeated finally. With the help of the armies, the survived people flee from the earth to the outer space for an unknown exploration. The main character was once a captain of a spaceship. He gradually takes revenge of the worm during the flee with his men in the spaceship. Units introduction Refugees The human beings captured by the worms can be rescued to become the civilians. Civilians The plain human beings can be armed by producing armies to become any kind of soldiers. Engineering Airplanes the Engineering Airplanes can be transformed into the energy of the trees in the worms forests during the battle and can be used to upgrade any kind of buildings. Soldiers soldierscan be armed to be army soldiers in the military and are the basic units of attack. They can attack the nearby worms.At the same time they can attack the worms near the base in order to obtain energy. Cannons Cannons can be produced by the armory and can do great harm to the worms. Mecha commanders The Mecha commanders can defense the attack of the worms and do great harm to the worms with the help of the mechas produced by the base. They can also lead the armies to attack the worms. ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/805710/header.jpg?t=1523935983",
    "Price": 9.99,
    "Developers": "Mímir Studio",
    "Publishers": "Mímir Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/805710/ss_2b461ac7ef9aa5e512864a892c6e2f98869e3b3a.1920x1080.jpg?t=1523935983,https://cdn.akamai.steamstatic.com/steam/apps/805710/ss_31944060ff221e549522b49d10599a8ffd2ee8f6.1920x1080.jpg?t=1523935983,https://cdn.akamai.steamstatic.com/steam/apps/805710/ss_f34bfe93e5f0360aad640b9e446045c66b5d45a7.1920x1080.jpg?t=1523935983,https://cdn.akamai.steamstatic.com/steam/apps/805710/ss_d4e7e77d93e5a24fe1c48d16a7c8e2bcd70647fa.1920x1080.jpg?t=1523935983,https://cdn.akamai.steamstatic.com/steam/apps/805710/ss_2a3d532b409a7a85552b9625f19abd675d4ad7c7.1920x1080.jpg?t=1523935983",
    "Slug": "alien-worms-invasion",
    "Meta Title": "Alien Worms Invasion: Mar 12, 2018, Mímir Studio and Full...",
    "Meta Description": "Looking for information on Alien Worms Invasion? Check out the release date (Mar 12, 2018), developer insights from Mímir Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Alien Worms Invasion game - Steam 805710",
    "Canonical URL": "https://gusku.site/game/alien-worms-invasion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alien Worms Invasion\", \"description\": \"Looking for information on Alien Worms Invasion? Check out the release date (Mar 12, 2018), developer insights from M\\u00edmir Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"M\\u00edmir Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M\\u00edmir Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/805710/header.jpg?t=1523935983\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}