{
    "AppID": 1707890,
    "Name": "Bacteria Wars",
    "Release date": "Aug 25, 2021",
    "About the game": "Command your Bacteria in a war against the Cell Defense Force! Invade their territory, conquer their bases, and turn their own footholds against them in a world where your Units are your only resource! Fight battles across the a variety of unique maps where attacks could come from any direction, and know that any battle could be the difference between victory and death! Oh, but it's not just mighty CDF you have to worry about. You must hold your ground against the armies of your fellow Bacteria, watch your back during the Late-Game event, and pray it isn't the Zombie Cell option that you selected! Key Features: Your Units Are Your Greatest (And Only) Resource: Each player receives a continuous income of resources based on the number and type of units they have in their army. As your army expands, so too will your resource production... but be warned that the loss of your units will reduce your resource production, and your stockpile is limited in quantity. Victory is therefore not likely to be achieved by simply throwing your units – your precious resources – at the enemy! Mobile Bases: Take the phrase 'Adapt or Perish' to the next step! Static immobile bases are easy targets in a maze of tunnels that are constantly being patrolled by CDF forces. Every unit under your control may be moved around at will. Make good use of this newfound flexibility! Late-Game Stage: Spice up the late-game experience with a customizable Late-Game Event! From a fifteen minute rush to a one hour long-play, and from the entrance of a fourth player to the arrival of a nigh-unstoppable zombie plague, this event will surely mix things up. Up the difficulty and atmosphere by enabling Dark Mode, which disables all ambient light when the Late-Game Event starts. Upgrade and Specialize Your Units: Each Unit can be upgraded to better perform certain tasks, from increased detection range or faster production, to becoming an unstoppable juggernaut! Customizable Unit Formations: Adapt your units' formation to any situation on any terrain. If you're surrounded on all sides, will you circle up into a defensive ball, or bunch together into a devastating hammer and blow through to relative safety?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1707890/header.jpg?t=1641691103",
    "Price": 9.99,
    "Developers": "Patrick McGuinness",
    "Publishers": "Patrick McGuinness",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_34140d38966486510f91d811bba60ab8b02e00c2.1920x1080.jpg?t=1641691103,https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_28f7cd85c015a4682e873821380e1bbf8eb9b6ef.1920x1080.jpg?t=1641691103,https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_1c33318d6a9c2641c783d5298d23da185fca0735.1920x1080.jpg?t=1641691103,https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_6fe7b13ad9d77994386fd25fd5a777c9fe140ba6.1920x1080.jpg?t=1641691103,https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_53960a3cd3825511a3c2686ece6969d941a8bfff.1920x1080.jpg?t=1641691103,https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_9dd0a792ea01bfb296bb93d45e3779ad2e48519f.1920x1080.jpg?t=1641691103,https://cdn.akamai.steamstatic.com/steam/apps/1707890/ss_21c25dcfd1eb3a50070ae7d09f57d0b504de1207.1920x1080.jpg?t=1641691103",
    "Slug": "bacteria-wars",
    "Meta Title": "Bacteria Wars: Aug 25, 2021, Patrick McGuinness and Full ...",
    "Meta Description": "Looking for information on Bacteria Wars? Check out the release date (Aug 25, 2021), developer insights from Patrick McGuinness, and a complete game sum...",
    "Alt Text Image": "Official header image for Bacteria Wars game - Steam 1707890",
    "Canonical URL": "https://gusku.site/game/bacteria-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bacteria Wars\", \"description\": \"Looking for information on Bacteria Wars? Check out the release date (Aug 25, 2021), developer insights from Patrick McGuinness, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Patrick McGuinness\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Patrick McGuinness\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1707890/header.jpg?t=1641691103\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}