{
    "AppID": 1166000,
    "Name": "Battleships and Carriers - Pacific War",
    "Release date": "Nov 15, 2019",
    "About the game": "Casual turn-based WW2 Pacific naval strategy: move, search &amp; destroy, build units and develop technologies. Clear and simple combat and move. Pixel perfect, 2D, retro style, WW2. Easy to learn - hard to master. Sort of dynamic XXL battleship game, 90 missions, over 50 moveable ship/aircraft/submarine/artillery unit types, huge tactical and strategic maps up to 90x90, unit production and combat technology upgrades, different mission objectives (destroy, conquer, defend, escort, kill-them-all). Fast, re-playable tactical content rich board game style strategy. Just plug and play. Without unnecessary cut scenes, fancy 3D graphics, 5.1 sound. Features: -90 missions, death-match, campaigns and what-if scenarios -Special 'Free Hunt' and 'Unlimited' scenarios, with extended number of game turns -More than fifty aircraft, ships, submarines, radar and coastal artillery unit types -Group movement: simultaneously move your task forces up to 100 ships -Create your own task force on the mission start and get additional ships and air force units during the missions -Technology research. Modify your ship classes and aircraft types by exploring more then 70 technologies. Increased fire range, more speed, armor improvements and more fire-power. -Tactical maps of Pacific theater of operations from 20x20 to 90x90 including Guam, Coral Sea, Australia, Midway, US West Coast, Hawaii, Guadalcanal, Singapore, Tarawa, Saipan, Aleutian islands, Iwo Jima, Okinawa, West Pacific and Japan -Tactical and strategy map modes, with zoom-in option -Various mission objectives: conquer enemy ports, destroy units, defend your own bases, secure convoys, eliminate everything -Sides involved: US Navy, Royal Navy, Kriegsmarine (what-if scenarios), Imperial Japan Navy, Royal Canadian Navy, Royal Australian Navy -Historicl unit names and more than 100 officer ranks Unit types: (combat ships, submarines, air units, port artillery, radar stations) Capital ship types: Light Aircraft Carrier, Escort Aircraft Carrier, Anti-Sub Aircraft Carrier, Aircraft Carrier, Fast Aircraft carrier, Heavy Aircraft Carrier, Fleet Aircraft Carrier, Light Cruiser, Escort Cruiser, Anti-Sub Cruiser, Cruiser, Heavy Anti-Sub Cruiser, Heavy Cruiser, Fleet Cruiser, Battle-Cruiser, Battleship, Heavy Battleship, Fleet Battleship Aircraft Unit Types: Fighter, Long Range Fighter, Anti-Sub Naval, Naval, Long Range Naval, Bomber, Heavy Bomber, Strategic Bomber Submarines and light ship unit types: Corvette, Patrol Boat, Torpedo Boat, Frigate, Light Destroyer, Destroyer, Heavy Destroyer, Fleet Destroyer, Light Submarine, Submarine, Heavy Submarine, Fleet Submarine Coastal artillery and auxiliary unit types: Light Port Artillery, Port Artillery, Heavy Port Artillery, Short-Range Radar, Anti-Sub Radar, Long-Range Radar, Light Auxiliary, Auxiliary ship, Heavy Auxiliary, Light Transporter, Transporter, Heavy Transporter Missions: Battle Of Guam 1941, Battle Of The Coral Sea, Battle Of Midway, Aleutian Operation - Dutch Harbor, Admiral Nagumo: Hawaii Operation, Guadalcanal – Tulagi, Saipan Invasion, Iwo Jima - The Aftermath, Battle Of Savo Island, Battle For Leyte, Guadalcanal – Tassafaronga, US Marines, Invasion U.S.A., Aleutian Operation - The Submarines, Royal Navy: Operation Meridian, Aleutian Islands 1942, Battle Of Tarawa , Tarawa Landing - 1st Marines, Battle Of Saipan, Fall Of Singapore, KriegsMarine Offense (What-If Scenario), Axis On Pacific, Royal Australian Navy 1943, Road To Leyte, The Okinawa Battle, Operation Downfall - Conquer Of Japan, British Pacific Fleet: Battle-Cruisers, Royal Australian Navy, Pearl Harbor Attack, Battle Of The Bismarck Sea, RAF On Pacific, Battle Of Guam 1944 – Recapture, Royal Navy Task Force, Battleship Bismarck On Pacific (What-If Scenario), Guam Defense, British Pacific Fleet 1944, Sea Of China, Task Force Leyte, Liberation Of Singapore 1944, Operation Pacific, British Pacific Fleet: The Subs, Pacific Convoy, Destroy Imperial Fleet, Union Jack, Torpedo Boats, Swordfish Hunt, The Hunt On Subs, Island Defense, Hunt On Carriers, Three Carriers, North Circle Death-Match and Free Hunt scenarios: Free Hunt Halsey, Free Hunt Spruance, Admiral Nimitz, Royal Australian Navy, Free Hunt Yamato, HMCS Quebec, Free Hunt Iwo Jima, Free Hunt Kriegsmarine, Free Hunt Admiral King, Solomon Islands, Free Hunt Royal Navy, Death Match - Aleutian Islands, Death Match - Guadalcanal, Death Match - Saipan, Death Match - Midway, Jamamoto, Midway II, Free Hunt Indian Ocean, Return To Midway, Free Hunt Philippine Sea, Free Hunt Pearl Harbor, Free Hunt Malaya, Free Hunt Santa Cruz, Free Hunt Cruisers, Free Hunt Submarines Campaigns: US Navy Pacific Campaign 1941, US Navy Pacific Campaign 1943, British Pacific Fleet Campaign, Imperial Japanese Navy Campaign",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1166000/header.jpg?t=1642266543",
    "Price": 14.99,
    "Developers": "Light Strategy Series",
    "Publishers": "SLS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_90f1baea67f240b7880594cf09ebb46da29b2a2a.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_7450f35d91252dc4d32da56e8936c0b153ea08ef.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_39a79c8ce3fd4ca91ba690f39748bfd238aafa24.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_b4467604476f752c5b04557dd8889c39c16384e0.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_203775041d5e8f9490a88b7b5918d2b665260898.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_1e0128aee357e990946958998f81632b94bab6ea.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_0eaa61c9d2f5401a4dbc01dfe53ae0b2cd838c1c.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_223d9ec07f9a9eb45d0e2d2145e6e494ebc8fcfb.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_1dfe478e6fb64d4ecec8463c3177b90fc9d05a31.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_890e7c8453ec5074a39b16fbd71ec1b88f2a7340.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_fd4e2e4f7ee0fd00bb8828a7f1ca0ad7dfde2a6a.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_7aafd27e8195b246a4ca0b888c965a000162287e.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_144af9d1c8ef61f7f59b233c7b33481d9edcd712.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_64f43e29ad636b31df795007b5076e6687ac8c8e.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_0044bb96beb5a477600344336502960970ead5b1.1920x1080.jpg?t=1642266543,https://cdn.akamai.steamstatic.com/steam/apps/1166000/ss_ccc3cba332e9830b26a6e8b01f575e25462d0220.1920x1080.jpg?t=1642266543",
    "Slug": "battleships-and-carriers-pacific-war",
    "Meta Title": "Battleships and Carriers - Pacific War: Nov 15, 2019, Lig...",
    "Meta Description": "Looking for information on Battleships and Carriers - Pacific War? Check out the release date (Nov 15, 2019), developer insights from Light Strategy Ser...",
    "Alt Text Image": "Official header image for Battleships and Carriers - Pacific War game - Steam 1166000",
    "Canonical URL": "https://gusku.site/game/battleships-and-carriers-pacific-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battleships and Carriers - Pacific War\", \"description\": \"Looking for information on Battleships and Carriers - Pacific War? Check out the release date (Nov 15, 2019), developer insights from Light Strategy Ser...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Light Strategy Series\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SLS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1166000/header.jpg?t=1642266543\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}