{
    "AppID": 1230800,
    "Name": "Beach Buggy Racing 2: Island Adventure",
    "Release date": "Mar 10, 2021",
    "About the game": "Match your kart racing skills against a rag-tag crew of rivals as you explore a mysterious island packed with ancient temples, dragon-infested castles, and post apocalyptic ice cream stands. Unlock and upgrade moon buggies, monster trucks and more. Collect and master over forty unique powerups in an epic race for the ultimate trophy. Beach Buggy Racing 2: Island Adventure is an action-packed, mayhem-filled kart racer with split screen competition and game rule customization. Play any part of the game solo or with friends in split screen—from the story-driven Adventure mode to multi-event Championships, adrenaline-pumping Races, skill-mastering Drift Attacks and more. Ready to go deeper? Craft your own custom game modes! Set your favorite configurations of powerups, race rules, lap counts and more, then save your rule set and play with up to 8 local players. Want a 10-lap Race with Bouncy Tires and Rocket Boost powerups? You can do that. How about a Drift Attack with permanent Police Chase that you can play with 4 friends? No problemo. Maybe you want to test your racing skills with no powerups at all. That's fine too. It's your game, your rules. Easy to pick up and play, yet challenging to master, Beach Buggy Racing 2: Island Adventure is a fast-paced driving action game that delivers explosive fun for all skill levels. ADVENTURE MODE. Explore a massive interactive map as you rise through the ranks of the Beach Buggy Racing League. JUMP IN AND PLAY. Collect trophies in multi-event Championships and tons of individual quick events including Race, Drift Attack, Firework Fury, and more. GAME CRAFTING. Customize your own ridiculous game rules and save them for insane battles with up to 8 local players. WEEKLY TOURNAMENTS. Compete with players around the world in leaderboard Tournaments with unique custom contests. THRILL-RIDE RACE TRACKS. Discover Egyptian pyramids, dragon-infested castles, pirate ship wrecks, and experimental alien bio-labs—23 unique worlds, each packed with secrets and shortcuts. PACK YOUR GARAGE. Collect and customize over 40 unique cars including monster trucks, moon rovers, race cars, and of course...beach buggies! BUILD YOUR TEAM. Recruit a crew of 14 drivers, skeletons, robots, aliens...each with their own unique special ability and strategy. POWERUPS GALORE. Master 44 individual powerups like Donut Tires, Tesla Coil, Ball'n'Chain and Dodgeball Fury. FUN FOR ALL . Choose the difficulty that's right for you, and change it on the fly. Kart experts and noobs can play together with individual handicaps.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1230800/header.jpg?t=1630847836",
    "Price": 19.99,
    "Developers": "Vector Unit",
    "Publishers": "Vector Unit",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1230800/ss_6a7fb4f64415019c5bb7d4d7921295e7b8a5728f.1920x1080.jpg?t=1630847836,https://cdn.akamai.steamstatic.com/steam/apps/1230800/ss_0e73c262a5241fb49df8039746564256cd8e9f99.1920x1080.jpg?t=1630847836,https://cdn.akamai.steamstatic.com/steam/apps/1230800/ss_3de8f6de849435dc3d34d6e7b5e844364b352f2b.1920x1080.jpg?t=1630847836,https://cdn.akamai.steamstatic.com/steam/apps/1230800/ss_9362f12d610e3f2d9242c087f5cb66285bd9f7c8.1920x1080.jpg?t=1630847836,https://cdn.akamai.steamstatic.com/steam/apps/1230800/ss_a35203aa361d5abe61db40f8005c26785bdebb0f.1920x1080.jpg?t=1630847836,https://cdn.akamai.steamstatic.com/steam/apps/1230800/ss_8c52137f91a8dbdd070f163a1a92420f3cafd9c0.1920x1080.jpg?t=1630847836",
    "Slug": "beach-buggy-racing-2-island-adventure",
    "Meta Title": "Beach Buggy Racing 2: Island Adventure: Mar 10, 2021, Vec...",
    "Meta Description": "Looking for information on Beach Buggy Racing 2: Island Adventure? Check out the release date (Mar 10, 2021), developer insights from Vector Unit, and a...",
    "Alt Text Image": "Official header image for Beach Buggy Racing 2: Island Adventure game - Steam 1230800",
    "Canonical URL": "https://gusku.site/game/beach-buggy-racing-2-island-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beach Buggy Racing 2: Island Adventure\", \"description\": \"Looking for information on Beach Buggy Racing 2: Island Adventure? Check out the release date (Mar 10, 2021), developer insights from Vector Unit, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vector Unit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vector Unit\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1230800/header.jpg?t=1630847836\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}