{
    "AppID": 1520580,
    "Name": "Blood of the Alchemists",
    "Release date": "Aug 5, 2021",
    "About the game": "Explore a magical world, without magic In a world devoid of magic, ravaged by a magical storm, a ragtag band of alchemists attempt to keep the fading, fragile connection, to the arcane world alive. Craft, brew, explore, and discover the mysteries of the past. Develop skills, gain experience and level up to become the ultimate alchemist and bring order and peace back to the world of Edina. Witness the betrayal, greed, and utter downfall of the once great powerful order of alchemists. Work to rebuild the ruins they left behind; gather with others to form a new order and overthrow the worst evil that the world has ever seen since the Evenfall itself. Only the Blood of the Alchemists can save us Be who you want to be with a unique character customizer featuring countless options Customize your character at any point during the story to be whoever you want to be! Experience a fully-fledged alchemy crafting system Craft your very own potions using ingredients found in the world around you. Pick your field of study and become the best alchemists the world has ever known. - Pyromancy : Craft deadly fire potions and dangerous explosives that burn and damage your foes, like Napalm, Novabombs, and Cinderbombs. - Hydromancy : Craft water and ice based potions that can deal major damage to enemies health and mana while also applying debilitating effects. - Geomancy : Tough as stone, Geomancy focuses on resisting elemental attacks with high resistance, but also dealing strong amounts of physical damage to enemies. - Chronomancy : Craft potions centered around the flow of time in combat. Slow down your enemies and speed up your allies to get the edge on your foes. Apply Chronostasis, a state that can prevent you from taking damage in combat, or place your enemies into stasis, preventing them from attacking! - Necromancy : Craft deadly poisons and dangerous Plaguebombs that damage your enemies health. Pair these with your innate higher agility stat to become the ultimate assassin. No two classes are the same, with each one offering different potions to create, and different strategies to take in combat. Unique armor sets &amp; equipment Bonuses Find unique armor sets with their own unique bonuses hidden throughout the world to spice up gameplay and support your very own unique playstyle. Hours of explorable side content Help friends, followers, and strangers with different quests and tasks offering unique rewards, gold, and gameplay bonuses for you and your party. Find countless new unique followers that add flavor to the story Assemble your party from those you find on your journey across the Calriddian Isles. Don't like your current followers? Dismiss and call different ones you've met from any Inn or your headquarters at any time along the way. Make a name for yourself As you journey across the Calriddian isles, take part in fishing, hunting, and farming to earn extra money. Search for treasures, and hidden wealth to upgrade your arsenal, and level your party up to take on greater foes that stand in your way of the truth. Upgrade your abilities As you level up, earn mastery points that can be used to upgrade individual stats to better increase your performance in combat. Tired of your current weapon? Enhance it with attachable augments to spice up combat. Find more unique augments for even stronger upgrades scattered all throughout the world. Uncover the mysteries of the past Using unknown powers, experience the memories of others to piece together the last moments of the Royal Court. Discover your lineage, follow the clues left behind to discover your parents’ true identities. Only you can save them In a world where magic is lost, only those with a powerful royal bloodline can expose the truth, right old wrongs, and bring magic back to the world in, Blood of the Alchemists.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1520580/header.jpg?t=1630620697",
    "Price": 9.99,
    "Developers": "Northward Games",
    "Publishers": "Northward Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_742c831ad47d8eff182c1c5c6d89390ef9f903ac.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_59b4d3cb907550710825c3d7771be8b0414225e3.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_f735101435f8cd70733baa4e33cf5d9e0ed2890a.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_4ce8c21783e30e78643b2be5da613d454ce422ff.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_d8c7d6e2f058c12f7aba6cd9070223d0e0cc21c8.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_763549a26ba6e791992bcb4661412aab89a47cc0.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_e7080eeaaf40d933637c630924332e3604d1cc78.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_ae9a30c060a62f141e3642678f92c18e24c7e7ad.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_0ed7894517c6392480b4f80bf1acf8d54fe06a62.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_06b9b10b90f000d30a7c2b9501e01db4038b6b99.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_1d95211891cb5b58d008aacb7b0c6292f070c566.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_edc450f99302637539de1782e51bdb3ca5149f96.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_aa4a63fdf014a08935fae5df420dc203ce3dd7ff.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_77e3a1eb4ca1849a678a8fb3e32b3cc987e1b557.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_e829f217fda66dade1f969cb71e37b8986096a58.1920x1080.jpg?t=1630620697,https://cdn.akamai.steamstatic.com/steam/apps/1520580/ss_0c50906ffeb08cdf852baba059c60fc9cb4ee19d.1920x1080.jpg?t=1630620697",
    "Slug": "blood-of-the-alchemists",
    "Meta Title": "Blood of the Alchemists: Aug 5, 2021, Northward Games and...",
    "Meta Description": "Looking for information on Blood of the Alchemists? Check out the release date (Aug 5, 2021), developer insights from Northward Games, and a complete ga...",
    "Alt Text Image": "Official header image for Blood of the Alchemists game - Steam 1520580",
    "Canonical URL": "https://gusku.site/game/blood-of-the-alchemists",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blood of the Alchemists\", \"description\": \"Looking for information on Blood of the Alchemists? Check out the release date (Aug 5, 2021), developer insights from Northward Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Northward Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Northward Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1520580/header.jpg?t=1630620697\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}