{
    "AppID": 1552550,
    "Name": "Castlevania Advance Collection",
    "Release date": "Sep 23, 2021",
    "About the game": "Count Dracula is once more back from the dead... Join the fight against Evil in the Castlevania Advance Collection, a compilation of timeless action-exploration masterpieces! In addition to the three legendary Castlevania games that were first released in the early 2000s, this collection also includes Castlevania: Dracula X and some never-before-seen sketches and artwork from the games! All four games are enhanced with newly added modern features such as Rewind, Save/Load and Replay, making this the best way possible to experience these classics or discover them for the first time! This collection also boasts a handy Encyclopedia, a Music Player with all soundtracks and you can even change the ROM Region to play all games in different versions. Featured Games Castlevania: Circle of the Moon The story follows Nathan Graves, a vampire hunter apprentice who enters Dracula's Castle along with his Master in order to prevent the dreaded return of the Count. Combine action and attribute cards to create over 80 unique spell effects, ranging from fire whips to ice blizzards, with the 'Dual Set-up System'. Castlevania: Harmony of Dissonance Play as Juste Belmont, the grandson of legendary Vampire Hunter Simon Belmont! This title introduced a lot of new features to the franchise, such as 'Boss Rush' mode and the 'Spell Fusion' system that lets players combine Sub-Weapons with Spell Books to cast devastating spells. Castlevania: Aria of Sorrow Soma Cruz, a young high school exchange student in Japan, is somehow involved in the eternal cycle of reincarnation of the Dark Lord himself. What role does Soma play in all of this? Will he be able to return to his own world? Aria of Sorrow also introduced a brand new attack system called 'Tactical Souls', that lets Soma Cruz capture the souls of slain monsters to acquire their abilities. (100+ abilities in total!) Aria of Sorrow also has a ton of New Game+ content. Castlevania: Dracula X Castlevania: Dracula X is a reimagination of the cult action game Castlevania: Rondo of Blood and has been acclaimed as one of the most challenging Castlevania titles ever created. The Dark Lord Count Dracula rises again from the dead to revive the forces of darkness and to annihilate this corrupted world and create a new one. You are Richter Belmont, heir of the Belmont family, and you set out for Dracula's Castle to defeat its evil master. Fight your way through Dracula's Castle and defeat the toughest enemies with the new special attack 'Item Crash'! Brand New Features for an Improved Experience! Gallery Browse through scans of the original package designs and discover incredible artwork never shown to the public before. ROM Region Selection You can choose between the Japanese, American, and European versions for each game. Encyclopedia Learn more about all three games thanks to their dedicated encyclopedia. Detailed information on enemies, the 'DSS' system, the 'Tactical Soul' system and the 'Spell Fusion' system will help you truly master each game's unique combat system! Music Player Listen to any of four complete soundtracks any time you want. You can even create your own playlists! New 'Quality of Life' Features Save/Load You can now quickly save and reload at any point in the game. Even right before that deadly attack from Dracula himself. Rewind You can now rewind the state of the game for a few seconds for a second chance. It is almost like being resurrected... Replay You can record and replay your runs. This is great for creating new tactics, speed runs and streaming.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1552550/header.jpg?t=1632450154",
    "Price": 19.99,
    "Developers": "Konami Digital Entertainment",
    "Publishers": "Konami Digital Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_d77ac2fac33100e7844c5a7cf8bdaad82eb180ba.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_fa3c9fff09943cbea444237ef33c60511b5ec5c5.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_e43ff06543db73b026940b3871fb4dfe774d624d.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_e1b2a6445392bea937bbdc297a2400351aeadf20.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_effc6c878192a5b954af9abedee61a5d97f40973.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_0e11145fd055490d68a92d73e3c459547e4f217f.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_743551418fcd5776feeaa095f7f732304b41ccc2.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_fc606c783f0e1e80b21cab60197970bac9d6c130.1920x1080.jpg?t=1632450154,https://cdn.akamai.steamstatic.com/steam/apps/1552550/ss_d77ac2fac33100e7844c5a7cf8bdaad82eb180ba.1920x1080.jpg?t=1632450154",
    "Slug": "castlevania-advance-collection",
    "Meta Title": "Castlevania Advance Collection: Sep 23, 2021, Konami Digi...",
    "Meta Description": "Looking for information on Castlevania Advance Collection? Check out the release date (Sep 23, 2021), developer insights from Konami Digital Entertainme...",
    "Alt Text Image": "Official header image for Castlevania Advance Collection game - Steam 1552550",
    "Canonical URL": "https://gusku.site/game/castlevania-advance-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Castlevania Advance Collection\", \"description\": \"Looking for information on Castlevania Advance Collection? Check out the release date (Sep 23, 2021), developer insights from Konami Digital Entertainme...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Konami Digital Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Konami Digital Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1552550/header.jpg?t=1632450154\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}