{
    "AppID": 578590,
    "Name": "City Siege: Faction Island",
    "Release date": "Mar 17, 2017",
    "About the game": "The ultimate 2D Physics War Game - War just got fun, build your army with tanks, guns, spies, flame tanks and helicopters. Then embark on missions of mass destruction and tactical rescues. Bring peace to faction island by destroying all your enemies! Your war starts with just a single rifleman, but soon you'll be rolling into battle with tanks, flame throwers and hover crafts. Fight your way through varying missions on Faction Island, all featuring destructable environments and dynamic gameplay watch as buildings fall down crushing your enemies and rewarding you with massive combos. Expand your army with cash earned from completed missions by buying more heavy weaponry or powerful airstrikes to deliver death from above bringing battles to an indiscriminate finale. Take on timed, solo, stealth and all out warfare missions each requiring a different set of gameplay styles and tactics. Group your units create an army of devastating force as up to five of your troops wreak collective carnage upon the unfortunate enemy. Rockets, bullets, ninja stars and fire are all at your disposal but you'll encounter opposing factions with devastating and insane weaponry of their own. Bombs and bullets alone won't win this war strong tactics and skill will surely prevail. Enjoy City Siege Factions unique physics engine as each level serves as a destruction sandbox environment once you have successfully completed the mission. Why not take your heavy weapons in to earlier levels and go for all-out destruction or try and beat your best time and highest score. Every time you play a level, your units will level up and you will earn more cash to expand your forces, giving you the edge on later levels. At the start of each level you can choose up to 5 units to deploy, you can switch between deployed units at will and can evacuate them and deploy other units from your reserves, allowing you to play each level your own way. Develop your strategy and take full control of Faction Island. Features Destructive Gameplay. Using the power of physics, every level features destructible scenery and buildings. Set areas on fire, call in air-strikes and generally having fun blowing stuff up - but don't forget there are some real mission objectives to achieve, maybe stealth is the best option from time to time... Combo System. Your combo resets to 1 every time you fire. Take out as many baddies with a single shot to score the most points, taking advantage of the combo multiplier. Use the destructible environments to your advantage and get the biggest combo you can. Inter-faction Fighting. You have two enemy factions to contend with, the Natives and the Poachers. Land a shot near an enemy and they will often blame the other faction and start fighting each other. Incite the baddies to fight each other and save yourself the effort, as well as scoring more points and it all counts towards your combo. 8 Units to buy and upgrade to build a complete army. Rifleman The basic unit you start off with. His slow shooting auto-rifle holds 5 bullets before needing to be reloaded. Good movement ability and, as with all foot soldiers, can swing on vines. Molotov Guy Highly explosive and damaging, the Molotov Guy is a danger to everybody on the battlefield - use with caution, will set fire to pretty much everything. On the plus side he does come equipped with fire-retardant armour. Sentry Heavily armoured, but slow. Carries a devastating Chain-gun that will make short work of basically anything, although it's accuracy is kinda poor. Spy The ultimate in stealth. This unit blends in until she gets too close to the enemy or gets seen attacking. Really useful on rescue missions. Her Ninja stars are great for attacking baddies from behind and destroying certain structures, however, they just bounce off barrels so don't expect explosive combos with this one. Flame Tank Kinda rickety and easily damaged, but it's Flamethrower makes short work of most buildings and bad guys. Set the world on fire. Tank The toughest thing out there, although mobility is a little limited. Also comes with a big, devastating gun firing big, explosive shells for maximum damage. Helicopter The ultimate in mobility, equipped with a devastating heavy machine gun. Group a few of these up for unrivalled power on the battlefield. Hovercraft Glide over swamps, lava and water. Armed with devastating rockets, but a narrow range of attack. 8 varying location of Faction Island, each with 3 missions to master Mercenary Camp Your part of the island. Protect it from the enemy! Oil Beach Sums up why you are here - it's the natural resources! You're drilling on Oil Beach and have a nice pipeline set up. Defend the area from the Natives (who for some reason are not keen on our presence) and the Poachers. No Mans River Fight along the river, just watch out for those cunning baddies hiding under water. Stompin' Swamp That swamp isn't pleasant to be in, making everything except the Hovercraft slow to move. Luckily there are lots of vines to swing on and get out of it. Sacred Volcano This area is sacred to the Natives, they come here to worship their Idols, which of course, must be destroyed. Poacher's Camp This is where the Poachers have set up camp. Drive them out and we can make use of the new space. Native's Camp These Natives are savage and in need of 'educating'. Coastline We need to secure the coast if we are going to completely control the Island and you will need Helicopters and Hovercrafts to do it. Varying Mission Types Secure the Area Pretty straight-forward. Just go in and destroy everything! Defend You'll need to defend your base and oil wells. Destroy Objectives Destroy the enemy Idols and Cages. Rescue Mission The Natives and Poachers have kidnapped our Scientists and we need them alive! Solo Missions Take in a single foot soldier - you might need to rescue some scientists or defend a drill. Sea Battles Hovercraft or Helicopter only naval battle to secure the coast. Replayability and Tactics Struggling with a mission? You maybe just need the right troop or tactics. Replay earlier missions and earn cash to expand your forces, giving you more options. Often a tactical approach to a mission is required. Select the correct units, scroll around and have a good look at the mission before you start. And move slowly, thinking ahead. This is all of course balanced with total destruction missions! Steam Features High Scores and Best Times a for every mission. As long as you don't die during the mission you will register a score and time - so on some missions the best tactic for a top score or time is to ignore the mission and just destroy everything as quickly as possible! Achievements. Can you unlock all the steam achievements? Getting 3 stars on every level requires some genuine skill! Cloud Saves. Switch computers and pick up where you left off.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/578590/header.jpg?t=1649867583",
    "Price": 0.49,
    "Developers": "Ish Games",
    "Publishers": "Trinity Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_3ac55d5b650e7a786adcdb50875c35a678a8f1e3.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_90c366251010ad46a5666767f9b9f2d268491d8f.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_0b373752437de30ead0ef3e38c3764962e6e68c7.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_23f24f1d9a95b8aaeedfc848ff3a1c433f2981f0.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_55d03ea7bd38698cf793d1a8c614f1731d10754a.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_a1e9f44ef905ef3825ea72de90bcf90243b5b2fc.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_cc007822f2d4b95889190f51e6ff68b5fdf4a722.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_b288245127eb11c70e5476a9f936d3179384b18e.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_ad80c7ee86c672a9eda82848a2a3485cce604b15.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_76a5ad3e1f29ee0e1be5eaaf9552e73d81c7b0cc.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_1891079aaf9e6d842e0708d53a8d7b73d8a7f851.1920x1080.jpg?t=1649867583,https://cdn.akamai.steamstatic.com/steam/apps/578590/ss_909f82b6a24c32303b1b25481d69c5e1eb4fd7db.1920x1080.jpg?t=1649867583",
    "Slug": "city-siege-faction-island",
    "Meta Title": "City Siege: Faction Island: Mar 17, 2017, Ish Games and F...",
    "Meta Description": "Looking for information on City Siege: Faction Island? Check out the release date (Mar 17, 2017), developer insights from Ish Games, and a complete game...",
    "Alt Text Image": "Official header image for City Siege: Faction Island game - Steam 578590",
    "Canonical URL": "https://gusku.site/game/city-siege-faction-island",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"City Siege: Faction Island\", \"description\": \"Looking for information on City Siege: Faction Island? Check out the release date (Mar 17, 2017), developer insights from Ish Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ish Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Trinity Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/578590/header.jpg?t=1649867583\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}