{
    "AppID": 811880,
    "Name": "Close Combat: The Bloody First",
    "Release date": "Oct 3, 2019",
    "About the game": "“No Mission Too Difficult. No Sacrifice Too Great. Duty First!” Close Combat: The Bloody First is the latest release in the critically-acclaimed Close Combat series, and the first using the new 3D Archon engine. With this Close Combat: The Bloody First combines classic Close Combat tactical gameplay with battles fought across a wide variety of diverse 3D landscapes including craggy ridgelines, narrow valleys and dense villages. The switch to 3D also allows an increase in the level of detail (e.g. the specific types of ammunition used by each weapon are now modelled) with more realistic movement and projectile physics. Following the career of the famed US 1stInfantry Division (forever known as 'The Big Red One') Close Combat: The Bloody First visits the battlefields of Tunisia and Sicily for the first time, as well as covering the Normandy campaign. With 3 theatres to cover Close Combat: The Bloody First places the focus firmly on the tactical level putting you in command of a 1st Infantry Division company (sometimes reinforced … and sometimes not!), leading your men through a series of linked operations and battles from Longstop Hill in Tunisia to Mortain in Normandy. You'll have to look after your men, work out the best combination of fire and movement, know when they need bolstering with armoured vehicles and decide when to call in support from artillery and aircraft. You will command your squads in a variety of close combat situations and will have to learn how best to combine the use of small arms, mortars, machine guns, armoured cars, tanks and anti-tank guns in order to achieve victory. You must learn the art of attack and defence in battles such as Hill 350 and Kasserine Pass in Tunisia, Gela and Troina in Sicily, and Caumont and Marigny in Normandy. As you fight your way into and then across Europe from November 1942 to August 1944 you must overcome a wide range of diverse tactical challenges, such as commanding inexperienced troops being attacked by veteran panzers in North Africa, having to capture the bitterly defended town of Troina in the Sicilian mountains and of course storming across the sands of Omaha and into the 'hedgerow hell' of Normandy The Settings Tunisia – 5 Operations with 14 battles covering Longstop Hill, Sbiba, Kasserine Pass, El Guettar, Mateur Sicily – 3 Operations with 11 battles covering Gela, Nicosia and Troina Normandy – 3 Operations with 11 battles covering Omaha Beach, The Bocage and Operation Cobra Features 1 Grand Campaign, 3 Theatre Campaigns (Tunisia, Sicily and Normandy), 11 Operations and 36 battles Completely revised 3D that brings a whole new look and feel to the classic Close Combat gameplay. The new 3D engine allows an increased level of detail (down to the specific types of ammunition used by each weapon) and more realistic movement and projectile physics. 32 completely new battlefield maps covering the rugged terrain of Tunisia (14 maps), the mountains and valleys of Sicily (11 maps) and the beaches and bocage of Normandy (11 maps) For the first time, the armed forces of Italy appear in an official release Over 50 different vehicles, 300+ infantry and heavy weapon teams and over 100+ weapons and including for the first time US equipment from 1942-43. All new graphics and effects New sound effects New terrain types to cover the jagged ridges of Tunisia and the rough, broken battlefields of Sicily Historic organizations covering the US 1st Infantry Division and its German and Italian opponents Integrated multi-player lobby and match-making forums.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/811880/header.jpg?t=1647349820",
    "Price": 39.99,
    "Developers": "Slitherine Ltd.",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_7775be2adf46091a799238748d14fe8c623f0814.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_1c505bb0fb2318210db52daa9f01b1bc6cfad91e.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_d18d72e90a982f31334b88f3b6f608e3e4c940f4.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_f1f385e0fd07ce50ddc03ff15959be96c269e4ca.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_7cbbdbbd2508ccf8df8b9ffade515b90177306bd.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_93596046eb0861f1100cfa9384638e5e0c35193b.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_5e4c02010b0aa9304178d9196be360cbebf360d7.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_af93040bdc8800351297952ccb666ebf37114844.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_c9910bb4d17a4f3705f52048f4471a4129a58e86.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_cdcbe49a64bdb0714b19d3fb14c87d2b433cde16.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_88292e909dc93868ab1c700e9e18dcc26564286c.1920x1080.jpg?t=1647349820,https://cdn.akamai.steamstatic.com/steam/apps/811880/ss_c64a7e5bee304e0f600431840fc5d84696525209.1920x1080.jpg?t=1647349820",
    "Slug": "close-combat-the-bloody-first",
    "Meta Title": "Close Combat: The Bloody First: Oct 3, 2019, Slitherine L...",
    "Meta Description": "Looking for information on Close Combat: The Bloody First? Check out the release date (Oct 3, 2019), developer insights from Slitherine Ltd., and a comp...",
    "Alt Text Image": "Official header image for Close Combat: The Bloody First game - Steam 811880",
    "Canonical URL": "https://gusku.site/game/close-combat-the-bloody-first",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Close Combat: The Bloody First\", \"description\": \"Looking for information on Close Combat: The Bloody First? Check out the release date (Oct 3, 2019), developer insights from Slitherine Ltd., and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/811880/header.jpg?t=1647349820\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}