{
    "AppID": 918170,
    "Name": "Curiosity",
    "Release date": "Aug 10, 2018",
    "About the game": "A simple world where the player is able to change things that are not supposed to be changed. Welcome to Curiosity, the game where you can hack. Try out different hacks, get creative, entertain yourself! And hey, maybe you'll find a secret or two along the way! This is an infinite platformer with horizontal player movement. When the game is started, two tabs open: one with the platformer itself, and one that appears to be a command prompt. A narrator starts speaking, and quickly notes that the platformer seems to be dull and uninteresting. He then tutorials the player on how to 'hack'. 'Hacking' gives the ability to change important variables in the code and to enable things that affect the environment. As the narrator will explain, to 'hack', the player must press the 'h' key while the platformer tab is selected. The platformer will then freeze as it waits for input from the hacking tab (the one that looks like a command prompt). The player then must switch to the command prompt, type in a 'hack', and press enter. They will then be prompted to enter an integer (numbers), string (words), or boolean (true/false) to complete the hack. After completing the hack, the player can go back to the platformer to see what changed. Here's an example of what happens in the hacking tab with a player doubling their speed: ------------------- Enter Hack: speed ------------------- Speed Hack: ------------------- Variable Type: Integer Default State: 6 Current State: 6 ------------------- Enter new speed: 12 Hack Successful! ------------------- Hacking process complete Go back to the game ------------------- The game encourages using trial and error to see what each hack does (and using the hack 'list' to see which hacks exist), but here's what they do if you don't want to test them out for yourself: 'ascend' - Enter a boolean. When enabled, platforms rise into the sky whenever the player steps on them. 'birdNumber' - Enter an integer. Affects the maximum amount of birds the player can spawn. 'birdPoop' - Enter a boolean. When enabled, birds will occasionally drop bird poop. 'birdPoopRate' - Enter an integer. Affects the rate at which birds can drop poop ('birdPoop' must be enabled to see this change). 'birdSpeed' - Enter an integer. Affects the speed at which the birds fly. 'blackhole' - Enter a boolean. Enables a blackhole that sucks in all sprites and the player's mouse. The game warns you to have caution, since it will take control of your mouse while this hack is enabled. 'clearScreen' - Enter a boolean. When enabled, the command prompt is cleared. 'clone' - Enter a boolean. When enabled, clones of the player can be created by pressing the space bar. 'color' - Enter three integers, as instructed. Affects the background color of the sky. 'deathTouch' - Enter a boolean. When enabled, the player destroys whatever they touch. 'fly' - Enter a boolean. When enabled, the player can fly. 'gravity' - Enter an integer. Affects the strength of the game's gravity. 'jump' - Enter an integer. Affects the player's jump height. 'language' - Enter a string as prompted. Changes the language of the words 'Dull Platformer' at the top of the tab, and of the 'Ouch' said by sprites when they crash their heads into platforms. 'list' - Shows this list of hacks. Does not show the hack 'secret'. 'morph' - Enter a string as prompted. Changes the player into other sprites in the game. Your hit-box and abilities are updated accordingly. 'mousePlay' - Enter a boolean. When enabled, the player becomes your mouse, and the game attempts to give your mouse collision detection. As with the hack 'blackhole', the game cautions you that this hack will take control of your mouse. 'multiplayer' - Enter a boolean. When enabled, a second player can join by playing on the same keyboard as instructed. 'music' - Enter a string as prompted. Allows players to change the sounds of the game to a song, silence, or the tutorial again. 'secret' - Enter a boolean. When enabled, the birds and flowers get sunglasses. 'speed' - Enter an integer. Affects the speed of the player. 'weather' - Enter a string as prompted. Changes the weather of the platformer. As players experiment with different hacks, 5 pieces of a key can be found. When the player finds all 5 pieces, the narrator comes back to speak to you and the ending is unlocked.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/918170/header.jpg?t=1533918455",
    "Price": 0.0,
    "Developers": "Nicholas Pellegrino",
    "Publishers": "Nicholas Pellegrino",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/918170/ss_27a38cdcb5221be98637c347596d99067c42a31d.1920x1080.jpg?t=1533918455,https://cdn.akamai.steamstatic.com/steam/apps/918170/ss_d3b0e83f9d0710c383118800101285e0ac55ce8a.1920x1080.jpg?t=1533918455,https://cdn.akamai.steamstatic.com/steam/apps/918170/ss_8af2043a1583dc403239f668e141eecd74161150.1920x1080.jpg?t=1533918455,https://cdn.akamai.steamstatic.com/steam/apps/918170/ss_a689717815910083c63d582bb316e1ea803ef9ad.1920x1080.jpg?t=1533918455,https://cdn.akamai.steamstatic.com/steam/apps/918170/ss_5617ab498ecb6ad499266b8baeb513e2cbbc9f20.1920x1080.jpg?t=1533918455",
    "Slug": "curiosity",
    "Meta Title": "Curiosity: Aug 10, 2018, Nicholas Pellegrino and Full Ove...",
    "Meta Description": "Looking for information on Curiosity? Check out the release date (Aug 10, 2018), developer insights from Nicholas Pellegrino, and a complete game summary.",
    "Alt Text Image": "Official header image for Curiosity game - Steam 918170",
    "Canonical URL": "https://gusku.site/game/curiosity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Curiosity\", \"description\": \"Looking for information on Curiosity? Check out the release date (Aug 10, 2018), developer insights from Nicholas Pellegrino, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nicholas Pellegrino\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nicholas Pellegrino\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/918170/header.jpg?t=1533918455\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}