{
    "AppID": 1166200,
    "Name": "CyberLink AudioDirector 10 Ultra",
    "Release date": "Nov 8, 2019",
    "About the game": "Precision Audio Editing for Videos Proper audio is critical for setting the right mood for any video or movie. AudioDirector contains high-end tools to edit and fix audio tracks for professional results. Seamless integration with PowerDirector’s video editing workflow makes AudioDirector a must-have application for professional video makers. AI Wind Remove Recording outdoors will never be the same again! With just one click you can use the power of AI to remove wind gusts from audio clips, bringing clarity to dialogue and ambient sounds. Punch &amp; Roll Recording Quickly record lengthy voiceovers or podcasts, and seamlessly make corrections to your dialogue tracks. Restoration Adjustment Tools Dialogue Contour - Change dialogue’s inflections Plosive Removal - Remove distracting breathy sounds in speech Noise Reduction - Clear unwanted static and background noise Declip - Remove distortion caused by clipping Declick - Clear track of clicks, pops and crackles Hiss Removal - Eliminate hissing sounds from audio tracks Hum Removal - Get rid of low frequency audio artifacts Visual Spatial Audio Editing Edit audio tracks for 360˚ videos in a visual preview window to precisely tune audio direction and elevation. Vocal Transformer Alter existing vocals through a number of natural-sounding filters. Choose from five existing presets including phone, gender, robot, and more, or create your own. Multi-Channel Device Recording Record from multiple audio channels at the same time directly into AudioDirector. You don't need to spend time syncing channels, so you can start editing right away. Track Alternatives in Mixer Room Sample different effects and recordings on a single track with Track Alternatives. Add multiple tracks to the same timeline and preview different styles without having to individually mute and unmute them. Surround Sound Panner Create sophisticated surround sound projects using dynamic panning technology. Auto-Fit Background Music Automatically adjust background music tracks to fit the length of your video. AudioDirector analyzes the music and seamlessly remixes it to fit the length of your video clip.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1166200/header.jpg?t=1635856640",
    "Price": 129.99,
    "Developers": "CyberLink",
    "Publishers": "Deep Silver,CyberLink",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1166200/ss_a36091b10ff58340f1bff879d38ae5ccce2a189f.1920x1080.jpg?t=1635856640,https://cdn.akamai.steamstatic.com/steam/apps/1166200/ss_aeb69aa8e71e4eaaaea0db6686f4e7905eb57c55.1920x1080.jpg?t=1635856640,https://cdn.akamai.steamstatic.com/steam/apps/1166200/ss_7aa62643d84427c941efbfa4361ed26bf617876c.1920x1080.jpg?t=1635856640,https://cdn.akamai.steamstatic.com/steam/apps/1166200/ss_0d27fe51724f4850bb60a613391ffdbdc4bc49ae.1920x1080.jpg?t=1635856640,https://cdn.akamai.steamstatic.com/steam/apps/1166200/ss_3017adba7d6127540f4d4c741672609d3105a2af.1920x1080.jpg?t=1635856640",
    "Slug": "cyberlink-audiodirector-10-ultra",
    "Meta Title": "CyberLink AudioDirector 10 Ultra: Nov 8, 2019, CyberLink ...",
    "Meta Description": "Looking for information on CyberLink AudioDirector 10 Ultra? Check out the release date (Nov 8, 2019), developer insights from CyberLink, and a complete...",
    "Alt Text Image": "Official header image for CyberLink AudioDirector 10 Ultra game - Steam 1166200",
    "Canonical URL": "https://gusku.site/game/cyberlink-audiodirector-10-ultra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink AudioDirector 10 Ultra\", \"description\": \"Looking for information on CyberLink AudioDirector 10 Ultra? Check out the release date (Nov 8, 2019), developer insights from CyberLink, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep Silver,CyberLink\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1166200/header.jpg?t=1635856640\", \"offers\": {\"@type\": \"Offer\", \"price\": 129.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}