{
    "AppID": 1016600,
    "Name": "Devil Slayer - Raksasi",
    "Release date": "Apr 22, 2021",
    "About the game": "Devil Slayer - Raksasi is a top-down action game with procedurally generated dungeons, profound roguelike elements, and intuitive soul-like fighting. It's a fair and challenging game, dodging, timing, striking, you need to master them all to fight your way out of this cursed world. Welcome to follow us: Twitter: @GlassesCatGames Discord： Seven heroines' crimson journey Byleth - A survivor of ancient gods. Initial Weapon: Longsword. Ajiela - A young demon heiress who falls in love with a human. Initial Weapon: Spear. Kharoum - A fiery lady with a quick temper and incredible heat. Initial Weapon: Sledgehammer. Xilvaron - A hybrid of demon and human. Initial Weapon: Twin Daggers. Ralciel - A descendant of the general and the last one of her family. Initial Weapon: Sword &amp; Shield. Japhriel - Queen of the outlaws, defected from the killer organization. Initial Weapon: Sickle &amp; Chain. Tindra - Hails from the Jiu Puppeteer clan, a sub-division of Fox Immortals. Initial Weapon: Blunderbuss We elaborately crafted 7 heroines, 7 series as a total of 59 weapons, each one has its unique way to swing and to battle. We will bring in new weapons in the future, to add even more depth to our heroines' weapons. Roguelite never-ending trials Wars are burning the unresting borders, nature and humans are both causing unforgiving disasters, foul creatures are threatening innocent people, demons are more than ready to grab their chance and strike back. In this world all shattered, a group of people gathered together, wanting to disperse the darkness, and bringing lights upon this world. They created a transmigrate trial, so the chosen ones could find the key to save the world in their transmigrating trials. Devil Slayer - Raksasi uses Roguelike mechanics, you will face different enemies in our random generated levels. Countless relics combinations will give each runs a fresh and interesting experience. Currently, there are 6 chapters, 167 types of enemies and 212 relics. We will bring in even more varieties in future updates. Challenging &amp; down to the core action game Rid of the grinding gameplays, you will face down to the core battles in Devil Slayer - Raksasi, in which the most essentials are your dodging, timing, and rhythm skills. You need to practice with your weapons, familiar with your enemies, choose the right moment to unleash your strikes. Kill or be killed is often one blink away. Be tenacious, death will only make you stronger, there is nothing could stop you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1016600/header.jpg?t=1657272242",
    "Price": 14.99,
    "Developers": "GlassesCatGames",
    "Publishers": "GlassesCatGames,indienova",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_86084a17f17634124bfe335c685b7200687d6af7.1920x1080.jpg?t=1657272242,https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_ce374b681274a75ea7cab2971084c7a3f56da4f1.1920x1080.jpg?t=1657272242,https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_7afb718a0c80cc37534da082f97d686e15c798db.1920x1080.jpg?t=1657272242,https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_36aa465c92a3315816e9fb0ba669e558bd752f4b.1920x1080.jpg?t=1657272242,https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_b3bc5c2667c5b87f939f1194caa1aba71e984ae5.1920x1080.jpg?t=1657272242,https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_dc74d934a7b9893c414fd8378199269d6d4c3c7a.1920x1080.jpg?t=1657272242,https://cdn.akamai.steamstatic.com/steam/apps/1016600/ss_0d9061d4fad83ddfecbd478407fcf78af3b5ef15.1920x1080.jpg?t=1657272242",
    "Slug": "devil-slayer-raksasi",
    "Meta Title": "Devil Slayer - Raksasi: Apr 22, 2021, GlassesCatGames and...",
    "Meta Description": "Looking for information on Devil Slayer - Raksasi? Check out the release date (Apr 22, 2021), developer insights from GlassesCatGames, and a complete ga...",
    "Alt Text Image": "Official header image for Devil Slayer - Raksasi game - Steam 1016600",
    "Canonical URL": "https://gusku.site/game/devil-slayer-raksasi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Devil Slayer - Raksasi\", \"description\": \"Looking for information on Devil Slayer - Raksasi? Check out the release date (Apr 22, 2021), developer insights from GlassesCatGames, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"GlassesCatGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GlassesCatGames,indienova\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1016600/header.jpg?t=1657272242\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}