{
    "AppID": 617560,
    "Name": "DreamPlan",
    "Release date": "Apr 21, 2017",
    "About the game": "DreamPlan Home Design is a home and landscape design software designed with an intuitive and easy-to-navigate user interface that allows you to design any space in or outside the home. This 3D design software is perfect for any home project you may need to plan for. Create a stunning deck or swimming pool, map out the layout of your floor plan, or simply see how you would like your furniture arranged. With DreamPlan Plus, you have the flexibility of navigating to any view of your house or switching between 2D and 3D modes. When your project is complete, just take a quick screen shot of your plans and print. Whether to create a fun project or to build a home from the ground up, DreamPlan can give you a realistic design of your dream home, garden, pool, or deck! DreamPlan Plus Feature Include: Enjoy easy-to-use navigation tools to see a 360 degree view of your plans. Design every room in your house from the basement to the top most desired floor, including the bathrooms, living room, kitchen, bedrooms, and much more. Manipulate all design elements from textures, colors, and furniture—down to plumbing! Add an unlimited amount of packages to expand your collection of design properties, such as the kid's room or sport and leisure packages. Switch between 2D &amp; 3D viewing options, look in blueprint mode or add and snap grids. Save your projects and adjust them as your project changes. Take a snapshot of your project in any mode and save in JPG or PNG. Export your 3D project to OBJ or STL. Landscape and Garden Design Choose from a wide range of outside elements, including: plants, lighting, furniture, paint and other miscellaneous elements. Build and design your outdoor terrain with everything from paths to hills and mountains. Visualize your new outdoor swimming pool design, manipulating shapes, colors and other pool components. Look at what possibilities exist with your new deck, like colors, materials and decor. Interior and Room Design Create walls, multiple stories and other structural parts of your kitchen, living room, bedrooms and bathrooms. Figure out what appliances would fit in your kitchen best and where they would be positions. Add furniture, fixtures, appliances and other decorations to rooms Route the plumbing through your house. Decide which lighting fixtures are going to create that magical ambiance. Style your home with new paint and textile options. Lay out and design your unfinished basement",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/617560/header.jpg?t=1571765730",
    "Price": 39.99,
    "Developers": "NCH Software",
    "Publishers": "NCH Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_03505038ee0ca9ad5e23551fbb0818783b78c4b3.1920x1080.jpg?t=1571765730,https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_d46c64b37752026d27255600c3c04e5f576b1ec0.1920x1080.jpg?t=1571765730,https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_608606f408162fbb1be2a0dbc0077400f7e7c9a4.1920x1080.jpg?t=1571765730,https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_18b378fc8788c1b7f66721787bf2487b5afe9a21.1920x1080.jpg?t=1571765730,https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_0fa526a26eab97fd5e410978eb3189c58e3712e0.1920x1080.jpg?t=1571765730,https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_cb9f65e6da0e314d9c0ce59cae6163fb204d1a0a.1920x1080.jpg?t=1571765730,https://cdn.akamai.steamstatic.com/steam/apps/617560/ss_48220dad6085320a5d76092cff46615a16f67dd0.1920x1080.jpg?t=1571765730",
    "Slug": "dreamplan",
    "Meta Title": "DreamPlan: Apr 21, 2017, NCH Software and Full Overview",
    "Meta Description": "Looking for information on DreamPlan? Check out the release date (Apr 21, 2017), developer insights from NCH Software, and a complete game summary.",
    "Alt Text Image": "Official header image for DreamPlan game - Steam 617560",
    "Canonical URL": "https://gusku.site/game/dreamplan",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DreamPlan\", \"description\": \"Looking for information on DreamPlan? Check out the release date (Apr 21, 2017), developer insights from NCH Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"NCH Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NCH Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/617560/header.jpg?t=1571765730\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}