{
    "AppID": 964080,
    "Name": "Endless Universe 2 PC Live Wallpaper",
    "Release date": "Jan 4, 2019",
    "About the game": "IMPORTANT! Windows 10 only! Aero Theme needs to be enabled to run on full-screen. Read below about fake antivirus report and not working menu! Check our community to read more. This time we wanted to show you our new Endless Universe 2 PC Live Wallpaper project in which you'll be able to explore the universe. Every visited place or the visible planet will be unique. You will never see the same wallpaper. At your disposal is an autonomous spaceship that you can freely configure by choosing special modules and their positions. Space is big but also dangerous. Arming the ship will allow you to defend yourself and attack when you meet an enemy spaceship. It is worth to look at our ship to repair the parts that were damaged during the space battle. A non-repaired ship can quickly be destroyed by an enemy spaceship. Main features: - Procedurally generated universe. Each visited place will be unique. - Procedurally generated planets. Every planet will be unique. - Procedurally generated cameras. Every view will be unique. - Autonomous spaceship to explore the universe. - A modular constructor of a spaceship. A comprehensive system of editing and arming. - Space battles. Autonomous and very effective fights in space. - A very effective system. It does not affect your PC. - Include 'Game Mode' feature to minimize wallpaper when you play normal games. - Future updates...any ideas? Multi-screen Users: The wallpaper must cover all available screens. Because of this, your spaceship can be on the edges and some menu items are not visible because they will be outside the screens. However, it is possible to set the horizontal three screens so that the spaceship will be in the middle and the menu will be on the side screens. Then you can change the FOV in the options to match the size of the ship and the background. Fake Antivirus Reports: This wallpaper was tested by us and Steam platform and we didn't notice any trojans by professional antivirus software. This is a Unity3D project where we had to use some tricks to run it as wallpaper under the icons/windows and to keep control over 'mouse input'. Some of the small antiviruses might take it as an attack but this is not true. Steam very carefully check all of the content and we can promise that there is no virus/trojans!. Read more in our Community HUB. 4K Screen Users: Wallpaper will run at maximum resolution 4K. Higher resolution can affect the performance of your computer. However, I have a 4K screen and the performance drop is insignificant. Performance As it is a 3D application it must take its own. We have this in mind and therefore maintaining low demand is our priority. Endless Universe also appears on mobile devices (Android) and works great on medium class mobiles. The wallpaper also has graphics settings so you can limit some effects. How Do Interactive Wallpapers Work? Interactive wallpaper works just like a normal game, but it is displayed under icons and windows of the Windows system. The wallpaper is active all the time so that you always have a unique view. Unlike standard 'flat' wallpapers, this one will always be something else. A 3D environment posed for interaction, which allows you to influence its appearance. Can I Play Games With This Wallpaper? We recommend using the 'Game Mode' feature to minimize the wallpaper while playing normal games. Thanks to this wallpaper will not use CPU and GPU. Unfortunately, at the present moment, it is not possible to automate this process. How to Turn Off This Wallpaper?: Use 'Options' icon to run Settings. Inside the menu use 'EXIT' button. How to Disconnect With Steam?: When you use this wallpaper and a normal Steam game you might want to disconnect wallpaper with Steam to use chat or other features. To do this you have to select Endless Universe 2, 'Properties' in your Steam Library. Please uncheck 'Enable the Steam Overlay while in-game'. Project Updates Of course, the project will be developed in the future. If you have interesting ideas, we will discuss them with pleasure. Please note that the wallpaper has its limitations like the use of CPU, GPU or project size. Support We are a tiny team that wants to create interactive applications that diversify well-known Windows wallpapers. We try to make each project unique, bringing something new to your screen. Every support is valuable to us. Ratings and comments help us move forward and make even better interactive wallpapers. Endless Universe 2 PC Live Wallpaper is a project that was created thanks to your help. Thank you very much and we encourage you to support it through reviews and activity in a community. Every help is very important to us. Thank you. If you notice any problems please check 'Community HUB' or contact with us via Facebook or email at info@3dmgroup.co.uk Thank you and we wish you unique flights! ;) 3DM",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/964080/header.jpg?t=1644363458",
    "Price": 2.99,
    "Developers": "3dm_live_wallpapers",
    "Publishers": "3dm_live_wallpapers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_c4c50e03ae3fa7d129c73ee9396199088cab8b9d.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_3c1fe9b7e3f2bcc7ac399a16cc30e524cfcc25ac.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_4f4e2260c71b9efae080150ea7c86a53a05b9e62.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_1b2370c7f5c83f8bd1236515bf0cc270e2fe9648.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_1beeeffe517178902f49158035f42dfceda8f464.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_34e3cf77c655e13debfecbe23a45b95b46b74861.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_1873a43150098bd54a4ceea80e7647aa8ee17489.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_f4fcec027c16023db7d9835d7790ee057c651a54.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_b9dda15d5f59912246daf7c9d0dffaeac52bcd84.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_7d15602cf6463a8ce5e1ee79b51a393c639f88f6.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_c35fd8235390982f956a19436effa4fc8053595e.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_78d33f0a9850cb72093f8ec4bb4f1bb5172aa069.1920x1080.jpg?t=1644363458,https://cdn.akamai.steamstatic.com/steam/apps/964080/ss_e47319875b5881e398d0f202be1a160112ed5bec.1920x1080.jpg?t=1644363458",
    "Slug": "endless-universe-2-pc-live-wallpaper",
    "Meta Title": "Endless Universe 2 PC Live Wallpaper: Jan 4, 2019, 3dm_li...",
    "Meta Description": "Looking for information on Endless Universe 2 PC Live Wallpaper? Check out the release date (Jan 4, 2019), developer insights from 3dm_live_wallpapers, ...",
    "Alt Text Image": "Official header image for Endless Universe 2 PC Live Wallpaper game - Steam 964080",
    "Canonical URL": "https://gusku.site/game/endless-universe-2-pc-live-wallpaper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Endless Universe 2 PC Live Wallpaper\", \"description\": \"Looking for information on Endless Universe 2 PC Live Wallpaper? Check out the release date (Jan 4, 2019), developer insights from 3dm_live_wallpapers, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"3dm_live_wallpapers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3dm_live_wallpapers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/964080/header.jpg?t=1644363458\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}