{
    "AppID": 959520,
    "Name": "Fantasy Blacksmith",
    "Release date": "Nov 15, 2019",
    "About the game": "You are a blacksmith in the world of the sword, magic and war, in which any blacksmith who knows how to make even the simplest swords is in demand. You start off as a poor unskilled blacksmith, but in time you will gain experience and improve to achieve wealth, fame and power, and change this world! Fantasy Blacksmith is a magically realistic blacksmith simulator in which you have to create and sell weapons. Also, your smith will gain more experience and become stronger and more accurate with each created sword. You can also improve your equipment in the smithy, buy a better forge, better grindstone, improve your hammer and etc. We want to create an exciting and interesting simulator in which any player can make his dream sword. 'You are a smith and you create swords!' The creation of the sword begins with the drawing. The sword consists of 8 parts: Blade (5 parts), Cross-guard, Handle, Top. You choose the material from which the sword will be made. It can be iron, bronze, titan, tungsten, mithril, silver, gold, etc. Using the large number of options offered and your imagination, you can create a huge number of unique swords. We believe that there may be more than 10 billion different swords that you can create. 'Using a hammer, beat your ingot into a blade' According to your drawing, you will be hammering the red-hot metal to give it the shape of a blade. You also need to remember to keep the metal temperature high, if it cools down, you can not forge it. 'Finally I can make Damascus steel' You will have the opportunity to practice alchemy. Using different chemical mixtures of the correct recipe, you can create a damask pattern on your sword. Depending on the proportion of the mix of the chemical elements, and on the heating and holding the mixture, the result will depend. One thing I can say for sure, you will not get two identical patterns. 'Feel yourself a witch' One of the most interesting parts of the gameplay is making a magic potion. This is a very exciting and dangerous process. Having done everything correctly you will get a new sword from the mythical material, but if you make a mistake you can spoil the sword or even destroy it. In the game there will be a lot of ingredients for the magical boiler and by collecting everything by recipe, you will get many different potions. 'Long live runic magic' To superimpose magic effects on weapons, runes will be used, depending on the pattern on the magic table, different spells will be cast on the weapon. 'You can mine and smelt your own ore!' You can mine the ore, and by mixing various ores in the smelter you will get very unusual metals. 'Casino in the Forge' We will add a few mini-games for a variety of gameplay. Currently, dice and darts are being developed. Also artificial intelligence of rivals will be added. In mini-games you can try to sell your goods at an inflated price or play for money or rare artifacts with visitors to your forge. b489f",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/959520/header.jpg?t=1631960034",
    "Price": 2.49,
    "Developers": "Heaven Brotherhood",
    "Publishers": "GrabTheGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_17e24b92770ea42501d32a6abcc82a0571754e9b.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_e5a699dc2f6fa389937b5d8f5a9c4f51fd938741.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_1382311866da8c6d96a0ee2478c1abef93ffcb5b.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_9b46771081cb701f2058233f51a7830a894bca44.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_8a071cb35f604827b2a0250af39c9cfeb2b7f0e9.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_340cd9e0945ccbc3fdd7bf02be4d1d9703bceb02.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_a262ef195159532ab295c94fbfaf6ec144a5ee45.1920x1080.jpg?t=1631960034,https://cdn.akamai.steamstatic.com/steam/apps/959520/ss_ee154fe0f92633d47073f45027ba02d06b2d9b25.1920x1080.jpg?t=1631960034",
    "Slug": "fantasy-blacksmith",
    "Meta Title": "Fantasy Blacksmith: Nov 15, 2019, Heaven Brotherhood and ...",
    "Meta Description": "Looking for information on Fantasy Blacksmith? Check out the release date (Nov 15, 2019), developer insights from Heaven Brotherhood, and a complete gam...",
    "Alt Text Image": "Official header image for Fantasy Blacksmith game - Steam 959520",
    "Canonical URL": "https://gusku.site/game/fantasy-blacksmith",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fantasy Blacksmith\", \"description\": \"Looking for information on Fantasy Blacksmith? Check out the release date (Nov 15, 2019), developer insights from Heaven Brotherhood, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heaven Brotherhood\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GrabTheGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/959520/header.jpg?t=1631960034\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}