{
    "AppID": 1449230,
    "Name": "Glitchhikers: The Spaces Between",
    "Release date": "Mar 31, 2022",
    "About the game": "What do you see up there, when you consider the infinity around us? And as you wander on your own journey, who are the strange, unworldly others who probe those questions as they pass like ghosts through your travels? Were they ever really real? Glitchhikers: The Spaces Between is about the thoughts that exist between destinations, the parts of journeys that dominate our time but not our attention, when our minds wander to parts of ourselves and our world normally left unexamined. On a late night highway drive, a quiet train car in the early hours, a walk through a moonlit park, or the endless wait in a deserted airport, we listen to weird music amid the ambient announcements of delays, and question our place in the universe. Inspired by long travel and the stream of consciousness it fosters, Glitchhikers asks you to look inward. Find the answers to your questions, and question the answers you receive. Ruminate on life, the universe, our place and purpose in it. Voyage through a freeform narrative experience, converse with the endless inevitability, and explore the cosmic, hopeful world you find yourself in. A follow up to the critically praised short game released in 2014, Glitchhikers: The Spaces Between is an expanded experience, reborn and reimagined. No pressure, no failure, no optimal path, no journey exactly the same. Glitchhikers: The Spaces Between is an introspective freeform game where the player picks a journey, slips into that liminal space and has a unique experience travelling into their own thoughts, guided by the characters they meet along the way. A late night drive, a deserted airport lounge, a moonlit walk through an empty park, a quiet carriage on an overnight train, a 24-hour convenience store. Never the ultimate destination, spending time in the inbetween creates a setting for contemplation and reflection, a mood that exists in these liminal spaces. The hikers you meet on each journey will travel with you for a time, offering thought-provoking conversations, and questioning your place in the universe. Who will you meet? What will you talk about? Were they real or just a figment of your imagination? An extensive original soundtrack full of chill grooves, upbeat wonder, dreamy synths controlled by your movement through space, and that one busker who makes you feel right at home: each journey has its own feel. Glitchhikers: The Spaces Between both expands and dives deeper into the ideas behind the original Glitchhikers (released as a short conceptual game in 2014), to fully realise the concepts and present a polished and fleshed out experience to a new generation of players. Silverstring Media are a vital and vibrant voice within narrative indie games, creating a string of short experimental titles and working as narrative guns for hire on indie darlings including Celeste, Crypt of the Necrodancer, Where the Water Tastes Like Wine, Manifold Garden and Wandersong.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1449230/header.jpg?t=1654500336",
    "Price": 12.99,
    "Developers": "Silverstring Media Inc.",
    "Publishers": "Fellow Traveller",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_59a14afa2f07323f321c119bf0464b7a0a7d731b.1920x1080.jpg?t=1654500336,https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_4d1c7e47801f01f348482dd68b00204bc30849cd.1920x1080.jpg?t=1654500336,https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_51f8a7a894835c3a73f2ffca8c1e4dfe8217afc9.1920x1080.jpg?t=1654500336,https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_0c683476838bfe5010448bef9f2bf39687241101.1920x1080.jpg?t=1654500336,https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_c1342881ae23d9a29b0bce6b5435c787459cdf7a.1920x1080.jpg?t=1654500336,https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_8291829487deaf48f908e5a2a01fbc9b6d2024ea.1920x1080.jpg?t=1654500336,https://cdn.akamai.steamstatic.com/steam/apps/1449230/ss_5159c9a6a193fde6ad4ca7b45bf2440354824266.1920x1080.jpg?t=1654500336",
    "Slug": "glitchhikers-the-spaces-between",
    "Meta Title": "Glitchhikers: The Spaces Between: Mar 31, 2022, Silverstr...",
    "Meta Description": "Looking for information on Glitchhikers: The Spaces Between? Check out the release date (Mar 31, 2022), developer insights from Silverstring Media Inc.,...",
    "Alt Text Image": "Official header image for Glitchhikers: The Spaces Between game - Steam 1449230",
    "Canonical URL": "https://gusku.site/game/glitchhikers-the-spaces-between",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Glitchhikers: The Spaces Between\", \"description\": \"Looking for information on Glitchhikers: The Spaces Between? Check out the release date (Mar 31, 2022), developer insights from Silverstring Media Inc.,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Silverstring Media Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fellow Traveller\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1449230/header.jpg?t=1654500336\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}