{
    "AppID": 369990,
    "Name": "Gremlins, Inc.",
    "Release date": "Mar 10, 2016",
    "About the game": "This is an intense strategy board game in a steampunk world of corrupt capitalist gremlins who compete for money, political power and prestige. Save and invest, steal and extort, arrest and get arrested – in single-player and multiplayer, with ranks and ladders, team mode and spectator mode. Featuring seasonal content updates, regular tournaments, item drops, full support of Steam Community Market – and more! HOW DO YOU PLAY THIS GAME? Gremlins, Inc. is designed for up to 6 players, in multiplayer or in single-player mode (with AI bots). Each player has 6 cards on their hand (replenished from the same deck) and uses them either to move around the playing field or to perform different game actions. There is a lot of interaction with other players, and duels are significantly different from 3-player or 4-player games. You can play until a certain score limit, or until agreed number of rounds, or for time limit. The game offers both custom and ranked sessions (with matchmaking by rating). CAN YOU PLAY IN TEAMS OR JUST WATCH? Yes, you can! In addition to custom sessions (where you define the parameters of the session and may optionally set filters for those who can join you) and password-protected private sessions (so that you and your friends can play undisturbed), the game offers team mode (2x2, 3x3, or 2x2x2) with teams of human players and/or AI bots. Gremlins, Inc. also supports a built-in spectator mode , which allows you to watch sessions of other players right from inside of the game, sharing your emotions with players and other spectators through messages and emoticons. CAN YOU PLAY THIS GAME OFFLINE? Certainly! When you buy this game, you get 2 products in your Steam Library: Gremlins, Inc. – the edition that is playable online in single-player and multiplayer modes, with full support of item drops and Steam Workshop; and Gremlins vs Automatons – the edition that is playable offline in single-player mode, without any connection to our server whatsoever. HOW LONG DOES IT TAKE TO PLAY ONE SESSION? The game offers different session settings to make them fit your available time, and single-player mode offers automatic SAVE / LOAD function at every turn so that you can take a break whenever you want (while multiplayer mode offers re-connect functionality as long as the session is still in progress). A quick duel for 20 score points with a fast timer can finish in under 20 minutes, while a 4-player session for 60 rounds can last for 2 hours or more. SHORT-TERM AND LONG-TERM STRATEGIES? There are different types of cards in the game (permanent, regular, secret and criminal) and as each card can be used either to move or for action, you will develop both short-term and long-term strategies for making the most out of where you are, and what you currently have in your hand. Normally, you spend half of your game time accumulating resources and building the foundation for the end-game, and the other half trying to control the progress of your opponents (stealing, arresting, initiating player conflicts, and so on). The more you play, the more new strategies you will discover – especially when combining the effects of several cards played in a combination. MAKE DECISIONS, PLAN YOUR MOVES This is an intense strategy game : make decisions at every round! Plan your moves, then adjust to the actions of the other players and new cards drawn. The design of the playing field and the multiple layers of optional features (that you can turn on or off, as you wish) allow for a variety of strategies. The more you play, the more roads to victory you discover, using a combination of features based on the particular setup of the session. The game offers a diverse resource system that allows for many comeback chances even after you're robbed or arrested (or both). With score, money, votes, malice, income and bribes, the tension often remains until the very last round. The multilayer mode of the game features a system of ratings , ladders and ranked sessions : compete in a specific league, and take part in the regularly organised tournaments with over 1 000 participants. A system of anonymous masks allows everyone to compete on equal terms in a ranked session. Every season since its release in 2016, the game receives FREE content and feature updates (balancing changes, new cards, new in-game items, new music). We are committed to continue developing this product – based on player feedback! Additionally, the game offers over 10 single-player challenges plus the option to create custom single-player sessions with different settings and a different mix of AI bots. Finally, there's the team mode where victory is determined not only by strategic skill, but also by communication and coordination of each team, which is an entirely different layer of game mechanics. FACTS &amp; FIGURES 201 cards in the main deck (171 of them – unique): permanent, regular, secret and criminal, each with a hand-drawn steampunk illustration; with each Season update, we keep adding several new cards to the deck. 40 events in the Misfortune deck : these are the special events triggered at certain moments in the game, and may affect the current standing of all players to a significant degree, especially when used on a specific opponent. 6 special Chaos Cards : this is an optional set of cards available to every player in the game; turn them on or off to change the dynamics of the session. 12 sets of Character Abilities : another optional feature that brings to the game special game mechanics unique to each character type; playing with these makes different competing strategies even more pronounced. 11 original locations : the Office, the Plant, the Dump, the Marketplace, the Inferno, the Jail, the Casino, the Court, the Treasure, the Bank and the Astral Plane; and 7 original spot types : Risk, Gamble, Police, Income, Bribe, Misfortune and Tribune. 2 distinctly different playing fields : The Clockwork Town and The Clockwork Colony, each offering strategic challenges of their own. Finally, the game took us three years to develop from concept to full release, and we're still committed to continue supporting the community through development of new content. There are currently over 150 000 players of Gremlins, Inc. on Steam from all over the world, including USA, Russia, China, Japan, UK and France. Collectively, players already launched several millions game sessions! FINALLY, WHO ARE THE GREMLINS? You think that’s just a pocket watch in your hand, a watch that’s a bit late because you keep forgetting to wind it up? No, no and no – you couldn’t be further from the truth! What you carry around is a whole gremlin town packed into this tiny mechanism: a town with its own bank, its own casino… and even its own jail! Gremlins are the microscopic creatures that inhabit any mechanism that they can possibly infiltrate. If a watch or a telescope malfunctions, then it’s probably due to gremlins who took up a residence there. More than anything in life, gremlins value money , political power and prestige : prestige that one can claim after completing some sort of a grandiose engineering project. Aside from working on their own projects, gremlins mostly spend their time preventing other gremlins from building something even more grandiose. This they achieve through bribing officials and lying to the electorate, as well through stealing from their competitors - and outright arresting them. A DISCLAIMER (JUST IN CASE) We felt it important to note that Gremlins, Inc. is not a free-to-play game. Also, this is not a CCG or TCG: you do not need to buy boosters or packs; in every session the game offers the same deck to every player, and everyone's chances are equal. OUR DLC POLICY We released Gremlins, Inc. on Steam in Early Access at the end of 2015. Since then, we released over 100 game updates as we continue to add more content and more features as well as improve the overall player experience. This is what we typically add to the game with the regular free updates of the game: * new features and new mechanics * new cards and new Misfortunes * new music tracks and new game themes (for special occasions such as Lunar New Year) These seasonal updates are available to every owner of the game for FREE, regardless of DLC ownership. And this is what we release as paid DLC: * new character portraits and player tokens * new music tracks and new game themes * new trails, frames and emoticons * new single-player content If you enjoy Gremlins, Inc., you can support our development efforts by purchasing its DLC. However, there is absolutely no pressure to own any of the extra content in order to play the game or compete in the tournaments. STEAM COMMUNITY MARKET, CRAFTING AND ITEM STORE Gremlins, Inc. features in-game items and fully supports Steam Community Market . While playing the game, certain actions will trigger random chest drops with items of varying rarity: it could be a new emoticon, a new profile background, a new music track, or one of the dozens of other cosmetic items. These items are FREE, yours to use or trade on Steam Community Market . We, the developer, do not engage in the direct sales of any drop items; only players can trade them. The game also supports crafting : once you find a blueprint of a specific item, you can create as many such items as you wish, as long as you have the required number of charges (you get charges when you convert other in-game items that you do not want, or have multiple copies of). Finally, the game has its own Steam Item Store where we sell a very small number of unique items that influence the item meta-game (but they have no effect on the game mechanics). ONLINE &amp; OFFLINE VERSIONS Gremlins, Inc. was designed as a digital board game with the multiplayer mode at its heart. However, this is not to say that we don't like single-player – we do, and there's a separate section with the single-player challenges as well as the mode where you can create any custom single-player session that you like! One of the products that you receive with this game, Gremlins, Inc. , features both single-player and multiplayer modes, and requires that your game client is connected to both Steam and the game's server at all times – in order to support item drops, Steam Community Market and Steam Workshop. The other product that is included with the game, Gremlins vs Automatons , features single-player mode and is designed specifically to be played offline.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/369990/header.jpg?t=1643379992",
    "Price": 14.99,
    "Developers": "Charlie Oscar Lima Tango Interactive Entertainment",
    "Publishers": "The Merchant Guild of Rund (Limited)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_049bac45337e1a294eaf98d82b1eeb71ea6e72ae.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_564df008a82f3103a0efc2ca849e5ee7a5f9465d.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_f49ceb8ea81202fbba23e38ac945d83b10138222.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_820ae0a9c4fa4c104efc2dbb2c5e7d802d738120.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_8757bb1e281f05d3ef7a1626602f6ca248e3a344.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_6dfe529cd75f8069789d011a3cd8ed7d658c1953.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_d7761b43b916a91f94194ac1366fa9b1691b3f71.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_50ed935b3a34eaccf1c0f5aa2e706fd12f6a615a.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_cb170eed34936b16ed3408769d94f98bdcef8d1d.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_1c7f8fdbf98622d017914ff71e77317958cc19d3.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_bf5706257cff1024727f9496bc722b86d3b28429.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_93306e64db68f0065f153d9a84882463d43424d0.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_2f8772c314fecb8908449b5755d960478d1253fd.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_056b2419f514e2a952ee154ee245f88ab8ca73cd.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_fcbfc2b508547b4655afea7e594b3c9c521625a1.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_908fb823a1bc15978f1cd7ef030bbae9ba7f6db9.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_d721d6668b396cd7c1bfbc02c745732a54bf0a3d.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_7c6cac223829fe7128805ef651e6f6b8e307b5dc.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_2f02e29de6dae304ee4baf2719e9153d7eb0ac2f.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_dbbd12810f4d2b05b835a33a62b343ee0f9e09d7.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_4de739c692db54784b7dad8482c34013cc4b6ed4.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_95d08f76af3b0c0fc223db012317b561784b7371.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_f1c207cd8eec2bdc46a3b58b5710402571013b13.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_43e7209e1b99926d43e0fdbad171f296316fd8a2.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_1011b0afdeb82ef747e428555ce764b4776f7e56.1920x1080.jpg?t=1643379992,https://cdn.akamai.steamstatic.com/steam/apps/369990/ss_c407497efa9f0f305a4e13846ddba3e2e2e988e2.1920x1080.jpg?t=1643379992",
    "Slug": "gremlins-inc",
    "Meta Title": "Gremlins, Inc.: Mar 10, 2016, Charlie Oscar Lima Tango In...",
    "Meta Description": "Looking for information on Gremlins, Inc.? Check out the release date (Mar 10, 2016), developer insights from Charlie Oscar Lima Tango Interactive Enter...",
    "Alt Text Image": "Official header image for Gremlins, Inc. game - Steam 369990",
    "Canonical URL": "https://gusku.site/game/gremlins-inc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gremlins, Inc.\", \"description\": \"Looking for information on Gremlins, Inc.? Check out the release date (Mar 10, 2016), developer insights from Charlie Oscar Lima Tango Interactive Enter...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Charlie Oscar Lima Tango Interactive Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Merchant Guild of Rund (Limited)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/369990/header.jpg?t=1643379992\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}