{
    "AppID": 1535780,
    "Name": "Imp of the Sun",
    "Release date": "Mar 24, 2022",
    "About the game": "Imp of the Sun is a non-linear 2D Action-platformer that combines fast-paced combat and exploration set across a stunning Peruvian-inspired world, from the bright peaks of the Andean mountains to the dense Amazonian jungles and much more. You play as Nin, an Imp created from the final spark of the Sun, who is sent on an adventure to defeat the Four Keepers and restore the Sun’s power, ending the Eternal Eclipse before the world is plunged into darkness. End the Eternal Eclipse Stolen by the Four Keepers centuries ago and hidden in the distant corners of the Empire, life cannot go on without the Sun’s power. With its dying spark the Sun creates Nin, sending him on an adventure to bring back the light and restore balance to the Empire. Use your Inner Fire As a creature of the Sun, you have the power of its flame at your fingertips. Refine your skills in streamlined gameplay built for fluid movement and combo-based combat and discover new abilities to become more powerful as you venture across the Sun’s Empire to defeat the Four Keepers. Explore, Collect and Learn Our ancestors recorded their history through artefacts known as ‘Quipus’. Collect Quipus to unveil the story behind the Eternal Eclipse, and find unique hidden items based on real relics from the Andean cultures. Explore the Sun’s Empire and defeat unique, punishing bosses in any order you choose; each with their own complex mechanics and backstory. A Stunning Peruvian-Inspired World Discover the four corners of the Empire, from the bright peaks of the Andean mountains and dense Amazonian jungles, to dry, blistering deserts and the dark depths of the underworld. Every land and creature are lovingly hand-drawn and crafted with detail, celebrating the civilizations that once roamed and ruled Peru. Features Streamlined gameplay built for fluid movement and combo-based combat. Unique Peruvian-influenced art style and soundtrack, inspired by real-world relics of the Andean culture. Experience five unique and punishing bosses in any order you choose each with their own complex mechanics and backstory. Keep powering up as players learn how to better control the Imp and its power and navigate the environments. Imp of the Sun is built to be played and then re-played, players may even find short cuts along the journey. Play Eclipse Mode for the authentic experience in a darkened kingdom, with all areas shrouded in total darkness until explored by the Imp. Join our Discord:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1535780/header.jpg?t=1650620509",
    "Price": 19.99,
    "Developers": "Sunwolf Entertainment",
    "Publishers": "Fireshine Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1535780/ss_14b9e1603ff09d507ec9e184450cddd9f940c12d.1920x1080.jpg?t=1650620509,https://cdn.akamai.steamstatic.com/steam/apps/1535780/ss_cc2649765690c25d28edd0d9cd8084e8ebaeee6e.1920x1080.jpg?t=1650620509,https://cdn.akamai.steamstatic.com/steam/apps/1535780/ss_ab0ed0585d5aacc7f1223b39e7cce320c2823739.1920x1080.jpg?t=1650620509,https://cdn.akamai.steamstatic.com/steam/apps/1535780/ss_3b4496db28e30c88c183181dae954396c68e5818.1920x1080.jpg?t=1650620509,https://cdn.akamai.steamstatic.com/steam/apps/1535780/ss_ab45b69443abce4da3b9dbb9c848b641d1bd27b1.1920x1080.jpg?t=1650620509",
    "Slug": "imp-of-the-sun",
    "Meta Title": "Imp of the Sun: Mar 24, 2022, Sunwolf Entertainment and F...",
    "Meta Description": "Looking for information on Imp of the Sun? Check out the release date (Mar 24, 2022), developer insights from Sunwolf Entertainment, and a complete game...",
    "Alt Text Image": "Official header image for Imp of the Sun game - Steam 1535780",
    "Canonical URL": "https://gusku.site/game/imp-of-the-sun",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Imp of the Sun\", \"description\": \"Looking for information on Imp of the Sun? Check out the release date (Mar 24, 2022), developer insights from Sunwolf Entertainment, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sunwolf Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fireshine Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1535780/header.jpg?t=1650620509\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}