{
    "AppID": 1461100,
    "Name": "International Basketball Manager 22",
    "Release date": "Dec 16, 2021",
    "About the game": "Become the best basketball coach of the moment with International Basketball Manager 2022. Take your team to the pinnacle of the sport by managing all its day-to-day affairs with the seemingly endless array of management tools that the game offers you. Your team’s results will depend on you. Can you handle the pressure? The new International Basketball Manager 2022 has been developed from scratch. The game’s interface and all its screens have been totally redesigned, making day-to-day management of your team far more realistic. You will have 20 leagues from different countries at your fingertips, a total of over 330 teams and up to 5,000 players, allowing you to demonstrate your skills in managing a team at any level. The two most important European competitions, the Turkish Airlines EuroLeague and the 7Days EuroCup, both have an official presence in the game. Other licenses as acb and FEB (Spain), LNB (France), HEBA (Greece), BSL (Turkey), BNXT League (Belgium/Netherlands) and LNB (Chile) will also have official presence within the game. GAME SIMULATION 2D mode: Follow the game minute-by-minute and take control of your players in real time, making tactical changes and assigning specific plays to a player. You will be able to follow all the incidents that occur during a match through text messages and through “badges” that allow you to see your players’ movements in offense and defense on court. Result mode: Follow the match scoreboard at the end of each quarter. Consult the final match statistics and analyze your team’s strengths and weaknesses. Coach intervention: Regardless of whether you play in 2D or result mode, you can decide to intervene in the key plays during the match. The action will stop at key moments during the match and you will have to make a decision as a coach. You are losing by two points and you have the last possession of the match. Do you decide to take the match into overtime or go for the win with a three-pointer? Which player is going to take the shot? You decide the level you want to assume as team coach. FEATURES Officially licensed by the Turkish Airlines EuroLeague and 7DAYS EuroCup. Match simulation modes: 2D and result mode with coach intervention. Two game modes: Manager: Choose your favorite team and lead it to glory, without worrying about your reputation as a coach. Career: Receive offers from more modest clubs to achieve your goals and improve your reputation as a coach. New coach intervention mode, in which you can decide if you want to intervene during the key plays during the match in both 2D simulation and result mode. More than 20 competitions from all around the world. Play the best leagues on earth, from the United States, Spain, Russia, Italy, France, Greece, Germany, Australia and many more countries. Not forgetting the two best European competitions! Over 15 characteristics (physical, mental, attack, defense, adaptation and loyalty to the team) in order to define the players. New player progression system. Get an idea of the level that a player can reach and improve his progression during his time as a junior, giving him his first chances in the senior team. Specific training for each player in order to improve their qualities depending on the skills of the technical team, the player’s age and his progression. Sign, loan, transfer and fire players to adapt your squad to your needs. 3D recreation of the team’s arena with multiple details that you can change and expand (stands, lighting, locker rooms, scoreboard, retired jerseys). Modular stand construction for arenas with a capacity of up to 25,000. Extension of the team museum in 3D that allows you to visualize real trophies from all the competitions you have won, as well as the retired jerseys of team legends from each team and of the players who have retired during the game. Historical records and real roles of honor for each competition. Highest scorer in the team’s history, the best rebounder, passer, blocker etc. Will any player in your team be able to break one of these records in a competition? Set up a good scouting system and send them around the world to discover the most promising young players in the sport before anyone else.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1461100/header.jpg?t=1658483785",
    "Price": 24.99,
    "Developers": "UPLAY Basketball",
    "Publishers": "UPLAY Online",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_6d500e6b911f7bb948954f39bfe24805c53fea4f.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_3e933c0ba67e5ea33555ece1b7d0dd0cea69eb1b.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_ccd67bd12aeb16ea1832673cc4d28e3440017ff6.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_5216078e891b4cecfdd38294f7898c1f833bd3b6.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_a54b5a06c35badff7551e027954403b72e09143e.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_6acad64a072c4ec646755820fc725b908fe489bc.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_c527f3a8592a23968ad8249807acac07db27c118.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_3ce77e81a0cceca483d0507cfe09c777ccfdc6e2.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_dac45bf539b15acb3d006269245ed3a6b120fd52.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_fc9e031fa45fafaa88d7dff7d03b6dd20e105408.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_1ce53deeb89ddb84529a38342a1937576d0d0842.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_1b26c774a21638b06bba5b949fafa29a060641fc.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_496f5e6bbbc9bc52f42b5f900bebb17b1b7082cd.1920x1080.jpg?t=1658483785,https://cdn.akamai.steamstatic.com/steam/apps/1461100/ss_97ce5b66f1e8c36ad5d1f75fad7c660195d958f1.1920x1080.jpg?t=1658483785",
    "Slug": "international-basketball-manager-22",
    "Meta Title": "International Basketball Manager 22: Dec 16, 2021, UPLAY ...",
    "Meta Description": "Looking for information on International Basketball Manager 22? Check out the release date (Dec 16, 2021), developer insights from UPLAY Basketball, and...",
    "Alt Text Image": "Official header image for International Basketball Manager 22 game - Steam 1461100",
    "Canonical URL": "https://gusku.site/game/international-basketball-manager-22",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"International Basketball Manager 22\", \"description\": \"Looking for information on International Basketball Manager 22? Check out the release date (Dec 16, 2021), developer insights from UPLAY Basketball, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"UPLAY Basketball\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UPLAY Online\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1461100/header.jpg?t=1658483785\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}