{
    "AppID": 989750,
    "Name": "Life In Helsinki",
    "Release date": "Jan 2, 2019",
    "About the game": "Welcome to Life in Helsinki, a visual novel. ABOUT Life in Helsinki is a beautiful collaboration that gives life to the characters created by Danilo Sanino. The story follows Lottie, a young graduate heading for Finland for an internship in a law firm. As you can imagine, nothing goes as planned and facing adversity, Lottie has to adapt, fight back or give up her dream of becoming a lawyer in Helsinki. FEATURES Learn fun facts about Helsinki. Read different replies based on players' choices. Meet charming (and not so charming) characters with multiple facial expressions. Enjoy a mixture of upbeat and emotional music score. Seven story chapters to unlock. QUOTE 'The clouds appeared like soft, battling marshmallows in the bright Finnish sky. From her seat on the train rushing through the fields, Lottie favored the smaller clouds and wished they would win over the larger ones. As if the battle of David and Goliath could still be a possibility in today’s competitive world. She clasped her thick travelling journal against her chest with unbridled emotions, her thoughts wandering to the past. After a demanding university education, she had finally graduated and acquired a law degree. It hadn't been easy, and at times she had thought of dropping out. Her father often told her, 'Nothing in life worth having comes easy'. He always used a tone of authenticity, but she felt he probably got the quote from an Instagram post. As she stared out of the train window remembering those words, nostalgia ran through her body and gave her a faint shiver. In her mind, the faces of the people she loved appeared from the shadows. Her close family, her good friends... and others who still found a place in her thoughts...even after so many years...Heading to Helsinki by herself, Lottie felt a sense of gladness which went beyond words. Before she’d left home, she’d drawn her dark eyeliner perfectly and wore her favorite wool scarf. Today, tomorrow, the day after, and forever after, she needed to make the best impression she could possibly make. During her last semester, a recruiter from a big law firm had contacted her to offer an internship in Helsinki. As soon as she had hung up the phone, she had bought her train ticket.' FINAL THOUGHTS Sit back and follow Lottie's journey in this colorful, family oriented, visual novel. Befriend a group of local artists and learn to live with new roommates. Participate in the narrative by helping Lottie with some day by day choices. Enjoy this slice of life visual novel that celebrates friendships, surmounting challenges and...espresso!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/989750/header.jpg?t=1634752796",
    "Price": 3.99,
    "Developers": "Doubleton Game Studio",
    "Publishers": "Doubleton Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/989750/ss_22acad4c2534ecf0d70f7a1bff3dffbfda2e66fb.1920x1080.jpg?t=1634752796,https://cdn.akamai.steamstatic.com/steam/apps/989750/ss_a239825e28fe67d8e6db50cb369dc83753c9d51b.1920x1080.jpg?t=1634752796,https://cdn.akamai.steamstatic.com/steam/apps/989750/ss_20b21c5c2223e9b9429eb751b9e2ce19b25e3656.1920x1080.jpg?t=1634752796,https://cdn.akamai.steamstatic.com/steam/apps/989750/ss_5073ccdb0f7364ddccda4ca7d723fe3ca448001e.1920x1080.jpg?t=1634752796,https://cdn.akamai.steamstatic.com/steam/apps/989750/ss_5442b1fbb69a17dce854c6397afe5f3596847f0a.1920x1080.jpg?t=1634752796,https://cdn.akamai.steamstatic.com/steam/apps/989750/ss_90c72449da4eb8ac12a8ac5cb551ddf44b82a135.1920x1080.jpg?t=1634752796",
    "Slug": "life-in-helsinki",
    "Meta Title": "Life In Helsinki: Jan 2, 2019, Doubleton Game Studio and ...",
    "Meta Description": "Looking for information on Life In Helsinki? Check out the release date (Jan 2, 2019), developer insights from Doubleton Game Studio, and a complete gam...",
    "Alt Text Image": "Official header image for Life In Helsinki game - Steam 989750",
    "Canonical URL": "https://gusku.site/game/life-in-helsinki",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Life In Helsinki\", \"description\": \"Looking for information on Life In Helsinki? Check out the release date (Jan 2, 2019), developer insights from Doubleton Game Studio, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Doubleton Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Doubleton Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/989750/header.jpg?t=1634752796\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}