{
    "AppID": 580540,
    "Name": "MonkeyKing VR",
    "Release date": "Feb 6, 2017",
    "About the game": "Nice cartoon Style; This game focus on highlighting the immersive experience of virtual reality features. For the players to bring immersive 'strong interaction' gaming experience. features: 1. It’s much more difficult than it looks and also more fun. Few can make it to Wave 15. Try your best to beat all the 20 waves! 2. To be a winner, you need to... a. Be decisive about where to put your guardians and move them wisely between Platforms. b. Locate guardians with the right skills to the suitable platforms. c. Collect money quickly enough to buy more and stronger guardians. d. Sell guardians at the right time to upgrade your squat, or you will fail the game soon. 3. You are challenged to move swiftly and think quickly. Decide your guardians, where to put them and how much money you’ve made and need within seconds. 4. The game suits you if you wish to burn more calories and if you are nimble both in body and minds. CAUTION!!! IT’S NOT A GAME YOU CAN PLAY WHILE SITTING STILL! controls: 1. Catch guardians and place them on the platform. 2. The guardians will automatically attack the invading monsters. 3. Guardians can move freely between platforms. 4. Guardians with higher prices have higher ATK. 5. Once you decide to sell a guardian, grab it and throw it up to the sky, then you will be returned with 80% of its original price. Use the money to buy guardians with stronger power! 6. When your guardians have killed a monster, remember to collect the valuable crystals burst into the sky. They can be used to buy guardians. story: The water god Gong Gong had tried to overthrow the fire god Zhu Rong. When Gong Gong failed, he became angry and rammed Imperfect Mountain with his head. The mountain, which supported the heavens, crumbled, tearing a hole in the sky and causing the ends of the earth to give way. The disorder that followed included fires and floods. (-Pa/Nu-Wa.html) Nuwa look for five-colored stones in order to patch up the azure sky. One of stones is in the Flowers Fruits Mountain. The demons around heard about it, so they try to snatch the stone.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/580540/header.jpg?t=1493999805",
    "Price": 0.99,
    "Developers": "Gene Games Technology",
    "Publishers": "Gene Games Technology",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/580540/ss_7880a9efc6aca8d920a015987df43727b4b7d85d.1920x1080.jpg?t=1493999805,https://cdn.akamai.steamstatic.com/steam/apps/580540/ss_1a6ecc948b87ebead1e06b82152e5d51778d0a07.1920x1080.jpg?t=1493999805,https://cdn.akamai.steamstatic.com/steam/apps/580540/ss_eac85fdcb6d60c90f5f430d5d60b6b2b5554f3dc.1920x1080.jpg?t=1493999805,https://cdn.akamai.steamstatic.com/steam/apps/580540/ss_837c5f78218e5cedf5950be33384801dc19b5041.1920x1080.jpg?t=1493999805,https://cdn.akamai.steamstatic.com/steam/apps/580540/ss_df55b6feca95e249e6530915f4ca273f1a52709b.1920x1080.jpg?t=1493999805",
    "Slug": "monkeyking-vr",
    "Meta Title": "MonkeyKing VR: Feb 6, 2017, Gene Games Technology and Ful...",
    "Meta Description": "Looking for information on MonkeyKing VR? Check out the release date (Feb 6, 2017), developer insights from Gene Games Technology, and a complete game s...",
    "Alt Text Image": "Official header image for MonkeyKing VR game - Steam 580540",
    "Canonical URL": "https://gusku.site/game/monkeyking-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MonkeyKing VR\", \"description\": \"Looking for information on MonkeyKing VR? Check out the release date (Feb 6, 2017), developer insights from Gene Games Technology, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gene Games Technology\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gene Games Technology\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/580540/header.jpg?t=1493999805\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}