{
    "AppID": 1593310,
    "Name": "NEKOPARA - Catboys Paradise",
    "Release date": "Jul 15, 2021",
    "About the game": "Meet your catboy heartthrob in NEKOPARA - Catboys Paradise! STORY Your grandfather has recently passed away and you end up inheriting his café and house. You intend to keep the café running as a tribute to your grandfather, but you have no idea as to where to start. That's when a school gets in touch with you and asks if you are willing to host some trainees who have some experience in running a café. You take the offer without much hesitation. To your surprise, however, the trainees are not four humans but four humanoid cats! Humanoid cat workers aren’t that rare these days, but this is still your first interacting with one. And thus, your story begins as you work alongside four catboys! CHARACTERS Laurier (CV Kaito Ishikawa) Breed: Khao Manee Height: 182cm 'The sleepy prince who does things in his own way' Laurier appears to be a lazy catboy that takes naps whenever he can. When it comes to work, however, he always does his job perfectly. Due to his friendliness and handsome appearance, he is very popular with female customers. He is actually a talented catboy who can achieve anything if he sets his heart to it. Fennel (CV Wataru Komada) Breed: American Burmese Height: 178cm 'The supportive catboy who aims for perfection' For the sake of you and the café, Fennel strives to provide you with useful advice. He is a hard-working perfectionist who sets high standards for himself. Since he sleeps less in exchange for more time to study, nobody has actually ever seen him sleeping. Sage (CV Yuuichirou Umehara) Breed: Bengal Height: 190cm 'The strong, yet kind-hearted older brother' Sage is a catboy that's rough with words, but he always takes care of everyone like an older brother. He is a big-hearted catboy who does not care too much about details. He never hesitates to offer help whenever he can. Dill (CV Junya Enoki) Breed: Calico Height: 174cm 'The adorable catboy fashionista' Dill is a very approachable catboy who can make friends with practically anyone. He is a big fan of fashion, which explains why his biggest worry is buying too many clothes. Sometimes he picks clothes for you or helps you with makeup. FEATURES Visual novel with 4 routes for each catboy! Japanese voice acting Japanese, English, Chinese language options CG Gallery Mode STAFF Character Designer: G Yusuke Story: Yuki Yuno Music: POPHOLIC Video Production: Nirai-kanai Producer: Sayori",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1593310/header.jpg?t=1634864205",
    "Price": 0.0,
    "Developers": "NEKO WORKs",
    "Publishers": "Sekai Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_1c522a01fe14d06e0580657a390d077195758314.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_d120212199581227d5c9745e404ad21624c8ab84.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_bc921c4f396288985921c912ca91100e0979e5b2.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_0c9ed2bdb26c33c32b9be939658cabc0b327439d.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_c39fc0441efc58896341dfd454b4426e07886816.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_b7f3ed4c1453bec60b2d03b34aa7ce476ccec102.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_67b8da89b2d323898a148ce06e2ce9947a94d115.1920x1080.jpg?t=1634864205,https://cdn.akamai.steamstatic.com/steam/apps/1593310/ss_76528810200c684857a43b60547cbdc80e0796e4.1920x1080.jpg?t=1634864205",
    "Slug": "nekopara-catboys-paradise",
    "Meta Title": "NEKOPARA - Catboys Paradise: Jul 15, 2021, NEKO WORKs and...",
    "Meta Description": "Looking for information on NEKOPARA - Catboys Paradise? Check out the release date (Jul 15, 2021), developer insights from NEKO WORKs, and a complete ga...",
    "Alt Text Image": "Official header image for NEKOPARA - Catboys Paradise game - Steam 1593310",
    "Canonical URL": "https://gusku.site/game/nekopara-catboys-paradise",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NEKOPARA - Catboys Paradise\", \"description\": \"Looking for information on NEKOPARA - Catboys Paradise? Check out the release date (Jul 15, 2021), developer insights from NEKO WORKs, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"NEKO WORKs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1593310/header.jpg?t=1634864205\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}