{
    "AppID": 476410,
    "Name": "One Small Fire At A Time",
    "Release date": "Jun 10, 2016",
    "About the game": "In Overture, magic can cure all diseases, but not those of the mind. Society looks down on those whose illnesses are incurable by magic, and these 'lunatics' must stay in madhouses until they recover their sanity—if they ever do. But no one has a worse madness than 13-year-old Janis—not even those who long for death, or live in constant fear, or see and hear the unreal—because in a city where everyone can use magic, Janis alone can't. 'Magic Deficiency Disorder,' they call it. Her disability makes Janis an easy target for bullying, but she still fights back despite always losing. One day, she is saved from her bullies by Aidan Woolf, a powerful mage and police commander. In Woolf, Janis finds a father figure, but the commander didn't come to her madhouse just for a visit. He has a mission. Characters: Janis Janis has lived in a madhouse since she was a small child because she suffers from what many people call the worst madness ever - she can't use magic. Between her so-called 'magic deficiency disorder' and the bullying she has to endure every day because of it, Janis is ready to give up hope, but her life is about to change... Aidan Woolf As the commander of the Overture police's most elite special forces unit, Aidan Woolf comes to the madhouse on a mission from the king himself. There he meets Janis, a teenage girl who reminds him of the daughter he lost many years ago in an incident that transformed him into a hardened warrior who puts duty above everything else. Candela Carroll Her sketchbook is the only thing in the world that can hold Candela Carroll's attention for more than five minutes, but she's Janis's best friend at the madhouse. However, since she's three years older, Candela will be forced to leave the children's ward before Janis does, and that time may come sooner than they think. Drake Perrault Drake is a bully. He and his friends - or, rather, his underlings - especially like to pick on Janis because they see her as a helpless girl who can't defend herself. But his friends and victims don't know that, for Drake Perrault, bullying is a way to cope with his condition. Ena Polidori Though a little clumsy, Ena Polidori is the children's favorite nurse. She volunteers to teach Janis magic, much to the younger girl's displeasure, and always encourages her to keep trying. Things get awkward between Ena and Joff Godwin after she mistakes the young lord as a new patient at the children's ward, but that might not necessarily be a bad thing... Joff Godwin Lord Godwin recently founded Magical Mechanical, a company that researches and manufactures magic machines. With his aristocratic status and his position in the new magical engineering industry, he helps Commander Woolf's investigation by approaching the madhouse's owner with a business proposition. Johann Poe As one of the most well-known and respected magical scientists in Overture, Professor Poe uses his extensive knowledge of magic to assist Commander Woolf in his investigation. But will he also learn something from his time at the madhouse? Alanis Blyton Professor Poe considers her to be one of the brightest students he has ever taught, but Alanis Blyton sometimes wonders if magical science is the right field for her. Instead, she often finds herself poring over psychology textbooks. Colton Sherwood The madhouse is not a correctional facility, Colton Sherwood believes. He built his madhouse to give lunatics a place where they can be who they are, where they don't have to be 'normal,' where they can be safe from the outside world. Oriel Sherwood Oriel Sherwood is a magical scientist, but her main job is to help her husband operate the madhouse. Because she and her husband don't have children, they care for the children at the madhouse as if they were their own.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/476410/header.jpg?t=1572869081",
    "Price": 9.99,
    "Developers": "Kidalang",
    "Publishers": "Culture Select",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/476410/ss_f47fedd2f01d13ad55b1ad657125c011c99f32ab.1920x1080.jpg?t=1572869081,https://cdn.akamai.steamstatic.com/steam/apps/476410/ss_41589f901521532845077c7578e846d6146eae3d.1920x1080.jpg?t=1572869081,https://cdn.akamai.steamstatic.com/steam/apps/476410/ss_552b979f1b9350d9e91947766dbe5191bf52718d.1920x1080.jpg?t=1572869081,https://cdn.akamai.steamstatic.com/steam/apps/476410/ss_c04dd4bafa72f714d1c0f926b498165d6acd39ce.1920x1080.jpg?t=1572869081,https://cdn.akamai.steamstatic.com/steam/apps/476410/ss_104508501b9c937446a8f300e24b08427e22972b.1920x1080.jpg?t=1572869081",
    "Slug": "one-small-fire-at-a-time",
    "Meta Title": "One Small Fire At A Time: Jun 10, 2016, Kidalang and Full...",
    "Meta Description": "Looking for information on One Small Fire At A Time? Check out the release date (Jun 10, 2016), developer insights from Kidalang, and a complete game su...",
    "Alt Text Image": "Official header image for One Small Fire At A Time game - Steam 476410",
    "Canonical URL": "https://gusku.site/game/one-small-fire-at-a-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"One Small Fire At A Time\", \"description\": \"Looking for information on One Small Fire At A Time? Check out the release date (Jun 10, 2016), developer insights from Kidalang, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kidalang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Culture Select\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/476410/header.jpg?t=1572869081\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}