{
    "AppID": 978980,
    "Name": "Paradigm Blast",
    "Release date": "Jan 18, 2019",
    "About the game": "Lost in a blizzard, four people find shelter in a mysterious castle, when the giant doors slam shut behind them. Now trapped inside with something horrible closing in, they frantically search for the means to get out. Classic Couch Co-op in a Groovy Castle: Play side by side with your friends in this zany party mode! In the Fang Castle game mode, players are given 20 seconds to search their surroundings for keys and key fragments. 6 key fragments combine into a key, and 10 keys wins the game! After the 20 seconds are up, a flash of lightning transitions the players into a random mini-game. Winning the mini-game awards them with key fragments, depending on the place they achieved, and then sends them back to Fang Castle, where they continue the search! 8 poppin' characters to play as! Saffron: A bloodthirsty woman who's out for justice! Angel: A retarded high-school student! Dangerous Man: An evil scientist midget! Blak Black: A tough cop who lives the badge! Col. K. Wolf: A carnivorous monster with an ego! Sombrero: A Mexican mercenary from the suburbs! Young: A bad boi with big dreams, who's heading to the top! (He may even be the son of cowboy outlaw Dallas Fort Texas, who knows!?) Vendetta: A gangster that dislikes guys like Young! 12 Bombin' Mini-games and local Clown Mode! The Mini-Game Select mode allows players to enjoy any of the 12 mini-games spontaneously! For example... Rooftop Race: Jump across the rooftops and see who survives to the end! Socks and Shoes: Wake up, eat breakfast, brush your teeth, shower, and get your socks and shoes on! Wolf's Kitchen: Listen to the chef and throw in the right ingredients, lest you become part of the stew! SCREAMER: Search for the exit of a graveyard, and use your flashlight if something comes after you! The dippin' online Clown Horde mode, where you try to survive as many waves as you can! The Online Mode has players going up against unending waves of clowns! Players can heal each other and help one another up when downed, and each character has different health, movement speed, and attack styles! Use Para Points earned in each mode to unlock extra colors and characters!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/978980/header.jpg?t=1631135552",
    "Price": 0.99,
    "Developers": "Kurt Russell",
    "Publishers": "Kurt Russell",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/978980/ss_9b4e9d18ef278398da28bee3b2b059628a1991be.1920x1080.jpg?t=1631135552,https://cdn.akamai.steamstatic.com/steam/apps/978980/ss_8d3f4c1da45c80b7e110f6b381c3d1216bd8805c.1920x1080.jpg?t=1631135552,https://cdn.akamai.steamstatic.com/steam/apps/978980/ss_664f4d8fb974bcac5357bd3e791fb6e9fc4f6114.1920x1080.jpg?t=1631135552,https://cdn.akamai.steamstatic.com/steam/apps/978980/ss_1898cc0b8b77ff0bcb945050d9c777888ff4c889.1920x1080.jpg?t=1631135552,https://cdn.akamai.steamstatic.com/steam/apps/978980/ss_73bdd5f9daff2f6d924dc534dd3d4a911480f12d.1920x1080.jpg?t=1631135552",
    "Slug": "paradigm-blast",
    "Meta Title": "Paradigm Blast: Jan 18, 2019, Kurt Russell and Full Overview",
    "Meta Description": "Looking for information on Paradigm Blast? Check out the release date (Jan 18, 2019), developer insights from Kurt Russell, and a complete game summary.",
    "Alt Text Image": "Official header image for Paradigm Blast game - Steam 978980",
    "Canonical URL": "https://gusku.site/game/paradigm-blast",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paradigm Blast\", \"description\": \"Looking for information on Paradigm Blast? Check out the release date (Jan 18, 2019), developer insights from Kurt Russell, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kurt Russell\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kurt Russell\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/978980/header.jpg?t=1631135552\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}