{
    "AppID": 1082940,
    "Name": "Pop'n'splat",
    "Release date": "Jun 4, 2019",
    "About the game": "How many gumballs can you have at once? How about all you can have? Go out on the street and check this old and forgotten gumball machinery. Arm yourself with your trusty mouse and enjoy action or puzzle-based play while you try to dethrone that pesky kid Kenny, from the high score table. There are four different game modes and each one offers different play style and challenges: Puzzle By Puzzle In this game, you can take all the time you need and play at your own pace as you clear all 90 levels (30 levels per difficulty setting) of different gumball arrangements. In every level, you can shoot a predefined number of gumballs before the entire level drops one line down making things a bit harder to finish. Time Attack This game is the total opposite to the Puzzle by Puzzle game and it's all about time here. Put your mind and reflexes to the test by trying to clear all gumballs before the required level time runs out. There is a total of 60 levels (20 levels per difficulty setting), and times for all levels are added together to get the total time that gives you access into the high score table. Infinite Popping There is no end in this game mode, so go infinite and try to keep up as long as you can before being overrun by the rows and rows of incoming gumballs. To make things a bit more interesting every so often a new gumball flavor will try to make its way into the play area, so do your best to shoot it down before it explodes and makes things all that more interesting. Target Practice No pressure here. Take your time to practice so you can be ready for other fun and challenging game modes, or you can simply enjoy popping and splatting without any worries. But you have to clear all gumballs in order to qualify for the high score. All games are divided into three difficulty levels. Easy, normal and hard. This allows you to start slowly and build your way through the more and more challenging play. Also, all games feature six save game slots so you can save your progress and continue playing whenever you want. Good luck and have fun dispatching countless colorful gumballs while enjoying full 3D graphics, playful fast-paced music and cartoony sound effects.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1082940/header.jpg?t=1568124937",
    "Price": 4.99,
    "Developers": "FunRefined",
    "Publishers": "FunRefined",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1082940/ss_f17fb44f126805d88f4ca9de20b8ac76181a3146.1920x1080.jpg?t=1568124937,https://cdn.akamai.steamstatic.com/steam/apps/1082940/ss_ca0565fe28ce8801d9fedd5573bc52144d2f0548.1920x1080.jpg?t=1568124937,https://cdn.akamai.steamstatic.com/steam/apps/1082940/ss_a3aee1b51ed217d123df607d3ad46cdb396c738f.1920x1080.jpg?t=1568124937,https://cdn.akamai.steamstatic.com/steam/apps/1082940/ss_f08af900890ab4faeee6f5975ee0bd65c8045d97.1920x1080.jpg?t=1568124937,https://cdn.akamai.steamstatic.com/steam/apps/1082940/ss_1703cf839ee49f005cc66d57953dcbf2ae56e287.1920x1080.jpg?t=1568124937,https://cdn.akamai.steamstatic.com/steam/apps/1082940/ss_c8a76796bff9942c93ded04b9012393dbfbc319c.1920x1080.jpg?t=1568124937",
    "Slug": "pop-n-splat",
    "Meta Title": "Pop'n'splat: Jun 4, 2019, FunRefined and Full Overview",
    "Meta Description": "Looking for information on Pop'n'splat? Check out the release date (Jun 4, 2019), developer insights from FunRefined, and a complete game summary.",
    "Alt Text Image": "Official header image for Pop'n'splat game - Steam 1082940",
    "Canonical URL": "https://gusku.site/game/pop-n-splat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pop'n'splat\", \"description\": \"Looking for information on Pop'n'splat? Check out the release date (Jun 4, 2019), developer insights from FunRefined, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"FunRefined\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FunRefined\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1082940/header.jpg?t=1568124937\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}