{
    "AppID": 1954300,
    "Name": "Porcupine's Fate",
    "Release date": "Apr 20, 2022",
    "About the game": "Porcupine's Fate is an atmospheric first-person sci-fi horror shooter with puzzles, mysteries, and melancholic undertones. This is Chapter 1 in a six-chapter game. One day, every employee of Marsh Industries seemingly vanished. Unable to penetrate the state-of-the-art security system, police have asked The Agency for help. You're called in on a one-man mission to rescue any survivors, neutralize any threats, and retrieve the experimental AI brain Marsh has developed. What happened to the employees? Who is responsible? And what madness has this company created? Find tools and solve puzzles to advance further into the labyrinthian laboratory. - You were sent in with a gun and a flashlight. That won't nearly be enough equipment to combat the dangers you'll be facing. Not even close. - Thankfully, this lab is well-stocked with everything an intrepid adventurer needs to stay healthy and continue breathing, including a crowbar, a spray bottle and a screwdriver. Better pick up everything you can carry! - Unfortunately, all of these things and more are required to find your way through the locked and occasionally booby-trapped maze of doors and corridors that make up the Marsh building. Read the notes of survivors, the last emails sent before the disaster, and the bizarre bloody messages smeared across the walls. - Check the computers in case the emails sent on that fateful day hold a clue. And maybe you'll find schematics for the AI brain you were sent to retrieve. - Discover the terrible fate of those waiting to be rescued. Are any still alive? Will you find and rescue them or only find heartbreak? - And what to make of the messages written in blood. Why would anyone choose to communicate this way and what exactly are they communicating? Do you have the knowledge, quick wits and fast reflexes to navigate the horrors awaiting you in this high-tech nightmare? - It won't be enough to simple figure out the solution to a problem. You might need to rely on your extensive education to find the answer. - But even that might not be enough. As an agent you have sharpened your wit into a deadly weapon and you'll need to access it quickly in order to survive. - The dangers lurk around every corner and they are both visible and hidden. A twitchy trigger finger and a solid grasp of your abilities will be key. Or will you lose your mind venturing through the darkened, blood-soaked corridors, and take your anger out on every destructible object around you? - There WILL be times when you won't know what to do and you'll feel the walls closing in on you making the hairs stand up on the back of your neck. - Will you keep a level head and a calm composure when under this immense pressure? Or will you let off steam in an orgy of violent destruction? - Thankfully, there are plenty of every day objects littering this hellscape that are just waiting to be smashed, bashed and demolished. But better not make too much noise. They WILL hear you and they WILL find you, there in the dark, behind that door, hiding in the shadows. - Destruction might make you feel better but it could also make you feel deader. As in, like a doorknob (which you probably broke off with your crowbar). - They can hear the noises you make and it'll draw them to you like moths to a flame. That is, if moths could stab you, shoot laser beams or electrocute you. - Even the darkness is no cover. They have infrared eyes. Your only hope is to find a hiding place and pray they don't see you. And stay quiet. Will you survive? Or will you discover the only path takes you deeper and deeper into the realm of robotic insanity?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1954300/header.jpg?t=1652401252",
    "Price": 0.0,
    "Developers": "Rinostar Games",
    "Publishers": "Rinostar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1954300/ss_c4eee895949bfb61061521cdd8462a1ef598fde3.1920x1080.jpg?t=1652401252,https://cdn.akamai.steamstatic.com/steam/apps/1954300/ss_7d7e64973caed4dd2ae7b885379d810f5652f709.1920x1080.jpg?t=1652401252,https://cdn.akamai.steamstatic.com/steam/apps/1954300/ss_2202cb377b2b53d8fd8c72f9bbf811eb71589278.1920x1080.jpg?t=1652401252,https://cdn.akamai.steamstatic.com/steam/apps/1954300/ss_f424de91db350c04e86a2c570c9fd1b451427005.1920x1080.jpg?t=1652401252,https://cdn.akamai.steamstatic.com/steam/apps/1954300/ss_5f6e4dbea5d8406937cb51c5a923d291951427e0.1920x1080.jpg?t=1652401252",
    "Slug": "porcupine-s-fate",
    "Meta Title": "Porcupine's Fate: Apr 20, 2022, Rinostar Games and Full O...",
    "Meta Description": "Looking for information on Porcupine's Fate? Check out the release date (Apr 20, 2022), developer insights from Rinostar Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Porcupine's Fate game - Steam 1954300",
    "Canonical URL": "https://gusku.site/game/porcupine-s-fate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Porcupine's Fate\", \"description\": \"Looking for information on Porcupine's Fate? Check out the release date (Apr 20, 2022), developer insights from Rinostar Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rinostar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rinostar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1954300/header.jpg?t=1652401252\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}