{
    "AppID": 1788840,
    "Name": "Porcelana",
    "Release date": "Jan 21, 2022",
    "About the game": "Synopsis Porcelana ( Porcelain ) is a story of a girl who is perceived to be perfect by society but is actually more normal than others may think. This shows a reflection of reality where people wear masks to hide the darkness in their hearts. Although the story itself was written years back, we are wanting to share it with others in a new way through a visual novel format. We hope that this emotional story will touch your heart and be one that you remember. If you could change the past, would you? Isabella, your classmate, is someone you were never close to but someone you certainly noticed. One day however, you notice that Isabella stopped coming to class. You start to discover how important you were to her despite never even having a conversation with her before. She has left you notes in a particular way that takes you on a journey where you discover her past and meet the people who were important in her life. Be careful with what choices you make as they can impact the events and direction of the story. Isabella She was so pretty, with her beauty being indescribable. Her flawless smile was like staring at the clouds. She was the correct path among thousands of wrongs. She was always herself, not perfect, but the image of perfection. She was someone that you looked up to the most. Despite always seeming so delighted and happy though, you already realize just how miserable she was, even to the point where she was contemplating cutting ties to life and choosing death as her final escape. Camil You met Camil because Isabella left her a note too. You don't know too much about her just the fact that she is your classmate too. Maybe she has some beauty hidden under those cap and glasses. Dallen She is Caroline's mom. Dallen's work usually puts her at risk and that is why her greatest fear is that one day something could happen to her leaving her daughter alone. She is a loving mother and a very smart woman. Caroline She's the reflection of the purest innocence. She is a happy child even though she hasn't lived a perfect life, because she has lived hard moments in her short life. She has a fantastic imagination, which often results in her losing herself in her own dreams.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1788840/header.jpg?t=1653949816",
    "Price": 8.99,
    "Developers": "Pandita Studio",
    "Publishers": "Pandita Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1788840/ss_09208a5d86a27aa3918bb6100817f42a94bba9d9.1920x1080.jpg?t=1653949816,https://cdn.akamai.steamstatic.com/steam/apps/1788840/ss_d2b790f653de3359a623ecb8122e21e7009d3761.1920x1080.jpg?t=1653949816,https://cdn.akamai.steamstatic.com/steam/apps/1788840/ss_5efc542894183b0244f693daf995d487e3bfc0ae.1920x1080.jpg?t=1653949816,https://cdn.akamai.steamstatic.com/steam/apps/1788840/ss_8e7bb4eccca7d721493be1f47c1aef9f6910ebcb.1920x1080.jpg?t=1653949816,https://cdn.akamai.steamstatic.com/steam/apps/1788840/ss_57265fe38c949c923135bee6a31c11a2326a1ed4.1920x1080.jpg?t=1653949816,https://cdn.akamai.steamstatic.com/steam/apps/1788840/ss_9da64777b96867e1dcf945df26301566b3c953a4.1920x1080.jpg?t=1653949816",
    "Slug": "porcelana",
    "Meta Title": "Porcelana: Jan 21, 2022, Pandita Studio and Full Overview",
    "Meta Description": "Looking for information on Porcelana? Check out the release date (Jan 21, 2022), developer insights from Pandita Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Porcelana game - Steam 1788840",
    "Canonical URL": "https://gusku.site/game/porcelana",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Porcelana\", \"description\": \"Looking for information on Porcelana? Check out the release date (Jan 21, 2022), developer insights from Pandita Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pandita Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pandita Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1788840/header.jpg?t=1653949816\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}