{
    "AppID": 467520,
    "Name": "Power & Revolution",
    "Release date": "May 26, 2016",
    "About the game": "Discover the world's benchmark of geopolitical simulators today! In Power &amp; Revolution, the fourth generation of Geopolitical Simulator, become a Head of State of one or several countries of your choice and extend your influence on the world, or play as a legal or illegal opposition leader and get ready for the conquest to power! PLAY AS THE OPPOSITION Choose your political party or illegal organization and try to overthrow the powers that be by force, revolution or democratic election! Control the opposition forces, manage the party budget, talk to the media, take a position on legislative bills, start protest movements, win your independence, infiltrate the spheres of power, raise an army with the help of foreign countries or illegal groups and conquer all the territory or the capital city ! MOST REALISTIC DEPICTION OF CURRENT CONFLICTS Syria, Iraq, Libya, Ukraine, Nigeria, Yemen,... The world map includes all the war zones down to the smallest details : occupied territories, cities under seige, localized military units, international military bases, terrorist group manpower and equipment... CITY BATTLE PHASES Detailed maps of cities with main buildings, town squares and main roads and maps specifically for important capitals Lots of components to control : demonstrators, hooligans, armed extremists, rocket launchers, riot police, police vans, snipers, armored tanks... Progress through the scenario by capturing symbolic locations : parliament, television station, bank, headquarters, presidential palace, bunker,... A TOTALLY UNIQUE SIMULATION ENGINE The game engine, Geopolitical Simulator 4, includes over 600 data elements for each of the 175 playable countries and calculates their changes in real time throughout the game based on players’ actions. Some examples include popularity ratings, political relations, and economic exchanges between countries. Various organizations, including NATO, use the technologies in the Power &amp; Revolution simulator for education and training. Over one thousand playable actions. At the country’s helm, the player/head of state can act in many areas: budget, taxation (nearly thirty types of taxes), currency, economy (over 130 economic activities), foreign and domestic affairs, defense, society, labor, health, social security, education, environment, transportation, culture, and more. Propose bills to be voted on in Parliament, for example: setting social welfare benefit minimums, changing the retirement age, developing atomic weapons in secret, subsidizing the auto industry, hiring teachers, defining the powers of unions, setting speed limits on roads, regulating prostitution, creating an international film festival, etc. The player can also construct elements on the world map, which will change accordingly: nuclear plants, wind farms, military bases, pipelines, high-speed train lines, airports, and many more. PLAYABLE SCENARIOS More than twenty scenarios are integrated in the game, such as 'War in Iraq and Syria', 'Revolutions! ', 'Separatism', 'Mess in Ukraine', 'Libyan Chaos', 'Terror in Nigeria', 'Yemeni Puzzle', 'Threats in Somalia', 'American commitment against climate change', '2016 US Elections', 'Presidential Marriage'... Take advantage of highly precise world conflict maps with front lines, occupied territories, besieged cities, international military bases, personnel and equipment of terrorist groups... OTHER NEW FEATURES Update of geopolitic and economic data as of January 1st,2016 Detailed electoral campaign: televised debates, meetings, campaign budget, electoral platform, polls New redesigned and optimized interface Acceleration of simulation calculations with use of multithreading In-depth simulation of unemployment Evaluation, development and regulation of shale oil and gas Integration of reconnaissance and combat drones, mobile rebels camps Specific interface for multiple screens and 4K screens And new legislations, new characters, new organizations, new administrative regions… 200 new personnalities with 3D body and face animations. MULTIPLE INTEGRATED OPTIONS Game operating as single-player with a multi-country mode allowing play with several countries simultaneously Game settings: terrorist activities, probabilities of natural disasters, reactivity of the populations, outbreak of war Player ranking online and in real time Incorporation of your own photos, logos, names to make the game even more realistic Interactive tutorial and game help available at all times during the game (in beginner mode) Learn about geopolitics by playing the QUIZZ mode, including more than 3000 questions Enjoy different configurations with double screen or 4K screen offering a customized interface More than 16000 texts and 10 hours of dialogs. 100% in English",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/467520/header.jpg?t=1515589969",
    "Price": 49.99,
    "Developers": "Eversim",
    "Publishers": "Eversim",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_b4a316ea0cf2600c3dc7a97de6839d07f067ae17.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_aa10fb1505cb9c976a6cccf893cd716ce603ad39.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_f3c22fd995cb5d85220e93050774df8cc8b76169.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_4a8b1ba87cce00472b2a126dc9cef636b6537a20.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_386ebc58290d9b50d0375b22c589e7c85719de8d.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_d2eff5011883ce6106cbda359f9a6ca3ff0be0b7.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_be682cc42cf74aaaafc36bc1f51786f174257796.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_4841be9aefa5c109597acb8eb80deead1719912c.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_90d9e87bf50d197f396c795665dc50a8ac1eb0e0.1920x1080.jpg?t=1515589969,https://cdn.akamai.steamstatic.com/steam/apps/467520/ss_d2cf294ea69ab51c965f0fb63abed383115ce03a.1920x1080.jpg?t=1515589969",
    "Slug": "power-revolution",
    "Meta Title": "Power & Revolution: May 26, 2016, Eversim and Full Overview",
    "Meta Description": "Looking for information on Power & Revolution? Check out the release date (May 26, 2016), developer insights from Eversim, and a complete game summary.",
    "Alt Text Image": "Official header image for Power & Revolution game - Steam 467520",
    "Canonical URL": "https://gusku.site/game/power-revolution",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Power & Revolution\", \"description\": \"Looking for information on Power & Revolution? Check out the release date (May 26, 2016), developer insights from Eversim, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eversim\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eversim\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/467520/header.jpg?t=1515589969\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}