{
    "AppID": 436320,
    "Name": "Raw Data",
    "Release date": "Oct 5, 2017",
    "About the game": "Neo-Shinjuku - 2271. The massive and seemingly benevolent Eden Corporation owns the world. The elite hacker resistance movement SyndiK8 has unearthed the sinister reality behind Eden Corp’s newest line of robotic products. As one of SyndiK8’s elite operatives, your mission is straightforward: infiltrate Eden Tower, steal as much Raw Data as possible, and get out alive--bringing Eden Corp down in your wake. However, as the secrets behind Chairman Shiro’s new “Promotion” program becomes clear, the reality gets much more complicated. Does it really grant immortality? What is Eden truly collecting? It seems that Eden’s corporate veneer may be just a thin facade for something much, much worse. Built from the ground up for virtual reality, Raw Data ’s action combat gameplay, intuitive controls, challenging enemies, and sci-fi atmosphere will completely immerse you within the surreal environments of Eden Corp. Go solo—or team up with a friend—and become the adrenaline-charged heroes of your own futuristic technothriller. You will put your wits, boldness, and endurance to the test. Active VR gameplay turns you into a controller, with instant reflex access to an arsenal of advanced weapons and cutting-edge nanotech powers. Shared spaces with avatars and motion tracking encourage players to physically communicate through body language and environment interaction. Cool Features Active VR Combat: Utilize your body to dual wield pistols, slash and slice katanas, pump shotguns, deflect projectiles, do gun tricks, or even use your fists in close-quarters combat. Holster up and pull weapons off your body with physical loadout and check your stats on the in-game forearm display. Hostile Takeover PvP : Whatever side you’re on, this fight is personal. Featuring four hero classes with optimized abilities, balanced gameplay, intuitive “joystick” locomotion, as well as stealth and armor powerups, Raw Data: Hostile Takeover lets you battle it out in up to 5v5 matches across multiple king-of-the-hill maps. Duel Mode (coming soon!) also provides a unique 1v1 showdown experience for those who are bent on revenge. Choose Your Hero: What’s your fighting style? Choose from multiple badass heroes--Bishop, the Gun Cleric; Saija, the Cyber Ninja; Boss, the Street Merc; or Elder, the Rogue Hunter --with a variety of advanced weaponry, special abilities, combat techniques, and ultimates. Defy gravity, slow down time, charge up shots, crush enemies, boomerang your blades, unleash deadly bullet barrages, fling enemies into the air, and much more. Deadly Weapons and Defenses: Access a futuristic arsenal of firepower, from dual handguns and pump-action shotguns to iron knuckles and laser swords, as well as deployable turrets and holographic shields for extra insurance. Adaptable Enemies: Battle against swaths of murderous machines, including stealth ninjas, laser gunners, rocket heavies, jumping crawlers, exploder bots, flying drones, charger mechs, ion beams, towering megabots, and more. Cross-Platform Online Co-op: Bring along a trusted partner to cover your back no matter what platform they’re playing on. Team up in a shared co-op VR space that encourages social communication via body language, facial expression, and blended animation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/436320/header.jpg?t=1565043373",
    "Price": 39.99,
    "Developers": "Survios",
    "Publishers": "Survios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_74d89ad4d4e47c277f380dc4cd2da1c94249afba.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_bb23dfffc90a1abc1277d337a26fe88e4fe12117.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_c32bdf3d0ac7e90a8392e25a1b0a29640bd70ffd.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_48cbb65da595018718f699bcd17a22a24038d5d0.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_2a21a1f01d79763fe133b9dd548bda5b3d7239f4.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_08ebe2584403509fb6dd86599a283b1e24a47f57.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_5643b1e3b698a8986b14b4ea3e43b515a8ad4bf9.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_807484fb8ad1f3eb1fb1e17b22ea4363f9ec76de.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_9c70101506baffed8a81e7d7396906df62547c19.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_7a822d0a07a612b10e630ad9d6429bc8f95163ce.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_99722b10fe00154742317545947602e86650bd58.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_d5bde279d8f0d4d892e569a75df9255535f2667d.1920x1080.jpg?t=1565043373,https://cdn.akamai.steamstatic.com/steam/apps/436320/ss_e775622db5980c03ae0a852b19c2915b76529f3a.1920x1080.jpg?t=1565043373",
    "Slug": "raw-data",
    "Meta Title": "Raw Data: Oct 5, 2017, Survios and Full Overview",
    "Meta Description": "Looking for information on Raw Data? Check out the release date (Oct 5, 2017), developer insights from Survios, and a complete game summary.",
    "Alt Text Image": "Official header image for Raw Data game - Steam 436320",
    "Canonical URL": "https://gusku.site/game/raw-data",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Raw Data\", \"description\": \"Looking for information on Raw Data? Check out the release date (Oct 5, 2017), developer insights from Survios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Survios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Survios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/436320/header.jpg?t=1565043373\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}