{
    "AppID": 1449670,
    "Name": "Relics of the Lost Age",
    "Release date": "Jan 7, 2021",
    "About the game": "The Nazis are on the trail of six ancient magical artifacts powerful enough to crush all opposition and conquer the world. But they didn’t take one thing into account: you. Relics of the Lost Age is a swashbuckling 350,000 word interactive adventure novel written by James Shaw, where your choices control the story. It’s entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. It started out as a routine dig in Palestine. But soon you find yourself racing across the desert on a quest to track down a fabled ancient relic before the Nazis can get their hands on it. And that’s just the beginning. The Third Reich are mobilizing right across the globe, on the hunt for mysterious ancient Relics of Power, objects which could put unimaginable supernatural forces into the hands of the armies of darkness. And the only thing standing in their way is you. Step into the weathered boots of a swashbuckling 1930s archaeologist and strap in for a wild ride around the globe, finding adventure, romance, and mystery at every turn. Do you have what it takes to locate the Relics, vanquish your foes and save the world from a thousand years of darkness? Play as male, female, or non-binary; gay, straight, bi, poly, or asexual. Find romance with a fearless explorer, an exiled prince, a passionate archaeologist, or a tormented spy. Take on a rogue’s gallery of memorable and despicable villains, including the Nazis, the mafia, Triads, Klansmen, renegade soldiers, and ruthless treasure-hunters. Travel widely in a lovingly recreated 1930s world, exploring the deserts of Palestine, the high passes of Tibet, the noxious politics of Louisiana, the jungles of Congo, London’s cut-throat art-crime scene, and Hong Kong’s deadly Triad underworld. Experience epic gunfights, visceral brawls, and wild stunts in vintage vehicles. Uncover a sinister secret lost for millennia. Give priceless historical treasures to their true owners, sell them to the highest bidder, or decide that they belong in a museum. Archaeology Just Got A Whole Lot More Exciting.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1449670/header.jpg?t=1643811408",
    "Price": 5.99,
    "Developers": "Hosted Games",
    "Publishers": "Hosted Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1449670/ss_5f50b8606474bff66c6aaecbe4991f8b5ad01a8b.1920x1080.jpg?t=1643811408,https://cdn.akamai.steamstatic.com/steam/apps/1449670/ss_54835eff0b716abda09a576fb59d5acbcb20698b.1920x1080.jpg?t=1643811408,https://cdn.akamai.steamstatic.com/steam/apps/1449670/ss_844a8e44085fb2cc5e26937716ff7eebfdcba500.1920x1080.jpg?t=1643811408,https://cdn.akamai.steamstatic.com/steam/apps/1449670/ss_664aabcb86aa76cc463ebefd64b79a83e4355645.1920x1080.jpg?t=1643811408,https://cdn.akamai.steamstatic.com/steam/apps/1449670/ss_221c0ff06ae514984831aa810f9ef9d5404acdbe.1920x1080.jpg?t=1643811408",
    "Slug": "relics-of-the-lost-age",
    "Meta Title": "Relics of the Lost Age: Jan 7, 2021, Hosted Games and Ful...",
    "Meta Description": "Looking for information on Relics of the Lost Age? Check out the release date (Jan 7, 2021), developer insights from Hosted Games, and a complete game s...",
    "Alt Text Image": "Official header image for Relics of the Lost Age game - Steam 1449670",
    "Canonical URL": "https://gusku.site/game/relics-of-the-lost-age",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Relics of the Lost Age\", \"description\": \"Looking for information on Relics of the Lost Age? Check out the release date (Jan 7, 2021), developer insights from Hosted Games, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hosted Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1449670/header.jpg?t=1643811408\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}