{
    "AppID": 698230,
    "Name": "RockBuster",
    "Release date": "Jul 12, 2018",
    "About the game": "Story It's a year 2371. The world we are living has been changed. Our planet Earth is still our home planet, however the living conditions there haven't been favorable there for centuries. There is not enough raw materials, people are starving and criminality level is extremely high. Wealthy people has escaped this faulty society to small colonies and space stations all around the galaxy. The constructing of new intergalactic infrastructure isn't cheap but also it takes tons of raw materials and resources to maintain the system. This has led to phenomenon where the asteroid mining trend has become very popular among inhabitants of Earth. Naturally very large asteroids are mined on site by mining stations built by large companies but soon the people realized the smaller space rocks can be valuable too. Even the most wealthy percentage of human race despise the people who are still living on Earth, are now buying raw materials from fearless space miners who are clearing the space, rock by rock. Game Play This game is mostly an action-strategy game but the main story also adds some adventure elements to game play. You control an industrial space ship and you perform different kind of space missions all around the galaxy. Between the missions you can buy better ships, repair and gear your current ship, buy better equipment and sell valuable loot. The best weapons and equipment can be found only from destroyed space ships. The length of the game depends on how well you master your ship and how good equipment you can find. Usually the patience and tactics is the key. There are several mission types available, like rock mining, sector clearing, hunting, ship protecting and even looting missions. The main story line has 40 missions and there are randomly generated sub mission for players, who like to grind better equipment for their ship. Sometimes you have to grind for a while so you can continue the main story missions. The reputation system makes some variation to mission rewards and content. The mission difficulty varies from casual to extreme hard. The AI is hardly forgiving but it's still not intentionally unfair. Also you can buy better ships and make different kind of equipment configurations that suits to your play style. You can equip better reactor cores, shields, capacitors, main engines and maneuvering jets. You can even customize the ship's armor. There are 3 main weapon types available. Projectile weapons, electromagnetic weapons and energy weapons. Also there are few different missile types. You can build a slow heavily armed tank, light fast hit&amp;run ship or something between.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/698230/header.jpg?t=1532073303",
    "Price": 12.99,
    "Developers": "Twisted Bit Inc.",
    "Publishers": "Twisted Bit Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_1898a2ce15d3fbb95768bb169a3b66c2d8c18e05.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_5a38ecd23aa43a38bb0872c19aaa49a6d96b1980.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_21138e8078d987f908e9bee937e1761bd2a31d2e.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_820d99138b81960d5f3736a9c1ce80a8443f3635.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_f5f2d6152c0d2b6b665c07b54d8ad2f2f7d42748.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_1523075bf5e967140a585f10950726ad67f25688.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_507ce334d826a4b1478671958e6044ebdb4927ba.1920x1080.jpg?t=1532073303,https://cdn.akamai.steamstatic.com/steam/apps/698230/ss_abfc1a06e371df085342fad09f9986e1b609a740.1920x1080.jpg?t=1532073303",
    "Slug": "rockbuster",
    "Meta Title": "RockBuster: Jul 12, 2018, Twisted Bit Inc. and Full Overview",
    "Meta Description": "Looking for information on RockBuster? Check out the release date (Jul 12, 2018), developer insights from Twisted Bit Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for RockBuster game - Steam 698230",
    "Canonical URL": "https://gusku.site/game/rockbuster",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RockBuster\", \"description\": \"Looking for information on RockBuster? Check out the release date (Jul 12, 2018), developer insights from Twisted Bit Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Twisted Bit Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Twisted Bit Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/698230/header.jpg?t=1532073303\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}