{
    "AppID": 1955990,
    "Name": "RogueStone",
    "Release date": "May 11, 2022",
    "About the game": "Think you're an expert at RPGs? Think again. RogueStone is challenging enough to satisfy even the most hardcore RPG gamers while remaining fun and engaging for those new to gaming. As a Combat Simulator* with light RPG elements, and dungeons that get tougher as they go on, it will take everything you have to survive. You take on an Ascendant role, a being that can travel through portals that are trying to stop corruption from spreading to its source. Source is magic that is fuel for the soul. You'll amass a collection of RogueStones as you defeat fiends and monsters, which enhance your group members' abilities. You'll get stronger by increasing the power level of these RogueStones with every XP earned. These RogueStones are imbued with the properties of fiends and monsters, so they're simple to understand but have deep mechanics! Which can be very hard to come by and grow stronger every day! KEY FEATURES -Have fun exploring an interactive, imaginative world. -Train in a virtual environment and get stronger. -Enjoy a never-ending quest for artifacts and power. -Game focus on End Game as part of the Main Game Loop. -There's an epic, 20-hour long RPG campaign in this game. Rack up the loot and get all of those drops. -The Steam client has 14 achievements, 3 of which are End Game. -Each Character is represented by a Character Type: Balanced, Fighter, Tank, Support, Defender, and Champion. Each one has it's own set passives and combos you can get with them - combining several passive abilities will give your character more power than ever before! -With the Alternative Leveling System, your GP values are equally important to you and they share a common goal. You want them both balanced so that each point can provide maximum stat boosts for their respective stats! -The best way to get GP in Explore Mode is by destroying crates. You can then spend your GP at Town Vendors for all sorts of useful items! -You'll encounter increasingly difficult monsters as you explore the world, so it's a good idea to keep your stats up. -Play knowing the game never ends by utilizing a 'Get Better Gear' or 'Boost your Stats' loop. -Deep Immersive HD Fantasy Music Soundtrack by the Solo Developer. -Grindcore-like Action where you farm XP, GP, and Pt (Platinum). -Affix Based Itemization with its drop pool. -Farm 'Monster Boxes' for a chance to drop magic equipment. -RogueStone System which allows for unlimited customization. -Save Function is Enabled on the Steam client version improving the quality of life. Challenge your skills and create your own personal journey today. *Click on 'View the quick reference', for a 110 pg. Supplemental Lore Book. **Lore Keepers are the most knowledgeable and trusted sources of information about the world. They know everything there is to know about ancient treasures, monsters, and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1955990/header.jpg?t=1654703981",
    "Price": 9.99,
    "Developers": "Keo R. Bun",
    "Publishers": "Hyperbit Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_5d092c7cea27bb0f75df4d4ddb6d788622847da9.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_d5427c9ebf666fe10b418e067b2b766fffcbaf37.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_15d66078efcaa4589e26c89ffd85217ab6458b79.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_e868be36879440255de70c200e7dd6363bb0c4d0.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_84427cb154e97cb3c94812904d72fad562fb8bfd.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_a253733a32542b23053fcdf753b2c2441fede092.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_1b84f75dd1d1a067b2d009e63ffbc850f7af95b2.1920x1080.jpg?t=1654703981,https://cdn.akamai.steamstatic.com/steam/apps/1955990/ss_93800acbe8ad2ef9405227a157e10689144d55df.1920x1080.jpg?t=1654703981",
    "Slug": "roguestone",
    "Meta Title": "RogueStone: May 11, 2022, Keo R. Bun and Full Overview",
    "Meta Description": "Looking for information on RogueStone? Check out the release date (May 11, 2022), developer insights from Keo R. Bun, and a complete game summary.",
    "Alt Text Image": "Official header image for RogueStone game - Steam 1955990",
    "Canonical URL": "https://gusku.site/game/roguestone",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RogueStone\", \"description\": \"Looking for information on RogueStone? Check out the release date (May 11, 2022), developer insights from Keo R. Bun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Keo R. Bun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hyperbit Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1955990/header.jpg?t=1654703981\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}