{
    "AppID": 881420,
    "Name": "Six Ages: Ride Like the Wind",
    "Release date": "Oct 17, 2019",
    "About the game": "Life between myths. Lead your clan into legend or obscurity. Six Ages: Ride Like the Wind is a storybook strategy game, immersing you in a land of old gods and magic, the same world as King of Dragon Pass. Hundreds of small encounters build into an epic, multi-generational tale of survival and inter-clan alliances. Six Ages is the spiritual successor to acclaimed King of Dragon Pass, taking place thousands of years earlier in the same shared world of Glorantha. Part role-playing, part resource management, you'll always be making decisions with long-term consequences, for you and your clan. Please note the minimum system requirements for Windows is Windows 10! Design your own clan, visit the gods, become respected, raid your neighbors' cows Over 400 interactive story scenes, with deep simulation systems driving their appearance and outcomes Multiple difficulty levels, and the option for Iron Willed players to limit reloading Gorgeous hand-painted high-resolution illustrations Same world as King of Dragon Pass, but a new clan: the Riders, with their own myths, and 4x more world to explore Discover, appease, and make deals with spirits in your territory Glorantha is a highly detailed Bronze Age world, similar in many ways to our own. But it exists in a magical universe where the laws of physics are subordinate to the whims of the gods and spirits. To understand Glorantha, leave our mundane world and enter the world of myth. The Sun is a living god, not a nearby star. Countless gods exist, some even more powerful than the Sun, and all have the power to directly affect humanity. In Six Ages, you play specifically as a Riders clan, who revere various gods in their particular mythology, including Gamari the Horse Mother, and your culture hero, Hyalor... but you would be foolish to forget Raven the Trickster. He has not forgotten you. Glorantha is also the setting of other rich narrative games/experiences, including King of Dragon Pass, HeroQuest, RuneQuest, God Wars, and others. Looking for even more info? Read the manual !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/881420/header.jpg?t=1614969113",
    "Price": 19.99,
    "Developers": "A Sharp",
    "Publishers": "Kitfox Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/881420/ss_e68fe8ef405400f9d46330959c8c1d9148299f26.1920x1080.jpg?t=1614969113,https://cdn.akamai.steamstatic.com/steam/apps/881420/ss_996fa0c08638e3fdd543826b64d5a48a5d5259d7.1920x1080.jpg?t=1614969113,https://cdn.akamai.steamstatic.com/steam/apps/881420/ss_1ef0bb707117aa80ac7cde83de16962872a2100c.1920x1080.jpg?t=1614969113,https://cdn.akamai.steamstatic.com/steam/apps/881420/ss_9a325e946f07340e01c7fe31954ca1ea6d2b7325.1920x1080.jpg?t=1614969113,https://cdn.akamai.steamstatic.com/steam/apps/881420/ss_d0986f3c2b3c684e34573540056857c08099a5f3.1920x1080.jpg?t=1614969113",
    "Slug": "six-ages-ride-like-the-wind",
    "Meta Title": "Six Ages: Ride Like the Wind: Oct 17, 2019, A Sharp and F...",
    "Meta Description": "Looking for information on Six Ages: Ride Like the Wind? Check out the release date (Oct 17, 2019), developer insights from A Sharp, and a complete game...",
    "Alt Text Image": "Official header image for Six Ages: Ride Like the Wind game - Steam 881420",
    "Canonical URL": "https://gusku.site/game/six-ages-ride-like-the-wind",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Six Ages: Ride Like the Wind\", \"description\": \"Looking for information on Six Ages: Ride Like the Wind? Check out the release date (Oct 17, 2019), developer insights from A Sharp, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"A Sharp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kitfox Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/881420/header.jpg?t=1614969113\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}