{
    "AppID": 839130,
    "Name": "Snowball Saves Summer",
    "Release date": "Sep 26, 2018",
    "About the game": "Have Fun With Physics Roll and fling Snowball toward the candy cane flagpole to complete each level. You can also fling while mid-air for a helpful double-jump, but be careful! You'll need to master Snowball's physics to avoid falling off slopes and other platforms. Each level makes use of snowball physics in a variety of unique and challenging ways: avoid heat, push blocks of ice, swim underwater, and use gusts of wind to fly all the way to each flagpole! Explore and Collect Experience 30 unique levels across five diverse environments: the snowy tundra, a melting glacier, Santa's toy workshop, a dried-up mountain, and Krampus' fiery home. Each level is centered around a unique gameplay gimmick that challenges your ability to control Snowball. Every level also has three Golden Snowflakes hidden in tricky spots that unlock bonus levels and other rewards when collected. Make Your Own Snowball You can use coins to customize Snowball's outfit or attach a colorful trail to his path! Experiment to find your preferred way to play the game, and have fun! Defeat the Heat Fight tough monsters, and even tougher bosses! If you're having trouble, you can always upgrade Snowball's stats: heat resistance: a higher value decreases the damage you take from sources of heat range: a higher value increases the range of your fling power: a higher value increases the damage you deal to enemies Rescue the Snow Queen After Snowball defeated Krampus last Christmas, his minions swore revenge. What better way to defeat a snowball than to melt him? So on the night of the Summer Solstice, the evil witch Perchta broke into the Winter Palace. She kidnapped Holda, the Snow Queen, to be used as a sacrifice to revive Krampus. Without Holda, the North Pole has already begun to melt, and soon there will be nothing left but water. Rescue the kidnapped Snow Queen, stop the North Pole from melting, and save summer! A Second Quest After beating the game, you unlock a 'Krampus Run' mode that offers a more challenging experience, for skilled players who want more! Competitive Play Each level keeps track of your fastest time and has its own leaderboard on Steam. Compete for the fastest time among your friends, or even the whole world! Original Soundtrack Enjoy an excellent soundtrack with over 20 songs, also available for purchase on Steam!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/839130/header.jpg?t=1614296812",
    "Price": 9.99,
    "Developers": "Goldbar Games",
    "Publishers": "Goldbar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/839130/ss_1708bfa94944957baa4f58e9f72989ba5969d124.1920x1080.jpg?t=1614296812,https://cdn.akamai.steamstatic.com/steam/apps/839130/ss_aa02a802de1df310c345204d12595bde3af9a3dc.1920x1080.jpg?t=1614296812,https://cdn.akamai.steamstatic.com/steam/apps/839130/ss_98ceb214e1d70e18de0a84a40e90915cf722b548.1920x1080.jpg?t=1614296812,https://cdn.akamai.steamstatic.com/steam/apps/839130/ss_2deccf7785d4393cc6f7b1ca50e2f51806313c04.1920x1080.jpg?t=1614296812,https://cdn.akamai.steamstatic.com/steam/apps/839130/ss_fac92d7e5fdaf05d33516a0b2492242e9ad9eb7a.1920x1080.jpg?t=1614296812,https://cdn.akamai.steamstatic.com/steam/apps/839130/ss_cb66cb5716d76846654055231c5f52b00c6eb103.1920x1080.jpg?t=1614296812",
    "Slug": "snowball-saves-summer",
    "Meta Title": "Snowball Saves Summer: Sep 26, 2018, Goldbar Games and Fu...",
    "Meta Description": "Looking for information on Snowball Saves Summer? Check out the release date (Sep 26, 2018), developer insights from Goldbar Games, and a complete game ...",
    "Alt Text Image": "Official header image for Snowball Saves Summer game - Steam 839130",
    "Canonical URL": "https://gusku.site/game/snowball-saves-summer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Snowball Saves Summer\", \"description\": \"Looking for information on Snowball Saves Summer? Check out the release date (Sep 26, 2018), developer insights from Goldbar Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Goldbar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goldbar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/839130/header.jpg?t=1614296812\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}