{
    "AppID": 1122120,
    "Name": "STATIONflow",
    "Release date": "Apr 15, 2020",
    "About the game": "Have you ever been stuck in a train or subway station, crowded and congested, fighting to get on the escalator? Have you ever wandered around lost, cursing the lack of proper signage? Have you ever thought to yourself “I could design this station better” ? STATION flow is a game about controlling the flow of thousands of passengers by building and managing an efficient underground train station. Manage the flow of thousands of passengers with different needs, stats and targets, simulated in real time. Build complex 3D layouts in a multilayered map. Place and shape corridors and structures freely, without the constraints of a grid. Connect your station with stairs, escalators and elevators as efficiently as you can, but make sure everything is accessible. Keep things functional and efficient: your goal is to avoid congestion and to get passengers to where they want to go as quickly and smoothly as possible. Guide passengers via signage, and watch the flow of passengers change. Manipulate the path people take to avoid crowds—sometimes the shortest route is not the most efficient. Satisfy your passengers’ desires for various services: place vending machines and kiosks, construct bathrooms, restaurants and more. Passengers will expect more than just to find their exit on time. Don’t forget about upkeeps. You’re on a budget, so you'll want to keep your station lean and efficient⁠—but make sure it isn't at the cost of passenger satisfaction! And of course, the higher-ups are always watching. You will receive daily evaluations based on passenger feedback. Do well, and you will be rewarded with an extended budget and additional construction options, but also given increased responsibilities. Do poorly, and you may well be on your way to bankruptcy... Create your own maps and share them through the Steam Workshop, or browse other players' creations for your next playthrough. Adjust the game's difficulty to your liking via multiple settings. Give yourself a relaxed sandbox experience, or something to really test your station-building abilities⁠... Good luck.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1122120/header.jpg?t=1600083513",
    "Price": 17.99,
    "Developers": "DMM GAMES",
    "Publishers": "DMM GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1122120/ss_04895d8a6839c21967e098e15690853b8737031c.1920x1080.jpg?t=1600083513,https://cdn.akamai.steamstatic.com/steam/apps/1122120/ss_3e5bb991ac9ca57c45c78e13dd8ee9a07341efe4.1920x1080.jpg?t=1600083513,https://cdn.akamai.steamstatic.com/steam/apps/1122120/ss_c2b52bc1f2c252247ec84eaba47a9e18954bbcce.1920x1080.jpg?t=1600083513,https://cdn.akamai.steamstatic.com/steam/apps/1122120/ss_325d7b4775108f0b59b075ccec6da099acd8862a.1920x1080.jpg?t=1600083513,https://cdn.akamai.steamstatic.com/steam/apps/1122120/ss_3c42cf4c9e78cd8cd1b7da6f00f55d255014db94.1920x1080.jpg?t=1600083513,https://cdn.akamai.steamstatic.com/steam/apps/1122120/ss_e3844c869159bae33d73285b3751503c0906f8cc.1920x1080.jpg?t=1600083513",
    "Slug": "stationflow",
    "Meta Title": "STATIONflow: Apr 15, 2020, DMM GAMES and Full Overview",
    "Meta Description": "Looking for information on STATIONflow? Check out the release date (Apr 15, 2020), developer insights from DMM GAMES, and a complete game summary.",
    "Alt Text Image": "Official header image for STATIONflow game - Steam 1122120",
    "Canonical URL": "https://gusku.site/game/stationflow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"STATIONflow\", \"description\": \"Looking for information on STATIONflow? Check out the release date (Apr 15, 2020), developer insights from DMM GAMES, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"DMM GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DMM GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1122120/header.jpg?t=1600083513\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}