{
    "AppID": 720620,
    "Name": "TaleSpire",
    "Release date": "Apr 14, 2021",
    "About the game": "Overview / What Is TaleSpire? TaleSpire is a beautiful way to play pen and paper RPGs online. Bring your stories to life and embark upon campaigns together with your friends, regardless of where you are in the world. With Talespire, the beauty and physicality of tabletop gaming meet the endless possibilities of a digital world. Here you can collaboratively build your worlds without compromising the handcrafted aesthetic of using traditional miniatures. As a player, you can take on the mantle of multiple heroes and creatures, manage your stats, and express yourself using the growing emote system. Perform dice rolls directly on the board and interact with your environment — at least, as far as your GM will let you! As a GM, you can dazzle and thrill your friends by building expansive maps, setting up shots, and controlling immersive soundscapes to bring all your delightful and devious designs to life. TaleSpire is not tied to a specific game or ruleset. Whether you’re running a one-shot or a sprawling campaign, if it's on a square grid then we have your back. We are now in Early Access, so now is your chance to raise up your sword, rally your friends, and take your next adventure online with us. Building and play are one Setting the stage for your story takes no time at all with Talespire, but even if you forget to prep, it can all be added in while you play. Want to destroy a wall to reveal a secret passage? Do it! Want to rain down piles of gold from the heavens? You have the power. At any moment during your adventure, you (or multiple GMs) can jump into building mode and change the world without interrupting anything else. Our persistent online boards can be created at a moment’s notice, and everything is synchronized in real-time as you dice-roll your way to glory. A slew of tools to help you on your adventures It’s dangerous to go alone, but luckily we have a bunch of tools that can help, and all are as pleasing as they are useful. Beautiful dice, rulers and area markers, a range of emotes, and special modes for turn-based combat and cinematic sequences are at your disposal. A growing library of assets Pick from a plethora of pieces to create your scenes! The current roster stands at 150 miniatures, 750 tiles and props, and 50 unique audio tracks. Our library is ever-expanding; we produce fresh asset packs every month. Share your creations TaleSpire boards are designed to be easily shared, whether with friends or with the wider community on sites like TalesBazaar or TalesTavern . You can copy sections of your boards (slabs) and paste them as text outside of TaleSpire. Simply paste the text back into TaleSpire to summon the slab to your hand. This tale has only just begun Being in Early Access we still have plenty of adventures ahead of us. We have an active Discord community, which you can find here ( ), and alongside your feedback we’re looking forward to developing the game’s features. So come, journey with us a while.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/720620/header.jpg?t=1619548807",
    "Price": 24.99,
    "Developers": "Bouncyrock Entertainment",
    "Publishers": "Bouncyrock Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_0d5a9dd2179a321b4e36346a9e8a304cb8d3908e.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_91846dde17a5dd046fc89918119c603b9811ed8a.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_80bdda08fda0e063d881c18332005661e20362ca.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_c9f2544ef466bda3808dd35d51dbe4641434bc8c.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_0390de6518bac4f861499d34ae47fc50cfdbda05.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_b394cd02665adec50ecf035eba27f9b834e4dbb4.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_366475e0786fb92d607d0082613eb0512a095376.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_526661ff549eaf5c36d37e3e9dde15bf79fa0b9b.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_88ed768fdcc95fc869660274ae92b2011b5aad4a.1920x1080.jpg?t=1619548807,https://cdn.akamai.steamstatic.com/steam/apps/720620/ss_c180901d1e702b00ded77b993ac7813bd11fcb89.1920x1080.jpg?t=1619548807",
    "Slug": "talespire",
    "Meta Title": "TaleSpire: Apr 14, 2021, Bouncyrock Entertainment and Ful...",
    "Meta Description": "Looking for information on TaleSpire? Check out the release date (Apr 14, 2021), developer insights from Bouncyrock Entertainment, and a complete game s...",
    "Alt Text Image": "Official header image for TaleSpire game - Steam 720620",
    "Canonical URL": "https://gusku.site/game/talespire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TaleSpire\", \"description\": \"Looking for information on TaleSpire? Check out the release date (Apr 14, 2021), developer insights from Bouncyrock Entertainment, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bouncyrock Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bouncyrock Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/720620/header.jpg?t=1619548807\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}