{
    "AppID": 1989630,
    "Name": "That Which Was Lost",
    "Release date": "Jul 22, 2022",
    "About the game": "PRESENTATION: This is a classic 2D retro RPG in the vein of Skyfall, Ashes of Immortality and Fantasy Heroes. FEATURES: A rich storyline that embodies themes that have always been relevant to us, now perhaps more than ever Detailed characters each with their own motivations and fears A carefully constructed world with a vast and rich lore Beautiful sprite art that gives life to the characters Sidequests, optional dungeons and bosses to challenge the player Ultimate weapons to be found A Quest Journal to keep track of your progress Full mouse support SUMMARY: Once, the world was ruled by the ones now known only as the Ancient. Even though the current world was built on the foundation of everything they created, not much is really known about them or their culture. It is believed they worshiped a vast pantheon of Gods, but above them all ruled only one, the Supreme Goddess Lathea. She was both kind and just, mighty and wise, and she seemed to love the Ancient Ones. A great believer of knowledge and it's power, Lathea left humankind valuable books written by her own hands, there is only one problem, humankind has forgotten the old ways and the old language, making the books unreadable. One can only wonder in awe what kind of knowledge such books hold. Shea, a young and curious scholar from Whitegrain Village, a small refuge inside the valley, had dedicated her entire life to learning the Ancient Language. She has always believed that the cure for The Plague, a terrible disease that consumes everyone it touches, was to be found within the ancient texts. Living in the valley, she always had the comfort of time, as it has always been the only safe refuge against The Plague... but not anymore. When darkness engulfs her hometown and everyone she loves, Shea needs to use what only she can hope to know to save them all. Between her and her objective lies a great desert, separing the valley from the rest of the world, and all of it's horrors and challenges. Shea will face them all, she has to. PLAY MORE GREAT GAMES / / /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1989630/header.jpg?t=1658504475",
    "Price": 6.29,
    "Developers": "Anima Games",
    "Publishers": "Anima Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1989630/ss_d1ad5ad0040d52050510576f743f6ed499befdce.1920x1080.jpg?t=1658504475,https://cdn.akamai.steamstatic.com/steam/apps/1989630/ss_cab0b88a65b8a67303cf0a32e1f6aea27d7b6792.1920x1080.jpg?t=1658504475,https://cdn.akamai.steamstatic.com/steam/apps/1989630/ss_61585b3251dc6a84f970130334926c53b039e3a0.1920x1080.jpg?t=1658504475,https://cdn.akamai.steamstatic.com/steam/apps/1989630/ss_6e9ac6a7bd77b0b30b060617fe29f3c0f33d6e1c.1920x1080.jpg?t=1658504475,https://cdn.akamai.steamstatic.com/steam/apps/1989630/ss_a28ef02ac8aa6e868d9839dbf64a70ce0a5c3032.1920x1080.jpg?t=1658504475",
    "Slug": "that-which-was-lost",
    "Meta Title": "That Which Was Lost: Jul 22, 2022, Anima Games and Full O...",
    "Meta Description": "Looking for information on That Which Was Lost? Check out the release date (Jul 22, 2022), developer insights from Anima Games, and a complete game summ...",
    "Alt Text Image": "Official header image for That Which Was Lost game - Steam 1989630",
    "Canonical URL": "https://gusku.site/game/that-which-was-lost",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"That Which Was Lost\", \"description\": \"Looking for information on That Which Was Lost? Check out the release date (Jul 22, 2022), developer insights from Anima Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anima Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Anima Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1989630/header.jpg?t=1658504475\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}