{
    "AppID": 792660,
    "Name": "The Operational Art of War IV",
    "Release date": "Oct 15, 2018",
    "About the game": "The legend is back! The Operational Art of War IV is the new generation of operational wargames. With more flexibility than before and with a new array of exciting features, it will make you relive the most iconic battles from the dawn of the 20th Century to modern day, including the ones that never occurred! More than 200 scenarios like the Battle of Marne, Dien Bien Phu, the Batte of Arnhem, the Falkland Invasion - and lots more! - will forge your strategy skills and ability to master all kind of troops and terrains! The entire naval warfare system has been completely revised and implemented , bringing its realism to a new, higher, level! The supply system has been greatly enhanced, allowing a more gradual simulation without adding extra tasks to the players. In addition, the game will feature an Improved combat resolution, a much more consistent combat round management, along with major improvements to the TOAW Editor Event system, making complex scenarios easier to create! A new Battlefield Time Stamp feature takes on TOAW's unique way of handling game turn resolution and makes it easier for players to plan ahead! And for those among you intimidated by large scenarios, an Improved PO/AI assist automation exists to make handing off part of your friendly forces to the AI easier! The Operational Art of War IV is the top-notch military simulation that every wargamer needs! FEATURES New naval warfare features The modeling of ships has been improved. Instead of treating ships as a single piece of equipment, like a gun or a squad, they are now treated as complex systems that incur damage in combat. Ships have new armor, durability, accuracy, speed, and agility parameters. Embarked units no longer employ their own strengths in defense. Naval combat now evaluates attackers’ Anti-Naval strengths as individual shots/planes – employing their shell weights to determine armor penetration and resulting damage. Sea Interdiction can now be employed by aircraft, ships, and coastal guns. Ships subjected to sea interdiction fire counterbattery back (or, in the case of carriers, counterstrikes). New Supply system There is now an intermediate supply state that falls between “Supplied” and “Unsupplied”. It’s called “Overextended”. A new parameter called the Overextended Supply Threshold has been implemented. That is the location supply value below which locations are overextended. Units in such hexes will function somewhat between how supplied and unsupplied units function. The result will be that it will be much more difficult for units to press on at red-lined unit conditions from such locations. Motorized unit movement over improved roads can be set by the designer to be less than one MP per improved road hex (for example, ½ MP per hex). If optioned, this affects supply in that supply lines traced over improved roads will extend proportionately further than over other terrain, like regular roads. Note how this would especially affect desert scenarios. The limit of 50% unit supply recovery per turn has been lifted. Other game features Range Limits: Ranged units can have their nominal ranges player limited. This can be used to tailor bomber ranges to match fighter cover ranges or to make units with multiple range equipment operate within the range of the shortest-ranged equipment. The DBR will reflect the modified range. Deployment Recovery: Ranged units retain their deployment states after combat and ground assaulters can recover theirs if a planned combat is canceled. New Bridge Destruction Rules: There is an option to limit bridge hexes (for destruction purposes) to locations where the road feature graphically crosses the river feature. Combat Report Review. Combat reports are saved in the pbl/sal files for review by both players during their player turns. Adaptation of Matrix’s PBEM++ system.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/792660/header.jpg?t=1575553567",
    "Price": 39.99,
    "Developers": "TrickeySoft LLC",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/792660/ss_42f4551ea7d0f280b7b64f154a8794e26e45ce4d.1920x1080.jpg?t=1575553567,https://cdn.akamai.steamstatic.com/steam/apps/792660/ss_0250fad69b3f9fc84704e39ec564b1ecefa912c0.1920x1080.jpg?t=1575553567,https://cdn.akamai.steamstatic.com/steam/apps/792660/ss_5fca5eb3f5b324e0296d4f642bf255faf9c95997.1920x1080.jpg?t=1575553567,https://cdn.akamai.steamstatic.com/steam/apps/792660/ss_9e115530242dd88f29cea1d3cf8079afdf902a50.1920x1080.jpg?t=1575553567,https://cdn.akamai.steamstatic.com/steam/apps/792660/ss_57c88e1ac23e805c05656522f38089369c46d197.1920x1080.jpg?t=1575553567",
    "Slug": "the-operational-art-of-war-iv",
    "Meta Title": "The Operational Art of War IV: Oct 15, 2018, TrickeySoft ...",
    "Meta Description": "Looking for information on The Operational Art of War IV? Check out the release date (Oct 15, 2018), developer insights from TrickeySoft LLC, and a comp...",
    "Alt Text Image": "Official header image for The Operational Art of War IV game - Steam 792660",
    "Canonical URL": "https://gusku.site/game/the-operational-art-of-war-iv",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Operational Art of War IV\", \"description\": \"Looking for information on The Operational Art of War IV? Check out the release date (Oct 15, 2018), developer insights from TrickeySoft LLC, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"TrickeySoft LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/792660/header.jpg?t=1575553567\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}