{
    "AppID": 475150,
    "Name": "Titan Quest Anniversary Edition",
    "Release date": "Aug 31, 2016",
    "About the game": "For its 10 year anniversary, Titan Quest will shine in new splendour. This Anniversary Edition combines both Titan Quest and Titan Quest Immortal Throne in one game, and has been given a massive overhaul for the ultimate ARPG experience. Anniversary Edition update Restored and improved multiplayer functionality, including new features like a built-in voice chat and NAT resolving for best multiplayer connectivity Support for more resolutions, larger camera distance and scaleable UI size Improved performance and general stability Support for modders through new modding options and a fully integrated Steam Workshop Complete balance rework with improvements to all Masteries, damage types, unique items and sets Countless bug fixes and other improvements, including ten years’ worth of community fixes Increased challenges and rewards for larger parties and on higher difficulty levels Dozens of new heroes and bosses to encounter Improved enemy and pet AI Quality of life features like higher stack limits, quick item pickup, a larger stash and a speed setting Reduced cheating with curbed exploits, removal of test items and mod comparison in multiplayer Steam Friend Invites Steam Achievements Steam Trading Cards Discover the Courage that Turns Heroes Into Legends From Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative action role playing game set in ancient Greece, Egypt and Asia. The Titans have escaped their eternal prison, wreaking havoc upon the earth. The gods seek a hero who can turn the tide in an epic struggle that will determine the fate of both men and gods. In this epic quest of good versus evil, players will encounter the greatest villains of Greek mythology, brave the attacks of Cerberus, and hazard the banks of the River Styx. Players will interpret the prophecies of the blind seer Tiresias, fight alongside Agamemnon and Achilles, and use the wiles of Odysseus to conquer this dark new adventure. Are you ready for the quest? Key features Explore the Ancient World - Unlock arcane mysteries and battle the beasts of mythology as you journey to the Parthenon, Great Pyramids, Hanging Gardens of Babylon, The Great Wall and other legendary locations Atmospheric Graphics - Take a hero's journey through authentic Ancient World settings crafted in stunning, realistic, 3D detail Conquer Monsters of Legend - Battle horrific monsters and mythical beasts in a story-driven campaign that will determine the fate of all existence Highly Customizable Characters - Build and customize your characters with 28 classes and over 1000 pieces of unique and legendary items to create the ultimate champion Online Multiplayer Gameplay - Challenge others to experience your map creations in fast-action, 2-6 player online cooperative gameplay Create Your Own Worlds - Create your own maps with the easy-to-use World Editor for endless adventuring",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/475150/header.jpg?t=1638867197",
    "Price": 19.99,
    "Developers": "Iron Lore Entertainment,THQ Nordic",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_e57fbc3736ff02e541e8a9f927788e95f77b7c12.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_f6441346a3c58145a09847e29f668aa077a8feaa.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_f577dc04ced7cc2e4aee11bc37ce30b7d4920ef6.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_3ddc7d874f190ddaf28dd2b3190918cb4d8f4122.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_1628bb7dfc5a88b811c37103e60066d8403cd69b.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_9170dcaa1222fa39219cb631dbabbe11a22f2778.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_b2338ea7ba02933f9db8b72eefe36b8f465d31e8.1920x1080.jpg?t=1638867197,https://cdn.akamai.steamstatic.com/steam/apps/475150/ss_067104b511f47dabc9f481805959a9360eb492c5.1920x1080.jpg?t=1638867197",
    "Slug": "titan-quest-anniversary-edition",
    "Meta Title": "Titan Quest Anniversary Edition: Aug 31, 2016, Iron Lore ...",
    "Meta Description": "Looking for information on Titan Quest Anniversary Edition? Check out the release date (Aug 31, 2016), developer insights from Iron Lore Entertainment,T...",
    "Alt Text Image": "Official header image for Titan Quest Anniversary Edition game - Steam 475150",
    "Canonical URL": "https://gusku.site/game/titan-quest-anniversary-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Titan Quest Anniversary Edition\", \"description\": \"Looking for information on Titan Quest Anniversary Edition? Check out the release date (Aug 31, 2016), developer insights from Iron Lore Entertainment,T...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Iron Lore Entertainment,THQ Nordic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/475150/header.jpg?t=1638867197\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}