{
    "AppID": 315660,
    "Name": "Trainz: A New Era",
    "Release date": "May 14, 2015",
    "About the game": "Platinum Edition Bundle Our 'Platinum Edition' bundle provides fantastic value for new or existing customers. Expand your Trainz collection with a huge range of additional routes, sessions, locos and rolling stock, all at 75% off the regular pricing. SEE ALSO - Trainz Railroad Simulator 2019 The latest version of Trainz delivers better graphics, improved performance and greater stability (plus a whole range of new content). Search the Steam Store. What makes Trainz so special? Trainz: A New Era is far more than a train simulator. Sure there are hundreds of locos and dozens of routes and sessions you can drive in the Platinum Edition Bundle. But the real power of Trainz comes with all the extra things you can do beyond the builtin-in content set. All the tools to build your own railroad are included, and in fact, every route you see in Trainz is created by customers just like you. There are now well over 10,000 routes available on the Trainz Download Station (DLS) that you can download for free and enjoy. So when people tell you 'you have to buy lots of DLC' remind them that the choice is theirs, with plenty of high quality free routes and content available on the DLS. Key Features All-new graphics engine with full world shadows and per-pixel lighting Multiplayer Share your enthusiasm with other rail fans and combine your efforts with others to operate a working rail line! Our most accurate simulation yet with real time world physics and editing tools! Our physics use a variety of configurable inputs such as engine powers, train weight and rolling resistance whilst taking into account factors like track gradient, curve resistance and track adhesion for each train car when accelerating or decelerating. The brand new real time physics editing tools allow players to tune physics 'on-the-fly' to take their simulation's performance even further. Brand-new Real-time Physics Editing tools enable users to enter known specifications to accurately monitor all the forces at work. Things like tractive effort, drawbar pull or brake pipe pressure can be monitored at a specific point along the train and input values adjusted 'on-the-fly'. By analysing and tuning performance without leaving the simulation, real-world train characteristics can be matched perfectly. (It's a bit like running a virtual dynamometer car). If physics aren't your thing, don't worry. You can leave the fine-tuning of your favourite locomotive's performance to the experts whilst still having the choice between 'Realistic Mode' or 'Easy Mode' driving options. Procedurally animated spline junctions An updated set of track laying tools are provided in Surveyor to automatically adds frogs/vee, blades, and checkrails in the correct place on the tracks when making a switch, turnout or junction. The blades then animate as the junction direction is changed. Realistic cab sway and external train motion Using a new suspension modelling system and additional track and traincar parameters, cab sway and 'car rocking' from both internal and external perspective provide more realistic train motion visuals. When running on rough track, cars will wobble and shake independently. Smoke and weather affected by world objects New particle effects and collision systems will prevent rain penetrating a tunnel, smoke will billow out from the underside of a bridge or the top of a tunnel and all particle effects will change velocity, direction and flow more naturally. Tons of Extra Content Access to over 250,000+ free DLC items via The Download Station In-game downloadable content system for both payware and freeware options Create your own routes with powerful in-game level editing tools Configurable control schemes Never lose your way with the in-game navigation system Open multiple windows to view and compare items in Preview Mode while creating your world in another window Incl. 250 page digital user manual - a digital PDF providing detailed information on every aspect of Trainz Standard Edition Routes and Sessions Trainz: A New Era provides a variety of high quality routes - built-in to the core edition, available as Downloadable Content (payware) or from the DLS (freeware). Kickstarter County Based upon the famous Highland Valley route from the early days of Trainz, Kickstarter County has received a huge upgrade with new content, new track, new industries, and new high definition assets. Chesapeake &amp; Ohio RR, Hinton Division - (United States, 1950) Hinton Division, one of the major coal producing areas for the C&amp;O, starts just west of Thurmond, WV through to Hinton, WV and includes 4 subdivisions. Laurel Creek, Piney Creek, Rend, and Loup Creek. ECML Kings Cross - Edinburgh (UK, 1976) This edition delivers the full route from London Kings Cross Station all the way to Edinburgh in Scotland - a 393 mile drive! With significant updates to almost every feature, this route will transport you back in time to 1976. Healesville - (Australia, 1910's) A faithful recreation of the towns, stations, bridges and rural countryside of 1915 Australia. The line includes several notable features, including the 1.6 mile long timber trestle bridge over the Yarra River and flood plains between Yering and Yarra Glen and one of the very few tunnels on the Victorian Railways. PLATINUM EDITION INCLUDES OVER $250 VALUE Check out this full list of content included in the super-value Platinum Edition Bundle Trainz A New Era Standard Edition (RRP $39.99) 4 x TANE Deluxe Edition Routes (RRP $69.99) 4 x Platinum Bonus Sessions for Std Edition Routes (RRP $63.96) 4 x Platinum Bonus Routes (RRP $84.90) 3 x Platinum Bonus Trainsets (RRP $59.97) 60+ Sessions (+ 10 Tutorials) 120+ Locomotives 600+ Rolling Stock Vehicles 18,400+ Assets in total Thousands of miles of track A lifetime of enjoyment! Avery - Drexel - (United States, 1970's) - Platinum Edition The Milwaukee Road route runs from the end of the electrification in Avery, across the Bitterroot Mountains via the St Paul Pass, and through to the crew-change point in Alberton. It features Little Joe EF4 electrics and a huge range of seasonal rolling stock. Warwick to Wallangarra - (Australia 1990's) - Platinum Edition Follow the QR Southern railway line through the Darling Downs and into Granite country, right to the border with New South Wales. Season Town Northern Rail Road – (East or Middle West USA) - Platinum Edition The Season Town Northern Rail Road (STNRR) is based in fictional 'Season Town' situated somewhere in the East or Middle West of the USA. The aptly named Season Town supports season change functionality. Control the weather and see how the route responds to the snow! The layout provides a short mainline section as well as a 6 mile branch line connecting a limestone mine with a cement plant, as well as a streetcar network consisting of four branches. The BiDye Traction Railroad – (Someone's Garage) - Platinum Edition The BiDye Traction Railroad shows off the versatility of Trainz: A New Era by creating a virtual model railroad for you to explore. Built in a large virtual garage in much less time and a fraction of the costs of a traditional model railroad, BiDye highlights how Trainz can be used by model train fans as well as prototypical fans alike. Set up as a short line electric traction railroad serving several inter-dependent industries, the industries served by the railroad include lumber mill, furniture factory, grain mill, commercial bakery, paint and solvent factory, metal can and container factory, and a coal fired electricity plant. Even More Platinum Edition Content Appen (UK - Model RR) (RRP $19.99) Freight Service Passenger Service Locos include: BR Class 37 Blue BR Class 47 blue BR Class 55 blue TOPS 1976 BR Class 105 DMB BR Class 105 DTCL Chiyoda Branch Line (Japan) (RRP $15.99) Rush Hour Freight and Emergency Service Max Shinkansen Minato Express Minato Express Early 90's Locos include: DD51 JPN - Tokyo Metro 05 001, 101, 501 JRH DF50 JRH DF200 JRH E233 2000A, B, C, CC Units JRH EF641009, EF641052 JRH ODAKYU 4000BA, B, C Units JRH ODAKYU VSE50000-01 to 10 V2 Bell 412EP Helicopter Super Puma AS322 Helicopter 2 Niddertalbahn (Germany) Laadgs: Car Collector (RRP $7.99) Laadgs: Cars for Stockheim RB 17848 Stockheim - 3DZUG DBuz 747 (RRP $7.99) RB 17858 Heldenbergen - 3DZUG DBuz 747 GZ 57451 - Shmmns Coil Wagon (RRP $7.99) GZ 57413 - Shmmns Coil Wagon Locos include: BR 218.xxx-x Verkehrsrot DB 628.4 Ep. V DB 928.4 Ep. V BR151 DB Cargo BR W232.03 ITL BR 232 157-4 DB BR 143 069-3 RBH 117 BR 143 366-3 DB BR 101 016-4 DB Railion V90 BR 294 311-5 DB BR 628 223-2 DB BR 928 396-2 DB_BR 234 606-2 Balezino-Mosti (Russia) (RRP $24.99) Balezino to Mosti - Night Passenger 618 Mosti to Balezino - Evening Passenger 617 Mosti to Balezino - Day Passenger 627 Balezino to Mosti - Day Passenger 628 Locos include: CHME3-3172 CHS8-A &amp; B Units CHS4-042, 072, 072m, 153 CHS4t-519, 543 DM62-1804 DR1A-821g ER9P-223m, 223g, 223p ER9-697m, 697g M62-1628, 1675 RZD VL60k - 1222 RZD VL80c - 992/975 A, B, C LMS Duchess Pack (RRP $15.99) The LMS Duchess pack is a high quality representation of the locomotives in LMS crimson and BR green liveries in unstreamlined guise. Such a stylish loco deserves a stylish consist and so providing the perfect accompaniment, is a set of fully featured LMS Period III Stanier coaches consisting of consisting of a Brake Third Corridor to Diagram 1905, a Third Open to Diagram 1904, and a First Corridor to Diagram 1930. Features Include: 36 Duchesses in both LMS Crimson and BR Brunswick Green. 24 Stanier Period III Carriages in both LMS Crimson and BR Crimson and Cream comprised of BTK to D1905, TO to D1904 and FK to D1930. Authentically detailed loco cab and rideable passenger interiors. Scripted couplers, steam heat and brake hoses compatible with existing S&amp;C stock. Scripted loco headcodes. Scripted carriage lights and tail lamps LMS Coronation Scot Pack (RRP $15.99) The Coronation Scot celebrates the halcyon days of LMS passenger service in the 1930's. You’ll find 4 different LMS Princess Coronation locomotive liveries included: Caledonian Railway blue LMS Crimson LMS Crimson with double chimneys Wartime black with double chimneys. Attention to detail is important, so you’ll be able to see the authentically detailed locomotive cabs, and rideable passenger interiors of carriages. You’ll also be able to enjoy fully scripted couplers, steam heat and brake hoses compatible with existing S&amp;C and LMS sets, scripted locomotive head-codes, locomotive numbers and name-boards, as well as carriage lights and tail pumps. Features Include: Full consist of Coronation Scot coaches including: BFK to D1961 FK to D1960 RFO to D1902 RK to D1912 TO to D1981 BTK to D1905 Stainer Period III carriages in both LMS Crimson and BR Crimson &amp; Cream BFK to D1910 RK to D1912 RFO to D1902. PRR T1 - A Fleet of Modernism (RRP $15.99) Witness the striking image of these shark nosed behemoths in their days of speeding the Fleet of Modernism cars to their destination on trains such as The Broadway Limited and The General. Step into the cab and take charge of these mighty horses, relax in the comfort of your roomette, or enjoy the view from the observation lounge. Features Include: T1 Prototype Series Locomotives 6110 and 6111 with individual details. T1 Production Series Locomotives 5500 - 5549 as delivered. Scripted retractable couplers and hoses. Scripted marker lamps Scripted road and builder's plate numbers. All the latest smoke and sound features Plus a custom cab interior. PS18 'City Series' Roomette Sleeper. POS21A 'View Series' Observation Lounge. Federa l, Metropolitan, Skyline, and Washington views.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/315660/header.jpg?t=1590534805",
    "Price": 19.99,
    "Developers": "N3V Games",
    "Publishers": "N3V Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_2bc527c47ed239636f5e63ed003c91057fbd5d57.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_f23c9aae61e6f9a1f80cbb135c78175624ce7b31.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_cb1952e1fd8246f2c2de9d904c5c80f6610a7dd5.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_06f6c6e9527ed1b805b27670026168938b9586e8.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_8b3d8464eaa9bee65b9e6bb998c3be0e019b1b68.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_d79f4e43f160e67c3b94204607389851b50fedba.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_e3dae8cb0331406eae5d8da792814d32a6eefe92.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_8d85083ae82c2a58f6a6d71fcd75f4a219b40f39.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_fcada24c9df4c7177b8711cc5fb8489b313bb1d4.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_701f87121a3de7248019a7bd3973d83bfde8139d.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_dbf704eba7ddeb0bffd88743ef0e9896b0b75be8.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_f93459ca75500e6f4b0e9a77591a9e6d398ab916.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_79053bd5a44d24b084f7fdd1634f7f6eb44fad18.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_45027e0348cbaef6cfe3b5f8cd10348a06c74250.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_6e5a72b461de7125030f627f3979e3c84a435c11.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_72644cf22386d1d6032eeeab4ee91bd75b841c14.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_d30e5d138d6edbd9b57f6b82f11403bbec2a2579.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_ace4c14e877d322200aeb2be8061396a2fbe57eb.1920x1080.jpg?t=1590534805,https://cdn.akamai.steamstatic.com/steam/apps/315660/ss_db168e4143ff48f42412231c1e190481bf782060.1920x1080.jpg?t=1590534805",
    "Slug": "trainz-a-new-era",
    "Meta Title": "Trainz: A New Era: May 14, 2015, N3V Games and Full Overview",
    "Meta Description": "Looking for information on Trainz: A New Era? Check out the release date (May 14, 2015), developer insights from N3V Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Trainz: A New Era game - Steam 315660",
    "Canonical URL": "https://gusku.site/game/trainz-a-new-era",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trainz: A New Era\", \"description\": \"Looking for information on Trainz: A New Era? Check out the release date (May 14, 2015), developer insights from N3V Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/315660/header.jpg?t=1590534805\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}