{
    "AppID": 1213710,
    "Name": "Virtuoso",
    "Release date": "Mar 10, 2022",
    "About the game": "Grab an instrument and get ready to jam in Virtuoso, your own virtual music stage! This VR musical sandbox lets anyone play and perform music in new, immersive ways. Explore a range of unique instruments made for VR and share your tracks with the world! BE THE ARTIST OF YOUR DREAMS Create music in real-time using the Looper and easily share it for all to hear! Even if you've never touched an instrument before, features like Tempo Sync and preset scales help you stay in time and on pitch. MADE-FOR-VR INSTRUMENTS The six instruments of Virtuoso have been created specifically for VR. Set up your own custom drum kit with the Empads and tickle the keys of the three-dimensional Oorgan. You can also add vocals with lush reverb using the virtual microphone! FROM OPENING ACT TO HEADLINER The interactive tutorial along with intuitive instruments and tools means that everyone, from professional producers to casual music lovers, can become Virtuosos! But don’t take our word for it, check out what our players have to say! “A brilliant way to experience and experiment with trying to create music on a range of instruments for those of us who don’t have a clue about notation, timing etc. Really intuitive controls and very engrossing. Genius!!” “This shattered my expectations! I had so much fun playing around with the game I almost forgot I was in my room. The visuals are amazing, the instruments are so immersive.” “I was amazed at what you could do with this game. The music you could create is endless! From the visuals to the sounds to the ease of use, this app is 5 stars all the way.” “This is amazing. I don't have any previous experience making music, but I was able to get a good loop going within the first 10 minutes. So many cool instruments!” 'I don't have to worry about what note, chord, or anything else I'm hitting. It's all about reaching out and feeling the music. This is truly a gift I've sought for my whole life!'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1213710/header.jpg?t=1646945372",
    "Price": 13.99,
    "Developers": "Really Interactive",
    "Publishers": "Fast Travel Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1213710/ss_876fd1c2e1edbd1e63bf367a21e2c3c6c3d34a71.1920x1080.jpg?t=1646945372,https://cdn.akamai.steamstatic.com/steam/apps/1213710/ss_0e78ade226d44c44577e5a61d1146c2dcaec9722.1920x1080.jpg?t=1646945372,https://cdn.akamai.steamstatic.com/steam/apps/1213710/ss_04aa369812da991a25a34938c12b0941fb888ee1.1920x1080.jpg?t=1646945372,https://cdn.akamai.steamstatic.com/steam/apps/1213710/ss_06de69be5e88daabe63a0a19df9a67262c986ec1.1920x1080.jpg?t=1646945372,https://cdn.akamai.steamstatic.com/steam/apps/1213710/ss_d043beba73cc723de0696cc56e83c40c49fc60b1.1920x1080.jpg?t=1646945372",
    "Slug": "virtuoso",
    "Meta Title": "Virtuoso: Mar 10, 2022, Really Interactive and Full Overview",
    "Meta Description": "Looking for information on Virtuoso? Check out the release date (Mar 10, 2022), developer insights from Really Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for Virtuoso game - Steam 1213710",
    "Canonical URL": "https://gusku.site/game/virtuoso",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Virtuoso\", \"description\": \"Looking for information on Virtuoso? Check out the release date (Mar 10, 2022), developer insights from Really Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Really Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fast Travel Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1213710/header.jpg?t=1646945372\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}