{
    "AppID": 1180560,
    "Name": "Abelana's Atom Maker",
    "Release date": "Feb 11, 2020",
    "About the game": "Abelana’s Atom Maker is a single-player version of the acclaimed atom building classroom experience already enjoyed by schools and location-based VR venues. It has been enhanced by a self-paced step-by-step guide designed to explain the process of atom creation. Content: Gain intuitive understanding of the composition of atoms by assembling them in a three-dimensional virtual reality setting Visualize all kinds of atomic orbitals - s, p, d, and f - across various energy levels. Understand their shapes, positions, and patterns Understand the behavior of particles within atoms Assemble any element from the periodic table Discover exceptions and special cases among the elements of the periodic table Learn about the order of filling of orbitals Learn about the order of filling of electrons across orbitals Learn to read electron configurations using standard notations Learn about the composition of an atom from an enhanced version of the Bohr diagram Discover different ways to group elements within the periodic table Learn which countries discovered various elements within the periodic table Understand composition of shells (i.e. energy levels) within an element Academically, the experience is designed for grades 7-12, but can have a broader use including by enthusiasts, science clubs, and college level students. Younger students will enjoy intuitive visualization of orbitals and the navigation across atomic structures, while more experienced users can dig deeper into specific elements and try to discover how they fit the bigger picture of the Mendeleev’s vision of the periodic table. What teachers are saying: “The visualization of orbitals in three dimensions is something that really-really hard for students to get a hold of - especially for the grade 12 level where that’s expected - and for them to be able to see those different shapes in three dimensions, it’s really going to help them” -- Jonathan Ohrling, Chemistry Teacher, Waterloo Region District School Board, Canada “The virtual reality experience was literally out of this world! My students were wowed as they explored subatomic concepts coming to life right in front of their very eyes!” -- Leah Goldstein, Chemistry Teacher, Nearpod Certified Educator, New York, USA Location-based use: For a multiplayer version of the software designed for classroom and instructor-led use at schools and VR acrades please contact Abelana VR directly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1180560/header.jpg?t=1581428419",
    "Price": 9.99,
    "Developers": "Abelana VR",
    "Publishers": "Abelana VR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_4df8fb2b2cc756d8468edcdb3a2132f5981c9d0a.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_53609d9756b9674c98713306f59e81b18eab9d66.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_c0534b1bf99d9848a1aa50bcb0b66168da510c61.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_e475a7a434659e4ad0d4e960237ca5a46a5a9503.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_92496d869fe947939cc13a246bf421e85ec5c8f8.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_e090f529b44fdfeda87b8ddff3ca67e4da0cc9f6.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_0033d7ddeda35c4f62bacb08adcdffcc03169bbd.1920x1080.jpg?t=1581428419,https://cdn.akamai.steamstatic.com/steam/apps/1180560/ss_2974090c88b67701a4eedd3eb2d1a71343c69b56.1920x1080.jpg?t=1581428419",
    "Slug": "abelana-s-atom-maker",
    "Meta Title": "Abelana's Atom Maker: Feb 11, 2020, Abelana VR and Full O...",
    "Meta Description": "Looking for information on Abelana's Atom Maker? Check out the release date (Feb 11, 2020), developer insights from Abelana VR, and a complete game summ...",
    "Alt Text Image": "Official header image for Abelana's Atom Maker game - Steam 1180560",
    "Canonical URL": "https://gusku.site/game/abelana-s-atom-maker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Abelana's Atom Maker\", \"description\": \"Looking for information on Abelana's Atom Maker? Check out the release date (Feb 11, 2020), developer insights from Abelana VR, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Abelana VR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Abelana VR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1180560/header.jpg?t=1581428419\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}