{
    "AppID": 1146210,
    "Name": "Adam: Robot World",
    "Release date": "Oct 30, 2020",
    "About the game": "Control your robot and survive in the wasteland world controlled by artificial intelligence. You need to build strongholds and balance production, trading and transportation. You have to deal with relationships with other strongholds, develop allies or conquer them. You should control pollution and fight against acid rain, snowfall, sandstorm and other bad weather. You have to fight against powerful enemy, build defense towers to protect your base, and send troops to destroy their strongholds. This is an indie game. I made it in last two years. There's no beautiful picture, only the wasteland world and robots. However, this is another perspective of human civilization. Sometimes the complex world is simple, and sometimes the cold machine is warm. At present, there are 5 cities with different characteristics and difficulties to experience the game, and the whole game time is estimated to be more than 200 hours. Watch the trial video on YouTube: GAME POSITIONING This is a construction and operation game that includes battles between strongholds. You need to balance the optimization of production efficiency and the improvement of military strength. The game is easy to play, but it's not easy to win in the end. Your stronghold won't die out because of a single defeat, but can be rebuilt quickly, which makes you always reach the final battle. But if the development is not fast enough, you will not win in the final battle. In fact, it is normal for ordinary players to win the final battle through multi-generations game. Some items can be inherited between generations to help you become stronger and stronger. At the same time, the world of each generation will be re-randomized, so the construction and development strategy will be different every time. GAME CONTENT Build factories to recycle all kinds of waste left by human beings for reproduction. Maximizes production efficiency by planning the distribution of buildings, roads and robots. Trades with other strongholds to obtain electricity. Rescue and accept different robotic partners and increase your hands. Unlocks buildings, robotic components, various production technologies and combat technologies in technological tree. Arm your robots, attack Justicar and robber robots'strongholds for resources. Use defensive buildings to protect your strongholds. Collect the remains of human civilization, and they will enhance your strength. If you lose in the final war, a powerful magnetic storm will bring everything back to its original point. Only the civilization remains will be handed down from generation to generation to help you defeat the Justicar in the next round of the game. Please take care of your robots. When they have wisdom, they will have their own joys and sorrows. 30 + buildings can be unlocked and constructed. 120 robotic components can be replaced. 200 + technologies for unlocking. 40 + Robots with different functional modules (skills). GAME FEATURES The core of operations is the location of buildings and road planning, which will greatly impress productivity, and if you want, there will always be room for improvement. Because production depends on the transport behavior of robots between different buildings, rather than a simple mathematical model, you can't get a definite productivity result. You need to observe production and then calculate or plan by instinct. Story mode uses a fixed map to take you into the robot's mental journey. Free mode uses random maps, and different terrain, resource distribution and climate change bring you different game experiences.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1146210/header.jpg?t=1604066512",
    "Price": 6.99,
    "Developers": "ZGame Studio",
    "Publishers": "ZGame Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_7114c1d05ec3031de87335889508ac36cc7b13bb.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_b2859042c7754ccbca59919d9553935833cc34a2.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_1e73fc555f431f09139c1784a647e3dcd682ac0e.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_105668fa218e111e05ab556a26a7743e2085f4d2.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_79c8d7d16f2ed9908539f4fc839e7a03cd3df9c8.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_002822bb1a39f31570275ea5f33e76edbdb54c1f.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_a34dcb98b98c75ac1913b9355231f772a4f96491.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_55ba87879259c2a3532e7b75e26bead591cc6a6d.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_46958eb900790748a5b6c26066dbc0b3b054aabb.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_159477d158ef2ffbfd4aa3883712db087dd179f0.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_2798fcad49731a4681628ffe2c7ac78350503813.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_33ddf0ae1bffa7d3730185d9a97483f3ce1a3796.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_f8a034aed146ea7419e9a11caac05d55086ea607.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_3df5e96c5b4b0180245ddebd16560cf575da0a01.1920x1080.jpg?t=1604066512,https://cdn.akamai.steamstatic.com/steam/apps/1146210/ss_0d2f7c5091192054364801b9b326868e093b6600.1920x1080.jpg?t=1604066512",
    "Slug": "adam-robot-world",
    "Meta Title": "Adam: Robot World: Oct 30, 2020, ZGame Studio and Full Ov...",
    "Meta Description": "Looking for information on Adam: Robot World? Check out the release date (Oct 30, 2020), developer insights from ZGame Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Adam: Robot World game - Steam 1146210",
    "Canonical URL": "https://gusku.site/game/adam-robot-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adam: Robot World\", \"description\": \"Looking for information on Adam: Robot World? Check out the release date (Oct 30, 2020), developer insights from ZGame Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ZGame Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ZGame Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1146210/header.jpg?t=1604066512\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}