{
    "AppID": 1125240,
    "Name": "Ancient Dungeon",
    "Release date": "Nov 3, 2021",
    "About the game": "Grab your gear and delve into the dungeons of this rogue-lite dungeon crawler, Ancient Dungeon VR, and uncover its secrets. The Ancient Dungeon is known throughout the land; a place of malice and danger to all but a few brave souls. These men and women - adventurers, explorers, even scholars - enter the dungeon in pursuit of legendary fortunes and objects of immense power, all believing themselves more capable than those who have gone before...but few return. You would follow them? So be it, but take care: the dungeon will twist and shift behind as you pass, confounding any escape. To survive, you must find a way through, for there is no way back. Fight through hordes of different monsters with your sword, throwing knife, or crossbow, and collect tons of different powerups along the way to improve them and change their behaviour. Every dungeon you visit is procedurally generated, which means, each run is different from the last one! Do you have what it takes to find out what lies below? Randomly Generated Dungeons All dungeons you encounter in your playthrough are randomly generated and filled with traps, secrets, semi-bosses and tons of different kinds of loot. The deeper you go the more dangerous the environment and the enemies will get. There are differently themed dungeons that you'll encounter, for example the Overgrown Gatehouse, that features a lot of vegetation and plant based enemies or the Forgotten Library, where magical creatures reside. Upgrade your character and aid the research of The Grand Library Unlock and upgrade new dungeon features by interacting with The Acolyte at base camp Unlock and upgrade new weapon features by interacting with The Blacksmith Complete the Item Compendium by collecting every single pickup contained in the dungeon Reveal the true history of The Ancient Dungeon by searching the dungeon for long-lost writings and histories Complete specific tasks in The Ancient Dungeon to aid the research of The Grand Library Tons of different item upgrades: Collect and unlock over 100 different upgrades, ranging from simple helper upgrades, such as companion wisps to gamechanging upgrades such as exploding, homing, throwing knives. Create crazy item synergies if you know what you are doing! An interactable world Use the environment to your advantage, cut your way through grass realistically, destroy pots and throw or drink potions. Tons of different enemies! During your runs you will encounter tons of different enemies, many unique to their respective dungeon type. Encounter wights, slimes, skeletons, wisps, flying skulls, champion enemies and more! The combat in game is physics based, which means your melee and ranged strikes feel extremely satisfying. Modding Support Do you want to spice up the gameplay? Ancient Dungeon features rich modding capabilities that let you change the game to your liking. It is possible to mod new items, new enemies, new achievements, and much more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1125240/header.jpg?t=1657479972",
    "Price": 19.99,
    "Developers": "Eric Thullen",
    "Publishers": "Eric Thullen",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_ccce4e781a978a82e5f0f616f60f38959c141396.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_a10f56c7b1b541743308d7a60e81d63396fd9503.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_2ec38f430a4e1661cbe3a5237454fa0e47b990e2.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_84b87c536fe280be4c3cb664b9221aaa2e2528f0.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_9af7078175b5b153bfaa0711d6ef019b4f6c84cb.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_fd2679d8dfc30ae1344d5833b597ab85ca6780d5.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_496922626e6afb384f939bb3856963f5004532e3.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_fa0f4142455b3cc7cd12ca5ca05cfe1284c6cc2e.1920x1080.jpg?t=1657479972,https://cdn.akamai.steamstatic.com/steam/apps/1125240/ss_89580911cc5076e8833c6e28f0f7b5556d299c80.1920x1080.jpg?t=1657479972",
    "Slug": "ancient-dungeon",
    "Meta Title": "Ancient Dungeon: Nov 3, 2021, Eric Thullen and Full Overview",
    "Meta Description": "Looking for information on Ancient Dungeon? Check out the release date (Nov 3, 2021), developer insights from Eric Thullen, and a complete game summary.",
    "Alt Text Image": "Official header image for Ancient Dungeon game - Steam 1125240",
    "Canonical URL": "https://gusku.site/game/ancient-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ancient Dungeon\", \"description\": \"Looking for information on Ancient Dungeon? Check out the release date (Nov 3, 2021), developer insights from Eric Thullen, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eric Thullen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eric Thullen\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1125240/header.jpg?t=1657479972\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}