{
    "AppID": 932810,
    "Name": "BattleCry: World At War",
    "Release date": "Oct 1, 2018",
    "About the game": "In a future world of war and chaos, a hero rises to lead the forces to victory in epic battles with the enemies to bring back order and to dominate them all. Make alliances, build the greatest military force, defend your allies and together rule the world! Cool New Features Battle Cry is one of the most feature rich and diverse modern war TEXT-BASED RPG ever created. Get involved in Ops Missions, Battle rivals, Form Alliances and fight enemy alliances. With your team having your back, wage Total Domination Wars, Weekly Tournaments and lots more. Build your Army, Air Force and Navy with a large set of units to choose from ! Recruit Soldiers and Military hardware to your army. Each unit has an attack rating, defense rating and an upkeep cost. Make sure you understand the advantages and disadvantages before making the final decision. Choose wisely, commander ! Construct Defense emplacement to fortify your base from enemy attacks ! Outposts help you mount an effective defense against enemy raids. Investing wisely in emplacements can help your army with its defensive capabilities as well. It is something which shouldn’t be taken lightly. Recruit Captains to lead your troops in various branches of your Military Captains are your right-hand Men who are put in charge of commanding your army. Each captain belongs to a particular branch of the Military (Army, Navy, Airforce) and has a limit on how many troops in the branch he/she can command. Earn unique Honor Medals for your achievements and command the respect of your forces For your hard work and dedication you are awarded Honour Medals which is features in your profile. It shows who you are and what you are capable of! Upgrade your Federation Captains and defend their zone in Federation battles Help defend the zones in control of your allied captains (also know as Federation Captains) from their enemies. In return, they offer their help in commanding your troops. The more you help them defend their zone, more powerful they become in aiding you. Manage your Economy to build your income to strengthen your War Efforts Maintaining an army is costly and it requires a constant supply of manpower and materials to keep the War Machine running. Construct various economic structures to help you keep your army in shape. Upgrade your military might by investing points in R&amp;D and conducting various military drills As the war progresses, so does the tactics and strategy involved in waging a war. Invest in R&amp;D to gain an edge over your enemies. Also, make sure you conduct drills to ensure your military is in shape to take on any challenges bestowed upon them. Use your COMMAND CENTER to switch your command to various war fronts around the world Relocate to your Forward Operating Bases over-watching various battle fronts. Each front has its own operations to be executed and you need to make the right decisions to ensure victory. Infiltrate enemy lines and engage in Spec OP missions to capture strategic locations Completing Special Operations successfully will grant you the critical advantage which will aid in your War Efforts but don’t think it will be that easy. And more... Engage OPERATIONS in various parts of the world... capture the land back and clear out the enemy sectors. Show off your military prowess in battles, defeat and decimate your rivals, destroy their defenses and capture their resources, gain experience and progress through higher levels. Order commissioned Strike on your rivals to make them restless and bring fear into their minds. Conduct hunter-killer Drone Hits for rewards ALLIANCE WARS ™ : All out Multi-player fun Join powerful ALLIANCES and rule the WORLD as a team. Chat and coordinate real-time with your ALLIANCE members and equip powerful ALLIANCE ARSENALS Engage in ALLIANCE WARS and win exciting war rewards for you and your team. Earn Alliance's respect become the GENERAL ... Or start your own ALLIANCE and recruit members to its ranks and build a new team. Capture other ALLIANCE STATES and STRATEGIC BASES and collect hourly payouts for your alliance members. Join TOTAL DOMINATION to war other ALLIANCES simultaneously... winner takes all the rewards. Send and receive powerful ALLIANCE BACKUPS from your teammates. Find matching alliances to join with SEEK N DESTROY Fight the dreaded AXIS ALLIANCES to win exciting rewards and new ALLIANCE ARSENALS . Use COUNTER STRIKES to revenge rivals who messed with your alliance members. Take part in weekly TOURNAMENTS and gain respect and reward for your alliance and yourself. Personalization Sync your account with Facebook, Google, and Steam Custom Avatars with Gravatar, Facebook In-game player profile &amp; live comments feed. Live leaderboards (Commander-level and Global) to see where you stand against the rest of the players. Real-time in-game notifications",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/932810/header.jpg?t=1538459253",
    "Price": 0.0,
    "Developers": "DYNAMICNEXT",
    "Publishers": "DYNAMICNEXT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_883062b2fd342041072fab5147e6f41348f76a2e.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_dd19952b23d72660589a38fc7eb17b1fe3ee411c.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_d52461ec708de571a986a227aa5583b4fe56e9d4.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_c5897d3d2d458bcc1a84a006a349ed7cdc7f5de4.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_56b6d8cc42f8b9ada09969ff7593934e4976a2f6.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_74a5e0ff7f4fab219e5d2e9b1e95cba336c10351.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_2303a08b70150790f357e852025cda581ffd1f1f.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_ded91d7395cad5e7d7252283dfef115f0811d307.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_ad44ad1c4dcab1004784cb6cfdca6c21ca09c92e.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_ecab10978c55b20485e9e82f4ec1b7472fdf337d.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_d1731d95c2d50137f0613d4b55510beaa6115798.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_1c668f632d8a902fbca1c0c525d00dd56e889ee0.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_b3ab8b7af6674443709245a95bdc2071e6df0661.1920x1080.jpg?t=1538459253,https://cdn.akamai.steamstatic.com/steam/apps/932810/ss_78d1362bde5a251c620e6df03b6922142e3a128c.1920x1080.jpg?t=1538459253",
    "Slug": "battlecry-world-at-war",
    "Meta Title": "BattleCry: World At War: Oct 1, 2018, DYNAMICNEXT and Ful...",
    "Meta Description": "Looking for information on BattleCry: World At War? Check out the release date (Oct 1, 2018), developer insights from DYNAMICNEXT, and a complete game s...",
    "Alt Text Image": "Official header image for BattleCry: World At War game - Steam 932810",
    "Canonical URL": "https://gusku.site/game/battlecry-world-at-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BattleCry: World At War\", \"description\": \"Looking for information on BattleCry: World At War? Check out the release date (Oct 1, 2018), developer insights from DYNAMICNEXT, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"DYNAMICNEXT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DYNAMICNEXT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/932810/header.jpg?t=1538459253\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}