{
    "AppID": 235380,
    "Name": "Blitzkrieg 3",
    "Release date": "Jun 2, 2017",
    "About the game": "Blitzkrieg 3 is an online WW2 RTS made for true admirers of strategic mastery! Challenge your tactical skills in historical campaigns and defeat other players or powerful Neural Network AI in competitive matches. Each of three campaigns provide a unique blend of PvE, PvP and PvAI missions. Blitzkrieg's impressive Neural Network AI acts like no machine before. In total, game features 70 historical missions with 200+ authentic combat units. Blitzkrieg 3 is being created with the active participation of the player community. Define the way of projects’ development together with us! A Neural Network machine named Boris plays at the top player’s level while not using any hidden information about the enemy. General Boris regularly analyzes the gaming session and makes Neural Network-based predictions of the enemy behavior. This approach allows him to think up sophisticated counter-strategies and bring them to life. That makes Boris tough and unpredictable, so he can amaze you over and over again. Dominate on the battlefield in three atmospheric historical campaigns, that cover the main period of World War II: from the invasion of Poland in 1939 to the triumphant capture of Berlin in 1945. Choose your side of the conflict - USSR, Axis or Allies! Take command over your forces and win the legendary battles of World War II, that were created from archival materials on historically accurate maps. The best strategists will get additional rewards for perfectly cleared missions! Choose your side in the largest war in the history and fight against Neural Network AI or real opponents. Improve your tactical skills in the classic Skirmish mode 1x1, 2x2, 3x3, fighting with Boris, friends and other players for control over the map. Master your defense skills in the unique to the strategy genre - Assault mode, where one player attacks and the other defends his fortifications. You will lead more than 200 authentic combat units into battle. All of them were developed based on historical technical characteristics - more than 100 models of armored vehicles and self-propelled guns, 40 different types of infantry and assault squads and variety of different fortifications and defenses. Each unit has performance characteristics reconstructed in detail, such as fire rate, armored capture, field of vision and others that let you feel like a real commander. Assemble and train your army and form your own squads to complete the missions. Use every opportunity to defeat the enemy: consider features of the landscape, weather conditions and viewing ranges of different types of forces to carry out the most daring tactical operations. Attack the enemy when he doesn't expect it. Use stealthy scouts and place infantry in the trenches, fortifications, pillboxes and even civilian buildings! Learn tactics from legendary strategists! Appoint Zhukov as the commander of your forces and defeat Manstein! In the game available more than 20 commanders, with unique features and combat tactics based on command styles of their historical prototypes. Complete tasks in single and multiplayer modes and earn the loyalty of different commanders. Each can give you useful bonuses and additional features on the battlefield. Rokossovsky, Rommel, Montgomery - the choice is yours! Each commander has his own specialization and favorite combat tactics that make tactics development of the game even more diverse, providing additional opportunities for interesting combinations. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/235380/header.jpg?t=1573220690",
    "Price": 9.99,
    "Developers": "Nival",
    "Publishers": "Nival",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_c9430f589275742307939192e669e85594d15971.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_c06062a87b547cef8d1c01e5a15d4ede4e0bb758.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_8c4a45b1527f427369e4144b1150f0018fd3af36.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_7f1bcda267465851216551910458ee1c3d6f7fa5.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_2d2e90b025936d11d9ce80c801fcaa26976d54b6.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_960b10ca2fb9a2d865a5fd9c03c2f029727f6d70.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_f88687153ee99d6af4e57f5f70c403454a0b424f.1920x1080.jpg?t=1573220690,https://cdn.akamai.steamstatic.com/steam/apps/235380/ss_d13fe2cac7725ac610755c38b8dd03f77dad5dfb.1920x1080.jpg?t=1573220690",
    "Slug": "blitzkrieg-3",
    "Meta Title": "Blitzkrieg 3: Jun 2, 2017, Nival and Full Overview",
    "Meta Description": "Looking for information on Blitzkrieg 3? Check out the release date (Jun 2, 2017), developer insights from Nival, and a complete game summary.",
    "Alt Text Image": "Official header image for Blitzkrieg 3 game - Steam 235380",
    "Canonical URL": "https://gusku.site/game/blitzkrieg-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blitzkrieg 3\", \"description\": \"Looking for information on Blitzkrieg 3? Check out the release date (Jun 2, 2017), developer insights from Nival, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nival\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nival\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/235380/header.jpg?t=1573220690\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}