{
    "AppID": 2065530,
    "Name": "Chicken Fall: Prologue",
    "Release date": "Jul 22, 2022",
    "About the game": "Follow Us Follow our official community at： Discord: Bento Duck Games Have you forgotten how to fight after being absent from the battlefield for so long? In the prologue, lead your chickens to re-familiarise themselves with the sensation of battle! The full version of EA will be available soon, so keep an eye on the wishlist!!! The threat level cap for the prologue is locked at 8, the full version will not limit the threat level. More weapons, defenses, and novelty items will be unlocked. More scenarios, storylines, and enemies will be unlocked. Multiplayer mode will be included (in development...) Game Overview Chicken Fall: Prologue is a pixelated tactical strategy + horizontal shooting Roguelike game. The game was created by one person with an independent liver. In the game, the player controls the protagonist, Chicken Boss, and defeats a band of various carnivores in the forest with the help of his friends. The overall game style is light-hearted and witty, and thrilling. Elements randomly generated In the game, the map is different each time the player enters a level, and each time the map is assembled with random resources. Enemies in the map are randomly generated based on rules such as the current threat level. The strength of the enemies also changes with the threat level. The location of resources such as treasure chests in the map are also randomly generated. Tactical Strategy Pre-battle preparation is very important! What props you choose to enter the battlefield will have a bearing on whether or not the battle goes well. During the battle, the use of resources and the choice of resources is also a major challenge for players. Players can call for support in battle, including resource drops and paratroopers, by setting drop locations and adjusting tactics to gain an advantage in battle. When facing multiple enemies at once, recklessness can lead to defeat, so battle strategy becomes important and players will need to use a variety of props and skills to defeat them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2065530/header.jpg?t=1658473347",
    "Price": 0.0,
    "Developers": "NightWalker",
    "Publishers": "BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2065530/ss_84f2f7d569ec20dc1e06180157fd9f461b4d37f8.1920x1080.jpg?t=1658473347,https://cdn.akamai.steamstatic.com/steam/apps/2065530/ss_1e75c15d636cbd640832765c4939e8a9fee772d8.1920x1080.jpg?t=1658473347,https://cdn.akamai.steamstatic.com/steam/apps/2065530/ss_339c2f208354c241208dbf8c006b9e0583f11e61.1920x1080.jpg?t=1658473347,https://cdn.akamai.steamstatic.com/steam/apps/2065530/ss_922f6e41e359dc6e2c2659fb0add276eca50016c.1920x1080.jpg?t=1658473347,https://cdn.akamai.steamstatic.com/steam/apps/2065530/ss_e997c7c589e5d1da35a75f7af7c94dfd86e03042.1920x1080.jpg?t=1658473347",
    "Slug": "chicken-fall-prologue",
    "Meta Title": "Chicken Fall: Prologue: Jul 22, 2022, NightWalker and Ful...",
    "Meta Description": "Looking for information on Chicken Fall: Prologue? Check out the release date (Jul 22, 2022), developer insights from NightWalker, and a complete game s...",
    "Alt Text Image": "Official header image for Chicken Fall: Prologue game - Steam 2065530",
    "Canonical URL": "https://gusku.site/game/chicken-fall-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chicken Fall: Prologue\", \"description\": \"Looking for information on Chicken Fall: Prologue? Check out the release date (Jul 22, 2022), developer insights from NightWalker, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NightWalker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2065530/header.jpg?t=1658473347\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}