{
    "AppID": 704640,
    "Name": "Evolution of Ages: Settlements",
    "Release date": "Aug 3, 2018",
    "About the game": "Civilisation as we know it has been destroyed. We are little more than a few scattered people living in caves and under bushes, banging rocks together to keep warm and eat berries. Your challenge is to bring humanity together. Lift us up out of the stone age and forge ahead, all the while worrying about what destroyed mankind last time and if it will return to finish the job. Evolution of Ages is a game of managing resources and crafting output over a limited space. You control the pace of the game, relax for many days of playing as you customize each character and train their skills in the items of the era, or rush ahead researching technology as fast as you can. The choice is yours. Features Character Customisation - Change name, appreance &amp; voices, obtain a large range of feats and even allocate them to families. 10 Technological Eras - From the Stone age to the Space Age. You control the pace of advancement through research and seeking out more land to settle. Play at a speed you are most comfortable with and stay in an era as long as you wish. 100+ Buildings to place and use from housing to factories. With space being your primary issue for much of the game, deciding on what to build is key to success. 60+ Character Skills. Each character can only train in 15 skills at any one time, so you will need to develop specialists and keep them alive. 10+ World Skills. Ranging from house design and metal lore to militia combat training, these skills will effect all your settlements. Diplomacy Points. Although you cannot fit everyone into your settlements, the people who live in the wild are still important to your success. Help them and gain diplomacy points that can be spent on benefits later. 1000+ Items, books and recipes: The game has in-depth crafting at its core. Your characters will need to gain skills in various crafting methods to unlock the ability to craft rare and more powerful items as well as advance in technological eras. 100+ Base Monsters 12 Boss fights, each with their own unique treasure. (Including some with difficulty levels, ultra rare drops and rare spawns) Scout the world for information on the Blight and help out the struggling remains of mankind. 5 Difficulty Settings World and Settlement Threat - leading to the Doomsday system and Main Plot Failure! Be careful not to take on challenges that are beyond your character's skills. Too many failures will increase doomsday points and lead to Victory for the Blight. The Game includes Update 3: Enhanced Combat As well as game improvements, this free update adds the following to the core game: 4 New Boss fights 55 New pieces of equipment A new enhanced combat screen with new mechanics, effects and more options for ranged support. 7 New character feats All new High Definition character artwork. An extra Science tree unlock. A complete rebalance and overhaul of all equipment from Stone Age right the way through to the Space Age, providing a better progression path and smoother gameplay. Update 2: Beastmastery As well as game improvements, this free update adds the following to the core game: 31 New pets 2 new adventures A whole new game mechanic: Pet Breeding 18 New Steam Achievements 2 new character feats The ability to use 2 pets in combat and level up their powers. Update 1: The Black Swamp As well as game improvements, this free update adds the following to the core game: A new merchant system A new adventure The boss fight: The Swamp Vampire 15 new items 2 new pets 6 new recipies A new character feat. Language Support Thanks to community support, the tutorial is now also available in Chinese, German, Japanese and Dutch",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/704640/header.jpg?t=1591971058",
    "Price": 8.99,
    "Developers": "TREON Games",
    "Publishers": "TREON Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_b926a98df7a7e1367abfc03be2e43307ba01ed1b.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_73c6fd204376a35282299e3e6ddf28727be0524c.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_874999dbb19f7384d121728ce7981bbc69f1d22e.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_92d08bfd9b39b4d2768923000faf0c4553af2f48.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_6998bf4628fef102283710855bd282bdca1b1acf.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_2ebbdf2c284a07e94660abe370913462a062585f.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_4920981aebb0d387bbb8bc015f6ab910dd05e02a.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_9154be6b8ea8a4477e507f12397b9ab8aa456374.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_6231f8a18e5973185e55394208f179d3b14d5cdb.1920x1080.jpg?t=1591971058,https://cdn.akamai.steamstatic.com/steam/apps/704640/ss_a2a29854e58c11c481d5181f9902525328a6cb5e.1920x1080.jpg?t=1591971058",
    "Slug": "evolution-of-ages-settlements",
    "Meta Title": "Evolution of Ages: Settlements: Aug 3, 2018, TREON Games ...",
    "Meta Description": "Looking for information on Evolution of Ages: Settlements? Check out the release date (Aug 3, 2018), developer insights from TREON Games, and a complete...",
    "Alt Text Image": "Official header image for Evolution of Ages: Settlements game - Steam 704640",
    "Canonical URL": "https://gusku.site/game/evolution-of-ages-settlements",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Evolution of Ages: Settlements\", \"description\": \"Looking for information on Evolution of Ages: Settlements? Check out the release date (Aug 3, 2018), developer insights from TREON Games, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"TREON Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TREON Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/704640/header.jpg?t=1591971058\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}