{
    "AppID": 660160,
    "Name": "Field of Glory II",
    "Release date": "Oct 12, 2017",
    "About the game": "Field of Glory II is a turn-based tactical game set during the Rise of Rome from 280 BC to 25 BC ;v=veTBw3GCZ4w The game that brought the fun and excitement of the tabletop experience to digital form is back. Developed by legendary designer Richard Bodley Scott in a completely new 3D engine, Field of Glory is ready to set new standards in computer wargaming. Field of Glory II allows you to fight large or small battles for or against Rome, or between the other nations who are as yet unaware of the Roman threat, or what-if battles between nations that never actual came into conflict historically, but might have done if the course of history had been different. Take command of a huge variety of armies employing vastly different tactical doctrines. Lead your chosen army and its named generals to victory in set-piece historical battles or 'what-if' custom battle situations against an AI or human opponent. Victory will require determination and tactical mastery! FEATURES Accurate simulation of Ancient battle in the last three centuries of the pre-Christian era. 86 historically accurate units, built from fully animated 3D troop models, each with many variants. These allow Field of Glory II to represent the full range of troop-types and tactical doctrines that make this era one of the most interesting to wargamers and military historians. To name just a few, there are Roman legionaries before and after the reforms of Marius, Greek hoplite and Carthaginian African spearmen, Hellenistic pike phalanxes, thureophoroi spearmen and xystophoroi lancers, Gallic warbands, Skythian horse archers, Sarmatian lancers, Roman, Carthaginian, Greek and Gallic spear-armed cavalry, war elephants, Celtic and Indian chariots, scythed chariots, a wealth of light troops and many many more. 12 Historical scenarios covering key engagements of the period on an epic scale. These include Bagradas 255 BC, Trebia 218 BC, Cannae 216 BC, Ilipa 206 BC, Zama 202 BC, Magnesia 190 BC, Pydna 168 BC, Chaironeia 86 BC, Tigranocerta 69 BC, Bibracte 58 BC, Carrhae 53 BC and Thapsus 46 BC. The player can play as either side. Custom Battle system allows unlimited “what-if” scenarios using historically realistic armies from carefully researched army lists, on realistic computer generated terrain maps. Armies covered include Romans, Carthaginians, Hellenistic Kingdoms (Macedon, Seleucids, Ptolemaic Egypt etc.), Gauls, Ancient Britons, Galatians, Spanish, Numidians, Spartacus’s Slave Revolt, Thracians, Skythians, Sarmatians, Parthians, Indians and lots more. Campaign mode allows you to rewrite history as you play through the battlefield careers of some of ancient history’s greatest generals, or war with any ancient nation against any other. Each victory increases the experience and elan of your core units. Quick to resolve strategic decisions allow you to go straight from one battle to the next without any delay. Random map generator produces an infinite variety of historically realistic battlefield maps for custom battles and campaigns. Scenarios include open battle, pursuit, awaiting reinforcements, enemy awaiting reinforcements, flank march, rearguard action, advance guard, remove the head, and protect the baggage. Classic turn-based, tile based gameplay. Easy to use interface, hard to master gameplay. Cohort-sized units. Battles can range from a few units to as many as 80 units per side. Named generals who can influence combat and morale of units under their command. Single player and multiplayer battle modes. Effective AI makes sound tactical decisions. 6 difficulty levels allow the challenge to increase as you develop your battlefield skills. Numerous different unit organisations, combat capabilities and tactical doctrines allow full representation of tactical differences and developments through the period. Mod friendly game system with built-in map editor. Multiplayer mode allows historical scenarios and “what-if” scenarios to be played by two players using Slitherine’s easy to use PBEM server.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/660160/header.jpg?t=1614686424",
    "Price": 29.99,
    "Developers": "Byzantine Games",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_1d12a0e2314f7321d0e7b6e55b1930e2b1cd8f46.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_f99c7e0e002ce4e1b8e545feb3b7129ea7cce98d.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_4d40c764f7818b061592454148488c71ddfa1955.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_81fd833499a116306f99303bf5e752133b925807.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_5c370b6613a95dff5d67063c38784a763144f11c.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_b8ead87184bf9755fc7be10f605be8130cf5532d.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_0a2a1672e013047cd29b12a970668148332796eb.1920x1080.jpg?t=1614686424,https://cdn.akamai.steamstatic.com/steam/apps/660160/ss_a830465f27b2bb8c11e4e09bc1b4b2887b0f9d5b.1920x1080.jpg?t=1614686424",
    "Slug": "field-of-glory-ii",
    "Meta Title": "Field of Glory II: Oct 12, 2017, Byzantine Games and Full...",
    "Meta Description": "Looking for information on Field of Glory II? Check out the release date (Oct 12, 2017), developer insights from Byzantine Games, and a complete game su...",
    "Alt Text Image": "Official header image for Field of Glory II game - Steam 660160",
    "Canonical URL": "https://gusku.site/game/field-of-glory-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Field of Glory II\", \"description\": \"Looking for information on Field of Glory II? Check out the release date (Oct 12, 2017), developer insights from Byzantine Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Byzantine Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/660160/header.jpg?t=1614686424\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}