{
    "AppID": 1679290,
    "Name": "Fire & Maneuver",
    "Release date": "Jul 15, 2022",
    "About the game": "Overview From The Armchair History team comes Fire &amp; Maneuver, a unique strategy game made by history buffs for history buffs, wargame enthusiasts, and casual players alike. Striking the perfect balance between history and playability, F&amp;M combines true-to-life units created through extensive historical research with clever but engaging mechanics developed by a passionate team to create a strategy title that has a little something for everyone. Find yourself plunged into Victorian warfare, where every moment seems to bring some new tactical or technological innovation. Forget about such matters as politics and economic affairs, as your sole purpose in F&amp;M is military victory. Fight against your friends in recreations of historical battles, or forge a new path for Europe as you veer off the tracks of history. Consider carefully whether to push your campaign offensively or cede the initiative to your opponent, as constant offense will drain your precious resources. And with new countries and units always in development, discover new ways to write your name on the pages of history. Turn-Based Combat with a Twist No plan survives first contact with the enemy, and F&amp;M places you in the same position as historical generals: anticipating your opponent’s movement. The game’s innovative “simultaneous turn system” requires careful consideration of your opponent’s potential actions. Instead of passively waiting to react to a move already made, you must actively consider all possibilities, deciding which tactical choice your opponent is most likely to make… and which you can accept not responding to. Withdraw to better ground, vigorously attack, or simply dig in and see what your opponent does - the choice is yours, and your orders are final. Factions 1853-1871 Take command of the greatest armies of Europe and beyond, and marvel as your troops develop through the Early and Late Periods of gameplay. Second French Empire A well-balanced and versatile force with a bevy of units to choose from, including the highly durable Foreign Legion… but beware your foes’ superior numbers and quality of artillery. North German Confederation Formerly the Kingdom of Prussia, this new nation boasts strong commanders who lead a patchwork of well-armed units from across the German States, from Bavarian and Württemberg infantry to the dreaded Krupp artillery… but beware the short range of your fast-firing rifles and the danger this poses to your men. British Empire Rigorously drilled infantry lay down punishing volleys, and the famed Highlander infantry from Scotland can repel any foolish enough to charge their lines… but beware the cost of your units, the highest in the game. Russian Empire Draw upon weight of numbers and the zeal of your soldiers to sweep the enemy from the field, with aggressive columns of infantry while the feared Cossack Cavalry flank behind enemy lines… but beware losing control of your men in the heat of battle. Ottoman Empire Fill the battlefield with your forces comprising a seemingly endless tide of militiamen, including the bizarre “Bashi Bazouks,” known in the West as “The Crazy Heads”… but beware the lack of discipline endemic to Ottoman armies. Austrian Empire Find the balance between two forces in one army, including expert skirmishers to engage your opponent at long range… but beware this sole advantage becoming a liability as the fight draws closer and closer. Kingdom of Italy Nationalism allows you to draw on expert mountain troops and political paramilitaries both… but beware your specialized troops’ lack of professionalism. Multiplayer Fight your friends or match wits against other armchair generals as you engage in everything from preset historical scenarios, stepping into the shoes of Moltke or Bazaine, to utter historical fantasy, pitting British redcoats against German Krupp guns on the Steppes of Russia. F&amp;M is designed to reward good generalship over random luck. Wear your laurels proudly as you defeat other players, confident that you truly earned each victory. Customization (COMING SOON) As you win battles and earn merit, you will unlock the ability to create your own regiments to bring onto the battlefield. Design your own unique style of uniform down to the buttons, allowing you to field a signature force that will let your opponents know who they’ve trifled with. Optional in-game purchases will allow for greater cosmetic customization, but there will be NO paying-to-win or wagering on loot boxes . War is enough of a gamble already.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1679290/header.jpg?t=1658155605",
    "Price": 0.0,
    "Developers": "Armchair History Interactive,Targon Studios",
    "Publishers": "Armchair History Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_0da33b53d58eb98f73ce12544b39d58473f1de9c.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_854e4cf85824475b14f04fb9527d67f2e26f699e.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_e70538a383eb9622406f918f2ca25242b97613a6.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_de183836dd8c504c216a871171cafb948681ee86.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_337f9a4fc3387484accec2ea3529b259a83f4798.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_1eb925a4e7f861e4b48778ba732b6ee68ebc9e60.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_16c3572355708fbc66a8070165c9c7ae7a5e1f59.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_9e189b2a43a29dbfb67f104359ff89157727d506.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_227b2d2320db7c98c2ab7527806bd39888d1f174.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_bc47b45b23943c8c0a730d47b771de79ee266b6b.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_cf3ee1ee7243fd41aa661ac2ba6e6ee31060fcb5.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_43bce3bed536fbf349524fa172b7b34b614a75ed.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_d2eef15fa61b91f47f89827e37c8482e6d1d4fd4.1920x1080.jpg?t=1658155605,https://cdn.akamai.steamstatic.com/steam/apps/1679290/ss_a4426b9a857c2f6180d48e0d8f15bbe7c5160719.1920x1080.jpg?t=1658155605",
    "Slug": "fire-maneuver",
    "Meta Title": "Fire & Maneuver: Jul 15, 2022, Armchair History Interacti...",
    "Meta Description": "Looking for information on Fire & Maneuver? Check out the release date (Jul 15, 2022), developer insights from Armchair History Interactive,Targon Studi...",
    "Alt Text Image": "Official header image for Fire & Maneuver game - Steam 1679290",
    "Canonical URL": "https://gusku.site/game/fire-maneuver",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fire & Maneuver\", \"description\": \"Looking for information on Fire & Maneuver? Check out the release date (Jul 15, 2022), developer insights from Armchair History Interactive,Targon Studi...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Armchair History Interactive,Targon Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Armchair History Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1679290/header.jpg?t=1658155605\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}