{
    "AppID": 415180,
    "Name": "Fort Zombie",
    "Release date": "Oct 29, 2018",
    "About the game": "FORT ZOMBIE IS BACK! Back by popular demand, the ground-breaking cult classic indie game that kick-started the modern Zombie Survival genre: Fort Zombie. “We have one chance. Find a strong place, and band together. Build our defenses. Gather supplies. Arm ourselves for the fight and save as many souls as we can. Take back our town, our lives, our world from the hungry dark. That wave will break over this town like a tsunami and take the last of us with them… unless we fight back.” NOTE: THIS GAME IS THE ORIGINAL LEGACY CODE FROM 2009, RELEASED SPECIFICALLY FOR THE PLAYERS WHO WANTED ACCESS TO IT. WARNING: NO FURTHER UPDATES are planned for this version of Fort Zombie. Fort Zombie was released in 2009 as a game without a genre: no one had ever attempted this combination of game mechanics before! It is a focused-scope, casual single-player RPG and strategy title of survival during an epic zombie Apocalypse. The game world revolves around a single building – your Fort. Secure your base of operations and then spend the game visiting the mission-specific chunks of Piety, Indiana, the small American town that surrounds you. Search for weapons, supplies, ammunition and the most important resource of all—fellow Survivors. Instead of a major city or a sprawling countryside, the player must focus effort on building up a single structure, finding and training Survivors to battle zombies, and venturing out into town on missions…all while the clock ticks steadily down toward zero hour, when an Apocalyptic wave of zombies from a neighboring city will crash over the town. Targeted directly at the after-work gamer, Fort Zombie was the first debut of many game concepts and features that would be picked up and popularized in the games that followed afterward, including Day Z, Project Zomboid, Dead Rising, State of Decay. Features Choose one of three buildings – the school, the prison, and the police station – as your Fort Zombie, each one with its own strengths and weaknesses! Real time movement and combat keep the tensions level high while trying to achieve objectives before your characters run out of ammunition, food, or luck! Dozens of zombie types, some with special abilities derived from their half-remembered lives before becoming undead! Piety, Indiana, a variable 3D town, created using Kerberos’ mix-and-match tile system, for maximum replayability. PhysX® engine adds to the mayhem! Dozens of town locations to search (stores, restaurants, gas stations, ruins, homes) and countless items to find and use in building up The Fort or building up your group characters (food, fuel, generators, tools, guns, etc.) “Collectible” NPC’s and Survivor families give players access to the Lore of the game, and unlock surprising new abilities—try to find them all!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/415180/header.jpg?t=1581198196",
    "Price": 3.99,
    "Developers": "Kerberos Productions Inc.",
    "Publishers": "Kerberos Productions Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_5995086b1f8f59a6785e1a4a19b5b8b935a40088.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_1aa6c1ce7d91d70c7460881c3206a32bb58fba6d.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_3e559e1d821ad044e5c3c69ce5a7bce0f124ecb8.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_1eb2f3db292176e3cc98d599c87b33d361889362.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_29d7ca4d5a47472820c40f493bdd9461e52ddc6e.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_df63b8568c8c930b44ef2ebbf5939e7f169c3901.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_a043bdeedd75f5570adbc2f70d4f18a2cf4c6328.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_522362eef1cdbad23df5eb4e48b290bff62871be.1920x1080.jpg?t=1581198196,https://cdn.akamai.steamstatic.com/steam/apps/415180/ss_37baf729e0b2a1f7d04ff3241da9c840666384fa.1920x1080.jpg?t=1581198196",
    "Slug": "fort-zombie",
    "Meta Title": "Fort Zombie: Oct 29, 2018, Kerberos Productions Inc. and ...",
    "Meta Description": "Looking for information on Fort Zombie? Check out the release date (Oct 29, 2018), developer insights from Kerberos Productions Inc., and a complete gam...",
    "Alt Text Image": "Official header image for Fort Zombie game - Steam 415180",
    "Canonical URL": "https://gusku.site/game/fort-zombie",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fort Zombie\", \"description\": \"Looking for information on Fort Zombie? Check out the release date (Oct 29, 2018), developer insights from Kerberos Productions Inc., and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kerberos Productions Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kerberos Productions Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/415180/header.jpg?t=1581198196\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}