{
    "AppID": 1451680,
    "Name": "Game Master Engine",
    "Release date": "Mar 9, 2021",
    "About the game": "Build beautiful 3D battle maps for your tabletop role-playing games with ease. Choose from over 1,500+ props to begin building your world and dive into untold adventures with your whole party. Game Master Engine, or GME, is a new tool for game masters and players alike to add another layer of immersion to their group's sessions. Create and share custom maps, play together online, and forge your own adventures! With tons of props, effects, and tools for customizing each map, no two encounters will ever be quite the same. Create worlds using a massive (and growing) list of props, materials, and effects Join sessions hosted by your GM Explore 3D maps with full range camera Customize weather, ocean, and lighting conditions Rotate, resize, combine, and repurpose any prop with a huge range of manipulation controls Save, load, and share save files with a single save slot Export screenshots directly from the game And more! Over 1,500+ assets to begin creating with and plenty more still on the way. Paint the floor tiles with a large collection of materials. From dry, cracked dirt to crisp snow drifts, there's a floor for every purpose. Fill out the landscape with a huge variety of props. Create indoor locations, outdoor locations, dungeons, underwater temples, or floating islands. You name it, you can build it! Don’t forget to bring your scenes to life using effects. Make menacing portals, raging infernos, elemental rifts, or maybe just a peacefully crackling campfire. Change the lighting conditions and weather to really set the mood. Finally, add some minis and you’re ready to play! Start building today with a library of: 1,500+ Props 70 Tile Materials 44 Walls 46 Mini-Figures 56 Effects And tons more to come The Free Edition of Game Master Engine allows you to connect to any multiplayer session for free as long as the host has the “GM Edition” DLC. You will be able to connect to lobbies through an in-game browser or directly to your friends through Steam. This means that only the GM of your group will be required to own the “GM Edition” DLC for your whole group to play together. Free Edition Owners of this edition will be able to: Join sessions hosted by their GM Create maps in single player with a single save slot GM Edition Owners of this DLC will be able to: Host sessions for their players to join Create unlimited battle and overworld maps Unlock future updates for GM campaign management Unlock future unannounced content packs Just about everything you place into the world can be adjusted in more than one way. Scale, spin, and rotate objects on any axis. Get creative and stretch, alter and combine props into anything you desire! Dynamic weather offers a wide range of customizable weather and lighting effects. Choose the time of day and customize the brightness of the sun and moon to get the optimal settings for your encounter. Customize the weather to include harsh blizzards, intense thunderstorms, dense fog, and more. Custom ocean settings also allow you to change the color of the water, wave intensity, and other water effects. Game Master Engine comes with many beautiful mini-figures provided by our friends over at The Dragon Trappers Lodge, Valkyrie's Playground, and MZ4250. New minis are constantly added to help you bring your encounters to life. Just drop them into the world and start playing. Every mini-figure can be scaled up or down to fit your ideal size. Everything included here is just the beginning. We have much, much more planned for the near future! Asset packs, multiplayer features, workshop connectivity, and more are all planned for future content updates. Here are a few things we have in the works: More Tools For Combat Custom Ability Creation More Weather &amp; Water Options Customize Minis Map Sharing Database",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1451680/header.jpg?t=1655164646",
    "Price": 0.0,
    "Developers": "Game Master Studios LLC",
    "Publishers": "Game Master Studios LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_30118204d249d97d121c0fb5744d8c3ee10c8ecb.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_17608102e8a8c8de10be7462152079215bf77fc3.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_0f7cecea8df1a9d419628491101c9a00cb5dc860.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_d3c18c06d61b41218bc33008ac31b80f8d366a67.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_206e52362db50c57e3c1f5f037d94ad46db059c3.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_edcfaf617867907b3288521523d9b8df778565f8.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_4ad1abe6541d6848d087a3bad2b8ea8f6813d5e0.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_94f182c4d557011d129a1b85f1b9bf3d2c547dc5.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_6b714f296e9e1abe725cbfd95048f36ee329c8b4.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_d4cc51ceeb351af2b5e6cabff9393b525c44272e.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_81d97bc549d0422b6c06df72de8364620625b031.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_e537211a7d36dfc3195a8b8cbe59cbdb4a117377.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_655f9142cfe09e64a6d71d613e299e1aca453c5e.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_ce38d7f4e2f3408bdcae524a3ec5624873e94b3b.1920x1080.jpg?t=1655164646,https://cdn.akamai.steamstatic.com/steam/apps/1451680/ss_0669c334f23b721c86b9ef5d4e30224c51da0087.1920x1080.jpg?t=1655164646",
    "Slug": "game-master-engine",
    "Meta Title": "Game Master Engine: Mar 9, 2021, Game Master Studios LLC ...",
    "Meta Description": "Looking for information on Game Master Engine? Check out the release date (Mar 9, 2021), developer insights from Game Master Studios LLC, and a complete...",
    "Alt Text Image": "Official header image for Game Master Engine game - Steam 1451680",
    "Canonical URL": "https://gusku.site/game/game-master-engine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Game Master Engine\", \"description\": \"Looking for information on Game Master Engine? Check out the release date (Mar 9, 2021), developer insights from Game Master Studios LLC, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game Master Studios LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game Master Studios LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1451680/header.jpg?t=1655164646\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}