{
    "AppID": 1615930,
    "Name": "[International] Absented Age: Squarebound",
    "Release date": "Nov 12, 2021",
    "About the game": "You awaken as a girl with no memories, left alone in the corner of a sinking world... Absented Age is a fresh mix of genres: an action RPG outside of combat that becomes a roguelike-style strategy RPG during combat. If you touch a foe, get an advance attack in, or get jumped yourself, you'll transition directly to turn-based combat, with any surrounding enemies joining the fray. 【New Features in the International Version】 ・Arcade Mode A mode separate from the main game, where you advance through a dungeon you can't bring anything into, and aim for a high score. You can also link your main game save data to control characters other than the protagonist. Features four stages, including stages for two guest characters: Iris from Soaring Machinariae, and Astrake from Reality Minds. ・Bonus Playable Characters Iris from Soaring Machinariae and Astrake from Reality Minds can played as, or made into allies, in Arcade Mode. Iris boasts overwhelmingly powerful three-stage combos, during which adjacent foes can't act. The third hit depends on her current Core, so it's important to change it out to suit the situation. Stopping the combo early at the second hit, utilizing the fact she can strike up to 4 times before engaging combat, can also be an effective strategy. Like in RealityMinds, Astrake can activate a variety of chain skills by combining component skills. Strong followups and a well-balanced lineup of skills makes for a highly adaptable fighter. Be sure to use both the normal and charge variations of the pre-emptive strike for maximum effectiveness. ・Seamless Language Switching You can instantly swap between Japanese and English at any time during the game by pressing the @ key or L3 Button (can be changed). If you're keen to do language study by playing a game, or just find yourself wondering 'how would they say this in another language?', it's yours with the press of a button. (* Existing battle log text will not be retroactively affected by language switching.) The English translation was provided by vgperson. From scenes packed with emotion to humorous wordplay in item descriptions, may you enjoy the intricacies of each translation. ・Secret Boss After beating the game and obtaining gems from four powerful Arc Monsters, try heading back to the location of Squarebound's final showdown... Manage hundreds of skills and items strategically, practice high-level techniques like counters, perfect guards, and hitstop shifting, and put it all together to make short work of powerful monsters! With quick dungeon progression and smooth music transitions, it aims to be fast-paced, free-flowing, and stress-free. Save, of course, for the despair of finding yourself in a hopeless battle, or the emotional turmoil the story may induce. And that is precisely what you, our protagonist, must confront. May you overcome with wisdom, bravery, and kindness, and be left with the best of memories. ・Your dependable partner, Tart Using Enchant skills, you can instantly swap the fighting style of the spirit who fights alongside you, Tart. Enchant Light: Makes him less sturdy, but allows him to fly and excel at support healing. Enchant Fire: Lets him take the brunt of enemy attacks, protecting you with nimble moves and a solid defense. Each time you obtain a Heart Fragment holding a lost memory, you will awaken to a new power... 　　　　―――――――――――――――――――――――――――――――― ・A myriad of skills, items, and ways to dress up As demonstrated in the screenshots, this game is abundant with exchangeable pieces of clothing, as well as status effect overlays. Equipment will break when it gets worn down, so always consider what you should be wearing at any given time. If you obtain multiples of the same piece of equipment, that equipment's Mastery (and value) goes up. Unlike more punishing roguelikes of yesteryear, the Mastery you earn is permanent across all instances of that equipment, so that progress won't be lost even if you lose the equipment. In fact, if you re-obtain a piece of equipment you lost to a defeat, you'll get a big boost to its Mastery. So when you fall in battle, consider it a chance to reclaim your lost belongings stronger than before and take your revenge. This game, Absented Age: Squarebound, is the first part of the larger Absented Age series. Though this first part can be considered a complete story in its own right, there remain elements yet to appear in this game (such as assist summons and real-world embodiment actions), as well as unexplained mysteries. I plan to make updates to the game based on players' feedback while also developing the next game in the series, Absented Age: Ghostbound (tentative title). I'm prepared to improve anything that might be improved upon in this game, so I would appreciate anyone contacting me on my Twitter or elsewhere with their opinions. I hope this game can reach as many people as possible. ◆ Guidelines for Derivative Works 1. Non-profit hobby creations and fanworks (Let's Plays, fanart, etc.) are welcome, but please be sure not to infringe on the copyrights of terunon's Lab or any third parties. As part of the game's brand, the following are not allowed unless given explicit consent. 　- Creating games that appear as if they're official games in the series 　- Anything offensive to general morals (Content with age limits is not particularly restricted, but please practice appropriate zoning) 　- Transfer or sale of unofficial merchandise 　- Simple playback of content with practically no creative element, beyond the realm of citation or introduction (For example, videos that just compile the soundtrack, or videos just showing the story with no commentary or editing) 2. You cannot extract or repurpose data from the game (not including screenshots). 3. When posting playthrough videos, please make it clear in the title, thumbnail, or introduction that it is a playthrough of this game. 4. If you wish to create a derivative work commercially or as a corporation, please discuss it with me. Note: I fundamentally do not view cases like the following as the actions of a commercial or corporate entity, so no discussion is necessary. 　- A YouTuber, VTuber, etc. who does entertainment as a job playing this game as part of their activities 　- Paying to commission a derivative work based on this game on a commission site like Skeb, or taking such a commission 　- A non-corporation profiting from small-scale fanworks, such as doujinshi",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1615930/header.jpg?t=1636728963",
    "Price": 12.79,
    "Developers": "terunon's Lab",
    "Publishers": "Gotcha Gotcha Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_e0e91eae1e2791c4fe0a7665f138d16a532ee203.1920x1080.jpg?t=1636728963,https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_cc13b34eb6ae424ef0b4c0740da3051856c22674.1920x1080.jpg?t=1636728963,https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_add31b7b248d0f8e3c1340d8c9e08379db868d80.1920x1080.jpg?t=1636728963,https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_e9b1fa69d6d083e5b56eea444d5ac7f1eab13f23.1920x1080.jpg?t=1636728963,https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_79ac79fea986f634bc97918e2094c9f30eac063a.1920x1080.jpg?t=1636728963,https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_3d9bb68958567be666bb89ad9fbaff9107910618.1920x1080.jpg?t=1636728963,https://cdn.akamai.steamstatic.com/steam/apps/1615930/ss_320e603fb51e6aea9f22386236791ffa4a7a9a24.1920x1080.jpg?t=1636728963",
    "Slug": "international-absented-age-squarebound",
    "Meta Title": "[International] Absented Age: Squarebound: Nov 12, 2021, ...",
    "Meta Description": "Looking for information on [International] Absented Age: Squarebound? Check out the release date (Nov 12, 2021), developer insights from terunon's Lab, ...",
    "Alt Text Image": "Official header image for [International] Absented Age: Squarebound game - Steam 1615930",
    "Canonical URL": "https://gusku.site/game/international-absented-age-squarebound",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"[International] Absented Age: Squarebound\", \"description\": \"Looking for information on [International] Absented Age: Squarebound? Check out the release date (Nov 12, 2021), developer insights from terunon's Lab, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"terunon's Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gotcha Gotcha Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1615930/header.jpg?t=1636728963\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}