{
    "AppID": 1933490,
    "Name": "Let's Play! Oink Games",
    "Release date": "Jul 6, 2022",
    "About the game": "Play together! Compatible with up to 8 players online or 4 players offline. (Up to 8 players can play together offline if controllers are shared.) Play with your friends online in real time! If you're a few players short, you can even play with random players or the CPU, too. Play solo! Get matched with random players online or play offline against the CPU. (Not all games support offline solo play) Filled with our most popular games that even newcomers can get excited about. From competitive games to drawing and cooperative games...this compilation has it all! Deep Sea Adventure Winner of the 1st Game Market Grand Prize! A group of adventurers got together on a submarine to try and gather the treasures that sleep at the bottom of the sea. Everyone's all geared up in their diver suits, but riding in a very old submarine means sharing the same oxygen tank. If one of them dives too deep, the other divers' lives will be on the line! Will the adventurers be able to make it back to the submarine safely?! An easy to play board game that's a great place to start for beginners! 2-6 players, Solo play supported, CPU opponents available A fake artist goes to NY Drawing meets social deduction! Everyone is drawing a picture together...but someone doesn't know what they are drawing. There is a fake artist hiding among the real artists - can you find out who it is? However, don't let the fake artist figure out what they are supposed to be drawing. Try not to be suspected as the fake artist, but also be careful not to make it too easy for the fake artist to figure out the drawing! A popular drawing game that can get many people excited quick! 3-8 players, Solo play not supported, CPU opponents unavailable Startups Six companies will change the world! You are one of the investors who saw their potential. Invest like crazy and make some money! Only one investor can earn a profit from each company. You must try to read the movements of your rivals while utilizing your capital and three cards if you hope to become the biggest shareholder! Not only do you have to be lucky in this card game, but you must also analyze your rivals while thinking about your own moves! 2-4 players, Solo play supported, CPU opponents available ※Single system offline play not supported Moon Adventure You are trapped on the moon due to a massive magnetic storm originating from the sun and all of your supplies from earth have been scattered across the surface. You and your fellow astronauts are desperately trying to recover the scattered supplies, all while your oxygen levels are falling. Moon Adventure is a cooperative board game where everyone must work together to complete the mission. Trust in your wits and your friends to make it back alive! 2-5 players, Solo play supported, CPU opponents unavailable Other popular games are included!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1933490/header.jpg?t=1657152055",
    "Price": 24.99,
    "Developers": "Oink Games Inc.",
    "Publishers": "Oink Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1933490/ss_7e4fae18008db035c7a6fc8be19c9ba88ab32c41.1920x1080.jpg?t=1657152055,https://cdn.akamai.steamstatic.com/steam/apps/1933490/ss_7a79472d7dcbb1a50bfc7b8891078eae19081b17.1920x1080.jpg?t=1657152055,https://cdn.akamai.steamstatic.com/steam/apps/1933490/ss_8cb5df6cc8d03e6478124ede24728ad2668c2a9c.1920x1080.jpg?t=1657152055,https://cdn.akamai.steamstatic.com/steam/apps/1933490/ss_8321fa0bd5cd48384511de3dc32f6f14a9e6099f.1920x1080.jpg?t=1657152055,https://cdn.akamai.steamstatic.com/steam/apps/1933490/ss_b3c7c93a52fe4edfae19868c431d859bdd3a2b4e.1920x1080.jpg?t=1657152055,https://cdn.akamai.steamstatic.com/steam/apps/1933490/ss_fd76067942dd806c93c185a2687dbcbcbd0b733a.1920x1080.jpg?t=1657152055",
    "Slug": "let-s-play-oink-games",
    "Meta Title": "Let's Play! Oink Games: Jul 6, 2022, Oink Games Inc. and ...",
    "Meta Description": "Looking for information on Let's Play! Oink Games? Check out the release date (Jul 6, 2022), developer insights from Oink Games Inc., and a complete gam...",
    "Alt Text Image": "Official header image for Let's Play! Oink Games game - Steam 1933490",
    "Canonical URL": "https://gusku.site/game/let-s-play-oink-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Let's Play! Oink Games\", \"description\": \"Looking for information on Let's Play! Oink Games? Check out the release date (Jul 6, 2022), developer insights from Oink Games Inc., and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oink Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oink Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1933490/header.jpg?t=1657152055\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}