{
    "AppID": 1932690,
    "Name": "Liar Moon Shangri-La",
    "Release date": "Jul 21, 2022",
    "About the game": "About the Game '20XX-- The story takes place on the day of a total solar eclipse. A young girl with no family falls into a lake while gazing at the reflection of the pale blue moon reflected in its waters. When she wakes up, she finds herself in Shangri-La, the capital of eternal night. Under the pale blue full moon, the scorned and revolted Calamity Brothers come forward to rescue her from a man who has gone mad. The moon in Shangri-La is quietly shifting from full to full, endlessly. As a result, the inhabitants' spirits are in a state of flux. They believe that the young girl is the one called Liars Moon who can save the world, but ...' Introduction Liars Moon Shangri-La is a visual novel game. Since its release on PSVita in 2017 in Japan, it has been widely acclaimed. The game is a STEAM version ported from the PSVita version, which perfectly recreates the game on PSVita and offer multiple languages including Simplified Chinese and Traditional Chinese to allow more players to experience the game. In this game, players will take on the role of the protagonist Liars Moon, have a tragic story of love and lies with five male protagonists in Shangri-La, the capital of eternal night. The story is based on Norse mythology, revolving around the Calamity Brother, the moon and the gods, and allow the player to choose between lying or not and other choices to gradually learning about this new love myth. In the game, the player will interact with the protagonists and control the plot through different options. There are 5 character routes and a total of 20 endings. This game supports Simplified Chinese, Traditional Chinese and Japanese. How to play the game&amp;Game flow (1)When you enter the game, you will first enter the name input screen. Once completed, the player will become 'Liars Moon' and begin the game experience. As a text-based game, the plot is vivid and the characters' stories are rich in content. As the player clicks and reads, a new Norse mythology story will unfold. (2)The story consists of two parts: the 'Prologue' and the 'Character Selection Branch'. The Prologue describes the journey of the heroine from the real world to Shangri-La, where the five characters will appear one after another and meet the heroine. After reading the Prologue, you will enter the 'Character Selection Branch' section, where you can choose which protagonist will be the next step in the story. (3)In this game, the player controls the story by choosing whether to lie or not and by choosing the other choices. Depending on the choice, the level of favourability gained by the main character will vary. When the level of affection reaches a peak, the heroine will have a happy ending with the hero. Conversely, when the level of affection is too low, the heroine will be headed for a ruinous fate. (4)After all the romance stories with the 5 heroes are over, the Liars Moon section will open and the player can read to learn the story behind the world. (5)After reading through the character route, you will receive a CG artwork, a mini-story, a voice introduction and a memory gallery section according to the ending, so that you can continue to reflect on the various episodes with him. Some of the CGs contain short stories from the character's point of view. The short stories can be viewed from the CG Gallery after you have cleared the character endings. Click on the SS PLAY button to start watching the short story and enjoy the story from the hero's point of view. Characters Fenrir Voiced by Tatsuhisa Suzuki 'He was the eldest of three brothers and was known as the Calamity Brother. He is a member of the Lantern Wolves, which is the security team belong to the city. Although he has a tough and brash attitude, he is essentially a hard-working, gentle man. He has ambitions to change the world because of something that happened in the past. He is often tricked by his younger brothers.' Jorm Voiced by Shimono Hiro 'He was the second of three brothers and was known as the Calamity Brother. His rich expressions make him easy to relate to, so few people guess his age correctly. Although he belongs to the Lantern Wolves, his work and usual attitude is very perfunctory. He is completely unaware of his outbursts and often leaves his brothers feeling helpless.' Hel Voiced by Namikawa Daisuke 'He was the third of the brothers and was known as the Calamity Brother. He has only entered the Lantern Wolves for a short time, but is already appreciated for his cool head and knowledge. The nobles were very fond of his looks, so he established good relations with them despite being an ominous child.' Hati Voiced by Saito Soma 'A noble young man with a gentle nature and a good heart. He did not like to keep up the aristocratic façade, so he spoke and acted no differently from ordinary people. He lost his memory at an early age and lived on the streets, but was fortunate enough to be picked up by Ende and adopted as a foster brother.' Ende Voiced by Sugita Tomokazu 'A powerful nobleman in Shangri-La. Not only did he adopt Hati, who was living on the streets and had lost his memory, but he also had no qualms about keeping in touch with the Calamity Brothers, whom the other nobles feared to avoid. As a result, he was treated as an eccentric by others.' How to advance the story 'The story consists of two parts, a prologue and a character selection branch. Once you have cleared the character route, you can receive CGs, mini-stories, audio introductions and a memory gallery section depending on the ending. There are only 4 character routes available in the first stage, and a fifth character route will be opened once all of them have been cleared. Once the fifth character line has been cleared, the Liars Moon section will open and players will be able to read the story of the world.' How to operate Mouse, keyboard and Xbox controller support Game interface operation Move selected items: up, down, left and right arrow keys/Xbox joystick arrow keys/left joystick Advance dialogue: Down arrow key, Enter button/Xbox joystick B button Cancel: x button/Xbox controller A button Hide/Show dialogue: x button/Xbox controller A button Return to previous page: x button / Xbox controller A key Open menu: W button/Y button on Xbox controller Hide/Show descriptions: W button/Xbox controller Y key Initialize settings: W button/Y button on Xbox controller History: Up/Right/Left/Xbox controller Up/Right Quick Archive: Q button / Xbox controller LT button Quick Archive: P button / Xbox controller RT key Left/right page turn: A button, D button / Xbox controller LB button, RB button Character switch/CG switch: A button, D button/Xbox controller LB button, RB button Auto: A Button, D Button/Xbox Joystick LB Button,RB Button Fast forward: Press and hold the Enter button / Press and hold the B button on the Xbox controller Un-auto, fast forward: stop by pressing the Enter button/Xbox controller stop by pressing the B button Confirm: Enter button/Xbox controller B button Music play: Enter button / Xbox controller B button Animation play/animation stop: Enter button/Xbox controller B button Music stop: S button/Xbox controller X button Play short story: S button/Xbox controller X button Delete (name entry screen): Z button/Xbox controller X button",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1932690/header.jpg?t=1658723361",
    "Price": 33.74,
    "Developers": "Rejet",
    "Publishers": "Beijing Happy Entertainment Technology",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_c0e0a48f661e38b95288a59c70a4cd446467ebab.1920x1080.jpg?t=1658723361,https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_cdee95113d778895bf1a01cba63f027d4d11252e.1920x1080.jpg?t=1658723361,https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_6cb3ef84c6701f069148ae6b1e52c1ec315cec33.1920x1080.jpg?t=1658723361,https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_0d59f88231b8cad4da7f7c0e35bcc217eb34b6a8.1920x1080.jpg?t=1658723361,https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_c3212c27675c64cc7eb5f0aca3aa50e02a58f273.1920x1080.jpg?t=1658723361,https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_65f931e95408b9e323cd7e6877e1305634386fcd.1920x1080.jpg?t=1658723361,https://cdn.akamai.steamstatic.com/steam/apps/1932690/ss_f3f373471ffe83695d0a453275cd96a1c5792b0d.1920x1080.jpg?t=1658723361",
    "Slug": "liar-moon-shangri-la",
    "Meta Title": "Liar Moon Shangri-La: Jul 21, 2022, Rejet and Full Overview",
    "Meta Description": "Looking for information on Liar Moon Shangri-La? Check out the release date (Jul 21, 2022), developer insights from Rejet, and a complete game summary.",
    "Alt Text Image": "Official header image for Liar Moon Shangri-La game - Steam 1932690",
    "Canonical URL": "https://gusku.site/game/liar-moon-shangri-la",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Liar Moon Shangri-La\", \"description\": \"Looking for information on Liar Moon Shangri-La? Check out the release date (Jul 21, 2022), developer insights from Rejet, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rejet\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing Happy Entertainment Technology\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1932690/header.jpg?t=1658723361\", \"offers\": {\"@type\": \"Offer\", \"price\": 33.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}