{
    "AppID": 1297530,
    "Name": "Liar Trick -Psychological Crime Mystery-",
    "Release date": "Jul 30, 2020",
    "About the game": "[Are all your expressions 'real'?] The content of a person's words can be both truthful or false. Similarly, a person's facial expressions can be either genuine or fake. In this new psychological crime mystery game you will unveil 'lies' through emotions! [What type of game is it?] An adventurous visual novel game where you use Facial Expression Analysis Mode, Liar Mode, and Deduction Mode to resolve incidents. [The puzzling mystery story has begun] In this crime mystery game you delve into a realistic world with unique characters and authentic situations to deduct. You will interrogate all suspects to determine anything 'suspicious' about their given testimonies. However, not all of them are guilty. Deduce the meaning of each expression to find the lies and facts of each case. Only then can you reveal the Truth. [For creators] Now, our circle is looking for translators and localization groups. Translation target is 'English or Japanese → Chinese' of this game, Please contact us. ■Game play■ Analysis or Deduction? Each choice you make impacts the outcome. You can play as Patrick Truth, a 'lie catcher' who uses gestures, voice and facial expressions to detect deception! 1. Interrogation Mode There are 2 ways to interrogate your suspects. Solve the case in a way that suits your style! [Detective Focus style] Leave the facial expression analysis to Patrick so that you can focus on determining the authenticity of given testimonies. * Recommended for those who want to experience the game as a movie. [Facial Expression Analysis style] Play an active role in facial expression analysis and Patrick will provide clues for determining the authenticity of given testimonies. * You can also change the difficulty of each style! 2. Liar Mode 'A lie to expose the lie'――. When you suspect a given testimony you can test a suspect's reaction using by telling them provocative lies! The suspect's reactions and facial expressions……will provide clues when deducing!!! 3. Deduction Mode Finally, resolve the case on 'Deduction Mode'! First decipher the real order of events with reasoning. Then……deduce each individual element of the case and expose the Real Culprit!!! 　 Case No.1 [The Detonation Circuit] An explosion occurred in a evidence vault. It caused the death of a female police officer. Patrick (the protagonist) and Aska (his assistant) work together with Detective Orco to get to the bottom of the incident. They first interrogate Hide, a member of the bomb disposal unit and boyfriend of the deceased police officer Prisca Sagrada. Then they come to know of Nobu Cannon, the bomb fanatic who created the bomb responsible for the explosion. Patrick seeks to find the truth of this investigation. Case No.2 [The Disappearing Corpse] Patrick and Aska are summoned once more when a 'severed hand' is discovered in a suburban park. The victim is identified by a DNA test which leads them to Dr Ringfing, wife of the victim and the director of a clinic. They then learn about Hiro who is currently a patient under Dr Ringfing's care as well as her previous stalker. Patrick and Aska are tested as the investigation unravels unexpectedly……. Case No.3 [Fraudulent Existence] As a result of an urgent police search for a fraud group that takes place downtown, three people are eventually arrested. The investigation develops into a murder case when the police find the body of Pieri 'Pierrot' Borgia, the leader of the fraud group. However as a result of being poisoned with LSD, the members Humon 'Hominid' King, Browy 'Eyebrow' Prost and Tuto '2Tall' Amazov all claim they have no memory of the incident. They also come to learn of Tokugawa, the son of victims of the fraud group who was captured by the group after approaching them seeking justice for his parents.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1297530/header.jpg?t=1645669967",
    "Price": 9.99,
    "Developers": "Anabasis",
    "Publishers": "Anabasis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_d7dcb0c43cf0c619e5bd611d5b177decb0596742.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_2e2a0c11c05c786dbc1c4107f0c84c85dc924df9.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_139c57716a9801971c1911ce2081505fe4ba1ea0.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_35c5b5a4a3b6212cfa6a0a0c436e9ae7cb83dadd.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_b5e06209f90615acdae00212721036ff6fcb0082.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_cb57f3e77c1ab0f85186d65fd010b2ae3404eaf3.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_0d316cb5b81e9640cb573b9d838b1985e3d534dd.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_3379fe97da784fef4b90c2c9855f46ba2d5f97d4.1920x1080.jpg?t=1645669967,https://cdn.akamai.steamstatic.com/steam/apps/1297530/ss_556d8e5e5082e2ae75d377637b0e725de73d3c09.1920x1080.jpg?t=1645669967",
    "Slug": "liar-trick-psychological-crime-mystery",
    "Meta Title": "Liar Trick -Psychological Crime Mystery-: Jul 30, 2020, A...",
    "Meta Description": "Looking for information on Liar Trick -Psychological Crime Mystery-? Check out the release date (Jul 30, 2020), developer insights from Anabasis, and a ...",
    "Alt Text Image": "Official header image for Liar Trick -Psychological Crime Mystery- game - Steam 1297530",
    "Canonical URL": "https://gusku.site/game/liar-trick-psychological-crime-mystery",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Liar Trick -Psychological Crime Mystery-\", \"description\": \"Looking for information on Liar Trick -Psychological Crime Mystery-? Check out the release date (Jul 30, 2020), developer insights from Anabasis, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anabasis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Anabasis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1297530/header.jpg?t=1645669967\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}