{
    "AppID": 547340,
    "Name": "LoveKami -Divinity Stage-",
    "Release date": "Dec 15, 2016",
    "About the game": "From the creators of If My Heart Had Wings, comes MoeNovel's exciting new original title, LoveKami, debuting on Steam in English, bringing a fun and energetic tale filled with magic, love and music! Join L☆SEVEN as they aim to be the best Divine Idols in the lively world of Akihabara! In a time when dreams had been forgotten and faith was lost, when people only believed what they could see with their own eyes, one day visions of goddesses appeared... It soon comes to light that the Japanese sun deity, Amaterasu, wished to teach the goddesses about the human world. All of this leads to the implementation of the Divine Education Act. Now, a year has passed and numerous goddesses and humans have had the chance to learn about each other, get to know one another, and come to a mutual understanding. In Akihabara, the very heart of the Divine Idol culture and home to various subcultures, seven lucky goddesses dominate as the idol group L☆SEVEN. Next-Generation Goddess Auditions! Divine Idols, spread your wings and take flight! A glamorous contest, containing everything that goddess’ dreams are made of, is being held! Laugh, grow, and even cry together with goddesses who descended from the sky and are aiming to become top-level idols. The younger sister of Bishamonten, who is a member of the top idol group comprised of the seven lucky goddesses, L☆SEVEN. Shuri has always looked up to her older sister, performing on the streets with the aim to become an idol as well. Bubbly and while seemingly full of confidence, there are times when she ends up comparing herself to her more-successful sister and doesn’t give herself enough credit. She’s down-to-earth and usually hardworking, but can quickly lose interest in things and isn’t afraid to show it. Kisshouten represents prosperity and good luck, along with happiness, beauty, and wealth. She is worshipped in hopes of gaining respect and sometimes in the hope for bountiful harvests. Ame no Uzume is a deity found originally in Shinto mythology. She appears in some of the oldest legends, such as the tale of the missing sun deity, when Amaterasu Omikami hid herself away at Amano-Iwato. She's said to be Japan's oldest performance artist. She works part-time in a Divine Idol-themed cafe while building up her career from the grassroots level. Kagura likes to have fun, but that doesn't mean she's a slacker. Her unique sense of rhythm and expressionism when she dances are both hers alone; no one else can duplicate them. In true ‘Ame no Uzume’ spirit, she usually ends up giving the audience a little more of a risque performance as she easily gets worked up. But there are also times when she relaxes and can stay calm. Her personality is carefree and playful, which easily comes across in how she interacts with others. As one of the more naturally seductive goddesses, she is not opposed to wearing more revealing costumes when she performs. Benzaiten's blessings are plentiful; she is the goddess of music, good fortune, the arts, victory, and even water. She holds the center position in L☆SEVEN. She loves singing, but since she hasn't fallen in love yet, and with the abundance of love songs in the idol music genre, she often becomes doubtful of her ability to sing love songs convincingly. She tends to play acoustic guitar when singing casually. Even though she's always at the center, at heart she's just a regular girl. She can always be found smiling, which matches her cheerful personality. Her manner of speaking is calm and collected, but she sometimes lets her playful side show during conversations. Japanese Animated Novel / Visual Novel HD Three character routes to play through Fully Voiced characters (only the protagonist isn't voiced) Animated Sprites",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/547340/header.jpg?t=1573642394",
    "Price": 12.99,
    "Developers": "MoeNovel",
    "Publishers": "MoeNovel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_a2b0f69f8a627fa3d49d0aef346d847b660e8d6d.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_ab291ad35bf490860fe30d7fc6d9454bfa343769.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_bb689d81ff02362307583a68f5373ff4952950b8.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_cc45e7d2116fc1426d498d277f8e09c8111d5ba8.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_b4690db2d31f0f0e43617b73418288dc103bb0da.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_9f2bc5d7d2b7cc05bcf775923eae8e1eb6702e84.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_fa607da7d42548bbdafb1eefb61ce0d4a2b61ac5.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_bab7d2b9058693e7cbb0b04c29da6b00dbbc5a10.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_d1bab0d629e300f5f566dd7911550576cf9d4bc2.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_d30c18c13faa2018a0d616a71152b5f52a34f5a0.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_3a1b05a05e9ece4c88b9873d4fce74f7858d0049.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_877e1728a0330634ecdb4438beee5feba6f7bf2f.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_ee9f1547beb06d51110e3f3ab4e92db30cdf1afc.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_05d7deb6005a9cd65da4a84df617c80933d35abb.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_5b2da1024767d526168a7f0700e09241966ee3c8.1920x1080.jpg?t=1573642394,https://cdn.akamai.steamstatic.com/steam/apps/547340/ss_5b676bb73b67e88631291327b542ec8db317fed0.1920x1080.jpg?t=1573642394",
    "Slug": "lovekami-divinity-stage",
    "Meta Title": "LoveKami -Divinity Stage-: Dec 15, 2016, MoeNovel and Ful...",
    "Meta Description": "Looking for information on LoveKami -Divinity Stage-? Check out the release date (Dec 15, 2016), developer insights from MoeNovel, and a complete game s...",
    "Alt Text Image": "Official header image for LoveKami -Divinity Stage- game - Steam 547340",
    "Canonical URL": "https://gusku.site/game/lovekami-divinity-stage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LoveKami -Divinity Stage-\", \"description\": \"Looking for information on LoveKami -Divinity Stage-? Check out the release date (Dec 15, 2016), developer insights from MoeNovel, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"MoeNovel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MoeNovel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/547340/header.jpg?t=1573642394\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}