{
    "AppID": 1102190,
    "Name": "Monster Train",
    "Release date": "May 21, 2020",
    "About the game": "Hell has frozen over. Only you can protect the final burning pyre from the forces of heaven and restore the inferno. Monster Train brings a new strategic layer to roguelike deck building, with three vertical play fields to defend. Visit powerful locations To take back hell, you’ll need to power up. Choose your route carefully, different locations give different benefits; upgrade your champion, recruit powerful units, upgrade cards, gain passive bonuses or duplicate any card in your deck. Strategize to fit your playstyle With five clans to choose from, each has its own unique and surprising gameplay. Pick your primary and supporting clan to gain access to all cards from both. During your run you will be able to improve cards by mixing and matching upgrades to open up new roads to victory. You can even duplicate your favourite card at special map nodes before facing off against the final boss. No playthrough is ever the same You’ll never play the same deck twice! Over 220 cards, build up your deck from 10 different starterdecks 5 monster clans with each very different gameplay Each clan has 10 levels to unlock, bringing new cards to your deck Upgrade your clan specific champion multiple times Mod support through Steam Workshop Upgrade any card twice More than 21 unique random events 25 covenant (difficulty) levels Multiplayer HELL RUSH In the Hell Rush multiplayer mode, eight players compete in a frantic real time contest. Each player has the same resources and opponents to create a level playing field. With the clock ticking it’s a test of who can make the best decisions under pressure. Only a true speed demon can remain undefeated. DAILY CHALLENGE Take on a new challenge every day with a hugely modified run due to gameplay mutators. Compete globally and against friends, and climb the leaderboards with a skill-focused scoring system. CUSTOM CHALLENGE Design your own unique challenge and share it with friends. Each custom challenge has its own leaderboard so you can send your friends straight to hell. Content updates FRIENDS &amp; FOES UPDATE The exiled champions have returned to the fold to battle the forces of heaven. This second major update for Monster Train adds new champions, new bosses, new cards, and new artifacts, which combine together to add a significant amount of new strategic options and replayability. We’ve also added a number of frequently requested player features like a personal run records page in the Logbook, an enemy wave counter in battle, and a preview of the ring 3 and ring 6 bosses at the start of a run. WILD MUTATIONS UPDATE This content updates the train tracks with 35 new mutators, new difficulty settings for experienced players and new simple ways to challenge friends and community. HERZAL'S WORKSHOP UPDATE Mod support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1102190/header_alt_assets_5.jpg?t=1656320310",
    "Price": 24.99,
    "Developers": "Shiny Shoe",
    "Publishers": "Good Shepherd Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_edce778e9006c559cc347542ba2a61ed1461c945.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_de1c1453ce68155196cf15143047a615f28aee34.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_622feb3c33c2c6cd07dc8bab01809183e0b9dce0.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_cd1c375e15c677f1d79a5dcd59692f918b19ebde.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_f8d8e271f4e51ec75660cacb70364005c7352ff1.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_e8c89175e27943e0b55b6e6155e23bdb7d2e1247.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_ad7d60d11e761c28bd49ed21ec74c134a82393d9.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_482b7d543a1e5773eb469b4702258b7eb34f2da1.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_13f43b3b31bff7891d899172799dc0dbf3a2c0c7.1920x1080.jpg?t=1656320310,https://cdn.akamai.steamstatic.com/steam/apps/1102190/ss_7375f2956e82fe063ab56ab3c2b478d629887dd2.1920x1080.jpg?t=1656320310",
    "Slug": "monster-train",
    "Meta Title": "Monster Train: May 21, 2020, Shiny Shoe and Full Overview",
    "Meta Description": "Looking for information on Monster Train? Check out the release date (May 21, 2020), developer insights from Shiny Shoe, and a complete game summary.",
    "Alt Text Image": "Official header image for Monster Train game - Steam 1102190",
    "Canonical URL": "https://gusku.site/game/monster-train",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monster Train\", \"description\": \"Looking for information on Monster Train? Check out the release date (May 21, 2020), developer insights from Shiny Shoe, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shiny Shoe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Good Shepherd Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1102190/header_alt_assets_5.jpg?t=1656320310\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}