{
    "AppID": 982520,
    "Name": "Movavi Photo Editor",
    "Release date": "Dec 19, 2018",
    "About the game": "With Movavi Photo Editor , you can easily edit your pictures, create collages and banners, so you could share your photos on social networks. Restore family phots, change the background, and retouch portraits. The smooth new interface will help you edit pictures in a snap. With the help of Al-powered photo enhancement, editing will take no time: the program will improve your pictures automatically. In Photo Editor you will find all popular formats: JPEG, PNG, RAW. Editing Make your pictures brighter, increase color saturation, and sharpen details. Crop and rotate pictures for Instagram and apply any of the colorful filters. Vignettes turn your everyday pictures into retro images. Use the original effects to make a pop art poster and surprise your friends. Mirror photos vertically or horizontally, add text and make collages. Smart Auto Enhancement Don’t waste time editing pictures manually – try the new and improved auto enhancement. Based on neural networks, our smart algorithm will edit your pictures for you in no time. All you need to do is click the mouse. The program will analyze image colors and choose the best settings, so your photos will be saturated and the details will be super-sharp. Background Changes and Object Removal Remove people from one photo and place them in another. Change the background and create a brand new context for the people in the picture: seconds ago, they were on a busy street; now they’re on a tropical island. Erase crowds from background to draw attention for people in the foreground. The program can now identify human silhouettes automatically, so you can remove unwanted objects with ease. Section Selection Now you can remove shadows from faces, sharpen clouds, or make flowers zing with color. The program can focus on improving just one specific area you select – the rest of the picture stays the same. Try the new Selection Tools: Brush, Lasso, Magic Wand, and Rectangular Marquee. Text and Frames Apply new frames and turn your pictures into Polaroids or movie stills. You can change the size, width, color, and transparency of the frame. With the improved text tools, you can turn your photos into postcards and holiday cards with added greetings. The words will align automatically, but you can also twist text captions around.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/982520/header.jpg?t=1646319233",
    "Price": 44.95,
    "Developers": "Movavi Software",
    "Publishers": "Movavi Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/982520/ss_3e6f6e86297b6c7b1363e4492d2d2daf8e1e86e2.1920x1080.jpg?t=1646319233,https://cdn.akamai.steamstatic.com/steam/apps/982520/ss_aa4ac09a444414e25a8572d8ce42fc68094720c6.1920x1080.jpg?t=1646319233,https://cdn.akamai.steamstatic.com/steam/apps/982520/ss_97dcfcb068ea473c68e2d127ae993c101c9f28d8.1920x1080.jpg?t=1646319233,https://cdn.akamai.steamstatic.com/steam/apps/982520/ss_8d0323f3fd37ea3ef31a73531b7ffbc17b0172f1.1920x1080.jpg?t=1646319233,https://cdn.akamai.steamstatic.com/steam/apps/982520/ss_d335e97f5eb46de1b77b5cf39ae1685222332cf5.1920x1080.jpg?t=1646319233",
    "Slug": "movavi-photo-editor",
    "Meta Title": "Movavi Photo Editor: Dec 19, 2018, Movavi Software and Fu...",
    "Meta Description": "Looking for information on Movavi Photo Editor? Check out the release date (Dec 19, 2018), developer insights from Movavi Software, and a complete game ...",
    "Alt Text Image": "Official header image for Movavi Photo Editor game - Steam 982520",
    "Canonical URL": "https://gusku.site/game/movavi-photo-editor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Movavi Photo Editor\", \"description\": \"Looking for information on Movavi Photo Editor? Check out the release date (Dec 19, 2018), developer insights from Movavi Software, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Movavi Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Movavi Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/982520/header.jpg?t=1646319233\", \"offers\": {\"@type\": \"Offer\", \"price\": 44.95, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}