{
    "AppID": 666140,
    "Name": "My Time At Portia",
    "Release date": "Jan 15, 2019",
    "About the game": "Start a new life in the enchanting town of Portia! Restore your Pa's neglected workshop to its former glory by fulfilling commissions, growing crops, raising animals, and befriending the quirky inhabitants of this charming post-apocalyptic land! Armed with your Pa's old handbook and workbench, you must gather, mine and craft your way to being crowned the number one workshop in Portia. Help the locals rebuild the town and uncover the secrets locked deep away beneath it. Be prepared though…it won't be easy! The town of Portia is full of friendly new faces for you to meet. Make friends, complete requests, exchange gifts, go on dates and let romance blossom! Inspired by the magic of Studio Ghibli, My Time at Portia whisks you away to a world of wonder that you won't forget. How will you spend your time at Portia? Key Features: BUILD YOUR WORKSHOP: Build your Pa's derelict workshop into the best in Portia! Gather resources and craft your way into the hearts of the local community, as you work through daily commissions and villager requests. RUN YOUR OWN FARM: Grow and nurture your own crops, raise animals and convert the empty woodland surrounding your workshop into a quaint little farm! My Time at Portia offers an innovative approach to farming, allowing you to take advantage of planter boxes and semi-automatic irrigation systems. You can even take your horse or llama out for a ride around the town! GET CREATIVE: Make your house a home! Apply your personal touch with an exciting range of craftable furniture, decorations and workshop upgrades. Not only will it look great, but each piece will add stat boosts to your character! JOIN THE COMMUNITY: Become a part of Portia's extraordinary community! Filled with a vibrant cast of unforgettable faces all with energetic personalities, daily routines and exciting stories to share. They go to work, have dinner in restaurants, exercise and interact with each other in lots of interesting ways - make sure you take the time to get to know them all! Who knows, maybe romance could be in the air? EXPLORE AND BATTLE: Delve deep into the ancient ruins and dungeons of Portia. Grab your pickaxe and Relic Scanner and mine for resources and treasures from the past. Make sure that you equip a weapon, there’s hordes of fearsome monsters and deadly bosses that stand between you and that precious loot! SKILL UP: Level up your character with a variety of skills to aid you in your adventures. Decide on whether to boost your crafting, combat or social skills depending on your play style. AND THERE’S MORE: My Time at Portia has something for everyone! Find and explore new lands, take part in regular in-game festivals and many other activities it’s up to you how you spend your time. Why not hone your culinary skills and cook up some tasty food? Take on one of the many mini-games? Or perhaps just kick back and spend the afternoon fishing? The choice is yours!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/666140/header.jpg?t=1656057573",
    "Price": 7.49,
    "Developers": "Pathea Games",
    "Publishers": "Team17",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_cb3e189d161602f5b133b8094a1488803254d945.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_22a3dc770222f5356b05b1c4ac838177540a9509.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_3d24ec11c7294f186adf9623303d51f01d23e8db.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_f24aacf56860c7ac2685927d5c7e9b0c808dff4a.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_112335fe9e3e5a7a96a25ca9391879bb56b7a5c8.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_5ee1484b330384accef551044fd6424ea7dbc509.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_3ea86afd386f3ac98bec26e89f7f1a37c36441d1.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_6ba8a3bb1b0274da3da9182c59cbc9e5bd002fbc.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_d9a1832d815e8453a0cba2fce329355521e52331.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_660e506386a6e7ed6362ef1e4f9c6dac47de8307.1920x1080.jpg?t=1656057573,https://cdn.akamai.steamstatic.com/steam/apps/666140/ss_f1eba839308274606fb84374d263c7c4161add35.1920x1080.jpg?t=1656057573",
    "Slug": "my-time-at-portia",
    "Meta Title": "My Time At Portia: Jan 15, 2019, Pathea Games and Full Ov...",
    "Meta Description": "Looking for information on My Time At Portia? Check out the release date (Jan 15, 2019), developer insights from Pathea Games, and a complete game summary.",
    "Alt Text Image": "Official header image for My Time At Portia game - Steam 666140",
    "Canonical URL": "https://gusku.site/game/my-time-at-portia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Time At Portia\", \"description\": \"Looking for information on My Time At Portia? Check out the release date (Jan 15, 2019), developer insights from Pathea Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pathea Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team17\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/666140/header.jpg?t=1656057573\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}