{
    "AppID": 617020,
    "Name": "OMEGA PATTERN - VISUAL NOVEL",
    "Release date": "May 26, 2017",
    "About the game": "GAMEPLAY Omega Pattern is a Visual Novel which offers a variable multiple-choice decision system. This means that both the number of decision points and the number of choices or options that you will find in those decision points may vary according to your previous decisions during the game. SYNOPSIS The world where the Omega Pattern story happens is seemingly normal, similar to the one we live in. However, genetics and fate mean that a few individuals are born with a kind of Pattern or special brain signal which lets them develop unique and varied psychic skills that are determined by their life experiences, which form their behavior and character. From the shadows, an organization known as Bioagora controls the world according to its own interests thanks to the power and influences that they get, in part, from their Agents. These Agents are people who own the Pattern and have been coerced, bought, forced and even captured against their will to be brainwashed and indoctrinated, so they can faithfully serve the Bioagora. Shaiel\u001b (21 years old), a man who possesses the Pattern, has found himself forced to live in secrecy in order to avoid falling into the hands of the Bioagora. However, as time passes, it gets more difficult to escape from a power which is increasing exponentially. Seeking for allies has become a unavoidable, and it seems that the only alternative available are the Celtas ; a small and poorly organized group with unorthodox methods, whose plan to face the Agents and restoring an order different to the Bioagora’s seems near impossible. As the rest of the population stay impassive in a gray world, Shaiel will have Shaiel to play his cards right and find out the truth hidden by the Bioagora, the Celtas and himself. FEATURES Become the Main Character: Decide what to do in the most relevant moments of Shaiel’s past. This will determine his current personality and therefore his psychic abilities and the decisions that you will be able to take in the future. 3 Story Lines: Access to 3 significantly different story lines, which means that you will have a high replay experience where you will find suspense, action, drama, comedy, horror and romance. +6 Hours: The variable multiple-choice decision system that we have implemented for the first part of the visual novel can grant you up to 6 hours of gameplay or more. Mobile Optimized: You will enjoy the same experience both in the Desktop (PC and Mac), Mobile and iPad versions. Full HD: 2048×1536 resolution for iPad users and 1920×1080 for Desktop and Mobile users. Manga Anime Style: 100% original illustrated material. Original Sound Track: An OST that creates the perfect atmosphere in every situation. KEYBOARD AND MOUSE CONTROL Skip Toggle: S. Skip Unread: Ctrl. Cancel/Back/In-game Menu: Escape/Right Click. Confirm: Enter/Space/Left Click. Up/Down/Left/Right on Menus: Arrows. PROJECT This is the first part of the Omega Pattern Visual Novel. To know more about the project, visit the Blog and FAQ section of the Omega Pattern website and follow us on Facebook and Twitter.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/617020/header.jpg?t=1518717466",
    "Price": 4.99,
    "Developers": "Borokai Studio",
    "Publishers": "Borokai Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/617020/ss_8e18f41ca037633ee707109f6495f6c241489679.1920x1080.jpg?t=1518717466,https://cdn.akamai.steamstatic.com/steam/apps/617020/ss_e9c4a1b8de2388eeacb90d7840212ad8eaf15e41.1920x1080.jpg?t=1518717466,https://cdn.akamai.steamstatic.com/steam/apps/617020/ss_a629f962bde65dfeafbe5bb36938f9a054f9eabc.1920x1080.jpg?t=1518717466,https://cdn.akamai.steamstatic.com/steam/apps/617020/ss_d07a3017020f2f6b0f88bfeb494b3a56feffef6a.1920x1080.jpg?t=1518717466,https://cdn.akamai.steamstatic.com/steam/apps/617020/ss_395617d13959392b57a9ec94965e1fc111b115b4.1920x1080.jpg?t=1518717466,https://cdn.akamai.steamstatic.com/steam/apps/617020/ss_ebf0c37ea985c23b335f5db25b7c36c18ff4f37c.1920x1080.jpg?t=1518717466",
    "Slug": "omega-pattern-visual-novel",
    "Meta Title": "OMEGA PATTERN - VISUAL NOVEL: May 26, 2017, Borokai Studi...",
    "Meta Description": "Looking for information on OMEGA PATTERN - VISUAL NOVEL? Check out the release date (May 26, 2017), developer insights from Borokai Studio, and a comple...",
    "Alt Text Image": "Official header image for OMEGA PATTERN - VISUAL NOVEL game - Steam 617020",
    "Canonical URL": "https://gusku.site/game/omega-pattern-visual-novel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"OMEGA PATTERN - VISUAL NOVEL\", \"description\": \"Looking for information on OMEGA PATTERN - VISUAL NOVEL? Check out the release date (May 26, 2017), developer insights from Borokai Studio, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Borokai Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Borokai Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/617020/header.jpg?t=1518717466\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}