{
    "AppID": 1947060,
    "Name": "On the Wings - Birth of a Hero",
    "Release date": "May 29, 2022",
    "About the game": "On the Wings - Birth of a Hero is a Role Playing Game based on an exciting story. During your journey, depending on your choice, Bruce (Brother) or Ursula (Sister) is accompanying you. Fly with them. Fight beside them. Protect them. Feel the excitement and action with them and make them a hero by saving your village and your captive father from Dark Rider. Story Bruce and Ursula are sister and brother living with their mother. They believe that their father has died. Villagers and neighbours help them to survive. But they had many suffering days and cold nights. One day their life starts to change with a Dragon. They found it and rescued. It is a good start for an eternal friendship. Now, it is time to help your people! Kill the legendary monsters, Hunt the animals, Burn the enemy ships, Complete the missions, Defend your village againts invaders and many more... Increase your level and earn gold to adopt bigger and more powerful Dragons! Dragons Ride or Fly with your Dragon! Rise up and Dive with all your speed! Burn your enemies with Dragon Fire. Increase your Dragon's level and make them more powerful and faster. Each Dragon has their own story and flame type. There are 8 different Dragons currently in the game. These are: Black Skin Dragon: Black Skin Dragons love dark corners. They like to live in dark caves and under the shadows of trees. They are entry-level, middle sized dragons and can be find many in forests and mountains. Red Breath Dragon: Red Breath Dragons born in flames. They like daylight and fire. These dragons are always aggressive and mastered on throwing fireballs and using flames against their enemies. Forest Snake Dragon: According to Legend, Forest Snake Dragon is a crossbreed creature occured by copulation of a Cobra and a Dragon. They are very fast, dangerous and living the deep sides of forests. Thunder Cloud Dragon: Angry as Thunders! Powerful like Clouds! These dragons are mastered on flying and have tough, thick skins because of powerful winds on heights. Difficult to train and difficult to kill. Emerald Tooth Dragon: They are rare dazzling dragons and shining like emeralds. They use the Anor flame and aim very well. They have sensitive feelings but are very dangerous under the auspices of a good driver. Golden Wing Dragon: Legendary golden-winged dragons draw their strength from ancient mines. They are very resilient, with rock-hard horns and strong feet. They have high-pitched, thin and frightening voices. Silver Wise Dragon: These dragons can live thousands of years and carry the wisdom of life. They are experienced on fighting and how to survive. A Silver Wise Dragon can teach you many things on battlefield. Dark Night Dragon: It is the fiercest, most dangerous and most powerful dragon known. Usually other dragons are afraid to fight against him. It has never been trained or captured. Warning: If you encounter this dragon, run away. Open World Map Welcome to fertile but wild lands. Sivashills is a giant island surounded with endless waters. There are big unexplored forests, farms, villages and valleys in it. Monsters, animals, people, dragons, sailors are living here. Explore these lands and rule with your Dragon... Day - Night Loop Weather Conditions - Rain, Snow, Thunder, Wind, etc... Dynamic Lights depending on Time Controllers On the Wings - Birth of a Hero is supporting both Keyboard-Mouse combination and GamePad controllers. You can zoom in and out to your character with your Third Person Camera. Singleplayer and Multiplayer - Survival Mode (Coming in Full Version) During the Early Access Stage 1, Single Player mode is only playable. More levels, more dragons (+16 dragons), more missions (+72 missions) and maps are currently in construction and will be launched in the game in Early Access Stage 2. Multiplayer Survival Mode More excitingly, Multiplayer Survival mode will be released and playable in Full version. Select your Dragon! Enter to the Arena, Fly, throw fireballs and burn your rivals with Dragon fire!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1947060/header.jpg?t=1657842280",
    "Price": 3.99,
    "Developers": "Queen Developer",
    "Publishers": "Queen Developer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_9654a31abd59bffc4c3c3b57003b788ef46bab37.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_aa9177a056eca596057a8ffe1024bd74b402aa34.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_86529ff7d1b83d803233f4c97721d126dc8bcc9d.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_49a2daeb5b382c7ff833d74e7f1ede9fe6a05420.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_eb1d64a6fbbb5d70684a2e07e29967bf9c8ce9ae.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_e78208cba508bb5c84ed5bff5eb279a80f2746fc.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_dc395a727a6680c8d3e926d4d776fec1bbd1ca23.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_ae5961b364088c22675782b26bd36108f5171a60.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_0de0dd65650be297ddac45129a96bf60a7211c16.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_76ee8b63768978494233a69e5601fec42843c917.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_d5a94b6923aaab0e1e9b74847ab5d54701ba1223.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_12a37e6aa9c1d5dfe5d049dc4cd31f46e102594b.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_e0fdfab56d24fc60bb9a79aec5bb5f512503b934.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_bf38edb6a5630ffaa7494ebcda2e086b246ca8d9.1920x1080.jpg?t=1657842280,https://cdn.akamai.steamstatic.com/steam/apps/1947060/ss_3613150de5af5bbe4ea778f02abbfd9d5ff2633f.1920x1080.jpg?t=1657842280",
    "Slug": "on-the-wings-birth-of-a-hero",
    "Meta Title": "On the Wings - Birth of a Hero: May 29, 2022, Queen Devel...",
    "Meta Description": "Looking for information on On the Wings - Birth of a Hero? Check out the release date (May 29, 2022), developer insights from Queen Developer, and a com...",
    "Alt Text Image": "Official header image for On the Wings - Birth of a Hero game - Steam 1947060",
    "Canonical URL": "https://gusku.site/game/on-the-wings-birth-of-a-hero",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"On the Wings - Birth of a Hero\", \"description\": \"Looking for information on On the Wings - Birth of a Hero? Check out the release date (May 29, 2022), developer insights from Queen Developer, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Queen Developer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Queen Developer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1947060/header.jpg?t=1657842280\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}