{
    "AppID": 1209450,
    "Name": "Potion Commotion",
    "Release date": "Apr 15, 2020",
    "About the game": "GET READY FOR POTION COMMOTION! THE FUN IDLE CLICKER GAME! The elderly and eccentric Wogglebogg the Wizard has found himself in a financial pickle, and he needs YOUR help to keep his Potion Brewing Business afloat! He requires the assistance of a talented individual (that’s you), to build him a dynamic garden, full of trees, plants, and creatures, each giving unusual ingredients that can be combined to make Potions. Want a Fire Potion? You’ll have to get some Dragon Eggs and Volcano Ice Cream! Require a Strength Potion? You better stock up on Chocolate Camel Milk and Spinach Leaves. The more Potions you help Wogglebogg make, the more coins and elixir you’ll receive, allowing you to further expand and create! But watch out! Sneaky pests will try to steal your hard-earned resources. Scare them away with your cursor, or invest in some fierce Guard’em Gnomes to do it for you. Key Features Idle Gameplay While there’s plenty to do in both the garden and Wogglebogg’s abode, if you ever want to sit back and relax, you’re in luck! Even when you’re taking a break, ingredients will grow, Potions will be made and your garden will progress, ready for you to return and reap the rewards!!! Fun, quirky Characters As well as Wogglebogg, you’ll simply love the many unforgettable friends you meet in Potion Commotion! Such as Sir Loinsteak- the charismatic Knight, Hamrietta- the lazy and sarcastic Pig, Chester the Jester- king of the bad one-liners, and more... 100 Achievements For all you determined achievement hunters out there, this game features a plethora of fun and challenging objectives for you to sink your teeth into! Complete Voice-Over and Original Soundtrack Potion Commotion offers a fantastic audio experience, with an English Voice Cast for all characters in the game, as well as a quality OST, by HMN Music. The City Brand new for 2021, head on down to Eldershire's City Street, bringing a whole host of friendly faces to meet and fresh features to explore, including a Fortune Teller, a Bank, a Potion Upgrades Shop, a Clothing Bouqitue, and more! Play the way you want Choose your own path to Wizardry with thousands of ways to succeed. Each decision can impact greatly on your progress and makes every garden unique to each player. Other Features Offline Progression Co-Op Mode, get a Potion Pal to join the fun NO Micro-transactions Full Controller Support Touch Compatible. Garden Design mode, get the look you want Dank Memes Prestige System Daily Bonuses Hundreds of terrible puns to make you smile A passionate, and committed indie developer. Do NOT miss out on the fun!! Get yourself a copy of Potion Commotion NOW!!!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1209450/header.jpg?t=1641979894",
    "Price": 0.0,
    "Developers": "NerdyBird Studios",
    "Publishers": "NerdyBird Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_e61083127089a5926bbbfca7b14a5fb36c72ac0a.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_3201cda1c3bee055f3786f41d028dbe62b43d2fd.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_0de697a7af3f5235be02885de6df2e963f07216d.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_ae8cfbd4a791f1d2e48a487b2bb114b5c54f1ee3.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_a0c967f535d1495d84ab094bfdd3f38e72df166f.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_e23df95e9a602b4f24b103fd0b4b1df16bcdecc8.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_6d0a7dd6069226cd592e48f4cb8d31c6e15cc5f6.1920x1080.jpg?t=1641979894,https://cdn.akamai.steamstatic.com/steam/apps/1209450/ss_e64a58a39d780ae84015d30370a3d59fa194d0fb.1920x1080.jpg?t=1641979894",
    "Slug": "potion-commotion",
    "Meta Title": "Potion Commotion: Apr 15, 2020, NerdyBird Studios and Ful...",
    "Meta Description": "Looking for information on Potion Commotion? Check out the release date (Apr 15, 2020), developer insights from NerdyBird Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Potion Commotion game - Steam 1209450",
    "Canonical URL": "https://gusku.site/game/potion-commotion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Potion Commotion\", \"description\": \"Looking for information on Potion Commotion? Check out the release date (Apr 15, 2020), developer insights from NerdyBird Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"NerdyBird Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NerdyBird Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1209450/header.jpg?t=1641979894\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}