{
    "AppID": 1307860,
    "Name": "Queerskins: a love story",
    "Release date": "Nov 30, 2020",
    "About the game": "Queerskins: a love story is a 6DoF interactive virtual reality experience. In this Peabody Award winning, emotionally-charged experience, you are seated in the back seat of a photo-realistic 1986 Cadillac, behind Ed and Mary-Helen, Sebastian’s parents, as they take a journey down a country road in rural Missouri. Get to know Sebastian through the drama unfolding in intimate proximity in the front seat as well as by interacting with a collection of Sebastian’s personal belongings including his diary. Was he a “disgrace” like his father says or a “good man” as his mother believes? Prelude In the opening scene, you find yourself in the back seat of a vintage 1986 Cadillac DeVille behind volumetrically rendered Sebastian’s parents Ed (Drew Moore) and Mary-Helen (Hadley Boyd). It is a constrictive, oppressive environment which creates a feeling of helplessness, much like being a child stuck in the backseat of a car. Reach into the box next to you to find some of Sebastian’s belongings. Pick up and examine each object to begin reconstructing his life. Objects in the box change throughout the experience. Memory Space As the sun rises over the horizon, the experience pauses for the first memory space. The time comes to a standstill, but the box, on the seat next to you, comes to life with sounds attached to photographs. Create different soundscapes with photographs from the box. Take a moment to consider these memories and what they mean to you. Sets of photographs that appear in the box are randomized for each play session, replay to experience them all. The Fight As the drive resumes, the emotional drama between the two parents comes to a crescendo. A new set of objects appears in the box. Your own personal history will determine how you relate to the objects and how you imagine Sebastian. Was he a “good man” like his mother believes, or a “disgrace” like his father says? The Diary As you enter the second memory space. The time freezes once more. Pick up the diary that appears in the box, flip through the pages as you listen to Sebastian reading one of the entries. There are seven different entries. These are randomized. Each time you play, you may get a different entry. The Finale As Ed and Mary-Helen arrive at their destination, the sun sets. You begin to realize that life goes on, but, sometimes it does not give you a second chance to tell the people you love goodbye.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1307860/header.jpg?t=1614363338",
    "Price": 6.99,
    "Developers": "Cloudred",
    "Publishers": "Cloudred,Fancy Rainbow Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1307860/ss_32314a9d35eb6cb9ea39de4d9ffce071ac2a790c.1920x1080.jpg?t=1614363338,https://cdn.akamai.steamstatic.com/steam/apps/1307860/ss_086199e02aa961179e0939fd937f852a04aa8261.1920x1080.jpg?t=1614363338,https://cdn.akamai.steamstatic.com/steam/apps/1307860/ss_f4b70d7dedc264d3380b98f41d774cb0b4df3a6f.1920x1080.jpg?t=1614363338,https://cdn.akamai.steamstatic.com/steam/apps/1307860/ss_5fddd03d09b8f7a3bba55f3f17990fbd80becc2b.1920x1080.jpg?t=1614363338,https://cdn.akamai.steamstatic.com/steam/apps/1307860/ss_d211fcdda4b926745c3733505f3ba2834a4674c6.1920x1080.jpg?t=1614363338",
    "Slug": "queerskins-a-love-story",
    "Meta Title": "Queerskins: a love story: Nov 30, 2020, Cloudred and Full...",
    "Meta Description": "Looking for information on Queerskins: a love story? Check out the release date (Nov 30, 2020), developer insights from Cloudred, and a complete game su...",
    "Alt Text Image": "Official header image for Queerskins: a love story game - Steam 1307860",
    "Canonical URL": "https://gusku.site/game/queerskins-a-love-story",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Queerskins: a love story\", \"description\": \"Looking for information on Queerskins: a love story? Check out the release date (Nov 30, 2020), developer insights from Cloudred, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cloudred\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cloudred,Fancy Rainbow Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1307860/header.jpg?t=1614363338\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}