{
    "AppID": 1408710,
    "Name": "Regain Earth: First Strike",
    "Release date": "Apr 28, 2021",
    "About the game": "Regain Earth: First Strike is a third-person Sci-Fi shooter game. Take the tough challenge of surviving waves of increasingly difficult evil MuTecs (mutants &amp; robots)! Grab a friend or two to hunt and slay them all. Crush each wave with help of randomly dropped weapons, gadgets and enhancements . Achieve the top of the leaderboard! Earn rewards to unlock new game features, new maps and a lot of Steam Achievements! This is a Community-driven solo-gamedev project . Help shape the future of this game ! But don't expect the next Call of Duty from me. :-) Stunning action awaits you and your friends in co-operative multiplayer ! No long and boring storytelling, just jump right into the action with your friends and enjoy the entertaining and challenging co-op gameplay! Just having fun! My main goal is to offer my dear players an exciting, entertaining and not too complex shooter game. Just enjoy the fun gameplay . Gameplay Choose a map and try to survive and score as many points as you can, to get your name to the top of the leaderboard. Fight waves of different types of mutants and robots, surviving each and every assault until the last one! Collect scores over time to build up your loadout. Unlock Achievements and unlock new character skins. Also unlock new maps, new boss fights and higher difficulty levels for a never-ending Regain Earth gaming experience. Story 300 years into the future, Earth is lost and YOU are the forefront of soldiers trying to get the upper hand against a very strong, unknown enemy in order to regain the earth. Great Graphics As a self-taught (solo) indie game developer, I can't deliver AAA graphics, but I try to bring best A+ graphics and entertaining gameplay to your screen. Control your avatar, a futuristic soldier, in an awesome third-person perspective with lots of stunning effects that will blow your mind. Game with your friends! You can fight as a lone wolf in Single-player or together with your friends in Multiplayer Co-Op mode to fight for humanity on earth! Achieve new high scores with your teammates and explore new weapons, tactics and weaknesses of your enemies together. Key Features ready - Third-person perspective and shooting action - Co-op Multiplayer or Single-player - Co-op multiplayer features like reviving your teammate - Weapons and gadgets with significant differences by type - Different kind of enemies, some with special abilities - Unlock new character skins , higher difficulty levels and grenade types for your loadout - Build defenses like Turrets to increase your chance of survival - Score system and leaderboard system - Steam Achievements and Statistics - Fun and casual gameplay - Boss Fights Key Features planned - At least 3 maps / levels with own settings, own theme, own leaderboard - More great Boss fights ! - There are tons of more ideas in our Discord server. Just join Discord and vote for your favorite upcoming feature that I should implement into the game next! Join us! Support us! Be aware, this is a Solo-Developer-Indie-Game Regain Earth: First Strike can only be one of the best games if you are involved from the start! Regain Earth: First Strike will be my first indie game and the goal is to develop the next game features with community feedback. It will be impossible for a one-person indie game development project to deliver a co-op multiplayer action shooter game without community feedback. I want to dig deeply with you and the rest of the community to hear your amazing suggestions and feedback. A Discord server is up and running. Join me and the community on Discord and tell us your suggestions and game feedback!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1408710/header.jpg?t=1658515350",
    "Price": 12.99,
    "Developers": "GameFlow Studios",
    "Publishers": "GameFlow Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_7770d298648202d784ed8ba97b88963c4315508d.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_6627646d728d6c4738e28d769465ff68ce461761.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_f61b967b59465f39d49d795b4f2d01c0b50d7f06.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_09c32b63adaea48a6afb8dc32c63c41c3530a6c7.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_0d4a552e6d4adefa0ce72414b577b9bdee338ff2.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_8adec7e81c99d84d0141ad782a244331f54c6b42.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_d60406a5d519c69f7cc2773f1c9ddb148fb93703.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_8f419f6ee2f9b95e4e1292375d47bae5a240d36d.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_48f8b285782417f5e0b603d06c29983665fc1b2b.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_2d82f4583da2d947a3e3272df118111bda46c661.1920x1080.jpg?t=1658515350,https://cdn.akamai.steamstatic.com/steam/apps/1408710/ss_51269e615029032ef07bedda85dcba88ebccd709.1920x1080.jpg?t=1658515350",
    "Slug": "regain-earth-first-strike",
    "Meta Title": "Regain Earth: First Strike: Apr 28, 2021, GameFlow Studio...",
    "Meta Description": "Looking for information on Regain Earth: First Strike? Check out the release date (Apr 28, 2021), developer insights from GameFlow Studios, and a comple...",
    "Alt Text Image": "Official header image for Regain Earth: First Strike game - Steam 1408710",
    "Canonical URL": "https://gusku.site/game/regain-earth-first-strike",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Regain Earth: First Strike\", \"description\": \"Looking for information on Regain Earth: First Strike? Check out the release date (Apr 28, 2021), developer insights from GameFlow Studios, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"GameFlow Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GameFlow Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1408710/header.jpg?t=1658515350\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}