{
    "AppID": 660340,
    "Name": "Robot King Part I: Rebooted and Ready",
    "Release date": "Oct 14, 2017",
    "About the game": "The first in a 3 part series, Robot King follows the journey of a robot on a quest to find his place in a kingdom where everyone seems bent on his destruction. Navigate through 4 unique areas, collecting gold as you go. Customize your robot with 40 possible equipments. But with only 10 equipment slots, various builds will have to be utilized to make it through the harsh terrain and boss levels. Combined with 2 different gameplay modes, Robot King offers a wide variety of options for different player styles. The uniqueness, and challenge, of Robot King lies in 2 key game design aspects: you cannot farm gold, and you can only save, purchase and repair at the shop. The tedium of farming gold is missing from Robot King. There is a finite amount of gold to be had in the game, encouraging full exploration of the map. Your robot starts in the center of the map and can venture out in any direction. But you can only purchase equipment, save, and repair your robot at the center. The further away from the center you travel, the riskier and more dangerous it becomes. This makes planning equipment combinations all the more important. There is nothing stock about Robot King. Everything from the artwork and music to the level design and enemy A.I. is custom built from scratch. It has the look and sound of an old school game but with a modern feel, smooth gameplay, and plenty of variety. Keyboard and Mouse required to play. It will not work with a trackpad. Features: - 40 equipments to customize your robot, providing lots of variety for adapting your robot to the varying terrain and enemies - 2 game modes to match individual play styles: * Pur: Enemies are faster, stronger, and have more health. but stay dead when they die (think of this as hard mode) * Respawn: Enemies respawn, but are weaker, slower, and have less health - 12 unique enemies ready to punish the unprepared - 5 bosses to test your skills and strategy - 4 unique weapons in addition to the basic gun, each one with its own abilities - 4 unique areas, each with their own challenges and obstacles. - 17 Steam achievements - No micro-transactions or in-app purchases. Any DLCs will be free",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/660340/header.jpg?t=1547752069",
    "Price": 0.0,
    "Developers": "Steven Taylor",
    "Publishers": "Steven Taylor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/660340/ss_b01d9fe951977fc50c3a680fd762b0f11a4046f1.1920x1080.jpg?t=1547752069,https://cdn.akamai.steamstatic.com/steam/apps/660340/ss_5b01002e0840e047f32014e326172491d78ef041.1920x1080.jpg?t=1547752069,https://cdn.akamai.steamstatic.com/steam/apps/660340/ss_16183f063aeeb508ea1df5d333358dfd26317ff1.1920x1080.jpg?t=1547752069,https://cdn.akamai.steamstatic.com/steam/apps/660340/ss_5eb950c6c37d78732100d6a6956bf4755963876a.1920x1080.jpg?t=1547752069,https://cdn.akamai.steamstatic.com/steam/apps/660340/ss_8c59a9363b192306a1122a4fc6e35a5d5b0fe706.1920x1080.jpg?t=1547752069",
    "Slug": "robot-king-part-i-rebooted-and-ready",
    "Meta Title": "Robot King Part I: Rebooted and Ready: Oct 14, 2017, Stev...",
    "Meta Description": "Looking for information on Robot King Part I: Rebooted and Ready? Check out the release date (Oct 14, 2017), developer insights from Steven Taylor, and ...",
    "Alt Text Image": "Official header image for Robot King Part I: Rebooted and Ready game - Steam 660340",
    "Canonical URL": "https://gusku.site/game/robot-king-part-i-rebooted-and-ready",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Robot King Part I: Rebooted and Ready\", \"description\": \"Looking for information on Robot King Part I: Rebooted and Ready? Check out the release date (Oct 14, 2017), developer insights from Steven Taylor, and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Steven Taylor\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Steven Taylor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/660340/header.jpg?t=1547752069\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}