{
    "AppID": 562620,
    "Name": "Robonauts",
    "Release date": "Sep 9, 2021",
    "About the game": "The beloved game that was originally released only for the Nintendo Switch console is coming to PC gamers now! Learn the story of Robo and help him save the galaxy, alone or together with family and friends. Welcome interplanetary traveler! In a nutshell, Robonauts is that arcade game which includes 12 levels. Each level will challenge you. You will explore a universe which consists nearly 50 planets, facing Bosses and creatures and meeting powerful opponents bent on universal destruction. Who will you be (literally)? Robo is a little robot whose curiosity got the better of him and led to his sudden exit from the confines of his safe environment. Now little Robo is far from home, fighting for his life against a constant barrage of enemies. When developing Robonauts, we chose to give Robo human traits based on our own emotional experience. Robo acts like you and I, and we sense his emotions when has to choose between sides in a battle, trying to figure out who the good guys are. Once you get to know him, it’s hard not to love Robo. Universe! While the game is very dynamic, you get to choose your tempo of gameplay. A lot of troubles await you on every planet. We have tried to fill Robo’s universe with enough graphically various worlds that everyone who plays can find a unique favorite to which they can return. The graphics in this game are truly spellbinding. And the color scheme makes the game enjoyable for both kids and the kid inside every adult who remembers what it was like to spend a day in the arcade. We really wanted to recreate the experience of the best arcade games from our childhood, so to pass a level, you have to jump between mesmerizing planets and destroy every opponent that stands in your way. Really, there are no words to adequately describe the Robonaut universe. Music - the best for last Game soundtrack composer, Simon Viklund. Yes the same Simon Viklund who worked on PAYDAY series and Bionic Commando Rearmed!!! His music exemplifies the very essence of Robonauts – dynamic, retro, arcade-style, energizing. What Simon has created is not only music for our game, but also the perfect soundtrack to your life - if you're just like us, that is. FEATURES: - great for the whole family, - solo and local co-op - local versus mode - 12 unique planetary systems, - large variety of weapons and enemies, - explosive art style and graphics, - epic music composed by Simon Viklund, - easy-to-learn yet challenging gameplay, - 2 difficulty settings: casual and hard.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/562620/header.jpg?t=1658130725",
    "Price": 3.99,
    "Developers": "QubicGames S.A.",
    "Publishers": "Untold Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_c3c08ca608d3ab6100bd09690ecfc79c97f2d0ab.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_1086eee1c8a870cc985eeb61662830ee657b62c9.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_417206597d38101bec6a920d34cfc219be596945.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_ce75234900b81d30ec4308365f656ed50f2680e0.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_c2f2f8cdd9d5965930bf5cda6c431f43d36eb7b2.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_2e01fd952cd2ffa4ce5af4efe5f15d6874fa97a7.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_0591379906f4294da5c1d2c5aac30717a19d85e4.1920x1080.jpg?t=1658130725,https://cdn.akamai.steamstatic.com/steam/apps/562620/ss_2cc0b450890723825ef8b5cc5421ff72f3a562b9.1920x1080.jpg?t=1658130725",
    "Slug": "robonauts",
    "Meta Title": "Robonauts: Sep 9, 2021, QubicGames S.A. and Full Overview",
    "Meta Description": "Looking for information on Robonauts? Check out the release date (Sep 9, 2021), developer insights from QubicGames S.A., and a complete game summary.",
    "Alt Text Image": "Official header image for Robonauts game - Steam 562620",
    "Canonical URL": "https://gusku.site/game/robonauts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Robonauts\", \"description\": \"Looking for information on Robonauts? Check out the release date (Sep 9, 2021), developer insights from QubicGames S.A., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"QubicGames S.A.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Untold Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/562620/header.jpg?t=1658130725\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}