{
    "AppID": 263860,
    "Name": "SPACECOM",
    "Release date": "Sep 17, 2014",
    "About the game": "SPACECOM – a strategic-to-the-bone, starfleet command game in which deception, smart movement, and choices to battle decide victory or defeat. No coincidence, no luck. Spacecom pushes your ability to strategize with a focus on real-time tactics and planning. Use proven maneuvers learned from military legends or devise your own plans. Test your wits in a single player campaign, go head-to-head with up to 5 opponents in multiplayer or experiment with new strategies in AI skirmish mode. Most of all, you'll need a bright mind, cunning, and sound tactics. When the war begins, leave the little things behind and dive into austere soundscapes as you immerse yourself in starfleet command. From now on, what matters is your grasp of tactics and strategy, not how fast you can click. Spacecom is about creativity in planning, not complexity of game mechanics. Key Features Single player campaign that will test your wit in diverse tactical puzzles Tense multiplayer - dominate up to 5 players per map No coincidence, no luck. What matters is good planning and successful execution Sound designed specifically to trigger strategic thinking Minimalistic visual design inspired by military technology Created to exalt smart thinking over fast clicking Previews 'In a market currently dominated by MOBAs, SPACECOM is set to offer a more nich perspective on strategy. Focused on concise combat roles and managing supply routes, it's all about using limited resources, to outwit your friends.' - GameTrailers.com 'What really strikes me is that all of this is presented in an incredibly minimalistic style.(...) There is none of the distraction of flashy visual effects or incredibly renderedenvironments, this is pure strategy.(...) For me, an advocate of game mechanics above all else, this is as close to pure space strategy as I’ve seen and I’m really looking forward to the finished product.' - gaminglives.com 'Spacecom is an interesting idea, as a quick-play strategy game. In a genre that tends to frighten off newcomers, Spacecom is poised to be the title that welcomes them in with open arms, avoiding complexity while still offering that classic 4X feeling. ' - Criticallysane.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/263860/header.jpg?t=1634818309",
    "Price": 1.99,
    "Developers": "Flow Combine",
    "Publishers": "11 bit studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/263860/ss_635c45820de566bb6f6abafa22bb03cfcfd7943f.1920x1080.jpg?t=1634818309,https://cdn.akamai.steamstatic.com/steam/apps/263860/ss_ac46d6109967caab9146cb7d37592851618a527c.1920x1080.jpg?t=1634818309,https://cdn.akamai.steamstatic.com/steam/apps/263860/ss_d3545b30d77c929f0d1a394c1b9ba819158b88b5.1920x1080.jpg?t=1634818309,https://cdn.akamai.steamstatic.com/steam/apps/263860/ss_f7910b7592277c1b688366662b4a7c50344618cd.1920x1080.jpg?t=1634818309,https://cdn.akamai.steamstatic.com/steam/apps/263860/ss_f4a938ed7a2e4da4ce74e6f62849e8d677b82f12.1920x1080.jpg?t=1634818309,https://cdn.akamai.steamstatic.com/steam/apps/263860/ss_d2249f1ab46fabc67bea37b743196ff0bcc72d2d.1920x1080.jpg?t=1634818309",
    "Slug": "spacecom",
    "Meta Title": "SPACECOM: Sep 17, 2014, Flow Combine and Full Overview",
    "Meta Description": "Looking for information on SPACECOM? Check out the release date (Sep 17, 2014), developer insights from Flow Combine, and a complete game summary.",
    "Alt Text Image": "Official header image for SPACECOM game - Steam 263860",
    "Canonical URL": "https://gusku.site/game/spacecom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SPACECOM\", \"description\": \"Looking for information on SPACECOM? Check out the release date (Sep 17, 2014), developer insights from Flow Combine, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flow Combine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"11 bit studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/263860/header.jpg?t=1634818309\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}