{
    "AppID": 1373830,
    "Name": "SPL: Skilled Pilots Live",
    "Release date": "Dec 1, 2020",
    "About the game": "Hi, Paweł here - Me Vs. Game - the one man studio! SPL: 'Skilled Pilots Live ' can be described best as space+doom+looter+souls . Sounds interesting ? Join us on Discord! SPL is in active development and frequently updated with new content. The game is constantly improving, but it's identity and gameplay are firmly established. SPL delivers and will continue deliver Unique experience but fun and accessible . Difficulty is in the eye of the beholder . You can choose between easier or tougher fights or playstyles. Highly re-playable . Respects your time . Each playthrough is short enough for one evening and long enough to be satisfying. Action packed , but has non-combat content to chill between fights. Tough but fair . You can feel the impact of your mistakes, but the game gives you means to recover. Loot, loot and more loot . The updates are frequent , the game keeps growing and improving. Short, intensive, replayable game loop Rogue-lite with plenty of tools to help you stay alive. Death can be punishing but is not final, you can quickly get back on your feet. Three chapters - each ending with a challenging boss fight, each takes approximately 30 minutes. You can quicken the arrival of the boss by picking tougher fights. Your ship is fast, agile, can dash, use warp drive in combat to jump or perform glory-kills. Your weapons are super deadly and so are the are enemies. Staying Alive Death in SPL is quick and easy, but there are plenty of ways to stay alive, many of them very souls-like: Ships have a passive, indestructible front shield lowered when a ship takes action. If the shield deflects, the reactor heat goes up, what, in longer perspective, can lead to the overheat and a few seconds of shutdown. Bullets can be dodged, by dashing and barrel rolling in any direction. Any incoming projectiles can be countered (parried) by a shield overload. Be careful — inaccurate counter timing can lead to the overheat! Ships can hunker down — rise the full, 360 degree shield — making them impervious to all damage, but slowly heating up the reactor. Get back your lost health (structure) by blasting your way through the enemy defenses and wrecking their ship hulls. You can raise the full shield and become imprevious to all damage and releases a kinetic blast that knocks back enemies. Winning a Fight So you can defend well, how about winning a fight ? Ship main guns never run out of ammo. Instead, the reactor heat goes up bringing you closer to the overheat shutdown. Shooting is about positioning and good timing, not placing the reticle at the perfect spot. You have the same aim assist system as the AI enemies. However, there is still plenty of space for agency and human error. The AI also knows how to defend, but can be beaten in a dogfight, by flanking, right timing, or sometimes with a good, old bullet storm. Very high DPS means a lot of healing, even over your limit. All ships yours including have very effective life stealing abilities. Defeated enemies get staggered and be glory killed for more over-healing and more momentum. Loot Random items drop with random tier, weak enemies will likely drop Damaged equipment, bosses can drop Legendaries. The higher the tier of the equipment the more bonuses it gets. You can equip up to 4 weapons and 3 ship upgrades at the given time. 7 weapon variants, 9 weapon types giving 63 unique weapon combinations, each drops with random modifiers. Proper looter-shooter experience of infinite variations of items. Your equipment is destroyed on death but you can expand your subspace stash to save loot if you get shot down. More powerful enemies drop higher level loot. Weapons with higher level deal more damage, ship upgrades with higher level provide damage resistance. You are equipped with fabricator to dismantle or combine excess items. Wingman You can use your loot to spawn wingman, the better items the more powerful they get. Story The Mind Eater draws all the sentient life towards itself. It devoured the ancient Natives, and now it knows of us, too. Your resistance to Its call, however brief, is our glimmer of hope. Tutorials A well tested, polished set of four tutorial missions that will introduce you to the details of the game unique mechanics. Three ship status bars are displayed: Heat – most of the actions generate heat. If you overheat the ship, it will take a few seconds to reboot the reactor! Armour — regenerates if you reactor is cool (at 0% heat). Structure — living metal that runs inside your ship, as well as inside the hulls of enemies. If you hit enemy directly, the liquid structure ejects from their ship and can be collected to repair your vessel. Enemies can heal in the same way! Flight Remember, there is no speed limit in the space — after the acceleration you will maintain your current speed until deceleration or hitting an object. Ships warp reactor allows you to accelerate freely in six directions, without changing the ship orientation, and with full freedom of motion. Feel free to strafe sideways or fly backwards, regardless of your camera orientation. The jump drive provide a quick acceleration to thousands of kilometers per second with the freedom of flight path within the space. The ship will automatically abort the jump after you reach an obstacle. You can also use jump drive to outrun your own bullets! Enjoy the open space and fly anywhere you want — the game will always come with surprises and give you challenges on the way. And last small tip – when the situation gets though, don’t feel dishonored by escaping any encounter or combat. Just jump away, heal up and get back into the fight!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1373830/header.jpg?t=1619723296",
    "Price": 14.99,
    "Developers": "Me Vs Game",
    "Publishers": "Me Vs Game",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_975c86f0aa13dac47b10324685cc51d4933bfed1.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_2bcd77dd4420419e1a7bf5f550a131c8bce57ccb.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_7fbb78af7f36636e01ea092ef51cfc9f743a2517.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_850576b47930236aab5eb40520eaab6d061063eb.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_dacb91f6a918a2a9405cd860b96dab6c3849e01c.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_3145c255ca574101abb84faa23932ad3efda0ed0.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_141be61ea2e6fe339367acc15d77c31f4a96a082.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_0104516f3706594521cf4d308fcbc60f4d9a1538.1920x1080.jpg?t=1619723296,https://cdn.akamai.steamstatic.com/steam/apps/1373830/ss_7c4179135b3640e4a558a68c2f32c93ca02ce584.1920x1080.jpg?t=1619723296",
    "Slug": "spl-skilled-pilots-live",
    "Meta Title": "SPL: Skilled Pilots Live: Dec 1, 2020, Me Vs Game and Ful...",
    "Meta Description": "Looking for information on SPL: Skilled Pilots Live? Check out the release date (Dec 1, 2020), developer insights from Me Vs Game, and a complete game s...",
    "Alt Text Image": "Official header image for SPL: Skilled Pilots Live game - Steam 1373830",
    "Canonical URL": "https://gusku.site/game/spl-skilled-pilots-live",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SPL: Skilled Pilots Live\", \"description\": \"Looking for information on SPL: Skilled Pilots Live? Check out the release date (Dec 1, 2020), developer insights from Me Vs Game, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Me Vs Game\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Me Vs Game\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1373830/header.jpg?t=1619723296\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}