{
    "AppID": 774791,
    "Name": "Surgeon Simulator 2",
    "Release date": "Sep 2, 2021",
    "About the game": "Bob’s life is in your hand! It’s time to slip into your scrubs and grab the nearest scalpel (saw or sink plunger), and enter the Bossa Labs Medical Facility in this 1-4 player physics based operating theatre of chaos. Take on the cream of the medical establishment in riotous competitive challenges. Play frantically blood splattered coop games or go solo in Surgeon Simulator 2’s rib-tickling Campaign Mode. Wanting to inject some creativity? Jump into the Creation Mode and build brand new game levels on your own or team up to build something amazing with multiplayer creation tools. From head transplants and leg amputations, to dancing games and relay races, at Bossa Labs, you choose your own way to play! Plunge into frenzied Competitive Mode games and lock horns, or scalpels, in free-for-all arcade and arena style levels played with friends or other players online. Go up against up to three of the best the medical world has to offer in quick-fire challenges that will amaze, surprise and test you to the very limit. In Story Mode you can play solo or with friends and pull together as a team to perform operations, opening ribcages, choosing transplant organs, making sure Bob doesn’t bleed out - it’s a barrage of botch jobs which will test every element of your surgical skills, teamwork and creativity. As the pressure to keep the patient alive mounts, you must work like a well oiled machine, choosing to help, or hinder, the life-saving efforts in this unique and pandemonium pumped party game. Reveal the truth behind the mysterious medical facility in Campaign Mode with a plot crafted by award winning writer Rhianna Pratchett which has more twists than Bob’s intestines. Jump in as a solo sawbones or play with friends: the truth is out there! Nothing is ever straight-forward including head transplants - who would have known? The Bossa Labs Medical Facility is as much a character in this game as your fellow surgeons and seems to be totally trying to sabotage your surgical career with its labyrinthine corridors, devious puzzles and tricky traps. From space stations to discos, bowling alleys to carnivals, your fellow surgeons have been creating some incredible and unlikely scenarios for surgical procedures - and they are all yours to play in with more levels and games being created all the time! Jump in and let the adventure begin! And if the player made levels inspire you then why not unleash the full force of your creativity with a super-intuitive creative Creation Mode sandbox which comes fully loaded with Surgeon Simulator 2. We’ve given you the tools that were used to make the game including props, textures and building materials to work with. And if that wasn’t enough you can build along with friends to create awesome new levels and challenges to play and share with the Surgeon Simulator 2 community.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/774791/header.jpg?t=1649066904",
    "Price": 19.99,
    "Developers": "Bossa Studios",
    "Publishers": "Bossa Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_1ea21691638d05a50d6a7ba6175da8debba3de00.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_1f53927ba64a332ff8fa7031b6f98a9f409ba020.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_a99c1854f84987435b119ad2ea80592ba9e90ad4.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_7602a23c6620912d8d69bed9145569f8c45761d2.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_014ba4c6e25ce6850e6943abd406e379248ada62.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_e0d7c8272e62eccd735d6d682fcee262432e824b.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_0c10474364ec3ada16048b6faec23c744c9d47e3.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_3f6dfa59b6d1b30c927f83ba627f71fb525703e2.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_d8f2595b9fa79ed04ab6f945d2bde1945600892c.1920x1080.jpg?t=1649066904,https://cdn.akamai.steamstatic.com/steam/apps/774791/ss_e015509ce66b2a88ac88d5bb25521c2c6d84be23.1920x1080.jpg?t=1649066904",
    "Slug": "surgeon-simulator-2",
    "Meta Title": "Surgeon Simulator 2: Sep 2, 2021, Bossa Studios and Full ...",
    "Meta Description": "Looking for information on Surgeon Simulator 2? Check out the release date (Sep 2, 2021), developer insights from Bossa Studios, and a complete game sum...",
    "Alt Text Image": "Official header image for Surgeon Simulator 2 game - Steam 774791",
    "Canonical URL": "https://gusku.site/game/surgeon-simulator-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Surgeon Simulator 2\", \"description\": \"Looking for information on Surgeon Simulator 2? Check out the release date (Sep 2, 2021), developer insights from Bossa Studios, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bossa Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bossa Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/774791/header.jpg?t=1649066904\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}