{
    "AppID": 464920,
    "Name": "Surviving Mars",
    "Release date": "Mar 15, 2018",
    "About the game": "Colonize Mars and discover her secrets, with minimal casualties. Welcome Home! The time has come to stake your claim on the Red Planet and build the first functioning human colonies on Mars! All you need are supplies, oxygen, decades of training, experience with sandstorms, and a can-do attitude to discover the purpose of those weird black cubes that appeared out of nowhere. With a bit of sprucing up, this place is going to be awesome! Surviving Mars is a sci-fi city builder all about colonizing Mars and surviving the process. Choose a space agency for resources and financial support before determining a location for your colony. Build domes and infrastructure, research new possibilities and utilize drones to unlock more elaborate ways to shape and expand your settlement. Cultivate your own food, mine minerals or just relax by the bar after a hard day’s work. Most important of all, though, is keeping your colonists alive. Not an easy task on a strange new planet. There will be challenges to overcome. Execute your strategy and improve your colony’s chances of survival while unlocking the mysteries of this alien world. Are you ready? Mars is waiting for you. Main Features: Building on a planet not fit for human life challenges you to build a smart, functional colony. Bad planning isn’t about traffic jams, it’s about survival of your colonists. You really don’t want rolling blackouts in a city constructed in a place without oxygen. Each colonist is a unique individual with problems and strengths that influence the needs and behavior of the other colonists. Things can get really interesting if your chief scientists develops alcoholism after one too many long nights in the lab. Retro-futuristic super structures housing colonists, factories and commercial buildings with their own “neighborhood personality.” Create colonies that value science over everything else, while tired workers drink their pay away at a local bar, or attempt a utopia among the stars. Inspired by the classic sci-fi of Asimov and Clarke, Surviving Mars holds many secrets. During each playthrough players may encounter one of Mars’ individually crafted mysteries. Uncovering these secrets might bring your colony great fortune, or terrible ruin. What is that sphere that manifested itself outside colony HUB B, and is it friendly? Combine static and random research through experimentation, which allows for a different experience for each journey through the game. Attain new scientific breakthroughs by exploring the uncharted terrain of Mars's surface. A sleek, modern take on the bright futurism of the 1960s. A time of exploration and adventure. Craft your own fantastic buildings, parks or even a mystery to share through Surviving Mars’s extensive and convenient modding tools. Share your finest creations with the community to build the perfect society.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/464920/header.jpg?t=1651168053",
    "Price": 29.99,
    "Developers": "Haemimont Games,Abstraction",
    "Publishers": "Paradox Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_44ac0358c939aad3facac813fc4482d77b912937.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_dd0e3554085e1f1247fd18bd1004c7dd988cbe21.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_c3cd8c398159d95073b9362800b1a32030164531.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_34d8bde9174165dbc33e4ca93ae6c2217d00a72b.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_898bdeefe8e13fd984d6a51648d9277a1b5cfe35.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_704652725921dc704f2060eb7301f02073c57fba.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_b17c2a863810729994c08240717b4bb2c987a9dc.1920x1080.jpg?t=1651168053,https://cdn.akamai.steamstatic.com/steam/apps/464920/ss_c9f84ab43984b42a0b123e31a3ff5c67883026e9.1920x1080.jpg?t=1651168053",
    "Slug": "surviving-mars",
    "Meta Title": "Surviving Mars: Mar 15, 2018, Haemimont Games,Abstraction...",
    "Meta Description": "Looking for information on Surviving Mars? Check out the release date (Mar 15, 2018), developer insights from Haemimont Games,Abstraction, and a complet...",
    "Alt Text Image": "Official header image for Surviving Mars game - Steam 464920",
    "Canonical URL": "https://gusku.site/game/surviving-mars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Surviving Mars\", \"description\": \"Looking for information on Surviving Mars? Check out the release date (Mar 15, 2018), developer insights from Haemimont Games,Abstraction, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Haemimont Games,Abstraction\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Paradox Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/464920/header.jpg?t=1651168053\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}