{
    "AppID": 376210,
    "Name": "The Isle",
    "Release date": "Dec 1, 2015",
    "About the game": "The Isle: A World Designed to Kill You The Isle is intended to be a gritty, open-world survival horror game. Explore vast landscapes of dense forest and open plains, traverse treacherous mountains and wade through dark swamps where horrors lurk. Hidden within are ruins that hold insight as to what came before. Through it all, keep in mind there is only one goal: survive. There is little in the way of hand holding or ulterior precepts to alter play styles or purpose. It's kill or be killed. In the end, the only one you can trust is yourself. Over the course of development the islands and their inhabitants will radically change, ever-evolving as players themselves learn how to flourish and thrive. Your mistakes will be punished. Expect no survivors. Massive Prehistoric Multiplayer Become the beast within. When joining The Isle, you can play as one of dozens of unique creatures, from tiny darting herbivores like Dryosaurus to blood-thirsty giants such as T. Rex or Allosaurus (with many more still to come!) As a dinosaur, you'll be the epitome of majestic, cunning and ferocious. Use your natural abilities and senses to stay off the menu and grow into a stronger, more capable creature. Engage with a living prehistoric ecosystem as you become either predator or prey on servers featuring up to 100+ players, all of them as hungry and dangerous as you. Form packs/herds, create nests, defend your offspring, hunt, and claim territory. A single mistake can spell your demise. Survival or Sandbox? The Isle's core game mode is Survival, a tense and difficult experience where you need to grow fast or die young. Dinosaurs in Survival mode progress through several life stages, starting out small and vulnerable. Use your scent ability, night vision and wits to survive long enough to grow, becoming more powerful and unlock new abilities such as nesting. Because of the time needed to develop a full character life cycle, not every creature is or will be playable in Survival, though more will be added in future updates. However, sometimes you don't want to struggle to survive, or you don't have the time to go through a dinosaur's whole life story. And that's okay. For players who want a less intense experience, Sandbox mode lets you play an expanded roster of dinosaurs (and soon humans!). You can jump right in as an adult super predator or a peaceful giant, with no major penalties or consequences from dying. We won't judge. A Global Community Story The Isle features a narrative told strictly through the environment, achievable only through immense cooperation among players. Are you stranded? Can you just leave? What is AE? How did the dinosaurs get here? What is the distant call that pierces the night? It will take the entire community to answer these mysteries and unravel the purpose to their being on The Isle, and each discovery will directly affect the future of the game's storyline. Future Development Goals We realize that there is a long road ahead, and a lot of work to be done to turn this into the game we want it to be. Throughout development, we will be adding a lot more to The Isle and incorporating user feedback in how we evolve the experience. Some of our planned features include: Playable aquatic and aerial creatures Even more playable dinosaurs with complete life cycles Two new playable factions: modern humans &amp; the indigenous Evolve into advanced 'strain' versions of certain dinosaurs Realistic dinosaur AI that uses complex behaviours Additional world biome types such as thick jungles Dynamic aerial drop-in spawn system Global in-game world quest Localization of all in-game menus &amp; text Better accessibility &amp; customization options Steam Achievements, Trading Cards, Emotes Mod support using Steam Workshop All that and more are on our radar going forward. We started with a plan of just a mere handful of playable carnivores, but based on player demand we expanded our scope, increased that number greatly and introduced herbivorous dinosaurs as well. Listening to our community has been instrumental in guiding our process and helped to correct our mistakes, and we hope that together we can transform The Isle into the ultimate dinosaur game. --AE Core TX Received-- --End Promotional Protocol-- --SiGnaL InTeRrUpt-- -tHEeNdISnevErTheENDisNeVeRtHeEnDIsNev -",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/376210/header.jpg?t=1653237914",
    "Price": 19.99,
    "Developers": "Afterthought LLC",
    "Publishers": "Afterthought LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_6cd28dd53eafdc554e5ce34f8a16dcc5b98108a1.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_8d63cb38072130b757b20c230b0c8acb5277c111.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_afcf388e9e0db1392670fa01d935a9f81967be3c.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_24b6c83804afa270e658ef5b234f4b6edd6bef07.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_868033a862fd428cce7fbd476fd0cc8e3b747ae8.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_621af6de335a68d0fc50c89154b31664cd682646.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_adc8573f459c7db0720079504ee65049f74302dd.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_86a537b7ec72eda17fe2c32e51c11512623dfee9.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_33d76fde3b16046a457f75b0813572a7e948a10b.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_37fc8f90654e67ea2130dd82282a9439319493ae.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_12ee4ee37c7d8d2026bb84ef1f7ba5002917a945.1920x1080.jpg?t=1653237914,https://cdn.akamai.steamstatic.com/steam/apps/376210/ss_b2b27b7017219659be182fbe486cfbb073b67e4a.1920x1080.jpg?t=1653237914",
    "Slug": "the-isle",
    "Meta Title": "The Isle: Dec 1, 2015, Afterthought LLC and Full Overview",
    "Meta Description": "Looking for information on The Isle? Check out the release date (Dec 1, 2015), developer insights from Afterthought LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for The Isle game - Steam 376210",
    "Canonical URL": "https://gusku.site/game/the-isle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Isle\", \"description\": \"Looking for information on The Isle? Check out the release date (Dec 1, 2015), developer insights from Afterthought LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Afterthought LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Afterthought LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/376210/header.jpg?t=1653237914\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}