{
    "AppID": 1103130,
    "Name": "Trials of Guinevere",
    "Release date": "Dec 31, 2019",
    "About the game": "Inspired by many classic fantasy RPGs of the past, Trials of Guinevere combines strategic, turn-based combat with the emotional, character-focused story of a visual novel. The heroes will grow and mature as the game progresses, and each will play an important role in its resolution. Trials of Guinevere explores many themes, such as the origins of personal strength, loyalty and betrayal, the meaning of sacrifice, and redemption. Storyline Guinevere is a regal city-state, located in the center of the continent, Vitaria. Home to over six million citizens, Guinevere is known for its proud people and kindhearted rulers. Commerce is at an all time high, and Guinevere is famed for its fishermen, craftsmen, and Arcanist enchanters. However, Guinevere's fate wasn't always so bright. Eighteen years ago, a dangerous conqueror, known as the Warlord, sought to claim the city for himself. He planted spies and soldiers everywhere, in attempts to sow chaos and destruction. As a final blow, he managed to fatally poison the king, Leorus III. However, two heroes were chosen before the King passed: a young Frostbringer named Uriel, and his girlfriend, a Brawler, Lowangen. Together with a master of metaphysics, Kei, and a priest of Llymayn, Vhaldir, the heroes stopped the Warlord's forces and saved their home from destruction. Because of their actions, Guinevere has enjoyed almost two decades of peace. Now, a new threat emerges from within the city, and it just might be a reminder of the events of Guinevere's past... Combat Trials of Guinevere 's combat is turn-based and continuous, with mechanics that are easy to grasp, yet enjoyable to master. The combat of ToG focuses on the classes of its characters. The people of Vitaria that show proficiency in magic are known as mages, while those that have trained in melee or ranged combat are known as fighters. These two categories form the basis for many classes, and all have unique spells and/or abilities in battle. The Alchemist is a mage that excels in stacking powerful poisons upon his foes, while the Templar is a fighter that defends her allies in battle through prayers to her Goddess. There are no 'useless useful spells' in the game, and it will be up to you to use each spell and ability effectively. Status effects play an important role in turning the tide of battle. Is there an enemy Priestess in the backline, protected from your fighter? You can silence her, stopping her magic for a few rounds. A powerful Barbarian that deals great damage to your frontliners can be feared, giving you a chance to defeat him before he recovers. Each character has their own strengths, weaknesses, and immunities. Character strength is measured in Power Levels, and each comes with two abilities or spells, and possible upgrades to existing ones. There are multiple aspects that enhance combat, from Free Actions, limited use spells, Concentration, and powerful items and salves. Characters Lane Conway Lane is a young student of Guinevere's Academy of Magic. Bored with the monotonous routine of school life, he yearns to explore the world beyond the Academy's walls. Lane is very lighthearted, and while he doesn't excel in his studies, he is skilled in the practical side of magic. Lane has been an orphan since his childhood, raised in Guinevere's Peoples' District. Amber Aveyonde Lane's classmate and best friend, Amber is almost a polar opposite, compared to him. She takes her studies very seriously, and is intrigued by the Eldyrians. While Lane spends time with friends, Amber is studying. She is very knowledgeable in Ancient Eldyr, the language of the incredibly powerful Ancient Eldyrian Spells. Morgan DesCallier Morgan is a kindhearted girl that can't remember much of her childhood. She was born in what she believes is a castle, so her biggest hope is that she is a princess. She believes that once she has found her family, and her calling, she can help many people. Morgan is very optimistic in her views of the world, but she lacks confidence in herself. Teo Northmere Like his friends, Teo is a second year student at the Academy of Magic. Teo and Morgan met on the first day of their classes, and they've been great friends ever since. Teo is from a small town in Cor Anara, the harsh desert country to the south, and he hopes the Academy can teach him to master his talents before he returns home. Features Over fourteen hours of gameplay, with much more possible through talking to NPCs, learning about the world, and completing sidequests. There are no random encounters or grinding in Trials of Guinevere , and leveling up happens at set points in the story. There is an in-game glossary that explains the game's mechanics, has unlockable character biographies, and contains the lore of Vitaria's countries and magic. In addition to over twenty optional conversations that build the characters' relationships, the Chat feature provides a reminder of what to do next in order to continue the story. Trials of Guinevere features four difficulty levels, allowing you to customize combat to your liking. Enemies are intelligent with their abilities and spells, and will focus on an armoured hero with offensive magic, protect a wounded teammate, or try to silence your mages. Optional bosses are present as well, with each granting powerful bonuses or items if you manage to vanquish them. The Storyteller mode trivializes combat, allowing you to solely focus on the storyline, if you so wish. The ending of the game changes, based on the choices you make. Characters' fates will be decided, and even a subtle decision or choice of words could have dramatic results later. Only two of the main characters are guaranteed to survive to the end. Trials of Guinevere utilizes cloud saves, and has forty Steam achievements. One such achievement is the perfect ending, which represents the true, canon ending of the game. Will you be able to unlock it? An emphasis has been placed on world-building and the setting of Vitaria. You'll learn about the ancient civilization of the Eldyrians, the relations Guinevere has with its neighboring lands, the hierarchy of the Gods, and more. Controls There is an in-game configuration tool for you to customize the controls as you wish, but here are the defaults- Z to confirm X to go back Arrow keys to move the characters or cursor Shift to toggle running or walking F2 displays the FPS counter F4 toggles fullscreen mode F5 resets the game Alt F4 quits the game --- Trials of Guinevere does contain some flashing colours and images, which may affect players with photosensitive epilepsy or other sensitivities.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1103130/header.jpg?t=1657298667",
    "Price": 8.99,
    "Developers": "TD Games",
    "Publishers": "TD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_b0fa35883b051f28c85ddabe0ec76c41f58bbdbb.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_c18922a8b24a5c858c8fbe311ffb9239eeb3b6dc.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_478b305953518fb5989d94f3b725be8250d62bb6.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_10c028c4448eec72754178e886ba1759e3f5d860.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_4bfa0aef2b42f2046b1527c12896116c570e8f7a.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_a57bda2bac9460c52c39940d2df20ff7a13972ab.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_c6cf4404e02aa6cfffd6c1304cc503e721fdd66e.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_074b3b016423e61e5591c458ed4b1524bdc039d8.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_04407a73b35e3a7fc7a6f2c02438e044cd43748e.1920x1080.jpg?t=1657298667,https://cdn.akamai.steamstatic.com/steam/apps/1103130/ss_db8104f2e3f7cae78d99ad1b4b3162f9645176a1.1920x1080.jpg?t=1657298667",
    "Slug": "trials-of-guinevere",
    "Meta Title": "Trials of Guinevere: Dec 31, 2019, TD Games and Full Over...",
    "Meta Description": "Looking for information on Trials of Guinevere? Check out the release date (Dec 31, 2019), developer insights from TD Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Trials of Guinevere game - Steam 1103130",
    "Canonical URL": "https://gusku.site/game/trials-of-guinevere",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trials of Guinevere\", \"description\": \"Looking for information on Trials of Guinevere? Check out the release date (Dec 31, 2019), developer insights from TD Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"TD Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1103130/header.jpg?t=1657298667\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}