{
    "AppID": 393190,
    "Name": "TSIOQUE",
    "Release date": "Nov 7, 2018",
    "About the game": "TSIOQUE (pronounced: 'chiock') is a dark but playful Point &amp; Click adventure, hand-animated in meticulous, frame-by-frame 2D. Escape the clutches of an Evil Wizard and discover the secrets hidden within the spellbound castle of your ancestors. We take the role of princess Tsioque, imprisoned in a castle overtaken by the Evil Wizard. When darkness falls on your ancestral home, places formerly familiar suddenly turn unfriendly and dangerous. The castle walls have become a deadly trap - we must escape and thwart the Evil Wizard's plans before the spell he has cast on the castle escalates, triggering events beyond anyone's control... A 100% hand-drawn, frame-by-frame animated 2d adventure game with a unique atmosphere. Humor? Check. Darkness? Check. Suspense? Check! What more could you ask for? Story with a twist - a clever story that may surprise you. Beautiful, hand-drawn backgrounds. Beautiful, hand-drawn backgrounds. Fully voiced dialogue tracks. Exceptional soundtrack by Edward Harrison (NEOTOKYO, LUCKY DAY FOREVER) and Elle Kharitou, dynamically illustrating the gameplay and adjusted to your every action. The protagonist - a little girl with a talent for bringing chaos and destruction wherever she goes. Those who dare stand in her way are in for a lot of trouble... A changing, mysterious and dangerous world - even before the Wizard's attack, the castle held many secrets. Now, bound by a powerful spell, the castle not only became home to demons and magical creatures, but has also been affected itself by the evil power... It bends and shapeshifts, forming layers upon layers of transformation and illusion... It is an essential part of the plot, and - especially later in the game - an element tightly integrated into the gameplay. You can 'die' in this game! - It's an adventure game, so explore, solve puzzles... but beware. There won't always have the comfort of infinite time to solve a problem, sometimes you may have to think fast! Other times you may want to think twice before choosing a new course of action, as a wrong decision may cost you your freedom... or worse! The world of TSIOQUE is inhabited by creatures of all sorts - humans, animals, monsters, you name it. Don't let appearances deceive you, some seemingly nice people may not necessarily have the best intentions, and a seemingly terrifying monster may not be all that evil. Fortunately, even when events turn for the worst, Tsioque can always count on help from her friends, which she will find in least expected places. The main inspiration is inarguably LIFE, which always writes the best scritps. But of course we're not living in cultural vaccuum. While creating TSIOQUE, we couldn't help but be inspired by things that thrilled, shocked and amazed us in the past, that burned forever into our memory in the childhood days spent in front of the pale light of CRT monitors. Among many other inspirations, we could certainly count: a smart, humorous story backed by beautiful art style of DAY OF THE TENTACLE, simplicity of the gameplay and a serious approach to a younger player in games by Ron Gilbert like PAJAMA SAM, a vivid, dangerous world seen through the eyes of a boy in HEART OF DARKNESS, wonderfully animated epic fantasy and its gruesome punishments for failures in DRAGON'S LAIR, or INDIANA JONES AND THE FATE OF ATLANTIS, an old Lucasarts classic with a perfect blend of adventure, humor and action, where carelessness could cost you dearly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/393190/header.jpg?t=1602836324",
    "Price": 13.99,
    "Developers": "OhNoo Studio,Smile",
    "Publishers": "OhNoo Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_ab233bbbf7a9fb97f46775562016b88d1bc2082a.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_6b4c6e92e7b5bdfc65d1cb63afcd18960a257936.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_e4be77b60551b43f10065824a1b507ec4319bc1b.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_6c9a4f2994e6a333e1066dba08f61a331f5875b5.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_97125ed793e9555339ba1bba184677ccc84cbb88.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_6428968b50ad4d5e59ea3055f3e7b25dee018b2b.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_2e9b26136d80b0f45d7f4439a6f01db363475cf9.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_45b99245252119966a18ba513b8dc337287fe021.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_8f4821d3cd49064384aec4db2f85cbb41ecb889e.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_bb0724bd931378ae3dfb47817a4d25cd4cbc5901.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_d2e8c7108c3c51bf8fc97e4d0eddc82de2d88841.1920x1080.jpg?t=1602836324,https://cdn.akamai.steamstatic.com/steam/apps/393190/ss_32f1891a6e44229186c3064093becb3556a6b2a2.1920x1080.jpg?t=1602836324",
    "Slug": "tsioque",
    "Meta Title": "TSIOQUE: Nov 7, 2018, OhNoo Studio,Smile and Full Overview",
    "Meta Description": "Looking for information on TSIOQUE? Check out the release date (Nov 7, 2018), developer insights from OhNoo Studio,Smile, and a complete game summary.",
    "Alt Text Image": "Official header image for TSIOQUE game - Steam 393190",
    "Canonical URL": "https://gusku.site/game/tsioque",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TSIOQUE\", \"description\": \"Looking for information on TSIOQUE? Check out the release date (Nov 7, 2018), developer insights from OhNoo Studio,Smile, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"OhNoo Studio,Smile\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OhNoo Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/393190/header.jpg?t=1602836324\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}