{
    "AppID": 334920,
    "Name": "Zero-K",
    "Release date": "Apr 27, 2018",
    "About the game": "Commander wanted! Construct giant robots, build an army of a thousand Fleas. Move mountains if needed. Bury the enemy at all cost! Traditional real time strategy with physically simulated units and projectiles. 100+ varied units with abilities including terrain manipulation, cloaking and jumpjets. 70+ mission galaxy-spanning campaign to be enjoyed solo or co-op with friends. Challenging, (non-cheating) skirmish AI and survival mode. Multiplayer 1v1 - 16v16, FFA, coop. ladders, replays, spectators and tournaments. PlanetWars - A multiplayer online campaign planned to start in May. Really free, no paid advantages, no unfair multiplayer. Fully Utilized Physics Simulated unit and projectile physics is used to a level rarely found in a strategy game. Use small nimble units to dodge slow moving projectiles. Hide behind hills that block weapon fire, line of sight and radar. Toss units across the map with gravity guns. Transport a battleship to a hilltop - for greater views and gun range. Manipulate the Terrain The terrain itself is an ever-changing part of the battlefield. Wreck the battlefield with craters that bog down enemy tanks. Dig canals to bring your navy inland for a submarine-in-a-desert strike. Build ramps, bridges, entire fortress if you wish. Burn your portrait into continental crust using the planetary energy chisel. Singleplayer Campaign and Challenging AI Enjoy many hours of single player and coop fun with our campaign, wide selection of non-cheating AIs and a survival mode against an alien horde. Explore the galaxy and discover technologies in our singleplayer campaign. Face a challenging AI that is neither brain-dead nor a clairvoyant cheater. Have some coop fun with friends, surviving waves of chicken-monsters. Cloaking? Resurrection? Tough choices customizing your commander. Casual and Competitive Multiplayer Zero-K was built for multiplayer from the start, this is where you can end up being hooked for a decade. Enjoying epic scale combat? Join our 16v16 team battles! Looking for a common goal? Fight AIs or waves of chicken-monsters. Prefer dancing on a razor's edge? Play 1v1 in ladder and tournaments. Comebacks, betrayals, emotions always running high in FFA. Want to fight for a bigger cause? Join PlanetWars, a competitive online campaign with web-game strategic elements, diplomacy and backstabbing (currently on hiatus pending an overhaul). Power to the People We are RTS players at heart, we work for nobody. We gave ourselves the tools we always wanted to have in a game. Do what you want. No limits to camera, queue or level of control. Paint a shape, any shape, and units will move to assume your formation. Construction priorities let your builders work more efficiently. Don't want to be tied down managing every unit movement? Order units to smartly kite, strafe or zig zag bullets. Plenty of Stuff to Explore (and Explode) Zero-K is a long term project and it shows, millions hours of proper multiplayer testing and dozens of people contributing ever expanding content. Learn to use all of our 100+ units and play on hundreds of maps. Invent the next mad team-tactics to shock enemies and make allies laugh. Combine cloaking, teleports, shields, jumpjets, EMP, napalm, gravity guns, black hole launchers, mind control and self-replication. Tiny flea swarm that clings to walls? Jumping 'cans' with steam-spike? Buoys that hide under water to ambush ships? Mechs that spew fire and enjoy being tossed from air transports? Carrier with cute helicopters? Jumping Jugglenaut with dual wielding gravity guns? Meet them in Zero-K!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/334920/header.jpg?t=1653942942",
    "Price": 0.0,
    "Developers": "Zero-K Team",
    "Publishers": "Zero-K Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_bf0b6af92f58682185a461b9ed85e35622513392.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_24eb34e9fbc9b3d19b56a1bc9751b25602eaca08.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_3cd5d734eb75d8ae1ee4474595d37a7c03791023.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_e7cc427e68207fe2cd7fc1632a7472db0cea53b3.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_b6132edfaa675f06333401bf99d5286c479807c7.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_b3dfc213fce02f4d342bbda10ddee277f8126b73.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_04182d0253b83633730ae304376b3a2a49f2801e.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_dfed76df7e1abc3700ccf321e35647b5f85dbbdb.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_00f49edaa89acaf20b8f95b9e6e6a349eba53ed5.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_c67cc04b7d8bd7bab130b47dcd355f874c02dc6c.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_29b41c5756899809098e5f247afcd60d07fa986a.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_dab778c392322278394fbef0c6400910bfb89840.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_390702621a3ecadeda1d6dc4bc03112db3d00893.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_867ee1f27de25726561c8e8dd73a699b2cd06b55.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_7e08a8af72e5c883c4ca3d1b71adb1edf486536f.1920x1080.jpg?t=1653942942,https://cdn.akamai.steamstatic.com/steam/apps/334920/ss_5a1a669fa0fc11b510ae5e6a56a7e50aabf1d900.1920x1080.jpg?t=1653942942",
    "Slug": "zero-k",
    "Meta Title": "Zero-K: Apr 27, 2018, Zero-K Team and Full Overview",
    "Meta Description": "Looking for information on Zero-K? Check out the release date (Apr 27, 2018), developer insights from Zero-K Team, and a complete game summary.",
    "Alt Text Image": "Official header image for Zero-K game - Steam 334920",
    "Canonical URL": "https://gusku.site/game/zero-k",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zero-K\", \"description\": \"Looking for information on Zero-K? Check out the release date (Apr 27, 2018), developer insights from Zero-K Team, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zero-K Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zero-K Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/334920/header.jpg?t=1653942942\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}