{
    "AppID": 970910,
    "Name": "1001 Jigsaw. World Tour: Great America",
    "Release date": "Jan 21, 2019",
    "About the game": "1001 Jigsaw. World Tour: Great America is an exciting puzzle game and a fantastic opportunity to feel the true American spirit. Assemble jigsaws from a multitude of pieces and learn the history, traditions and attractions of the United States of America in 500 high-quality photos. Now you can play your favorite puzzle game and travel your favorite country at the same time, all without leaving the house! For more exciting and comfortable gameplay, we've provided a bunch of opportunities! Set a difficulty for each puzzle to suit you – choose the number of jigsaw pieces, their angle and the turn function! Save your progress at any time and come back to assembling your saved jigsaws whenever you want! Simple controls and a bunch of hints and tools make the game more comfortable. With configuration options like this, the game is accessible both to new players and true professionals in the puzzle game genre. An exciting immersion into the world of America awaits you, with the world-famous skyscrapers of New York and Chicago, the sunny beaches and Hollywood boulevard of California, the echoes of the Gold Rush and the era of gangsters, the inimitable Texas and the never-sleeping Las Vegas. American football and golf, outstanding fashion and lifestyles, the movie industry, symbols of the nation, colleges and school festivals… This is a unique opportunity to become a true American by playing 1001 Jigsaw. World Tour: Great America. 1001 Jigsaw. World Tour: Great America is a game and a source for inspiration. 500 high-quality photographs of famous attractions, fashion, film, traditions, holidays, lifestyle, national symbols, cuisine, sport… A truly unique country! And you can start your American transformation right now! - 500 high quality unique images - Well designed game-play: useful hints, sort tool and magnifying glass. - Optional game difficulty control makes your gameplay infinite - Custom styles of pieces with rotation - Save game progress and continue to collect the puzzle at any time - Tasks and colorful trophies for those who love excitement - Pleasant and relaxing music - Get 500 puzzles for one purchase. It is beneficial!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/970910/header.jpg?t=1548087692",
    "Price": 0.49,
    "Developers": "Creobit",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/970910/ss_5f1e9913d6ec746cb3a4aeb72dbf947c28fcad48.1920x1080.jpg?t=1548087692,https://cdn.akamai.steamstatic.com/steam/apps/970910/ss_cfced99b9cd3bb4f7042eebedcd83cae5e182cf3.1920x1080.jpg?t=1548087692,https://cdn.akamai.steamstatic.com/steam/apps/970910/ss_fa2d0496646613cf8ba14f32d76a8f5f6b9bfa80.1920x1080.jpg?t=1548087692,https://cdn.akamai.steamstatic.com/steam/apps/970910/ss_43fcad4a73a4496c5749faac0eb2ef6e55b02e72.1920x1080.jpg?t=1548087692,https://cdn.akamai.steamstatic.com/steam/apps/970910/ss_dc766d50db4de466553049377d70b2c03366c329.1920x1080.jpg?t=1548087692",
    "Slug": "1001-jigsaw-world-tour-great-america",
    "Meta Title": "1001 Jigsaw. World Tour: Great America: Jan 21, 2019, Cre...",
    "Meta Description": "Looking for information on 1001 Jigsaw. World Tour: Great America? Check out the release date (Jan 21, 2019), developer insights from Creobit, and a com...",
    "Alt Text Image": "Official header image for 1001 Jigsaw. World Tour: Great America game - Steam 970910",
    "Canonical URL": "https://gusku.site/game/1001-jigsaw-world-tour-great-america",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"1001 Jigsaw. World Tour: Great America\", \"description\": \"Looking for information on 1001 Jigsaw. World Tour: Great America? Check out the release date (Jan 21, 2019), developer insights from Creobit, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/970910/header.jpg?t=1548087692\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}