{
    "AppID": 449730,
    "Name": "Ahnayro: The Dream World",
    "Release date": "Dec 1, 2016",
    "About the game": "50 (challenging) puzzles to explore Deep Alternate Reality Game Immersive audio narrative Explore the twisted and troubling world of Ahnayro, where your dreams are haunted by mysterious figures. From the creators of The Black Watchmen and the team behind The Secret World Alternate Reality Games comes Ahnayro, a narrative-driven immersive puzzle game which draws you into the dream world and surrounds you within an ethereal reality. Digging deep into fascinating historical events, mysterious figures and bizarre subjects Researching the hidden connections that lie beneath the surface Exploring immersive, transmedia narratives Advancing beyond the typical gaming experience Meandering into unexplored and little understood areas of the human experience Immersing yourself in strange, terrifying, and beautiful worlds Negotiating the boundaries of what is real and what could be real Gathering real-world facts and information to guide your way You are gifted with the ability to look beyond the veil of reality, investigating a universe that opens up to you every night, haunting you, beckoning you to solve the mysteries within. The life of the dreamer is in your hands, yet neither you nor she are in control of this magical world; you are at the mercy of mysterious entities flowing in and out of the darkness. Her only hope of salvation is to understand the symbolism of her fragmented visions and confront the evil that plagues her mind. As in any dream, however, this new reality draws from the waking world, and understanding one necessitates understanding the other. Discover the meaning of this obscured reality, unlocked only at night. Discover Ahnayro. The dream world reveals itself in fragments. It is up to you to piece together information and discover the hidden meaning behind them. Through a series of research and logic-based puzzles that challenge your knowledge of real-world historical events, figures, art and mythology, you will slowly uncover the identities of those who haunt the dream world. Explore the troubled life of the dreamer by day, and uncover the effects of her dark visions through a transmedia storytelling experience deeply rooted in Alternate Reality Game mechanics. Investigate a remote sleep clinic, their mysterious methods and the hidden world of oneironautic research. Delve into the twisted logic of dreams through an engaging narrative integrated within the puzzles themselves. Ethereal visual style, captivating narration and atmospheric original soundtrack from the composer of The Black Watchmen usher you into the unique world of Ahnayro. Employ your knowledge of the real world—historical figures and events, science, established mythology, etc.—or seek it out on the web to discover the meaning behind the dreams. Multilayered transmedia storytelling including fake websites, audio messages and bizarre videos hidden across the web",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/449730/header.jpg?t=1578595450",
    "Price": 4.99,
    "Developers": "Alice & Smith",
    "Publishers": "Alice & Smith",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_da9add5790cadbdfa45a657546d45a6bc280c7de.1920x1080.jpg?t=1578595450,https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_b5fc4bbc683f32b3ce2c3a3b495fd6d5d97340ce.1920x1080.jpg?t=1578595450,https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_785849142f3f96243b2232da764c7383f233506f.1920x1080.jpg?t=1578595450,https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_04752465cf968de3218a6d8fd3d860c12f14bdef.1920x1080.jpg?t=1578595450,https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_24b9cf65077f477bfdb13b3ab0b3ca2ba27118fc.1920x1080.jpg?t=1578595450,https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_6c3d9815dc5469f5b925540bcfa6d9b5ec23a8eb.1920x1080.jpg?t=1578595450,https://cdn.akamai.steamstatic.com/steam/apps/449730/ss_e5f3a037fa632eb8fbb9a76178f3a325b05903fe.1920x1080.jpg?t=1578595450",
    "Slug": "ahnayro-the-dream-world",
    "Meta Title": "Ahnayro: The Dream World: Dec 1, 2016, Alice & Smith and ...",
    "Meta Description": "Looking for information on Ahnayro: The Dream World? Check out the release date (Dec 1, 2016), developer insights from Alice & Smith, and a complete gam...",
    "Alt Text Image": "Official header image for Ahnayro: The Dream World game - Steam 449730",
    "Canonical URL": "https://gusku.site/game/ahnayro-the-dream-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ahnayro: The Dream World\", \"description\": \"Looking for information on Ahnayro: The Dream World? Check out the release date (Dec 1, 2016), developer insights from Alice & Smith, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alice & Smith\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alice & Smith\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/449730/header.jpg?t=1578595450\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}