{
    "AppID": 1960170,
    "Name": "ALUMNI - Escape Room Adventure",
    "Release date": "Jul 8, 2022",
    "About the game": "Trapped in a past time - can you use your puzzle solving skills and escape? Working long hours on your recent research with experimental time-shifting serums at Ridgeway Space/Time Labs has taken its toll. You promise yourself a break after the next batch of results. Taking a moment after hours of painstaking research you drowsily make yourself a refreshing coffee, moments later some drops of the serum accidentally fall into your mug. Feeling unsettled you notice your mistake. It’s too late! You realise you are now set to experience the time-shifting properties first hand. After a few moments your world distorts and reality changes, you are transported back in time to your fragmented memories back at Ridgeway College. Everything is familiar but broken in some way. Now trapped in past memories, it is up to you to solve the puzzles and escape the nightmare reality you have created for yourself, attempting to return to present times. ABOUT Alumni is a first person 3d escape room puzzle adventure, similar to games you may have played in the ’90’s or similar to a virtual escape rooms you may have played. An indoor immersive world that you explore and an inventory where you can collect and use items you find along the way to solve puzzles and escape the rooms. Play as a scientist transported back in time to memories of college fighting to escape the nightmare reality. Explore areas and take in your surroundings. Use all of your puzzle solving skills to make your way through the college and return back to the present. How you tackle the puzzles is down to you. Each puzzle has a logical solution, so take your time, there is no rush and enjoy the process of understanding what you have to do. FEATURES • Explore an immersive 3D environment, solving puzzles and collecting items • Use the inventory to collect and use objects • Beautiful all original adventure 3D graphics, environments and atmosphere to explore • Immersive backing soundtrack and effects to pull you into the adventure • Full save system with load slots, manage all controls and sound levels to your preference. CONTROLS: Movement: WASD + Mouse Inventory: I Menu: ESC HINTS &amp; TIPS If you need a hint or clue while playing Alumni then please reach out over email or social media (contact links can be found on my website) and I will be more than happy to help you. SMALL PRINT Alumni was created from the imagination of a solo indie developer. “I am always excited to hear people playing my games and their experience along the way. Adventure gaming is my passion and your feedback helps my games get better.“ Alumni is compatible with most modern PC's and has been designed to be as resource efficient as possible to allow play on many different devices. With that said, if you do run into any difficulties please email so I can provide updates that help everyone enjoy the adventure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1960170/header.jpg?t=1657271915",
    "Price": 8.99,
    "Developers": "M9 Games",
    "Publishers": "M9 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_9aaad9ac5ce77e5b1c2a93aa4bc3a4bebfc66a5f.1920x1080.jpg?t=1657271915,https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_ff9e6272f3c1da3fda3276c952e1804fc8afea52.1920x1080.jpg?t=1657271915,https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_eb9269e3627a373b8c9cb706b8d14d1df61d8780.1920x1080.jpg?t=1657271915,https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_c5b6c77d808f0006d5bee7f75f8128fbbdd0a0ef.1920x1080.jpg?t=1657271915,https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_22a3c86f2d2a120574d07b33682938a3887fc0c4.1920x1080.jpg?t=1657271915,https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_f74ff9d1a187e4a0ca99f8974668636616968cce.1920x1080.jpg?t=1657271915,https://cdn.akamai.steamstatic.com/steam/apps/1960170/ss_c0011909c01b84f56306c0b46972fcbc9d7d4cb7.1920x1080.jpg?t=1657271915",
    "Slug": "alumni-escape-room-adventure",
    "Meta Title": "ALUMNI - Escape Room Adventure: Jul 8, 2022, M9 Games and...",
    "Meta Description": "Looking for information on ALUMNI - Escape Room Adventure? Check out the release date (Jul 8, 2022), developer insights from M9 Games, and a complete ga...",
    "Alt Text Image": "Official header image for ALUMNI - Escape Room Adventure game - Steam 1960170",
    "Canonical URL": "https://gusku.site/game/alumni-escape-room-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ALUMNI - Escape Room Adventure\", \"description\": \"Looking for information on ALUMNI - Escape Room Adventure? Check out the release date (Jul 8, 2022), developer insights from M9 Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1960170/header.jpg?t=1657271915\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}