{
    "AppID": 1078350,
    "Name": "Ambrosia",
    "Release date": "Jan 29, 2021",
    "About the game": "Flode is an apprentice priestess who dutifully serves the God of Light, Leight. Her life is peaceful until one day, she gets swept up in a scandal involving the family of the local duke. The church officials decide it's better to send her away until the fuss cools down. She then makes her way to the remote island of Cerbes, where she's tasked with managing the old shrine and spreading the word of Leight. While things seem difficult at first, Flode's earnest attitude soon wins over the hearts of the local populace, and she even manages to befriend a monster woman! However, things take a dark turn when her new friend is captured, and to free her, she must find the legendary treasures spread across the island. Things seem hopeless, but it just so happens that the shrine Flode is living in was built on holy ground belonging to the old god of the island, Noir, who's willing to lend her a hand. Will Flode succeed in her quest and stay true to her faith, or will she become a follower of Noir? Take control of Flode as she journeys across the island of Cerbes and attempts to unearth the ancient relics hidden there! This is an open-ended adventure, meaning you can tackle dungeons in any order you'd like, though marching into the hardest ones first might be ill-advised... Speak with the denizens of the island, gather clues on where to go, take on quests, and spread the faith of Leight! Of course, all that costs money, and a start-up shrine won't be exactly flush with cash. Luckily, Flode can take on an assortment of quests around the island. Seek out the extra quests to help you with your adventure! Open World Adventure As long as you learn where the different dungeons and towns are located, you can go wherever you please! Lots of Quests Take on quests for the island-dwellers, whether they involve apprehending the local bandit gang or finding an extremely rare, aged cheese for a local food connoisseur.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1078350/header.jpg?t=1657289345",
    "Price": 14.99,
    "Developers": "Shimobashira Workshop",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1078350/ss_77877e98be68284411a86d00cec8c0df24ff7757.1920x1080.jpg?t=1657289345,https://cdn.akamai.steamstatic.com/steam/apps/1078350/ss_64ce569ab53094c1db040aef8465590083dbad20.1920x1080.jpg?t=1657289345,https://cdn.akamai.steamstatic.com/steam/apps/1078350/ss_2c370b56022e4b75980d74a1f7b9274520daeb2d.1920x1080.jpg?t=1657289345,https://cdn.akamai.steamstatic.com/steam/apps/1078350/ss_76aa6687fece71f79c5c5bed00d8558109595888.1920x1080.jpg?t=1657289345,https://cdn.akamai.steamstatic.com/steam/apps/1078350/ss_7ed5d5f20ab485ff92cdeb94c69f90cc1ddfef1b.1920x1080.jpg?t=1657289345",
    "Slug": "ambrosia",
    "Meta Title": "Ambrosia: Jan 29, 2021, Shimobashira Workshop and Full Ov...",
    "Meta Description": "Looking for information on Ambrosia? Check out the release date (Jan 29, 2021), developer insights from Shimobashira Workshop, and a complete game summary.",
    "Alt Text Image": "Official header image for Ambrosia game - Steam 1078350",
    "Canonical URL": "https://gusku.site/game/ambrosia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ambrosia\", \"description\": \"Looking for information on Ambrosia? Check out the release date (Jan 29, 2021), developer insights from Shimobashira Workshop, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shimobashira Workshop\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1078350/header.jpg?t=1657289345\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}