{
    "AppID": 1495350,
    "Name": "AVROD",
    "Release date": "Jan 5, 2021",
    "About the game": "AVROD is the Archaeological Virtual Reality Online Database. We are a pioneering VR platform dedicated to digitizing and sharing the world's archaeological and cultural heritage sites for study and exploration. Our mission is to enhance the way people learn about history and archaeology through fully immersive virtual reality technologies. The AVROD Beta platform will be FREE to download for the HTC Vive through app stores. The AVROD Beta showcases 40 real-world, photorealistic locations for users to explore face-to-face from our growing site list! Users can share their ideas and experiences with AVROD Community members by creating on-site AVROD posts. Get out and virtually experience the world cultural heritage sites and archaeological locations that you have always dreamed of seeing through AVROD! Choose from any of these AVROD locations to explore: 1. Apollo 11 — United States 2. Apollo Fountain, Versailles — France 3. Arc de Triomphe — France 4. Big Head (Olmec Colossal Statue) — Mexico 5. Bridge House — England 6. Castlerigg Stone Circle — England 7. Cave of Hands — Argenitina 8. Cela - Ruins of a Nun’s Cell — Portugal 9. Chapel of Our Lady on the Bridge — England 10. Cluny Museum Chapel — France 11. Flora Fountain, Versailles — France 12. Fountain of the Observatory — France 13. Korean Gate, Acclimatization Garden — France 14. Little Lightnings Panel — Australia 15. Maya Relief (K’inich Ahkal) — Mexico 16. Minewatcher’s Post Woolwich — England 17. Monk Bretton Priory, Gatehouse — England 18. Obelisk — Egypt 19. The Oval Office — United States 20. Palatki Grotto Panels — United States 21. Palenque Ruin Maya Relief — Mexico 22. Reproduction of the Cave of Horses (7000-4500 Years Old) — Spain 23. Robert Gaskin Wreck — Canada 24. Room at Skara Brae — Scotland 25. Stompie Tank — England 26. T391-T392-T397-T398 — Italy 27. Teotihuacan Mexico — Mexico 28. The Armory — Sweden 29. The Charterhouse Great Chamber — England 30. The Charterhouse Norfolk Cloister — England 31. The Great Drawing Room — Sweden 32. The Parade Armor and Shield of King Erik XIV — Sweden 33. The Upper Vestibule — Sweden 34. Tholos of Delphi — Greece 35. Torii Gate at Kinosaki — Japan 36. Ushakothi Panel — India 37. Xunantunich East Frieze — Belize 38. Yaxchilan Lintel 14 — Mexico 39. Zaraa Uul — Mongolia 40. Zoomorph &amp; Altar P — Guatemala USERNAME NOTICE: When creating an AVROD username, your username will be locked to the headset that you created it on. This may be changed in later updates.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1495350/header.jpg?t=1610055159",
    "Price": 0.0,
    "Developers": "AVROD Technologies Inc.",
    "Publishers": "AVROD Technologies Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_7aa795ffc19d2b98e6ae73ef622d9eca1674d3f8.1920x1080.jpg?t=1610055159,https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_a41d77bee3896c0c418c52bf753838c8d912e69a.1920x1080.jpg?t=1610055159,https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_fd2d8914aabcc6b45e49b24518ec9b975ea0df2f.1920x1080.jpg?t=1610055159,https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_6ebe137d914a5ca1f4015346dc59db0723eab4e1.1920x1080.jpg?t=1610055159,https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_62d09986348f9e5427773b58aa300e24e28c4313.1920x1080.jpg?t=1610055159,https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_82018a38bf5ff82e102d0154687a4fd0387a5f2c.1920x1080.jpg?t=1610055159,https://cdn.akamai.steamstatic.com/steam/apps/1495350/ss_e2562e4951a9cab07e4f7f46e5f82d203cab7d1d.1920x1080.jpg?t=1610055159",
    "Slug": "avrod",
    "Meta Title": "AVROD: Jan 5, 2021, AVROD Technologies Inc. and Full Over...",
    "Meta Description": "Looking for information on AVROD? Check out the release date (Jan 5, 2021), developer insights from AVROD Technologies Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for AVROD game - Steam 1495350",
    "Canonical URL": "https://gusku.site/game/avrod",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AVROD\", \"description\": \"Looking for information on AVROD? Check out the release date (Jan 5, 2021), developer insights from AVROD Technologies Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"AVROD Technologies Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AVROD Technologies Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1495350/header.jpg?t=1610055159\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}