{
    "AppID": 419080,
    "Name": "Bridge Constructor Stunts",
    "Release date": "Feb 23, 2016",
    "About the game": "Stuntman and engineer in one? No problem with Bridge Constructor Stunts! Build imposing ramps and loops to reach your goal in the diverse stages. But building structures alone isn't enough this time: you sit behind the wheel of the vehicles yourself and have to maneuver them skillfully to the goal. Collect stars, complete daredevil jumps, flips and spectacular stunts, leaving behind a trail of destruction across the entire level to beat the high score. But you can only do all that with perfectly constructed bridges and ramps. Join the huge Let's Play community To ensure none of your jumps are forgotten, you can save your runs as videos and GIFs, directly upload them to GIPHY and share them with your others (video export and GIF upload functions for Windows version only). Let the world be part of your most outrageous jumps! Improved Construction Mode Once again you have access to a variety of building materials with different properties. Numerous improvements make building even easier: simply click to convert a beam you have built into road, and vice-versa. Click and hold on a part of the construction and you now have the option to reposition your structures without having to build them from scratch. Loose Screw! We have hidden some hard-to-reach screws in some of the levels. Find and collect them, and you might be able to put these screws to good use in the future... FEATURES: The latest instalment in the internationally successful Bridge Constructor series! Improved and simplified Construction Mode Build ramps and drive vehicles across them yourself Diverse level with different objectives: collect stars, score target, reach the goal… Delivery vans and dump trucks with cargo that wreaks havoc when coming loose, but is also useful to help you collect items Various building materials Spectacular stunts and rampages of destruction Achievements and rankings Replay feature and video/GIF sharing: save your best bridge crossings and stunts and share them with your friends (video export and GIF upload functions for Window- s version only) Controller-Support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/419080/header.jpg?t=1649421237",
    "Price": 1.49,
    "Developers": "ClockStone",
    "Publishers": "Headup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/419080/ss_99ebf0d0a9e522e47b5f90a5972fff4790c4eba9.1920x1080.jpg?t=1649421237,https://cdn.akamai.steamstatic.com/steam/apps/419080/ss_b274c67c2366cb16ed955f3235268f40754d44e9.1920x1080.jpg?t=1649421237,https://cdn.akamai.steamstatic.com/steam/apps/419080/ss_e37d41570510685d9c873be54177159f68547793.1920x1080.jpg?t=1649421237,https://cdn.akamai.steamstatic.com/steam/apps/419080/ss_bdcc516ff0dde14748e814aa8c7a9b3c30d4aebf.1920x1080.jpg?t=1649421237,https://cdn.akamai.steamstatic.com/steam/apps/419080/ss_a01c525af60723382d0f514feea562dea4a67427.1920x1080.jpg?t=1649421237",
    "Slug": "bridge-constructor-stunts",
    "Meta Title": "Bridge Constructor Stunts: Feb 23, 2016, ClockStone and F...",
    "Meta Description": "Looking for information on Bridge Constructor Stunts? Check out the release date (Feb 23, 2016), developer insights from ClockStone, and a complete game...",
    "Alt Text Image": "Official header image for Bridge Constructor Stunts game - Steam 419080",
    "Canonical URL": "https://gusku.site/game/bridge-constructor-stunts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bridge Constructor Stunts\", \"description\": \"Looking for information on Bridge Constructor Stunts? Check out the release date (Feb 23, 2016), developer insights from ClockStone, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 23, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"ClockStone\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/419080/header.jpg?t=1649421237\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}