{
    "AppID": 2630,
    "Name": "Call of Duty® 2",
    "Release date": "Oct 13, 2006",
    "About the game": "Call of Duty® 2 redefines the cinematic intensity and chaos of battle as seen through the eyes of ordinary soldiers fighting together in epic WWII conflicts. The sequel to 2003's Call of Duty, winner of over 80 Game of the Year awards, Call of Duty 2 offers more immense, more intense, more realistic battles than ever before, thanks to the stunning visuals of the new COD™2 engine. The #1 WWII shooter development team returns with an amazing new experience: Developed by Infinity Ward, creators of the award-winning Call of Duty. All-new, unprecedented enhancements from stunningly realistic graphics to seamless gameplay, thanks to the revolutionary COD2 engine, groundbreaking AI, and choice-based gameplay innovations. Beautifully rendered snow, rain, fog, and smoke, combined with dynamic lighting and shadows, make this the most intense WWII shooter yet. New conflicts and enemies to face: Call of Duty 2 brings you bigger battles, with more tanks, troops, and explosions on-screen, and bigger scope, with a wide range of locales and environments across the European Theater. Fight 'The Desert Fox' across the scorching sands of North Africa as wave upon wave of tanks clash in the desert. Use rocket-propelled grappling hooks alongside your Army Ranger squad to storm and scale the cliffs of Pointe du Hoc against a relentless German counterassault, and slog through urban chaos as a tank hunter in war-torn Russia. Rely on your squad as never before: The dozens of Allied soldiers surrounding you are fully aware of the changing situations around them, and will let you know using an all-new, context-sensitive battle chatter system. They will draw enemy fire, lay down cover for you, use foxholes and moving tanks for cover, and warn you of incoming enemy troops and hostile fire. Choice-based gameplay: Play through missions in the order you see fit. Will you decide to play first as a sniper or as a tank commander? It's your call. Open-ended battlefields allow you to individualize your tactics and choose the order in which you complete your objectives. Multiplayer Mayhem: Go online for intense Axis vs. Allies team-based multiplayer action, building on the hugely popular Call of Duty multiplayer modes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2630/header.jpg?t=1646762115",
    "Price": 19.99,
    "Developers": "Infinity Ward",
    "Publishers": "Activision",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2630/0000000696.1920x1080.jpg?t=1646762115,https://cdn.akamai.steamstatic.com/steam/apps/2630/0000000692.1920x1080.jpg?t=1646762115,https://cdn.akamai.steamstatic.com/steam/apps/2630/0000000693.1920x1080.jpg?t=1646762115,https://cdn.akamai.steamstatic.com/steam/apps/2630/0000000694.1920x1080.jpg?t=1646762115,https://cdn.akamai.steamstatic.com/steam/apps/2630/0000000695.1920x1080.jpg?t=1646762115",
    "Slug": "call-of-duty-2",
    "Meta Title": "Call of Duty® 2: Oct 13, 2006, Infinity Ward and Full Ove...",
    "Meta Description": "Looking for information on Call of Duty® 2? Check out the release date (Oct 13, 2006), developer insights from Infinity Ward, and a complete game summary.",
    "Alt Text Image": "Official header image for Call of Duty® 2 game - Steam 2630",
    "Canonical URL": "https://gusku.site/game/call-of-duty-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Call of Duty\\u00ae 2\", \"description\": \"Looking for information on Call of Duty\\u00ae 2? Check out the release date (Oct 13, 2006), developer insights from Infinity Ward, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2006\", \"author\": {\"@type\": \"Organization\", \"name\": \"Infinity Ward\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Activision\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2630/header.jpg?t=1646762115\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}