{
    "AppID": 1796980,
    "Name": "CareUEyes - Blue Light Filter",
    "Release date": "Nov 18, 2021",
    "About the game": "The color of the computer screen is very important to game players, but the computer screen emits a lot of harmful blue light, which can cause digital visual fatigue, such as dry eyes, fatigue, pain, etc., because blue light interferes with the secretion of melatonin, melatonin secretion Abnormalities can cause disturbances in the circadian rhythm, which can make it difficult to fall asleep. The brightness of the computer screen is an important parameter that affects the gaming experience. A dim screen prevents you from seeing the game clearly, while a too bright screen will dazzle the eyes, and a too dark or too bright screen brightness will increase eye fatigue. Unfortunately, many computer screens cannot adjust the brightness or can not easily adjust the brightness. Eye fatigue will slow down your reaction speed when playing games, and you will not be able to detect enemies sensitively. CareUEyes is a program specially designed for avid computer users. it is an eye care software with a blue light filter, brightness adjustment, break reminder, focus, etc., which protects your eyes in all directions and helps you easily discover enemies in the game, let you get The game's victory. Features Game mode Careueyes has eight modes, suitable for eight different scenarios, specifically designed game modes for gamers, and can filter blue light and adjust the brightness of the screen. Blu-ray filtering Filter blue light by adjusting the color temperature. The lower the color temperature, the less blue light. As the color temperature decreases, the screen gradually becomes warmer. In order not to affect your gaming experience, the default color temperature of the game mode is more appropriate and does not affect the color of your screen. You can drag the slider to adjust the color temperature, or you can customize the hotkey to quickly adjust the color temperature. You can turn on the sunrise/sunset feature to set different color temperatures for day and night. Brightness adjustment Support for accurate adjustment brightness between 20% to 100%. You can drag the slider to adjust the brightness, or you can customize the hotkey to quickly adjust the brightness. You can open the sunrise/sunset feature, set different brightness during the day and night. Time reminder rest It supports customizing the duration and interval of rest, it will remind you 30 seconds in advance that you will be rested, and you can choose to delay the rest for a period of time. After the countdown, CareUEyes automatically locks the screen for you to rest. If you cannot consciously rest, you can choose the mandatory rest mode. Focus Allows you to customize the size and transparency of the reading area, so you can easily keep focused and improve work efficiency.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1796980/header.jpg?t=1637278509",
    "Price": 29.99,
    "Developers": "CareUEyes",
    "Publishers": "CareUEyes",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1796980/ss_f64004f8e2f75ad2b9137b6a6c419ac30cdff817.1920x1080.jpg?t=1637278509,https://cdn.akamai.steamstatic.com/steam/apps/1796980/ss_8d65950108e2122f85d14f3540c39971a0209cf2.1920x1080.jpg?t=1637278509,https://cdn.akamai.steamstatic.com/steam/apps/1796980/ss_74fbb38a3be40ce8eea44367f94c745d8b0421df.1920x1080.jpg?t=1637278509,https://cdn.akamai.steamstatic.com/steam/apps/1796980/ss_f40a01cee006c742d0b0d329e60846303923ab2b.1920x1080.jpg?t=1637278509,https://cdn.akamai.steamstatic.com/steam/apps/1796980/ss_1b124be478a12f045fcb861ff3c6907c434f1a24.1920x1080.jpg?t=1637278509",
    "Slug": "careueyes-blue-light-filter",
    "Meta Title": "CareUEyes - Blue Light Filter: Nov 18, 2021, CareUEyes an...",
    "Meta Description": "Looking for information on CareUEyes - Blue Light Filter? Check out the release date (Nov 18, 2021), developer insights from CareUEyes, and a complete g...",
    "Alt Text Image": "Official header image for CareUEyes - Blue Light Filter game - Steam 1796980",
    "Canonical URL": "https://gusku.site/game/careueyes-blue-light-filter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CareUEyes - Blue Light Filter\", \"description\": \"Looking for information on CareUEyes - Blue Light Filter? Check out the release date (Nov 18, 2021), developer insights from CareUEyes, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CareUEyes\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CareUEyes\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1796980/header.jpg?t=1637278509\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}