{
    "AppID": 1498900,
    "Name": "Chef's Tail",
    "Release date": "Oct 22, 2021",
    "About the game": "On the distant shores of a certain river, a cute but macabre procession is climbing the stairs. Weary travelers of this underworld domain, exhausted by their long journey, are going to take the next step on their journey... But before that, why not take the bite out of that tasty steaming hot apple pie, just like your nana used to make! You are a ferocious beast, a guardian of the underworld, the untamed and wild cooking cat! As the master chef of the underworld, let the traveling souls a taste of mortal food, to rejuvenate them on their long journey. GATHERING Plants do grow in the underworld. But they are fragile in nature, requiring constant care for them to grow in this foreign environment. As a chef, you need to resurrect the trees and tend to them during the seasons of 'life', and you will have an unlimited supply of ingredients for your dishes. FISHING Some stray fish also snucks into the underworld from time to time. Which is extremely good news for you, because which real 'Cat Chef' does not enjoy a bit of fishing (and subsequently sashimi) on the side? Choose the time of the day, the proper bait, maybe wait for some rain and enjoy the bountiful harvest of top-notch fish from a place nonother than the river Styx. COOKING The solemn and silent spookies of the underworld wish only to feast on mortal food - the best relief from their grueling travel. Arm yourself with the cooking utensils and prepare the best dishes you can think of. Your ghastly customers are a bit reluctant to part with their coin, though. Make sure, to 'woo' them properly into buying stuff. And be careful, as some of them are daring enough to steal the products of your hard labor! LEARNING Good recipes don't grow on trees. By expanding your catalog of ingredients, you will inevitably learn more recipes to cook. And it just so happens that ghosts tend to come in batches by their food preferences. Some like dishes with salmon, others like honey. Make sure you are prepared by learning all the recipes available to you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1498900/header.jpg?t=1651924553",
    "Price": 8.99,
    "Developers": "Art Games Studio S.A.",
    "Publishers": "Art Games Studio S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1498900/ss_ca2b977daca8bda360ea0ae64c360cef86629844.1920x1080.jpg?t=1651924553,https://cdn.akamai.steamstatic.com/steam/apps/1498900/ss_e37511f599333f8eb5f54d36e4392bbaa0859cb3.1920x1080.jpg?t=1651924553,https://cdn.akamai.steamstatic.com/steam/apps/1498900/ss_0557d45d42352e3d1c52cacb8430639bfd8be002.1920x1080.jpg?t=1651924553,https://cdn.akamai.steamstatic.com/steam/apps/1498900/ss_bd460352e37d3bc8c5ebf3c96708b08fa11892ac.1920x1080.jpg?t=1651924553,https://cdn.akamai.steamstatic.com/steam/apps/1498900/ss_56c6644830a6b6d78c24b0cb243bc222f09c074c.1920x1080.jpg?t=1651924553",
    "Slug": "chef-s-tail",
    "Meta Title": "Chef's Tail: Oct 22, 2021, Art Games Studio S.A. and Full...",
    "Meta Description": "Looking for information on Chef's Tail? Check out the release date (Oct 22, 2021), developer insights from Art Games Studio S.A., and a complete game su...",
    "Alt Text Image": "Official header image for Chef's Tail game - Steam 1498900",
    "Canonical URL": "https://gusku.site/game/chef-s-tail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chef's Tail\", \"description\": \"Looking for information on Chef's Tail? Check out the release date (Oct 22, 2021), developer insights from Art Games Studio S.A., and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Art Games Studio S.A.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Art Games Studio S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1498900/header.jpg?t=1651924553\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}