{
    "AppID": 1948680,
    "Name": "CYCO",
    "Release date": "Jul 15, 2022",
    "About the game": "---STANCES--- NEUTRAL Passive master-stance that grants dynamic traversal at extreme speeds. Any surface that looks climbable: Is. Simply walk into it. STRAFE Activated master-stance from which almost all meaningful attacks are deployed from. In strafe, the camera is locked behind the character and jumping is replaced with kicks while in STRAFE. PROWL Activated sub-stance that provides a low-to-earth profile that modifies attacks to hit low, all while maintaining speed. AERIAL Passive sub-stance invoked while airborne, allowing for high speed in-air attacks and rapid vertical navigation. ---ATTACKS--- FIRE Ranged attacks, FIRE doesn't do direct damage, instead, the more a target incurs FIRE damage, their damage intake is increased as well as their movement speed being slowed. FIRE damage is regenerated passively or quickly regenerated while in RESET. FORM Attacks that emanate from the body or while being in a half-sword stance FORCE strikes. Most combat is performed through FORM. Incurring FORM damage exponentially increases damage intake from all sources and enables single kill shots from FORCE attacks. FORM damage is slowly regenerated over time, and can be moderately regained through being in RESET. FORCE Attacks that kill. Typically, the slowest and sluggish of attacks with a higher whiff punish window, when a target incurs too much FORCE damage, they die. FORCE attacks will do miniscule damage if not enough FORM damage has been accumulated. FORCE attacks are used as slower, long ranged finishing blows. FORCE damage can only regenerate slightly through transferring between consenting units at an inefficient loss ratio, or replenished when a hostile is killed. ALL ATTACKS Being hit in the back will result in a 4x damage multiplier, if you are hit while in AERIAL or PROWL will incur a 2x damage multiplier. DO NOT run from engagements, you will regret it. ---UTILITY--- BLOCK While in STRAFE, walk backwards from any attack to BLOCK, you will incur chip damage, though you cannot die from blocking, however some overhead attacks can override through block. TECH Walk forward into any attack while in STRAFE to TECH, while it is a small window of opportunity and puts you at risk of eating an incoming attack, if you successfully tech an incoming strike you will take zero damage, build meter, and gain frame advantage to retaliate against your attacker. METER Value resource needed to execute super attacks and is needed to CHARGE attacks, METER is built with any successful melee hit. CHARGE Integer resource needed for FIRE attacks and needed to CHARGE attacks. Virtually all attacks can be charged to increase its damage output at the cost of both METER and CHARGE. CHARGE can either be regenerated quickly by entering a charging state or allowing it to slowly passively replenish.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1948680/header.jpg?t=1657875856",
    "Price": 13.99,
    "Developers": "PHOSPHORUS,Collin Hansard",
    "Publishers": "PHOSPHORUS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1948680/ss_70a75b369a823d38127fdb0589e0bee6fc68e1ec.1920x1080.jpg?t=1657875856,https://cdn.akamai.steamstatic.com/steam/apps/1948680/ss_20eda8d86050aa1b200abf0900d74cd639161ad7.1920x1080.jpg?t=1657875856,https://cdn.akamai.steamstatic.com/steam/apps/1948680/ss_496798c9493573fd019b04625c704fb9aa312a89.1920x1080.jpg?t=1657875856,https://cdn.akamai.steamstatic.com/steam/apps/1948680/ss_17c6331b1515abbcd19ab031d2034c878114ef4e.1920x1080.jpg?t=1657875856,https://cdn.akamai.steamstatic.com/steam/apps/1948680/ss_a0efb7a6561e1f20f0f37954bb613e235bf24895.1920x1080.jpg?t=1657875856",
    "Slug": "cyco",
    "Meta Title": "CYCO: Jul 15, 2022, PHOSPHORUS,Collin Hansard and Full Ov...",
    "Meta Description": "Looking for information on CYCO? Check out the release date (Jul 15, 2022), developer insights from PHOSPHORUS,Collin Hansard, and a complete game summary.",
    "Alt Text Image": "Official header image for CYCO game - Steam 1948680",
    "Canonical URL": "https://gusku.site/game/cyco",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CYCO\", \"description\": \"Looking for information on CYCO? Check out the release date (Jul 15, 2022), developer insights from PHOSPHORUS,Collin Hansard, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PHOSPHORUS,Collin Hansard\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PHOSPHORUS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1948680/header.jpg?t=1657875856\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}