{
    "AppID": 1394420,
    "Name": "Dallen Clicker Ultimate",
    "Release date": "Sep 17, 2020",
    "About the game": "Hey friend! You like clicker games, huh? Well, I don't. But I sure love Dallen. So I have made Dallen Clicker. Now you can have like... A BILLION DALLENS! What is Dallen Clicker?: Dallen Clicker is a clicker-type incremental virtual game. A clicker-type is a genre of video game in which you tap/click on an item to produce more of said item. You can use that produced item to buy items that produce even more. Whether it be automatically clicking the button for you or increasing the amount of Dallen's you get when pressing the button. The Story: Dallen is a game developer, trying to get his game published but is in for a rude awakening when he finds out that there's a game-breaking bug! He accidentally made too many copies of himself! He is transported into the world of his design. Get as many as you can and get the heck out of there. The Gameplay: In this game, you will be clicking a giant button with Dallen's face on it. Each click will increase your Dallen count. You can use those Dallen's to buy more upgrades or power-ups to get more Dallen's. One upgrade makes it to where whenever you click on Dallen's face, it will give you 1 more each time. One Upgrade makes it to where you passively gain more Dallens as time goes on. Along with this, there is a shop where you can change the face to match one of many playable characters. New Features: - A Story Mode - Different Unlockable Characters - Saving - 11 Power-Ups instead of 8 - A Much Better GUI Who is Dallen Larson? Dallen Larson, born September 20, 2002, is an American video game developer. He is best known for the hit indie rhythm game, Rhythm Knights. How Was It Made?: The original game was created in HTML, CSS, and JavaScript. Out of pure willpower and awesomeness, the game has been remade. Q and A: Q: How do I play the original? A: You don't. Buy this game instead. Q: What's new? A: I invited this thing called saving. It's revolutionary. Q: Why is this game not free? A: Do you want Dallen Clicker or not? Q: Wait but wh- A: That is all the Q's and the A's we have. CREDITS: Dallen Larson / Brendon Cacchio / Sterling Stephens / Christian Morcos / Bayleigh Easterling",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1394420/header.jpg?t=1657217118",
    "Price": 0.99,
    "Developers": "Dallen Larson Games",
    "Publishers": "Dallen Larson Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1394420/ss_7d863c2f0770e81eab6003eba801a59eb78fc138.1920x1080.jpg?t=1657217118,https://cdn.akamai.steamstatic.com/steam/apps/1394420/ss_a42b9acedc980fc5ba9cce962e98ede3966c07e5.1920x1080.jpg?t=1657217118,https://cdn.akamai.steamstatic.com/steam/apps/1394420/ss_614f3cc31ef1f8c5b0b0b10799109950ab20922f.1920x1080.jpg?t=1657217118,https://cdn.akamai.steamstatic.com/steam/apps/1394420/ss_5a03dc899e9cfa9e31baed864840ea51905b1afd.1920x1080.jpg?t=1657217118,https://cdn.akamai.steamstatic.com/steam/apps/1394420/ss_1f5a61a9f9a370812b2911f36b25f6d9eba39c6f.1920x1080.jpg?t=1657217118",
    "Slug": "dallen-clicker-ultimate",
    "Meta Title": "Dallen Clicker Ultimate: Sep 17, 2020, Dallen Larson Game...",
    "Meta Description": "Looking for information on Dallen Clicker Ultimate? Check out the release date (Sep 17, 2020), developer insights from Dallen Larson Games, and a comple...",
    "Alt Text Image": "Official header image for Dallen Clicker Ultimate game - Steam 1394420",
    "Canonical URL": "https://gusku.site/game/dallen-clicker-ultimate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dallen Clicker Ultimate\", \"description\": \"Looking for information on Dallen Clicker Ultimate? Check out the release date (Sep 17, 2020), developer insights from Dallen Larson Games, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dallen Larson Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dallen Larson Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1394420/header.jpg?t=1657217118\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}