{
    "AppID": 1571910,
    "Name": "Dear Althea",
    "Release date": "Apr 8, 2022",
    "About the game": "About this game This visual novel, full of decisions and repercussions, is a fun reinterpretation of the novel 'Dear Faustina' (1897) by British author Rhoda Broughton. Each chapter is filled with beautiful, high-quality artwork illustrating all the situations and moments you will experience alongside the charismatic characters. The art you will be able to see has been made with special care in the representation of the British Victorian era, as well as taking into account the class difference that is present at all times. The video game has 41 chapters, although if you play only one of the 10 routes you will see, more or less, 25 chapters. Illustrations In each chapter you can enjoy between 18 and 50 beautiful illustrations that illustrate every moment and situation. In total, the videogame has 780 illustrations made with special care to show every detail and gesture. The result manages to transport you completely to the London of the Victorian era and succeeds in conveying the feelings that the protagonist experiences. Story In 'Dear Althea' you will be Althea Vane; a young upper class British woman whose life is turned upside down after the death of her father causes her family to fall apart along with her future. She will be forced to choose a new future, a place to call home and a group to belong to. To get there she will have to face all sorts of situations in Victorian London; however, love and romance fortunately abound and will make her quest more enjoyable. Choices matter You'll find that the decisions you make will change the story from the very first chapter. There will also be many of them that will affect the story in the long run, even when you least expect it. In Dear Althea, your decisions can affect not only your fate, but also the fate of other people; they can also change your relationship with other characters and open up new routes of dialogue that will change the dynamics of relationships. Diverse relationships You don't have to fall in love with anyone or enter into any kind of romantic or sex-affective relationship in the game; but depending on your choices, you can enter into a relationship with up to four characters that fall within the LGBTIAQ+ spectrum. However, you don't have to choose just one relationship; you can enter into a variety of polyamorous relationships. Consent In this video game, consent is discussed and encouraged in all aspects of relationships between characters. In romantic relationships there is no obligation to have sex and refusing to have sex has no negative repercussions. Characters There is a great diversity of charismatic characters in Dear Althea but there is a clear division between upper class and working class characters, as a protagonist you can decide from the first chapter and throughout the story which group you are more akin to and defending characters of one class or the other can have repercussions. Puzzles If puzzles aren't your thing, you can skip them without missing any important plot points; however, there has been a lot of effort put into the creation of the puzzles to make them all diverse. They have been integrated in such a way that they fit both the plot and the period in which the story takes place. Typography The typography has been designed to help people with dyslexia to identify letters better. Even so, it has been created from the typography that appears in the original 1897 book. Accessibility The whole story is narrated in text and it is not necessary to activate the sound at any time. You only need to click the right mouse button to interact with the game and the puzzles. There are no skill or speed challenges. Endings There are a total of ten final chapters, many of which are the result of decisions that took place several chapters earlier. Due to the branching of the story. There are no good or bad endings, they have all been thought out so that the ending is satisfying and consistent with the decisions you have made throughout the story. Duration and text Counting all possible decisions, the game has more than 112408 words and can last (depending on decisions and reading speed) about 5 hours on average.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1571910/header.jpg?t=1650099105",
    "Price": 12.99,
    "Developers": "Tijerín Art Studio",
    "Publishers": "Tijerín Art Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_55268ece5c121c0ae53d2196ba955d19e345e899.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_a35facf49e914f7458af8d3de494e257dcb89255.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_8b9c8bd6e9a9b338b54e98390bc92beb3181fdcd.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_46f905d2240a45f829aba1625d2a03fba90455a3.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_08ebdcb0b861df010be3acffc936351bc70e7725.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_8d6fb1137e076a80d4a3615553268b9dc3399d9f.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_cdf9a542918d45a47ae6a740a5f72a93b6bf641e.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_64f75064f9b9e6a8003f074fcf791ee3694866f1.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_88b1054195c2bb9c80f84a53b7a947022159ae5e.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_875ec3ac015310e130b37eeb447726fa757c9a88.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_5ac2dfaa12e3fc2aedcd42fb9d1287fa4a18a635.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_f35357c0fa24d99b55a6351b1701ce31ac9dbf94.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_ac5ec7529621ac55716a10c062558e80ed109c41.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_bd4c2acbd4c4e70549d8f88f1de3a012d1acade4.1920x1080.jpg?t=1650099105,https://cdn.akamai.steamstatic.com/steam/apps/1571910/ss_b5ea4aeb6cbc11ae217c73254a843905e54d8ebe.1920x1080.jpg?t=1650099105",
    "Slug": "dear-althea",
    "Meta Title": "Dear Althea: Apr 8, 2022, Tijerín Art Studio and Full Ove...",
    "Meta Description": "Looking for information on Dear Althea? Check out the release date (Apr 8, 2022), developer insights from Tijerín Art Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Dear Althea game - Steam 1571910",
    "Canonical URL": "https://gusku.site/game/dear-althea",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dear Althea\", \"description\": \"Looking for information on Dear Althea? Check out the release date (Apr 8, 2022), developer insights from Tijer\\u00edn Art Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tijer\\u00edn Art Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tijer\\u00edn Art Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1571910/header.jpg?t=1650099105\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}