{
    "AppID": 1457690,
    "Name": "Dwarves  & Dungeons",
    "Release date": "Nov 19, 2020",
    "About the game": "Dwarves &amp; Dungeons is my first steam game. After two years of development, it has completed the whole framework and the complete content of two characters. The game is innovated on the traditional game of Match-3 Puzzler, combined with the elements of rougelike game, adding hard core content, bringing a new and unique experience. Innovative ways to play Dwarves &amp; Dungeons is different from the traditional combat Linking game. It combines the combat part and the Linking part organically. It is no longer a sequential operation of 'Linking = &gt; fight'. Instead, the character you control is placed on the Linking chessboard. All Linking actions must be initiated from the character's position, and the character's walk should be completed at the same time of Linking. You can gain experience points through super long links (usually more than 8 lines) to increase your combat level A fierce fight to death When you control the character with personality to gallop on the chessboard, all kinds of monsters with unique skills follow you. After you complete a connection move, the monster will charge you and use different attack methods to 'greet' you. In front of these fierce and powerful monsters, you have numerous choices: to enhance the attributes of a positive confrontation is a warrior like way; you can also make full use of various different characters of runwen, and circle around them; or directly launch a super damage sniper, and kill it on the way of the charge. What way to choose depends on you! Organic combination of rougelike When you work hard and perseveringly to Win, you can unlock a higher difficulty. As the difficulty increases, monsters will have stronger attributes, and you will face more shackles. How to crack them depends on thinking. Random events The game also provides a number of different effects of random events, some can enhance your attributes, some can improve Rune level, but if you want to activate them, you have to step on your feet, as soon as the time comes, they will lose track. Camp construction Whether you win or lose, you can get the most valuable resource in the game from the battle: gold coins. With gold coins, you can upgrade and expand your camp, unlock and purchase scrolls, which will bring great benefits to your battle Future and Prospect In the future, there will be more characters with different styles and more monsters with personality. Please look forward to it! Salute The game was originally inspired by the famous game:《Dungeon Raid》",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1457690/header.jpg?t=1616264301",
    "Price": 3.99,
    "Developers": "ColorfulMaxtrix",
    "Publishers": "ColorfulMaxtrix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1457690/ss_08d62d15574f4ae4ba91397a387535d387bc198e.1920x1080.jpg?t=1616264301,https://cdn.akamai.steamstatic.com/steam/apps/1457690/ss_c9f7b3ddb316f189cfd78e9674087d7942eab8e9.1920x1080.jpg?t=1616264301,https://cdn.akamai.steamstatic.com/steam/apps/1457690/ss_a3159faafa0b7159daafc082fc9aa774e0fedc0e.1920x1080.jpg?t=1616264301,https://cdn.akamai.steamstatic.com/steam/apps/1457690/ss_e6cb92e6317efd921b573dce2b73fdf72ad9fb44.1920x1080.jpg?t=1616264301,https://cdn.akamai.steamstatic.com/steam/apps/1457690/ss_93be66467e9ea450832c33cccd884d06eb6ec227.1920x1080.jpg?t=1616264301",
    "Slug": "dwarves-dungeons",
    "Meta Title": "Dwarves  & Dungeons: Nov 19, 2020, ColorfulMaxtrix and Fu...",
    "Meta Description": "Looking for information on Dwarves  & Dungeons? Check out the release date (Nov 19, 2020), developer insights from ColorfulMaxtrix, and a complete game ...",
    "Alt Text Image": "Official header image for Dwarves  & Dungeons game - Steam 1457690",
    "Canonical URL": "https://gusku.site/game/dwarves-dungeons",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dwarves  & Dungeons\", \"description\": \"Looking for information on Dwarves  & Dungeons? Check out the release date (Nov 19, 2020), developer insights from ColorfulMaxtrix, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ColorfulMaxtrix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ColorfulMaxtrix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1457690/header.jpg?t=1616264301\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}