{
    "AppID": 1228970,
    "Name": "Elemental Abyss 元素之渊",
    "Release date": "May 26, 2020",
    "About the game": "'This is my path to victory!' A turn-based strategy game with card management and rogue-like elements, with a touch of the adventure game feel. Control the power of the three elements and explore the monsters' den called 'Elemental Abyss'. Elemental Abyss is a mix of card management, adventure games and rouge-like elements. If you're already familiar with card based rouge-likes you're going to be surprised, Elemental Abyss mixes these elements in a new and refreshing way. Monster Encounters During each turn of an encounter, you will have to pick a route for your character. After a route has been picked, your character will follow it, attacking enemies along the way. This might sound simple, but it has a deceptively amount of depths and complexity to it. The different tiles all belong to one of the 3 elements, which all behave slightly different. By moving across the same element you will harness its power, becoming stronger for the turn. Should you power-up for that one powerful attack or is it better to choose a path that attacks the most enemies? Deck Building During the various encounters, you will have to equip your 'Essences'. These will be drawn from a deck of cards and their different powers will help you through the Abyss. Managing this deck of cards is an important part of your adventures, as you will only draw 3-6 cards every encounter. Try to manipulate the deck for the strategy that suits you the best. The Abyss Unlike a traditional rogue-like game, the map of the Abyss doesn't change. This will give you some familiarity that will anchor you in an otherwise changing experience. Each adventure will be very different from the previous one, but by slowly pushing forth into the unknown, you will be able to get closer to the whole picture. This allows you to explore the Abyss in a way that reminds you of a traditional RPG game. At present, the game has the following contents: - 3 classes with a total of 13 characters, each with a their special abilities. - More than 190 Essences available. - More than 200 different encounters. - 18 normal monsters (and their mutant counterpart) and 9 bosses - 36 events that can either help or hinder you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1228970/header.jpg?t=1590546127",
    "Price": 9.99,
    "Developers": "29x",
    "Publishers": "29x",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1228970/ss_697321a0e3cf511389460da6eeef21a90a9a21a5.1920x1080.jpg?t=1590546127,https://cdn.akamai.steamstatic.com/steam/apps/1228970/ss_d7d538306daae3a9dc90f1e1789cf681fadb7c72.1920x1080.jpg?t=1590546127,https://cdn.akamai.steamstatic.com/steam/apps/1228970/ss_024fc975b658fceef7b3c97ec0a9563f22553e09.1920x1080.jpg?t=1590546127,https://cdn.akamai.steamstatic.com/steam/apps/1228970/ss_4d7ed97c78e5d930d1a44754a2922cb7ad7aa3ea.1920x1080.jpg?t=1590546127,https://cdn.akamai.steamstatic.com/steam/apps/1228970/ss_ef59e4c7628ad4a1b35af667c69c9f35ea57660e.1920x1080.jpg?t=1590546127,https://cdn.akamai.steamstatic.com/steam/apps/1228970/ss_b89152fbfdbbf2ad0b855b387c17875d5302107a.1920x1080.jpg?t=1590546127",
    "Slug": "elemental-abyss",
    "Meta Title": "Elemental Abyss 元素之渊: May 26, 2020, 29x and Full Overview",
    "Meta Description": "Looking for information on Elemental Abyss 元素之渊? Check out the release date (May 26, 2020), developer insights from 29x, and a complete game summary.",
    "Alt Text Image": "Official header image for Elemental Abyss 元素之渊 game - Steam 1228970",
    "Canonical URL": "https://gusku.site/game/elemental-abyss",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elemental Abyss \\u5143\\u7d20\\u4e4b\\u6e0a\", \"description\": \"Looking for information on Elemental Abyss \\u5143\\u7d20\\u4e4b\\u6e0a? Check out the release date (May 26, 2020), developer insights from 29x, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"29x\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"29x\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1228970/header.jpg?t=1590546127\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}