{
    "AppID": 919330,
    "Name": "Ghost in the pool",
    "Release date": "Jan 27, 2021",
    "About the game": "[Ghost in the pool] is a short black and white Japanese comic style campus horror visual novel game. The story and art style are both derived from the original series of horror comic “诡闻斋”. This game is recreated and developed by CASCHA and the original authors of the comic JOEY. Take you to experience different campus horror tales in a different way. story: It all started from a rumor that the school swimming pool has a ghost in it, Every innocent life can be the victim, especially when you go there at night. The school knows it but keep it quiet, and just simply lock the pool after day time. But, there always have some brave people who believe or not believe it, and break into the natatorium at night, and meet the horrible creature there and with no return back. Game content: 1 to 2 hours of the fully interactive game, including 3 main endings and multiple branches. The specific game duration depends on the gameplay you choose. More than 200 fully hand-drawn art resources, including portraits and scene backgrounds of all characters, and vivid comic strips. 6 completely original music works and rich sound effects and visual effects. Multi-language localization support. (For details, please refer to Steam's introduction) The supported languages ​​will continue to be added in subsequent updates. 诡闻斋 comic series: “诡闻斋” is a series of short horror cartoons created by “九日十夜”, which brings together many long or short independent horror stories. “Ghost “in the pool” is one of the shortest short stories. As the first attempt at gamification in the series, we chose “Ghost in the pool” as the prologue of the series of games. This means that more exciting and longer games will be launched in the future. Credits: This game is developed by CASCHA and JOEY. JOEY is responsible for the Art and story part, CASCHA is responsible for coding/visual performance/sound effects/music. Special thanks to those who helped us complete and polish the game: TECHNICAL SUPPORT: Heheming LOCALIZATION SUPPORT: Iván Rocha Márquez Nisa Nur Koçhan Lei Zheyu Anemochore 有栖川有栖 Richard Turek 임원표/ WONPYO IM Marc Chen Lin ShaoWen If you like the game and want to know more about CASCHAGAMES or support me, please follow me on: TWITTER INSTAGRAM / YOUTUBE FACEBOOK BILIBILI Please contact me if you willing to help with the game on more different language support cascha2012@gmail.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/919330/header.jpg?t=1616313964",
    "Price": 4.99,
    "Developers": "CASCHA GAMES",
    "Publishers": "CASCHA GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/919330/ss_613a72b3262af1b2f5877084c9b9e04e7ec3d715.1920x1080.jpg?t=1616313964,https://cdn.akamai.steamstatic.com/steam/apps/919330/ss_b1fece07e2db6d274c3ad3825cf8e4e88b308213.1920x1080.jpg?t=1616313964,https://cdn.akamai.steamstatic.com/steam/apps/919330/ss_69f0bc1622b6faa32aae0217a35e55ca6cf7a4f6.1920x1080.jpg?t=1616313964,https://cdn.akamai.steamstatic.com/steam/apps/919330/ss_2a2abc7ee4761189a56def854fb5e46e195bbcd2.1920x1080.jpg?t=1616313964,https://cdn.akamai.steamstatic.com/steam/apps/919330/ss_84df0db28fa57d82fb948f694d98586a722e99c4.1920x1080.jpg?t=1616313964",
    "Slug": "ghost-in-the-pool",
    "Meta Title": "Ghost in the pool: Jan 27, 2021, CASCHA GAMES and Full Ov...",
    "Meta Description": "Looking for information on Ghost in the pool? Check out the release date (Jan 27, 2021), developer insights from CASCHA GAMES, and a complete game summary.",
    "Alt Text Image": "Official header image for Ghost in the pool game - Steam 919330",
    "Canonical URL": "https://gusku.site/game/ghost-in-the-pool",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ghost in the pool\", \"description\": \"Looking for information on Ghost in the pool? Check out the release date (Jan 27, 2021), developer insights from CASCHA GAMES, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"CASCHA GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CASCHA GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/919330/header.jpg?t=1616313964\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}