{
    "AppID": 1015120,
    "Name": "Hot Earth: inVasion",
    "Release date": "Apr 30, 2019",
    "About the game": "Game Description: This is an exciting 3D game that should change your idea of ​​the usual 2D Clickers. It has its own features: a) The game features 20 ranks received by the main character. (Ranks can be upgraded for myw glasses by killing aliens breaking through a teleport.) b) With each alien killing, its level grows. (Depending on the level of the monster grows and the amount of his health). c) In the game, except for cartridges, health and armor, there is nothing more to buy. (Everything is provided FREE, depending on your current rank). d) There are already 4 types of weapons in the game: 1. Blaster (Automatic rifle capable of generating plasma clots and releasing them in the reaping state into the enemy). 2. Pulvinizer (throws a bomb, causing damage, after a while it explodes, striking everything around it with splinters) 3. Pulsator (Shoots dissecting plasma disks, causing fast die, as well as able to track hidden enemies) 4. Knife (As a rule, it deals more damage if you beat it at an angle, at the base of the skull, but this way the opponent also has the opportunity to do damage in return.) e) As in any Clicker, an auto-attack is also used, which is used in the form of automatization drones. (After the protective barrier collapses around the portal device, protective drones are activated). And drones are of three types: 1. Shastik (Drones green, quickly attack the target and cause significant damage). 2. Grof (Drones are red, cause great damage. Their projectiles are broken, causing additional damage. But they are quite slow). 3. Curtains (blue drones, like a hurricane demolish everything in their path. These drones have tremendous speed and high damage). (For damage done by drones, the player does not receive experience points) f) A special feature is also its own damage system. Depending on where you get position on the monster will depend the how many myw-points you get. 1. In the head - with a weapon 5 points, a knife 15. 2. In the body - weapons 3 points, a knife 10. 3 In the arm or leg - with arms 1 point, with a knife 5. g) The game has a record table, referring to which (it will be possible in the future) to compare the current number of points and show off them in front of your friends. Or try to beat their record. After all, points will not be permanent, they will change depending on the purchase of ammo, health, armor, or the resulting new rank. The plot of the game: Our solar system, like the cycle, planet after planet is absorbed by the sun. The inhabitants of our planet are not particularly did worried about this, until they were faced with an imminent threat in dense. Our planet has become too close to the sun. On it cattle is dying out, the seas and oceans are drying out, people are dying of starvation. But everything changed when suddenly the bloodthirsty nation “Virus” decided to attack us, thanks to their technology of moving in space, we had a chance to survive! My brother Jack, with other scientists, began to study this technology. In order to relocate all the inhabitants of the neighboring planet before sun swallows us. I, keep the planet’s defense, restraining the enemy from invading it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1015120/header.jpg?t=1605745407",
    "Price": 5.99,
    "Developers": ".M.Y.W.",
    "Publishers": ".M.Y.W.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_757d4ccf9a8722ab6e5abcd206fbb01466016e33.1920x1080.jpg?t=1605745407,https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_2c40d119c9122b2b43f991e730a8d9b66ffae8b1.1920x1080.jpg?t=1605745407,https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_6d649fd04be45855ad02e5b3a2950b056f482f77.1920x1080.jpg?t=1605745407,https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_7fd548f87763dc5fe1a29deb82d5412f86c0efd4.1920x1080.jpg?t=1605745407,https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_06cf67bbc40f0e4eb84023da627c4fc29596fb0e.1920x1080.jpg?t=1605745407,https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_2669df93d2e961d09cfe7c1ce1b05ed7675572b2.1920x1080.jpg?t=1605745407,https://cdn.akamai.steamstatic.com/steam/apps/1015120/ss_7c0f25e42c1af4eed36dcb5ecffc97ba224a50c4.1920x1080.jpg?t=1605745407",
    "Slug": "hot-earth-invasion",
    "Meta Title": "Hot Earth: inVasion: Apr 30, 2019, .M.Y.W. and Full Overview",
    "Meta Description": "Looking for information on Hot Earth: inVasion? Check out the release date (Apr 30, 2019), developer insights from .M.Y.W., and a complete game summary.",
    "Alt Text Image": "Official header image for Hot Earth: inVasion game - Steam 1015120",
    "Canonical URL": "https://gusku.site/game/hot-earth-invasion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hot Earth: inVasion\", \"description\": \"Looking for information on Hot Earth: inVasion? Check out the release date (Apr 30, 2019), developer insights from .M.Y.W., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \".M.Y.W.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \".M.Y.W.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1015120/header.jpg?t=1605745407\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}