{
    "AppID": 1045730,
    "Name": "HyperQ: The 4Dimensional Roguelike",
    "Release date": "Jul 25, 2019",
    "About the game": "HyperQ is a 4Dimensional Roguelike Horror Shooter. It looks like The Binding of Isaac and Crimsonland melted into one &amp; spiced with a bit of absurd humor. The stroryline is inspired by science-fiction horror movie Cube 2: HyperCube. 5 unrelated people 5 unique characters 5 different stories 5 combat styles 1 common goal... Survive ... Randomly generated world - each time your game experience will be different! It's a shooter game with RPG system – the longer you survive, the stronger you become! It's hard to survive alone - together will be much easier in Co-op mode! 5 characters - own story, gameplay, skills, weapons each! Dynamic world - depends on your decisions! Over 100 Challenging Achievements - so much fun! Many Unlockables - new Weaons, PickUps, PowerUps! If you love The Binding of Isaac, Hotline Miami or Crimsonland you will be satisfied for many hours! Once you finished this game, you are far from seeing everything – there are many ways to reach the goal! Beware the Darkness! A.K.A. 'BoneCrusher'. Do not provoke him because you'll find out why they call him that. His fists are harder than rock. Not very talkative. Many legends circulate about him, but no one knows why he is in jail. He is unbelievably strong but still relatively fast. Primary Weapon: Fists Secondary Weapon: Pistol Ability: Bullet time She lost her parents and then escaped from the orphanage. Brought up by the street. As a teenager, she became a gang leader. Smuggling... Kidnapping... Robberies... Inhabitants from afar see her and run home. The police are helpless. Nobody's messing with her. And if there is even someone... He lives short... It is extremely fast, agile and… fragile. It helps her to survive everyday on the street. Primary Weapon: Baseball Secondary Weapon: Uzi Ability: Jump A brilliant scientist. He led a group of scientists during a secret governmental science program. His team managed to distinguish the Singularity from the inside of the black hole. With it, they managed to create the first 4-dimensional object – HyperCube. At the next stage of the experiment, the Object was extremely unstable and absorbed him. Officially Declared Dead. P.S. His wheelchair is rapid. Primary Weapon: PortalGun Secondary Weapon: BlackHole Generator Ability: Hawk King's ForceShield A teenager hacker, the network knows as _Cond0r. Every electronic device can be hacked &amp; this young man knows how to do it. Never alone. He always has his best companion with him - Drone. He modified this toy in a deadly weapon. Small but ingenius. Primary Weapon: Drone Fazer Secondary Weapon: Drone MiniRifle Ability: Hacking He was a rat exterminator. Unaware. He took up the dangerous job of cleaning the HyperCube, thinking it was just another job. Nobody told him there was no way out. His contract was an ordinary pitch. His titanium PowerArmor is extremely durable and hence extremely heavy and slow. Primary Weapon: Heater Secondary Weapon: FlameThower Ability: Release valve",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1045730/header.jpg?t=1573747823",
    "Price": 1.99,
    "Developers": "ToxicBeast",
    "Publishers": "ToxicBeast",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_5e4a2e9eb4cca3811d6ff4a9c7a366bf1534730f.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_4a0ea0ada59d39f96e75527a0dba70b6da3c1cad.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_8ee20e29a3e023b472aea80eccba8e4be32b0661.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_48c2ba3bf8e23ce9ec4dc682439045ef24580253.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_1242b6cf1658816fa9911cbb73fb349e7a252532.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_8ff8b8350bdf01ec049816735a5e1fc2b66cb2e7.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_d3fe32a685f81951af35064f7dd67edcc6ff2142.1920x1080.jpg?t=1573747823,https://cdn.akamai.steamstatic.com/steam/apps/1045730/ss_3331d38c5603af42f89c79d9cff2dd36feff8268.1920x1080.jpg?t=1573747823",
    "Slug": "hyperq-the-4dimensional-roguelike",
    "Meta Title": "HyperQ: The 4Dimensional Roguelike: Jul 25, 2019, ToxicBe...",
    "Meta Description": "Looking for information on HyperQ: The 4Dimensional Roguelike? Check out the release date (Jul 25, 2019), developer insights from ToxicBeast, and a comp...",
    "Alt Text Image": "Official header image for HyperQ: The 4Dimensional Roguelike game - Steam 1045730",
    "Canonical URL": "https://gusku.site/game/hyperq-the-4dimensional-roguelike",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HyperQ: The 4Dimensional Roguelike\", \"description\": \"Looking for information on HyperQ: The 4Dimensional Roguelike? Check out the release date (Jul 25, 2019), developer insights from ToxicBeast, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"ToxicBeast\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ToxicBeast\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1045730/header.jpg?t=1573747823\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}