{
    "AppID": 1755920,
    "Name": "Infinite Lagrange",
    "Release date": "Oct 7, 2021",
    "About the game": "We have extended our presence to one-third of the Milky Way with a gigantic transportation network—the Lagrange System. Different forces strike to make their own way in the world and desire the control of the Lagrange system. You, emerging as one of the force leaders, find yourself in a time of challenges and opportunities. Your fleet pioneers into the space unknown where war and sabotage may lie ahead. Are you determined to achieve something great out there or go back to the safety of home? From 0 to Infitnite Into the unknown galaxy, you have only a small city with two frigate. Through mining, building and trade, expand your base and territory, attain better ship-building technology and carry more weight in the intergalactic space. Customized Weapon System You may even modify and upgrade the weapon system on every single ship, if you ever want to tap into your creative side. It's up to you to bring out the fleet's full potential. Boundless Ship Combos Spore Fighter, Destroyer, The Great Battlecruiser, Solar Whale Carrier...... With a myriad of ships and aircraft available, there's really no saying about what kind of fleet you might put together with your unwearying ingenuity. Realistic Space Massive Battles In a space battle, a well-planned ambush can severely damage the enemy fleet. Or you can choose to guard thoroughfares with your fleet. A major battle could create a no-fly zone of hundreds of miles' radius. Venture Deep into Uncharted Space In a corner of the Milky Way, you will have your own base and view, beyond that is the vast unknown space. You will send your fleet to the dark frontiers where anything can happen. What else will you find other than stars? Interact with Interstellar Forces There are forces taking up parts of the universe. You can help them achieve their goals by sending ships to their aid, cooperate and prosper, or, instead, occupy their airspace and territory. There are countless unknown quests waiting for you. How would you choose? You Will Need Allies This is a dynamic society, where cooperation and conflict happen every day. Join or form alliance with global players. Expand territory and spread faith throughout the galaxy. You will enter a robust universe where you can strike for common prosperity with diplomacy or remain detached. It's thrilling to command the battle with a close view from all angles, and the 3D graphics rival any blockbusters. Only this time, you're the lead in the enchanting space.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1755920/header.jpg?t=1655763588",
    "Price": 0.0,
    "Developers": "NetEase Games",
    "Publishers": "NetEase Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1755920/ss_9d547deb12327f7a372e874df24947d0357e7d21.1920x1080.jpg?t=1655763588,https://cdn.akamai.steamstatic.com/steam/apps/1755920/ss_a73bccef3f683ca9811549f64587a91ee48607d8.1920x1080.jpg?t=1655763588,https://cdn.akamai.steamstatic.com/steam/apps/1755920/ss_852136873adce2afc611b962af9017caf44dceef.1920x1080.jpg?t=1655763588,https://cdn.akamai.steamstatic.com/steam/apps/1755920/ss_efc35d9982d920921af4a1ef0e55cc13b48d22cb.1920x1080.jpg?t=1655763588,https://cdn.akamai.steamstatic.com/steam/apps/1755920/ss_7beca9dc2a65d018d145d145b2c52bb088826f59.1920x1080.jpg?t=1655763588,https://cdn.akamai.steamstatic.com/steam/apps/1755920/ss_95cd5eed87ce49e19e5c911dbf598d7fa2fd4e28.1920x1080.jpg?t=1655763588",
    "Slug": "infinite-lagrange",
    "Meta Title": "Infinite Lagrange: Oct 7, 2021, NetEase Games and Full Ov...",
    "Meta Description": "Looking for information on Infinite Lagrange? Check out the release date (Oct 7, 2021), developer insights from NetEase Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Infinite Lagrange game - Steam 1755920",
    "Canonical URL": "https://gusku.site/game/infinite-lagrange",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Infinite Lagrange\", \"description\": \"Looking for information on Infinite Lagrange? Check out the release date (Oct 7, 2021), developer insights from NetEase Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NetEase Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1755920/header.jpg?t=1655763588\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}