{
    "AppID": 792710,
    "Name": "Levelhead: Platformer Maker",
    "Release date": "Apr 30, 2020",
    "About the game": "Keep a level head in Levelhead, the platformer maker featuring intense power ups, a full featured campaign, and a level editor and user generated content system that puts you in the designer seat. EMPLOYEEEEEE! The Bureau of Shipping is the galaxy's premiere package delivery corporation. For hundreds of years, our customers have trusted us to deliver their goods, real good. And now you get to be part of that delivery magic. As a new Employee to the Levelhead Division, you are responsible for training your very own GR-18 delivery robot for every possible delivery scenario. Create L.E.V.E.L.s, or ''Limited Exercises for eValuating employEe Limitations'', with the intuitive Level editor in the Workshop, then publish them for the whole world to experience. Build incredible contraptions and machines, craft adventurous expeditions that require brain and brawn to complete, or just create a relaxing music scene for other Levelheads to chill with. Once you've completed your Level, share it with the rest of the world... and gain a following! The Levelhead Division comes equipped with powerful curation and Following systems, so you'll always be able to find the best new Levels created by your colleagues. And don't forget about the Training course! More than 90 hand-crafted Levels offer a wealth of challenges and surprises to jumpstart your creativity. What are you waiting for, Employee? Get out there and do good for our goods! FEATURES Build your own Levels ! Get creative and make your own Levels with hundreds of items including enemies, hazards, paths, programmable switches, secrets, weather, music, and powers. Build a sprawling adventure, a puzzle game, a pinball machine, a Level full of bosses, a fast-paced challenge, a relaxing musical contraption, a well-paced sidescroller, or whatever else you can imagine! Levelhead's intuitive Level editor lets you convert your design ideas into platforming adventures for players around the world. Complete the challenging and funny campaign ! Take control of GR-18, a delivery robot in-training, as you run, jump, and blast your way across 90+ challenging, hand-designed campaign Levels. Along the way, you'll unlock new Avatars, speedrun against benchmark times, and become a star employee of the Levelhead division! Gain a following ! Publish your Level to the entire world and see your Play Time, Attempts, and Followers stack up. With robust search and curation, Levelhead makes collecting followers and playing endless user-generated content from around the world a breeze. Plus, the Marketing Department lets you push your Levels to the top of the charts just by playing the game, meaning you don't already have to be famous to get your Levels played! Compete for speed and score ! Every Level comes with a leaderboard - take the top spot and you'll hold the trophy! But beware, the competition is fierce and you never know who will be coming for your awards. Cross platform, cross save, &amp; cross play ! The Levels you create go out to the whole world, regardless of device! You can even back-up your unfinished levels to the cloud and transfer them between devices with ease, so you can build and play wherever you want. Laugh in couch co-op with friends ! Play with all three of your friends on the same couch for downright hilarious entertainment. If you want to really reach for those relationship goals, hop into the Level editor with friends and build Levels together. You can even build Levels designed only for 2, 3, or 4 players!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/792710/header.jpg?t=1658939561",
    "Price": 19.99,
    "Developers": "Butterscotch Shenanigans",
    "Publishers": "Butterscotch Shenanigans",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_884e4884894f3c048bb27d20faa7b752f35d7c9d.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_cbdad0976344feb12a0d3e651c030edc67758d4b.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_29fb09f642baab892b4619e4b4d3898865953278.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_361f2ad467873ad70f4501998180d360eca16678.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_6303f9ee0db197eb9b8e8debbc348a153280877d.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_ca5700ea4eb756ba89ccce05cfc3328ab838687f.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_8953a1f284dd840541a2daced5735b0c1918de7b.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_03123491f52f71d646fddecdf4da96e8d1c55280.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_6f4905f24f105c32102dd217defd2f26930ec926.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_1638382cb18cb852776b0dc2cc8105aee0f40fcc.1920x1080.jpg?t=1658939561,https://cdn.akamai.steamstatic.com/steam/apps/792710/ss_df5b5376ee9e0b02b147d8eecab3328d014e7ba7.1920x1080.jpg?t=1658939561",
    "Slug": "levelhead-platformer-maker",
    "Meta Title": "Levelhead: Platformer Maker: Apr 30, 2020, Butterscotch S...",
    "Meta Description": "Looking for information on Levelhead: Platformer Maker? Check out the release date (Apr 30, 2020), developer insights from Butterscotch Shenanigans, and...",
    "Alt Text Image": "Official header image for Levelhead: Platformer Maker game - Steam 792710",
    "Canonical URL": "https://gusku.site/game/levelhead-platformer-maker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Levelhead: Platformer Maker\", \"description\": \"Looking for information on Levelhead: Platformer Maker? Check out the release date (Apr 30, 2020), developer insights from Butterscotch Shenanigans, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Butterscotch Shenanigans\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Butterscotch Shenanigans\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/792710/header.jpg?t=1658939561\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}