{
    "AppID": 600480,
    "Name": "Megaquarium",
    "Release date": "Sep 13, 2018",
    "About the game": "From the creator of Big Pharma comes a brand new economic simulation game. Megaquarium follows in the footsteps of classic theme park management tycoon games and adds an aquatic spin! A living simulation Starting with just a few tanks and the most basic of livestock, you’ll grow your aquarium to a thronging metropolis filled with hundreds of guests, tens of staff and a multitude of different aquatic lifeforms, each with their own unique care requirements. Design your exhibits Megaquarium features almost 100 different marine species including fish, sharks, crustaceans, corals, jellyfish, other invertebrates and even a turtle! You’ll be spoilt for choice as you design, decorate and populate your tanks. The right staff for the job You won’t get far without the right staff. Choose who to hire based on their skills and future potential. Will you train up a team of multi-disciplined staff or a set of super-focussed experts? You’ll have to weigh up the pros and cons of each strategy and work out what is right for your aquarium. Research new animals and technology As guests experience your displays you’ll earn points which you can assign to discovering new livestock and equipment. Keep upgrading and expanding your aquarium and work your way up to the most prestigious animals and displays in the aquarium industry. Manage your finances The latest fish might look cool, but have you considered its impact on your aquarium’s bottom line. Tricky animals may require new staff to be hired, expensive fish food or supplements and the best tanks are a hefty investment! As aquarium curator you’ll need to master creativity and economics to succeed. Manage your guests! Keep your guests happy by providing them with seating, food, drinks and toilet facilities. Then at the end of their visit, direct them through the gift shop to boost your profits! Curator school Start your career in the campaign mode where you’ll learn everything you need to know about designing and managing an aquarium. Each of the 10 levels challenges you to build an aquarium with unique gameplay conditions and objectives, while new features and concepts are explained along the way. Dive into the sandbox Next explore sandbox mode where, with customisable settings and a random challenge generator, you can find virtually unlimited fish-related gameplay! Easy to learn, difficult to master Running an inefficient aquarium is easy. To really thrive and take on the greatest challenges you’ll need a lateral thinking brain and attention to detail. Will you group your animals by food type, water quality or something else entirely? Will you locate your equipment in a centralised hub using pumps or spread them out embracing the zoning system? How will you optimise your layout so that visitors can find your tanks and staff can easily access them? Every decision you make in Megaquarium has consequences. Your choice of animals, filters, tanks, staff and layout all have subtle and far reaching effects on each other. Experiment, adjust, learn, reapply and most importantly, have fun! Features 10 level ‘learn the game’ campaign Sandbox mode with full customisation and random challenge generator 97 species of livestock to discover each with their own unique care requirements Over 100 different objects to place including filters, skimmers, nitrate reactors, chillers, heaters, food boxes, equipment stations, doors, gates, food and drink dispensers, balloon stands, decorations, paint and more! Plan staff talks down to the subject, time and frequency to increase your point income even further! Gift shop and guest facilities Fully featured theming and decoration system",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/600480/header.jpg?t=1649241104",
    "Price": 24.99,
    "Developers": "Twice Circled",
    "Publishers": "Twice Circled",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_8e4b4ca8aa9d7489cbe8ecdc1b736df7c08ed84f.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_06a0630c6b08466c4301e2900cee6f0bf972e9d0.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_5b7ce5c798db0441ce4d61690be77fcdcc953f85.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_d6160b13ee1797f3f557b3786acdab66dea61e7f.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_6181637889ee4ed5a0952d1dd9d4cd095e83deda.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_d492aa3ec5be08abaee6d00e74d21b1a4f0416d3.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_1d030f00c0213aa3f66569b58485c924132f9628.1920x1080.jpg?t=1649241104,https://cdn.akamai.steamstatic.com/steam/apps/600480/ss_b9937fcc13553e6c9670cb5dddc87f9b230e375e.1920x1080.jpg?t=1649241104",
    "Slug": "megaquarium",
    "Meta Title": "Megaquarium: Sep 13, 2018, Twice Circled and Full Overview",
    "Meta Description": "Looking for information on Megaquarium? Check out the release date (Sep 13, 2018), developer insights from Twice Circled, and a complete game summary.",
    "Alt Text Image": "Official header image for Megaquarium game - Steam 600480",
    "Canonical URL": "https://gusku.site/game/megaquarium",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Megaquarium\", \"description\": \"Looking for information on Megaquarium? Check out the release date (Sep 13, 2018), developer insights from Twice Circled, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Twice Circled\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Twice Circled\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/600480/header.jpg?t=1649241104\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}