{
    "AppID": 853450,
    "Name": "Nevergrind Online",
    "Release date": "Jun 9, 2022",
    "About the game": "Nevergrind Online is a multiplayer first-person dungeon crawl RPG with real-time combat! You can choose to play solo or team up with friends online! Minions of evil are stirring below and the Kingdom of Edenburg is counting on you to vanquish the sinister forces of darkness. Do you have what it takes to restore order to the world of Vandamor? Team up and form a party of up to five players to help restore peace and order to the Kingdom! Nevergrind Online combines classic RPG heritage with a unique twist, creating a unique RPG experience unlike anything else! Nevergrind Online was designed with multiplayer in mind, though the game may also be enjoyed solo. Players can choose from a large variety of 12 races and 14 classes, each with their own strengths and weaknesses. By teaming up, players can take on greater challenges and receive even greater rewards! Generally, classes are designed for tank, healer, dps, or utility roles, though these roles are not rigid and players may opt to experiment and play however they see fit! Gameplay After creating your character, you will arrive at the once tranquil Kingdom of Edenburg. First, decide to team up or go alone. The King offers a healthy variety of missions for solo adventurers or full parties full of heroes! Before you depart, explore the options available in town. You can buy potions, weapons, armor, scrolls, upgrade skills, and more! Seven buildings are available including a tavern, an apothecary, a blacksmith, a merchant, an academy, a guild hall, and a bank. Once you are prepared, descend into the dungeon! Once you have delved into the dungeon below, your party leader has the responsibility to navigate the party through the procedurally generated dungeons. This will allow fellow party members to relax, cast spells, or even offer feedback about which path to take. Each mission has a target which you must eliminate to drive the forces of evil back from whence they came. Navigate the dungeon, find your target, and eliminate them! Once you succeed, you may return to town and accept your next mission! Features Create a character from 12 races and 14 classes! Allocate attributes that favor your playing style! Choose from more than 200 unique avatars drawn by artflow.ai, an avatar tool powered by artificial intelligence and machine learning! This allows for an exciting future with unlimited avatar variety! Level up 12 unique skills for each class! Which skills will you prioritize? Discover thousands of different items including magical, rare, set, and unique items! Magical, rare, and unique items have dynamic properties! Unique and set items have fixed property types, but their values vary! Hunt for the best possible version of your favorite set and unique items! Equip multiple set items to unlock powerful set bonuses! If you cannot find your favorite item, seek it out by trading items with other players! Crawl through procedurally generated dungeons which offer a new layout with each quest! Complete dozens of quests through 14 different zones in the world of Vandamor! Communicate with allies and forge alliances using a robust chat system that supports direct messages, party chat, private chat rooms, and guild chat! Normal and Heroic modes offer a spectrum of challenges to any party size! Encounter more than 50 different types of fearsome monsters including orcs, skeletons, and golems! Challenging monster varieties including uniques, champions, and bosses, each with their own deadly traits! Supports offline and online play! Want to play Nevergrind Online with no internet connection? No problem! No micro-payments! No cash shop! Unlock bank and inventory space using gold, Nevergrind Online's in-game currency! City Under Siege Your adventure starts in the peaceful Kingdom of Edenburg, the trading capital of Vandamor, which has recently been under siege by agents of chaos outside of its castle walls. Supplies are running low in the Kingdom due to recent disruptions in major trade routes to the Kingdom. Your first orders from the King are to investigate who is blocking the trade routes, and for what sinister purpose? Your adventure will lead you on a perilous journey across the furthest reaches of Vandamor, to creepy crypts, forgotten fortresses, and ravaged ruins! As you journey deeper into the dungeons of Vandamor, the challenges will become increasingly difficult, but the King's faith is resting upon you! Restore order and become the champion that the Kingdom of Edenburg so desperately needs!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/853450/header.jpg?t=1658884309",
    "Price": 19.99,
    "Developers": "Neverworks Games",
    "Publishers": "Neverworks Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_fb1be09167d5ad8a501ac76d54b057d0d4632dbe.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_8d5a45ac990f73ab4b60f49558679a6195a9f79f.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_b5830fa2bc93161470e8a0e696285a83c80b3c0f.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_b5ccd2bdedd140babb715174c13631e18c8df4a9.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_4755d600a5dd38a6705ff4e6a6b6428f5d37acba.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_f38db39e2456268e54518a608e37dbc91a704caa.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_2c30be9cf7edb4338795e30584cdbd93b3424ba4.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_12f90c9ff152e4ff0c8ec459956cf2d04b4014e7.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_668b0cb7152eb172b0387c2d0291643c09153aed.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_453f39ea535dfeaf9f7fca7136d0cce507c52059.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_7c3c3f777697c6842f2fbccc180c4e933cf55aba.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_8ee8e4160ef758466ba62885f981afdbd17359d6.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_e17817fcdbb8441c67cf269d200240f9f5bce3b0.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_82ec6053edd1f46ccbba1e1f683711127797149e.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_2e984ad726b145cb320aefea09479d7c6d7c566a.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_fae755d493ee62651ae1ddec1eeef51b0ecf4159.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_5d751923f3dc4b326f2f4f8da167cf2c72a86dc3.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_014521623470b4f8e93c2f272a29161db4886942.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_053dac1d366592b97241c9876a3ceae43e44d5e6.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_7020e16949a21832b00f0480c98d0e4370e39015.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_c3fce96412c3e0944eb85fadd845052118746003.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_109170ea657b7c6856c6c59574be6d864789fba0.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_c3cb35858273afda59e52273a0074c3a8226768d.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_95b9bbf5f1c8f2ea90627904866ed82adf228517.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_2acf34116566089636d6fc93d9250a549c56c520.1920x1080.jpg?t=1658884309,https://cdn.akamai.steamstatic.com/steam/apps/853450/ss_37c0480e129596bac6b83d5d03258d497dc49402.1920x1080.jpg?t=1658884309",
    "Slug": "nevergrind-online",
    "Meta Title": "Nevergrind Online: Jun 9, 2022, Neverworks Games and Full...",
    "Meta Description": "Looking for information on Nevergrind Online? Check out the release date (Jun 9, 2022), developer insights from Neverworks Games, and a complete game su...",
    "Alt Text Image": "Official header image for Nevergrind Online game - Steam 853450",
    "Canonical URL": "https://gusku.site/game/nevergrind-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nevergrind Online\", \"description\": \"Looking for information on Nevergrind Online? Check out the release date (Jun 9, 2022), developer insights from Neverworks Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Neverworks Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Neverworks Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/853450/header.jpg?t=1658884309\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}