{
    "AppID": 1767560,
    "Name": "Pro Cycling Manager 2022",
    "Release date": "Jun 9, 2022",
    "About the game": "Pro Cycling Manager 2022 makes you a sport director. Make all the decisions necessary to take your team to the top: your responsibilities include recruitment, planning objectives and race programmes, sponsor management, scouting future talent, training, race strategy and much more. You can also create your own rider in Pro Cyclist mode. Join a team and prove you can be the leader, then do what it takes to shine in the peloton. Can you rise to become one of the best? Pro Cycling Manager 2022 lets you compete against players from around the world in online mode . WHAT'S NEW : New talent scouting system A more energetic and attacking peloton More options for customising your game experience An easier-to-use interface (new Cyclist page) Redesigned stamina and resistance system The 21 official stages of the 2022 Tour de France NEW SCOUTING SYSTEM A good sport director must know how to recruit future talent, which is why we have set up a new scouting system. You have to send your scouts to different regions in order to uncover the best talent. Your scouts become more effective and improve over time. They regularly send you information (about potential, characteristics, etc.) which you use to make your choices (observation, integration in the development team, etc.) so you can learn more about the riders. You are, of course, in direct competition with the other teams. NEW GENERATION OF RIDERS This new system is based on the level and potential of the young cyclists, using a 6-star grading system. Now the young riders who are created are juniors from 16 to 18 years old, with the pool comprised of 1,500 to 2,000 young cyclists each year (3 times more than before). These new riders will be more versatile and will develop similarly to the current stars. RIDER DEVELOPMENT Just like with the young talent, we want to have more versatile riders, so the development system has been redesigned to take this into account. It is also critical for your riders to perfectly integrate the team, establishing a good relationship with the coach, or they will not progress optimally. MORE VARIED RACE In Pro Cycling Manager 2022, thanks to a more varied peloton, you experience scenarios that are different from the usual blueprint of a Tour stage, for example. You can find yourself in a race that is action-packed from the start, with favourites taking the lead, and a variety of attacks right from the first hour. OTHER IMPROVEMENTS The interface has been redesigned, with a total overhaul of the cyclist page that now incorporates new statistics, highlighted rider capabilities and results, and the addition of an interface comparing cyclist characteristics. Stamina and resistance scores have a bigger effect on how effort is exerted during a race. This allows some riders to attack several times or manage their effort at the end of the race better. The race-day condition is now closer to the announced provisional condition. To enable comprehensive customisation, you can now adjust 2 parameters: bonus amplitude (from +5 to -5 or complete deactivation) and activation or deactivation of variation. The simulation time has been optimised and is now twice as fast as before. You can now have specific team jerseys for a given race.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1767560/header.jpg?t=1658824912",
    "Price": 39.99,
    "Developers": "Cyanide Studio",
    "Publishers": "Nacon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_dabc4c8e0defbb4dc1abaf96206ccd46c7635b45.1920x1080.jpg?t=1658824912,https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_4b306a2c2ba1cdd4cbf8771e267655eaef4caf6c.1920x1080.jpg?t=1658824912,https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_b669fb287569d3f2e6fc1393eaea3f4e3aefeb8f.1920x1080.jpg?t=1658824912,https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_9b6cb37d2c2e82b755703eb22e3e01bedf369dd3.1920x1080.jpg?t=1658824912,https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_7e1ee34e92cbb530526f2cf11f50f4b4407040d6.1920x1080.jpg?t=1658824912,https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_f2e8793e885e7cd8a8455b174d3f52a98c7462c5.1920x1080.jpg?t=1658824912,https://cdn.akamai.steamstatic.com/steam/apps/1767560/ss_8bbd7902a688ae987496ffb62cf9b6618d14c839.1920x1080.jpg?t=1658824912",
    "Slug": "pro-cycling-manager-2022",
    "Meta Title": "Pro Cycling Manager 2022: Jun 9, 2022, Cyanide Studio and...",
    "Meta Description": "Looking for information on Pro Cycling Manager 2022? Check out the release date (Jun 9, 2022), developer insights from Cyanide Studio, and a complete ga...",
    "Alt Text Image": "Official header image for Pro Cycling Manager 2022 game - Steam 1767560",
    "Canonical URL": "https://gusku.site/game/pro-cycling-manager-2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pro Cycling Manager 2022\", \"description\": \"Looking for information on Pro Cycling Manager 2022? Check out the release date (Jun 9, 2022), developer insights from Cyanide Studio, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cyanide Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nacon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1767560/header.jpg?t=1658824912\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}