{
    "AppID": 1245580,
    "Name": "Rest House 2 - The Wizard",
    "Release date": "Mar 9, 2020",
    "About the game": "Rest House 2 -The Wizard is adventure game based on the Edgar Alan Poe works. Features &amp; Highlights •Explore a breathtaking world Walk freely across 3D levels. Travel between areas with boat and wind your way through as soon as you unlock the right to be there. •Immersive, visuals Experience a world art, drawn and animated by hand with compositing 3D techniques and camera work. Immersive aesthetic, modernizing the adventure genre. •Stealth, narrative progression. Use your masks, and escape dangerous situations - or people. Experience new world through the personal lens of an ordinary low-class citizen in extraordinary events. Unlock the movie! Unlock the stories of the city and its inhabitants in a world that is connected with modern life gaming phenomenon. •Dynamic, original music and sounds Audio design gets you directly into the heart of the world. From the music playing in the forest, through closed windows, everything has been made to immerse you in this weird environment. Studio Don Quixote and Minotaur production are making movies and games with immersive and unusual rich worlds trough live stream production, with true author vision. Wizard is the sequel of the ‘’Rest House’’ game, that you can play online right now. We’re dedicated to our art- join us on a journey into a new kind of game. Viewers and players are spread all over the world. About the game Rest House 2 -The Wizard is adventure game based on the Edgar Alan Poe works. Adventures and misadventures at sea. Description: Welcome to the Rest House 2 Hello Dear player, Rest House 2 project is here. We are excited to share The Wizard. Your main goal is to find way out of this weird world. Good luck! We are working hard every day live on the RH project which is based on the one of the best mystery novels. More about at our daily live streams at the links below As part of that project there is Art peace for itself. A movie ,,Wizards''. Movie is about gamers, game developers and game play phenomenon. If you can finish this game you can unlock well-kept secret about that. If you want to support this adventure you can subscribe at Studio Don Quixote You Tube page. ,,Wizards’’ will show high level of personal expression that typically goes into truly independent games and movies. Anxiety attacks in the gaming world. “The wizard” is somewhere between game and the movie. More Topics: Mashup art style. Any support will help this fresh project. Watch live development, previous movies and games, and much more at the links below. Stay tuned… Story begin at the island, famous for its fishing harbor and whaling. One night, main character become drunk and decide, to take advantage of the breeze and sail out on boat. What happened in those lost chapters? Violent storm. Returning to whaling ship. Find hideout in the ship. Few parts are lost and it’s not sure if author will find them: -letter written in blood attached to the dog, warning to remain hidden, as his life depends on it. -mysterious message, as well as a mutiny had erupted on the whaling ship. Crew was slaughtered by the mutineers. Main character dressed in the clothes of a recently dead sailor, masquerading as a ghost. In the confusion sure to break out among the superstitious sailors, ship is taken over again. All the mutineers are killed or thrown overboard. We don’t know about these things yet. That material is also lost. The storm increases in force, breaking the mast, tearing the sails and flooding the hold. It was safe for a moment, but without provisions. Over the following days, the men face death by starvation and thirst. Dutch ship passed and he was horrified as he overcome with an awful stench. He soon realized that the apparently cheerful sailor at the ship was, in fact, a corpse propped up in the ship's rigging, his 'grin' a result of his partially decomposed skull moving as a seagull feed upon it. As the ship passes, it became clear that all its occupants are rotting corpses. There was sign: one of them should be killed as food for the others. Some parts of the story you will recognize, other will stay mystery because that material is gone… You are close to death when you reach the Jane Guy, a ship out of Liverpool. Sharks will hunt you. You’ll study the island around, become interested in the structures and atmosphere. You’ll need to go farther south towards the unexplored region. An ice and open sea, with a mild climate will look like you’re at the end of the world. Mysterious island called Tsalal, inhabited by a tribe of black, apparently friendly natives led by a chief. The color white is alien to the island's inhabitants and unnerves them, because nothing of that color exists there. Even the natives' teeth are black. The island is also home to many undiscovered species of flora and fauna. Its water is also different from water elsewhere, being strangely thick and exhibiting multicolored veins. Watch on the ambush in a narrow gorge. You could hide in the mountains surrounding the site of the ambush but you’ll be teleported to some weird town where you need to discover a labyrinth of passages with strange marks on the walls, and disagree about whether these are the result of artificial or natural causes. Only escape, only truth! Here the story ends abruptly. What happened next? After several days main character encounters a rain of ashes and then observe a huge cataract of fog or mist, which splits open to accommodate their entrance upon approach. The native dies as a huge shrouded white figure appears before them. A short post-scriptural note, ostensibly written by the project editors, explains that main character was killed in an accident and speculates his final two or three chapters were lost with him, though assuring the public the chapters will be restored to the text if found. The note further explains that he is alive in but cannot be interviewed at present. The editors then compare the shapes of the labyrinth and the wall marks noted to Arabian and Egyptian letters and hieroglyphs with meanings of the 'White Wizard'.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1245580/header.jpg?t=1598728275",
    "Price": 5.99,
    "Developers": "Studio Don Quixote",
    "Publishers": "Minotaur production",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1245580/ss_adca0cc71cade9e7b3dd0d8d3d48ae1863c57bbd.1920x1080.jpg?t=1598728275,https://cdn.akamai.steamstatic.com/steam/apps/1245580/ss_51f7243c5a2d7e1d80e3070b72dbb7e8b0b0fcdb.1920x1080.jpg?t=1598728275,https://cdn.akamai.steamstatic.com/steam/apps/1245580/ss_76c4166a2bbc32c6e56f7550f2bc104b1dd27942.1920x1080.jpg?t=1598728275,https://cdn.akamai.steamstatic.com/steam/apps/1245580/ss_49ff19f1ca1a897a49afad6a2e583e2697c06467.1920x1080.jpg?t=1598728275,https://cdn.akamai.steamstatic.com/steam/apps/1245580/ss_747cdee38fa06bbc03a0180446b71ce12dc517cb.1920x1080.jpg?t=1598728275,https://cdn.akamai.steamstatic.com/steam/apps/1245580/ss_f18b87e5f767488385d9892339fc1c11537e1a0e.1920x1080.jpg?t=1598728275",
    "Slug": "rest-house-2-the-wizard",
    "Meta Title": "Rest House 2 - The Wizard: Mar 9, 2020, Studio Don Quixot...",
    "Meta Description": "Looking for information on Rest House 2 - The Wizard? Check out the release date (Mar 9, 2020), developer insights from Studio Don Quixote, and a comple...",
    "Alt Text Image": "Official header image for Rest House 2 - The Wizard game - Steam 1245580",
    "Canonical URL": "https://gusku.site/game/rest-house-2-the-wizard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rest House 2 - The Wizard\", \"description\": \"Looking for information on Rest House 2 - The Wizard? Check out the release date (Mar 9, 2020), developer insights from Studio Don Quixote, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Don Quixote\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Minotaur production\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1245580/header.jpg?t=1598728275\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}