{
    "AppID": 833950,
    "Name": "Risk System",
    "Release date": "May 13, 2019",
    "About the game": "In the distant future, humanity has discovered a method to replicate matter through the use of a Dimensional Gate. Industry is revolutionized overnight and a short period of chaos gives way to all warring factions uniting under a common banner. A few years pass and the peace brought about by Gate Technology crumbles once a new threat appears; a race of energy parasites that have crossed through the Dimensional Gate by mimicking the very materials humanity had believed they were replicating. Mankind is quickly overtaken as their technology is turned against them and the energy emitted by the parasites begins to take control of those exposed. In an act of desperation, the experimental RSK9 is constructed, a ship made of Pre-Gate materials and technology with the ability to absorb parasite energy and use it to power its incredible arsenal. Piloting the RSK9 is Alys, an ace pilot previously missing in action that has returned seemingly immune to parasite control. Her skill and resistance to the parasite energies influence make her the only pilot capable of preventing the extinction of mankind. NOTE FOR LINUX USERS - Due to game engine limitations we are only able to guarantee compatibility with Ubuntu 18.04.2 LTS 64bit or newer. It is likely it will function on many other Linux distributions but it is impossible currently to be 100% sure. We very much want to support the Linux community and are happy to entertain suggestions on how we may improve compatibility in the future. GAME PLAY: -Increase your B-Meter &amp; firepower quickly by flying as close to enemy fire as possible and absorbing their energy. The closer you fly, the more energy you net! -Fire your weapon while flying close to enemy fire and absorbing to perform powerful 'Risk Shots'. Enemies destroyed by these powered up shots will turn into energy to power your shield. The best defense is a risky offense! -Fly like an ace pilot and utilize Barrel Rolls to quickly cover vertical space &amp; modify your attack! -Unleash the Barrier Breaker once the B-Meter is full to inflict huge damage on everything in sight! -Playing for points is fun again as higher scores are awarded for explosive bursts of destruction and taking risks! Destroy multiple enemies at once and utilize 'Risk Shots' to string together combos and increase your score multiplier! -Experience different facets and paths to the story based on your performance and actions taken during missions!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/833950/header.jpg?t=1614612590",
    "Price": 9.99,
    "Developers": "Newt Industries, LLC",
    "Publishers": "Newt Industries, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/833950/ss_908f1c040be36bef5091c007d702bd513afc58a1.1920x1080.jpg?t=1614612590,https://cdn.akamai.steamstatic.com/steam/apps/833950/ss_3de07cd9c983e895ddae82f3537c2e4bf4a275d4.1920x1080.jpg?t=1614612590,https://cdn.akamai.steamstatic.com/steam/apps/833950/ss_12dc98e5ec49c5aa524571734599e1258bfc2cbc.1920x1080.jpg?t=1614612590,https://cdn.akamai.steamstatic.com/steam/apps/833950/ss_b0271479d2c673593bac0f5ef3ef7a6eb2367979.1920x1080.jpg?t=1614612590,https://cdn.akamai.steamstatic.com/steam/apps/833950/ss_ec5a30394243c96bf4a6a063e37f59664e8c1ffe.1920x1080.jpg?t=1614612590",
    "Slug": "risk-system",
    "Meta Title": "Risk System: May 13, 2019, Newt Industries, LLC and Full ...",
    "Meta Description": "Looking for information on Risk System? Check out the release date (May 13, 2019), developer insights from Newt Industries, LLC, and a complete game sum...",
    "Alt Text Image": "Official header image for Risk System game - Steam 833950",
    "Canonical URL": "https://gusku.site/game/risk-system",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Risk System\", \"description\": \"Looking for information on Risk System? Check out the release date (May 13, 2019), developer insights from Newt Industries, LLC, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Newt Industries, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Newt Industries, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/833950/header.jpg?t=1614612590\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}