{
    "AppID": 1822640,
    "Name": "Rogue Dungeon",
    "Release date": "Jan 28, 2022",
    "About the game": "Rogue Dungeon is highly re-playable and dripping with theme. Not very many games let you go from zero to hero in thirty minutes. It's a loot management game at its core and that's where it's charm comes from. You might start the game with a hunk of meat, that you use to charm a wolf, who helps you defeat the zombie who drops a lockpick, which you use to open the safe, where you find the jeweled goblet, which you trade for a lucky shield, which you use to block the Dragon's fire. Rogue Dungeon is hard and you will DIE! However, experience and skillful play will ensure that veteran Rogues will make it out of the dungeon alive. That's more than you will. You, you're going to end up in a Goblin's belly. Prove us wrong! Pick your Rogue, grab your starting loot, grab your skills, set your starting stats and enter the dungeon. Choose which room to navigate to via the mini maps. Rooms are divided into the following types.... Traders - Offer you a choice to trade loot or stats for other loot, stats, or henchmen. Some trades involve a stat test or the luck of a die. Loot traders typically trade two items for any one item they offer for trade. They make exceptions for the shiny stuff and will trade any item for a single treasure. Combat - Most combat rooms draw 1 to 3 monsters from the monster deck equal to the dungeon level. Combat is resolved using your Rogues primary stat and a D10. If the two combined are greater than the monsters combat stat, your Rogue hits the monster. If it's less, the monster hits your Rogue. If equal, both are hit. Damage can be negated by discarding an armor or by playing a skill or magical item. Potions and food can be consumed at any time to increase your health and prevent your death. Some monsters have a weakness to specific thematic loot and are vanquished immediately such as when the Medusa gets a look at her face in the mirror's reflection. Once a monster's health reaches zero, the monster dies and you receive one loot and XP equal to the dungeon level. Traps - traps litter the dungeon but most can be disarmed or bypassed if you have the appropriate equipment. Even if the gremlins ran off with your rope, there is always a chance you can come out unscathed if you pass an appropriate Strength, Agility or Intelligence test. If successful, tests result in an XP reward and avoiding any potential damage. All rolls maybe manipulated with the use of the luck stat. Spending one luck will allow you to modify a die result by 1 up or down, or allow for a complete reroll. Play progresses through 5 dungeon levels separated by a staircase. You may camp at the stairs without the threat of a wandering monster interrupting your siesta. You may level your Rogue at anytime so long as you have the XP. When you get to the final room, draw a boss monster and fight. Many monsters have special abilities activated depending on your attack roll. They can summon additional monsters, drain your level, heal, etc...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1822640/header.jpg?t=1643359365",
    "Price": 9.99,
    "Developers": "Cerberus Gate Games",
    "Publishers": "Cerberus Gate Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1822640/ss_9b1bba52303d0f55d870843c2f18554c3629853a.1920x1080.jpg?t=1643359365,https://cdn.akamai.steamstatic.com/steam/apps/1822640/ss_eeb087199ed95c6536ef38272f8630376a8fe0d8.1920x1080.jpg?t=1643359365,https://cdn.akamai.steamstatic.com/steam/apps/1822640/ss_1c6a53dc7f58c840479b7ff05db4e28c0ac4ede2.1920x1080.jpg?t=1643359365,https://cdn.akamai.steamstatic.com/steam/apps/1822640/ss_546908359d6dd323e3fb94c687fe9445d0d0e80e.1920x1080.jpg?t=1643359365,https://cdn.akamai.steamstatic.com/steam/apps/1822640/ss_11caddc91c5d85328e9c7694577148dca213718f.1920x1080.jpg?t=1643359365",
    "Slug": "rogue-dungeon",
    "Meta Title": "Rogue Dungeon: Jan 28, 2022, Cerberus Gate Games and Full...",
    "Meta Description": "Looking for information on Rogue Dungeon? Check out the release date (Jan 28, 2022), developer insights from Cerberus Gate Games, and a complete game su...",
    "Alt Text Image": "Official header image for Rogue Dungeon game - Steam 1822640",
    "Canonical URL": "https://gusku.site/game/rogue-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Dungeon\", \"description\": \"Looking for information on Rogue Dungeon? Check out the release date (Jan 28, 2022), developer insights from Cerberus Gate Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cerberus Gate Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cerberus Gate Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1822640/header.jpg?t=1643359365\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}