{
    "AppID": 1193550,
    "Name": "Ruthless Conquest",
    "Release date": "Nov 27, 2019",
    "About the game": "Send the fleet to capture planets and expand your empire, until you vanquish them all! Local and internet multiplayer is supported in this galactic strategy game. Six levels of challenging AI await you for practice matches and for making up numbers. This game is completely free, has no ads or in-app purchases. It is a 2018 Christmas gift for the players of other CandyRufusGames games. Your objective is to send fleet to conquer planets and use their resources to build even more ships. Be careful: overstretching yourself is risky. Make sure enemy cannot take your most productive planets while your forces are away. The game is balanced for careful defence rather than reckless attack . Only attack if you know your forces are much stronger, or if your enemy is unprepared/surprised. Bones of many a rash commander float in the void between the planets. To defend your planets, launch satellites. These orbiting stations contain a huge laser that fires on any enemy ships in range. They not only protect your planet, but also hinder movement of enemy forces nearby. Plan satellite placement carefully, as they are expensive to launch. You can temporarily disable them, for example to let your enemy's enemy ships pass. To win, you must either eliminate all other empires or capture all special planets. This second option makes the game exciting. Even the insignificant and the puny can win, if they plan carefully and strike suddenly at the right targets. There are other factors at play. Sometimes the weaker players can receive reinforcements, instantly turning the tide of battle. And beware of the Antarans. They ruled this galaxy once. They take a very dim view of any faction that grows too strong! Ruthless Conquest is easy to understand, but hard to master. Here is some advice for beginner and experienced players alike. Some of it is basic, but some has been won in the heat of a thousand matches, so do not discount it lightly! - bigger planets produce more ships - capture all special planets to win - launch satellites to defend your planets - a satellite will fire on any enemy ships in range - disable satellites to let your enemy's enemy reinforcements pass - watch out for the Antarans, they ruled this galaxy once! - when your enemies weaken themselves against each other, attack! - neutral satellites only fire on ships attacking neutral planets - weaker players might occasionally receive reinforcements - freshly captured planet stops production for a while - empire productivity falls when it's very large - numbers on planets turn grey when empire productivity is low - don't expend your forces on neutrals when enemy is at the door - send ships in small groups to reduce losses from satellites - attack is silver, defence is gold, counterattack is priceless - gift ships to neutrals separating you from a powerful enemy - practice against AI to hone your skills - it's often a mistake to attack the weaker of two opponents - Antarans don't like factions that grow too big - a planet stops production if it reaches capacity - it's ruinous to sit between two warring factions - ships will slowly die on an overcrowded planet - neutral planets slowly gather strength - rush his large planets if he stretches himself too thin - if he sends ships, attack the planet they launched from - set up continuous ship delivery from safe planets in the back - build up reserves before attack - against satellites, attack in small groups to reduce losses - place satellites to intercept Antarans before they reach your planets",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1193550/header.jpg?t=1574859214",
    "Price": 0.0,
    "Developers": "Candy Rufus Games",
    "Publishers": "Candy Rufus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1193550/ss_6983a83a019f559f5feba4e668289892abc048b0.1920x1080.jpg?t=1574859214,https://cdn.akamai.steamstatic.com/steam/apps/1193550/ss_90319b6b4c431299e705d2c01a864af079fc71ee.1920x1080.jpg?t=1574859214,https://cdn.akamai.steamstatic.com/steam/apps/1193550/ss_64833318ca41c9f28ba81587d12ccdf747d0eb40.1920x1080.jpg?t=1574859214,https://cdn.akamai.steamstatic.com/steam/apps/1193550/ss_1a56303724aa1ddf2995b80d51eb6b4e45a9a103.1920x1080.jpg?t=1574859214,https://cdn.akamai.steamstatic.com/steam/apps/1193550/ss_3ffab2027c62ad47a35aca788f6dddffdf265aa6.1920x1080.jpg?t=1574859214",
    "Slug": "ruthless-conquest",
    "Meta Title": "Ruthless Conquest: Nov 27, 2019, Candy Rufus Games and Fu...",
    "Meta Description": "Looking for information on Ruthless Conquest? Check out the release date (Nov 27, 2019), developer insights from Candy Rufus Games, and a complete game ...",
    "Alt Text Image": "Official header image for Ruthless Conquest game - Steam 1193550",
    "Canonical URL": "https://gusku.site/game/ruthless-conquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ruthless Conquest\", \"description\": \"Looking for information on Ruthless Conquest? Check out the release date (Nov 27, 2019), developer insights from Candy Rufus Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Candy Rufus Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Candy Rufus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1193550/header.jpg?t=1574859214\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}