{
    "AppID": 1581940,
    "Name": "Sea of Roses",
    "Release date": "Jun 29, 2021",
    "About the game": "A heartwarming game developed remotely during the COVID-19 pandemic by a team of friends who dearly missed each other. Sea of Roses is best accompanied with tea and cookies! One day, Marion wakes up in her attic. Odd—she doesn't really recall falling asleep there. Soon, she realizes that someone else—a girl—is living in her house. But she's never met her before! And although her village is similar to the one she's grown up in, it is not identical . And neither are the people. Marion is now adrift in a world that feels familiar, but is filled with strangers. What is this place? Who are these people? And where is her fiancé? Help Marion explore this new world, as she reconsiders her past. As Marion explores this mysterious world, she will meet a helpful and colorful cast of characters. Using her exploration skills and a little ingenuity, Marion will weave together the stories of her new friends. The Village of Seallea is a beautiful place to spend some time! Walk through a variety of hand-drawn areas that are a joy to behold. Players compare exploring Seallea to 'playing through a dream.' By choosing how Marion responds to other characters, you will affect how she views the world around her. This will determine her experiences throughout the game — and even its eventual outcome. Sea of Roses is filled with hidden content for players to find! The Tales of Seallea system allows players to easily track which content they haven't discovered. Marion can easily and repeatedly return to the game to find all the different events and experiences Seallea has to offer! We understand that not everyone has the time to play games for a long time and so we offer you an option when you play. Sea of Roses is, by design, a short game. However, for those who want to really immerse themselves into the World of Seallea, the Extended Cut offers many hidden—and very special—events that will allow them to experience all that Seallea has to offer! The Original Cut of the game is briefer, eliminating these extra activities and offering a condensed version of the story. You'll still get the fundamentals of the storyline but your playtime will be significantly shortened. It's up to you to play the version you'd like because both are included when you download Sea of Roses ! About Crescent Tea Studios A Portuguese game studio founded in 2020 by André Fidalgo Silva, Andreia Batista, and Ariana Parrilha. Crescent Tea enjoys creating games built around thought-provoking storytelling, player agency, and the use of game mechanics as a narrative device. Sea of Roses is the first game from the studio to be published. About Jennifer Ann's Group Jennifer Ann's Group is a nonprofit public charity working to prevent teen dating violence through awareness, education, and advocacy. The Atlanta-based organization was founded in 2006 in memory of Jennifer Ann Crecente. Since 2008 Jennifer Ann's Group has been producing, publishing, and researching prosocial video games about issues impacting young people through its award-winning Gaming Against Violence program. All games from the Gaming Against Violence program are winning games from their annual Life.Love. Game Design Challenge which rewards video game developers for developing prosocial video games related to the theme for that year. Winning games have come from game developers around the world and themes include consent, gaslighting, healthy relationships, and teen dating violence prevention. Sea of Roses is an award-winning game from this global competition and is the first game from the program to be published on Steam.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1581940/header.jpg?t=1651089491",
    "Price": 0.0,
    "Developers": "Crescent Tea Studios",
    "Publishers": "Jennifer Ann's Group",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_6cdc5f1eac383c3a28efba85684ea81fd8c57313.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_1cd263dd896a4d91555051bb5fe7a53fc545d9f7.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_73df99ec8cb1bcac87f7d10f5f000ef80fef1fde.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_c658c1fdb9bffdac1ef7e0e6f95a92d670c92c7d.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_6aadb52ca8ab5a42bb617efc8e1c263c642b3477.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_33cdf9fc138e97a0a6e6e46636ee898ed38f518b.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_9430c32125631de23e394b100adb867a2d8bc26e.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_1119005805055b4f24d13591a016b4be8f6cb002.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_f921b02b27c63f4cbc3b8daa2ea87985fdbf8d76.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_55da1a114b7643922329412559dd39797e2be500.1920x1080.jpg?t=1651089491,https://cdn.akamai.steamstatic.com/steam/apps/1581940/ss_c6fd10914b94a38f11fa2cf328957735b5c5f472.1920x1080.jpg?t=1651089491",
    "Slug": "sea-of-roses",
    "Meta Title": "Sea of Roses: Jun 29, 2021, Crescent Tea Studios and Full...",
    "Meta Description": "Looking for information on Sea of Roses? Check out the release date (Jun 29, 2021), developer insights from Crescent Tea Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Sea of Roses game - Steam 1581940",
    "Canonical URL": "https://gusku.site/game/sea-of-roses",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sea of Roses\", \"description\": \"Looking for information on Sea of Roses? Check out the release date (Jun 29, 2021), developer insights from Crescent Tea Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crescent Tea Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jennifer Ann's Group\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1581940/header.jpg?t=1651089491\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}