{
    "AppID": 453480,
    "Name": "Shadowverse CCG",
    "Release date": "Oct 27, 2016",
    "About the game": "Four million battles every day. One Shadowverse. Japan's #1 strategic card game. Made by card gamers for card gamers.  Shadowverse is Japan's #1 strategic card game! - There are millions of Shadowverse battles every day, and a multitude of ways to play - Easy to get into, thanks to a singleplayer story mode, free card packs for new players, and bonuses every day  - Battles are finely balanced, with less RNG than other card games, and balance adjustments take place every month - New card expansions are released every three months, unleashing new deck-building strategies and battle tactics - We’ve got a great community of 22 million players and counting, with tournaments and esports broadcasts every week and support for streamers  - Featuring beautiful art and animations and fully voiced cards and story - A multitude of ways to play:  With eight different leader classes, Shadowverse gives you unparalleled freedom to create your own deck strategies. Will you play as Urias and unleash your Vengeance when your health is depleted? Or will you select Isabelle, whose spells power up the cards in your hand? Will you go all in with an aggro deck, or try to contain the board with a control deck? Or will you try to sneak in some sublimely ingenious combos? It’s entirely up to you.  - Easy to get into:  Learn the basics by playing through our extensive singleplayer story mode before taking on other players in our multiplayer modes. Be sure to pick up your free card packs after you’ve finished playing through the tutorial – just go to your Crate from the main menu to pick them up. And bonuses and daily missions help you unlock new card packs every day so it won’t be long before you have a deck that is capable of competing with the very best.  - Finely balanced:  There’s less RNG in Shadowverse than other card games, making it supremely balanced: you’ll need to trust your judgement not your luck if you are to come out on top. And we make balance adjustments every month to make sure that no one card or deck type becomes too dominant. - New card expansions released regularly:  New card expansions are added every three months to make sure the meta never gets stale. And every single expansion unleashes new deck-building strategies and battle tactics, and even new leader classes and game modes. We’re in this for the long haul and we hope you will be too. - Beautiful art: All of the cards in Shadowverse feature fantastic art by some of Japan’s finest artists, and every single card is available as an animated version. Every card is also fully-voiced, in English and Japanese, as is the singleplayer storyline.  - A great community: And last but not least, we have some amazing fans. We’ve got memes, we’ve got streams, and we have much, much more to offer than the average card game. Community tournaments and e-sports broadcasts take place every week, and there are a ton of deck-building resources online in case you get stuck. Millions of card gamers can’t be wrong – why don’t you join them?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/453480/header.jpg?t=1656390174",
    "Price": 0.0,
    "Developers": "Cygames, Inc.",
    "Publishers": "Cygames, Inc.,Cygames Korea Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/453480/ss_4a3733b469b5822a324ab0545349ea4d45ddcc97.1920x1080.jpg?t=1656390174,https://cdn.akamai.steamstatic.com/steam/apps/453480/ss_0ee5e5c2123d1c4f9fe7215ef1adfde43defc0ff.1920x1080.jpg?t=1656390174,https://cdn.akamai.steamstatic.com/steam/apps/453480/ss_8153cba0cc8e8361e3f6e293ed546eafbd6fa27a.1920x1080.jpg?t=1656390174,https://cdn.akamai.steamstatic.com/steam/apps/453480/ss_864fa66764c178e74e476bc130d6d7dc50a7054f.1920x1080.jpg?t=1656390174",
    "Slug": "shadowverse-ccg",
    "Meta Title": "Shadowverse CCG: Oct 27, 2016, Cygames, Inc. and Full Ove...",
    "Meta Description": "Looking for information on Shadowverse CCG? Check out the release date (Oct 27, 2016), developer insights from Cygames, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Shadowverse CCG game - Steam 453480",
    "Canonical URL": "https://gusku.site/game/shadowverse-ccg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadowverse CCG\", \"description\": \"Looking for information on Shadowverse CCG? Check out the release date (Oct 27, 2016), developer insights from Cygames, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cygames, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cygames, Inc.,Cygames Korea Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/453480/header.jpg?t=1656390174\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}