{
    "AppID": 1145100,
    "Name": "Singaria - Prologue",
    "Release date": "Jan 24, 2020",
    "About the game": "*****Notes***** 'Singaria - Prologue' contains prologue chapters(first 24 chapters) from full game 'Singaria' Please visit 'Singaria' Store Page for more information Find the lost land of Singaria and embark on a new action RPG adventure, with rich story and high degree of freedom to explore the world. Staying in a happy farm raising animals, decorate your home and interact with your teammates, select proper food and drink to operate your tavern, and do whatever you like. Features Rich story with high degree of freedom You have the freedom to explore the whole world and do whatever you like. Apart from killing monsters and upgrading equipment, there is a plenty of activities you can do in your farm, home, tavern and castle. Battle with your teammates and switch at any time Continue your journey with 3 teammates who have unique skills and abilities to suit your needs, and you are free to switch and control one of them during battle at any time. You can control a pastor supporting your teammates behind, or becoming a powerful knight and stand in front of your enemies. Pause the game and order your teammates to use skills or move to a particular location to defeat different kinds of bosses in the world. Various talents with diverse skills Each talent has its unique skills to power up your characters. Choose your favorite one and cooperate with other teammates to challenge everything. You can make a team with all powerful skills to defeat your enemies quickly, or set up a team with outstanding survival ability to tackle with powerful monster.(Only 2 playable characters are available after chapters 7 and 17) Free to explore the world with ample quests The world map is large with various unique areas and featured environment, and side quests are rich and diverse . Visit your friends in desert and address their concerns, support magicians in Wizard's Tower. Enjoy a wonderful life in a happy farm Do whatever you like in your farm. You can raise 12 kinds of cute animals, feed them and sing a song to them. Gathering materials through planting seeds, fishing, mining, logging and so on to earn a living or upgrade your farm. Discovering valuable collections all over the world to record your adventure, capturing unique pets for battle, and defeat any intruders who are trying to hurt your lovely animals! Reform, upgrade and gemstone system Power up your equipment with upgrade, reform and gemstone system, with various upgrade options to suit your particular needs. Or you can craft a new equipment by easy but powerful crafting systems. Simply select materials and choose your desired special effects to make a unique equipment. Obtain various items with synthesis system Mix different materials in the synthesis furnace to obtain special items. You can develop new cooking recipes by mixing specific food and plants, make some gifts to your teammates to maintain good relationship, produce processed product via raw materials obtained in farm, or obtain a better equipment here. Various decorations at your home Free to decorate your home with various decoration options, and each of them has specific power such as increasing the success rate of crafting, upgrade, gemstone or synthesis, getting more money, EXP and so on. You can also stay at home interacting with your teammates and address their concerns. Select proper food and drink to operate your tavern Pay attention to the information forecast, select proper amount of food and drink, and manage your tavern to earn money. Bear the loss when there is over-supply of food, or make a great profit by selling all of your delicious items. Upgrade your tavern to attract more customers and obtain money to continue your adventure!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1145100/header.jpg?t=1579883859",
    "Price": 0.0,
    "Developers": "Tactic Forge",
    "Publishers": "Tactic Forge",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_b7e2022053df8b32762ff55c766f1eec2429a29b.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_1cee048d662acb41bd63c82dba58e33462022443.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_747c9c785e27024f6ba443729bc3eff545e7bfff.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_11e40bac503213a09d8a54d0100f746b8f9a4487.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_ef97e52dcb9375c00af98a9f8fa536521acd3326.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_2e54c3456d106bc1f9c913cbdd3d6323f8f00ffa.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_941e69401a984004ee785efba3e3d435d3d8810f.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_2576944209336be6a71f5e9a42aa54e63b7fd773.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_f87e9396b015804258d75a3d78e92147ac3a33cc.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_6456a8438cd5a8a18981a133e66c75a9077944f0.1920x1080.jpg?t=1579883859,https://cdn.akamai.steamstatic.com/steam/apps/1145100/ss_5cf7ee5433dad771e529e9a79529df61957ed7dd.1920x1080.jpg?t=1579883859",
    "Slug": "singaria-prologue",
    "Meta Title": "Singaria - Prologue: Jan 24, 2020, Tactic Forge and Full ...",
    "Meta Description": "Looking for information on Singaria - Prologue? Check out the release date (Jan 24, 2020), developer insights from Tactic Forge, and a complete game sum...",
    "Alt Text Image": "Official header image for Singaria - Prologue game - Steam 1145100",
    "Canonical URL": "https://gusku.site/game/singaria-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Singaria - Prologue\", \"description\": \"Looking for information on Singaria - Prologue? Check out the release date (Jan 24, 2020), developer insights from Tactic Forge, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tactic Forge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tactic Forge\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1145100/header.jpg?t=1579883859\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}