{
    "AppID": 1264280,
    "Name": "Slipways",
    "Release date": "Jun 3, 2021",
    "About the game": "Slipways takes the space grand strategy genre and condenses the best parts of it down by throwing away all the micromanagement and the steep learning curve. The result is a unique blend of the strategy and puzzle genres in which you can finish a run quickly, but still have a deep experience full of tough decisions. MAKE TRADE, NOT WAR Colonize planets, carefully pick industries and hook everything up so that your planets support each other. Line everything up just right and watch your colonies evolve and grow, giving you even more options for profitable trade. Make long-term plans and bask in your own glory when that one last connection makes six planets upgrade at the same time and gives you the income you desperately need. There is no military aspect to pull your focus away from the economy. The game is more relaxed than your typical grand strategy. It's all about exploring space and its endless opportunities, shaping it to your whim and developing it to its full potential. No need for war with so much empty universe to claim. FASTER THAN LIGHT Forget about tedious micromanagement and waiting for ships to be built. In Slipways, every action you take has immediate consequences, and every choice you make is of paramount importance. Your planets govern themselves while you focus on making the right decisions to get them what they need. You'll waste none of your precious time on busywork. A single run takes 40-60 minutes and they are all filled with the good stuff. TECH IT UP A NOTCH There are no boring technologies here. Instead of making a single building 20% more efficient, technologies in Slipways let you move planets at will, harness stars for energy or colonize planets with sentient machines instead of people. The selection varies each run, so you'll have to plan carefully and adapt to the situation at hand. The path you choose will profoundly change your experience and the way you look at the game's planets and resources. ...ONE MORE GAME? When a single run takes no more than an hour, what you need is replayability. Almost everything in Slipways is procedurally generated and each sector of the galaxy offers wildly different challenges. To overcome these challenges, you'll enlist the help of the five races populating the empire, each with their own philosophical outlook, varied abilities and a dedicated slice of the technology tree. There are more than 80 technologies to choose from and you'll only be using about 10 of them each run. No two games are ever exactly alike. PLAY IT YOUR WAY The standard gameplay mode gives you 25 years to build the best empire you can, but there is more: a sandbox endless mode that allows you to experiment freely, and a ranked mode that lets you measure your skills against others around the world on pre-seeded maps. The game also features a campaign mode with 13 scenarios, each of them introducing a new twist and refreshing the gameplay: from mysterious, ancient structures from the dawn of the galaxy to strange spacetime rifts splitting the galaxy in two. Once unlocked by playing the campaign, the new mechanics can also be used in other modes, becoming new options for even more varied runs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1264280/header.jpg?t=1656416217",
    "Price": 16.99,
    "Developers": "Beetlewing",
    "Publishers": "Beetlewing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_9353caaf7c8af2f854b5e310665b22525929824f.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_2b3cbf64869e936e3801d78dea548e1fe34af228.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_02f808d95d49ab1c94f1b642fe9f35fc5fe5351e.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_0ca94aa200ae86ad543cf70c04ea610c11305110.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_ac5e8d4d2613a551295981d27077f32df67c49fc.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_3c829ada6e050ec89b8b774bb4428d47b046d680.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_e7be2897f3445faff5871fdb38f3f6af50a8be04.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_1eb54540425c26e534b899528be6409bcae882eb.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_b9b09762bcee1e87a98b3f5ce29dfcd5502ca80a.1920x1080.jpg?t=1656416217,https://cdn.akamai.steamstatic.com/steam/apps/1264280/ss_5554de9e738a484398b0fdb8b2b61201fba65ab1.1920x1080.jpg?t=1656416217",
    "Slug": "slipways",
    "Meta Title": "Slipways: Jun 3, 2021, Beetlewing and Full Overview",
    "Meta Description": "Looking for information on Slipways? Check out the release date (Jun 3, 2021), developer insights from Beetlewing, and a complete game summary.",
    "Alt Text Image": "Official header image for Slipways game - Steam 1264280",
    "Canonical URL": "https://gusku.site/game/slipways",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slipways\", \"description\": \"Looking for information on Slipways? Check out the release date (Jun 3, 2021), developer insights from Beetlewing, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beetlewing\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beetlewing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1264280/header.jpg?t=1656416217\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}