{
    "AppID": 444970,
    "Name": "SPATIAL SOUND CARD",
    "Release date": "Mar 13, 2016",
    "About the game": "The Spatial Sound Card (SSC) software is a so-called binaural audio application for headphones by New Audio Technology. Applications are audio and video production, playing games, watching film, listening music, and VR/360. Binaural audio simulates on regular stereo headphones the psychoacoustical phenomena our brain uses in reality, to localize audio sources around us and detect the size and kind of the room environment where we're in. These psychoacoustical phenomena are called HRTF = head-related transfer functions. Using these HRTFs, the SSC provides stereo and surround sound on virtual loudspeaker systems for any computer using regular headphones, also giving the choice between stereo and surround sound 5.1, 6.1 and, 7.1. Adapted from New Audio Technology’s professional production line, it is a software-based, virtual sound card. It works as the standard audio device of your computer between all stereo and surround audio playback applications and your audio hardware. These include games and media players like iTunes, Netflix and VLC as well as the main output of your operating system. Thus, the SSC is highly recommended not only for gamers but also for movie enthusiasts, music lovers, and for 360 / VR applications. Different from other applications, the SSC doesn't do so-called up-mixing or fake-surround processing what means to playback a stereo source on 5.1 or 7.1 anyway. It provides straight away a natural and emotional listening experience of stereo and surround sound with a v ery precise positional audio reproduction . Just set the SSC e.g. to 5.1 and hear your sources via the related loudspeaker configuration like stereo and 5.1. The loudspeaker virtualizations are taken from high-end music studios, film mixing stages, and unechoed chambers. The technology of the SSC has been used on Blu-ray releases of well-known Hollywood blockbusters for more than 20 years! To customize the virtualizations to your preferences, the SSC provides a lot of adjustable parameters like the room reflections of the virtual sound studios and the frequency response curve of the headphones you use. Profiles for some well-known headphone models are included*. Please keep in mind… Windows sometimes struggle while dealing with audio drivers. Also, driver communication with external audio devices like Digital Audio Converter (DACs) or PCI sound cards can be tricky. If you want to use such a device, please check it in the 2h refund period Steam offers before purchasing and/or post bad reviews . We’re always willing to help you asap, just post us a request. It’s often a setting issue and the user manual offers a lot of workarounds which finally can help to let your SSC run pretty well. BTW… If you like the application, we like to ask you for a quick good review/vote because satisfied users often forget to tick the thumb up button;) This will help newly interested visitors to trust the application generally. Thanks in advance, Your New Audio Technology Team *Headphone models: Austrian Audio HI-X50/55/ PG16, AKG K 313 earbuds, AKG K 701, Beyerdynamic DT 770 M, Beyerdynamic DT 880 Pro, Dr. Dre Beats Pro, iPhone earbuds, Koss Porta Pro, Sennheiser HD 555, Sennheiser HD 600, HD 800, Sony MRD-F1, Denon, Neumann Dali etc..",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/444970/header.jpg?t=1637846244",
    "Price": 9.99,
    "Developers": "NEW AUDIO TECHNOLOGY",
    "Publishers": "NEW AUDIO TECHNOLOGY",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_3c193a0ac9c87a6205f4a2832062b4c026d79abe.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_53a2e27b595a4a034e22a872b7dd14c4456fa264.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_48fa7246d71492f8b03b218c1f8ccb3f4765ebd5.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_d06ffe3c34212e410684a9996efb3d0f812f57ea.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_16bf67258938c62d56fe7fe5fa5d3b64b14809ff.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_9d1eaa581a90cff860e734ee90e98cc0729d0890.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_f3f6ad8e38f5904b6f6aae14a58b5adea05473ea.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_7d17af0f0d9f8e3d1b4393f318ffcf4858380b14.1920x1080.jpg?t=1637846244,https://cdn.akamai.steamstatic.com/steam/apps/444970/ss_7e124e96e101522e66874aa3f3b4f7e811e7ab04.1920x1080.jpg?t=1637846244",
    "Slug": "spatial-sound-card",
    "Meta Title": "SPATIAL SOUND CARD: Mar 13, 2016, NEW AUDIO TECHNOLOGY an...",
    "Meta Description": "Looking for information on SPATIAL SOUND CARD? Check out the release date (Mar 13, 2016), developer insights from NEW AUDIO TECHNOLOGY, and a complete g...",
    "Alt Text Image": "Official header image for SPATIAL SOUND CARD game - Steam 444970",
    "Canonical URL": "https://gusku.site/game/spatial-sound-card",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SPATIAL SOUND CARD\", \"description\": \"Looking for information on SPATIAL SOUND CARD? Check out the release date (Mar 13, 2016), developer insights from NEW AUDIO TECHNOLOGY, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 13, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"NEW AUDIO TECHNOLOGY\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NEW AUDIO TECHNOLOGY\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/444970/header.jpg?t=1637846244\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}