{
    "AppID": 1380220,
    "Name": "Starsand",
    "Release date": "Nov 4, 2021",
    "About the game": "Your day started as planned. Motivated and full of ambition you started the run of your life, in the middle of the desert, surrounded by like-minded people. The months of hard training should finally bear fruit. Suddenly, you were caught in a monstrous sandstorm and now you find yourself alone in an inhospitable, hot environment. Deserted and merciless, an ocean of sand stretches to the horizon. You feel the scorching heat on your skin, sand blowing right at your face, far and wide only vast desert ... but wait, what is that? Something is moving in the far distance. What happened? Your first thought: Survival. Your second thought: Rescue will surely come. The bitter realization: No one will come, you are completely on your own. The big question: Where are you and why are there two moons in the night sky? Find shade, find water, find life. Use your energy wisely, avoid too much effort in the heat, keep warm in the coldest nights. You must keep your wits to survive. Starsand is THE desert survival game. Dangers, mysteries, and puzzles await you! Find out what exactly happened, where you are and what connects you to the history of an extinct civilization. Will you manage to survive in the inhospitable environment, find answers and find your way back to your old life? Hunt for food, make weapons, build a shelter. Secure your shelter - the dunes are teeming with scary creatures. Find your way in the vast and lonely desert, orient yourself in sandstorms and mark your path. Thirst and heat become an invincible enemy during the day - cold endangers you during the night. Learn to live with adversity, see the beauty that the world holds, and learn from the animals and nature! In this desert you are both a hunter and prey. Insect-like predators come out of their dark nests, always looking for food. Protect yourself with fire, blow up enemies with explosive coconut grenades, secure your base and do whatever it takes to survive. We, Tunnel Vision Studio, are a small creative team ready to conquer the world with RAM sticks, dressed in GPU-coated armor and wearing a VR visor as a helmet. We are a handful of brave geeks based in Rome, not ready to give in to the temptations of countries with fiber broadband and unhealthy food. We make a living doing what we love: everything related to virtual reality and video games. Features: Large open game world in an exciting desert setting with an area of over 64 km². The lovingly designed world, far away from civilization, holds many impressive monuments, artifacts, and creatures of the past, as well as modern times. Survival action par excellence! Weather and desert capers as well as terrestrial and extra-terrestrial enemies awaken the pure survival instinct! Gather, build, secure - for protection against heat, cold, and the unknown enemy. Dynamic weather and day/night changes demand good planning, wise action, and a large portion of courage, especially in the desert. A mystical, thrilling story and the solving of numerous puzzles answer many open questions during the exciting journey into the unknown.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1380220/header.jpg?t=1658746162",
    "Price": 19.99,
    "Developers": "Tunnel Vision Studio",
    "Publishers": "Toplitz Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_af5a70f1a5c9a074200b62215dbcb184f110e209.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_179f810ce201f9a3cbe7cd74ad63b6c6fd46886b.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_ded68e0c31342fc02985e4cfd1335a960b9c4467.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_45be47f6ec7d8efd6101ef81fe2dc894a48cfef9.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_2d31ddfd1a8c28928b4a84e24376e4a1fa8af0d5.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_b0f09ba645d2c8b07311dd585e84e6ddee7374a8.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_6761e5ecd76ef98ca56797c871e672c8f7743b14.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_57f03db8dbb1fa6e3d4b212cc6804659eccff7e8.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_327b62a2c57719ed81d4879a5707bba28c5951e8.1920x1080.jpg?t=1658746162,https://cdn.akamai.steamstatic.com/steam/apps/1380220/ss_f2fae8b380e06f06c30e88133c9c8140ed2dab6d.1920x1080.jpg?t=1658746162",
    "Slug": "starsand",
    "Meta Title": "Starsand: Nov 4, 2021, Tunnel Vision Studio and Full Over...",
    "Meta Description": "Looking for information on Starsand? Check out the release date (Nov 4, 2021), developer insights from Tunnel Vision Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Starsand game - Steam 1380220",
    "Canonical URL": "https://gusku.site/game/starsand",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Starsand\", \"description\": \"Looking for information on Starsand? Check out the release date (Nov 4, 2021), developer insights from Tunnel Vision Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tunnel Vision Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Toplitz Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1380220/header.jpg?t=1658746162\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}