{
    "AppID": 1861230,
    "Name": "TAISHO x ALICE: HEADS & TAILS",
    "Release date": "Jul 26, 2022",
    "About the game": "There are two sides to every fairytale... Like a coin, TAISHO x ALICE has two sides: the real world and the Looking-Glass World. HEADS: Enjoy the happily ever afterstories with Cinderella and the gang in the topsy-turvy Looking-Glass World! TAILS: Join Woolfe and Ryoushi to explore the greater mystery of the events that took place in the real world! Without darkness, there can be no light... It's time to take a peek behind the curtain in TAISHO x ALICE: HEADS &amp; TAILS! This is a visual novel. As you progress through the story, you will be asked to make choices at key points that will lead you to different endings. The heroine's first name (Yurika) can be changed. Some choices will have lasting repercussions, so choose wisely to reach a happy ending! *During the game, the protagonist's face will be displayed to the left of the text box. (You can disable this in the OPTIONS menu.) *'TAISHO x ALICE: HEADS &amp; TAILS' can be played as a standalone game. *It is recommended to play 'TAISHO x ALICE episode 1,2,3 and epilogue' before playing this game. [Content Warning] Please be advised that this game deals with mature themes including mental illness, violence, depictions of blood, and mild sexual language. HEADS &amp; TAILS contains routes for fan favorite side characters Woolfe and Ryoushi, as well as sugary-sweet afterstories with each of the 7 original love interests. But wait, there's more! In Arisu Academy, you'll experience a TAISHO x ALICE school AU story with the entire cast! 10 stories total for fans to enjoy, playable in any order. It all started when he enrolled at a college in the town where his grandma lived. His motive: to search for an old friend who cut contact after a fight. But even after he found him, it still wasn't really HIM... This is the story of Woolfe's life in the friendzone, doing his best for his bestie! Hailing from a long line of doctors, Ryoushi Arisu lost his place in the family the moment his younger sister was born. Years later, at a med school far, far away, as he contemplates his career path... he meets the strange little boy who will change his life forever. Seven tales that take place after the happy endings in each of the seven Looking-Glass Worlds. Now that Yurika and her beloved are finally together, what mischief will they get into next? Let's take a peek! [LOVE INTERESTS] Cinderella Red Riding Hood Kaguya Gretel Snow White Wizard Alice My name is Yurika Arisu, and I've just transferred to the esteemed Mirrorfield Academy in the middle of the school year. Here, I'll meet: -My homeroom teacher, Mr. Cinderella, the down-to-earth art instructor! -Mr. Riding Hood, the dutiful yet shy biology teacher! -Mr. Kaguya, the classical literature teacher with a charming, cheeky grin! -Gretel, a first-year with a love of sweets! -Snow White, the quiet and mysterious bookworm! -Wizard, the dependable student council president! -And lastly... the boy of my dreams, Alice! They're all handsome and special in their own ways. So who should I spend my school days chasing? It's gonna be so much fun... I can't wait!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1861230/header.jpg?t=1658894288",
    "Price": 35.99,
    "Developers": "Primula",
    "Publishers": "pencil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_16f202f81f1635547859dac1049c4e734e6ebcb8.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_cde2eb91c2c83c89166e46167693d1e86d203a5b.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_7b447e3ab042cd1e829ce57aaaf45efb94caa41c.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_3a38f508e483070403fa310cda2930404cb3b8b7.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_621205ab70e7f7e366a05256277336b9fbd5023b.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_d334648872b89730cd8fc3cf2f28da30ac0900b9.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_45e88eb882eaa6b2e63c8572bf19717fb4c6678c.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_877171b72c0f6d62e8999d1d416014e5aa020776.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_a2334518a15db5aef6d952276d68b5388e7f1535.1920x1080.jpg?t=1658894288,https://cdn.akamai.steamstatic.com/steam/apps/1861230/ss_674d2a42916e6e73577d8610ab836a5ab660ff5f.1920x1080.jpg?t=1658894288",
    "Slug": "taisho-x-alice-heads-tails",
    "Meta Title": "TAISHO x ALICE: HEADS & TAILS: Jul 26, 2022, Primula and ...",
    "Meta Description": "Looking for information on TAISHO x ALICE: HEADS & TAILS? Check out the release date (Jul 26, 2022), developer insights from Primula, and a complete gam...",
    "Alt Text Image": "Official header image for TAISHO x ALICE: HEADS & TAILS game - Steam 1861230",
    "Canonical URL": "https://gusku.site/game/taisho-x-alice-heads-tails",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TAISHO x ALICE: HEADS & TAILS\", \"description\": \"Looking for information on TAISHO x ALICE: HEADS & TAILS? Check out the release date (Jul 26, 2022), developer insights from Primula, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Primula\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"pencil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1861230/header.jpg?t=1658894288\", \"offers\": {\"@type\": \"Offer\", \"price\": 35.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}