{
    "AppID": 1273520,
    "Name": "The Last Day Defense VR",
    "Release date": "Jun 3, 2020",
    "About the game": "You find yourself in the middle of the persistent military conflict between two cosmic empires – both of them come from the Earth, both of them conduct R&amp;D on time manipulation, and both are equally powerful in synthesizing necessary materials from any other ones by means of energy – the main source of the future civilizations. This struggle is ongoing for several centuries… but the enemy goes for a desperate and dangerous move – changing the course of history… …They send their crew and a massive replicator (which can produce a diverse weapon, equipment, and machines out of nothing) to the past of the Earth, the cradle of civilization, to wipe out our ancestors and win the war in this dirty way. Can you let this happen? When the attack starts and our reality begins to collapse, the scientists find the turning point and send the temporal ship to prevent the disaster. You're on board! Try your hand at being a temporal agent: challenge your brain by building defensive structures, destroy the enemy equipment, and give thought to the victory strategy, using a map of battles, a replicator, and the limited energy supply, which your team has managed to throw back to the past. Use your brain and fighting skills to survive and save the whole empire from erasing. Key Features: * Difficulty levels. Do you want to relax and admire the scenery? Or are you ready to take up our challenge on maximum difficulty?* It’s up to you. * Game levels, made with a love of details. You will like to examine them! * Weather effects at levels designed to emphasize and complement their atmosphere. * Different sizes of levels. From small training levels to truly huge and complex ones. * Time for completing one level is comfortable for VR. You won’t have time to get tired. * 25 game levels. * 12 towers are divided into 3 branches. Each of them has its strengths and weaknesses. Explore them and use wisely! * 3 branches of modules for improving towers, 3 levels in each. Improve the characteristics of the towers when the operational situation requires. * The landscape that affects the gameplay. Consider it and combine it with features of the towers. * Sale of towers. Commission – 50%. * 32 various enemy units. * Ranks of units. It’s easy to kill a newbie, but try to cope with a veteran! * A fair fight. Units can also attack your towers and disable them. * Regeneration of units. Some of them will cause more troubles than others. Better kill them right away. * Combinations of towers. Competent planning, teamwork, and no magic! * A variety of waves of units. Have you built an impenetrable line of defense? We will be able to surprise you!** * Control the speed of the game process. From the spectacular slow motion mode to 4x when re-completing. The “Moment Stop” mode as a gift. * The scale of miniature battles. An unexpected combination and a unique experience of full dive in VR. * Just play the way you like it. We did everything for a comfortable game sitting, standing, and playing in a large play area. Dynamic adaptation of the height of the menu, the manual change of the height of the table, precise mechanics of movement, and even a turn of the world. * Configure the game to suit your needs. We’ve collected many reviews and tried to give you the opportunity to customize the gameplay in the way that is convenient for you. Just go to the settings menu. * A global rating table. Can you get into the Top 10? And in the Top 3? * Achievements. Everyone loves to get them ;) Notes: * – The use of the maximum difficulty level can lead to irreversible damage to the controllers, helmet, monitor, as well as any interior design items that were at hand, on average after the 18th unsuccessful attempt to complete the level. ** – Use the maximum difficulty level only to get high-octane thrills. (also playable on Oculus Rift)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1273520/header.jpg?t=1619805548",
    "Price": 9.99,
    "Developers": "ARVI VR INC",
    "Publishers": "ARVI VR INC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_e5c3d9bb2cb7497b374d144c3f438a715ecae1d3.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_6c9437212507cbd764b3a1d58a6c0ffed45e3032.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_8e3134c659e78b3947eae73eac13d8c81cb5df47.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_fd58856c81c2247edb726916f8cb8b0417c7ef64.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_1fa4fb0eb1b9481b524173410db4e640b79abfdf.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_e9963d446d98e5b9d5795585ad019fe616a21348.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_4154ba31b4adce77f405afd28d82b674a0d4f464.1920x1080.jpg?t=1619805548,https://cdn.akamai.steamstatic.com/steam/apps/1273520/ss_8490353dfb2354d7b6318beba96a74cc09297f99.1920x1080.jpg?t=1619805548",
    "Slug": "the-last-day-defense-vr",
    "Meta Title": "The Last Day Defense VR: Jun 3, 2020, ARVI VR INC and Ful...",
    "Meta Description": "Looking for information on The Last Day Defense VR? Check out the release date (Jun 3, 2020), developer insights from ARVI VR INC, and a complete game s...",
    "Alt Text Image": "Official header image for The Last Day Defense VR game - Steam 1273520",
    "Canonical URL": "https://gusku.site/game/the-last-day-defense-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Day Defense VR\", \"description\": \"Looking for information on The Last Day Defense VR? Check out the release date (Jun 3, 2020), developer insights from ARVI VR INC, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ARVI VR INC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ARVI VR INC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1273520/header.jpg?t=1619805548\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}