{
    "AppID": 1668720,
    "Name": "The Cloud Dream of the Nine",
    "Release date": "Dec 20, 2021",
    "About the game": "[About the game] ‘The Cloud Dream of the Nine’ is an Otome visual novel, the story of which is based on the classic novel of the same name written by Kim Man-joong but the gender of the characters are reversed in the story. The vast love story of one female character with nine male characters Your choice changes his fate and creates a new ending. As you proceed with the story, you encounter many hardships and you get to make many choices. The fate of the target is determined by what choice you make at the key points that will lead to different endings. Mini games are arranged to relax in the story, providing a play that is not boring. The voices of the target characters are provided in full Korean voice, and additional contents can be obtained after you clear the characters. [Main Features] n  Vast amounts of stories - It has vast amounts of stories with 850,000 characters (about 6 novels) - Each character has its own story. - It takes about 50 hours. n  A variety of target characters and routes - 9 charming male characters who you can target - The ending of the character depends on your choice n  Special clear reward - A special voice drama of 1 hour when you clear a character under certain conditions - A 40,000-character side story which you can get after clearing all the scenarios. n  Lots of CGs - 200 CGs that you can see while proceeding with the stories. - Reorganized CGs that were hard to find on PC and mobile. n  New target character, Hongyeom - Hongyeom's target route added from the existing 8 characters n  New stories - The newly added spin-off stories - Daily life stories of the female character and 3 male characters. - Voice, CG, OST of male characters added with the stories [Storyline] Yang Soyu, a girl living in a village in Hwaju Castle of State of Cheonin. Her father is the Fairy God from Mt. Gonryun and he left for the fairy world when his connection with the human world came to an end after the death of his wife, also Soyu’s mother. The villagers do not believe Soyu's words that her father is the Fairy God, and make fun of her as a liar, making her a loner. It was only Chaeyoon, her childhood friend and also like her family, who understood and trusted her. Ten years since then... A warm sunny day. Two people who spend a pleasant time writing poems under the shade of willow trees along the gently flowing river. A daily life where everything is pleasant and peaceful as if the complex and noisy reality are cut off. One day, when the moment seemed eternal, another world unfolds in front of the girl's eyes with a single scream in the hot flames of fire. Chaeyoon cv. Choi Jihun I want to be the closest person to you. From the beginning to the end of your life... He is the only friend, almost like family of Soyu. As his father left for the fairy world leaving Soyu, he has always cared for Soyu like his family. When Chaeyoon’s father, the deputy of the lord of Hwaju Castle was involved in a conspiracy, he suddenly disappeared and Soyu leaves a long way to find him. Wol cv. Lee Hosan Why don't you just lean on my arms? You can slap me on the face if you don’t like… No.1 playboy whose name is well-known not only in State of Cheonin, but also to other countries. He is the son of the lord of Nakyang, the best city in State of Cheonin, and the half-brother of Baeknan. He was expected to be the next lord, but one day, he quit his job as a government post and began to live a fast life. No one knows why he suddenly changed. Kyungwon cv. Um Sanghyun Hey, ugly! I told you not to smile like that! What if other guys fall in love? The youngest son of the family of Prime Minister Jung, one of the most prestigious families in State of Cheonin. At the age of 13, he passed the state examination, but according to his grandfather's will, who opposes going to office at a young age, he is bored to death doing nothing in the house. Still, as he is considered one of the best bridegroom in Jangan because of his outstanding appearance, family background, and ability, women are crowded in front of Prime Minister Jung’s house. Chungwoon cv. Kim Sangbaek The most meaningful thing for me now is to love you and protect you. He is an upright and disciplined man with the height of a bamboo tree and is from the military family that has been protecting the royal family of State of Cheonin from generation to generation dedicating its loyalty. He is guarding Soha, Prince Nanyang who is trapped in a separate palace in the name of an escort warrior under the command of King Cho. As a close friend of Kyungwon, he became quiet and clumsy in expressing his feelings because Kyungwon said everything instead of him. Baeknan cv. Shim Gyuhyuk You're the prettiest in the world. I fell in love at first sight. Born by the legal wife of lord of Nakyang Castle, he is the youngest son of the family and a half-brother of Wol. Perhaps because he grew up possessing exclusive love and interest from people, his personality is so cheerful and innocent. However, another aspect of him that doesn’t show outwardly is hidden and only known to some. Unlike Wol, who has a poor reputation, he is called the 'Jewel of Nakyang' by Nakyang’s residents, and his existence itself is comfort and joy. Soha cv. Oh Byeongjo. Don't think about getting away from me. Because even your soul is mine. He is the only child of the late king and is called Prince Nanyang. Ten years ago, after the sudden death of the late King, he lost everything and resigned from the prince’s position after his uncle ascended to the throne. Ten years after being trapped in a separate palace, his paused life begins again when he meets a girl who sticks to the job of finding her friend. Simyeon, cv. Jang Minhyuk It's not your fault. Don't cry because I don't regret anything. A man who was bumped into on the street of Hwaju Castle. Only cold energy is felt by the wounds in the eyes, the expressionless face, and the short words. No one can tell who he is, who suddenly disappeared with fluttering long black hair. Haerang cv. Shin Yongwoo. Your smile is the prettiest. Please keep smiling like that. The man who saved Soyu from drowning on the day of the chaos in Hwaju Castle. He is the Dragon King who manages the East Sea. Hongyeom cv. Wie Hun. Try your best. A man who was bumped into while looking for Chaeyoon. He seems to be bored of everything with an indifferent tone of voice, but there’s something hidden by the way he speaks and behaves.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1668720/header.jpg?t=1649036186",
    "Price": 19.99,
    "Developers": "Sesisoft",
    "Publishers": "Sesisoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_d0e51e41966ae6a4574477413080e86bcfb951ce.1920x1080.jpg?t=1649036186,https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_b8f27cfec180fd94f64ecb1e02ead1474a828c66.1920x1080.jpg?t=1649036186,https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_678edee689b357aae0c9860649f834f5cbe216c3.1920x1080.jpg?t=1649036186,https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_db776e7f728627ed6fe8d676939f4bf1fbb8d367.1920x1080.jpg?t=1649036186,https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_1d19bd5664fa8eab22f3a6525cb7e048b9a27a0e.1920x1080.jpg?t=1649036186,https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_319b34c5ca14385e7f92c6d38d5b84d88a172d41.1920x1080.jpg?t=1649036186,https://cdn.akamai.steamstatic.com/steam/apps/1668720/ss_7ff01bc4b18d8a7a4a6257463325aa572e95f537.1920x1080.jpg?t=1649036186",
    "Slug": "the-cloud-dream-of-the-nine",
    "Meta Title": "The Cloud Dream of the Nine: Dec 20, 2021, Sesisoft and F...",
    "Meta Description": "Looking for information on The Cloud Dream of the Nine? Check out the release date (Dec 20, 2021), developer insights from Sesisoft, and a complete game...",
    "Alt Text Image": "Official header image for The Cloud Dream of the Nine game - Steam 1668720",
    "Canonical URL": "https://gusku.site/game/the-cloud-dream-of-the-nine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Cloud Dream of the Nine\", \"description\": \"Looking for information on The Cloud Dream of the Nine? Check out the release date (Dec 20, 2021), developer insights from Sesisoft, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sesisoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sesisoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1668720/header.jpg?t=1649036186\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}