{
    "AppID": 313630,
    "Name": "The Solus Project",
    "Release date": "Jun 7, 2016",
    "About the game": "A single player exploration driven adventure with survival elements, set on a mysterious and seemingly uninhabited alien planet. Survive through exploration, and unlock the mysteries of Gliese-6143-C. From the creators of 'Unmechanical' and successor to 'The Ball'. Earth has been destroyed and mankind lingers on in a small fleet of ships near Pluto. As humanity's last hope, you are sent to scout a distant planet as a potential location for a colony. After years of space travel disaster strikes however, and your ship is destroyed when approaching the planet... With your team members dead and your equipment gone you have no way of communicating or receiving help from anyone... you are completely and utterly alone... Desperately you look for a way of phoning home, but as you explore the seemingly desolate planet, you uncover the dark secrets buried within the depths. In this otherworldly odyssey you uncover mystery upon mystery as you try to survive the harsh climate. FEATURES Explore - Unlock the depths of the uncharted planet, and discover the secrets buried deep below. Delve into huge cave systems and tombs and uncover over 200 secrets. Handcrafted - 10 large entirely handcrafted levels to explore. Explore and puzzle your way through 5 islands and 5 large tombs/caves. Atmosphere - Atmosphere rich environment that is fully dynamic. An alien day and night cycle and a dynamic weather system that calculates everything from temperature, wind, humidity, cloud coverage impact on the climate and so on. It handles ocean tides. Plants respond to the climate. Storms form. Earthquakes happen. Survive - Survive the extreme climate, tornadoes, storms, meteors, lightning, and not least the dark secrets buried beneath the surface. VR - Supports Vive and Oculus, including room space and motion controllers. Explore the huge world start to end in VR! (*Some VR features are still in development - see notes at the bottom for info) FEATURES CONTINUED Depth - Plants grow and rot. Ocean tide based on the moon. Your body responds to everything from getting wet to lack of sleep to walking uphill to the humidity. Hundreds of upgrades to be found. Secret areas within secret areas within secret areas. Savior - Your death means the end of mankind. Save us and rebuild a communication device to phone home, by scavenging useful items. Adventure - Be a pioneer, an archaeologist, and an astronaut to explore a mysterious alien planet. The adventure has a beginning and an end, but it is a harsh world. A mistake will cost you your life. GAMEPLAY Linear - The game has a start and end. It is a singleplayer adventure with 10 large levels. Your Time - Scale the game as you wish. Go from a super hardcore experience to a relaxing stroll on an alien planet. In fact you can cheat old school console style even. It is your time, your experience. Just You - Little hand holding. No obvious enemies. It is just you. All alone by yourself. Old school - Fond memories of games from 10, 20 years ago? So do we. Complex level layouts. Dozens of secret areas. Keys to unlock doors. Underground environments. A ~ key to open the game console. Exploration - There are hundreds and hundreds of things to find hidden away in the world. Secret areas the size of modern 'next gen levels'. Just how deep does the rabbit hole go? Puzzles - Puzzle your way through environmental puzzles left by an alien civilization, like our titles Unmechanical and The Ball. THE PLANET World - Gliese-6143-C is a harsh and barren planet, covered by a vast ocean. Days are over 45C/113F, and nights under -30C/F. Archipelago - 5 islands, with a shallow sea between them and connected through a system of caves. To travel from one island to the next you must traverse these dark caverns. Wreckage - The spaceship in which you arrived crashed on arrival, and its debris is scattered across the world. Find and locate debris sites to find additional resources. Tombs - Megalithic tombs are all over. Clearly you were not the first intelligent being to have set foot on this planet. Who was here before? Where did they go? What happened? VR Vive/Oculus - Works on both. Supports Xbox controller on Oculus, and either the Xbox controller or motion controllers on Vive. Supports room scale for Vive. Keyboard and mouse is supported as well. Movement - Supports regular locomotion walking and teleporting. For rotating you can pick between room scale rotation, snapped rotation (45 degree steps), smooth rotation, or enable strafing. Movement speed can also be scaled freely. High end and huge - This is not a small VR demo or game. It is a massive 16 hour experiences with miles and miles worth of world to explore, and provided you have a powerful machine (980 and up) you can experience it with some of the most ambitious high end graphics tried in VR to date. TSP is not a pure VR game. It was designed for non-VR gameplay and thus a VR headset is in no way required to play the game. If you do have one, it is an awesome (but different) experience! VR is work in progress - Currently not implemented: VR Loading screens and Oculus Touch. The intro tutorial is also a bit rough. Everything else works solidly. TSP received a major VR patch July 20 2016 adding VR inventory and crafting among many other fixes, and another one on December 4 2016 adding the Explorer Diary and a range of fixes. ABOUT US The Solus Project is the brainchild of Sjoerd 'Hourences' De Jong. As a one-man army he crafted the vision for the game and a large part of the game's looks. Sjoerd has over 12 years of experience in the industry and has worked for a range of large and small studios such as Starbreeze, Epic Games, Guerrilla Games, Digital Extremes, and many more. The game has been in production since July 2013, and has a team of 5 to 10 people working on it. Teotl is a small indie studio that was founded in 2010 and is located in Sweden. It released The Ball on PC in 2010 and followed up with Unmechanical Unmechanical on PC and iOS/Android in 2012. The studio focuses on creating high quality and immersive single player experiences. The Ball won the PC Gamer USA Action / Adventure Game of the Year 2010 award. Grip Digital is a privately owned developer and publisher of games for consoles and high-end portable devices, based in Prague, Czech Republic. The company was started by industry veterans who worked on games across all major platforms. Grip Games is working with the top independent developers to bring their games to console platforms.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/313630/header.jpg?t=1480876448",
    "Price": 19.99,
    "Developers": "Hourences,Grip Games",
    "Publishers": "Teotl Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_8d4cb82f736634e5074704c2c1bb5e5eebb14e8a.1920x1080.jpg?t=1480876448,https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_3115a59833ec755a639adbdad13d33947ba4a335.1920x1080.jpg?t=1480876448,https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_a9f8ab5b343ffd25a993952c4bf82e3859c02c86.1920x1080.jpg?t=1480876448,https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_f19a592953cb9aa3df34895eda66853eacf9c77c.1920x1080.jpg?t=1480876448,https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_503d356c1c28813647ee50fc9e91f70fcd06f892.1920x1080.jpg?t=1480876448,https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_a0a4c7d1ac1df220726c3023f46348c5fbdb1cb8.1920x1080.jpg?t=1480876448,https://cdn.akamai.steamstatic.com/steam/apps/313630/ss_9f02f4ec322bfdf77287cfa045e87d45ea7c344c.1920x1080.jpg?t=1480876448",
    "Slug": "the-solus-project",
    "Meta Title": "The Solus Project: Jun 7, 2016, Hourences,Grip Games and ...",
    "Meta Description": "Looking for information on The Solus Project? Check out the release date (Jun 7, 2016), developer insights from Hourences,Grip Games, and a complete gam...",
    "Alt Text Image": "Official header image for The Solus Project game - Steam 313630",
    "Canonical URL": "https://gusku.site/game/the-solus-project",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Solus Project\", \"description\": \"Looking for information on The Solus Project? Check out the release date (Jun 7, 2016), developer insights from Hourences,Grip Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hourences,Grip Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Teotl Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/313630/header.jpg?t=1480876448\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}