{
    "AppID": 1195530,
    "Name": "The Tawashi",
    "Release date": "Jan 21, 2020",
    "About the game": "- What kind of game is it? A game where you evade enemy bullets whilst shooting them down. Don't think, just evade and shoot! - Controls Smartphone: Move: Tap and slide Attack: Tap Precision control: Slowly slide Pause: Tap with 2 fingers Horizontal feed: None Vertical feed: tap and slide Gamepad: Move: Left joystick Attack: Button 1 (A) Precision control: Button 2 (B) + direction Pause: Menu button Horizontal feed: Button L/R Vertical feed: Right joystick Keyboard: Move: [W] [A] [S] [D] Attack: [Z] [SPACE] [CTRL] Precision control: [X] or [SHIFT] + direction Pause: [ESC] Horizontal feed: [Q] [E] Vertical feed: [PageUp] [PageDown] You can also use the arrow keys or numeric pad for keyboard controls. Disable NumLock to use the numeric pad. Failing to do so will prevent the game from stopping. The game is best experienced using a Bluetooth-connected gamepad. Select the 'Gamepad' icon on the settings screen when using a gamepad. However, the compatibility of gamepads may affect the controls of the game. If this occurs, please use another method of control. - Gameplay Select a stage and difficulty. Use the directional controls to avoid enemy bullets, and shoot down enemies using the attack button. Collect your friends to boost your score, and shoot at present boxes to switch to better weapons every now and then. When you see a flash on the ground, dig up the treasure, and if you get bombarded with enemy shots then use your precisions controls to slowly dodge them. Don't forget to 'pause' if you get tired. It might sound difficult, but you'll get the hang of it as you play. - Game rules Getting hit by enemy bullets reduces your HP. You lose 1 life when you run out of HP, and the game ends once you've lost all your lives. Complete a stage by defeating a boss before you lose all of your lives! Bumping into an enemy will not reduce your HP, but you may get knocked back or paralyzed. - Stages You can select the next stage once you have cleared a stage. There are 5 stages in total! Can you clear all the stages? Cleared stages and proceeding unlocked stage are always available to play, so you can constantly play stages you're good at or practice difficult ones at your leisure. - Power-ups Collect the weapons that appear when you destroy present boxes! They change the bullets shot from your character. Choose from various weapons to suit the situation. Some strong enemies can be easily defeated by switching weapons. Just a quick heads up - all weapons are disposable. - Difficulty There are 5 difficult levels: Easy, Light, Normal, Hard, and Impossible. Select a difficulty level that suits you at the Start Stage screen. Try playing on 'Easy' or 'Light' if you're new to these kinds of games. If you're a veteran to this scene, then choose 'Hard' or 'Impossible' and aim for a high score! The harder the difficulty, the higher your possible score. - Treasure Collecting various treasures in the game will increase your number of extra lives at the start of the game. When you collect 50/100/200/300/400/450/ALL different types of treasures, you will gain 1 extra life. (Note: collecting multiples of the same type of treasure does not count) The more extra lives you have, the easier it is to clear a stage. Try dropping the difficulty to collect more treasures if you're having trouble avoiding bullets. Each stage features different treasures, so play through different ones to collect more of them. - Any bombs? No, nothing like that. - What about 1UPs? Nope. Nothing. Collecting various different treasures will increase the number of lives you start with. - Any HP recovery? Your HP is recovered when you clear a stage.You can do it! - What about replays? Sorry to break it to you, but no. Please use the automatic highlights recording function. Recorded videos are saved to your gallery or my videos folder. Videos are saved in GIF format, so please use compatible software to view them. Unfortunately, there is no sound-recording function.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1195530/header.jpg?t=1606291684",
    "Price": 9.99,
    "Developers": "MUTOYS",
    "Publishers": "MUTOYS",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_af083a9cd8f81ed258b14e7e7ea29f0a3c2ef78a.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_93833f2aa5cdff8cd9156c2a53f506e0f75b5b82.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_e6bdd23bad3ec3fd68eb7e9d277f4ba6a7a2ca27.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_5261edf80d886912a52af07e06a2dcca7e7d0b9e.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_a5fa723132a548f4f971fb06d00d878236563647.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_2b83f849fa6017d4259f8acb446d828dd97cba15.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_c8ebbddf633a36ad2aed13826af8b69081118a30.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_83b23a1570f10c1907f5f1aa7fcdc206c63080c8.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_aaad2dd8470f3232fd55764e5bbfffc45fcd4537.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_a568e2cff5f048bd98fdebefef18cf78efcddbf8.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_23273a1d21de91c5c6996916df69719dcd638bbe.1920x1080.jpg?t=1606291684,https://cdn.akamai.steamstatic.com/steam/apps/1195530/ss_e642ea86e68bfc67d05d52a54f2008f317cca1d8.1920x1080.jpg?t=1606291684",
    "Slug": "the-tawashi",
    "Meta Title": "The Tawashi: Jan 21, 2020, MUTOYS and Full Overview",
    "Meta Description": "Looking for information on The Tawashi? Check out the release date (Jan 21, 2020), developer insights from MUTOYS, and a complete game summary.",
    "Alt Text Image": "Official header image for The Tawashi game - Steam 1195530",
    "Canonical URL": "https://gusku.site/game/the-tawashi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Tawashi\", \"description\": \"Looking for information on The Tawashi? Check out the release date (Jan 21, 2020), developer insights from MUTOYS, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"MUTOYS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MUTOYS\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1195530/header.jpg?t=1606291684\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}