{
    "AppID": 356180,
    "Name": "Time Machine VR",
    "Release date": "May 19, 2016",
    "About the game": "*****MAJOR UPDATE***** Motion controls are now easier to use and more intuitive. Motion controls tutorial is now easier to complete, so you can get playing sooner! Added Invert-Y option to control settings for added gameplay flexibility. Improved graphics performance for reduced pixelation. Improved CPU performance. Added support for Canadian French. Added subtitles support. ABOUT THE GAME Strap on your headset and dive into the ocean to come face-to-face with aquatic ancient sea creatures brought to life by the latest developments in paleontology! SYNOPSIS Meet the titans of the prehistoric sea You are a time-travelling cadet tasked with exploring the Jurassic era and the ancient creatures that once ruled the prehistoric oceans. Use an array of advanced tech tools to track, examine, and discover scientifically accurate creatures like mosasaurs, livyatans, and megalodons. As you uncover the mysteries of the ancient past, find the connection between a prehistoric virus, the melting ice caps, and a present-day epidemic that is exterminating humankind. If you are a paleontology buff, beat the game and check out Exploration Mode, where you can revisit the oceans and unlock more about the ancient era creatures you encountered in Story Mode. STORY MODE: Unlock new knowledge about age-old creatures! Svalbard &amp; the DinoDex You begin your journey inside your mission hub, in Svalbard, Norway. It shelters your time machine and comes equipped with the DinoDex, a depository of the information you will collect from the prehistoric underwater creatures you encounter. Every time you return to Svalbard with new discoveries, upload them to the DinoDex to unlock crucial data and creatures. The Jurassic Oceans Pilot your time machine through the treacherous oceans of prehistory, where mosasaurs, livyatans, and megalodons, among others, roam the deep. Use your high-tech equipment to track, probe, and scan these beasts, extracting the information you need. Bait creatures to turn risky situations to your advantage. Freeze time and perform dangerous close-up echography and take unique live snapshots of creatures in action with Behavior Scan as you strive to fulfill your mission. EXPLORATION MODE Revisit completed levels and unlock crucial scientific information about the Jurassic-era creatures you have faced. Then, follow these clues to uncover the key to humankind’s survival. KEY FEATURES: A game about time travel, scientifically accurate prehistoric creatures, and human extinction Story Mode; Exploration Mode; Explore an immersive Jurassic underwater world; Navigate a living and dangerous ecosystem populated by mysterious creatures: mosasaurus, livyatan, megalodon, and more; An expansive on-land VR mission hub located in Svalbard, Norway; The DinoDex: upload collected data, and unlock creatures! MODERN HIGH-TECH TOOLS FOR A PREHISTORIC QUEST Time Freeze: Briefly slow down time around you, then use that moment to engage with creatures at close range; Tracker: Visibility is limited in the treacherous Jurassic oceans. Use the Tracker to locate creatures in the dark or behind rock formations; Probe: Shoot it at creatures to instantly collect genetic data about their species; Scan: Approach prehistoric creatures and use Scan to gather intelligence on specific anatomical features; Bait: The Jurassic oceans of Time Machine VR are living ecosystems, where your understanding of the dynamic food chain plays a decisive role on your ability to complete your mission. Use Bait to create situations that move the odds in your favor; Echography (Echo): Use Echo’s ultrasound technology to understand the inner workings of the beasts of the deep; Behavior Scan: Take unique live snapshots of creatures in action; Exo Scan: Take precision scans of a creature's surface to uncover hidden details that may have gone unnoticed at first glance. Report bugs at: support@weareminority.com Please refer to our Health &amp; Safety Page : -minority/health-safety-warning/",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/356180/header.jpg?t=1530232164",
    "Price": 29.99,
    "Developers": "Minority Media Inc.",
    "Publishers": "Minority Media Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/356180/ss_7ecb9b3b4723b93a2b78912f46c329cf8b30739a.1920x1080.jpg?t=1530232164,https://cdn.akamai.steamstatic.com/steam/apps/356180/ss_8069ec8a04db4b862a66e3998d1a290eedd171ae.1920x1080.jpg?t=1530232164,https://cdn.akamai.steamstatic.com/steam/apps/356180/ss_26a7fed6638e1fd695a92326e831fbe2c141f69e.1920x1080.jpg?t=1530232164,https://cdn.akamai.steamstatic.com/steam/apps/356180/ss_bcf6addc700437d8d4d54670f168364192e9b03d.1920x1080.jpg?t=1530232164,https://cdn.akamai.steamstatic.com/steam/apps/356180/ss_f6fbb6f716987a4595ad8d84a5d834b2150b01a4.1920x1080.jpg?t=1530232164,https://cdn.akamai.steamstatic.com/steam/apps/356180/ss_8439854723b5d310e5da888174770f35c5f275bf.1920x1080.jpg?t=1530232164",
    "Slug": "time-machine-vr",
    "Meta Title": "Time Machine VR: May 19, 2016, Minority Media Inc. and Fu...",
    "Meta Description": "Looking for information on Time Machine VR? Check out the release date (May 19, 2016), developer insights from Minority Media Inc., and a complete game ...",
    "Alt Text Image": "Official header image for Time Machine VR game - Steam 356180",
    "Canonical URL": "https://gusku.site/game/time-machine-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Time Machine VR\", \"description\": \"Looking for information on Time Machine VR? Check out the release date (May 19, 2016), developer insights from Minority Media Inc., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Minority Media Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Minority Media Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/356180/header.jpg?t=1530232164\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}