{
    "AppID": 1282590,
    "Name": "Train Sim World® 2",
    "Release date": "Aug 20, 2020",
    "About the game": "The evolution of train simulation! Master iconic locomotives on high-speed services, long freight hauls or precise commuter traffic, and get creative with customisation tools in this advanced sequel. Climb into the cab in Train Sim World 2. Authentically Replicated Drive high-speed inter-city German rail for the first time as you push the throttle and climb speeds in the famous DB ICE 3M out of Köln. Take on the challenge of hauling long freight across Sand Patch Grade including the Cumberland Terminal using the raw power of the CSX AC4400CW. Master the patterns and stations of the world-famous London Underground on the Bakerloo Line. All official licences, all authentically recreated – you're in the cab and in control. New Creators Club The Creators Club is the home of player customisation in Train Sim World 2. A celebration of creativity, use in-game tools to design your own unique liveries and scenarios bringing your railfan vision to life. Upload and share your creations with players from around the world in the Creators Club, where you can also browse and download other creations from the community. Find new ways to play with your favourite locomotives. Experience A New Level Of Realism The proprietary SimuGraph® vehicle dynamics engine has evolved – adding realistic adhesion physics for the first time. Feel the wheelslip and wheelslide in adverse weather and the added challenge of control on steep inclines. Optimised and upgraded visual fidelity also gives Train Sim World 2 dynamic skies and 4K support. Immerse Yourself In Simulation Get clearer information on instructions, gradient and speed profiles as you drive, including new HUD displays, clarity to the onboard safety systems, brake controls, power meter and accelerometer. A new controller scheme will give great choices on Camera and Driving modes and allows easier access from external camera mode to enter another vehicle in your consist, all while full physics and simulation are still running. Preserved Collection Your collection comes with you - You can play your Train Sim World 2020 Add-Ons in Train Sim World 2. Train Sim World has always been about your collection, your choice of Add-Ons from your favourite region, time period, diesel, electric, passenger, freight – your way. Your purchased Train Sim World 2020 Add-Ons will be available to play in Train Sim World 2. Please note: Northeast Corridor New York, Amtrak SW1000R and CSX GP40-2 are not part of Preserved Collection. Dovetail Live With Dovetail Live you can track progress and share your experiences with other players online. Use the Driver Logbook to check your progress and stats, or compare performance with friends. Take Railfan Shots in game to remember your favourite moments and show to others. And, with the new Creators Club, share your Livery Designer and Scenario Planner creations with the world. Key Features Explore famous routes with unique challenges: Bakerloo Line – First opened in 1906 Bakerloo is one of the oldest lines on the London Underground. Master the modern-day complexity of rush hour in the British capital. Schnellfahrstrecke Köln-Aachen – Step into the renowned DB BR 406 ICE 3M and drive passengers at speeds up to 250km/h as you race between Köln and Aachen on this German inter-city line. Sand Patch Grade – Enjoy epic power with the CSX AC4400CW. Haul freight across the Allegheny Mountains, battling adhesion on one of the steepest grades in the United States. Train Sim World 2 features iconic locomotives to master. The classic 1972 Mark 2 Stock on the Bakerloo Line, modern fast commuters with DB BR 406 ICE 3M and DB BR 442 ‘Talent 2’ and powerful hauliers with the AC4400CW, GP38-2 and SD40-2. Creators Club - Get creative adding a personal touch to your experience with easy to use tools. Craft custom liveries and scenarios then share them with other players in the Creators Club. New Adhesion Physics – Feel wheelslip and wheelslide in adverse weather, master moving heavy freight and keep control of your loco power on steep inclines. Dynamic Skies – Multiple cloud layers and realistic sunlight filtering means greater visual fidelity for the skies in Train Sim World 2. Journeys – Start a new Journey on any route to explore more than 24 hours of gameplay featuring scenarios, services and more to complete. Tutorials – Learn all you need to take to the rails with detailed tutorials for each locomotive. Master every switch, lever and dial. Powered by Dovetail Games’ proprietary SimuGraph® vehicle dynamics engine and Unreal Engine 4® technology. Download Size: 9.6GB",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1282590/header.jpg?t=1658302825",
    "Price": 19.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games - TSW",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_3e6f7ae741efc2e10dddb6ad1bff7785b7ceba92.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_86f35a75e2d415cea2cfa6aac4fbbfc27c26c688.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_3a59d60ebf460d9f8dc1aa282415b07b675ea0a5.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_c5359f2359eeaa976f43c519ecbe6b00dac29ec1.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_10b56033f0dbd19328c60a23b1577e9580e1afd7.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_3dce52e9547ce6c6ec05d9fe022ce963dfe78f59.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_56cb6c4b57aaefe7cd74d2aa17735a11c894436c.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_aca43fed54f85707beeeefebe98aefeecc570d7d.1920x1080.jpg?t=1658302825,https://cdn.akamai.steamstatic.com/steam/apps/1282590/ss_a5685f7cdb5d09be80e927ceba2e8494eecbd4f4.1920x1080.jpg?t=1658302825",
    "Slug": "train-sim-world-2",
    "Meta Title": "Train Sim World® 2: Aug 20, 2020, Dovetail Games and Full...",
    "Meta Description": "Looking for information on Train Sim World® 2? Check out the release date (Aug 20, 2020), developer insights from Dovetail Games, and a complete game su...",
    "Alt Text Image": "Official header image for Train Sim World® 2 game - Steam 1282590",
    "Canonical URL": "https://gusku.site/game/train-sim-world-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Train Sim World\\u00ae 2\", \"description\": \"Looking for information on Train Sim World\\u00ae 2? Check out the release date (Aug 20, 2020), developer insights from Dovetail Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games - TSW\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1282590/header.jpg?t=1658302825\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}