{
    "AppID": 458330,
    "Name": "Vilmonic",
    "Release date": "Nov 5, 2018",
    "About the game": "Vilmonic is a living virtual world . Your goal is to bring life back from the brink of extinction. Protect and breed unique pixel-art life forms whose pixels and color have meaning. Experiment with natural and artificial selection. Craft tools, construct buildings and change the environment. Uncover the secrets of the past as you dig up ancient tech and fend off the mindless haywire zombitons. Don't be fooled by the SUPER CUTE look, Vilmonic is a deep and complex ARTIFICIAL LIFE SIMULATOR! Evolving genetic code generates each creature's pixel-art body. The shape, or morphology, of each animatroid or fungol is determined by its genes. Genes control the bending of internal bones or branches . Pixels cover the bones to create the shape of the body. The shape of the body and the number of different pixels determine the physiology of the life form. Pixels and body shape determine biological function: hydration, nutrient use, movement, perception... Each life form has a metabolism that processes hydration and nutrients at a rate determined by the metabo gene. The larger the life form (the more pixels in its body), the more hydration and nutrients it will need each metabolic cycle. Surface area determines how much hydration each life form evaporates. The more wrinkled the body is, the more surface area there is. Simple graph-shaped brains create emergent behavior: fear, aggression, attraction... A simple set of rules, derived from genes, controls the behavior of each animatroid. Animatroids have external sensors ( motion/scent/water ) and internal sensors ( hunger/stress/thirst ). Animatroids' brains have attraction/repulsion relationships between these sensors. It is these relationships that determine each animatroid's behavior. Natural selection and breeding are the only way to evolve your life forms - unless you 'cheat' with genetic engineering! Your animatroids and fungols will evolve over many generations into new species. The genetic code of each life form is passed down to its offspring during reproduction, with a chance of mutation. Evolution is a slow process. To speed things up, try crafting and drinking a lot of sugary beverages. Toxic waste can also be useful (and dangerous!) It can cause drastic mutations in offspring. Export your creatures and share them with friends! fig. 1 Exported Creature Cards, don't edit that genetic code!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/458330/header.jpg?t=1587061121",
    "Price": 14.99,
    "Developers": "Bludgeonsoft",
    "Publishers": "Bludgeonsoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_adddc375ffa5814af1447296577740988dedef29.1920x1080.jpg?t=1587061121,https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_2756138c696af47fc9ed80921737cf23a9a30c4c.1920x1080.jpg?t=1587061121,https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_b1b01a6703a99f72ab87ecfa406878ce065e6ea9.1920x1080.jpg?t=1587061121,https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_8994ebc6abf75932df0c6d01268b6776ccf8ac40.1920x1080.jpg?t=1587061121,https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_1c8ffeaff028911760ec53422bb4773a5e9db0a4.1920x1080.jpg?t=1587061121,https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_30b6f24456e8f8978d4be320303cc156f9f23acc.1920x1080.jpg?t=1587061121,https://cdn.akamai.steamstatic.com/steam/apps/458330/ss_a0c2d4a9b2b94692c2bff37bac8e2e1688aa9355.1920x1080.jpg?t=1587061121",
    "Slug": "vilmonic",
    "Meta Title": "Vilmonic: Nov 5, 2018, Bludgeonsoft and Full Overview",
    "Meta Description": "Looking for information on Vilmonic? Check out the release date (Nov 5, 2018), developer insights from Bludgeonsoft, and a complete game summary.",
    "Alt Text Image": "Official header image for Vilmonic game - Steam 458330",
    "Canonical URL": "https://gusku.site/game/vilmonic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vilmonic\", \"description\": \"Looking for information on Vilmonic? Check out the release date (Nov 5, 2018), developer insights from Bludgeonsoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bludgeonsoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bludgeonsoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/458330/header.jpg?t=1587061121\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}