{
    "AppID": 294590,
    "Name": "Wars and Warriors: Joan of Arc",
    "Release date": "Sep 3, 2015",
    "About the game": "Are You Destined to Free your People from the Hands of Tyranny? The year is 1337. During this, the darkest of ages, the bubonic plague was rampant. Kingdoms rose and fell with every swift blow of the sword. The Old Continent was in a state of great upheaval, as English kings hastily attempted time and again to uphold their claim to the French throne, shaking this fragile kingdom to its very foundation. The hundred years' war had been unleashed. Relive the most intense battle scenarios of medieval Europe in this third-person 3D epic saga. Brandish your sword as you slay enemies amidst adrenaline-pumping action while you lead your troops to victory. Acquire new weaponry while you advance through eight massively gut-wrenching battle scenarios, each packed to the hilt with thousands of enemy troops to slay. Gain experience to obtain and unleash ever-more powerful combo attacks to devastate your foes. Slowly transform yourself from a single warrior into a forceful military leader as you develop and master the art of chivalry and tactical warfare. Become the greatest and most inspirational of French leaders by demonstrating your leadership abilities while commanding your legions of troops to victory. Tap into your arsenal of war machines as you relentlessly tear away at enemy forces. Play as Joan of Arc Live out the most exciting years in the life of Joan of Arc, the ultimate female warrior, in the ultimate epic battles! As you progress through her campaigns, other great military medieval leaders will join your cause and bring their own unique fighting abilities and characteristics into the fray. Fight Epic Battles Orchestrate your troops through eight massive maps featuring formidable strongholds, lavishly detailed cities and myriad landscapes, from rolling hills to thick forests and flowing rivers. Experience firsthand the sheer intensity and savage brutality of medieval castle sieges brought to life in amazing lifelike 3D. Engage in Adrenaline-pumping Action Slash and slay enemies from a thrilling third-person perspective view. Wield the sword to your advantage by executing unique combo attacks with perfect timing to devastate the enemy. Acquire New Weapons Train yourself to master new fighting techniques to unleash your full fighting capabilities, then acquire an increasingly devastating arsenal of weaponry to overwhelm your foes. Master Long-Lost Skills Demonstrate your chivalrous aptitude by mastering your timing and precision among dozens of unique attack combos. Train yourself to become the complete warrior. Strategically Command Entire Armies Valiantly marshal your troops through the thick of gut-wrenching battles and demonstrate your leadership abilities as generalissimo to your troops, country, and king. Employ Fearsome War Machines Use to your advantage the devastating war machines at hand, such as catapult, trebuchet and battering ram to tear down castle walls, vanquish enemy fortifications, and instill fear in the eyes of your enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/294590/header.jpg?t=1457036019",
    "Price": 1.74,
    "Developers": "Enlight Software Limited",
    "Publishers": "Retroism,Enlight Software Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_b9ff3f323c2953dbff68a8b42a1c174926f49df0.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_1a41f85f7343dd5d247eb98d9c7a0974b8c57fdc.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_f0ce84f87c5be2888a69fd4349fe80a84a13409e.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_04cbd28bdb7af20f6e3afec26d4f28e785d2cd91.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_164edc2c39cc028a8482beb966b172a6491f48be.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_7048279c967b43b288bc87f5fd4c5df4f236bff3.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_b9b53a331a817cdcf54980cd1d6bfc49f7fb4d56.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_30504ec73371404ea44953b6fb2cb5ff62c75d35.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_d772bdc4701a0dd08e1edea921c096c572639621.1920x1080.jpg?t=1457036019,https://cdn.akamai.steamstatic.com/steam/apps/294590/ss_e6994c1cc406d92377487a6b6b645e92bf0c8e9c.1920x1080.jpg?t=1457036019",
    "Slug": "wars-and-warriors-joan-of-arc",
    "Meta Title": "Wars and Warriors: Joan of Arc: Sep 3, 2015, Enlight Soft...",
    "Meta Description": "Looking for information on Wars and Warriors: Joan of Arc? Check out the release date (Sep 3, 2015), developer insights from Enlight Software Limited, a...",
    "Alt Text Image": "Official header image for Wars and Warriors: Joan of Arc game - Steam 294590",
    "Canonical URL": "https://gusku.site/game/wars-and-warriors-joan-of-arc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wars and Warriors: Joan of Arc\", \"description\": \"Looking for information on Wars and Warriors: Joan of Arc? Check out the release date (Sep 3, 2015), developer insights from Enlight Software Limited, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enlight Software Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Retroism,Enlight Software Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/294590/header.jpg?t=1457036019\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}