{
    "AppID": 559650,
    "Name": "Witch It",
    "Release date": "Oct 22, 2020",
    "About the game": "Witch It is a multiplayer hide &amp; seek game. Hunters are tasked with seeking hidden witches that blend in with the environment - trust no furnishing, grocery, or utensil! A Vibrant, Magical World Awaits Explore and hide within humble villages, exotic islands, and peculiar forests brimming with secrets and surprises for you to discover. Each map contains a variety of prop arrangements, keeping matches unique and exciting every time you play! Seek as a Fearless Hunter Hunters are tasked with seeking pesky witches hidden throughout the map. Mix and match an array of different tools and abilities to help detect, trap or slow down witches as well as traverse the map effortlessly! Hide as a Mischievous Witch Witches can mimic any physical object in the landscape to fool the hunters and survive. Found by a hunter? Don’t worry - use a spell to fly, disorientate, or distract them away from your hiding spot while you escape! Props, Props, Props At first glance, that book on the shelf may look innocent, but remember: witches can disguise themselves as any physical object. Glorious rewards await the most curious of witches who can find and mimic all props! Earn Rewards and Express Yourself Personalize your characters with hundreds of stylish shirts and wacky brooms. Unlock magnificent costumes from simply playing and leveling up, or try out our crafting system to forge a specific item, ingredient or rarity! A Gamemode For Everybody ★ Hide and Seek: the standard Witch It gameplay. Witches must survive the time limit before the hunters catch them! ★ Mobification: faster-paced gameplay. Eliminated witches join the hunter team! ★ Hunt a Hag: all skills and projectiles are disabled. A one-way game of tag! ★ Fill a Pot: our 2v2 competitive experience. Witches must fill cauldrons with specific props before the time runs out, or before they lose all lives! Steam Workshop Support Creative mode allows you to construct a map or prop arrangement with other players in real-time, utilising our powerful in-game map editor that doesn’t require any external software. Upload your map for the world to hide and hunt within, or download countless player-made maps from the Steam workshop! Main Features ★ Play as a hunter or witch on 15+ official maps, or browse the workshop for player-made maps and prop arrangements! ★ Choose from an assortment of unique skills to outsmart and fool your opponents! ★ Dynamic, physics-based prop movement, allowing you to freely traverse the maps and slide into that perfect hiding spot! ★ Unlock and craft hundreds of items for your character to flaunt, each with distinct rarities and caliber! ★ Level up your account to earn exclusive items and player icons! ★ Play on public servers with other experienced prop hunters, or open up your own private server and play with a group of friends! ★ Collaborate on your own maps using the creative mode, and upload them for the community to download and play! We welcome all feedback over on our Steam Forums and Discord server!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/559650/header.jpg?t=1657799993",
    "Price": 4.99,
    "Developers": "Barrel Roll Games",
    "Publishers": "Daedalic Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_50cbeb2d38254980c829aa28a6e529ba75017bca.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_d9ed5b688ca6510980716bccd0c4bf819fa4be76.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_12387e1151449c2fffa03391e2913ce426bcd4d6.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_f0d61a8ccf08150fe54ec78ff8b56148ce1b5666.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_ca81696ad1a2a8f7669fc41d5c61a944396464b9.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_d6c82aab69fb26d3e872d8f899804dfe6a7ee6bf.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_893f5eb8fa2f704746835233815fdfc67c22d8de.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_4c00f866b3d70c35452684da2ee8137364b0ed60.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_91715abee1bd5bdc5215c38c2c1a380db9b48e33.1920x1080.jpg?t=1657799993,https://cdn.akamai.steamstatic.com/steam/apps/559650/ss_4fa62c3acf0b35367e58f86b739791bbdfb2419a.1920x1080.jpg?t=1657799993",
    "Slug": "witch-it",
    "Meta Title": "Witch It: Oct 22, 2020, Barrel Roll Games and Full Overview",
    "Meta Description": "Looking for information on Witch It? Check out the release date (Oct 22, 2020), developer insights from Barrel Roll Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Witch It game - Steam 559650",
    "Canonical URL": "https://gusku.site/game/witch-it",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Witch It\", \"description\": \"Looking for information on Witch It? Check out the release date (Oct 22, 2020), developer insights from Barrel Roll Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Barrel Roll Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daedalic Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/559650/header.jpg?t=1657799993\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}