{
    "AppID": 436510,
    "Name": "Worlds of Chaos: Invasion",
    "Release date": "Feb 10, 2016",
    "About the game": "Worlds of Chaos: Invasion is a single player, party based open-world tactical RPG with a strong emphasis on exploration, tactical real-time-with-pause combats and party creation. It has a deep, fun and intense combat system that will challenge you to your limits, and will make clever decisions count. You build a party of 5 characters that are exactly what you want : no classes or choice restrictions. Creating good and balanced characters with the right combinations of stats, skills, equipments, items and magic abilities, is what matters the most. In this game, a huge importance has been put on making every choice equal in power. What is important for a good party is not choosing the best skills, but an efficient combination of choices that work well together. And that is completely up to you, the player, to figure out. Your combinations will be unique to your style and choices. Battles are fast-paced, and you will need to take a lot of decisions, each of which will help you overcome the difficult foes that you encounter. Choosing which abilities to use, when and how to use them, choosing the right positioning of your warriors and the right targets for each of them, knowing which equipments and consumables to use and when, are what will bring you victory. Key Features : Single player tactical RPG where you control a party of 5 characters that you create with no class restriction, they are how you decide, completely. Very intense real-time-with-pause tactical gameplay that keeps you on your toes. Deep combat system that rewards clever party organization and statistical skill outside of combat, and smart tactical thinking inside combat. Injuries system that weakens enemies (and party characters) that have been hit, so focusing attacks on one enemy is unnecessary and often a bad idea. Injuring many enemies to make them weaker by taking opportunities in combat and using each of your characters at their best is way better. Each situation, each combat demands different strategies. There are no tactics that will work every time, adaptability is crucial. Check combat video to see this in action. No dead time in this game unlike most rpgs : corpses are auto-looted, you can fast-travel to explored places at any time, time consuming parts are taken off this game to keep the most interesting ones : exploration, combats, fast loots, fast shopping, fast and simple party management. (Early access) The game now has 21 hours of contents and can now be played from the start to the end. It will still be improved but at least you have a complete game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/436510/header.jpg?t=1558556871",
    "Price": 14.99,
    "Developers": "Tactichaos",
    "Publishers": "Tactichaos",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_9e24ded25607ae18fe55902a20cc72efffc2c60b.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_e55785f5ce4bc3c02421a0e36794e38b21654e17.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_7dcd5651603159aa5a8d5cfe7ee31e747bc8f310.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_41fbede2ec7d3c1f8ac4030df658c83854ad7d10.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_f40bab2347a206cbf7a6d3029cb94c8bd8897e51.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_70d59b5ddbba7c9edc0d68f2301e1cf707719b98.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_c86405a721b7242df3e5f3a29189a5abe118c4b1.1920x1080.jpg?t=1558556871,https://cdn.akamai.steamstatic.com/steam/apps/436510/ss_c2d4035864e8fe6ae94e2b7e0b212e66ebd1bd5e.1920x1080.jpg?t=1558556871",
    "Slug": "worlds-of-chaos-invasion",
    "Meta Title": "Worlds of Chaos: Invasion: Feb 10, 2016, Tactichaos and F...",
    "Meta Description": "Looking for information on Worlds of Chaos: Invasion? Check out the release date (Feb 10, 2016), developer insights from Tactichaos, and a complete game...",
    "Alt Text Image": "Official header image for Worlds of Chaos: Invasion game - Steam 436510",
    "Canonical URL": "https://gusku.site/game/worlds-of-chaos-invasion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Worlds of Chaos: Invasion\", \"description\": \"Looking for information on Worlds of Chaos: Invasion? Check out the release date (Feb 10, 2016), developer insights from Tactichaos, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tactichaos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tactichaos\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/436510/header.jpg?t=1558556871\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}