{
    "AppID": 970890,
    "Name": "1001 Jigsaw. World Tour: London",
    "Release date": "Feb 5, 2019",
    "About the game": "1001 Jigsaw. World Tour: London Puzzles is an exciting puzzle game and a fantastic opportunity to feel the true American spirit. Assemble jigsaws from a multitude of pieces and learn the history, traditions and attractions of the United States of America in 500 high-quality photos. Now you can play your favorite puzzle game and travel your favorite capital at the same time, all without leaving the house! For more exciting and comfortable gameplay, we've provided a bunch of opportunities! Set a difficulty for each puzzle to suit you – choose the number of jigsaw pieces, their angle and the turn function! Save your progress at any time and come back to assembling your saved jigsaws whenever you want! Simple controls and a bunch of hints and tools make the game more comfortable. With configuration options like this, the game is accessible both to new players and true professionals in the puzzle game genre. An exciting immersion into the world of London. Luxury decoration, beautiful landscapes, famous antiques, vintage jewelry and magnificent castles of all time... London Eye, Big Ben, River Thames and so on. This is a unique opportunity to feel the royal spirit of Britaina by playing 1001 Jigsaw. World Tour: London Puzzles. 1001 Jigsaw. World Tour: London Puzzles is a game and a source for inspiration. 500 high-quality photographs of famous sights galore, plus architecture, monuments, art, national traditions and glory, history, cuisine… A truly unique capital! And you can start your London transformation right now! - 500 high quality unique images - Well designed game-play: useful hints, sort tool and magnifying glass. - Optional game difficulty control makes your gameplay infinite - Custom styles of pieces with rotation - Save game progress and continue to collect the puzzle at any time - Tasks and colorful trophies for those who love excitement - Pleasant and relaxing music - Get 500 puzzles for one purchase It is beneficial!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/970890/header.jpg?t=1549356605",
    "Price": 4.99,
    "Developers": "Creobit",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/970890/ss_73a0525c464f9852b8864a25de2f397bab1cb814.1920x1080.jpg?t=1549356605,https://cdn.akamai.steamstatic.com/steam/apps/970890/ss_aec246ba1127f29cef970682f569461ba2f2bda6.1920x1080.jpg?t=1549356605,https://cdn.akamai.steamstatic.com/steam/apps/970890/ss_d637d56185e479c5ea160fc6255f921fdab6559b.1920x1080.jpg?t=1549356605,https://cdn.akamai.steamstatic.com/steam/apps/970890/ss_103ef134a62c363203340cbf01b5499e1083d575.1920x1080.jpg?t=1549356605,https://cdn.akamai.steamstatic.com/steam/apps/970890/ss_2c7c22d42fd6f9568c16e51b0a407fcf555fa387.1920x1080.jpg?t=1549356605",
    "Slug": "1001-jigsaw-world-tour-london",
    "Meta Title": "1001 Jigsaw. World Tour: London: Feb 5, 2019, Creobit and...",
    "Meta Description": "Looking for information on 1001 Jigsaw. World Tour: London? Check out the release date (Feb 5, 2019), developer insights from Creobit, and a complete ga...",
    "Alt Text Image": "Official header image for 1001 Jigsaw. World Tour: London game - Steam 970890",
    "Canonical URL": "https://gusku.site/game/1001-jigsaw-world-tour-london",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"1001 Jigsaw. World Tour: London\", \"description\": \"Looking for information on 1001 Jigsaw. World Tour: London? Check out the release date (Feb 5, 2019), developer insights from Creobit, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/970890/header.jpg?t=1549356605\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}