{
    "AppID": 1099140,
    "Name": "她3 : 复乐园之曦 Her3 : The Light of Paradise Regained",
    "Release date": "Apr 24, 2020",
    "About the game": "Ju Meow Meow's Game This is a kind of game to cultivate the plot of retro style. The protagonist needs to cultivate the attributes of the male / female protagonist (child) and the plot likability within 2 years, which ultimately determines the ending direction. There are 11 endings. background In ancient times, there were three races in the world, the protoss (small number), the human (large number), and the demon (medium number). At the beginning, the three tribes lived together on the ground. Thanks to the protection of the protoss, the three tribes coexisted harmoniously. One day, the protoss moved to the sky because of their excellent abilities and mentality, leaving the Terran and demon clans on the ground. The number and ability of the two clans to observe the ground are not much different. Fearing that they would have war, the protoss forged a weapon and kept it at the junction of the two clans. Fearing the power of worshiping God, they kept harmonious and equal communication. Such a day lasted for thousands of years. Suddenly one day, the weapons were stolen by the mysterious people under the eyes of the guards of the two families. Because the guards claimed that this was not their own breath, the contradiction between the two families began to deepen. Several hundred years later (this period is her 2 period) now, the contradiction between the two groups is growing. As a Protoss, I can't ignore the signs of the coming war, and try to find the suspect who stole the weapon (after all, this weapon doesn't have the characteristics of being stolen?) So I came to the ground to try to do something Just came to the ground and didn't go far. I found a child who looks only two or three years old. I rescued him / her. He / she woke up and said that he / she didn't remember anything. This child is... main functions are: New: adventure, pets, special items attribute: the numerical representation of the heroine's name, constellation (influence attribute) and other attributes, as well as the expression of the liking degree with each NPC. going out: shopping and triggering scenarios, unlocking work, etc. equipment: affects adventure, game functions, etc. clothes: clothes can be bought and put on, clothes are constantly updated, attributes affect the outcome and competition, etc. schedule: the daily schedule can improve and reduce the corresponding attributes, affecting the outcome. plot: carry out the main plot according to the time; in addition, there are 6 branch plots. activity: competition, adventure, etc. features: lovely painting style. lovely interaction with children~ diversified functions (adventure, competition, constellation influence, etc.). a large plot. roles grow over time. 72 achievements. Introduction player himself, a member of the Protoss. [children] choose men and women. They are lovely and mysterious. [junxuan] your little cute suddenly appears 0.0 ·I like small furry animals, but my father won't allow him to keep them ·The mother died ·It seems that the iron and steel hard man is actually very magical! ·My favorite thing is a rabbit doll given to him by my mother when I was a child. My father picked it up after practising martial arts. Rabbit rabbit: what did I do wrong QAQ [dark] Yeah, that's good ·I like the freshness of the fresh grass ·It's different from the name. I'm afraid of the dark ·(I like people who look good ·Aojiaogouzi:) ·Magic is very talented. I like to be lazy because of my brother's support ·My brother is the next patriarch ·I'm curious about women's wear (you know what I mean, * ' Here you are, my love ·Super sweet food ·He's a bully ·I usually call myself 'I' and like to call myself 'I' when I show weakness and coquetry ·Only baby is a friend, so I cherish it very much ·It's nice to sing (∀) the voice is spicy and deep ·Gan can't use words to express his lovely simplicity and beauty [Ling Ji] that Are you listening to me? ·I feel that I have no sense of existence ·It is often used to compare with junxuan, a childhood sweetheart. However, his constitution is not good by nature. He has stomach disease ·Always try to do everything ·I like rainy days ·I like JUNLEBAO cheese yogurt and peaches (you are thinking about peach) [Eugenia] hum, spicy chicken ·Some people are ostensibly arrogant, but privately they are a social terror;. () ·Hate the attention of all people, yearn for ordinary life ·A fanatic of Ceylon black tea ·The life stone is Amethyst ·Be careful not to eat sweets ·The best of the demons ·Because I like to make handmade desserts, I opened a shop and was visited many times by a certain devil ·The dragon's God! [Wan Mo]You have no intention of wearing the wind ·There is no clear favorite, mystery ·It's said that it's a disease. The specific performance will reflect ovo in the game ·Human design is timid and quiet, but once you identify someone, it will become completely different ·Later stage of her talk is the king of love talk (hunchback) ·I want to jump from the top",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1099140/header.jpg?t=1588762115",
    "Price": 4.99,
    "Developers": "橘喵喵",
    "Publishers": "橘喵喵",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1099140/ss_84d69a666f3aee503befb8d8e7b84b05f1b965a8.1920x1080.jpg?t=1588762115,https://cdn.akamai.steamstatic.com/steam/apps/1099140/ss_b0f7812f6fb45d99fd75d1a42973fb82d130dd4a.1920x1080.jpg?t=1588762115,https://cdn.akamai.steamstatic.com/steam/apps/1099140/ss_718596d10b886c4bef9d072261755226f1a930d3.1920x1080.jpg?t=1588762115,https://cdn.akamai.steamstatic.com/steam/apps/1099140/ss_3538f3dddbfc7a21feb7a0ca7134739ff0240442.1920x1080.jpg?t=1588762115,https://cdn.akamai.steamstatic.com/steam/apps/1099140/ss_4ddd74ea3a8b9affd29eb43595facb9f0771d7d5.1920x1080.jpg?t=1588762115",
    "Slug": "3-her3-the-light-of-paradise-regained",
    "Meta Title": "她3 : 复乐园之曦 Her3 : The Light of Paradise Regained: Apr 24,...",
    "Meta Description": "Looking for information on 她3 : 复乐园之曦 Her3 : The Light of Paradise Regained? Check out the release date (Apr 24, 2020), developer insights from 橘喵喵, and...",
    "Alt Text Image": "Official header image for 她3 : 复乐园之曦 Her3 : The Light of Paradise Regained game - Steam 1099140",
    "Canonical URL": "https://gusku.site/game/3-her3-the-light-of-paradise-regained",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u59793 : \\u590d\\u4e50\\u56ed\\u4e4b\\u66e6 Her3 : The Light of Paradise Regained\", \"description\": \"Looking for information on \\u59793 : \\u590d\\u4e50\\u56ed\\u4e4b\\u66e6 Her3 : The Light of Paradise Regained? Check out the release date (Apr 24, 2020), developer insights from \\u6a58\\u55b5\\u55b5, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a58\\u55b5\\u55b5\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a58\\u55b5\\u55b5\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1099140/header.jpg?t=1588762115\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}