{
    "AppID": 503820,
    "Name": "A Detective's Novel",
    "Release date": "Jul 28, 2016",
    "About the game": "On a cold November night in a desolate estate deep in the mountains an innocent life has prematurely perished. Surrounded only by his family and closest friends, a controversial yet immensely successful businessman William Goldberg passed away under mysterious circumstances. Being an upstanding member of society and the owner of Goldberg Industries, a multi-million dollar arms company responsible for providing the military during the World War 2, news of his death caused an uproar at the local police department. It seemed the case was tailor-made for the legendary detective Knox, a prodigy who successfully solved over hundred cases. Accompanied by an aspiring young detective Clark assigned by the Chief to keep an eye on him, Knox departs towards the Goldberg's estate to discover the truth behind the incident. Miles away from nearest settlement in a mansion hidden from the eyes of public, it is only natural to presume that only those present at the time could have been involved. Follow clues, look for evidence and discover key information by interrogating the suspects. All pieces of the puzzle will be presented and it's up to you to deduce who, how and why the murder happened. A mystery visual novel inspired by classic novels from Arthur C. Doyle and Agatha Christie and 'When They Cry' series. CHARACTERS Age: 29 Profession: Senior Detective Blood type: B One of the most famous detectives in the entire state, Knox has yet to stumble upon a mystery he is unable to unravel. Despite his young age, he decisively solved over 100 cases. A prodigy by nature, he rarely puts any effort in his detective work often neglecting it to enjoy cigarettes and coffee. Age: 26 Profession: Junior Detective Blood Type: A A young and naive detective working on his first case, eager to prove himself. According to Knox he is a narrow minded simpleton sent by the Chief to ensure Knox plays by the book. Age: 32 Profession: Ex-Soldier 1st Class Blood Type: 0 Eldest son of the deceased who has just returned from the Second Great War. His intellect and bravery allowed him to prove his worth on the front lines in the Pacific. Being the eldest heir, he is the first in line to inherit his father's fortune. Age: 58 Profession: Businessman Blood Type: 0 Well established businessman and a close friend of the deceased. He helped Goldberg create his financial empire during the war. Despite his short temper his charisma makes him beloved by his employees. Age:35 Profession: Housewife Blood Type: AB The widow of the deceased. Although their marriage lasted very short she claims that she loved the deceased deeply. Ms. Goldberg is a very emotional person that can change her attitude very quickly if provoked. Age: 65 Profession: Butler Blood Type: B The family butler that has served the Goldbergs for decades. Calm and patient man which despite his old age still chooses to work instead of retiring.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/503820/header.jpg?t=1469735483",
    "Price": 0.99,
    "Developers": "Amaterasu Software",
    "Publishers": "Amaterasu Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/503820/ss_c4884f157c020db750e1eb347d71847a17d4c57d.1920x1080.jpg?t=1469735483,https://cdn.akamai.steamstatic.com/steam/apps/503820/ss_f65fae60d7b1a04b3337bf66703c1d93aae27418.1920x1080.jpg?t=1469735483,https://cdn.akamai.steamstatic.com/steam/apps/503820/ss_879947b7a95f0e8b760120c1ba004db2274ad20c.1920x1080.jpg?t=1469735483,https://cdn.akamai.steamstatic.com/steam/apps/503820/ss_6e8ab8e9d0bcb088b3c49231a80320b0806ca539.1920x1080.jpg?t=1469735483,https://cdn.akamai.steamstatic.com/steam/apps/503820/ss_2d9a0833cef021cb34598e39c59b0f5ebe465fa8.1920x1080.jpg?t=1469735483,https://cdn.akamai.steamstatic.com/steam/apps/503820/ss_22a0cea5a6cad3d7896f1966d9c3e5e9897d3be4.1920x1080.jpg?t=1469735483",
    "Slug": "a-detective-s-novel",
    "Meta Title": "A Detective's Novel: Jul 28, 2016, Amaterasu Software and...",
    "Meta Description": "Looking for information on A Detective's Novel? Check out the release date (Jul 28, 2016), developer insights from Amaterasu Software, and a complete ga...",
    "Alt Text Image": "Official header image for A Detective's Novel game - Steam 503820",
    "Canonical URL": "https://gusku.site/game/a-detective-s-novel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Detective's Novel\", \"description\": \"Looking for information on A Detective's Novel? Check out the release date (Jul 28, 2016), developer insights from Amaterasu Software, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Amaterasu Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Amaterasu Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/503820/header.jpg?t=1469735483\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}