{
    "AppID": 1152340,
    "Name": "Book of Travels",
    "Release date": "Oct 11, 2021",
    "About the game": "Join Book of Travels and become part of a unique social roleplaying experience that doesn’t hold your hand. Inspired by genre classics, this is a serene adventure that sets you adrift in a fairytale world... it’s also an invitation to roleplay without the restraints of linear missions and plotlines. Feel at liberty to travel the free wilds and vivid cities of the Braided Shore peninsula. Wander deep into the layers of this hand-drawn world, stumble upon its hidden places or unravel one of its many mysteries. There is no overarching goal and no real beginning or end, but for mortal characters the stakes can be high. To explore all the stops, please see Our Early Access Journey Announcement . Braided Shore is a vast and intricate world, but meetings with other players are few and far between so your chance encounters will be something special. Choose to collaborate together or to survive alone, either way, you’ll be part of the birth of an exciting new online community, one where many stories will be told. But take note: This is a game for wayfinders and wanderers and it won’t plan out your route. Instead it will trust you to play in your own style and to shape your own journey. Whichever way you choose to travel, you’ll soon be adding your own chapters to Book of Travels. Authentic roleplaying and individual playstyles Pick one of 20+ Forms in a detailed character creation sheet that focuses on personality and identity rather than stats and classes. The game allows you to play in a style that matches your character and to set your own personal goals. Are you a danger-seeking adventurer, a stoic practitioner of magic binding, or a carefree tea drinking gambler? Boundless narrative that won’t hold your hand Your travels will present you with countless randomly occurring events making your story unique and each session different from the last. Peel back the layers of diverse plotlines and discover an immensely deep fairytale world. TMO – Tiny Multiplayer Online Other players are few, but your paths will cross – it’s up to you to choose to travel together or go it alone. Find vehicles to reach far flung places or just amble through woods together. The absence of guilds and social structures makes your temporary fellowships unique and memorable. A beautiful world of uncertainty An intricate and unique world that draws inspiration from old-world fairytales, Eastern mythologies and early industrial eras. Tons of intricate events chains that unlock items, characters, deep world secrets, and hidden gameplay features and tricks. Communicate using symbols Learn to use a unique set of symbols to communicate with other players. Unlock new symbols as you encounter new features and places (e.g. you’ll gain the symbol for “city” only after you’ve visited a city). The limitation in communication lays the foundation for a rich and friendly multiplayer experience. Innovative RPG systems Define your character by unlocking and mastering 300+ abilities, magical skills and passive feats that will have a huge impact on your character and open up different experiences of the game. Gain experience in numerous ways: by exploring, being courteous, gathering and trading. Battles can be rewarding, but you will learn more in defeat than in victory. The world is a hand painted diorama Experience a unique game view perspective ‘painted’ in a richly detailed artstyle. Click to walk like old school RPGs but in scenes with 3-dimensional depth. Committing to the world – together Might and Delight studio is fully committed to making this online world grow and live for a long long time – together with you. Much like a dungeon master we will hint about new mysterious scenarios, but it will be up to you, the players, to let us know what we should explore next. Additionally, we’ll add new levels, constantly making the vast world even bigger, adding new playable characters and of course thousands of storylines and events. Stories will change and evolve and eras of new narratives will follow. Quotes: Book Of Travels' online cRPG world may be the cure for my break-up with MMOs I believe [creative director Jakob Tuchten] understands, and maybe relates to, why I've broken up with MMOs, which is why I have faith (and even ten hours in, it is still faith) that Book Of Travels is the match I'd been waiting for. Rock Paper Shotgun Book of Travels Preview: Building Folklore In Multiplayer Book of Travels creates a unique take on the multiplayer experience, with an atmospheric and beautiful game made for smaller groups of players. Screen Rant Feels like a Shakespearean sonnet written in code – a love letter to a genre that's become diluted with vapid quests, superficial choices and ostentatious combat. Edge magazine Awards Massively OP’s 2019 Awards: Most Anticipated MMO. ”Book of Travels, the only game on Kickstarter I backed all year. I was dead serious when I said I wanted to play something weird and unique, something that pushes the boundaries of what MMOs are supposed to be, and it helps that it’s super pretty too.” – Brianna Royce ”Book of Travels was the game that stole my heart in 2019 with its Kickstarter campaign and wildly different and creative premise. A serene MMO? Sure, I’m up for that!” – Justin Olivetti Massively OP’s 2020 Awards: Most Anticipated MMO.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1152340/header.jpg?t=1657629156",
    "Price": 29.99,
    "Developers": "Might and Delight",
    "Publishers": "Might and Delight",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_3597f5648da6f27480130a21d6d2baf4a8d3d171.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_f90a7c91cb3f50c906d150b0a3069a44cf32082a.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_8b4262bd1ecd12418fecdf09955544acd59df335.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_4bb0456ccc58424da21d70615d373833404be708.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_87088a60881d65144b08a18a2ecede9e22854f62.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_e1c914bfc0878f200de9e032f3397ec91819afc7.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_35a7a3c5499bb1468c662609d7ac19bb5982019c.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_6926ba6164d9ab7f9fddb7362fbfb6b4e5cbd5d6.1920x1080.jpg?t=1657629156,https://cdn.akamai.steamstatic.com/steam/apps/1152340/ss_fab1883df64a1ad9dc8a4ce7b7810565750c587b.1920x1080.jpg?t=1657629156",
    "Slug": "book-of-travels",
    "Meta Title": "Book of Travels: Oct 11, 2021, Might and Delight and Full...",
    "Meta Description": "Looking for information on Book of Travels? Check out the release date (Oct 11, 2021), developer insights from Might and Delight, and a complete game su...",
    "Alt Text Image": "Official header image for Book of Travels game - Steam 1152340",
    "Canonical URL": "https://gusku.site/game/book-of-travels",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Book of Travels\", \"description\": \"Looking for information on Book of Travels? Check out the release date (Oct 11, 2021), developer insights from Might and Delight, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Might and Delight\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Might and Delight\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1152340/header.jpg?t=1657629156\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}