{
    "AppID": 1608040,
    "Name": "Castle Morihisa",
    "Release date": "Feb 10, 2022",
    "About the game": "After general Tokugawa of the shogunate issued the 'Laws for the Military Houses' to his vassals, none of the emissaries sent to the Ishikawas in Castle Morihisa have returned. Rumors claim that Lord Ishikawa Shinjuku was attempting to usurp the throne, and that he closed off all roads to the castle a few days prior. The great metsuke Yagyū Munenori requires a spy to make their way to Castle Morihisa to learn the truth of what is going on. Twitter: @ThermiteGamesHQ Unique Classes and Strategic Deckbuilding Four distinctive classes - the Monk, Samurai, Onmyoji and Ninja, each with their exclusive set of deck. With more than 300 different cards, you will be able to build your own deck based on the class you have chosen to challenge those bizarre monsters from the Japanese folklores. The Monk With deep meditation he understands the causality of the world; with his mantras he quell the demon horde! A master of both defense and offense, the Monk features two unique mechanics [Meditation] &amp; [Mantra]. One with which he cleanses his mind and spirit, one with which he cleanses the wicked. But by choosing your talents wisely, you can turn offense into defense and vice versa! The Samurai While his blade may be sheathed, his very being radiates a frigid intent to kill. A killing machine who strides amidst a storm of Sakura petals. To [kill in one blow] is the essence of his bushido spirit. Be it [Sakura] or [Retaliate], the Samurai utilizes his unique mechanics in the pursuit of reaching and surpassing the most extreme limits. Of course, the final choice rests in your hands. But truth be told: if big numbers are what you're all about, then the Samurai is for you! The Onmyoji With mine spirit as thine guide, mine blood essence as thine medium, taketh the oath to eradicate all that is evil, a contract signed. The Onmyoji calls upon the aid of mighty [Shikigami] in battle, beings fueled by the Onmyoji's own blood. Apart from this sacred art, they can also activate powerful talents for builds that focus on [Leech]. Have you ever before laid eyes upon an Onmyoji who wades fearlessly into battle? The Ninja A master of shadows that moves soundlessly through the night, nine gates within. Binding seals? Genjutsu? Kunai, shuriken? The ninjas of Senjiu Castle are masters of them all. [9 Mantra Signs], [Kunai], [Shuriken]. Together, these create endless combinations and possibilities. A class that requires a deep understanding of its mechanics to master! Do you have what it takes to reach its skill cap? Sengoku Fallen Heroes As Your Allies When facing difficulties, you could also ask for assistance from the Sengoku fallen heroes with different skills, which could give you an edge during the battles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1608040/header.jpg?t=1646060201",
    "Price": 14.99,
    "Developers": "Smokingbear Studio",
    "Publishers": "Thermite Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1608040/ss_94b5270644ad08ea734f0a564af65b9db75735c3.1920x1080.jpg?t=1646060201,https://cdn.akamai.steamstatic.com/steam/apps/1608040/ss_c43cb9b905007d5b6b543d52a784bcc111757584.1920x1080.jpg?t=1646060201,https://cdn.akamai.steamstatic.com/steam/apps/1608040/ss_c149ca0de12abe2daf13a7b064d61f0385d50515.1920x1080.jpg?t=1646060201,https://cdn.akamai.steamstatic.com/steam/apps/1608040/ss_12a7d7c277b86719c0fb494f15afedf53476ed56.1920x1080.jpg?t=1646060201,https://cdn.akamai.steamstatic.com/steam/apps/1608040/ss_530462a68934d1721c4f8b7e3e7d9bb0671f035a.1920x1080.jpg?t=1646060201",
    "Slug": "castle-morihisa",
    "Meta Title": "Castle Morihisa: Feb 10, 2022, Smokingbear Studio and Ful...",
    "Meta Description": "Looking for information on Castle Morihisa? Check out the release date (Feb 10, 2022), developer insights from Smokingbear Studio, and a complete game s...",
    "Alt Text Image": "Official header image for Castle Morihisa game - Steam 1608040",
    "Canonical URL": "https://gusku.site/game/castle-morihisa",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Castle Morihisa\", \"description\": \"Looking for information on Castle Morihisa? Check out the release date (Feb 10, 2022), developer insights from Smokingbear Studio, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Smokingbear Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Thermite Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1608040/header.jpg?t=1646060201\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}