{
    "AppID": 1250560,
    "Name": "Chess Sudoku",
    "Release date": "Mar 2, 2020",
    "About the game": "Presented by Cracking The Cryptic, YouTube’s most popular Sudoku channel, comes a new game that connects two of the world’s biggest mind games: Chess and Sudoku! How does Chess Sudoku work? Well we’ve taken the classic sudoku game everyone knows and loves and created puzzles with chess-related twists! There are three different types of puzzles in the game: Knight Sudoku; King Sudoku and Queen Sudoku (coming after launch as a free update!). In Knight Sudoku, in addition to the normal rules of sudoku (no repeated digit in a row/column/3x3 box) a digit must not appear a chess knight’s move away from itself. This simple extra restriction introduces lots of clever additional logic that makes the puzzle even more interesting! King Sudoku and Queen Sudoku work the same way: ie it’s always normal sudoku but, in King Sudoku a digit must not be a single diagonal move away from itself; and, in Queen Sudoku, every 9 in the grid acts like a chess Queen and must not be in the same row/column/3x3 box OR diagonal of any other 9! As with their other games (‘Classic Sudoku’ and ‘Sandwich Sudoku’), Simon Anthony and Mark Goodliffe (the hosts of Cracking The Cryptic) have personally crafted the hints for the puzzles. So you know that every puzzle has been play-tested by a human being to ensure that the sudoku is interesting and fun to solve. In Cracking The Cryptic’s games, players start with zero stars and earn stars by solving puzzles. The more puzzles you solve, the more stars you earn and the more puzzles you get to play. Only the most dedicated (and cleverest) sudoku players will finish all the puzzles. Of course the difficulty is carefully calibrated to ensure lots of puzzles at every level (from easy through to extreme). Anyone familiar with their YouTube channel will know that Simon and Mark take pride in teaching to be better solvers and, with their games, they always craft the puzzles with the mindset of trying to help solvers improve their skills. Mark and Simon have both represented the UK many times at the World Sudoku Championship and you can find more of their puzzles (and lots of others) on the internet’s biggest sudoku channel Cracking The Cryptic. Features: 40 beautiful puzzles from the Knight and King variants Frequent updates adding new puzzles to enjoy A large free update adding puzzles from the Queen Sudoku variant Hints crafted by Simon and Mark!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1250560/header.jpg?t=1583173008",
    "Price": 4.99,
    "Developers": "Studio Goya",
    "Publishers": "Studio Goya",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1250560/ss_efc355bd4a2fbeeb8f851ef19e654333e48e14aa.1920x1080.jpg?t=1583173008,https://cdn.akamai.steamstatic.com/steam/apps/1250560/ss_626bd812d84b4f9332cc9c8936eba0731c7e4054.1920x1080.jpg?t=1583173008,https://cdn.akamai.steamstatic.com/steam/apps/1250560/ss_178bfa7ca8d2ecfb78166431b17ff59df814efca.1920x1080.jpg?t=1583173008,https://cdn.akamai.steamstatic.com/steam/apps/1250560/ss_98a66034b087dc59703e57c88d0abf4ab493feed.1920x1080.jpg?t=1583173008,https://cdn.akamai.steamstatic.com/steam/apps/1250560/ss_74754efe90fd8e64541922497399c44be7b0ed66.1920x1080.jpg?t=1583173008,https://cdn.akamai.steamstatic.com/steam/apps/1250560/ss_dcc63a415294390daaa61400c1d874387ea906b6.1920x1080.jpg?t=1583173008",
    "Slug": "chess-sudoku",
    "Meta Title": "Chess Sudoku: Mar 2, 2020, Studio Goya and Full Overview",
    "Meta Description": "Looking for information on Chess Sudoku? Check out the release date (Mar 2, 2020), developer insights from Studio Goya, and a complete game summary.",
    "Alt Text Image": "Official header image for Chess Sudoku game - Steam 1250560",
    "Canonical URL": "https://gusku.site/game/chess-sudoku",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chess Sudoku\", \"description\": \"Looking for information on Chess Sudoku? Check out the release date (Mar 2, 2020), developer insights from Studio Goya, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Goya\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Goya\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1250560/header.jpg?t=1583173008\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}