{
    "AppID": 9850,
    "Name": "Codename: Panzers - Cold War",
    "Release date": "May 6, 2009",
    "About the game": "Tempelhof, Berlin, dawn of 8th April 1949. A major armed conflict is brewing between the Western powers and the Soviet bloc. The Red Army has been growing ever stronger since the end of World War II. With the growth of their army the Soviets realize that they hold the advantage, and are only waiting for the right moment to attack. That moment arrives with the Tempelhof Incident: the near-fatal collision of a US cargo plane and a Soviet fighter over Berlin's main airfield. A fatal combination of coincidence and human error, there is no point in arguing what went wrong, no point in asking who pulled the trigger first and who fired on whom in return. The Incident went down in history as fatal. Within 12 hours of the crash the ground beneath the German capital is shaking with the salvoes of a war never meant to be: a conflict between former allies over Europe and global supremacy. In this game the worst comes true, and it may just change the fate of the 'free world' forever! WWII is now just a memory - but the Cold War has just begun... Key features Authentic 'Cold War' era Variable squads with powerful squad leaders, capable of easily taking on any kind of enemy, providing a gameplay more balanced and fun than ever! Personalizable units with visible function upgrades Unique building combat system - buildings can be destroyed or occupied to gain an advantage Fascinating storyline which follows the personal fates of both familiar Codename Panzers heroes and brand new ones alike Detailed 'movie-like' world simulation: a truly 'alive' world in which each and every single unit possesses its own AI and reacts to the player's actions accordingly Single player campaign with 18 exciting missions. Your goal is to save the world and help NATO to stop the Soviets, yet occasionally you will end up changing sides to find yourself in Russia, helping out the KGB. Scenario Mode: replay missions already won/unlocked in order to increase your overall score 25 multiplayer maps and 3 modes: Domination, Multiplayer-Mission and Team Match Physics-based building destruction. Each building will collapse in its own unique manner, using real-time physics simulation: pieces falling from houses are assigned to various categories according to their size and mass Full simulation of the effects of light and terrain conditions on unit behavior Weather changes affect gameplay and visual effects: reducing sight, movement speed, range of fire and every parameter imaginable Dual display support with strategic map for making strategic decisions Brand new Gepard 3 graphics engine with full vertex and pixel shader 3.0 support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/9850/header.jpg?t=1563176225",
    "Price": 14.99,
    "Developers": "InnoGlow,Stormregion,THQ Nordic",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007748.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007749.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007750.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007751.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007752.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007753.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007754.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007755.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007756.1920x1080.jpg?t=1563176225,https://cdn.akamai.steamstatic.com/steam/apps/9850/0000007757.1920x1080.jpg?t=1563176225",
    "Slug": "codename-panzers-cold-war",
    "Meta Title": "Codename: Panzers - Cold War: May 6, 2009, InnoGlow,Storm...",
    "Meta Description": "Looking for information on Codename: Panzers - Cold War? Check out the release date (May 6, 2009), developer insights from InnoGlow,Stormregion,THQ Nord...",
    "Alt Text Image": "Official header image for Codename: Panzers - Cold War game - Steam 9850",
    "Canonical URL": "https://gusku.site/game/codename-panzers-cold-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Codename: Panzers - Cold War\", \"description\": \"Looking for information on Codename: Panzers - Cold War? Check out the release date (May 6, 2009), developer insights from InnoGlow,Stormregion,THQ Nord...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"InnoGlow,Stormregion,THQ Nordic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/9850/header.jpg?t=1563176225\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}