{
    "AppID": 1607200,
    "Name": "Cyanotype Daydream -The Girl Who Dreamed the World-",
    "Release date": "Feb 9, 2022",
    "About the game": "This is the story of the girl who dreamed the world. Cyanotype Daydream is a visual novel that uses the medium to tell its story in a unique and unforgettable way. It's a story of longing, of hope, of despair; and above all, a story of love. Three stories of star-crossed couples weave together a tapestry of emotions that converge in one final story, where the truth behind everything will be revealed. STORY Kaito wakes to find himself in a strange room with no memories of who he is or how he got there. The only other people around are a quiet white-haired girl and their overseer, Izumo. As three separate stories unfold around him, Kaito begins to wake up to the truth of this world, and his own role in it. And it's all connected to the strange, silent girl named Yonagi... CASE-1 Hatano Rin Arishima Kaoru is a 45-year old adjunct professor, stuck in an unhappy marriage and living a life of tedium after having long given up on his dreams of becoming a novelist. One day, he finds out that a student of his, Hatano Rin, is none other than the daughter of the writer he once admired above all others. As the relationship between the two deepens, Arishima grapples with immoral impulses toward this younger girl. But even as his life spirals and his marriage crumbles further, he picks up his pen and starts to write again. CASE-2 Olivia Berry Our stage is set in the heyday of Elizabethan theater, a time where women were prohibited from acting on stage. A young William Shakespeare runs a failing pub together with his blind father. Blessed with a perfect memory, he uses the tales his patrons tell as inspiration for the plays he writes to earn extra income. When his fate ends up in the hands of one Olivia Berry, a woman with a fiery personality and a fierce sense of purpose, Will finds himself in the midst of a real-life drama of his own. CASE-3 Momonouchi Sumomo Amei Kanna is a college dropout who spends his time holed up in his dad's garage trying to fix his late mother's old, beat up camper van. But when a young teacher-in-training shows up out of the blue, she provides the spark to get him out of his mancave and into the world again. Together with the self-styled scrap hunter Azuki, they set out on an adventure to find the special place Kanna's mother left behind in a drawing. As Halley's comet streaks across the sky, the three share an unforgettable summer of sweet beginnings and bitter ends. --- After experiencing these stories and bidding farewell to them, the threads converge in the truth of one girl. We are thrilled to share with you the visual novel that has already moved the hearts of thousands of Japanese players — Cyanotype Daydream.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1607200/header.jpg?t=1644399998",
    "Price": 39.99,
    "Developers": "Laplacian",
    "Publishers": "Laplacian",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_902e5fe42b6d4f92a022f7c8fd055baddab103a9.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_7f5ebccd0bbd9bd5176459157ed1bb0c0455ce96.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_27783a6881b166495ac0fc37df75d3771f570e5e.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_c759cbdef1b3ef86c73be0abf59edb9cc483cdd2.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_aedd16157b6114e7bc41797bd93ab1b26bf92727.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_26664180724f985d08cb828945dbb30d66057e2f.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_13f46fd4057fd7511f0bbef687391264701a2769.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_bb8877fb833880293ceb54ca9cc53ab5b522052f.1920x1080.jpg?t=1644399998,https://cdn.akamai.steamstatic.com/steam/apps/1607200/ss_48e726b4d9b6ffb0304461a3960f6fc31e7db962.1920x1080.jpg?t=1644399998",
    "Slug": "cyanotype-daydream-the-girl-who-dreamed-the-world",
    "Meta Title": "Cyanotype Daydream -The Girl Who Dreamed the World-: Feb ...",
    "Meta Description": "Looking for information on Cyanotype Daydream -The Girl Who Dreamed the World-? Check out the release date (Feb 9, 2022), developer insights from Laplac...",
    "Alt Text Image": "Official header image for Cyanotype Daydream -The Girl Who Dreamed the World- game - Steam 1607200",
    "Canonical URL": "https://gusku.site/game/cyanotype-daydream-the-girl-who-dreamed-the-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyanotype Daydream -The Girl Who Dreamed the World-\", \"description\": \"Looking for information on Cyanotype Daydream -The Girl Who Dreamed the World-? Check out the release date (Feb 9, 2022), developer insights from Laplac...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Laplacian\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Laplacian\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1607200/header.jpg?t=1644399998\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}