{
    "AppID": 754310,
    "Name": "Deadly Cryptids",
    "Release date": "Apr 11, 2018",
    "About the game": "Deadly Cryptids... that physically intense VR action shooter that gets your heart racing. Explore a mysterious ruin that seems oddly out of place, as you and your partner Kate are lost in the desert after your plane crashed. Face evil monsters and blow them all to bits. Use your body to take cover and survive action-packed scenes. Tap into your best shooting skills and use real weapons to kill a legion of deadly cryptids. Throw grenades &amp; Molotov cocktails, slash your combat knives and dual wield your way to survival. When the action gets too intense, jam an adrenaline needle in your chest to slow down time and destroy all that is evil. Sharpen your shooting skills in the Shooting Range. Check the monitors for the bullet impacts on the targets and adjust your aim accordingly. Perform cool and satisfying reload tricks that make every reload something you look forward to. Can you physically handle the intensity? Put your VR headset on and discover how you really react in simulated combat situations. STORY: After your plane crashed in the desert, you and your partner Kate have been wandering the desert for days in order to survive. You wake up at a mysterious ruin that seems oddly out of place. It does not take long before you realize this place is full of danger. KEY FEATURES: - Full fledged campaign: enjoy a thrilling VR ride with more than 4 hours of fun - Intuitive cover system: experience being under heavy fire while physically taking cover by ducking, hiding, dodging and even laying on the ground - Slow motion killfest: slow down time and experience the incredibly cool adrenaline simulating kill-them-all-or-die-trying feature - Wield a devastating arsenal of 11 weapons including Beretta, Magnum 44, AK-47, Scar, Shotgun, grenades,... even the ever powerful Mini gun - Realistic weapon handling: wanna go pro? Choose manual reload to change clips, pull out pins and shotgun shells in order to survive - Reload Tricks make every reload something you look forward to - Shooting Range: sharpen your aim at the Shooting Range. This is Deadly Cryptids... designed to be intense.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/754310/header.jpg?t=1617378127",
    "Price": 11.99,
    "Developers": "Timothy Brake",
    "Publishers": "Flow VR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/754310/ss_e6bf38f67ea5c79f566e05f15e65bb4cdb0208fa.1920x1080.jpg?t=1617378127,https://cdn.akamai.steamstatic.com/steam/apps/754310/ss_61c260cf39309c5bba91a0c6e701ae0e6c6bb6ef.1920x1080.jpg?t=1617378127,https://cdn.akamai.steamstatic.com/steam/apps/754310/ss_4ed59b16000687bbce520c2c77a10e22fcd17d12.1920x1080.jpg?t=1617378127,https://cdn.akamai.steamstatic.com/steam/apps/754310/ss_d9f827ebbd1f58455879fa6112ee06e75880b31d.1920x1080.jpg?t=1617378127",
    "Slug": "deadly-cryptids",
    "Meta Title": "Deadly Cryptids: Apr 11, 2018, Timothy Brake and Full Ove...",
    "Meta Description": "Looking for information on Deadly Cryptids? Check out the release date (Apr 11, 2018), developer insights from Timothy Brake, and a complete game summary.",
    "Alt Text Image": "Official header image for Deadly Cryptids game - Steam 754310",
    "Canonical URL": "https://gusku.site/game/deadly-cryptids",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deadly Cryptids\", \"description\": \"Looking for information on Deadly Cryptids? Check out the release date (Apr 11, 2018), developer insights from Timothy Brake, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Timothy Brake\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flow VR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/754310/header.jpg?t=1617378127\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}