{
    "AppID": 1455490,
    "Name": "Deadzone: Exodus",
    "Release date": "Apr 15, 2021",
    "About the game": "Dôležitá informácia! Po zakúpení hry, môžeš hrať oficiálnu ukážku, ktorá je zatiaľ jediná možnosť ako si zahrať našu hru. Obsah, ktorý je spomenutý na stránke a nižšie, pribudne do hry už 20.2! Zakúpením hry podporíte naše malé štúdio a dáte nám možnosť pokračovať na tomto projekte, ďakujeme. O čom je hra? Akčná arkáda plná skvelých momentov. Ocitneš sa na veľkej mape s vozidlom, ktoré si môžeš upravovať a každých 10 sekúnd získaš novú schopnosť, ktorú využiješ na nepriateľov. Na tejto mape sa ocitneš ako v reálnej arkáde, kde sa stále niečo deje. Ty a ďalších 2000 NPC vozidiel sa objavíte na mape a bojujete proti sebe, v hre sa nachádzajú objekty, ktoré využívajú novú technológiu Chaos Destruction. Vyhrať môže iba jeden hráč, a to ten, ktorý ako prvý zničí 250 nepriateľov. V hre sa budú nachádzať minihry a tento mód zaručene zabaví aj náročnejšieho hráča. Môžeš sa tešiť na hry ako derby alebo preteky s raketami a kopec ďalších. Ako sa môžeš v tejto hre zabaviť? Hra zatiaľ ponúka iba režim 'Rýchla hra', kde sa hráč objaví na mape a bojuje proti ostatným hráčom (NPC). Jedno kolo má stanovený čas na 20 minút. Pokiaľ chceš vyhrať, musíš do tohto času zničiť 250 nepriateľov, mapa je obrovská, budeš mať čo robiť.. ale nudiť sa nebudeš! V hre sa budú nachádzať minihry a tento mód zaručene zabaví aj náročnejšieho hráča. Môžeš sa tešiť na hry ako derby alebo preteky s raketami a kopec ďalších. Využiť môžeš nasledujúce schopnosti: Homing Rocket - laserom navádzaná raketa na označeného nepriateľa TV-Missile - raketa dlhého doletu s možnosťou ovládania strely Angular Tracker - na označené miesto dopadne silná elektromagnetická bomba, ktorá znefunkční všetky vozidla v okruhu 200 metrov D.S.S Tornado System - tornádo, ktoré vysokou rýchlosťou preletí cez mapu.. každý, kto mu skríži cestu sa naučí lietať Nitrogricetin - vaše vozidlo dostane značné zrýchlenie a pred vozidlom sa objaví ochranný štít, ktorým keď prejdete cez nepriateľa, odletí preč Invisibility - okamžité prejdenie do režimu neviditeľnosti Echo Carpet System - raketa vypustená z vesmírnej stanice, plne ovládaná vami Legendary Atom Bomb - schopnosť, ktorá má šancu na objavenie iba 0,002%. Pri použití tejto schopnosti vybuchne na mape atómová bomba, hráč ktorý ju použil, automaticky vyhráva! V hre sa nachádza jedna obrovská mapa s názvom - Laserweald pre 2000 NPC a menšie mapy pre arény, kde sa budú odohrávať minihry Doplňujúca informácia: Finálna 'otváracia' aktualizácia, ktorá nabehne 20.2.2022, umožní hrať hráčom 90% obsahu. Implementácia -Multiplayeru- bude dodaná až neskôr.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1455490/header.jpg?t=1646211099",
    "Price": 24.99,
    "Developers": "Alexander Žolnai,HQK Group",
    "Publishers": "Alexander Žolnai",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1455490/ss_99980535c7e949fb7db53947534081304bd2708b.1920x1080.jpg?t=1646211099,https://cdn.akamai.steamstatic.com/steam/apps/1455490/ss_33c8db682c82c03fca01c270cefc0bb173f6afdd.1920x1080.jpg?t=1646211099,https://cdn.akamai.steamstatic.com/steam/apps/1455490/ss_e081fe85d5ce509e479ac018967897d0cf305108.1920x1080.jpg?t=1646211099,https://cdn.akamai.steamstatic.com/steam/apps/1455490/ss_96b21b97c2d2b416abeee182cf0c77eae802a956.1920x1080.jpg?t=1646211099,https://cdn.akamai.steamstatic.com/steam/apps/1455490/ss_c1f60e39bbadbfddb0448cde54cf83c25b140b57.1920x1080.jpg?t=1646211099,https://cdn.akamai.steamstatic.com/steam/apps/1455490/ss_2011266025650863c51542521e3ff9fbc7563e93.1920x1080.jpg?t=1646211099",
    "Slug": "deadzone-exodus",
    "Meta Title": "Deadzone: Exodus: Apr 15, 2021, Alexander Žolnai,HQK Grou...",
    "Meta Description": "Looking for information on Deadzone: Exodus? Check out the release date (Apr 15, 2021), developer insights from Alexander Žolnai,HQK Group, and a comple...",
    "Alt Text Image": "Official header image for Deadzone: Exodus game - Steam 1455490",
    "Canonical URL": "https://gusku.site/game/deadzone-exodus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deadzone: Exodus\", \"description\": \"Looking for information on Deadzone: Exodus? Check out the release date (Apr 15, 2021), developer insights from Alexander \\u017dolnai,HQK Group, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alexander \\u017dolnai,HQK Group\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alexander \\u017dolnai\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1455490/header.jpg?t=1646211099\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}