{
    "AppID": 1201870,
    "Name": "Drinks With Abbey",
    "Release date": "Dec 25, 2019",
    "About the game": "Drinks with Abbey is a short, slice-of-life visual novel about a first date, from a male's perspective. After connecting with Abbey on a dating app, you meet in person for the first time at a local bar. This game is simply a conversation with her and the choices you make about what to say and do. But don't expect the date to go well on the first try. You need to pay attention, and as things are revealed about Abbey, you will be able to make better choices next time. 15 to 30 min playthrough, better choices = longer date. Realistic art style and atmosphere, based on western culture. Dry/subtle style of humor used between the characters (think Jim &amp; Pam from The Office). Important to keep this in mind to avoid misinterpreting the conversation. Text-based game. If you don't like reading, beware. No saving or roll-back, but you can skip previously seen content. A prototype game Drinks with Abbey is my first game. I wanted to make a similar, larger game, with more resources put into it, but I wasn't sure what people would think of the style, because it's different than most existing visual novels. I thought it was important to get feedback on a scaled-down version first, to give the general sense of the larger game, but not do everything I'd like to with it (that's why it's free to play). If you are willing to give feedback, please be specific so I know what to do more/less of in the next game. Interface There are no menus, except when you click the X to quit. You can click the textbox/choices to advance or use the arrow keys + spacebar. You can also press F to enter fullscreen mode. The 5 icons shown in the bottom left of the screen are the game's only options: 1. Toggle between speaker and headphones modes. Speaker mode is intended to sound like it's being played in the bar and includes crowd noise, while headphones mode plays the music as it was recorded. 2. Toggle music on and off. 3. Toggle lightning mode, which just removes the typing effect. 4. Toggle auto-play mode. This mode only requires your input for choices. 5. Toggle skip mode. When on, you will fast forward through all previously seen content.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1201870/header.jpg?t=1578244635",
    "Price": 0.0,
    "Developers": "Ramify Games",
    "Publishers": "Ramify Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1201870/ss_23b21954dd7a1cf1159668d48c1d218f691039c4.1920x1080.jpg?t=1578244635,https://cdn.akamai.steamstatic.com/steam/apps/1201870/ss_ca2b4c87c2ce4f35ad5612cb48403cd1df95331a.1920x1080.jpg?t=1578244635,https://cdn.akamai.steamstatic.com/steam/apps/1201870/ss_656272cc8adf6fbcc3369d8c8ae82efa11739118.1920x1080.jpg?t=1578244635,https://cdn.akamai.steamstatic.com/steam/apps/1201870/ss_4f40b5693b69f49dc075ff1bc483e65dea6adef7.1920x1080.jpg?t=1578244635,https://cdn.akamai.steamstatic.com/steam/apps/1201870/ss_ff87db22b43f8febbd4b08f2cd2d07c34dccfb9f.1920x1080.jpg?t=1578244635",
    "Slug": "drinks-with-abbey",
    "Meta Title": "Drinks With Abbey: Dec 25, 2019, Ramify Games and Full Ov...",
    "Meta Description": "Looking for information on Drinks With Abbey? Check out the release date (Dec 25, 2019), developer insights from Ramify Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Drinks With Abbey game - Steam 1201870",
    "Canonical URL": "https://gusku.site/game/drinks-with-abbey",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Drinks With Abbey\", \"description\": \"Looking for information on Drinks With Abbey? Check out the release date (Dec 25, 2019), developer insights from Ramify Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ramify Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ramify Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1201870/header.jpg?t=1578244635\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}