{
    "AppID": 1861700,
    "Name": "Drop one NPC to another",
    "Release date": "Jan 21, 2022",
    "About the game": "This is a 2D Game, your target is use yourself to collide or drag one NPC to let it collide to another NPC, and it also has leisure time to let you follow our character to play jump rope, boxing, football(soccer) and so on to fit your body, so it will also be an fitness game. This is a brand new kinds of game, nothing like any game you've seen before. Este es un juego en 2D, tu objetivo es usarte para colisionar o arrastrar un NPC para que choque con otro NPC, y también tiene tiempo libre para permitirte seguir a nuestro personaje para jugar a saltar la cuerda, boxeo, fútbol y así sucesivamente para encajar tu cuerpo, por lo que también será un juego de fitness. Este es un nuevo tipo de juego, nada parecido a ningún juego que hayas visto antes. Este é um jogo 2D, seu alvo é usar você mesmo para colidir ou arrastar um NPC para deixá-lo colidir com outro NPC, e também tem tempo de lazer para permitir que você siga nosso personagem para jogar pular corda, boxe, futebol e assim por diante para caber seu corpo, então também será um jogo de fitness. Este é um novo tipo de jogo, nada como qualquer jogo que você já viu antes. 这是一个2D游戏，但是也有3D关卡，您的目标是用自己碰撞或拖动一个NPC，让它碰撞另一个NPC，也有休闲时间让您遵循我们的角色来玩跳绳，拳击，足球 等等 锻炼您的身体，所以它也将是一个健身游戏。 这是一个全新的游戏，和任何你以前见过的游戏都不一样。これは2Dゲームですが、3Dレベルがあります。あなたの目標はあなた自身でNPCを衝突させるかドラッグし、別のNPCと衝突させ、ロール、ボクシング、フットボールなどを弾くために私たちの役割に従う余暇を持っていることです。体、それはまたフィットネスのゲームになるでしょう。 これは真新しいゲームです、そしてそれはあなたが今まで見たことがあるどんなゲームとは異なります。Это 2D игра, но есть 3D-уровни. Ваша цель - состоит в том, чтобы сталкиваться или перетащите NPC, пусть она сталкивается с другим NPC, и иметь свободное время, чтобы следовать нашим ролям, чтобы играть веревку, бокс, футбол и т. Д. Ваш Тело, так это также будет фитнес-игра. Это новая игра, и она отличается от любой игры, которую вы когда-либо видели.Dies ist ein 2D-Spiel, es gibt jedoch 3D-Level. Ihr Ziel ist es, ein NPC mit sich selbst zu kollidieren oder zu ziehen, lassen Sie es mit einem anderen NPC kollidieren und haben Freizeit, um unseren Rollen zu folgen, um Seil, Boxen, Fußball usw. zu spielen Körper, also wird es auch ein Fitness-Spiel sein. Dies ist ein brandneues Spiel, und es unterscheidet sich von jedem Spiel, das Sie je gesehen haben. Ceci est un jeu 2D, votre cible est de vous utiliser pour entrer en collision ou faire glisser un PNJ pour le laisser entrer en collision avec un autre PNJ, et il a également du temps libre pour vous permettre de suivre notre personnage pour jouer à la corde à sauter, à la boxe, au football, etc. pour s'adapter votre corps, ce sera donc aussi un jeu de fitness. Il s'agit d'un tout nouveau genre de jeu, rien à voir avec n'importe quel jeu que vous avez vu auparavant. 這是一款2D遊戲，你的目標是用自己碰撞或拖動一個NPC讓它碰撞到另一個NPC，它還能你跟隨我們的角色玩跳繩、拳擊、足球等來鍛煉你的身體，所以它也將是一個健身遊戲。 這是一種全新的遊戲，與您以前見過的任何遊戲都不一樣。이것은 2D 게임이며, 목표는 한 NPC를 충돌시키거나 드래그하여 다른 NPC와 충돌하게 하는 것입니다. 또한 여가 시간이 있어 줄넘기, 권투, 축구 등을 하기 위해 캐릭터를 따라갈 수 있습니다. 당신의 몸, 그래서 그것은 또한 피트니스 게임이 될 것입니다. 이것은 이전에 본 어떤 게임과도 비교할 수 없는 완전히 새로운 종류의 게임입니다. Ini adalah Permainan 2D, sasaran anda adalah menggunakan diri anda untuk berlanggar atau menyeret satu NPC untuk membiarkan ia berlanggar dengan NPC lain, dan ia juga mempunyai masa lapang untuk membolehkan anda mengikut watak kami untuk bermain lompat tali, tinju, bola sepak dan sebagainya agar sesuai. badan anda, jadi ia juga akan menjadi permainan kecergasan. Ini adalah jenis permainan yang serba baharu, tidak seperti mana-mana permainan yang pernah anda lihat sebelum ini. Acesta este un joc 2D, ținta dvs. este să vă folosiți pentru a vă ciocni sau pentru a trage un NPC pentru a-l lăsa să se ciocnească de un alt NPC și, de asemenea, are timp liber pentru a vă permite să urmăriți personajul nostru pentru a juca săritul coarda, box, fotbal și așa mai departe pentru a se potrivi corpul tău, așa că va fi și un joc de fitness. Acesta este un tip nou-nouț de joc, nimic ca orice joc pe care l-ați văzut înainte.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1861700/header.jpg?t=1649928435",
    "Price": 0.9,
    "Developers": "Alright Peaches Studio",
    "Publishers": "Alright Peaches Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_7cc9180fa6e5fd7d86d453ba665e709b35be6621.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_83871d26248fdbf6b50820c8cdca1b402383c5d3.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_4064d0c8c3c737924605bba291ca2bbce0091e6f.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_dac08f5212abdc71a4f146b2b6e99d85fc72b668.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_c50cfeb9332f290bd4b0c97b896e0d8192d59773.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_448c1a471597fb101e538513b6ddee7f045d87e5.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_bc365761e8a1faa5dccb1412976456d2e62aaa8b.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_4a67f21e852376e1f1e79abae9182ef1a22dcbd5.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_e7751d4f0d1ad653327cc80eaff40e87f60d9994.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_fad7f186ccf976d2365b0475d8b100cd4054d3a7.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_8f8bb249cd6f2ab313115fb113ae29d211c26207.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_1aa00e244043fd2b8e94c48aae36fb44f05dff7d.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_2dfdee3e2b94cd0c66bdb8d89b23f73887a758eb.1920x1080.jpg?t=1649928435,https://cdn.akamai.steamstatic.com/steam/apps/1861700/ss_1a8426b727ff86413b5a9e76110e48df993ed2a7.1920x1080.jpg?t=1649928435",
    "Slug": "drop-one-npc-to-another",
    "Meta Title": "Drop one NPC to another: Jan 21, 2022, Alright Peaches St...",
    "Meta Description": "Looking for information on Drop one NPC to another? Check out the release date (Jan 21, 2022), developer insights from Alright Peaches Studio, and a com...",
    "Alt Text Image": "Official header image for Drop one NPC to another game - Steam 1861700",
    "Canonical URL": "https://gusku.site/game/drop-one-npc-to-another",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Drop one NPC to another\", \"description\": \"Looking for information on Drop one NPC to another? Check out the release date (Jan 21, 2022), developer insights from Alright Peaches Studio, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alright Peaches Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Alright Peaches Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1861700/header.jpg?t=1649928435\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.9, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}