{
    "AppID": 1202300,
    "Name": "Eternal Liiivie - EP1 Liiivie Isolated From the World",
    "Release date": "Sep 6, 2020",
    "About the game": "Because of this deep love. I have to end this infinite shackle for you.” Liiivie, an isolated minority living in the mountain. From the Consciousness start,they were taught that they must strictly abide by the precepts set by God. Everyone is like interdependent gears,strictly observing the precepts and living a regular day. Liiivie people are immortal. Though there are differences in appearance and gender, there is no gender concept. Everyone follows the leadership of the high priests and does the work arranged by the elders. It is inevitable that there will be gender, occupation, age... all kinds of discrimination between each other. This seemingly absurd and contradictory phenomenon, in this closed and strict living environment, no one doubts, nor can they doubt it. Everyone lives in a stable and peaceful life and obeys the rules, so as not to disturb the order of the village. Ita originally thought that he would exist for such eternity, until five years ago, when a strange-looking outside girl 'Margarcia' came to the village, the life that as stable as the still water seems to have made waves. The mysteries and conspiracies surrounding the mountain village are also about to be unveiled. (※Liiivie=Artificial language in the worldview) ◆Exquisite and rich plot setting, philosophical meaning ◆Interesting cooking, collecting elements ◆No death mechanism (but it will affect the development of the plot) ◆Some live2D animations effects make scenes and characters become more vivid ◆This game is actually sci-fic ◆EP1◆ Liiivie isolated from the world Five years ago, Margarcia, a girl from the outside world, was taken by the high priests to the Liiivie village for unknown reasons and met Ita. Due to factors such as her origin and peculiar appearance, Margarcia was discriminated against by the villagers, but she didn't care. One night, Margarcia asked Ita to escape from the village, and they began planning to head to the outside world. What is the purpose of Margarcia? Why is ita 'special' for the Liiivie? And what is the truth... Will the answers to these questions be solved when they reach outside world? (The current version only have EP1) ◆EP2 Hiding in the dark Finally come to the second taboo temple, and finally get closer to the outside world. But waiting for Ita and Margarcia is a strange situation── The sections of the road catch in the loop and the tribesmen who should have died decades ago are attacking them. All of this is so confusing... But also at this time, unexpectedly meet someone who know Margarcia's past? ! ◆EP3 Child of Miracle After all the difficulties, the group finally come to the outside world. That is completely different from the Liiivie, such a free world with the truth. So, have all the troubles and questions finally answered? Ita, who had originally hold this idea, gradually felt the unusualness of Margarcia... 'Is Margacia...a real person?' What is correct? What is left to truly believe… ◆EP4 The End 'My love for him... transcends the flesh, transcends the soul, transcends everything in the world.' 'Whether this battle wins or loses... what awaits us, it must be a happy ending.' ? ? ? Stay tuned.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1202300/header.jpg?t=1658129991",
    "Price": 4.19,
    "Developers": "梅果子Plumko,純白花園WeissGarden",
    "Publishers": "純白花園WeissGarden,Light of Creators 創作者之光,RMAsia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1202300/ss_d8dafa6b332087f67fa43a5dcefce770aa5ab863.1920x1080.jpg?t=1658129991,https://cdn.akamai.steamstatic.com/steam/apps/1202300/ss_2bf58929619a8663806e8ffdf360769b23204678.1920x1080.jpg?t=1658129991,https://cdn.akamai.steamstatic.com/steam/apps/1202300/ss_91085baefb56b6a84620d061bd3457582330a8cc.1920x1080.jpg?t=1658129991,https://cdn.akamai.steamstatic.com/steam/apps/1202300/ss_9a53b9d79a6664fd24d624ffc08297294af4e83d.1920x1080.jpg?t=1658129991",
    "Slug": "eternal-liiivie-ep1-liiivie-isolated-from-the-world",
    "Meta Title": "Eternal Liiivie - EP1 Liiivie Isolated From the World: Se...",
    "Meta Description": "Looking for information on Eternal Liiivie - EP1 Liiivie Isolated From the World? Check out the release date (Sep 6, 2020), developer insights from 梅果子P...",
    "Alt Text Image": "Official header image for Eternal Liiivie - EP1 Liiivie Isolated From the World game - Steam 1202300",
    "Canonical URL": "https://gusku.site/game/eternal-liiivie-ep1-liiivie-isolated-from-the-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eternal Liiivie - EP1 Liiivie Isolated From the World\", \"description\": \"Looking for information on Eternal Liiivie - EP1 Liiivie Isolated From the World? Check out the release date (Sep 6, 2020), developer insights from \\u6885\\u679c\\u5b50P...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 6, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6885\\u679c\\u5b50Plumko,\\u7d14\\u767d\\u82b1\\u5712WeissGarden\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7d14\\u767d\\u82b1\\u5712WeissGarden,Light of Creators \\u5275\\u4f5c\\u8005\\u4e4b\\u5149,RMAsia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1202300/header.jpg?t=1658129991\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}