{
    "AppID": 500110,
    "Name": "Glider Island",
    "Release date": "Apr 28, 2017",
    "About the game": "Glider Island VR is a skill based hang gliding game where your objective is to collect as many hoops as you can within 10 minutes. You must keep airborne by using your rocket booster attached to your glider! You can add rocket fuel by flying through the blue spirals randomly placed around each map. You must plot your coarse carefully and watch out for the obstacles each map throws your way. You have limited booster so be careful with how much you use and when you choose to collect the blue spirals! Monthly Tournaments Each month we host a tournament and the top winners will receive Amazon Gift Cards. Keep track of your scores on the in-game leaderboards and online here Beautiful Maps and Scenery There are 3 maps and each map comes with unique scenery, soundtrack and surprise event. All maps now unlocked on purchase. The first map is Forest Island with 150 hoops and every two minutes a thunderstorm occurs and you must fight the wind. The second map is Volcano Island with 175 hoops and every two minutes a Volcano erupts and you must dodge lava bombs! The Last Island is Desert Island with 200 hoops and every two minutes a Dust Storm occurs and you must fly with limited visibility and wind. We are constantly updating the game so expect the scenery to be updated often. Multiple Control Methods There are two main ways to control the glider. VR Hand Controllers or VR Head Movement . Each has their own perks. Hand Controls allow for more precision flying but causes your arms to get tired where Head Controls is more intuitive and causes less motion sickness. We also support flying with the Xbox controller or Mouse/ Keyboard if you are so inclined to used those as well. VR Arcade Ready! We support Arcades! If you own a location based arcade you can licence Glider Island via Springboard, SynthesisVR, Viveport, or through Steam Site Licensing Program. Available for Arcades on SpringboardVR Available for Arcades on SythesisVR BONUS* : FREE ACCESS to Glider Sim Prototype! This is a much more simulated hang glider experience also developed by 5D Realities. It is a work in progress and will most likely be our next VR title on steam. You can learn more here:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/500110/header.jpg?t=1575491192",
    "Price": 7.99,
    "Developers": "Joey Sipos",
    "Publishers": "5D Realities",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_a73f9f2685590e1aec0c0bc2d4ee6712b377401d.1920x1080.jpg?t=1575491192,https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_2695eb75679ca4b3b4a63bc0747d7f0e83ec2677.1920x1080.jpg?t=1575491192,https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_3087590a2c90d4420aaa930dbd1b7a332c8c6c53.1920x1080.jpg?t=1575491192,https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_e8afdf8ae6e52d7356a855740857151203189793.1920x1080.jpg?t=1575491192,https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_39d2821dbcb8d315ac14be821a067f9905d42a54.1920x1080.jpg?t=1575491192,https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_b10a096183019f9939ce4b3a793f4a10735a922f.1920x1080.jpg?t=1575491192,https://cdn.akamai.steamstatic.com/steam/apps/500110/ss_d2c8f1f629cf6eefbd55f4e3da36181d07cf716c.1920x1080.jpg?t=1575491192",
    "Slug": "glider-island",
    "Meta Title": "Glider Island: Apr 28, 2017, Joey Sipos and Full Overview",
    "Meta Description": "Looking for information on Glider Island? Check out the release date (Apr 28, 2017), developer insights from Joey Sipos, and a complete game summary.",
    "Alt Text Image": "Official header image for Glider Island game - Steam 500110",
    "Canonical URL": "https://gusku.site/game/glider-island",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Glider Island\", \"description\": \"Looking for information on Glider Island? Check out the release date (Apr 28, 2017), developer insights from Joey Sipos, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Joey Sipos\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"5D Realities\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/500110/header.jpg?t=1575491192\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}