{
    "AppID": 1253940,
    "Name": "Good Goliath",
    "Release date": "Mar 31, 2020",
    "About the game": "Once upon a time, a gentle giant wakes from a deep slumber to discover himself under attack by a tiny angry mob. With no real weapons to defend himself, the giant must use anything that he can in order to survive! In Good Goliath, players are the giant and battle against hordes of pitchfork wielding villagers, cavalry mounted soldiers, and even flying devilish imps. Good Goliath puts players in a storybook world, where they fight through vibrant and cartoon style levels. With wave-based tower defense gameplay where players are the tower, catch and dodge pitchforks, barrels, and other weapons as they are launched. Even grab some of those tiny villagers out of the air as they launch themselves and use them to knock out their friends! Battle armies of bitty foes, formidable mini-bosses and colossal monsters as you play this arcade-action experience. From castle mountain tops, shark-infested pirate islands and creepy caverns, use everything in your power to survive the endless battle. Key Features: Full Campaign: Fight your way through medieval worlds, oceans overrun with pirates, and the realms of the underworld as you explore 9 levels rife with mini and massive bosses. Seek out hidden treasure in order to customize your experience to unlock new sets of hands - you never know when you can use an extra pair! Enemies Are Your Ammo: Who needs a sword when you have an angry little villager being thrown at you? Use not only pitchforks and barrels to defend yourself, but catch the tiny humans that launch themselves at you and throw ‘em back! Your ammo is only limited by what or who you can catch. But not everyone is your enemy - keep your eye out for your friendly neighborhood baker floating through levels with some cake to help you get back to tip-top health. Storybook-Style Comical Worlds: Dive into themed biomes, such as Medieval, Pirate, and Hell World, each filled with unique bosses and enemies. The storybook art style appeals to players of all ages. Multi-Staged Bosses: Survive waves of tiny enemies on every level, leading to formidable mini-bosses that include fire-tossing flying witches and boulder throwing giants. Each world culminates in a gigantic standoff against a challenging monstrous boss where you battle creatures even larger than you! Simple, Yet Challenging Gameplay: Kick back and relax while you play; with easy in-game mechanics, you can be a giant sitting or standing! Unlock special objectives, locate secrets in each level, and earn bronze, silver, and gold trophies. Pattern-based gameplay of punching, dodging, catching, and throwing makes the game accessible for players of any level.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1253940/header.jpg?t=1599078002",
    "Price": 19.99,
    "Developers": "Knocktwice Games",
    "Publishers": "Knocktwice Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1253940/ss_5d475644663a33673c727c486ee8fe85121137f5.1920x1080.jpg?t=1599078002,https://cdn.akamai.steamstatic.com/steam/apps/1253940/ss_219c24ab92261152ec5e0c6fdf70765441936ea5.1920x1080.jpg?t=1599078002,https://cdn.akamai.steamstatic.com/steam/apps/1253940/ss_a7ad838925a6b92f9197bb5c3afd7673ce9783b6.1920x1080.jpg?t=1599078002,https://cdn.akamai.steamstatic.com/steam/apps/1253940/ss_1dbf9baf24a0615b787f66da370c0c2e4e9c9b19.1920x1080.jpg?t=1599078002,https://cdn.akamai.steamstatic.com/steam/apps/1253940/ss_2097ffa70536247ea7f3dbfab6b4d5c07ed20d1b.1920x1080.jpg?t=1599078002",
    "Slug": "good-goliath",
    "Meta Title": "Good Goliath: Mar 31, 2020, Knocktwice Games and Full Ove...",
    "Meta Description": "Looking for information on Good Goliath? Check out the release date (Mar 31, 2020), developer insights from Knocktwice Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Good Goliath game - Steam 1253940",
    "Canonical URL": "https://gusku.site/game/good-goliath",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Good Goliath\", \"description\": \"Looking for information on Good Goliath? Check out the release date (Mar 31, 2020), developer insights from Knocktwice Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Knocktwice Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Knocktwice Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1253940/header.jpg?t=1599078002\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}