{
    "AppID": 563910,
    "Name": "Guardian Of December",
    "Release date": "Nov 30, 2016",
    "About the game": "A long time ago people lived peacefully; they lived and died, they improved, explored, and discovered, but they wanted more. They became greedy, they wanted to be kings and rule the world. Unnecessary fights, murders, wars... Gods decided to stop this. At the end of every year, during December, they opened gates to Hell so demons could freely punish, torture and kill. The world began to become part of hell. People stopped fighting each other, they united, but that was not enough to defend themselves. One demon was different, much stronger than everyone else, who once was a man, an assassin, who killed others to live, which in turn landed him in Hell. But after some time in Hell, he had grown weary and regretted his past life and wanted to help the humans. He became a guardian, and at the end of each year he fought off the demons. The people called him Guardian of December. The Devil noticed that his armies were being slain, so he offered a deal: no demon will ever come to Earth again, but the Guardian of December must return to hell. The people were saved and the guardian's soul was trapped in hell once again. After a year, when the gates of Hell were opened again, the people were hoping that no demons would come out again... But the Devil broke his deal and demons started crawling out... The Guardian must return... Gods give you the power to fight your way out of the hell prison and save the world. After getting out you reach the Arano village, where its leader Taru explains their plan on how to reach the Devil and kill him. The Devil's Medallion will take you to the Devil, but you need to collect its pieces first. Villagers along with other creatures built portal that can transport to the medallion fragments, but the humans are too weak for such missions. So Guardian's assistance is necessary. Go through ice cave, dungeon, temple, darkness collection, castle, swamp, fight the witch, vampires, monsters, undead creatures, magic animals and many more, get stronger, unlock new skills, get new weapons, customize your Guardian with helmets and wings you get from battles, get to know about different creatures, their stories... In Guardian Of December! RPG style turn based battles Customization Many different enemies, battles, skills Various weapons Melee and magic attacks Warning - jumpscares! The full game is here, and even more stories are coming soon (includes fighting as different characters!) in the next update! #horror #indie - See everything I've made on: VidasGames.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/563910/header.jpg?t=1654778112",
    "Price": 4.99,
    "Developers": "Vidas Salavejus",
    "Publishers": "Vidas Salavejus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_9ce8fcf11a8e54f29774f98ab80df216a18e2bb9.1920x1080.jpg?t=1654778112,https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_c4c61e6e15a049a140ee5fb9618ba03a543d6d9a.1920x1080.jpg?t=1654778112,https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_c5d5bdce92ed2ce74c2a9c62a419477463d77e6a.1920x1080.jpg?t=1654778112,https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_0135069dac8f4e174df69f452f241acfce11f338.1920x1080.jpg?t=1654778112,https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_cb0f6e3ee74a100a6d89a83f451181f5d8907f4f.1920x1080.jpg?t=1654778112,https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_05355c3ad80277a96840f853e2cf92a866128ee5.1920x1080.jpg?t=1654778112,https://cdn.akamai.steamstatic.com/steam/apps/563910/ss_d5c0ef1efee2c7effdc12f8acbc7d3cdaf87e538.1920x1080.jpg?t=1654778112",
    "Slug": "guardian-of-december",
    "Meta Title": "Guardian Of December: Nov 30, 2016, Vidas Salavejus and F...",
    "Meta Description": "Looking for information on Guardian Of December? Check out the release date (Nov 30, 2016), developer insights from Vidas Salavejus, and a complete game...",
    "Alt Text Image": "Official header image for Guardian Of December game - Steam 563910",
    "Canonical URL": "https://gusku.site/game/guardian-of-december",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Guardian Of December\", \"description\": \"Looking for information on Guardian Of December? Check out the release date (Nov 30, 2016), developer insights from Vidas Salavejus, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vidas Salavejus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vidas Salavejus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/563910/header.jpg?t=1654778112\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}