{
    "AppID": 953330,
    "Name": "Hyper Echelon",
    "Release date": "Nov 10, 2021",
    "About the game": "INTRODUCTION The Royal Space Force needs you! A malicious alien force known as EXODON has brought chaos upon the Cyan Galaxy. Outnumbered and outgunned, the Royal fleet doesn’t stand a chance in a head on shoot out with the invading armadas. Tactical precision is the only chance of success. You must bravely blast through the hordes and vanquish the enemy leaders in your single seat starfighter, symbolically dubbed the Titan. However, you won’t be all on your own. A small eclectic squad of wingmen will fight by your side, while the Starhulk space carrier provides a mobile base where you can upgrade your ship. In order to prevail you will need to evolve the Titan’s arsenal from a humble single shot cannon to a spread shot, laser shooting, rocket launching, bombastic one man army. GAMEPLAY Hyper Echelon takes inspiration from arcade classics while bringing its own authentic flavor of frantic, tactical shooting action - a bold experience with enough teeth for hardcore players, and plentiful rewards to welcome newcomers. Missions - The core story mode takes you on an epic campaign across the galaxy featuring 10 distinct worlds. To advance you must do more than survive, you must earn medals by completing specific objectives. These objectives include destroying all enemy units, finding collectibles, and various specials tasks unique to each mission. Try to get them all in one shot for a top rank, or progress steadily by focusing on one objective per run. Wingmen - Bring a wingman into action to fight along your side. While managing two ships at once makes you a bigger target, the wingmen compensate by offering greater firepower, and extra special abilities. The most effective way to progress in the game is to achieve a harmonious relationship with your wingmen. 3 unique wingmen characters can be unlocked by playing missions. Special Abilities - In addition to an array of standard projectiles, the Titan and wingmen have special abilities. These include offensive attacks, shields, and the ability to slow time. In order to use specials you must keep a stock of Plasma, which is collected from busting up crystals and absorbing it from Space Kraken. Upgrades - Collect Golden Parts in battle, and use them to purchase hundreds of incremental upgrades in order to improve 8 different ship components. Not only do you grow stronger in combat, you also get the satisfaction of detailed visual changes to your Titan in the hangar. Proudly watch your stock gray bird light up like a Christmas tree, as your robot mechanic tinkers away. Difficulty Tiers - There are four difficulty tiers for every world, which each offer a fresh set of medals to earn, and greater GP rewards. Not only does the difficulty increase by statistical parameters, new and improved units appear in higher difficulties, keeping you on your heels and providing a sense of newness. Star Carts - Special upgrades can be unlocked by somewhat rare item drops. If you find a Star Cart you must survive to the end of the mission to acquire its reward. Star Carts provide a variety of perks including enhanced wingman weapons, upgrade discounts, character skins, and many more! Achievements - Go above and beyond to achieve more than just bragging rights. 36 achievements are fully integrated into the experience, and offer in-game GP rewards. CONTENT OVERVIEW 3 game modes 10+ hours of gameplay in story mode, endless replay in Survival and Boss Rush modes 10 survival missions 10 bosses 5 playable characters (2 pilots and 3 wingmen) 4 objectives in each story mission 4 difficulty tiers in story missions - each tier has a fresh set of objectives 160 objective medals 320 upgrades 32 star carts online leaderboards 36 Achievements STORY PRESENTATION Opening and closing animation sequences bookend the game. Atmospheric cutscenes introduce all 10 missions. A tale of unlikely friendships in the heart of war is progressed with animated dialogue scenes before and after every mission. Colorful mission briefings describe each scenario, and pepper the universe with bits of lore. Rich UI design brings everything to life with graphic detail and animated elements. EXTRA MODES Survival - Return to classic score chasing in endless procedurally generated levels. With 10 mission variations, Survival mode supplies endless replay value. Includes online leaderboards where your heroic efforts are emblazoned for all to see. Boss Rush - Take down all 10 bosses as fast as you can, and show off your best times on the leaderboards. Once you’ve encountered a boss in Missions you unlock them in Boss Rush, allowing you to master them without the frustration of replaying through missions. EXTRA FEATURES 2 Player Local COOP - Let a friend take control of a wingman for local coop action. Summary - All your progress is tracked in one fancy menu. Of course, core stats like play time, and overall progress are tracked, but many more stats are included to fancy your curiosity, such as kills, boss kills, wingmen usage, special usage, and more! Media - Jam out to BGM tracks, and rewatch story scenes in one tidy menu.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/953330/header.jpg?t=1643545236",
    "Price": 19.99,
    "Developers": "GangoGames LLC",
    "Publishers": "GangoGames LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_bcb30cdb8e533f803230c47f1b81e805a1cd7efe.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_47d16a25aa9fd39750f7b8247a54c196923dc0d2.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_bab200eb388ded1c7e65b61d30bfd712c17d7eb1.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_9e34a0aa11566255e9a1dc17d1db7d8f4933eac0.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_cf5943e59149103ad9c76b057b201546912e847b.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_d5959547d84b8cf42b0cea6af061f4b33101ad5c.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_2469f5ce9fd85513bc88b3db5b44ac7251c9587c.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_84cc5b57384e4e123f67f3d2621e7ca2eff79c8e.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_3bfa581b9f4be3131224babaa47c455c7f361b14.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_244e9df09b6c8afb3ff46012f2179d5c43d1f924.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_3dfabc0f7a999ed6edfef329d85f8e0df2b9ef1b.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_d88df5b818fa79ba45bf5d4b073e4db60cf51ef7.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_0b4e14715e5c052f0e2bafed7c43d32629e2e936.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_2cb1af4be24f747b8d06870425f81e3e84028b13.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_6f2e2d4c78af713b4e3ac524045b45822eef5617.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_0e38862e29043cd4b8f2ca57c0cec5c23d9d9eab.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_c0551c8dbe67c10228f28412ee5f5fe4102371f7.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_e90024e44999ed815d4c7fb2646f35799ca7c015.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_3ccdaecc559d9a9e6e4e05c31b52d0c5591c159b.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_10c486590c1acd9b0bfc1387398f41fe6b776f8a.1920x1080.jpg?t=1643545236,https://cdn.akamai.steamstatic.com/steam/apps/953330/ss_42569b09701b8e3e8a50178ef687acb58437cdb8.1920x1080.jpg?t=1643545236",
    "Slug": "hyper-echelon",
    "Meta Title": "Hyper Echelon: Nov 10, 2021, GangoGames LLC and Full Over...",
    "Meta Description": "Looking for information on Hyper Echelon? Check out the release date (Nov 10, 2021), developer insights from GangoGames LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Hyper Echelon game - Steam 953330",
    "Canonical URL": "https://gusku.site/game/hyper-echelon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hyper Echelon\", \"description\": \"Looking for information on Hyper Echelon? Check out the release date (Nov 10, 2021), developer insights from GangoGames LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"GangoGames LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GangoGames LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/953330/header.jpg?t=1643545236\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}