{
    "AppID": 274980,
    "Name": "Influent",
    "Release date": "Mar 20, 2014",
    "About the game": "“By immersing the player in the target language, Influent closely models the way we naturally learn our native language. I suggest giving Influent a try.” - Steve Hammond, Somnambulant-Gamer Inspired by Dreamcast titles of old (namely Shenmue and Toy Commander ) Influent immerses players in a fully interactive 3D environment where the names for absolutely every object in the game can be gleaned with a single click! In fact, even more information can be learned with a double-click! Every door, drawer, and cabinet can be opened with a right-click here and a right-click there, revealing more and more things to be learned! Packed to the brim with hundreds of native audio pronunciations (painstakingly recorded specifically for this game), Influent offers players a unique opportunity to enjoy learning both vocabulary and pronunciation in the language of their choice. With 20+ languages currently available for download, Influent combines the joys of playing a video game with the language learning process, resulting in real-life rewards and achievements that will remain with players for the rest of their lives. Influent: Language Learning Redefined. Audio from native speakers Synonym swap functionality Learn at your own pace! Fully interactive modern apartment Over 420 words to collect and master Includes Nouns, Adjectives, and Verbs 20+ Languages to choose from (more to come!) Which languages are included in the Free Edition? The relatively new Free Edition includes the French, Italian, and Korean language packs right out of the box. What if I don't want French, Italian, or Korean? If you're not interested in any of those languages and want to save on some hard drive space and load time when launching the game, you can skip the Free Version by reading the following example about Mark and Patricia. If Mark wants to learn Latin, he should purchase the 'Influent - Latina [Learn Latin]' store item. If his wife Patricia then wants to learn Swedish, Mark should then purchase the DLC store item entitled 'Influent DLC - Svenska [Learn Swedish].' This can also be done from Patricia's perspective and will have the exact same result with Patricia purchasing the Swedish base game and then also buying the Latin DLC for Mark, herself, or even anyone else, to use on the same computer. Do you have plans to release more languages? When??? New Language Packs will be released as they are completed. A full list of languages that are coming soon can be found on the Official Website . Check out the Community Hub for Frequently Asked Questions and other cool stuff! A BRIEF BACKGROUND Influent is a Language Learning Game focusing primarily on vocabulary acquisition and pronunciation. It was initially developed in Japan at the University of Tsukuba's Entertainment Computing Laboratory under the Monbukagakusho Government Research Scholarship . After research funding ran out, further funding from a wildly successful Kickstarter Campaign allowed for the completion of the game. A research paper on the ideas surrounding the game and its applications was published by the Information Processing Society of Japan (IPSJ), which can be viewed in its entirety here . Andrew Cross is infuriated! For three long years, he sat confined to his work, developing a device that he firmly believed to be a technological breakthrough in the way people would interact with the world around them. A device that could scan any object in the real world and then provide its name in any language! Duly dubbing his fancy new invention the 'SanjigenJiten,' Andrew arranged an appointment to demonstrate the device's amazing capabilities at the world's largest technology corporation, Technoglobe International. But while on his visit, he fell for a girl he met in the lab, and while she stole his heart, someone else silently stepped in and stole his device! Now, Technoglobe has gone and swiftly marketed the SanjigenJiten as their own, even laying claim to the very name he had so cleverly concocted! But Andrew Cross has a plan. He's made an even better version of his SanjigenJiten and launched an online campaign, swearing to learn 300 words in a foreign language to raise awareness of Technoglobe's blatant theft and prove his device really works! But does the SanjigenJiten really work? Can Andrew actually pull it off?!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/274980/header.jpg?t=1651730198",
    "Price": 0.0,
    "Developers": "Rob Howland",
    "Publishers": "Three Flip Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_88a4db43a0a930c405ae1e4bab1027244a32c5f7.1920x1080.jpg?t=1651730198,https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_14b0ffa81b7f54a3fb3b3ae19d38047c19a7f45a.1920x1080.jpg?t=1651730198,https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_35d8078c4e80b5e7fcf37334f951622ef2aef0f5.1920x1080.jpg?t=1651730198,https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_9899d8ab3295be24b5aae1485a9b86ddc2fde640.1920x1080.jpg?t=1651730198,https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_1c5494491318b72ca1487ba4d705ec428ac28210.1920x1080.jpg?t=1651730198,https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_76210109269b5f96f52b952479587e3979093bf3.1920x1080.jpg?t=1651730198,https://cdn.akamai.steamstatic.com/steam/apps/274980/ss_f5dac248283b71411f63b4bb43bc7d0bc18ec220.1920x1080.jpg?t=1651730198",
    "Slug": "influent",
    "Meta Title": "Influent: Mar 20, 2014, Rob Howland and Full Overview",
    "Meta Description": "Looking for information on Influent? Check out the release date (Mar 20, 2014), developer insights from Rob Howland, and a complete game summary.",
    "Alt Text Image": "Official header image for Influent game - Steam 274980",
    "Canonical URL": "https://gusku.site/game/influent",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Influent\", \"description\": \"Looking for information on Influent? Check out the release date (Mar 20, 2014), developer insights from Rob Howland, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rob Howland\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Three Flip Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/274980/header.jpg?t=1651730198\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}