{
    "AppID": 1530580,
    "Name": "Lame Defenders",
    "Release date": "Nov 8, 2021",
    "About the game": "Lame Defenders is a mix of RTS, RPG and Tower (Hero) Defense games featuring real time tactical combat with ability to slow time. Hire many different heroes and assemble your team of up to five of them and beat waves of enemy monsters. Earn gold and experience, hire more heroes, tweak your teams and slay more monsters to dominate the online leaderboards. I hope you will like the game. I am a solo developer from Czech Republic who likes games and everything around gaming for a long time. Arenas and monsters The game currently contains 10 arenas with different looks and types of enemies that you have to beat. You will face weak pawns but also elite monsters that will cause you lots of trouble with their powerful skills. You have to read carefully description of enemy skills as there are skills that will wipe your heroes very quickly if not countered correctly. Heroes You can assemble a team of maximum 5 heroes of your choosing from over 20 heroes at the time (more heroes will come soon). The heroes might not allways be the coolest and strongest people but hey everyone has right to be a bit lame from time to time. Every hero has 3 unique skills for you to use. There is no mana or other resource, only cooldowns. Pick your team wisely as there are different types of heroes as you know them from other games - there are tankier heroes, healers, damage dealers or supports with buffs and debuffs. You can also customize playstyle of every hero by adding attribute points (attack, defense, agility) as you earn experience and levels. Battle In every arena there are different monsters that will spawn periodicaly in waves. New waves will introduce new monsters and every wave will make all monsters stronger. You have to use your heroes to beat as many waves as you can and delay the monster invasion and give your people time to build defenses. You also have possibility to slow time to give yourself a little break and do some thinking about your strategy. Controls You control Lame Defenders just as any other real-time strategy game like Warcraft/Starcraft. You can use mouse and keyboard to control your heroes. Online leaderboars Lame Defenders has its own online leaderboards for every battleground in the game. Can you compete for the best score?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1530580/header.jpg?t=1636442946",
    "Price": 3.99,
    "Developers": "LameGames",
    "Publishers": "LameGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_0928662bd0d893a135b8d70bb9922bba361c3122.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_705fab25df6283231b43e2e27c10381526c75f6a.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_e4b7ee1647946ace1e0f854fe252352d3e6b899a.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_84aaa6f2f472cc88bb9f85b5d2509c23b55abca9.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_850b29ef67655cecda63308eb8dd783fc6126b91.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_b3d01d4766fcbfc9a4a4a1db0e00645533669bd4.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_863123ad8f4346b5388576529a8beff19e357ad3.1920x1080.jpg?t=1636442946,https://cdn.akamai.steamstatic.com/steam/apps/1530580/ss_bae895e7f10d1c4825cb6b6bf36d04f35aba71f9.1920x1080.jpg?t=1636442946",
    "Slug": "lame-defenders",
    "Meta Title": "Lame Defenders: Nov 8, 2021, LameGames and Full Overview",
    "Meta Description": "Looking for information on Lame Defenders? Check out the release date (Nov 8, 2021), developer insights from LameGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Lame Defenders game - Steam 1530580",
    "Canonical URL": "https://gusku.site/game/lame-defenders",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lame Defenders\", \"description\": \"Looking for information on Lame Defenders? Check out the release date (Nov 8, 2021), developer insights from LameGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"LameGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LameGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1530580/header.jpg?t=1636442946\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}