{
    "AppID": 702320,
    "Name": "March of Empires",
    "Release date": "Dec 11, 2017",
    "About the game": "Brace yourself for an age of massive medieval war, where you will march over your rivals’ burning remains in an all-out quest to conquer! Fortify your castle, forge an army and enter the ultimate MMO of global domination! But as your civilization grows, you’ll clash with ambitious powers, and only one king can claim the throne! Do you have the strength to unify the land under your banner? Or will you watch your kingdom crumble before you? A KINGDOM IN YOUR HANDS: ∙ Dispatch armies, construct buildings, clash with barbarians, conquer territories and reshape the balance of power every day. ∙ Every inch of your realm comes to life with amazingly detailed graphics CHOOSE YOUR FACTION: ∙ Choose to be a Highland King, a Northern Tsar or a Desert Sultan. ∙ Each army has a special advantage that emphasizes a unique playstyle, whether you prefer to quickly build up your kingdom, strike with charging knights or fiercely defend your civilization from invasion. TERRITORIAL DOMINATION: ∙ Clash and conquer to grow your global influence daily. ∙ Unlock special powers and bonuses as more lands fall to your army. ∙ Fortify your defenses to ward off enemy invasions. ∙ Fight your way to the throne to become High King over the entire realm! FORGE A CHAMPION: ∙ Choose a unique Champion – ranging from those as noble as knights or as merciless as Vikings – to lead your army and help build your kingdom. ∙ Find and craft equipment to boost your Champion’s skills. ∙ Command heroes and adventurers to set off on quests for treasures that will pave your path to the throne. BUILD A THRIVING NATION: ∙ Build regional structures that you and your many allies can benefit from. ∙ Establish thriving Trade Centers, forge sacred Temples, and clash over Stockpiles of treasure. TACTICAL MMO WARFARE: ∙ A wise king chooses battle formations carefully! Cunning tactics hold more power than massive numbers. ∙ Time your commands wisely to take advantage of the ever-changing seasons. COMMAND A GLOBAL ALLIANCE: ∙ The Alliance management system makes it easy to organize with allies. ∙ Intrigue will pave your path to the throne as you craft schemes with other Alliances. In this MMO world, there’s as much to gain from helping as there is from betraying… ∙ Chat with players to forge friendships or verbally clash with rivals. CLAIM THE SEATS OF POWER: ∙ Capture the five highly fortified castles that hold the Seat of Domain, Seat of Heroes, Seat of War, Seat of Order and Seat of Accord. ∙ Each Seat grants its controlling Alliance unique perks and the ability to propose world-changing Policies. ∙ Every player can take part, as all Policies are voted on by the entire Realm’s player population! ∙ Enter a new level of diplomacy and intrigue as your Alliance must negotiate with rivals, and players at large, in order to win the votes needed to pass the Policies you want. ∙ At the center of it all lies the Throne of Might, which only one player may rule to wield the greatest power of all! Five castles hold the crucial thrones, each possessing a unique influence over the entire realm that only one Alliance can hold. For fans of MMO strategy, Clan vs. Clan combat, epic quests, being king, and games of global domination. Download it now and forge your path to the throne!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/702320/header.jpg?t=1621417336",
    "Price": 0.0,
    "Developers": "Gameloft",
    "Publishers": "Gameloft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/702320/ss_10c7a5c65529377549d6f392bc4a4e4063557f4d.1920x1080.jpg?t=1621417336,https://cdn.akamai.steamstatic.com/steam/apps/702320/ss_2e531d3a16a89b2ca2edf4e88ae951784f6ee314.1920x1080.jpg?t=1621417336,https://cdn.akamai.steamstatic.com/steam/apps/702320/ss_1337fecaf1f71819471bf42834739860037bb056.1920x1080.jpg?t=1621417336,https://cdn.akamai.steamstatic.com/steam/apps/702320/ss_6d7f43867415dc304cf0b1b4a055341ff6e4ebfb.1920x1080.jpg?t=1621417336,https://cdn.akamai.steamstatic.com/steam/apps/702320/ss_db1e2085967e6123737a00171d34712b8a0b0c8e.1920x1080.jpg?t=1621417336",
    "Slug": "march-of-empires",
    "Meta Title": "March of Empires: Dec 11, 2017, Gameloft and Full Overview",
    "Meta Description": "Looking for information on March of Empires? Check out the release date (Dec 11, 2017), developer insights from Gameloft, and a complete game summary.",
    "Alt Text Image": "Official header image for March of Empires game - Steam 702320",
    "Canonical URL": "https://gusku.site/game/march-of-empires",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"March of Empires\", \"description\": \"Looking for information on March of Empires? Check out the release date (Dec 11, 2017), developer insights from Gameloft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gameloft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gameloft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/702320/header.jpg?t=1621417336\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}