{
    "AppID": 423810,
    "Name": "Marooners",
    "Release date": "Sep 15, 2016",
    "About the game": "Play a wild mix of fun party games agames as the action regularly switches back and forth between games. Can you handle the switcheroo chaos? Join your friends both on the couch and online while sadistically laughing at their misfortune, or come back to haunt them if you die. Run, jump and slap your way to victory! Party Game madness: experience switcheroo chaos as the action jumps between multiple intense minigames when you least expect it, or take the challenge of completing a full play through of each minigame once. Face different game types and surprise bonus stages. Pick your Marooner: a host of quirky characters to unlock and play as, 60+ hilarious weapons to unlock and use, and if you die... come back as a ghost to haunt your friends. Play Party Mode and Arena Mode: 25 different games and arena maps, as you race for treasure in Party Mode or duke it out to see who will be king of the ring in Arena Mode. Whichever mode you pick, expect the unexpected! Seamless local and online play: up to 6 players in any combination of local and online as you level up and unlock new weapons, plus full bot support to play solo and in multiplayer mode, spectator mode, streamlined matchmaker and lobby system. Marooners throws you into a chaotic mix of minigames. You’ll be switching back and forth between exotic locations, all the while grabbing as much treasure as you can. Just try not to get drowned, burned, squashed, blown up, or worse... You also have the option to experience a complete run where you play every game once to full completion, or just watch some games in spectator mode! Onward, treasure and victory await! Playing with friends in your own living room is awesome, and we support that! But maybe you want to party with friends or strangers online? No worries! People from all over the world can easily play together, and you can even combine 2-6 local and / or online players, so your local friends can play with your offline friends. And if you need some extras to make up the numbers or don't feel so sociable, you can bring in the AI pirate bots to join the game. As well as Party Mode, you can challenge your friends in Arena Mode to see who's the king of the ring! Battle it out across 12 different locations, and expect to stumble upon fresh new chaos from time to time in the form of a hidden game mode or two! Expect the unexpected, and die... we mean WIN in extreme ways! What are you waiting for, there's treasure out there! Unlock cool and quirky characters as you play, and choose your favorite. Then load up with one of 70+ unique weapons that will make your opponents think twice about messing with you! Visit our website: About the developers Marooners is being developed by game studio M2H and friends, brought together by their love of party games. M2H are veterans when it comes to developing games. In 2009, the brothers Hergaarden founded their studio, specializing in 3D Unity multiplayer games. They are known for their hugely successful realistic WW1 FPS 'Verdun' and the 'Crash Drive' free-roaming stunting series. For more information visit www.M2H.nl or talk with the developers on Discord .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/423810/header.jpg?t=1627370861",
    "Price": 9.99,
    "Developers": "M2H",
    "Publishers": "M2H",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_da3a8550af0b45bf45de8da52604b856da47a912.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_1ad81bd73c9e588600981899587b9db79d3de2f8.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_b3a099afafce7d19eaefeea81ddb347523e4fab2.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_fe10d6b066071b28621a5693b1e1973064554cb1.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_103261e70f6b8c4d95d474648111646aaa9b3d6d.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_20732e1f34626a82e9c028ae82b8bbe4dd2e5534.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_f9692e0f91d0a48386bf4a697dfd7e0b1e0fdfef.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_2a3a47deee5399ae8fd77836a9ff744411499bdd.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_8900efaa165f336263c79bbdf2f98b4d3a82c204.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_7d4f2f8efedf041efe8398f8551cef5c374dff5e.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_857e0db33122e950f7a743cd354263540205ff23.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_f3d94857f6d1d4f3e6dd1c3fd78c2aea229881ee.1920x1080.jpg?t=1627370861,https://cdn.akamai.steamstatic.com/steam/apps/423810/ss_1a6cc3de72be101f413b0df634f4a6ad2c10d5d7.1920x1080.jpg?t=1627370861",
    "Slug": "marooners",
    "Meta Title": "Marooners: Sep 15, 2016, M2H and Full Overview",
    "Meta Description": "Looking for information on Marooners? Check out the release date (Sep 15, 2016), developer insights from M2H, and a complete game summary.",
    "Alt Text Image": "Official header image for Marooners game - Steam 423810",
    "Canonical URL": "https://gusku.site/game/marooners",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Marooners\", \"description\": \"Looking for information on Marooners? Check out the release date (Sep 15, 2016), developer insights from M2H, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 15, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"M2H\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M2H\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/423810/header.jpg?t=1627370861\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}