{
    "AppID": 493840,
    "Name": "Marvel vs. Capcom: Infinite",
    "Release date": "Sep 19, 2017",
    "About the game": "GAMEPLAY OVERVIEW The epic clash between two storied universes returns with Marvel vs. Capcom: Infinite , the next era of the highly revered action-fighting game series. Marvel and Capcom universes collide like never before as iconic characters team up for action-packed player-versus-player combat. Imagined and created through a shared vision between the two companies, Marvel vs. Capcom: Infinite will feature a variety of exciting and accessible single player modes and rich multi-player content for new players and longtime fans alike. In addition to single player Arcade, Training and Mission modes, a visually stunning and immersive cinematic Story Mode will put players at the center of both universes as they battle for survival against a sinister new threat, Ultron Sigma. Marvel vs. Capcom: Infinite is being built to highlight a combination of iconic locations and fan favorite characters from both universes, including Captain Marvel and Iron Man from the Marvel side, and Ryu and Mega Man X from Capcom. GAMEPLAY FEATURES Reborn Rivalries: Universes collide once again in this all-new crossover clash for the ages, where players select their favorite Marvel and Capcom characters and engage in accessible and free-form 2v2 team battles, which allow for new gameplay dynamics never-before-seen in the franchise. Infinite Power: Choose one of the six powerful Infinity Stones from the Marvel Universe to influence the outcome of battle. Each Infinity Stone will customize characters with unique abilities and powerful game-changing effects that can quickly turn the tide of battle. Iconic Heroes: More characters join the announce roster (Captain Marvel, Iron Man, Captain America, Ryu, Mega Man X and Morrigan) in the battle for survival, including Hulk, Thor, Hawkeye, Rocket Raccoon, Chun-Li, Strider Hiryu, Chris Redfield and Ultron, bringing the current roster up to 14 characters with more to be revealed in the future. Cinematic Story: The Marvel and Capcom universes collide as heroes and villains battle together to save their merged worlds from a sinister new threat, Ultron Sigma. A combination of the robotic foes known as Ultron from the Marvel Universe and Sigma from the Capcom Universe, this psychotic villain is obsessed with infecting all organic life with a cybernetic virus. History’s greatest gathering of warriors must now unite to fight back against Ultron Sigma and save their newly formed world. Accessible Single Player Content: In addition to the cinematic story experience, players can hone their skills in a variety of accessible single player modes, including Training, Mission, and Arcade modes. Vast Multiplayer Features: Robust online modes and content including ranked and casual matches, global leaderboards, and online lobbies with spectator mode deepen the overall experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/493840/header.jpg?t=1644283149",
    "Price": 39.99,
    "Developers": "Capcom",
    "Publishers": "Capcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_cc198057414320e66b31d5d9d34c1a0ca5328114.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_b1d69e7b5df337261016218e8ec7edd39db08ac4.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_c87c48c9b4e4c5726d0b9834111f8299fbfbf709.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_c87317b381de24eca979e05aecac29c8ca66f4e4.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_cc9a450a486114a272ce99bb7da92b2b7f0b197d.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_f7dcd0da18cf9c895ffe9e6cc7372dd447d63da0.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_07af1d1add7e2de1c03919791358ed4704ec3ff0.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_50bb3796b36c5b936d17b08ab8b5ff71ffb3b55f.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_900d84291589d5775ec01ae945cd68af3b95d22c.1920x1080.jpg?t=1644283149,https://cdn.akamai.steamstatic.com/steam/apps/493840/ss_6c7bd15c8ac2b2f5b279541494b5cbfc3aac1beb.1920x1080.jpg?t=1644283149",
    "Slug": "marvel-vs-capcom-infinite",
    "Meta Title": "Marvel vs. Capcom: Infinite: Sep 19, 2017, Capcom and Ful...",
    "Meta Description": "Looking for information on Marvel vs. Capcom: Infinite? Check out the release date (Sep 19, 2017), developer insights from Capcom, and a complete game s...",
    "Alt Text Image": "Official header image for Marvel vs. Capcom: Infinite game - Steam 493840",
    "Canonical URL": "https://gusku.site/game/marvel-vs-capcom-infinite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Marvel vs. Capcom: Infinite\", \"description\": \"Looking for information on Marvel vs. Capcom: Infinite? Check out the release date (Sep 19, 2017), developer insights from Capcom, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/493840/header.jpg?t=1644283149\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}