{
    "AppID": 787510,
    "Name": "Muv-Luv Alternative Total Eclipse Remastered",
    "Release date": "Jul 20, 2022",
    "About the game": "There is hope that can only be born in the depths of despair, and a future that only hope can create... Introducing a fresh new chapter in the critically-acclaimed Muv-Luv saga! aNCHOR is proud to present Muv-Luv Alternative Total Eclipse Remastered, now officially available in English for the first time, with all the awesome action, heart-pounding music, and depression-inducing plot twists you’ve come to expect from a Muv-Luv game! *Note that this release includes only the main game, and not the 'Burning of the Imperial Capital' prelude story. Total Eclipse is a stand-alone story that plays out alongside the events of Muv-Luv Alternative , showing another perspective of humanity’s grand war against its alien foe. With fantastic art and a story written by the series' original creator, it’s a great entry point into the series! In 1973, Earth was invaded by an alien species known only as the BETA. With their massive size and seemingly endless numbers, they conquered most of Eurasia In the span of a few decades, and it’s only a matter of time before the rest of the globe falls as well. Mankind’s last hope are the Tactical Surface Fighters: powerful humanoid machines that can stand up to the alien threat. But the enemy’s numbers grow greater by the day, and we’ll need new and better weapons if we’re to have any hope of survival… May 2001. Yukon Base, Alaska, is home to Project Prominence, an international Tactical Surface Fighter (TSF) development initiative. Here, the best pilots and engineers in the world gather to make the weapons that will save mankind’s future. After his involvement in a fatal training accident, maverick American test pilot Yuuya Bridges is removed from his unit and assigned to Argus Flight, a TSF development unit based in the frigid Alaskan wastes. There, he will work with a joint American &amp; Japanese R&amp;D team to build a new, next-generation fighter for the Empire of Japan. From the moment he arrives, his cocky, anti-social attitude puts him at odds with the other members of his team, from his fellow test pilots to the project's overseer and his direct superior, the stern and by-the-book Lieutenant Takamura Yui. Yui is the daughter of a traditional samurai household, who was the only survivor of her unit during the battle where the Empire’s capital was destroyed. Traumatized by the events of the battle and devoted to her family’s code of honor, she’s dedicated herself completely to her mission, which makes her constantly clash with Yuuya. Their constant fighting soon puts the whole project in jeopardy. To make matters worse, Yuuya comes to realize that Yukon Base is rife with international intrigue, as each nation tries to steal each other’s secrets and ensure that when the war against the BETA is over, they’ll be the ones with the most powerful weapons. As the alien threat grows greater by the day, can he overcome his differences with Yui and complete the weapon that will end the BETA threat forever?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/787510/header.jpg?t=1658383169",
    "Price": 35.99,
    "Developers": "aNCHOR Inc.,fuzz, Inc.",
    "Publishers": "aNCHOR Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_0003d323b588fe197bee39527cbdbc1a0e1ffe83.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_78701d1bce4b82ffff99673cc955940d678b7d3e.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_730a87bbbee6ddecdb2e52cb489144878ea4be6b.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_3aac355abc6e8acde621d41ed2f3a916aa451bef.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_206f34015c2bed5ce53fd253396a32b422bc01d6.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_9750f0da220b3faa100523c96f359343c7a775ea.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_d9d919439d67c12700a603a93bb7de5b363d2097.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_f910957927fa91cead706f3e02585a21e5cb4eec.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_da5e67d2f10932ca9dbbf0424d725711a01a0dc3.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_b1f66d01fa8e7f3b82d153d57ce77eac322c40ce.1920x1080.jpg?t=1658383169,https://cdn.akamai.steamstatic.com/steam/apps/787510/ss_1ea2d1e31b36578b141ace8e6c17c1997d0f9654.1920x1080.jpg?t=1658383169",
    "Slug": "muv-luv-alternative-total-eclipse-remastered",
    "Meta Title": "Muv-Luv Alternative Total Eclipse Remastered: Jul 20, 202...",
    "Meta Description": "Looking for information on Muv-Luv Alternative Total Eclipse Remastered? Check out the release date (Jul 20, 2022), developer insights from aNCHOR Inc.,...",
    "Alt Text Image": "Official header image for Muv-Luv Alternative Total Eclipse Remastered game - Steam 787510",
    "Canonical URL": "https://gusku.site/game/muv-luv-alternative-total-eclipse-remastered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Muv-Luv Alternative Total Eclipse Remastered\", \"description\": \"Looking for information on Muv-Luv Alternative Total Eclipse Remastered? Check out the release date (Jul 20, 2022), developer insights from aNCHOR Inc.,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"aNCHOR Inc.,fuzz, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"aNCHOR Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/787510/header.jpg?t=1658383169\", \"offers\": {\"@type\": \"Offer\", \"price\": 35.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}