{
    "AppID": 801840,
    "Name": "Psychoballs",
    "Release date": "Mar 9, 2018",
    "About the game": "Note: I am currently working on a new ambitious platformer with unique features, please check it out . I love making small-yet-solid puzzle and arcade games with interesting mechanics. If you know Logical on the Amiga, which was released in 1991, you know what this game is all about. It was one of my favorite games back then, so when I started to develop for PC I decided to create an own game based on this mechanic. Psychoballs blends color puzzle and timing elements into a frantic experience (This game is not designed for casual players, it's getting very difficult really fast). The game comes with a level editor. If you've created some cool levels, please send them to me so I can make them available to all players. I greatly appreciate feedback and will do my best to ensure support for my games. Please contact me through Twitter , my website or the forums if you encounter something wrong with the game, something misleading on the store page or if you just want to say hello or discuss game related topics. Thank you for taking a moment to read this. I really hope you enjoy playing my game. Jochen Heizmann, Intermediaware Psychoballs is a single player puzzle game, where you try to eliminate all the spinners on the board by making them contain four balls of the same color at once. Balls travel down given paths around the board, and get caught by a spinner if an available slot is facing them. Spinners are the only parts in the game that can be controlled directly by the player. Players can rotate the spinners clockwise, and can release any of the captured balls into the pipes to move them to other spinners. The goal of the game is to move the different colored balls between the spinners in order to get four balls of the same color in any specific spinner. This straightforward task becomes more and more challenging with the addition of new gameplay elements over the course of the game. easy to learn, hard to master absorbing gameplay, that will keep you up late at night 50 mind-blowing levels new features regularly spice up the game Level-Editor included",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/801840/header.jpg?t=1588687833",
    "Price": 0.99,
    "Developers": "Intermediaware",
    "Publishers": "Intermediaware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/801840/ss_cb0da83dfa0388a3cf663d8fe58190ba62ac5b9d.1920x1080.jpg?t=1588687833,https://cdn.akamai.steamstatic.com/steam/apps/801840/ss_27c6b939137936fcbc3c4c973ba8cdda5277102a.1920x1080.jpg?t=1588687833,https://cdn.akamai.steamstatic.com/steam/apps/801840/ss_03b575d149aab37fa2746daee15d9ce81a91c173.1920x1080.jpg?t=1588687833,https://cdn.akamai.steamstatic.com/steam/apps/801840/ss_bffa667378d825aa620e5a1d040b60658a138ef9.1920x1080.jpg?t=1588687833,https://cdn.akamai.steamstatic.com/steam/apps/801840/ss_d4d9b80327ede666807830edb6790ca556fab4d0.1920x1080.jpg?t=1588687833",
    "Slug": "psychoballs",
    "Meta Title": "Psychoballs: Mar 9, 2018, Intermediaware and Full Overview",
    "Meta Description": "Looking for information on Psychoballs? Check out the release date (Mar 9, 2018), developer insights from Intermediaware, and a complete game summary.",
    "Alt Text Image": "Official header image for Psychoballs game - Steam 801840",
    "Canonical URL": "https://gusku.site/game/psychoballs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Psychoballs\", \"description\": \"Looking for information on Psychoballs? Check out the release date (Mar 9, 2018), developer insights from Intermediaware, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Intermediaware\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Intermediaware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/801840/header.jpg?t=1588687833\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}