{
    "AppID": 473540,
    "Name": "Raise Your Own Clone",
    "Release date": "Sep 6, 2016",
    "About the game": "WARNING: This is a text game and requires a lot of reading. Introducing the latest, proper interactive fiction game from CoaguCo Industries. Story 4 is now out and Story 1 is now free! The last story of the series has finally dropped. Follow Aloysius as he witnesses the end of Marsch's tale, the beginning of Madelyn's, and finds out what really happened to Dr. Stansfield. Also, Story 1 is now available, in full, for free. Click the demo button to get it! You are about to uncover four twisted tales of misadventure surrounding people connected, in some way, by the late Dr. Cyrus Stansfield's cloning machine. Within these stories you must face the ethical dilemmas and possible fortune while guiding each character to their own end. The story takes place in the city of Starkham; the same location as One Way To Die and The Dope Game , and features recognizable places and characters spanning both games. Owners of previous games will get alternate story chunks unlocked as well. In the proper fashion of text adventures, the player starts a story and navigates by making decisions at certain times to move forward. Each decision has a variety of outcomes and consequences, many of which have randomized elements to them. Before the start of each story, the player is given the opportunity to change various elements about the story, similar to Mad Libs. These changes will move forward with each story as the player progresses. The game comes with four stories which are released in episodic fashion: Story One The Addict follows the nephew of Dr. Stansfield, Marsch, after he gets out of rehab and inherits his uncle's mansion and lab. Will he fall back to old habits and ruin this opportunity or will he take advantage of it and finally improve his life while continuing the family legacy? Story Two The Doctor reveals exactly what happened to Dr. Stansfield leading to his nephew taking over. How did he die? Did he even actually die at all? Story Three The Neighbor follows a little girl, Madelyn, who stumbles into the lab after it has been condemned following the nephew's untimely mistakes. She also falls victim to the cloning machine and must not only clear her good name but stop her clone from doing further damage. Story Four The Clone is about Aloysius, one of the clones who survives Marsch's failed experiment, who tries to make sense of everything that happened since then as well as unravel the mystery of Dr. Stansfield's death. The game launched with story one, The Addict, with the additional stories to follow as episodic updates. The game also keeps track of various statistics, both personal and global, such as decisions made, random events encountered, and wins/losses over games played. Progress on each story's branches is also kept so the player can use it to experience all the different outcomes for each one, if they choose. There are also a total of twenty-five achievements broken up among the stories, five each, as well as five global ones.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/473540/header.jpg?t=1633207266",
    "Price": 0.99,
    "Developers": "CoaguCo Industries",
    "Publishers": "CoaguCo Industries",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_31cf3de039415ba28df6f441cf8ca81c0c307654.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_75329cf030f340a9563aea33276a9892894e89e3.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_e5d401b57b538089eeaa1feb9afdf520b653ffce.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_1e1dd6ba780dcb773c5e54577c603e9c579f9c3f.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_991db8fc51f285ffdaebd9dd5c5bce2fcea242c8.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_cf9adcb4aef3a07351800789549cd2c5b614172b.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_862df5b438440983a3b880d08423406f2526d1d9.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_8387e9272a64578d6c6f4867ec8683ea43ed9123.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_fa2992879c7c9135196fe33e4eca07d5e3828eb7.1920x1080.jpg?t=1633207266,https://cdn.akamai.steamstatic.com/steam/apps/473540/ss_24e0af221ba7945c62382e1fc70878b96e43b50a.1920x1080.jpg?t=1633207266",
    "Slug": "raise-your-own-clone",
    "Meta Title": "Raise Your Own Clone: Sep 6, 2016, CoaguCo Industries and...",
    "Meta Description": "Looking for information on Raise Your Own Clone? Check out the release date (Sep 6, 2016), developer insights from CoaguCo Industries, and a complete ga...",
    "Alt Text Image": "Official header image for Raise Your Own Clone game - Steam 473540",
    "Canonical URL": "https://gusku.site/game/raise-your-own-clone",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Raise Your Own Clone\", \"description\": \"Looking for information on Raise Your Own Clone? Check out the release date (Sep 6, 2016), developer insights from CoaguCo Industries, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 6, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"CoaguCo Industries\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CoaguCo Industries\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/473540/header.jpg?t=1633207266\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}