{
    "AppID": 385960,
    "Name": "Russian Front",
    "Release date": "Jul 23, 2015",
    "About the game": "Russian Front is an operational-level wargame in which you battle for the Russian Front - the pivotal moment in World War 2. Experience grand strategy across the entire theatre of the Eastern Front; the military conflict that many consider to be the iconic attacker/defender scenario. Command massive armies at your fingertips, in this fully 3D turn-based simulation of one of the largest military campaigns in history, playable as both Germans and Russians. Start in the early days of Operation Barbarossa and follow the German invasion of Russia through to its ultimate failure. Or start later in the war and jump straight into the Russian counter push to Berlin. A massive 108 turn campaign will take you from the opening stages to a final, overwhelming Russian offensive. Four shorter Operations, spanning 16 turns each, take place from June to December of each year and offer a more condensed experience. The bitter weather on the Eastern Front was as much a danger as the opposing forces, and the game reflects this with a seasonal cycle that has a profound effect on your tactics as you struggle to hold out through the vicious Winter until reinforcements arrive in Summer. Players must also deal with fog of war effects, and will be able to cut off their opponent's supply lines, while making sure their own stay secure. Key Features Play the colossal 108 turn campaign, or pick from 4 other points in history to start from. Large 3D map representing the entire Eastern Front; stretching from Berlin to Stalingrad. Play as both the Soviet and German army, each with unique tanks, vehicles and uniforms. 4 Historical Operations: Barbarossa, Case Blue, Citadel and Bagration. Real historical Corps and Armies from several countries. Strategically reinforce units in vital locations. Selectable difficulty to tailor your experience to your play style. Hours of Gameplay",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/385960/header.jpg?t=1447377017",
    "Price": 14.99,
    "Developers": "Electric Rune",
    "Publishers": "HexWar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/385960/ss_4ef12d4df59bfe4b269fedd6ed04884afebe27e3.1920x1080.jpg?t=1447377017,https://cdn.akamai.steamstatic.com/steam/apps/385960/ss_103a7b390edeeb5b5151e356464c6fc13555bf71.1920x1080.jpg?t=1447377017,https://cdn.akamai.steamstatic.com/steam/apps/385960/ss_9de977fdd4dd35a8ca4bf746525328416083127b.1920x1080.jpg?t=1447377017,https://cdn.akamai.steamstatic.com/steam/apps/385960/ss_b45a7038e861acd50ff72f74e1c417b1ae8712d8.1920x1080.jpg?t=1447377017,https://cdn.akamai.steamstatic.com/steam/apps/385960/ss_0e27e5733aef19db79c8f84714dbc04962e77433.1920x1080.jpg?t=1447377017",
    "Slug": "russian-front",
    "Meta Title": "Russian Front: Jul 23, 2015, Electric Rune and Full Overview",
    "Meta Description": "Looking for information on Russian Front? Check out the release date (Jul 23, 2015), developer insights from Electric Rune, and a complete game summary.",
    "Alt Text Image": "Official header image for Russian Front game - Steam 385960",
    "Canonical URL": "https://gusku.site/game/russian-front",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Russian Front\", \"description\": \"Looking for information on Russian Front? Check out the release date (Jul 23, 2015), developer insights from Electric Rune, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 23, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Electric Rune\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HexWar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/385960/header.jpg?t=1447377017\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}