{
    "AppID": 957810,
    "Name": "Season of War (Alpha)",
    "Release date": "Feb 19, 2019",
    "About the game": "Season of War (The story of the past) — a complete reinterpretation of the classic Adventure. Expressive presentation of the epic plot of Season of War, unusual and colourful action, music and pleasant graphics in the game will allow you to spend time with pleasure. The plot of the game! live together with Antonizar the history of his formation and Glory. Together with your colleagues, having passed through severe trials, create a Hammer guild, save Engelm, uncover the plot of Morhrok! RPG-arcade action game! The Season of War combat system has no analogues. This is a proprietary development of the SinorCreate team! It is represented by a combination of conventional shooting, typical for arcade games, using the abilities and individual techniques of the heroes, which is typical for an RPG. Juicy and bright effects and a well-thought-out balance of forces complement the energy of the fights! Each character is played absolutely differently. And the pace of the battle will only add emotions to the fight! An expressive game world! In the Season of War locations, you can feel a piece of the soul of each of the development team! There are no identical locations in the game. As the story progresses, the world changes from dim to brighter. Epic Bosses! At the end of the chapters of the game, you meet with Bosses. Each of them is unique. Everyone has their own story and motives. Gilbert: For the greedy Gilbert, only money and power are important. He is ruthless, cunning and swift. But Rastor is also not a miss. His techniques are powerful. But only the skill of the player can decide the outcome of the battle. Islock: Stop the naive and arrogant Islok. Save the magician from the consequences of rash actions. Fight him in his illusory world. We are not standing still! The game is not ready yet. But we have already released 13 updates, five of them are global. We have reworked the Gameplay, Graphics and partially the Plot! We are completing the Alpha testing and moving on to the Beta test. The output is planned: 4-5 chapters (instead of two and the beginning of the third), new Heroes, Bosses, Locations! The release is planned: for the middle of 2023. Your opinion is important to us! We are happy to communicate directly with the player if he wants! The opportunity for communication is realized. Many innovations and improvements were proposed by users. If you have any ideas, we are always happy to listen! No Donation or Microtransactions! By purchasing the game, you get a guarantee that updates will be sent to you in the future. You will not need to pay extra for anything. The game will never have donat options, and your opinion will definitely be listened to. If you bought the Game – you bought the whole game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/957810/header.jpg?t=1643728996",
    "Price": 1.99,
    "Developers": "SinorCreate",
    "Publishers": "SinorCreate",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_25237b2f69c94f596f860353726a9e65616e7529.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_e4ae7182419496b6131b5dffb0d4ee4e1c403bb2.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_7db1c687966754cd29d3898add082e00b3db8f05.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_05c330e9b6625a2a8f398503a2230bfd4886d570.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_5b567f159cd80553a1dbee00f9f31018d0b82b97.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_0064631d433e87f2ca9a312fbe7c4fcd13224b0d.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_26e3d18b04098dd10fe7dc5ea43deb8e2a178f47.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_4121c6a31313b5e251f148c61d2921f8c9cc13a1.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_dea5ba7552e19bd647cb6d7446de95363a5d7e0d.1920x1080.jpg?t=1643728996,https://cdn.akamai.steamstatic.com/steam/apps/957810/ss_b2968b82dbf89e2e17e20996c2107bec4981391c.1920x1080.jpg?t=1643728996",
    "Slug": "season-of-war-alpha",
    "Meta Title": "Season of War (Alpha): Feb 19, 2019, SinorCreate and Full...",
    "Meta Description": "Looking for information on Season of War (Alpha)? Check out the release date (Feb 19, 2019), developer insights from SinorCreate, and a complete game su...",
    "Alt Text Image": "Official header image for Season of War (Alpha) game - Steam 957810",
    "Canonical URL": "https://gusku.site/game/season-of-war-alpha",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Season of War (Alpha)\", \"description\": \"Looking for information on Season of War (Alpha)? Check out the release date (Feb 19, 2019), developer insights from SinorCreate, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"SinorCreate\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SinorCreate\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/957810/header.jpg?t=1643728996\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}