{
    "AppID": 905970,
    "Name": "Steel Crew",
    "Release date": "Oct 28, 2021",
    "About the game": "Welcome to Steel Crew! Steel Crew is a game that is all about Tank vs Tank combat where you can join the crew of a tank together with up to two of your friends. Team up and join in on the 4 on 4 Tank battle! Built for VR Steel Crew is built from the ground up with VR as its focus. It does still support other inputs than motion controllers. Gamepad and mouse and keyboard are supported in both VR and on traditional screens. Detailed interiors All tanks come with fully detailed interiors in an attempt to reproduce them as accurately as possible. Driver The driver obviously drives the tank. All tanks have a manual gearbox so there will be a lot of gear shifting. The driver has a very limited view and often depends on the commander to tell them what to do. When driving with the hatch open the driver will have a much better view and can help spot other tanks but will be vulnerable to incoming machine gun fire. The driver is also the one who can see the current 'health' of the tank. Gunner The gunner has two guns at their disposal. The main gun and a coaxial machine gun. The gunner's view is very limited and without help from the commander and driver they will have a hard time finding a target. However the gunner has a periscope and a scope with magnification. To aim the gun (using motion controllers) there are three controls. One crank to aim up/down, another one for side to side and there is also a lever to use the powered traverse for faster but less precise aiming. Commander The commander has no direct input on the tank itself but has a great view of the surroundings. The commander has a few tools to help them. They are the only player in the tank with a map that shows the position as well as the position of other friendly tanks. It also shows the capture points on the map and their current status. To help the commander spot enemy tanks they are equipped with a monocular that can be used when riding with the hatch open. Just like the driver, the commander is vulnerable to machine gun fire with their head outside the tank. The commander can also call in airstrikes and talk to other commanders in the team to synchronize their attacks.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/905970/header.jpg?t=1635441159",
    "Price": 17.99,
    "Developers": "Magnus Ander",
    "Publishers": "Magnus Ander",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/905970/ss_8b5cd10effdb17eed884995e1a5e081f99c6b6d3.1920x1080.jpg?t=1635441159,https://cdn.akamai.steamstatic.com/steam/apps/905970/ss_3dacecbd8613994fd91c602b67b4105986d883eb.1920x1080.jpg?t=1635441159,https://cdn.akamai.steamstatic.com/steam/apps/905970/ss_56fe5f5d2309930705e756bd7934c88c2a81c25e.1920x1080.jpg?t=1635441159,https://cdn.akamai.steamstatic.com/steam/apps/905970/ss_1126725e2978c92b7e825695141b7ddc747913bf.1920x1080.jpg?t=1635441159,https://cdn.akamai.steamstatic.com/steam/apps/905970/ss_d3e39b3a42584fde06119eafc99c1273712b0f41.1920x1080.jpg?t=1635441159",
    "Slug": "steel-crew",
    "Meta Title": "Steel Crew: Oct 28, 2021, Magnus Ander and Full Overview",
    "Meta Description": "Looking for information on Steel Crew? Check out the release date (Oct 28, 2021), developer insights from Magnus Ander, and a complete game summary.",
    "Alt Text Image": "Official header image for Steel Crew game - Steam 905970",
    "Canonical URL": "https://gusku.site/game/steel-crew",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Steel Crew\", \"description\": \"Looking for information on Steel Crew? Check out the release date (Oct 28, 2021), developer insights from Magnus Ander, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Magnus Ander\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Magnus Ander\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/905970/header.jpg?t=1635441159\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}