{
    "AppID": 634090,
    "Name": "Suncore Chronicles: The Tower",
    "Release date": "Apr 10, 2018",
    "About the game": "The game is designed to be played with a Gamepad! You might not enjoy it using mouse and keyboard. Suncore Chronicles: The Tower is an action roleplaying game with hack-and-slay elements. Defeat enemies, collect gear and solve riddles with up to three friends in cooperative games via Steam or LAN. Feature Overview Four different classes with unique skills and abilities Cooperative story for up to four players Various puzzles and minigames Classic Equipment System with 11 armor slots, different quality items and runewords Scaling difficulty level for every play style Lots of bossfights and special dungeons that require full groups to clear Learn new spells and abilities and find ways to unlock additional perks Unique art style and enemies in each new level of the tower Story Enter the world of Interia and save it from being thrown into darkness. Defeat hordes of enemies, from foot soldiers to mighty dragons, to make your way through a mysterious tower that appeared out of nowhere. Discover its secrets and stop the evil Scak from accomplishing his plan that would seal Interia's fate. General Gameplay Suncore Chronicles: The Tower mixes several genres to give a fresh and unique gameplay experience. Beside classical action adventure elements like puzzle solving, minigames, combat and looting in a third person setting, the game also includes several other gameplay elements. Those involve platforming sections with 2D movement or 'Beat em up' styled levels, which are influenced by the good old console or arcade classics. Combat System Suncore Chronicles: The Tower has a fast paced realtime combat system, focussing on dodging enemy abilities, crowd control and using your strong abilities if the timing and positioning allows for it. The numerous bosses require the player to figure out the mechanics and timings to be able to succeed. The game also includes special dungeons meant for group play, which can require a whole group of four players to coordinate their actions in a reasonable way. Specializations and Skills The player can change between four different specializations at any time in the game, which include two melee classes and two more range oriented caster classes. Each class has their own abilities, which can be learned throughout the game. Abilities can be leveled up to increase their strength and add additional perks. In addition, each class has a specific strength like inceased health or a higher chance to perform critical strikes. Equipment System Each enemy in the game can drop loot of different kind and quality, including armor, weapons, materials for upgrades, runes, recipes for runewords and more. The player can save all of his equipment in sets, which (like the specialization) can be changed at any time to fit the current play style. High quality pieces of equipment can modify player abilities, proc certain effects or even form powerful sets. Development Philosophy The base version of the game is free to play, allowing the player to get to know the main features and feeling of the game. However, the world is restricted to the starting areas, including two tutorial sections and the first world regions. The game will be extended frequently with low cost DLCs that include new features and add more regions, enemies and of course loot. For optimal experience, it is recommended to play with a gamepad.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/634090/header.jpg?t=1523692945",
    "Price": 0.0,
    "Developers": "Inner World Games",
    "Publishers": "Inner World Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/634090/ss_21959a976ab21402d9c4a42b6854ac5aa2135488.1920x1080.jpg?t=1523692945,https://cdn.akamai.steamstatic.com/steam/apps/634090/ss_2717140f741a84619562a4c503c0f769af7980dc.1920x1080.jpg?t=1523692945,https://cdn.akamai.steamstatic.com/steam/apps/634090/ss_8d18658f4dc53b73f6b046f3930f1e3f6be6b688.1920x1080.jpg?t=1523692945,https://cdn.akamai.steamstatic.com/steam/apps/634090/ss_78bc96b2e5e998d158dd767988a78bf5b626ed92.1920x1080.jpg?t=1523692945,https://cdn.akamai.steamstatic.com/steam/apps/634090/ss_37cd7b4f919d310e9384810cd46893e4b1ed1325.1920x1080.jpg?t=1523692945",
    "Slug": "suncore-chronicles-the-tower",
    "Meta Title": "Suncore Chronicles: The Tower: Apr 10, 2018, Inner World ...",
    "Meta Description": "Looking for information on Suncore Chronicles: The Tower? Check out the release date (Apr 10, 2018), developer insights from Inner World Games, and a co...",
    "Alt Text Image": "Official header image for Suncore Chronicles: The Tower game - Steam 634090",
    "Canonical URL": "https://gusku.site/game/suncore-chronicles-the-tower",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Suncore Chronicles: The Tower\", \"description\": \"Looking for information on Suncore Chronicles: The Tower? Check out the release date (Apr 10, 2018), developer insights from Inner World Games, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Inner World Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Inner World Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/634090/header.jpg?t=1523692945\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}