{
    "AppID": 1307670,
    "Name": "The Unexpected Quest",
    "Release date": "Nov 27, 2020",
    "About the game": "An adventure game with strategy and management elements in a medieval fantasy setting - drawing inspiration from classics such as Warcraft 3 and The Settlers. Embark on quests, hunt down treasures and manage your resources as you build, battle, cast magic and brew potions to bring order to a world on the brink of disaster. EXPLORE Strange creatures living in different locations await you. Some of them will help you, others need your help, and others will take a liking to your head...or, rather, your fresh brains. You will visit quiet villages, snow-capped mountaintops, impenetrable forests, and foul-smelling swamps. But one thing will remain the same - adventure awaits you everywhere! GATHER RESOURCES Collect everything that isn't bolted to the floor! Dwarves don't mind work, but they won't lift a finger on an empty stomach. You can't build a working mill out of mud and sticks, so you'll have to search for the appropriate materials. Keep food stocked and resources plentiful and your world will expand! BUILD Build bridges over turbulent rivers, build docks in the swamps, repair buildings, and build new ones! Mills will provide food, sawmills will provide building materials, forges will improve equipment - and you can always sell the surplus at the market. Many building styles and colors await you in the game. GO QUESTING The citizens of the world have always had many problems to overcome and quests to embark on. Try to help everyone you can, and reap the rewards of your labours. You can also always count on what's most important: sincere words of gratitude*. * Computer game characters don't have real feelings or minds. FIGHT You can get much further with a kind word and a sword than you can with a kind word alone. Hire experienced soldiers, upgrade their armour and weapons, fight, and conquer. Whoever said the pen is mightier than the sword has never been on the receiving end of a Claymore! And with the ‘Tales’ mode introduced in the latest update, battles will be more exciting than ever. Choose from 3 difficulty levels as you play the two initial chapters dedicated to battles. CAST SPELLS Not enough food or materials? Are your soldiers dying from their wounds? Did the workers decide to create a union? Magic items and potions will remedy the situation! Save up your gold, complete quests, and plunder chests. There are many ways to get magic items!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1307670/header.jpg?t=1644417565",
    "Price": 12.99,
    "Developers": "Rionix",
    "Publishers": "PQube",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_f3868248b7ea3f63e4a982ef94a29280f12d566f.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_39d0ff3e4284d3f751e79e6a1da5d75d9590dc95.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_f5f3baaec8ff3e90d2ebfa2a7b8ac55d2d6fa406.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_17ef87c31cdbbb706212182fb71c185b122cc2e3.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_e80a33ae59e71f2841b6c9253be6241a091c3577.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_de5ec35e0a69967d43edd362880b311baffc4bdd.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_22be8cd79c336183c7b6575e8935b4aafc0e6736.1920x1080.jpg?t=1644417565,https://cdn.akamai.steamstatic.com/steam/apps/1307670/ss_5a5c84f327bada41ff79c177b1ab383fcb3af836.1920x1080.jpg?t=1644417565",
    "Slug": "the-unexpected-quest",
    "Meta Title": "The Unexpected Quest: Nov 27, 2020, Rionix and Full Overview",
    "Meta Description": "Looking for information on The Unexpected Quest? Check out the release date (Nov 27, 2020), developer insights from Rionix, and a complete game summary.",
    "Alt Text Image": "Official header image for The Unexpected Quest game - Steam 1307670",
    "Canonical URL": "https://gusku.site/game/the-unexpected-quest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Unexpected Quest\", \"description\": \"Looking for information on The Unexpected Quest? Check out the release date (Nov 27, 2020), developer insights from Rionix, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rionix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PQube\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1307670/header.jpg?t=1644417565\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}