{
    "AppID": 1058320,
    "Name": "Toki",
    "Release date": "Jun 7, 2019",
    "About the game": "The return of the wacky monkey! Toki sets off on a new adventure! The cult action/platform game originally released on arcade machines in 1989 is back with a super-simian new version, featuring all-new hand-drawn graphics and re-orchestrated music! Toki the warrior lived peacefully in the jungle with his sweetheart Miho. Appearing out of nowhere, the terrifying voodoo sorcerer Vookimedlo and heinous demon Bashtar kidnap Miho and turn the poor Toki into a chimpanzee! Unfortunately for his sweetheart, he has become a hairy, lethargic ape... Rediscover Toki 30 years on: Playing as Toki, explore lush environments invaded by foul creatures! The Labyrinth, Neptune Lake, the Cave of Fire, the Ice Palace, the Jungle of Darkness and the Golden Palace are infested with Vookimedlo's lackeys. Saving Miho won't be easy! These despicable and terrifying beings have friendly names like Boloragog, Rambacha, Mogulvar, Zorzamoth and Bashtar... And if Toki's looks are anything to go by it will be no walk in the park! You'll have to make the best of it to succeed. Luckily, Toki can walk, jump, swim, climb and spit! That's right, he uses his saliva to great effect to dispose of his enemies… Rise to the legendary difficulty of the Golden Age of video games: 'Insert coin'… Remember spending all your hard-earned pocket on the arcade machines to complete your favorite games? Now you can enjoy the same challenging gameplay without breaking the piggy bank. Put your name at the top of the high score table! Rookie players can also enjoy the game with a new easier mode. A masterfully made remake: The game has been entirely redrawn by hand by Philippe Dessoly, illustrator of well-known manga cartoons, such as Captain Harlock and UFO Robot Grendizer, comics and video games. He also worked on the Amiga version of Toki back in 1991 and the game Mr. Nutz in 1992. His drawings have further improved Toki's apish good looks. The music has been fully re-orchestrated by composer Raphaël Gesqua, providing a retro and modern soundtrack for Toki's adventure. This award-winning composer has created the music for more than one hundred video games. On the technical side, developer Pierre Adane has worked tirelessly to bring this thrilling experience to life. He also worked on Mr. Nutz (1992) and created the tennis game Top Spin (2003).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1058320/header.jpg?t=1654849414",
    "Price": 19.99,
    "Developers": "Microids",
    "Publishers": "Microids",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_6e1f8bd26784e8976439488502e1a501af33c587.1920x1080.jpg?t=1654849414,https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_ebb3668109cf1ccd8e26b410967c02eb7fb4ae38.1920x1080.jpg?t=1654849414,https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_5fa6e37d0e94ccbe93e1787f782e656717101ebb.1920x1080.jpg?t=1654849414,https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_06c6de6aa5d827b55cfce875ff1924ad94465b9b.1920x1080.jpg?t=1654849414,https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_97d56f4e1fb6e3dda7799d67f95a9175828c31e7.1920x1080.jpg?t=1654849414,https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_f33bdf4c364d365a140f5a347fa5c406d3cfdb12.1920x1080.jpg?t=1654849414,https://cdn.akamai.steamstatic.com/steam/apps/1058320/ss_7996d4c455d9cd49f6c54295bb07cdf9d144c10f.1920x1080.jpg?t=1654849414",
    "Slug": "toki",
    "Meta Title": "Toki: Jun 7, 2019, Microids and Full Overview",
    "Meta Description": "Looking for information on Toki? Check out the release date (Jun 7, 2019), developer insights from Microids, and a complete game summary.",
    "Alt Text Image": "Official header image for Toki game - Steam 1058320",
    "Canonical URL": "https://gusku.site/game/toki",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Toki\", \"description\": \"Looking for information on Toki? Check out the release date (Jun 7, 2019), developer insights from Microids, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Microids\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Microids\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1058320/header.jpg?t=1654849414\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}