{
    "AppID": 1270670,
    "Name": "Touhou Double Focus",
    "Release date": "May 25, 2021",
    "About the game": "INTRODUCTION The Touhou derivative exploration action game Double Focus is now on Steam! Control crow tengu journalist Aya Shameimaru and low-ranking patrol tengu Momiji Inubashiri and explore the world inside a book! Explore the map to find hidden areas with skills and items that will serve Aya and Momiji well in battle. Aim for 100% map coverage and item completion! This game also includes more forgiving difficulty modes for people not used to playing action games. Come explore the book world and find everything there is to find! GAME OVERVIEW ◆The setting: a world inside a picture book?! Aya and Momiji get sucked into a youma book inside Suzunaan, which whisks them to a whole new world. The youma book steals their powers, leaving them weakened, but they take Kosuzu's advice and set out to do some exploration under the guise of journalism. What awaits them in this new world where the logic of Gensokyo doesn't apply? This is an action-exploration game where you cover a giant map and seek out the mysteries of this new world! ◆Alternate your battles! Aya and Momiji, Double Players! In this game, you can switch between controlling Aya and Momiji. Aya specializes in long-range combat, as well as midair hovering and air dashes. Momiji specializes in close-quarters combat, and she can run on walls and across long distances. Make use of their specialties and pick the right person for each fight! Some skills are shared between both characters, while others are unique to one character. You can use these skills to break through walls, etc, and reach areas you couldn't get to before! ◆Gensokyo friends stuck in the other world Aya and Momiji will find plenty of Gensokyo natives aside from themselves that got sucked into this alternate world. Some of them need your help. Others will think you are behind the incident and attack you. You'll need their help to get out of this world, so get their cooperation by any means necessary. Some of them will even support you in battle! ◆Cover all ground and get every item! This game's map isn't just big; it's also full of hidden areas. Some of them have skills and items that will greatly help Aya and Momiji in battle. If you think there's more to an area than meets the eye, explore it and see what you can find. A journey of a thousand miles begins with a single step. Reporters are masters of legwork. Put in that legwork and get 100% completion for map coverage and item collection! FAQ ◆Saving This game lets you save your progress by talking to a statue of Eiki Shiki, Yamaxanadu in your base. You will get sent back to your last save when you die, so be sure to save often. ◆Quitting the game Select Quit from the title screen to quit the game. When playing, you can bring up the settings menu and choose Return to Title to go back to the title screen. ◆Keyboard controls MENU CONTROL KEY CONFIG Cursor up: W Cursor down: S Cursor left: A Cursor right: D Confirm: K Cancel: L Talk/Options: I Tab Left: Q Tab Right: E MENU SCREEN KEY CONFIG Menu: 1 Mini-map: 2 Snapshot Archive: 3 Settings: 4 Skip Movie: ESC IN-GAME MOVEMENT KEY CONFIG Run left: A Run right: D Flap wings/wall run: W Crouch: S Jump: K IN-GAME SKILL KEY CONFIG Skill 1: J Skill 2: I Skill 3: L Swap character: V Step/guard: O Swap skillset left: Q Swap skillset right: E CHANGING KEY CONFIG Go to Settings on the title screen menu, then Keyboard Inputs, where you can reassign each key. Note: The only button you can reassign in Controller Inputs is the confirm button. Everything else is locked to default. ◆Environment-Dependence Settings The game does not start Depending on the driver you are using, an error may occur at the first startup. In this case, you may be able to solve it by following instructions below. 1. ''LIBRARY'' &gt; Right-click the ''Touhou Double Focus'' and select ''Properties'' 2. Click the ''LOCAL FILES'' tab &gt; ''Browse'' 3. Right-click ''DoubleFocusHD.exe'' and select ''Properties'' 4. Open the ''Compatibility'' tab, check ''Disable fullscreen optimizations'', then click ''OK'' to save The gamepad is not recognized Settings may be required depending on the gamepad you are using. 1. Start Steam and open ''Settings'' 2. Open ''GENERAL CONTROLLER SETTINGS'' from the ''Controller'' tab 3. Make settings according to the gamepad used",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1270670/header.jpg?t=1622004758",
    "Price": 10.99,
    "Developers": "AQUASTYLE",
    "Publishers": "AQUASTYLE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_1cb6bb78fe1f7e965c629f43ebe92b606c401e2b.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_341122ef848c5a1b383bdae9dc44f1274ead66ae.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_4979281115558d2c881d35c27ef203bad5546118.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_128907f3311a927c5f4f0e2846807ca988d8f90c.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_ada6af30d1679b2bc5238b1a21fce55b923de785.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_6f8acac96183a86cf8b5b529602f9d9680d07ba0.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_528ccad991bed17097a52f3363e2bb2077c3e9d5.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_4519742a35ed03b3256b7816ece96e7416c47e02.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_8e2f44e63ae131ed4611afdc76e532a0099bce02.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_e5180c179d4d6e304ad96634616f228ce602b7f2.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_ee2ce7bd5041505bdd5750d36f56c926f60de154.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_3fa147902b2103523867b9845090143acac5135c.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_e7b52b488cc6d73c1a03070c6ec29a353ada474d.1920x1080.jpg?t=1622004758,https://cdn.akamai.steamstatic.com/steam/apps/1270670/ss_43e262e38d3ad92bd030cf1860dc843865440de4.1920x1080.jpg?t=1622004758",
    "Slug": "touhou-double-focus",
    "Meta Title": "Touhou Double Focus: May 25, 2021, AQUASTYLE and Full Ove...",
    "Meta Description": "Looking for information on Touhou Double Focus? Check out the release date (May 25, 2021), developer insights from AQUASTYLE, and a complete game summary.",
    "Alt Text Image": "Official header image for Touhou Double Focus game - Steam 1270670",
    "Canonical URL": "https://gusku.site/game/touhou-double-focus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Touhou Double Focus\", \"description\": \"Looking for information on Touhou Double Focus? Check out the release date (May 25, 2021), developer insights from AQUASTYLE, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"AQUASTYLE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AQUASTYLE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1270670/header.jpg?t=1622004758\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}