{
    "AppID": 1840150,
    "Name": "Vigorus",
    "Release date": "Mar 3, 2022",
    "About the game": "Vigorus is a visually stunning rhythm platformer, a musical adventure into a bizarre world, with a talking frog puppet as your guide. Observe the enemies - mirages, and leverage the beat to lead the pas de deux with the enemies at the correct timing. While playing, become our girl Vigorus, retrieve the memory once was lost, and help your little companion to save the world from monsters that look like a beautiful nightmare. GAME PLAY Follow the Rhythm, Action On the Beat The grooving beats take the lead of everything. Player control Vigorus to move, attack, defense, and all the actions base on beats. Leveraging all your skills, survive from enemies Melee enemy, bullet enemy, laser enemy, buff enemy, aggressive boss…This mysterious world is being violated! Retrieve Vigorus’s memory and Digging the truth of this world 'I wake up at the bottom of the sea, with no memory of my past, then I meet Marty...a frog puppet. He asks me to save the world with him?' ABOUT US Hello everyone! We are Hagicians, an independent game development team with 6 cool guys, and the game Vigorus was developed over a year and a half. The game started as a capstone project in our master school, and after graduation, we all move forward and now team members are located in different time zones, but still leveraging leisure time to polish the game and finally bring it to this platform : ) Vigorus is a visually stunning rhythm platformer, a musical adventure into a bizarre world. Rhythm constitutes the whole of this world, take action with the rhythm, go towards the abyss of the mysterious world. The core mechanics of Vigorus have elements inspired by rhythm games, 2D platformer games, and strategy games. For this project, we aim to deliver a complete game experience that includes battle, narrative, original music, and art, so we included talents of all sorts in our team composition. On the other hand, all team members love the animation Puella Magi Madoka Magica, which also became the inspiration for this game. This game is currently in the testing stage, there are still unpolished parts, if you encounter problems in the game or have ideas and suggestions, please feel free to contact us, every piece of your feedback is extremely important to us, our email address is: Every piece of your feedback is incredibly important to us! Our email address is hagicians.official@gmail.com Every piece of your feedback is incredibly important to us! Want to know more about Vigorus &amp; Hagicians? Follow&amp;Support us here: Twitter: @hagicians Weibo: @薇尔与小迪Vigorus If you have any ideas and suggestions, don’t hesitate to contact us!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1840150/header.jpg?t=1651360595",
    "Price": 0.0,
    "Developers": "Hagicians",
    "Publishers": "MAGIC Spell Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_14ff6f583dbd3492f096ffa2aca7fefdb0541e1e.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_e4823bc4563d15dd32560025a48443aa6e7cea35.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_ba2686584d9d536f8868d963494411ba0d5795d5.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_6520bf5da946335f75521ca0d3ab6dd1c8015998.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_4efd38654fd5e564ef02281a403b8c77022cbfd7.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_9a9f60d87ea8b07cc503da21763f90138669a2f4.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_8b0ce8fde6a181d98a2e3221b71e4fda4ac91f7c.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_72a121fb0cc25b94acdc4739890389e0376be156.1920x1080.jpg?t=1651360595,https://cdn.akamai.steamstatic.com/steam/apps/1840150/ss_19bf4d908818bda7b8fb8663846d56935d3079f1.1920x1080.jpg?t=1651360595",
    "Slug": "vigorus",
    "Meta Title": "Vigorus: Mar 3, 2022, Hagicians and Full Overview",
    "Meta Description": "Looking for information on Vigorus? Check out the release date (Mar 3, 2022), developer insights from Hagicians, and a complete game summary.",
    "Alt Text Image": "Official header image for Vigorus game - Steam 1840150",
    "Canonical URL": "https://gusku.site/game/vigorus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vigorus\", \"description\": \"Looking for information on Vigorus? Check out the release date (Mar 3, 2022), developer insights from Hagicians, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hagicians\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIC Spell Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1840150/header.jpg?t=1651360595\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}