{
    "AppID": 748480,
    "Name": "Wild Romance: Mofu Mofu Edition",
    "Release date": "Nov 20, 2017",
    "About the game": "Cherry Kiss Games has acquired the Steam rights to Wild Romance and as our first new product we are excited to bring you Wild Romance: Mofu Mofu Edition, an updated and expanded version of the game. New features include changing screen resolution to 16:9, adding sprite animations and overhauling the UI. The game also includes all of the mature content that was missing in the original version! We listened to your comments in the Wild Romance forum and we hope you'll be pleased with what we've prepared. Unhappy with his life in Tokyo, Kazuma returns to his hometown in the Japanese countryside where he reconnects with four female classmates. When the girls accidentally reveal that they are not mere humans but actually magical animal spirits in human form, a journey of discovery and constant flirtation begins. Sumire is the fox and leader of the pack. She has a motherhood instinct and a deep desire for physical contact. Tsubaki is the cat and second in command. She knows what she wants and she's determined to get it. Aoi is the dog and the youngest of the four. She's obedient, full of energy and always wanting to please her male companion. The final girl, Nazuna is the tanuki or Japanese raccon. She's smart with a seductively creative mind but also a bit of a troublemaker. Follow the story of Kazuma as he learns the hidden secrets of his hometown and discovers the supernatural world. His adventures include mountain picnics, summer festivals, run-ins with the gods and skinny dipping in a natural hot spring. In Japanese folklore, yokai are magical creatures or supernatural spirits and are often an element of fantasy fiction. Norn/Miel, the developer of the game, is a leading Japanese studio with several titles in this style. Translated version of the original Japanese Visual Novel Original artwork HD upscaled with 16:9 and 4:3 variants Hours of story content Main female characters fully voiced with original Japanese dialogue Enhanced with character sprite animations Gallery and Scene selections ** PLEASE NOTE ** When Wild Romance: Mofu Mofu Edition was released the rules about explicit adult content were different and a separate patch file was required. All of the sexy content is now included automatically in the game download. All characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game. For more information about the game please check out our website or follow us on Twitter.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/748480/header.jpg?t=1646343268",
    "Price": 14.99,
    "Developers": "Norn",
    "Publishers": "Cherry Kiss Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_d162ce3b63653dcf5850181b43107a69c3156c28.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_f00f123970020be886acb8726e79cd45e56ce1a6.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_de2ffebffd930c6b9a3919fca76f667fd29ea80b.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_ab18e2c46c6467da9e11656c4bb71963161877b8.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_2b0b0ef050140b6c5ca1d0a4f6b7154c841bfc2e.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_ac84f8365274557ae379828c232d454484f74e26.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_22448b97a5c8682af5de1f501130a1b3a43434fe.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_2b04eb105e86476f52dfdf58c05f96ca8768d4a4.1920x1080.jpg?t=1646343268,https://cdn.akamai.steamstatic.com/steam/apps/748480/ss_93634755f699dae709573a12054c6b0f38288666.1920x1080.jpg?t=1646343268",
    "Slug": "wild-romance-mofu-mofu-edition",
    "Meta Title": "Wild Romance: Mofu Mofu Edition: Nov 20, 2017, Norn and F...",
    "Meta Description": "Looking for information on Wild Romance: Mofu Mofu Edition? Check out the release date (Nov 20, 2017), developer insights from Norn, and a complete game...",
    "Alt Text Image": "Official header image for Wild Romance: Mofu Mofu Edition game - Steam 748480",
    "Canonical URL": "https://gusku.site/game/wild-romance-mofu-mofu-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wild Romance: Mofu Mofu Edition\", \"description\": \"Looking for information on Wild Romance: Mofu Mofu Edition? Check out the release date (Nov 20, 2017), developer insights from Norn, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Norn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cherry Kiss Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/748480/header.jpg?t=1646343268\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}