{
    "AppID": 855630,
    "Name": "Zeliria Sanctuary",
    "Release date": "Jan 6, 2019",
    "About the game": "As a result of the experiment, the main character of the game, Maxx goes through a portal gate from Earth to an amazing planet where everlasting summer reigns. A planet with tropical forests and no highways. A planet where sakura does not bloom, but TWIT grows. A planet, where there are seductive assassins and kings' tyranny. Here you can found not only cat-girls, but even purple hamsters, who have enormous power. Was it his fault or some divine intervention? Why did he agree to the experiment? Can he go back or just starlight will remind him of home? Will he enjoy wonderful everyday here or die ignominiously? Past life is gone forever and you need to solve the riddles of the new planet and build relationships with new friends. In this world, everything is not so simple and Maxx needs to decide who he can trust and who can stab him in the back. Gradually, the question how to get back is less and less relevant for our hero. Our game is a unique mix of two styles. You'll get opening and closing arts in real-style and the rest game in anime. A colorful and dynamic adult story about the adventures of special forces soldier Maxx in the mysterious world of Zeliria. Zeliria... A dangerous, still beautiful planet, where neko live side by side with knights. A game where you decide the fate of the hero. Our visual novel combines fantasy, drama, romance, humor, thriller, and of course beautiful girls and fluffy (not)humster. Where did the squid come from?! about 15 Hours Of Gameplay 100+ arts 30+ Realistic Backgrounds Multiplatform Piles of additional materials: Bestiary, Pantheon of Zeliria, History of the World, etc; dynamic and Exciting story; a lot of choices that cardinally influence the further events; 11 different endings (not counting the bad endings!); 2 open endings; three girls, each with her own story and several possible endings; carefully crafted world with its own laws and history; vivid unique characters; variety of fantastic beasts that you will not find anywhere else; fantastic humor and selective sarcasm; stunning scenery; final arts in realistic style; and of coursel scenes about love !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/855630/header.jpg?t=1644951956",
    "Price": 9.99,
    "Developers": "Salangan Games",
    "Publishers": "Phoenix_co",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/855630/ss_c793135e3f247c9d9cd259b1cc9af4930404d017.1920x1080.jpg?t=1644951956,https://cdn.akamai.steamstatic.com/steam/apps/855630/ss_e65d55c859527dd19d628e574a533abebd7563b0.1920x1080.jpg?t=1644951956,https://cdn.akamai.steamstatic.com/steam/apps/855630/ss_06c6405083a7240a9a411571932db409c258d36f.1920x1080.jpg?t=1644951956,https://cdn.akamai.steamstatic.com/steam/apps/855630/ss_1d6b78965b4b67b4d90a0a4247da77fb0b8c51b7.1920x1080.jpg?t=1644951956,https://cdn.akamai.steamstatic.com/steam/apps/855630/ss_3e647925ec7073714b7c792ea53959620586c481.1920x1080.jpg?t=1644951956,https://cdn.akamai.steamstatic.com/steam/apps/855630/ss_6e800cdc92fc4cd13696307c69ba7353222375ee.1920x1080.jpg?t=1644951956",
    "Slug": "zeliria-sanctuary",
    "Meta Title": "Zeliria Sanctuary: Jan 6, 2019, Salangan Games and Full O...",
    "Meta Description": "Looking for information on Zeliria Sanctuary? Check out the release date (Jan 6, 2019), developer insights from Salangan Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Zeliria Sanctuary game - Steam 855630",
    "Canonical URL": "https://gusku.site/game/zeliria-sanctuary",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zeliria Sanctuary\", \"description\": \"Looking for information on Zeliria Sanctuary? Check out the release date (Jan 6, 2019), developer insights from Salangan Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Salangan Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Phoenix_co\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/855630/header.jpg?t=1644951956\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}