{
    "AppID": 2137630,
    "Name": "吞食天地2022",
    "Release date": "Sep 30, 2022",
    "About the game": "《Tun Shi Tian Di 2022》 is a traditional large-scale turn-based role-playing game. The game tells the legendary story of the three brothers Liu Guan and Zhang from becoming brothers in Taoyuan to unifying the world. This work contains seven chapters Stage1 'Fight against Yuan Shu' Stage2 'Battle of Guandu' Stage3 'Fengyun of Jingzhou' Stage4 'Battle of Chibi' Stage 5 'Southern Expedition to Four Counties' Stage 6 'Take Xishu Outsmart' Stage 7 'Northern Expedition to Central Plains' Turn-based system and special gameplay In this work, there are hundreds of generals on the stage. Players may encounter well-known historical generals in the wild. After defeating them, they will have the opportunity to obtain hidden items. In this work, a wealth of organs are provided for players to explore. In this game, the number of hidden objects that can be found is close to hundreds. In this work, players can deal with different enemies by changing different formations. In this work, each character's nirvana is unique, and each character can play their own functions. In this work, a variety of treasures can be obtained through script and hidden, and these treasures can be used to improve our combat ability. In this work, the equipment can enhance the basic attributes of the generals through specific props, and the fighting strength of the generals after the attributes are improved can be greatly improved. In this work, battle statistics are provided, and you can see the benefits players get in battle. Chapter 1 Attack Yuan Shu Yuan Shu of Huainan became emperor, and Cao Cao, who hijacked the emperor and commanded the princes, ordered Liu Bei to attack the pseudo-emperor Yuan Shu and eliminated Yuan Shu. Because Liu Bei and Dong Cheng's plot to assassinate Cao Cao was leaked, Liu Bei returned to Xuzhou City and killed Cao Cao's cronies Che Zhou. Therefore, Cao Cao's heavy troops encircled and suppressed. Because of the disparity in strength between the two sides, Liu Bei could only retreat. During the retreat, the three Taoyuan brothers were separated, and Liu Bei had to temporarily turn to Yuan Shao. Chapter 2 War of Guandu Yuan Shao sent Yan Liang and Wen Chou to attack Cao Cao successively, but they were both beheaded by the mysterious general (Guan Yu). Yuan Shao questioned Liu Bei, and Liu Bei wrote to recall Guan Yu, who had temporarily surrendered to Cao Cao. Guan Yu went all the way to Hebei, subdued Zhou Cang and met Zhang Fei and Zhao Yun in the ancient city. After Liu Bei learned that Guan Yu had arrived, in order to break away from Yuan Shao, Liu Bei proposed a joint crusade against Cao Cao with Jingzhou Liu Biao, and took the opportunity to put forward a proposal. After Yuan Shao agreed to the request of the envoy to Jingzhou, Liu Bei joined Guan Yu and others, and immediately left Hebei and came to Jingzhou! Because Liu Biao refused to go out and Yuan Shao was stubborn, Cao Cao finally defeated Yuan Shao, the prince with the most troops in the world! Chapter 3 Story of Jingzhou After Liu Bei arrived in Jingzhou, although Liu Biao did not accept the proposal to form an alliance with Yuan Shao to fight against Cao Cao, Liu Biao was very kind to Liu Bei, and Liu Biao sent Xinye City to Liu Bei to let him garrison. Liu Biao's subordinate Cai Mao planned to assassinate Liu Bei in order to support Liu Cong as the master of Jingzhou. With the help of Yi Ji and others, Liu Bei escaped from the secret passage to Mr. Shuijing's house, and learned from Mr. Shuijing that 'Wolong and Fengchu' , the two can get one, and the world can be safe.” And Wolong, Zhuge Liang, lived in a thatched cottage in the east of Jingzhou. Liu Bei visited Zhuge Liang's house many times, and his hard work paid off, and finally moved Zhuge Liang. At this point, Zhuge Kongming, a famous military advisor in Chinese history, decided to come out to assist Liu Bei. Chapter 4 War of Chibi After Cao Cao defeated Yuan Shao, after a few years, he completely wiped out Yuan Shao's remnant army, and finally unified the north and became the most powerful prince in the world. At this moment, Liu Biao died of illness. Cai Mao established Liu Biao's second son Liu Cong as the lord of Jingzhou, and led the Jingzhou army to surrender to Cao Cao. Liu Bei fled to Jiangxia and joined forces with Liu Qi to resist Cao Cao. Liu Bei decided to form an alliance with Sun Quan of the Eastern Wu Dynasty in order to compete with Cao Cao. Sun Liu's coalition forces confronted Cao's army in Chibi. Under the planning of Zhuge Liang and Zhou Yu who are Governor of Eastern Wu Dynasty, they decided on a battle plan to burn the warships. With the help of Mr. Fengchu, Sun and Liu's coalition successfully let Cao's warships go together, in order to weaken the combat effectiveness of Cao Cao's navy, Zhuge Liang designed to get rid of Cai Mao, the commander of Cao's navy. In the end, Kongming borrowed the east wind. Millions of Cao's troops were beaten by Sun and Liu's allied forces in Chibi, and Cao's vitality was severely damaged. Cao Cao had to lead the main force back to Xuchang! Chapter 5 Attack the Cities near Jingzhou After the Battle of Chibi, Liu Bei planned to occupy all the nine counties of Jingxiang. After capturing Jingzhou, Xiangyang and Yiling, under the guidance of the Ma Liang brothers, Liu Bei's army set a strategy of attacking the four southern counties. , Huang Zhong and Wei Yan returned to Liu Bei, and Lv Bu, who was hiding near the four southern counties, attacked Guiyang while Liu Bei's army was exhausted after attacking the four counties. Afterwards, Liu Bei's army returned to Guiyang and defeated Lv Bu. At this point ,all the nine counties of Jingxiang belong to Liu Bei! Chapter 6 capture Sichuan Yizhou Zhangsong came to Jingzhou, presented a map of Xishu, and persuaded Liu Bei to attack Chuanshu. At this time, Zhang Lu launched a large-scale attack on Liu Zhang. Zhang Song took the opportunity to persuade Liu Zhang to invite Liu Bei to enter Sichuan to defend against Zhang Lu. Liu Zhang agreed. Later, Liu Bei's army entered Sichuan and defeated Zhang Lu. After Zhang Lu's defeat, Liu Zhang pretended to reward him in Fushui City. The army tricked Liu Bei's army to come to Fucheng, and ambushed Liu Bei's army under Fushui city. At this point, Liu Bei and Liu Zhang became enemies. He ambushed and killed Liu Bei's military advisor Pang Tong. After that, Zhuge Liang led the Jingzhou army to support him. After that, Liu Bei's army was in full swing. After capturing Liu Zhang's last city, Chengdu, all the land of Sichuan and Shu belonged to Liu Bei. So far , Liu Bei sits on the Jingxiang nine counties and Chuanshu, and has become a prince with the same strength as Cao Cao, and the three-legged situation is formed! Chapter 7 Attack Wei State Under the guidance of Zhuge Liang's Northern Expedition policy, Liu Bei's army first captured Hanzhong, where Xiahou Yuan was holding, laying the foundation for the Northern Expedition. After a series of attacks, he subdued Jiang Wei, who was both intelligent and brave, and broke through the city of Lu, which was garrisoned by Cao Cao. After Cao Cao's defeat, he retreated to Hulu Valley. In the battle of Hulu Valley, Cao Cao was defeated by Liu Bei's army. , his son Cao Pi wanted to avenge his father but was usurped by Sima Yi. In the end, Liu Bei's army defeated Sima Yi in Luoyang and completely wiped out the state of Wei. Then Sun Quan of Eastern Wu submitted a request to surrender. Liu Bei accepted Sun Quan's surrender and make Sun Quan the King of Wu. So far Liu Bei unified the whole country.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2137630/header.jpg?t=1664553739",
    "Price": 11.99,
    "Developers": "FC Maker",
    "Publishers": "FC Maker",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_9782d73c460d0c4f60478a211c1dc9174259f1ae.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_44ec010a5d4f7f5a29acfc9d3326ab6e5b0e1a26.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_05f0ca6021431ce8d4f7a81125ec812857b7276d.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_09d3810494d64751fa6dbdf14331e98a690977a1.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_fca31612c8b4b8a922d267f5a02e660d9ea8bcc2.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_8766b75fb9a2c401baf12b4099b879305389e5c5.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_1dd5a8773377d340372a80aaf571517bbe38aa0b.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_6a37f165d3c60322e283d5e0769085ef62f81400.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_bfc5ec07ed26cabb7bf2bf5c47e1c764727d4f48.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_f6974f63c4225c426d7327b89130f8fb147f7c41.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_ab6a7e6b6f005806b50df773e1fa64ac7b04917d.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_6003c8e2d6f7aa1138d051473e84187195367d97.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_5a403026a5a829f773177965309be3098337be4a.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_5087a224d960b09f32537269493421bb9a9d2672.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_145910c3b3ad619af36f7f785bad87f3bec0b633.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_6c14add923e79e3dc0a67b7360146076158572f3.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_577997c53b87cb4d3877edbc60e2a0c71a32cd5b.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_18903c41fa431e3faf19e79b98d644cd55ae3e5d.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_e6569c3b92472d7f81df0e576b8087eb417a0fc0.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_59c4d9eebf69c155faed5b22184e2c7001ba72f0.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_60a7ab7ff3e55d031869e62f5c33de4ad033d50e.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_98a9d385e52cc2e998e2b986fdf03cfa2823bba6.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_9375566b4eba74a3d4620c65aa2c94c1409750a2.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_0d515d48acc35359790b6119715786ae9ee15bf5.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_b01b0c9e4bad422b379ed856569d89b0d6d0e2dc.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_e827e12a2d2d414c05f4473523434565035589ad.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_d0970aad2127264d8d8d9179079a1ae784b5d5fa.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_ddd0516e0f4278c7e639088f70c55bcb0f2e9ddd.1920x1080.jpg?t=1664553739,https://cdn.akamai.steamstatic.com/steam/apps/2137630/ss_2856b58e6803811ead6bee53f544b28b45f2ff19.1920x1080.jpg?t=1664553739",
    "Slug": "2022",
    "Meta Title": "吞食天地2022: Sep 30, 2022, FC Maker and Full Overview",
    "Meta Description": "Looking for information on 吞食天地2022? Check out the release date (Sep 30, 2022), developer insights from FC Maker, and a complete game summary.",
    "Alt Text Image": "Official header image for 吞食天地2022 game - Steam 2137630",
    "Canonical URL": "https://gusku.site/game/2022",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u541e\\u98df\\u5929\\u57302022\", \"description\": \"Looking for information on \\u541e\\u98df\\u5929\\u57302022? Check out the release date (Sep 30, 2022), developer insights from FC Maker, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FC Maker\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FC Maker\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2137630/header.jpg?t=1664553739\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}