{
    "AppID": 2119530,
    "Name": "Argentum Online (AOFOREVER.ORG) | Powered by Nosetu.com Games",
    "Release date": "Oct 4, 2022",
    "About the game": "From the beginning of the game, each character has a race that determines the physical form of him and a class that determines what he excels in the game. Throughout the game, each player's character learns skills that will determine how successful (or not) they will be at their craft. The first two attributes (race and class) are chosen by the player when creating their character. The skill attribute depends mainly on the experience during the game and is deeply marked by the way of playing and the preferences of each player. The action takes place in a fictional virtual world where you take on the role of a character who interacts with other characters, whether they are controlled by other players or non-player characters. All interactions take place in a fantastic environment like in a traditional RPG. You can chat with other characters on the screen, and through interactions trade, negotiate, make friends or other activities. While alone you can go to different places on the map to fish, hunt, kill zombies, among other available actions . Races The virtual world of AO is populated by player characters of different races. Each of them has flaws and virtues. At the beginning of the game, when creating a new character, the player has the possibility to choose the race of his character based on his expectations and preferences. Humans Historical synopsis of humans: Excerpt from the game manual (fantasy genre story): “Humans are said to have landed in the lands of Argentum about 6 years ago. They fled from their original lands that were scourged by Evil. However, they encountered the same hostility in these lands. Humans are a race with little ability to adapt and are not capable of killing.' Characteristics of Humans: It is a kind of balanced breed. Because of this, he gains modifiers on almost none of the attributes. Elves Historical synopsis of the Elves: Excerpt from the game manual (fantasy genre story) Development or game system From the beginning of the game, each character has a race that determines the physical form of him and a class that determines what he excels in the game. Throughout the game, each player's character learns skills that will determine how successful (or not) they will be at their craft. The first two attributes (race and class) are chosen by the player when creating their character. The skill attribute depends mainly on the experience during the game and is deeply marked by the way of playing and the preferences of each player.6​ The action takes place in a fictional virtual world where you take on the role of a character who interacts with other characters, whether they are controlled by other players or non-player characters. All interactions take place in a fantastic environment like in a traditional RPG. You can chat with other characters on the screen, and through interactions trade, negotiate, make friends or other activities. While alone you can go to different places on the map to fish, hunt, kill zombies, among other available actions .3​ Races The virtual world of AO is populated by player characters of different races. Each of them has flaws and virtues. At the beginning of the game, when creating a new character, the player has the possibility to choose the race of his character based on his expectations and preferences. Humans Historical synopsis of humans: Excerpt from the game manual (fantasy genre story): “Humans are said to have landed in the lands of Argentum about 6 years ago. They fled from their original lands that were scourged by Evil. However, they encountered the same hostility in these lands. Humans are a race with little ability to adapt and are not capable of killing.' Characteristics of Humans: It is a kind of balanced breed. Because of this, he gains modifiers on almost none of the attributes. elves Historical synopsis of the Elves: Excerpt from the game manual (fantasy genre story): «The old wise elves tell that their race came from the south of Argentum escaping from a terrible evil that plagued their original lands. They soon established themselves in the Forest of Nix, hiding part of it from view from other mortal creatures and surrounding it with powerful arcane magic that would protect them from orcs and other evil creatures. They are agile and smart, so they get a bonus to those attributes. They prefer subtlety over force, taking penalties in the latter. Elves are found all over the world, but mostly in the Elven Forest around Nix and in Nix.' Characteristics of the Elves: They are skilled in the use of bows. They have bonuses to agility, intelligence, and charisma, penalized by strength. dark elves Historical synopsis of the Dark Elves: Excerpt from the game manual (fantasy genre story): “A great veil of ignorance covers the origin of this species. It is known that when the pure elves arrived in Argentum, the dark elves already lived there and some even served Chaos. It is supposed that previously, thousands of years before the arrival of the great company of pure elves, small vessels of that race arrived and were easily corrupted by the evil that plagued Argentum. There are good and bad; also neutral. They are intelligent and strong, but they lost part of that agility that characterizes pure elves and they are not well seen by the crowd. » Characteristics of the Dark Elves: They are skilled in the art of stabbing and the use of ranged combat. They have bonuses to intelligence and strength. In years Historical synopsis of the Dwarves: Excerpt from the game manual (fantasy genre story): “The Dwarves are a race native to Argentum. They are tough and strong, qualities that helped them resist the hostility of these lands. However, they could not do much and their community was fractured and separated throughout the continent of Farinte. Witness to this are the various underground constructions throughout the continent. They have bonuses to their constitution and strength, but they are not to think much and more to be carried by their instincts, as well as having a certain distrust in magic, preferring before a great battleaxe. Characteristics of the Dwarves: They have bonuses to their Constitution and Strength. They are not good wizards, but they are good warriors. gnomes Historical synopsis of the gnomes: Excerpt from the game manual (fantasy genre story): Like the Dwarves, the Gnomes are native to Argentum. They always kept hidden from the eyes of others, a quality that helped them survive with great effectiveness. They are prone to magical arts, but have little resistance and low strength. Little is known about this breed that even today prefers to keep its community a secret. Some «The old wise elves tell that their race came from the south of Argentum escaping from a terrible evil that plagued their original lands. They soon established themselves in the Forest of Nix, hiding part of it from view from other mortal creatures and surrounding it with powerful arcane magic that would protect them from orcs and other evil creatures. They are agile and smart, so they get a bonus to those attributes. They prefer subtlety over force, taking penalties in the latter. Elves are found all over the world, but mostly in the Elven Forest around Nix and in Nix.' Characteristics of the Elves: They are skilled in the use of bows. They have bonuses to agility, intelligence, and charisma, penalized by strength. dark elves Historical synopsis of the Dark Elves: Excerpt from the game manual (fantasy genre story): “A great veil of ignorance covers the origin of this species. It is known that when the pure elves arrived in Argentum, the dark elves already lived there and some even served Chaos. It is supposed that previously, thousands of years before the arrival of the great company of pure elves, small vessels of that race arrived and were easily corrupted by the evil that plagued Argentum. There are good and bad; also neutral. They are intelligent and strong, but they lost part of that agility that characterizes pure elves and they are not well seen by the crowd. » Characteristics of the Dark Elves: They are skilled in the art of stabbing and the use of ranged combat. They have bonuses to intelligence and strength. In years Historical synopsis of the Dwarves: Excerpt from the game manual (fantasy genre story): “The Dwarves are a race native to Argentum. They are tough and strong, qualities that helped them resist the hostility of these lands. However, they could not do much and their community was fractured and separated throughout the continent of Farinte. Witness to this are the various underground constructions throughout the continent. They have bonuses to their constitution and strength, but they are not to think much and more to be carried by their instincts, as well as having a certain distrust in magic, preferring before a great battleaxe. Characteristics of the Dwarves: They have bonuses to their Constitution and Strength. They are not good wizards, but they are good warriors. gnomes Historical synopsis of the gnomes: Excerpt from the game manual (fantasy genre story): Like the Dwarves, the Gnomes are native to Argentum. They always kept hidden from the eyes of others, a quality that helped them survive with great effectiveness. They are prone to magical arts, but have little resistance and low strength. Little is known about this breed that even today prefers to keep its community a secret. Some Gnomes departed for human cities, intermingling with the other races.' Characteristics of the Gnomes: They are skilled magicians. But they are not very resistant and have little strength. They are also used quite a bit in semi-magical classes, such as bard, druid, or cleric, because of their high evasion and mana. Lessons Classes determine what each character excels at in the game. There are two families of classes, the so-called combat classes and the secondary classes. The former, as their name suggests, specialize in fighting other players, non-player characters, or hostile creatures. The others are the players who create most of the items used by all players in the game (food, clothing, weapons, and decorations). Therefore, both types of players are necessary for the internal economy of the virtual world of AO. When starting the game and creating a new character, the player chooses the class to which he wants to belong based on his preferences and game expectations. Players who prefer faster and more dynamic gameplay tend to prefer combat classes, while those who prefer a more complex experience rich in interactions and trades tend to choose one of the so-called secondary classes. Available classes: Wizard It is the class that is dedicated exclusively to the use of magic, they have a phenomenal amount of Mana (which allows them to cast a large number of spells), an acceptable magic attack but they have low life points and poor agility. Cleric A class that has its fair share of magic and physical attack, combining them can be quite effective, but it doesn't excel at anything special. Bard Class with good magic attack, good magic defense, and good agility. It has acceptable life and intermediate mana (depends on the race). Killer Expert class in the use of the Stab skill, with a good physical attack but little mana. Druid Expert class in the use of the Tame skill, good magic attack and magic defense. Acceptable health and intermediate amount of mana. Bandit Class with good physical attack, specializes in hidden movement and critical attacks. Paladin Expert class in using weapons and armor, they have a very good physical attack, but little mana. Thief Expert class in the Pickpocket skill, can move hidden and immobilize their opponents with pickpocket glove equipped. Warrior Expert class in the use of weapons and in the use of ranged weapons. Pirate Expert class in the use of boats, can slash from a distance. Employee Expert class in Carpentry, Blacksmithing, Mining, Fishing, and Logging (varies in some other games; may include Tailoring).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2119530/header.jpg?t=1665346159",
    "Price": 0.0,
    "Developers": "Nosetu Inc,Argentum Online Forever",
    "Publishers": "https://nosetu.cc/,Nosetu Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_9b110b74e56e26a873cae4a8435bd994c81ca299.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_31a617a1c8ae7e6b12d5637a5eac9e8bc73f33da.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_45397806acce69f7e243966b8a73254ff067f9ad.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_048c98a372cb6852f2516f10ff5be084c1d83356.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_1d8780c82b613a7268aa9ab74142d174213c7637.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_1a0a41d23347d5496f2680e4e8404ec90ee65ad2.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_09ab3318b0503f6420810c668c9064abae7b5bd1.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_ca22ac877862a385e4dcd30f429854783b2beb58.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_02ffc25fdd7e8603b3154ca2515e06133e8f2f88.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_db00f59621c7fc0a2452519bdbe53e3f5074226c.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_764d8186b66eeb1ef0d85a40d171c60ccae88ebe.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_a53c9e1daf9a34e624cce1e80b497af23dfd59f6.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_4f7f6bf0ab642af551ad2a033448391470a342ea.1920x1080.jpg?t=1665346159,https://cdn.akamai.steamstatic.com/steam/apps/2119530/ss_f7ae92134965c9c7868801eef1ec9badf232f9b9.1920x1080.jpg?t=1665346159",
    "Slug": "argentum-online-aoforever-org-powered-by-nosetu-com-games",
    "Meta Title": "Argentum Online (AOFOREVER.ORG) | Powered by Nosetu.com G...",
    "Meta Description": "Looking for information on Argentum Online (AOFOREVER.ORG) | Powered by Nosetu.com Games? Check out the release date (Oct 4, 2022), developer insights f...",
    "Alt Text Image": "Official header image for Argentum Online (AOFOREVER.ORG) | Powered by Nosetu.com Games game - Steam 2119530",
    "Canonical URL": "https://gusku.site/game/argentum-online-aoforever-org-powered-by-nosetu-com-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Argentum Online (AOFOREVER.ORG) | Powered by Nosetu.com Games\", \"description\": \"Looking for information on Argentum Online (AOFOREVER.ORG) | Powered by Nosetu.com Games? Check out the release date (Oct 4, 2022), developer insights f...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nosetu Inc,Argentum Online Forever\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"https://nosetu.cc/,Nosetu Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2119530/header.jpg?t=1665346159\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}