{
    "AppID": 1731070,
    "Name": "Asterigos: Curse of the Stars",
    "Release date": "Oct 11, 2022",
    "About the game": "Discover the long forgotten secrets and hidden paths in this high fantasy world, featuring exhilarating battle encounters, interconnected maps full of places to explore, and an immersive story where every choice matters. Play as Hilda – a brave young warrior from the Northwind Legion who embarks on a journey to the cursed city in order to save her lost father. The gameplay elements inspired by soulslike games alongside a lighter, dynamic combat system, create a fresh take on the modern action RPG genre, providing you with a harmonious difficulty and exploration balance. Explore the magnificent city of Aphes inspired by classical Greek designs and unveil the truth behind the city’s curse. Combine and change your weapons on the go. Equip two different types of weapon at once and become unpredictable in combat. Battle more than 60 different enemies and encounter 22 bosses in the main story and side quests. Decide the fate of Aphes. Every decision you make in Asterigos matters and will affect the story. Find over 100 collectables, complete numerous side quests, and forge your destiny in the NewGame+ mode. Welcome to Aphes – a city-state full of magic and wonder inspired by ancient Rome and classical Greek designs. From the mist-covered bazaar streets to gloomy sewers, the enigmatic forests at the city’s outskirts to deep chasms full of glittering crystals, the landscapes of Aphes are full of beauty and dangers. Choose from a variety of ranged and melee weapons on the go and combine them as you wish! The talent system allows you to pick and expand your combat style by choosing two out of six completely different weapons: sword and shield, dual blades, spear, hammer, staff or even magic bracelets . Equip a magical staff to obliterate your foes from the distance or switch to a gigantic battle hammer to squish them in a close combat. Whilst Aphes might distract you with its breathtaking views, this city is not for the faint of heart. Fight your way through 60 different monsters and encounter 22 unique bosses – each with its own unique battle mechanics. Every choice and every decision you make matters. Your journey in Aphes will lead you to discover the truth behind the city’s curse, letting you piece together its history through conversations, discovered documents and cinematics, as well as Hilda’s own diary, which she’ll update with sketches and observations. The world of Asterigos is full of secrets and untold stories. Find over 100 collectibles , complete numerous side quests and build on your legacy in the New Game+ mode !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1731070/header.jpg?t=1665516879",
    "Price": 31.49,
    "Developers": "Acme Gamestudio",
    "Publishers": "tinyBuild",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_a87b9b692f6820acf8ab3876ce243cf606021e02.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_91f82a6b66d806e824e960ee793f376ca399952f.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_823deec94776594cd0f558fdcc772dc72539aa17.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_8b572e4c14aaccf0928c9dacc29f6d11a791918e.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_c7301ecb1f89fb4d7be2b723c2d1088eab795e7c.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_da7c886be2d4d6a76817416d1dbeb7f82e7e4a56.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_bc7f222f3e618685d052ffa87a32762750387c04.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_69d94b8618547b0ef75b0758533fb78446e9e7ee.1920x1080.jpg?t=1665516879,https://cdn.akamai.steamstatic.com/steam/apps/1731070/ss_8ffcb2d0cd44fdfd9738a28a61634749a2c3c72c.1920x1080.jpg?t=1665516879",
    "Slug": "asterigos-curse-of-the-stars",
    "Meta Title": "Asterigos: Curse of the Stars: Oct 11, 2022, Acme Gamestu...",
    "Meta Description": "Looking for information on Asterigos: Curse of the Stars? Check out the release date (Oct 11, 2022), developer insights from Acme Gamestudio, and a comp...",
    "Alt Text Image": "Official header image for Asterigos: Curse of the Stars game - Steam 1731070",
    "Canonical URL": "https://gusku.site/game/asterigos-curse-of-the-stars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Asterigos: Curse of the Stars\", \"description\": \"Looking for information on Asterigos: Curse of the Stars? Check out the release date (Oct 11, 2022), developer insights from Acme Gamestudio, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Acme Gamestudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"tinyBuild\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1731070/header.jpg?t=1665516879\", \"offers\": {\"@type\": \"Offer\", \"price\": 31.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}