{
    "AppID": 2120680,
    "Name": "Bogey Brian",
    "Release date": "Sep 29, 2022",
    "About the game": "Golfing for a slime isnt easy. Without arms or legs, a slime can do many things, but swinging a club is not one of them. Brian, an eternal optimist, did not let this dissuade him from achieving his dreams. He envisioned a golf game where he himself was the ball, yeeting himself to glory across boundless and whimsical landscapes. Believing no obstacle was too great, he kissed his mom goodbye and bounded off to be the inaugural member of his own golf league. Squish, jump, roll, and spin your way to golfing glory by getting Brian to the flag on each hole. Improve your score through the use of strategic powerups and collect hats along the way that can totally change the game experience and give Brian some flare. Remember: 'Don't SEE the ball. BE the ball.' Use powerups to shave strokes off your score! Choose from 9 different powerup types. Mulligan - Make a bad shot? Use a mulligan go right back to where you were and reset your score as well. Sticky Shot - Stick to whatever you touch first after shooting. Aim Assist - Get a visual representation of where Brian will fly as you line up your shot. Rocket - Use a limited amount of rocket power to push yourself upward. Ghost - Use the ghost powerup to go through walls! Be careful though, as with great power comes great danger. If you stop ghosting while inside a wall, you will gain a penalty stroke and be sent back to your last position. And more! 9 unique courses! Each course has a unique theme and three levels of difficulty - Normal, Hard and Impossible. Some courses include: Grassy Greens Crystal Caves Spooky Strokes Galleon Greens Candy Country And more! **Note that the Impossible difficulty can be quite brutal. These are not for the faint of heart! Earn hats and Boge Coin! Earn rewards by completing courses with good scores. Buy and sell hats in the hat shop with your Boge Coin. Equip a hat to gain it's effects - over 10 different base hat effects with varying intensity, and tons of powerup modifiers. Power, Spin, Roll, Bounciness, Gravity and many other things can be effected by hats. There are millions of possible combinations! Several ways to play! Normal mode - Use powerups and hat effects to get the lowest score you can. Basic Brian mode - No powerups or hat effects allowed - get the lowest score you can. Speedrun mode - Complete each hole as fast as you can - strokes don't matter, only speed. Practice mode - Pick any hole on any course to practice on. Hone your lines and try new strategies to shave strokes off your score! Challenge mode - Choose from over 30 challenge hats, most with unique and difficult modifiers. Customize your trail! Choose the color and type of trail Brian leaves behind as he flies through the air. Random Mode! Play on a set of 9 randomly selected holes, with a randomly generated hat OR a randomly chosen challenge hat. Enter your own seed or have one randomly generated for you. Discord Server! Join our Discord Server to chat about the game and provide feedback to help shape the future of the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2120680/header.jpg?t=1664512465",
    "Price": 0.0,
    "Developers": "Calthies",
    "Publishers": "Calthies",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2120680/ss_9d21735edf2f760ae146e95cc31762c0b4971b23.1920x1080.jpg?t=1664512465,https://cdn.akamai.steamstatic.com/steam/apps/2120680/ss_a5d7fa6df97eef3a8475312ff4bdf24e1b1ebf60.1920x1080.jpg?t=1664512465,https://cdn.akamai.steamstatic.com/steam/apps/2120680/ss_db148515a610b0376158bf44e4d2f078abaa74bc.1920x1080.jpg?t=1664512465,https://cdn.akamai.steamstatic.com/steam/apps/2120680/ss_11ef7d0fa727581e128f93ea3a97e3162785e22b.1920x1080.jpg?t=1664512465,https://cdn.akamai.steamstatic.com/steam/apps/2120680/ss_028509d914d47eb69cf657d6f7a08ed87269809a.1920x1080.jpg?t=1664512465,https://cdn.akamai.steamstatic.com/steam/apps/2120680/ss_56217f0d9aedc343dfefa0ea1862e48f26f95acb.1920x1080.jpg?t=1664512465",
    "Slug": "bogey-brian",
    "Meta Title": "Bogey Brian: Sep 29, 2022, Calthies and Full Overview",
    "Meta Description": "Looking for information on Bogey Brian? Check out the release date (Sep 29, 2022), developer insights from Calthies, and a complete game summary.",
    "Alt Text Image": "Official header image for Bogey Brian game - Steam 2120680",
    "Canonical URL": "https://gusku.site/game/bogey-brian",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bogey Brian\", \"description\": \"Looking for information on Bogey Brian? Check out the release date (Sep 29, 2022), developer insights from Calthies, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Calthies\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Calthies\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2120680/header.jpg?t=1664512465\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}