{
    "AppID": 1987570,
    "Name": "Case #1472",
    "Release date": "Oct 15, 2022",
    "About the game": "A mysterious woman is sitting in front of you. Who is she? And who are you? And why are you both there? Case #1472 is mystery information digging interrogation thriller game where there are more things going on than what meets the eye, but are you able to unravel what has happened? Premise * There is a knock at the door, and someone enters the room. * - Mrs. Emma Hollis, I presume? My name is Simon. I’m here to interview you about the recent events you were involved in. - Shall we begin with an easy question? What you are supposed to do Imagine you enter a room and there is a mysterious woman sitting in front of you. The lightning in the room is so poor you can hardly see her face. Who is she? As the player starting up this game for the first time, you truly will not know anything about the situation you've been thrown into. Try and ask her questions (anything that you might find would be useful to ask) in order to see if you can understand what is going on. Begin with an easy question and see where you go from there. This game has no clear end Unlike other games, this game has no clear definition of end. The premise of the game is that you are interrogating a mysterious woman. You can ask her any question as you wish and she will respond (to the best of her abilities). But how many questions you need to ask, which questions you need to ask and what information you are suppose to find is not clearly defined for you. If you feel like you have done a good job with the interrogation, simply end the game and walk away. However, the question you need to ask yourself is though, did you truly understand what is going on or did you miss something? We created the game deliberately like this, as we wanted the game to be purely investigatory driven by the player. Any information you find and extract is solely thanks to your own imagination of asking questions and interrogating her. We also wanted this game to be a social cooperative experience. For example, you might play this game for while and then challenge or compare your findings with a friend. Did you both figure out the same information? Maybe you both unraveled two different key information and if you piece them together you both now understand the bigger picture? Seeing that there is no clear end to this game, we encourage cooperative and information exchanging among friends, as well as on other discussion forums and platforms. Game mechanics and features This is an information digging interrogation game where the player may type and ask the woman any question they wish If she knows the answer she will respond to the question, otherwise the player will get a dismissive answer The game automatically collects all asked questions by all the players in order to slowly improve over time The game has no clear end so the player can decide when to end the game at any time Achievements Custom made YouTube safe music soundtrack Thank you for play testing this game, your feedback is important! We want to explore the idea of creating an immersive mystery thriller interrogation game with a fully fleshed out and detailed story plot behind it. This is why we have published a working early version of the game in order to get as much feedback as possible! So if you have time, please give us feedback (good or bad) using the feedback button or on Steam - we would really appreciate it! However, even though this is an early version and we have a long list of things we want to improve and add (everything from thriller elements, better UI to professional voice acting, etc), there are more things going on than what meets the eye here... Credits Emma is voiced by Grimmi Grevillea Grimoire The story was fabricated by Elizabeth Price All the bugs are caused by Broken at Release",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1987570/header.jpg?t=1665854896",
    "Price": 0.0,
    "Developers": "Broken at Release",
    "Publishers": "Broken at Release",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1987570/ss_c1b714f212d558ccf41470cf2683df8a72e141d3.1920x1080.jpg?t=1665854896,https://cdn.akamai.steamstatic.com/steam/apps/1987570/ss_b00c4714a67af7e5a7c4857e62111b259f75390c.1920x1080.jpg?t=1665854896,https://cdn.akamai.steamstatic.com/steam/apps/1987570/ss_cd765911da8be22917d3c4731c0baceea4b35d2f.1920x1080.jpg?t=1665854896,https://cdn.akamai.steamstatic.com/steam/apps/1987570/ss_629eb4983364bee624c1c0a77dc14609aeb3b1c9.1920x1080.jpg?t=1665854896,https://cdn.akamai.steamstatic.com/steam/apps/1987570/ss_0d967e0c4797150036d5d3523db26a4360003de8.1920x1080.jpg?t=1665854896",
    "Slug": "case-1472",
    "Meta Title": "Case #1472: Oct 15, 2022, Broken at Release and Full Over...",
    "Meta Description": "Looking for information on Case #1472? Check out the release date (Oct 15, 2022), developer insights from Broken at Release, and a complete game summary.",
    "Alt Text Image": "Official header image for Case #1472 game - Steam 1987570",
    "Canonical URL": "https://gusku.site/game/case-1472",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Case #1472\", \"description\": \"Looking for information on Case #1472? Check out the release date (Oct 15, 2022), developer insights from Broken at Release, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Broken at Release\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Broken at Release\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1987570/header.jpg?t=1665854896\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}