{
    "AppID": 1527070,
    "Name": "Commanding Nations",
    "Release date": "Sep 30, 2022",
    "About the game": "Commanding Nations is an indie title seeking to bring RTS gaming to the modern era by injecting innovative gameplay mechanics, next gen visuals, combat systems, interactive maps and unique factions into a genre which has not seen much change for the past twenty years. Features present on day 1 of Early Access Two factions with which to battle against one another, Hong and Scav Goldhorn Island, a 1v1 map to destroy at your leisure 18 unique units to unleash on your enemy No unit or building cap, produce as many as you want as long as you have the resources Skirmish and Multiplayer mode A community-driven approach to balance and gameplay changes A ton of bugs ;) Note that those are the current key features, and this will be updated with each major update to the game. For a better idea of our plans after launch, be sure to visit our Roadmap which will be linked in the future in the Early Access section. Revamping The Classics Gameplay is the very core of every game, and is especially important in a good RTS title, as such we want to get it absolutely right. With a focus toward base building and squad creation, we seek to introduce new elements to the formula such as combining units, managing their ammunition reserves and making sure to have them fallback to safe zones to resupply, while also making sure that defending players cannot simply turtle their way through a match. In addition, we want to make it a beautiful experience by introducing elements such as high resolution graphics, dynamic weather, night and heat vision, mist and even interactive grass that small units can go prone in to take the enemy by surprise! Living Locations Commanding Nations will offer multiple game modes and maps, with a focus on Twin Valley, a future large and interactive terrain with hidden pathways and resource points. Further, the maps will also sport city centers and urban terrain which may hide more than you bargained for! Civilians still inhabit these zones, and intense firefight might rally them against you! Rebellions will start to form and spread throughout the maps, fortifying buildings as well as pathways and shooting at any players seeking to break through.* Away from these centers, other elements will keep you on your toes. Birds nestled in trees might reveal your location to the enemy, or provide an early warning of incoming forces!* Sound is also important, with in the future units emitting distinctive noise and characteristic voice lines at the click of a button to let you instantly recognize the one you’ve selected, and whether it is engaging someone or on the move.* *All this and more is what we have planned for the future of Commanding Nations, made possible with your support and council. If you wish to know more please take a look at our Early Access section! The Story So Far Enter the world of tomorrow, where war has transformed from an atrocity to an industry. Private Military Contractors and unaccountable militaries have stepped in to fill the role of impotent governments, making conflicts a market with profit numbering in the billions, and giving rise to an intense rivalry between these forces in what is called the Hidden Conflict. Kept concealed from the world under the guise of terrorism and the activities of rogue states, battles are constantly fought to ensure military supremacy or simply the most profitable contract. Now at a critical point, heavier and more devastating weaponry is deployed worldwide, sparking the flames of war. Soon all will be revealed, be it through the efforts of a whistleblower...or nuclear fire. The Hidden Conflict’s Instigators Vying for control of Twin Valley will be three factions present at launch: Raven, The Scavenger Union and Hong Corp, each with their own distinct playstyle, units, abilities and tactics. But we don’t intend to stop there! We are already working on additional opponents with their own unique spin to enhance the experience, from PMCs to National Armies!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1527070/header.jpg?t=1664740749",
    "Price": 15.99,
    "Developers": "Seven Volts Games",
    "Publishers": "Seven Volts Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_1c1653a0f1bcc840286ee981040a690ab7ffd02f.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_effaaccb0ed4def8daef69d4f1aba78166fd290c.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_ba660250441228aee618d118c5ebab2dfa736639.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_e48f06f8c1a54669b20cf3b43b0c22578f111d1f.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_ce538b08f2fc03b91f46a11de37644584afaa5f5.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_93a205b0eac9594cf29e1e9cd4e5163d1a36c9b0.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_c1424a97344606ed234c39dec8b20d04fef9ca03.1920x1080.jpg?t=1664740749,https://cdn.akamai.steamstatic.com/steam/apps/1527070/ss_d24f2f3a9039a33efa088756192e4c80b3d019d0.1920x1080.jpg?t=1664740749",
    "Slug": "commanding-nations",
    "Meta Title": "Commanding Nations: Sep 30, 2022, Seven Volts Games and F...",
    "Meta Description": "Looking for information on Commanding Nations? Check out the release date (Sep 30, 2022), developer insights from Seven Volts Games, and a complete game...",
    "Alt Text Image": "Official header image for Commanding Nations game - Steam 1527070",
    "Canonical URL": "https://gusku.site/game/commanding-nations",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Commanding Nations\", \"description\": \"Looking for information on Commanding Nations? Check out the release date (Sep 30, 2022), developer insights from Seven Volts Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Seven Volts Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Seven Volts Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1527070/header.jpg?t=1664740749\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}