{
    "AppID": 2061750,
    "Name": "Counterpact",
    "Release date": "Oct 14, 2022",
    "About the game": "* Note this game is currently in alpha. Store page assets are subject to change, and the current build is not completely representative of how the game will be at the time of launch. Counterpact is a 2D platform-shooter that pits two teams against each other, or a solo player against the tough (yet polished) forces the Gilded Spire has to offer. 7 Unique Characters Each playable character comes with their own set of mechanics. If you enjoy glass cannon gameplay, try Shiniko the Reaper, who can output some serious damage despite her low health and close-ranged attacks; use her Dash to maneuver around (or through) enemies. Prefer to take a tankier approach? Try SYS.TR the Bulwark, who can use channel the damage she receives into powerful auras using her Rerouted Power. Different Weapons to Try Don't like how a character plays by default? Maybe you do like them, but the current situation calls for something different? Perhaps you just want a new twist on their mechanics? Each character has a variety of alternate weapons to choose from, some of which heavily change their gameplay style to the point of putting those characters into different roles, all while keeping their core mechanics intact. New weapons get added over time as well, so you'll have something new to try. Over 100 Cosmetics to Collect By simply playing the game (no microtransactions are involved), you can earn Eclipsium. Eclipsium can be spent on the available Gashapon Machines, which will reward you with a random cosmetic from their stock. Cosmetic items include different outfits for characters, little pets that follow you, chairs you can sit on, emotes to communicate or taunt with, and more. Enter the Gilded Spire If you want (or need) a solo experience, the Gilded Spire awaits you. Fight through four floors of bulky enemies and traps for a chance to earn riches. If you really want to challenge yourself, try conquering the Gilded Spire on the Blinding difficulty, and be greatly rewarded for your success.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2061750/header.jpg?t=1665780339",
    "Price": 0.0,
    "Developers": "Little Egg Basket",
    "Publishers": "Little Egg Basket",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2061750/ss_baf067ff76fb37d063013411fb6fc156f53d9eed.1920x1080.jpg?t=1665780339,https://cdn.akamai.steamstatic.com/steam/apps/2061750/ss_4b3b1860c245b9c494a3cb77ce2ba08b21abf976.1920x1080.jpg?t=1665780339,https://cdn.akamai.steamstatic.com/steam/apps/2061750/ss_a57e700f72b9dc238d778f517e6c6dcd08c81353.1920x1080.jpg?t=1665780339,https://cdn.akamai.steamstatic.com/steam/apps/2061750/ss_84c57a56ad8d4089999d58290430f3db6741e737.1920x1080.jpg?t=1665780339,https://cdn.akamai.steamstatic.com/steam/apps/2061750/ss_4c3346ec3fc0673a6ba838c9c9b72b18ee28edb4.1920x1080.jpg?t=1665780339",
    "Slug": "counterpact",
    "Meta Title": "Counterpact: Oct 14, 2022, Little Egg Basket and Full Ove...",
    "Meta Description": "Looking for information on Counterpact? Check out the release date (Oct 14, 2022), developer insights from Little Egg Basket, and a complete game summary.",
    "Alt Text Image": "Official header image for Counterpact game - Steam 2061750",
    "Canonical URL": "https://gusku.site/game/counterpact",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Counterpact\", \"description\": \"Looking for information on Counterpact? Check out the release date (Oct 14, 2022), developer insights from Little Egg Basket, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Little Egg Basket\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Little Egg Basket\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2061750/header.jpg?t=1665780339\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}