{
    "AppID": 2114440,
    "Name": "Elland: The Crystal Wars",
    "Release date": "Oct 3, 2022",
    "About the game": "In 2001, development began on an ambitious Game Boy Advance game based on a popular franchise. Maybe the project was a little too ambitious, because it was cancelled in 2002 and the team walked away. Twenty years later, this game finally sees the light of day, albiet without the original franchise license. Experience the game now in this enhanced, emulated version. Story Elland, a harsh desert world on the outskirts of the Galaxy. With nothing but scant indigenous life, the planet is controlled by the cooperative Elland Inc, which mines the abundant minerals and crystals used in the construction of Galactic star cruisers. The mining operations and the abundance of Brem-Nar Crystals have transformed Elland from a dusty wasteland into a glittering and much envied prize. Notorious for its precipitation, the neighboring world of Mank is home to the headquarters of the Trafford Corporation, the largest constructor of space cruisers and weapons in the Galaxy. Trafford is infamously aggressive, using it’s financial muscle and military power to always get what it wants. At this moment in time it wants to control Elland and it will use all and any resources to get what it wants. Gameplay You are Ethan Lancashire, one of the finest of Elland Inc.'s fighter pilots. Across more than 20 dangerous missions you will pilot advanced flying machines that can move, turn and hover, and come equipped with a variety of weapons and utilities, fitted as the mission requires. Weapons can be set to lock-on or aimed manually. Some examples of briefings of missions you will undertake: Using a Heavy Freight Raptor, deliver a gatherer to our Crystal field, following the directions on the radar. Be careful, there might be Trafford Corp ground units lying in wait. Before delivering the gatherer, explore the surrounding area to find further Crystal fields. Keep an eye on the fuel and return to base before it runs out. Recent incidents show there must be Trafford Corp bases nearby. Take a Light Fighter and explore the desert to find and destroy them. We also have a spy out there, who will turn on his signal so you can find him using the locator. We have detected smuggler communications: eliminate them if possible. Don't forget, the most important thing is for us to see you again. We have just received an emergency call from our secret base, where our new fighter bomber is being tested. The Trafford Corps are trying to steal it. Get over there and stop them before they return to their base with the new prototype. We have received an emergency call from the north. A few Nightons hijacked a Trafford Corp transporter with prisoners, but something went wrong and they crashed. Go there and look for survivors. We only have a Heavy Freighter in the base, so you'll have to take that. If you see a Kuhn-Suhm, use a gatherer as bait to distract it. Don't forget to look out for the enemy. Earn commendations and trophies, displayed in your personal room, and climb the ranks from lowly Cadet all the way up to Air Force General. This enhanced version introduces a number of modern features to this emulated game, including: Saving/loading the game at any point Support for most modern game controllers Full control remapping Image scaling and smoothing options",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2114440/header.jpg?t=1664792570",
    "Price": 14.39,
    "Developers": "Soft Brigade,AUK Play",
    "Publishers": "Pixel Games UK,Retro Room Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_004bdbee5e180b4df585107f01951a6e0f16e10b.1920x1080.jpg?t=1664792570,https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_ecf38f43bc44f9eb2f5533e5cf90835aba6eea82.1920x1080.jpg?t=1664792570,https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_fa8fab714a443e3c367a6ebc94a6ea9d3013416a.1920x1080.jpg?t=1664792570,https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_66cac0d03a082e2235dd048a0f0714da45eecb84.1920x1080.jpg?t=1664792570,https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_0796ffc2400c6badb405aa77304016ce85e21294.1920x1080.jpg?t=1664792570,https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_c9e61166cb6215860cdff4cbcf1ac5cad2e0ee16.1920x1080.jpg?t=1664792570,https://cdn.akamai.steamstatic.com/steam/apps/2114440/ss_f2f41ad43cd95cad1429375f335278ba61a83f82.1920x1080.jpg?t=1664792570",
    "Slug": "elland-the-crystal-wars",
    "Meta Title": "Elland: The Crystal Wars: Oct 3, 2022, Soft Brigade,AUK P...",
    "Meta Description": "Looking for information on Elland: The Crystal Wars? Check out the release date (Oct 3, 2022), developer insights from Soft Brigade,AUK Play, and a comp...",
    "Alt Text Image": "Official header image for Elland: The Crystal Wars game - Steam 2114440",
    "Canonical URL": "https://gusku.site/game/elland-the-crystal-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Elland: The Crystal Wars\", \"description\": \"Looking for information on Elland: The Crystal Wars? Check out the release date (Oct 3, 2022), developer insights from Soft Brigade,AUK Play, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Soft Brigade,AUK Play\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Games UK,Retro Room Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2114440/header.jpg?t=1664792570\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}