{
    "AppID": 1220170,
    "Name": "Eville",
    "Release date": "Oct 11, 2022",
    "About the game": "Betray your friends - and lie your way to victory. In the multiplayer social deduction game Eville you find yourself in a village riddled by a series of murders. Some say it might have been you - or was it? Convince others you're not a murderer to stay alive! Inspired by popular social-deduction party games such as Werewolves this is a new take on the concept with realtime gameplay and interaction . Take on the role of a Villager or Conspirator and do your deeds when no one is watching. Place wards to observe other players or tread through the village to visit any house and go on a killing spree. It is your task to communicate with other players and prove your innocence. Use your unique role abilities to your advantage and make sure your team survives. Devious murders are taking place in the once peaceful village of Eville. Each day the Villagers can decide on suspects and execute them until all evil-doers are found. Each night however the Conspirators gather and decide to murder another innocent Villager until they take over the village. You play as a random role and have no idea who is on your side. Use your abilities and social skills to find out! Objective: Stay alive and discover the conspirators! Win by executing all conspirators Call in meetings, vote out and execute the Conspirators Find your dead friends and use your abilities and social skills to find out who murdered them Brew potions to save yourself, others, or poison people you think are suspicious Lift the curses and evil magics brought upon Eville by the Conspirators Trade with vendors and acquire items to protect yourself and gather intel on other players Use your unique role abilities to observe players, talk to ghosts, see footsteps or place traps in the village Objective: Deflect accusations and murder the Villagers! Win by killing all innocent Villagers Get rid of Villagers by sneaking into their home at night and murdering them, or trick Villagers with your deceptive skills Wake up at night, steal and deceive the sleeping villagers Put evil curses upon the village, securing your win Buy trade goods on the black market, giving you unique items such as boots to protect you from traps Use the underground to traverse through Eville in secret In Eville you assume a randomly assigned role for each session. Convince others that you're on their side to stay alive! Here are some of the available roles: Detective - A nimble noble with an exceptional eye for the truth. Barbarian - A blade master that got off the right path. Shape Shifter - No one really knows who she is, and those that do never see her again. Ghost Whisperer - A mystic with the ability to communicate with deceased Villagers. Slanderer - Never takes the blame for anything. Always tries to frame others. Trapper - A lone ranger with a powerful arsenal. Seer - Places magical wards and observes other players during the night. Mayor - Everyone knows him and everyone pays him. Thief - Watch out for this one, or you'll soon have nothing! Guard - A crusader of justice and truth. Smuggler - A master of the underground - clearing secret paths directly to a player's home More roles will be revealed! - Real-time 3D gameplay: Interact with players, vendors, NPCs, use items, visit player homes and use your role-specific abilities - Player Customization: Choose a Skin, Equipment, Accessories, Paintings, Stickers, Emotes, and more - Game Settings: Set custom rules for your own play session - Scalable session size: Roles are distributed and balanced automatically based on the number of players in your game - Proximity based voice and text chat - Become a ghost, acquire unique abilities and influence the living players even after death We take the community’s input very seriously. Listening to the feature requests and feedback from our fans is important to us, that’s why fans can have a direct line to us, via our discord community channel; where they’ll be able to discuss the development of Eville with us. Quite often game developers suffer from tunnel-vision, and we're no exception. Having a springboard to bounce ideas back and forth with, can be quite refreshing. At the end of the day, our goal is to create a fun experience, and having the community’s direct feedback is essential to this process.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1220170/header.jpg?t=1665518562",
    "Price": 13.49,
    "Developers": "VestGames",
    "Publishers": "Versus Evil",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_f0e09c17d794ff1cfb5daa3d2bfce5ccd04b7e5a.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_7cb119c927b90447fb4580e0ccf34aaff370ca64.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_8cd8bf400dcae7072ea74fc31734aa5d4b980be2.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_58069af038afce1c7abf87abe88f6552681b660e.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_9398ed6a3e55190c7f8da1ebd7f987f95893e5ff.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_e047ae0529c54103e38a72ad4ad06172eba87348.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_2e7162b6327fb088ee54a843bdbf565f1d91c49a.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_72261baef2264235fc77fbeb10dda75121bd3673.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_1fa524a2b8d2061e8935b2cfe570fa5b695e4872.1920x1080.jpg?t=1665518562,https://cdn.akamai.steamstatic.com/steam/apps/1220170/ss_6960ae437ed3c16edfff9626ccc9d7f9e44fb292.1920x1080.jpg?t=1665518562",
    "Slug": "eville",
    "Meta Title": "Eville: Oct 11, 2022, VestGames and Full Overview",
    "Meta Description": "Looking for information on Eville? Check out the release date (Oct 11, 2022), developer insights from VestGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Eville game - Steam 1220170",
    "Canonical URL": "https://gusku.site/game/eville",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eville\", \"description\": \"Looking for information on Eville? Check out the release date (Oct 11, 2022), developer insights from VestGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"VestGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Versus Evil\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1220170/header.jpg?t=1665518562\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}