{
    "AppID": 1363680,
    "Name": "FALLING OUT",
    "Release date": "Oct 5, 2022",
    "About the game": "FALLING OUT is a charming, light-hearted and accessible 2D roguelite adventure. Take control of two accidental adventurers, as you explore ancient kingdoms, discover treasures (be careful of the traps!) and bump into the equally lost shopkeeper, Azar. Collect items to craft weird weapons and useful objects that will help you traverse the world in this unplanned escapade. It was supposed to be a relaxing vacation but ditch the itinerary because you’ll now need to choose your own path. Navigate through procedurally generated levels that offer the perfect balance of risk and reward. Help Giorgio and Felicie overcome their differences and work as a team in single-player or co-op. However you play, you’ll need to work together to conquer the unique obstacles and challenges scattered throughout each world. Go it alone or find a real human. Play as either Giorgio or Felicie in solo, co-op or vs mode. Easily switch between characters to use each of their unique characteristics. Boat not included It’s fun to explore but don’t hang about for too long because these temples flood! Grab what you can and get to the exit before it’s too late. Oh, and please don’t leave your partner behind… No Deja Vu here! Navigate your way through hordes of ghastly ancient creatures while exploring randomly generated temples, threats and exit locations. Every level is different and every challenge is unique but the feeling you get from mastering them is always just as satisfying. Daily Pyramid A randomly generated pyramid is kept for 24 hours for everyone to enjoy together. Craft works Decode blueprints, buy objects and collect scraps to build weapons and items that will help you overcome the unknown perils ahead Hilarious vs mode Create total chaos with bananas, frying pans, landmines, boomerangs and anything that comes to hand in order to steal your opponent's loot. Just remember to protect your partner at all times! Let’s rewind that Relive all your hilarious moments anytime with slow-mo replay.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1363680/header.jpg?t=1665071729",
    "Price": 11.99,
    "Developers": "PolyCrunch Games",
    "Publishers": "Firestoke",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1363680/ss_8d43c82d7a5e6b5b62de0c3171ed627018853c7d.1920x1080.jpg?t=1665071729,https://cdn.akamai.steamstatic.com/steam/apps/1363680/ss_fc4a00e395422bfa3b78ccbf5f847d9e7f526aec.1920x1080.jpg?t=1665071729,https://cdn.akamai.steamstatic.com/steam/apps/1363680/ss_fe29c0a04b2a9958d436c56af69907bf25586a44.1920x1080.jpg?t=1665071729,https://cdn.akamai.steamstatic.com/steam/apps/1363680/ss_3861101c2eaea5bb00fe30b83b199e2ef539d3cb.1920x1080.jpg?t=1665071729,https://cdn.akamai.steamstatic.com/steam/apps/1363680/ss_986017d6d18992a46cea69da6cad1f9662414fcb.1920x1080.jpg?t=1665071729,https://cdn.akamai.steamstatic.com/steam/apps/1363680/ss_978d7664d2c26e9fbede11ab766dada79c7159ff.1920x1080.jpg?t=1665071729",
    "Slug": "falling-out",
    "Meta Title": "FALLING OUT: Oct 5, 2022, PolyCrunch Games and Full Overview",
    "Meta Description": "Looking for information on FALLING OUT? Check out the release date (Oct 5, 2022), developer insights from PolyCrunch Games, and a complete game summary.",
    "Alt Text Image": "Official header image for FALLING OUT game - Steam 1363680",
    "Canonical URL": "https://gusku.site/game/falling-out",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FALLING OUT\", \"description\": \"Looking for information on FALLING OUT? Check out the release date (Oct 5, 2022), developer insights from PolyCrunch Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PolyCrunch Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Firestoke\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1363680/header.jpg?t=1665071729\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}