{
    "AppID": 2131820,
    "Name": "红月",
    "Release date": "Oct 15, 2022",
    "About the game": "Hello, everyone. I'm Jiayu, an independent game producer. in this game. You can design and manufacture equipment and design your unique character. The origin of Luna: Luna's predecessor is actually the MOD integration of the ancient scroll 5. I called it Luna integration at that time. After spending a lot of time, I came to a conclusion: the engine of the ancient scroll 5 is out of date! So I decided to develop an open world RPG like the MOD integration of the ancient scroll 5. Of course, the support of MOD is the soul and indispensable soul, so the MOD system of this game will be one of its core playing methods. In order to let everyone develop MOD happily and experience the fun of creation, I created a set of MOD system with extremely low production threshold, aiming to make all players become MOD developers! About the development of the game: The development method of this game will be different from that of ordinary games. If you have played the current version of Red Moon, you will find that it is not complete and is a game framework. I plan to develop this game in a modular way. To put it simply, every time I finish a system, I will update it to the game for everyone to play. After absorbing everyone's opinions and suggestions, I will make some small updates, and then start to develop the next system, so as to follow the cycle. For example, the current version only has an item system, a basic motion system, and a MOD system. The current version of the Red Moon is at best a walking and changing simulator. In the next version, I will update the weapon system, life system, and basic combat system, so that the Red Moon becomes a mini action game that can fight to a certain extent. In the next version, I will update the building system, big map, and so on, Every time I make a piece of cake, I will flash it into your mouth immediately to avoid you waiting for years to play",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2131820/header.jpg?t=1665883163",
    "Price": 0.99,
    "Developers": "月亮上的佳宇",
    "Publishers": "月亮上的佳宇",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2131820/ss_24d241bdd473765c43ef8b0b2e427e3e9860d18d.1920x1080.jpg?t=1665883163,https://cdn.akamai.steamstatic.com/steam/apps/2131820/ss_537355b99800ff74f32686f787072f4c98a095a4.1920x1080.jpg?t=1665883163,https://cdn.akamai.steamstatic.com/steam/apps/2131820/ss_1f04b5fe55d0706ca409a63c808c8a203fd58fa0.1920x1080.jpg?t=1665883163,https://cdn.akamai.steamstatic.com/steam/apps/2131820/ss_0c637f6e706f51a96c5c9114a966d89cedfa92c5.1920x1080.jpg?t=1665883163,https://cdn.akamai.steamstatic.com/steam/apps/2131820/ss_9178f5169b77c987d2f072815bff84e9c2c8166c.1920x1080.jpg?t=1665883163,https://cdn.akamai.steamstatic.com/steam/apps/2131820/ss_218e75974e7f5ca5dee2c6afd1a81238e5d0950f.1920x1080.jpg?t=1665883163",
    "Slug": "",
    "Meta Title": "红月: Oct 15, 2022, 月亮上的佳宇 and Full Overview",
    "Meta Description": "Looking for information on 红月? Check out the release date (Oct 15, 2022), developer insights from 月亮上的佳宇, and a complete game summary.",
    "Alt Text Image": "Official header image for 红月 game - Steam 2131820",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7ea2\\u6708\", \"description\": \"Looking for information on \\u7ea2\\u6708? Check out the release date (Oct 15, 2022), developer insights from \\u6708\\u4eae\\u4e0a\\u7684\\u4f73\\u5b87, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6708\\u4eae\\u4e0a\\u7684\\u4f73\\u5b87\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6708\\u4eae\\u4e0a\\u7684\\u4f73\\u5b87\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2131820/header.jpg?t=1665883163\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}