{
    "AppID": 1878720,
    "Name": "Gnome Online",
    "Release date": "Oct 14, 2022",
    "About the game": "Gnome Online is an innovative, Real-Time, fast-paced, PvP, Sandbox MMORPG. Players are called to form clans and battle for dominance across the seamless, zoneless, uninstanced open fantasy world of Gnome Online. Recruit and train new warriors, conquer fortresses and clan cities, engage in epic land and naval battles with thousands of concurrent players to build and defend powerful empires. Key Features A Sandbox PvP MMORPG Participate in real-time skirmishes or massive battles, on land and sea, build, defend and conquer empires in the largest seamless, persistent world with no zones, no instances, and no artificial barriers. Forge your legend as a fierce fighter, a cunning politician, a wealthy trader or a master crafter. The possibilities are limitless. Seamless, Zoneless, Exciting World Experience the largest and most beautiful handcrafted world of its kind inside a seamless, real-time, and non-instanced environment. Travel through and explore five continents and countless small islands, on foot, mount, by ship or by magical means. Encounter hundreds of monsters equipped with superior AI behavior. Dynamic shadows and visual effects, a realistic day/night cycle, a huge color palette, ambient sounds and music, are pleasing to the senses and provide a uniquely immersive experience. The ability to use the environment to your advantage makes territory knowledge crucial in evading enemies or staging attacks, giving explorers a serious tactical edge. The Uniqueness and Depth Of Skills and Custom Roles Forget about levels; using Gnome Online Prowess Point and Feat progression system, you can raise your chosen skills at your own pace while playing the game your way. Skill selection is now entirely player choice. Using the 'character build” window, players can select any 9 “school skills”, only one of which can be the “ultimate skill” from any school. All “common skills” are available to all players. Players will be able to activate a total of 16 skills, common and school combined, for any set build. Combat: Individual Player Skill and Teamwork Combat is Real-Time, fast paced, with manual aiming and friendly fire. Player skill is important, while teamwork, strategy and tactics make the difference. The stakes are high with the full loot rule in effect and the combination of first person shooter style battles, mounted combat, epic sea battles, and sieges with RPG style strategy, are the recipe for a truly epic, exciting and adrenaline-charged experience. Create and Conquer Empires Huge sieges and Clan Wars bring the chaos of massive battles to life. Territory control is exercised by taking over cities and hamlets, capturing nearby villages and defending them against your enemies. Form strong Alliances, experience the politics and diplomacy of war, defend your allies, betray them, be betrayed, and retaliate. The Importance Of Crafting From the simplest sword and board to the elusive Dragon Armor, all items in Gnome Online are player created. War and the full loot system, fuel a perpetual need for equipment of all kind, creating a booming economy, making master crafters one of the most sought-after professions for any clan or team. This Is An Indie Game We at H-Production have dedicated ourselves to creating the most fun, innovative, and best PvP MMORPG out there. The game for us starts at launch. We develop and innovate continuously throughout the game’s lifecycle, inspired by our player's feedback. You’re not just playing a game, you take part in its evolution.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1878720/header.jpg?t=1665748445",
    "Price": 11.99,
    "Developers": "H-Production",
    "Publishers": "H-Production",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_7b81f7ca91310bee7d10f75685dff7f7c5d9c317.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_39f718499de24806760fa2a8fc3da352cac2a28d.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_194a1f67e13dd6203f6cc914609b8c4d44ef6ef2.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_1d994ec26c2950a9a035350bb3fa2aad2de6e6d3.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_5645c908aea9ae0a8c3193a811e6233a269f3d83.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_f300167729d3d831223e69f11372b2b2fcf31e01.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_ada624a52a0a4f5ebeb2ea531ceab5bbcc79c8d7.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_c1f6f756f5a0fe41a8b407069c1e6e98451e70e7.1920x1080.jpg?t=1665748445,https://cdn.akamai.steamstatic.com/steam/apps/1878720/ss_799d063cf9cc00b50c0e3dff7d0d2d1e02b783f1.1920x1080.jpg?t=1665748445",
    "Slug": "gnome-online",
    "Meta Title": "Gnome Online: Oct 14, 2022, H-Production and Full Overview",
    "Meta Description": "Looking for information on Gnome Online? Check out the release date (Oct 14, 2022), developer insights from H-Production, and a complete game summary.",
    "Alt Text Image": "Official header image for Gnome Online game - Steam 1878720",
    "Canonical URL": "https://gusku.site/game/gnome-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gnome Online\", \"description\": \"Looking for information on Gnome Online? Check out the release date (Oct 14, 2022), developer insights from H-Production, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"H-Production\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"H-Production\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1878720/header.jpg?t=1665748445\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}