{
    "AppID": 1933850,
    "Name": "HUNGRY PIGS",
    "Release date": "Oct 7, 2022",
    "About the game": "--Google Indie Games Festival2022 TOP10-- HungryPigs go on a rampage in Tokyo! 🐷 You can enjoy full-fledged action games with easy controls. Use your technique to push yourself to your limits! Multiplayer for up to 4 players is also available. Aim for a high score with your friends! (Multiplayer may experience glitches depending on communication conditions.) Play Mode Infinite Mode A mode that doesn't end until the game is over. Compete to see how many cabbages you can eat on the stage. Collect gems to get bonus items. Choose items that will enhance your pigs, special attacks, and other items that will make the situation more favorable. Original Mode Clear the stage by eating all the cabbages on the stage. Clear as many stages as possible to collect pig costumes. Each stage has two difficulty levels: Normal and Hard. The ending can be seen after clearing 8-4. After the ending, a special stage will be opened. How to play Clear the stage by eating up the cabbage! Make sure to eat all of the cabbage on the stage. This is an action game in which you control a pig and compete with the number and speed of cabbages you eat on the stage. In the Shibuya stage, you can get a score of 1 point for each cabbage you eat. Challenge yourself to see how many you can eat. Tap the screen for a spinning attack! It'll send humans flying. Afterward, you'll need to wait a while to use it again. If the pig is caught by a human, the game is over. Eating grass makes the pig stronger and allows it to eat more cabbage in one bite. The 'POWER' displayed at the top of the screen is the pig's ability to eat things. Mysterious berries that appear from flowers will power up the pig for a certain period of time when used. If you bite into the cabbage during that time, you can eat it many times faster. It is efficient to use three strong berries at the same time and eat them on the cabbage. If you collect 6 coins, the pig will become invincible. While invincible, the game is not over even if the pig is caught by a human. The speed of eating cabbage will be doubled. Infinite Mode, a gem will appear when you eat up all the cabbage. Collecting the gems will give you bonus items. Choose the most advantageous item depending on the situation. The giants that appear in infinite mode can be tipped over by hitting them several times with a spinning attack. The tumbled Titans can nibble on cabbages in the same way, by hitting them with their bodies. You can also use the bonus item 'monster eggs' to summon monsters to fight. Despite its cute appearance, the game content is quite technical. There are few rewards and training elements, and the game was created for the pure enjoyment of the action game itself. Have you ever played that game in your local arcade and used to play it for a while, though you don't remember the name? Perhaps this is that type of game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1933850/header.jpg?t=1665208421",
    "Price": 3.24,
    "Developers": "Balloon",
    "Publishers": "Balloon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_30ae7443b86d8cece02cd0451de9690e383ac606.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_0b3405b1b36266d6bac12d1325347d1c608b7a86.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_6fb62364465ae8ce8eb82f7284381cf40949c563.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_485930d6e7df738eda449a2ba54d22dc7c8592eb.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_4a399ee44c4dd8f4cdb0cb526fb6208ff23aecc9.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_2e287a7c76a6963cb8c918a816aa37676c2f0d5c.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_fcd3a9abd4ea148afbff747d884b0fe68f926b8d.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_dd1b09c446bdbe5273e285eaffa8dae208d7ce11.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_b3a11011f429a679ee4d5b72e9aba895e1d8ccc8.1920x1080.jpg?t=1665208421,https://cdn.akamai.steamstatic.com/steam/apps/1933850/ss_007fe11e92d4061871ae83a959d2815ff4ad716d.1920x1080.jpg?t=1665208421",
    "Slug": "hungry-pigs",
    "Meta Title": "HUNGRY PIGS: Oct 7, 2022, Balloon and Full Overview",
    "Meta Description": "Looking for information on HUNGRY PIGS? Check out the release date (Oct 7, 2022), developer insights from Balloon, and a complete game summary.",
    "Alt Text Image": "Official header image for HUNGRY PIGS game - Steam 1933850",
    "Canonical URL": "https://gusku.site/game/hungry-pigs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HUNGRY PIGS\", \"description\": \"Looking for information on HUNGRY PIGS? Check out the release date (Oct 7, 2022), developer insights from Balloon, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Balloon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Balloon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1933850/header.jpg?t=1665208421\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}