{
    "AppID": 2015040,
    "Name": "Ignited Steel: Prologue",
    "Release date": "Oct 14, 2022",
    "About the game": "If you've enjoyed the Prologue, check out the main game! / The beginning of the Ignited Steel universe. In this prologue, we add even more content to the story behind the Ignited Steel project, where you will see the beginning of the evil flaw that turned machines against humankind. Two new characters, new weapons, new biomes and new enemies will be added to Ignited Steel. Play as Exa Falris and F-OS V0.1 to see how things went after the incident that turned Phar0s against its own creators. Aiming to fulfill its expansion instinct, humanity created an A.I. which controls and manages all necessary resources to expand the human race throughout the galaxy. Soon, a fatal flaw in the A.I. 'PharOS' code was discovered: it could not and would not stop expanding. With the hope to halt PharOS’ expansion, the human race depends on 'The Ignited Steel” program, a plan reliant on outdated technology which PharOS cannot control. Old Mechs from past wars are now humanity’s only hope. Attacking and moving mechs requires energy and can overheat the mech. If overheated, mechs output more damage while being more vulnerable to enemy attacks. A key element to gameplay is finding the perfect balance between damage and vulnerability. Pilots from every corner of the universe volunteer to the Ignited Steel program, each bringing their unique personalities and tactics. As the Ignited Steel program regains control of the galaxy, new pilots will join the cause against PharaOS. There're 3 types of mechs: Juggernaut, Stalker and Javelin, each with their own advantages and counterplay. Mechs are built using unique modules each with their own purpose. As the Ignited Steel program liberates the galaxy, they will earn and purchase new modules with unique traits. The galaxy is full of contrasting planets and stories to be told. By jumping from node to node the ignited steel program will discover the galaxy's stories, and add new modules and pilots to the crew. New planets, pilots, modules, events and missions in every playthrough!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2015040/header.jpg?t=1665997027",
    "Price": 0.0,
    "Developers": "Yokaicade",
    "Publishers": "Meteorbyte Studios,G-DEVS.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2015040/ss_5d1b3f26c711e3eda6d87240e07f36652ac82b34.1920x1080.jpg?t=1665997027,https://cdn.akamai.steamstatic.com/steam/apps/2015040/ss_a1f7ac73128a0bb9808ae4006a423ea4239e0ada.1920x1080.jpg?t=1665997027,https://cdn.akamai.steamstatic.com/steam/apps/2015040/ss_cd55c44036ad86d1e456f6a10e04ddfb17e90708.1920x1080.jpg?t=1665997027,https://cdn.akamai.steamstatic.com/steam/apps/2015040/ss_8620e8929c5afdecd9af5b16650a2710172e63f9.1920x1080.jpg?t=1665997027,https://cdn.akamai.steamstatic.com/steam/apps/2015040/ss_993077305f7b2653000d792c1ed0b5fcc459a2ab.1920x1080.jpg?t=1665997027",
    "Slug": "ignited-steel-prologue",
    "Meta Title": "Ignited Steel: Prologue: Oct 14, 2022, Yokaicade and Full...",
    "Meta Description": "Looking for information on Ignited Steel: Prologue? Check out the release date (Oct 14, 2022), developer insights from Yokaicade, and a complete game su...",
    "Alt Text Image": "Official header image for Ignited Steel: Prologue game - Steam 2015040",
    "Canonical URL": "https://gusku.site/game/ignited-steel-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ignited Steel: Prologue\", \"description\": \"Looking for information on Ignited Steel: Prologue? Check out the release date (Oct 14, 2022), developer insights from Yokaicade, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yokaicade\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Meteorbyte Studios,G-DEVS.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2015040/header.jpg?t=1665997027\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}