{
    "AppID": 1114950,
    "Name": "Learn Japanese RPG: Hiragana Forbidden Speech",
    "Release date": "Oct 20, 2022",
    "About the game": "Play the free demo! If you like the demo, buy the full game and continue from your last save point! Learning should be an adventure Dialogue changes from English to Japanese as you learn and progress in this comedic RPG backed by professional Japanese voice acting. Learn Japanese RPG: Hiragana Forbidden Speech is aimed at anime fans with little to no Japanese ability, but any beginner may enjoy and benefit, even those who have learned hiragana before. We've made the game we wanted to play when we were first learning Japanese. What will I learn? How to read, write, and pronounce hiragana Hiragana is a set of characters used to write Japanese words. Over 240 common Japanese words used in anime Enough grammar to understand basic Japanese sentences How will I learn? We believe context, immersion, and fun are key to effective learning. This game isn't just an RPG with Japanese flashcard-type battles. It is much more. First, you will learn hiragana by using them in battles. A hiragana appears and you type in the related roumaji (english character) to attack foes. Each hiragana can be leveled up. The higher its level, the less often it will appear in battle. Second, after learning a new hiragana, you will learn words spelled with that hiragana. Each word will expand your vocabulary and strengthen your grasp on the hiragana. They will also appear in battles and level up like hiragana. Third, the game's Adaptive Dialogue System will introduce the words you learn into dialogue. Most dialogue is voiced by professional Japanese voice actors . You will hear and see how words fit together to form sentences and experience the use of words in various situations. Fourth, there are 50+ brief in-game tutorials that will teach you word usage, basic grammar, and a number of Japanese language concepts. However, our emphasis is on learning by doing. What is the Adaptive Dialogue System and how will it help me? The Adaptive Dialogue System helps you learn by doing. It determines whether to show dialogue in Japanese or English based on your current knowledge. The more Japanese words and grammar you learn, the more dialogue will appear in Japanese! For example, consider the following sentence: 'doko iku?' (Where are we going?) If you don't know one of the words 'doko' (where) or 'iku' (go, going), then this sentence will be shown in English. This is to avoid frustrating you with content you haven't yet learned. However, if you know both words, it will be written in Japanese hiragana. Pressing a button displays the 'roumaji' of the sentence. Roumaji uses the English alphabet to describe Japanese sounds. A second press displays the English translation. Features Professional Japanese voice acting (Over 4000 lines of spoken dialogue) Teaches Japanese starting from zero Teaches all the most common hiragana Teaches over 240+ Japanese words commonly used in anime Teaches word usage and Japanese grammar (over 50 tutorials) Adaptive Dialogue System gets you reading Japanese fast without being overwhelmed Real-time battles and humorous dialogue make learning fast and fun Gradual Reveal Dialogue System let's you conveniently check your reading comprehension All Hiragana Mode let's advanced adventurers immerse themselves instantly in a deeper Japanese experience Battle drills can be disabled at any time Level up controls allow you to adjust the pace of your learning Disable automatic voice over to practice reading comprehension easily 16-20 hours of gameplay Tremendous replay value. Game adjusts Japanese content to your level from the very beginning",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1114950/header.jpg?t=1666473459",
    "Price": 14.99,
    "Developers": "Study Bunny Games LLC",
    "Publishers": "Study Bunny Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_7221ed956d1bd4e6815369e67f5b803cd44ce387.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_4d8d9aa4fa56ab2ea5ace8f7352495a0d2935981.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_33c61ea73d05e672679b8eb656b7ac9cdf88eb13.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_0f92709dc8d5e0149f8a90cc10f221e1c51b1261.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_5bc56deddb5adb84f443696cade3ba7fe48262cd.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_11d94724582e671c817d0ba44ab5a103ee61b257.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_5480eebdbf7b515a7e766a7c74f7a97c6dc447af.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_99c1b66a5aa42bb2503ad3d162bec419b9db912f.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_3668d8067ed162612ad962b3d2bb043df9dded62.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_9eaaaf24652b43f9c0b52fd99ee417e4090a54aa.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_519fd25ee8c54df80a6479883c33d8d7f50b2b1c.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_479716114c4e311c93e97e797fcb216e46b9ebbb.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_52a9bc3390756109daacbe73efd091ae15ab05bf.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_dc60426c35f013888a768e4382e2907ab6eeb5fb.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_3b68f26779048745656b6fe1cabb9c1be062a8bd.1920x1080.jpg?t=1666473459,https://cdn.akamai.steamstatic.com/steam/apps/1114950/ss_6662b0c720c7733823ee3e0613603fd389b1a5b4.1920x1080.jpg?t=1666473459",
    "Slug": "learn-japanese-rpg-hiragana-forbidden-speech",
    "Meta Title": "Learn Japanese RPG: Hiragana Forbidden Speech: Oct 20, 20...",
    "Meta Description": "Looking for information on Learn Japanese RPG: Hiragana Forbidden Speech? Check out the release date (Oct 20, 2022), developer insights from Study Bunny...",
    "Alt Text Image": "Official header image for Learn Japanese RPG: Hiragana Forbidden Speech game - Steam 1114950",
    "Canonical URL": "https://gusku.site/game/learn-japanese-rpg-hiragana-forbidden-speech",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Learn Japanese RPG: Hiragana Forbidden Speech\", \"description\": \"Looking for information on Learn Japanese RPG: Hiragana Forbidden Speech? Check out the release date (Oct 20, 2022), developer insights from Study Bunny...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Study Bunny Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Study Bunny Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1114950/header.jpg?t=1666473459\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}