{
    "AppID": 1898290,
    "Name": "LEGO® Bricktales",
    "Release date": "Oct 12, 2022",
    "About the game": "In LEGO® Bricktales, discover an innovative brick-by-brick building mechanic to design puzzle solutions from your own imagination. See your creations brought to life in a beautiful LEGO world where every problem has a constructive resolution. Embark on an epic adventure across a world of beautiful LEGO diorama biomes crafted brick by brick as you search for inspiration to help your grandfather reinvigorate his rundown amusement park with your little robot buddy in tow. Your journey will take you to the deepest jungle, sun-drenched deserts, a bustling city corner, a towering medieval castle, and tropical Caribbean islands. Help the minifigures of these worlds by solving puzzles and unlock new skills throughout the story to further explore these worlds and uncover the many secrets and mysteries they contain. From purely aesthetic creations, such as a market stand or music box, up to functional physics-based puzzles like building a crane or gyrocopter - each diorama offers a variety of construction spots with the freedom of intuitive brick-by-brick building. In each spot you are given a set of bricks and it’s up to you to figure out a unique build that will work. On top of specific puzzles and quests, there are additional builds in the amusement park so you can customize the rides to make them your own! Your grandfather, a genius inventor, has called you for help! His beloved amusement park is about to close as the mayor is threatening to shut everything down and seize the land if the necessary repairs aren’t made to bring it up to code. With the help of your powerful little robot buddy, you can restore it using a mysterious device based on alien technology. As a source of power, the device needs happiness crystals, which you can harvest by making people happy and solving their problems. With the aid of a portal, travel to different locations all around the world to help people and collect their happiness crystals. Strap in for the ultimate building adventure and save your grandfather’s amusement park! A globetrotting LEGO adventure: Experience a whimsical and epic adventure around the world, packed with charming dialogue and fun secrets to unravel. Beautiful diorama worlds: Explore five varied story world biomes and the amusement park hub, all fully built out of LEGO bricks. Build like never before: Discover the most intuitive brick-by-brick building in a LEGO video game, as you see your creations come to life in a three-dimensional world. Test your skills with varied puzzles: Different types of puzzles will test your building skills. Use your engineering brain in functional physics-based puzzles to build a bridge for a digger to get across a river, put your designer hat on to build a stunning new throne for the King, or customize the rides in the amusement park. Master your builds in Sandbox Mode: Unlock the Sandbox Mode upon completing a construction spot, then you go back in and improve your build with a huge selection of additional bricks from different themes. Heaps of items to collect and unlock: Find collectables in the different dioramas and use them to buy cool new items for your wardrobe or new brick color sets for the sandbox mode. Build your unique character: Create your own minifigure character from a huge selection of parts and unlock more options inspired by the worlds you visit as you progress through the story. Recommended for ages 12+",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1898290/header.jpg?t=1665586807",
    "Price": 29.99,
    "Developers": "ClockStone",
    "Publishers": "Thunderful Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_d47df28c530ae6c60adf411528772c85ab069c51.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_d42b98d7ba4301a85a66c12637e050fdb6f1d46a.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_0fe685d98dec4ed074cbe84622c44371d77f6681.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_e20e90984e7f0b9e3306d717a0f254163d5b20cc.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_32f28288e1436d962f14b17d33580f0619c637ca.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_0a860cf7cbdbf944d96f52ebab6c5a2fcad739b6.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_a281d7415007394ff9cc3c091e5232118a7b9b7e.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_3fecd9fcb1e4f619723a51c9c86d7143892f989e.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_9d011d9a9dd4f74724785d6673fd418808183b79.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_ed9005457ef26c842968dd5925b7db9597b75152.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_70cb46c8c468e303e7042188f1b96c9881751ffa.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_0fa89ee9d98a99968f8eb148395c9009c8bd06bd.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_0369ce5018e063db07cc155a73621400fbc639ce.1920x1080.jpg?t=1665586807,https://cdn.akamai.steamstatic.com/steam/apps/1898290/ss_58813ba60caa38829a3866a39e4db578f986f2a9.1920x1080.jpg?t=1665586807",
    "Slug": "lego-bricktales",
    "Meta Title": "LEGO® Bricktales: Oct 12, 2022, ClockStone and Full Overview",
    "Meta Description": "Looking for information on LEGO® Bricktales? Check out the release date (Oct 12, 2022), developer insights from ClockStone, and a complete game summary.",
    "Alt Text Image": "Official header image for LEGO® Bricktales game - Steam 1898290",
    "Canonical URL": "https://gusku.site/game/lego-bricktales",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LEGO\\u00ae Bricktales\", \"description\": \"Looking for information on LEGO\\u00ae Bricktales? Check out the release date (Oct 12, 2022), developer insights from ClockStone, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ClockStone\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Thunderful Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1898290/header.jpg?t=1665586807\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}