{
    "AppID": 2144630,
    "Name": "Link Bomb☆Party/链接炸弹☆派对",
    "Release date": "Oct 14, 2022",
    "About the game": "Summary Novel connection + match-3 + blasting gameplay! Mild character strength development! 8-direction DOF connection expands your thinking! And all kinds of beautiful CG! System Click the same square with the mouse and drag it to make it connect as many squares as possible at one time, and the damage to the enemy will be higher! Connecting more than a certain number of blocks at one time will also generate new blasting blocks! Connect the blasting block with the normal block in the next connection, and it will produce more blasting explosions! Reduce the enemy's hp to 0 to pass the level! ! After passing the level, you will get gold coins and experience, and you will unlock beautiful CG rewards! In the information interface of the level selection, you can spend gold coins to improve the character attributes, which is convenient for players to pass the later levels. Beauty set 1. Mengmeng: The owner of the No. 1 Maid Pavilion, a hidden skill perspective, anyone can get this skill after capturing their hearts. Aged 20 years old, he has short light purple hair, charming and charming, a pair of fox peach eyes, charming, bold and revealing clothes, and likes to command others to work. 2. Zhao Lili: The owner of Hall 2 of the Maid Hall, the hidden skill is peeping at the heart. Anyone who captures their heart can get this skill. He is 22 years old, has short red hair, is playful and cute, likes to wear fishnet socks, likes to take selfies, and wants to take the most beautiful pictures of himself. 3. Qin Jia: The owner of the No. 3 Maid Pavilion, who has a hidden skill into a dream, anyone who captures his heart can obtain this skill. He is 25 years old, has seaweed-like hair, has a sweet voice, long and sexy legs, and is lazy and charming. He likes to drink juice the most and wants to drink the most delicious juice in the world. 4. Liu Nana: A teacher at a skill training school, the hidden treasure is the golden finger. After obtaining the golden finger, you will have the opportunity to obtain multiple skills of the golden finger. Anyone who captures their heart can get this treasure. Aged 30 years old, with blue-gray medium-length hair, fashionable and trendy, likes smart men, likes to drive jeeps, and dresses sexy. 5. Huang Qian: Pajama model, hidden treasure refining pot, some materials can be placed in the pot and refined into various instruments, anyone can get this treasure after capturing their hearts. Aged 28 years old, tall, slender and straight legs, sexy and enchanting, with black and gray braids, he likes to show off and show himself. 6. Tong Xinxin: The owner of the cheongsam, the hidden treasure is a fresh fruit that prolongs life, which can instantly restore physical strength. Aged 23 years old, he likes to tie two ball heads, has a lively and cute personality, has a childlike face and big breasts, and has a plump and sexy figure. 7. Zhou Yu: The owner of the No. 1 store of the dress shop, the hidden skill is golden finger alchemy, which can be turned into gold after starting. Purple medium and long curly hair, outstanding appearance, gentle and beautiful appearance, great figure, 8. Hu Ying: The owner of the second shop of the dress shop, the hidden skill is the golden finger teleportation technique, which can be teleported instantly after activation. He has long purple wavy hair, a gentle personality, and is very talkative. 9. Sima Qing: The owner of the No. 3 store in the dress shop. The hidden skill is the golden finger puppet technique. After activation, he can control anyone except Xiao Ya. She has a sweet appearance, has curly pink hair, likes to tie a double ponytail, and has an enchanting figure. She has strict requirements on the dress of employees. She likes to wear skirts and like to show off. 10. Xiao Ya: The highest-ranking figure, a national idol, you can gain the highest skill by capturing her heart: self-created supernatural powers. Aged 26 years old, she looks sweet and cute, like a beautiful girl in the second dimension, with long purple hair, and likes fancy clothes in private.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2144630/header.jpg?t=1665741871",
    "Price": 2.09,
    "Developers": "LOP Games",
    "Publishers": "LOP Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_c1833a3ba4e7d510ba1c78500cc25857447ae207.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_7cd01bcfbe290ab581517642274743204bb0a92c.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_6d38353bc3ea59e854250fecdeccfa2bb4057c70.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_917c8b234f8d0007fe9bd8198caa877d020c13e0.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_4b8fa63e7684a1281df29f14db88facaef3cb70c.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_77a6ac328d096c4f68b4c7ed7b0f71b2645ecd40.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_8a79fb3dd91431b843dc6ae2f8c22aaec346f2a1.1920x1080.jpg?t=1665741871,https://cdn.akamai.steamstatic.com/steam/apps/2144630/ss_38538be90b1c307664d7900f46c31ffa110f8ce6.1920x1080.jpg?t=1665741871",
    "Slug": "link-bombparty",
    "Meta Title": "Link Bomb☆Party/链接炸弹☆派对: Oct 14, 2022, LOP Games and Full...",
    "Meta Description": "Looking for information on Link Bomb☆Party/链接炸弹☆派对? Check out the release date (Oct 14, 2022), developer insights from LOP Games, and a complete game su...",
    "Alt Text Image": "Official header image for Link Bomb☆Party/链接炸弹☆派对 game - Steam 2144630",
    "Canonical URL": "https://gusku.site/game/link-bombparty",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Link Bomb\\u2606Party/\\u94fe\\u63a5\\u70b8\\u5f39\\u2606\\u6d3e\\u5bf9\", \"description\": \"Looking for information on Link Bomb\\u2606Party/\\u94fe\\u63a5\\u70b8\\u5f39\\u2606\\u6d3e\\u5bf9? Check out the release date (Oct 14, 2022), developer insights from LOP Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"LOP Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LOP Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2144630/header.jpg?t=1665741871\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}