{
    "AppID": 2059670,
    "Name": "Moss: Book II",
    "Release date": "Oct 20, 2022",
    "About the game": "Moss: Book II is the award-winning sequel to the fan favorite VR game Moss and is being hailed as a top contender for VR Game of the Year and has secured a spot on multiple essential and must-play lists. Book II is a single-player action-adventure puzzle game from Polyarc tailor-made for VR. It combines classic components of a great game—such as compelling characters, gripping combat, and captivating world exploration—with the exciting opportunities of virtual reality. Moss: Book II picks up right where the story in Moss left off. Having rescued her uncle Argus, Quill’s adventure continues with the revelation that a winged tyrant is hunting her within the castle where her uncle was held captive. But Quill has a plan of her own, one that could finally end the merciless rule of the Arcane and save the world from a great unmaking. The journey will be trying—filled with triumph and heartbreak alike—but new allies, old friends, and the very nature of the castle itself can offer help along the way. Yet in the end, it is you alone who can lift Quill up to save this world, and together, rise to legend. Gameplay Reach into The World of Moss Your every action has even more meaning in Moss: Book II, as we take full advantage of today’s virtual reality technology, letting you move objects, battle enemies, and manipulate the field of play as the key ally to our hero, Quill. Adventure to Fantastic Places Travel back to a lively world that hums with wonder and legend. Explore the castle where her uncle was held captive, caves beneath, snow covered mountain tops to the depths below filled with ancient artifacts, mysterious creatures, and sprawling views. Form a Unique Bond Your abilities are complementary to Quill’s in an alliance for the ages. Combine classic, action-adventure controls with a world that responds to your touch. Solve puzzles, combat evil, and achieve victory together. A Story Told Unlike Any Before From its opening pages, Moss: Book II continues to draw you into a first-of-its-kind fully immersive world of myth and magic. Enjoy a rich tale of intriguing characters, illustrious artifacts, and legends old and new.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2059670/header.jpg?t=1666478810",
    "Price": 29.99,
    "Developers": "Polyarc, Inc.",
    "Publishers": "Polyarc, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2059670/ss_834295727130868bb1207647fe2ba92e4e750dec.1920x1080.jpg?t=1666478810,https://cdn.akamai.steamstatic.com/steam/apps/2059670/ss_b5a9a8045629f32a9e9387a7d9efad0b0c3c9baf.1920x1080.jpg?t=1666478810,https://cdn.akamai.steamstatic.com/steam/apps/2059670/ss_7a7f1fe7b99067ff887ea4f22d65bd7af0dcba39.1920x1080.jpg?t=1666478810,https://cdn.akamai.steamstatic.com/steam/apps/2059670/ss_adb075fcab5b9d47075fba4b8e77a51c55ca2955.1920x1080.jpg?t=1666478810,https://cdn.akamai.steamstatic.com/steam/apps/2059670/ss_656794940f4ca799c0fac7b62d712f9323e2d500.1920x1080.jpg?t=1666478810,https://cdn.akamai.steamstatic.com/steam/apps/2059670/ss_e9972022765ef196bd3c57a9407f15a30a59e88e.1920x1080.jpg?t=1666478810",
    "Slug": "moss-book-ii",
    "Meta Title": "Moss: Book II: Oct 20, 2022, Polyarc, Inc. and Full Overview",
    "Meta Description": "Looking for information on Moss: Book II? Check out the release date (Oct 20, 2022), developer insights from Polyarc, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Moss: Book II game - Steam 2059670",
    "Canonical URL": "https://gusku.site/game/moss-book-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Moss: Book II\", \"description\": \"Looking for information on Moss: Book II? Check out the release date (Oct 20, 2022), developer insights from Polyarc, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Polyarc, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Polyarc, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2059670/header.jpg?t=1666478810\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}