{
    "AppID": 2073540,
    "Name": "Night Gate",
    "Release date": "Oct 13, 2022",
    "About the game": "NIGHT GATE OPEN WORLD VAMPIRE HUNTING. At its core, Night Gate is an open-world shooter/adventure RPG game built in Unreal Engine 5. You will be given full freedom to go anywhere you can see. The game is set in a massive bayou, and the player is given an Airboat that allows them to go anywhere! The Story So Far... Nobody really knows how the world changed so fast, but what we do know is that when the Vampires came, mankind was driven behind the Night Gate. The Night Gate, and the walls that connect to it, surround the last human settlements. Little is known if the Night Gate was designed to keep the Vampires out or to keep mankind in, like some kind of cattle ranch. You play as Robin, a Vampire Hunter, who has been tasked with killing the Master Vampire, Grendle. You are a weapons expert and master survivor. Gameplay Set in a giant swamp, the player has the freedom to go where they want on their Airboat. Players will need to keep an eye on the amount of sunlight there is as well as their level of hunger. Dynamic Hit Reactions Shoot weapons out of enemy hands, or shoot them in the leg to trip them. Enemies will react realistically to your gun shots. Use this to tactically target enemies. Full working Day/Night system. The game features a fully working clock system. The settlements will lock down during the night, and the ghouls come out to hunt at night. Players should time their outings, going out at night risks danger, but can open hidden paths. Explore and Hunt Hunting is a way for you to get health and other items needed to stay strong. Fishing record leaderboards will be available in the Steam community. The gameplay features extreme 3rd person shooter action where the player is given a wide range of weapons. The primary weapon is Robins trusty Crossbow can be outfitted with many types of Arrowheads, including explosive and fire arrows. Vampires Enemies include a range of Vampire types as well as other creatures of the night. Vampires can not go out during the day and will burst into flames if they do so. However, they can move under shadows, such as inside old buildings or under thick trees that provide protection from the direct sun. Vampires come in several different classes. Ghouls - A basic goblin-like Vampire that can use primitive weapons. Ghouls tend to travel in packs and try to swarm humans. These are humans that have a weakened strain of the V-virus, a supernatural-like pathogen that all Vampires carry. Vampires - A fully transformed Vampire of the night. Very strong, they tend to live in caves or other dark places. Can be killed by an arrow to the heart or massive body damage. Alpha Vampires - Strong Vampires that can cause massive damage quickly. They can only be killed with a strike to the multiple hearts they have on their body. Features Night Gate is a massive 20-hour-long indie game. Filled with side missions and NPCs the player can talk to and interact with. Full working Day/Night system. Powered by the latest graphics of Unreal Engine 5, players can explore the massive open world of the bayou. The game features leadership boards based on in-game challenges such as ranking players' biggest caught Fish and achievements for players that are looking for a challenge.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2073540/header.jpg?t=1665708609",
    "Price": 11.24,
    "Developers": "DangerousBob Studio LLC",
    "Publishers": "DangerousBob Studio LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_9cbb89d244fa41b85d46dfe1a77f28b9fc483095.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_39dfdfe574a829096e979c9ca4467800f6f7ee42.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_74e052e0d1270759e5a66e8cf0237bf7ffcf2b57.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_9d0a62006030ca2890fea6535b244226540d3f04.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_1efbd11ecd6118d51f0f787fa98839d3fbe59173.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_5d9a192395b5438bb613c7ec71ea04ea9deecb4c.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_a297aa7b769578aedeeca5aca9f03f726f63b2b2.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_3c8c7887349f159be91071da173c30e368de2da5.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_af91c969d26d3ecf4f6d1266275da95c38f5af46.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_ad022bcf12a22389316d2b88c3b0dec5c70dcccf.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_d0a9f6b8a76676d2fba220a92c3a7db4c80d18b3.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_2b2ad4371e7a137536db42a5b89a3fd65980889a.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_ec620eecfcd888cb4b80d0df6dd7588836bb7e2b.1920x1080.jpg?t=1665708609,https://cdn.akamai.steamstatic.com/steam/apps/2073540/ss_d3e2f3c9ad323cc4715cecac7ae099f85c0128ec.1920x1080.jpg?t=1665708609",
    "Slug": "night-gate",
    "Meta Title": "Night Gate: Oct 13, 2022, DangerousBob Studio LLC and Ful...",
    "Meta Description": "Looking for information on Night Gate? Check out the release date (Oct 13, 2022), developer insights from DangerousBob Studio LLC, and a complete game s...",
    "Alt Text Image": "Official header image for Night Gate game - Steam 2073540",
    "Canonical URL": "https://gusku.site/game/night-gate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Night Gate\", \"description\": \"Looking for information on Night Gate? Check out the release date (Oct 13, 2022), developer insights from DangerousBob Studio LLC, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DangerousBob Studio LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DangerousBob Studio LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2073540/header.jpg?t=1665708609\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}