{
    "AppID": 2091790,
    "Name": "No More Future",
    "Release date": "Oct 7, 2022",
    "About the game": "Anything can begin, and end, at a moment's notice... You're a young adult yuuman (homo anthropomorphis), living in a futuristic America in the late 22nd century. Though you had a life, dreams, and aspirations once, it all got swept away once you were diagnosed with incurable late-stage brain cancer; now you're stuck in a hospital, living the last few weeks of your life in existential agony, incapable of processing what you did wrong to deserve this fate. Everything changes when, one day, you're approached by a scientist from the world's largest mega-corporation, who offers you a chance to escape your dying body and have your mind transplanted onto an android synth vessel; the only catch being, nobody knows whether the process works or not, whether you'll survive the transition or ultimately perish. With little holding you back, you eventually accept... ...You awaken in your new body, feeling quite different from how you were before. Nobody can tell whether it's truly you inside the machine, or an AI pretending, believing that it's you. Not even you. In a world where technology's constantly evolving, advanced AIs are viewed with fear and suspicion and few things are certain, you have to rebuild your old life from scratch, convince those who abandoned you on your deathbed that you're still here, and ultimately figure out whether you truly are who you claim to be. About the game: NMF is a linear Furry Sci-Fi Visual Novel: explore a high-tech futuristic world as an android, meet all sorts of new people and reconnect with some old faces, find the truth behind your existence and your purpose in this new world. The game addresses heavy topics such as death, suicide, depression, anxiety, and existential dread. If you are suffering from depression or are easily overwhelmed by these topics, I advise you to exercise caution when reading the contents of this VN or refrain from playing altogether. The game is entirely SFW, though there are some adult non-explicit jokes thrown in for comedic effect. There aren't, nor will there ever be, any explicit scenes or suggestive content in this VN. There are fight scenes in the novel that feature non-graphic depictions of violence.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2091790/header.jpg?t=1665170265",
    "Price": 0.0,
    "Developers": "Sedge",
    "Publishers": "Sedge",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2091790/ss_4ed7303e0a1d496e2d812e60d8703434f0eb9a69.1920x1080.jpg?t=1665170265,https://cdn.akamai.steamstatic.com/steam/apps/2091790/ss_79cbdf75cf92cf5bca3a762e8ff3def9816ba69e.1920x1080.jpg?t=1665170265,https://cdn.akamai.steamstatic.com/steam/apps/2091790/ss_2de67687a94c679af68cbff2626fe722bfa44493.1920x1080.jpg?t=1665170265,https://cdn.akamai.steamstatic.com/steam/apps/2091790/ss_b6d6046adf09bf40b18adb26d9ff56a27f6d6d0d.1920x1080.jpg?t=1665170265,https://cdn.akamai.steamstatic.com/steam/apps/2091790/ss_d1b2da2804a5a95a603b0558d19f4c8f0528e7c2.1920x1080.jpg?t=1665170265",
    "Slug": "no-more-future",
    "Meta Title": "No More Future: Oct 7, 2022, Sedge and Full Overview",
    "Meta Description": "Looking for information on No More Future? Check out the release date (Oct 7, 2022), developer insights from Sedge, and a complete game summary.",
    "Alt Text Image": "Official header image for No More Future game - Steam 2091790",
    "Canonical URL": "https://gusku.site/game/no-more-future",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"No More Future\", \"description\": \"Looking for information on No More Future? Check out the release date (Oct 7, 2022), developer insights from Sedge, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sedge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sedge\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2091790/header.jpg?t=1665170265\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}