{
    "AppID": 1774770,
    "Name": "Phantom Hysteria",
    "Release date": "Oct 12, 2022",
    "About the game": "Phantom Hysteria is a 1-4 player online co-op ghost hunting game. Take on ghost hunting contracts with your taped-together equipment as one of four playable P.I.N.E characters. Hone your skills for your designated class, utilize an array of equipment to decipher your clues, and use that to identify your contracted apparition. Choosing from a variety of thrilling maps, you and your team will be required to investigate your phantom, untether them, and finally neutralize them from this plane - that is if you can manage. Investigate Using your taped-together gear, it is up to you as a member of P.I.N.E to find out which phantom is attached to the location. Using tools like the EMF detector, temperature gun, and phantom book, you will be able to identify which ghost type you are up against. Untether the Phantom As a P.I.N.E member, it is your job to take care of the phantoms. You will be required to hunt down and untether the phantom from this world. Once you know what kind of phantom you're up against, you will have to search for totems, runes, or statues to successfully loosen the phantom’s grip from this world. Neutralize the Phantom What’s this? Flesh? Yes, you’ve done it P.I.N.E! You've removed the phantom's ties to the spirit world and made them corporeal. Now you must neutralize the phantom, but they will fight back with everything they have. By using a weapon of your choice, anywhere from an EMFG rifle to a holy water-filled water gun, you can banish the phantom and restore peace. P.I.N.E Classes In Phantom Hysteria, you will be able to choose and level up 4 different classes to help you in your fight against these deadly phantoms! Each class is unique to cater to all play styles including support and tank. Arcana Cards Arcana Cards are purchasable perks that can be switched out before every game that range in rarity, from common to unique. They can help you with stamina, health, adjustments to weapons, and more! Using these tools will be beneficial, and at times integral, for your unceasing battle to rid this world of phantoms. Phantom Types As a member of the P.I.N.E ghost hunting crew, you must know what you're going up against. When investigating, your phantom will be one of these phantom types shown above. The Phantoms One of the leading antagonists, Morrigan Payne is a powerful witch unshackled by death. Originally Bronwyn Craddock, the once-kind faith healer was murdered by witch hunters alongside her people. What became of Molly Adkins should have been avoidable. A young teen living in the early 1970s, Molly was supposed to go to a movie theater with her cousin, but on that fateful night, fell victim to drunk driving. Battered, broken, and drowned, Molly wanders the earth in a haze of fear and denial. Lucas Jones was a gangster of New Orleans, a made man of the Mahoney crime family. When he began to soar in popularity and status in the family, his don interrupted his flaming rise to power by pouring molten gold down his throat. Leaderboards Test your skills against other P.I.N.E Agents and make your way to the top of live leaderboards where prizes await you! Warning WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES - READ THIS NOTICE BEFORE PLAYING A very small percentage of people may experience epileptic seizures or blackouts when exposed to certain kinds of flashing lights or light patterns. These persons, or even people who have no history of seizures or epilepsy, may experience epileptic symptoms or seizures while playing video games. If you or any of your relatives have an epileptic condition or have had seizures of any kind, consult your physician before playing any video game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1774770/header.jpg?t=1665720524",
    "Price": 17.99,
    "Developers": "Lunar Tale Games LLC",
    "Publishers": "Lunar Tale Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_fd9c1125d7f9114a824700f8e3c9fb1db94c06ff.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_620dc73f56c4cddad8414ef5bc8ae6effbbf07b1.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_520cb6e0e5f9225aa4042d45dd4b91e031064e4d.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_2afa8ee968db69c586bc23c3b4499ecc688d6ed2.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_4a192874bc586bb1ff44b7903ae3414236c19a6a.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_558eb964f7154500ecafa510a00a32a767675cc0.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_f7aa882e403ee15567abff6b5687cce950c610c4.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_9ee40079132e1a2b1e97d927786e5271c4f8f86c.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_04ffc32711eb2feb41ebbea12e46d22c052ee187.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_46ed07fe0a1477b54b06af2052e874b710ecc6e6.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_8c4307a40eddcc279c6fe57c2431dfa825a1dabb.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_d2bd131e1b146390e55adbf61bf50d6dcb17ae9f.1920x1080.jpg?t=1665720524,https://cdn.akamai.steamstatic.com/steam/apps/1774770/ss_2d12318e1fc19c2d6ab67fe290d25f0bc7220aa3.1920x1080.jpg?t=1665720524",
    "Slug": "phantom-hysteria",
    "Meta Title": "Phantom Hysteria: Oct 12, 2022, Lunar Tale Games LLC and ...",
    "Meta Description": "Looking for information on Phantom Hysteria? Check out the release date (Oct 12, 2022), developer insights from Lunar Tale Games LLC, and a complete gam...",
    "Alt Text Image": "Official header image for Phantom Hysteria game - Steam 1774770",
    "Canonical URL": "https://gusku.site/game/phantom-hysteria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Phantom Hysteria\", \"description\": \"Looking for information on Phantom Hysteria? Check out the release date (Oct 12, 2022), developer insights from Lunar Tale Games LLC, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lunar Tale Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lunar Tale Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1774770/header.jpg?t=1665720524\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}