{
    "AppID": 2133440,
    "Name": "Pixelmancer",
    "Release date": "Oct 14, 2022",
    "About the game": "Pixelmancer is a casual roguelite game developed by a single developer. You play as a necromancer with pets that will aid on your journey, you can upgrade almost anything for your hero and your pets. You will die constantly but become stronger and better with every death. How far can you go? The beginning of the game can be difficult as your hero will be weak but your enemies will drop soulstones upon death and with soulstones you can upgrade your hero and your pet and go back into the world and try again - - - FEATURES - - - Steam Deck Support Pixelmancer works on Steam Deck with Steam Cloud sync, the game is designed with the Steam Deck in mind while continuing to work on Windows PCs as well Controller support In addition to Mouse &amp; Keyboard, there is full controller support. Please note that the icons in the game are in Steam Deck layout (for example ABXY, L1, R1 etc) using another controller will work but NOT change the icons in the game Steam Achievements There are achievements in the game and more added during early access No Micro-transactions or DLCs There are no micro-transactions in this game nor any planned ones. There are also no intentions of working on DLCs, all new content will be received as FREE updates - - - GAME FEATURES - - - Adventure Mode This is the core gamemode and currently the only gamemode, you'll be spawned into level 1 (Tier 1) of the world and work your way up the tiers with more and more enemies to defeat as well as meeting new enemies. Dying in adventure mode will reset you back to level 1 (Tier1) in the world but you keep your soulstones and player progression, you will re-enter the world stronger than previously and try to get further than before Lots of upgrades! At the moment there are over 10 upgrades to choose from with more being added during early access. You can upgrade almost anything, for example you can upgrade your hero's movement speed, mana regen, fireball damage and its range. There are also pets in the game that you can upgrade, for example their max health, damage, movement speed, detection radius and even unlock a new ability to revive your pet Pets Pixie will join your adventure right from the start of your first journey! Stadie is waiting to join your adventure. Many more pets are planned for early access and will need to be unlocked Tiers &amp; Biomes Currently the game has 2 tiers; Forest and Dark Forest with more being added during early access Soul Hunter When you spawn into the world, you arrive with a summoning portal. Watch your back though as Soul Hunters are known to use summoning portals too Choose your path The player has the freedom to choose how the game should fit to their play style - Don't like pet systems in games? - You can invest all your soulstones into upgrading your hero instead. - Do you love pet systems in games? - You can invest all your soulstones into your pets and create an army, it's possible to leave your hero weak while making your pets the strongest part of your team. - Maybe you want both? - You can invest soulstones into both your hero and your pets. Play the way you want to play -------------------------- - Personal message from the developer - Hi, my name is Gem and ever since I've had the Steam Deck, I've been itching to make my own game for the device. This is that game, this is my first Steam game and I hope you'll enjoy the game as much as I enjoyed developing and playing it as I'd love to continue the support for the game after early access as long as there's people who still want it Please keep in mind that I consider myself as a novice programmer and there are few game features that I'm simply not able to make such as online multiplayer. I plan to have more features in the game added during early access but they will remain hidden as I don't want to false promise people if it doesn't become a reality due to my lack of programming skills Thank you very much for playing (or considering) my game, Gem",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2133440/header.jpg?t=1665956022",
    "Price": 2.39,
    "Developers": "Gem Bear Games",
    "Publishers": "Gem Bear Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2133440/ss_b13c1fdc8621b4350f64391f010d0a484ceb63b4.1920x1080.jpg?t=1665956022,https://cdn.akamai.steamstatic.com/steam/apps/2133440/ss_16d63f72c981d09bc7aca1477ee242a751e1fb08.1920x1080.jpg?t=1665956022,https://cdn.akamai.steamstatic.com/steam/apps/2133440/ss_2462886932fba3c31573a5fd1ef29235778dae81.1920x1080.jpg?t=1665956022,https://cdn.akamai.steamstatic.com/steam/apps/2133440/ss_03ff66eb819cb02f37b55753f2d5a3e74b264bd5.1920x1080.jpg?t=1665956022,https://cdn.akamai.steamstatic.com/steam/apps/2133440/ss_5f07e2f18f784423c73f63fde79e3b16465f1008.1920x1080.jpg?t=1665956022",
    "Slug": "pixelmancer",
    "Meta Title": "Pixelmancer: Oct 14, 2022, Gem Bear Games and Full Overview",
    "Meta Description": "Looking for information on Pixelmancer? Check out the release date (Oct 14, 2022), developer insights from Gem Bear Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Pixelmancer game - Steam 2133440",
    "Canonical URL": "https://gusku.site/game/pixelmancer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pixelmancer\", \"description\": \"Looking for information on Pixelmancer? Check out the release date (Oct 14, 2022), developer insights from Gem Bear Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gem Bear Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gem Bear Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2133440/header.jpg?t=1665956022\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}