{
    "AppID": 1477700,
    "Name": "Project Wunderwaffe",
    "Release date": "Oct 10, 2022",
    "About the game": "The Allies are approaching from the west, but at the same time, the Soviets are coming from the east. None of the soldiers remember the taste of victory. Fear and chaos dominate on the front lines. The General Staff is beginning to disintegrate, and for many, the fate of the war is already sealed. Some commanders give retreat orders. However, those who are still fighting will not surrender until the end of the war. You just got only one chance to construct a wunderwaffe. Welcome to the base! Base construction and technological development A self-sufficient, huge, underground complex that is an epic fortress that cannot exist without you. Therefore, be smart! Build your base wisely, manage and develop it. Remember, you are creating a weapon so powerful that you can influence the fate of the war. The network of underground corridors and special-purpose rooms must function efficiently. Get water and electricity to them. Mine resources, break codes, develop the technology tree, and cooperate with spies. Construct and produce weapons and inventions. This is what your soldiers are waiting for! Control the march of hostile troops and gain time to complete the project. Recruit into your ranks the best scientists, spies, and agents who will provide you with key information. In Project Wunderwaffe, you will build a weapon the world has not heard of yet! Wunderwaffe construction The invention of the atomic bomb is only a small part of what you can do in your research centers. Make your every invention wreak havoc. The range of possibilities for creating weapons of final victory is extremely wide. Invisible land vehicles, super missiles, or Die Glocke. Find out in Project Wunderwaffe what your production lines can do. Development of the military base Building a wunderwaffe requires efficient database management, as well as acquiring and allocating raw materials and resources. Your project is constantly in danger, so fend off attacks and act in a way that allows you to gain as much time as possible to complete wunderwaffe. Remember, every choice matters. Each of your decisions will have consequences. Use propaganda mechanisms, arouse fear and terrify with the possibilities of the superweapon you are working on. Defending the base Your base is perfectly hidden underground, but you need to be vigilant. Your enemies' intelligence is awake. It will do anything to find and destroy you. When an anti-aircraft alarm sounds in your base, panic breaks out and a ruthless fight for survival. Attempts at bribing officers, sabotage, and attacks on raw materials are only some of the challenges you will face. Always be ready, stay in control of the situation and make sure that your base is in fully operational and combat readiness. Your enemy is awaiting your mistake! Project Wunderwaffe is a strategy game set in the realities of World War II. Moreover, it’s unique in terms of graphics and sound design. We will pull you into the game for a long time! /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1477700/header.jpg?t=1665416857",
    "Price": 13.49,
    "Developers": "Gameparic",
    "Publishers": "Gameparic,Games Incubator,PlayWay S.A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_17165a242d89059228cf62cd4efb0a766a6e8599.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_e714d609a6c6598e2733ba858ec753286d81140a.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_4f405f15c06e646b61f12d14ec8a1a8eb4cfedbc.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_73ea8c281abf000c561f1845623e33a4d8a2aad6.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_2f2007393d7141f06df82b7c9d969b81cd80fe2e.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_8b193b837f4cbbb4ffce2a955cfbdbf699cf610d.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_5792cb0adf8e7da2f21a4978acd57adcaff641c8.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_a5f152b7cd1f590d51742e079bebb8fa2c27a28f.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_e39383d41d0a983580022a815f31d356a092d5f3.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_c79f1a8398ce332ca9e981cf11ba115cb38db176.1920x1080.jpg?t=1665416857,https://cdn.akamai.steamstatic.com/steam/apps/1477700/ss_58e42a51e59bdd7cacf9dce664cf8aa8560d5bd0.1920x1080.jpg?t=1665416857",
    "Slug": "project-wunderwaffe",
    "Meta Title": "Project Wunderwaffe: Oct 10, 2022, Gameparic and Full Ove...",
    "Meta Description": "Looking for information on Project Wunderwaffe? Check out the release date (Oct 10, 2022), developer insights from Gameparic, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Wunderwaffe game - Steam 1477700",
    "Canonical URL": "https://gusku.site/game/project-wunderwaffe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Wunderwaffe\", \"description\": \"Looking for information on Project Wunderwaffe? Check out the release date (Oct 10, 2022), developer insights from Gameparic, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gameparic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gameparic,Games Incubator,PlayWay S.A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1477700/header.jpg?t=1665416857\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}