{
    "AppID": 1902790,
    "Name": "刻印战记：冰冻之剑 RE",
    "Release date": "Sep 29, 2022",
    "About the game": "Game Introduction High school student Luo Wenhao is a gamer, likes to write fantasy novels and play games, he wrote a novel named - engraved war chronicle, with the continent of Eusia as the background, the story mainly starts with the great war between seven countries, one night after doing heavy homework, found himself crossing into the world of sword and magic, witnessed the world he wrote He meets Princess Elisa, whose kingdom has been destroyed, and with the knowledge of the game, he becomes the military advisor of Princess Tirast, and helps her to recover her kingdom while looking for a way to return to the real world. This is a turn-based SRPG game, use your own strategy to determine success or failure! Carefully designed and produced pixel-level battle animations and exciting battle performances, there are challenging turn-based battles during the game, and each level has different objectives, including defeat, puzzle solving, survival, escape and time limit, etc. Game Features In some levels there will be some mining resources, such as iron ore, gold ore, red copper ore, silver ore, red ore is available in the forge store in the curtain of the whole thing to build weapons, weapon building requires a certain amount of money and weapons with ore in order to build a new weapon, depending on the ore and weapons to build out the weapon properties also vary. The ore you dig up can be used to create various colors of equipment, and the weapons can be upgraded as the amount of ore varies. Some cavalry units are able to dismount and ride, and some terrain requires dismounting to get past, so you need to use this system wisely to advance through the levels. Some characters are Orc units themselves, they can transform into animals through beast stones and dragon stones There are bears, tigers, dragons and other units This game features a system, the player itself is a student, although you can fight, the elves give some war soul stone can let the player character transform into a special unit, the main man is a thief lord, the main woman is a wizard, as the game progresses will get various colors of unique war soul. In addition to the main story, the game will have a number of divergent routes in the levels, which directly determine the direction of the ending The game in addition to the main story and divergent routes, the extras are levels that are not directly related to the main story, you can get some props and weapons in the extras that are not available in the main story Some levels will have some mechanisms that players need to explore on their own, such as setting fires, opening mechanisms, setting traps, etc. This game is different from other similar games, as long as there is a transfer medal, meet the required level you can change occupation at will, high and low occupation can be repeatedly transferred There are some levels will be controlled by the weather and cause the player character to cause some gain and loss effects, storms cause a decrease in movement speed, sunny days movement speed bonus, sandstorm movement speed reduction, hit rate reduction, blizzard attack power reduction mobility reduction, etc. Specific three characters travel semi-encircled structure can make a sure kill triangle attack. Some levels have a fighting arena, where you can spend a certain amount of coins to enter and double your prize if you win, and your character will die if you fail. The key to the Magic Cave is obtained in some of the Gaiden, and you can enter with the key in the curtain preparation, there are different bosses inside, defeat the boss to get some exclusive items This is a system attached to the magic cave, players can grow crops in the scene, through a number of rounds of harvesting to obtain the fruit. The game through the rope obtained can capture the enemy, and from the enemy to pick up props and weapons, you can choose to release the enemy and other operations Robber profession can use its extremely high strength to grab weapons from the enemy; thief can directly steal props from the enemy, etc. In the level There is a difference in size between the characters, the larger teammates can save the smaller teammates from attack. About us BD GAMES - discover the beauty of games Sina Weibo: 游戏便当 WeChat public number: 游戏便当",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1902790/header.jpg?t=1664549378",
    "Price": 6.39,
    "Developers": "Lycian Studio",
    "Publishers": "BD Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_d2222b19dd1142f2e1032a63c38e3638cbfdd0ca.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_ec71f88382201917c399241f99f86dc632dc4f77.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_7e51d4ff375f9a04de48722e6611e64c35f38b26.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_2ef4c670fd25a10b3ca86c0aab6498ca2c56ea91.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_acb1d5b39f3cf97b839706d687c59bfcef05c33a.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_d647dfd2a9ac48e984936d7c0d80f5aec6bc98ab.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_a154a2d870b7f20fd94521768af46d2e7a4d3055.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_997f9df7366a7a69fe2025a6d59d9e6c090e5220.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_f208bb75ed625e1a6b3489839b77b2d05711cd7f.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_726014cf6886bbb1eff1115f313a7a7e1a450539.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_f2db19d6d51b1c4aedc433adf8072c97d006a667.1920x1080.jpg?t=1664549378,https://cdn.akamai.steamstatic.com/steam/apps/1902790/ss_0139b5f146b5479275e7e53a0e175233c4e1fb9f.1920x1080.jpg?t=1664549378",
    "Slug": "re",
    "Meta Title": "刻印战记：冰冻之剑 RE: Sep 29, 2022, Lycian Studio and Full Overview",
    "Meta Description": "Looking for information on 刻印战记：冰冻之剑 RE? Check out the release date (Sep 29, 2022), developer insights from Lycian Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for 刻印战记：冰冻之剑 RE game - Steam 1902790",
    "Canonical URL": "https://gusku.site/game/re",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u523b\\u5370\\u6218\\u8bb0\\uff1a\\u51b0\\u51bb\\u4e4b\\u5251 RE\", \"description\": \"Looking for information on \\u523b\\u5370\\u6218\\u8bb0\\uff1a\\u51b0\\u51bb\\u4e4b\\u5251 RE? Check out the release date (Sep 29, 2022), developer insights from Lycian Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lycian Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BD Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1902790/header.jpg?t=1664549378\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}