{
    "AppID": 2074800,
    "Name": "Richman 11",
    "Release date": "Oct 19, 2022",
    "About the game": "Richman 11 supports multi-controller, online and offline modes to choose. Players could create either free play or challenge play, all the parameters could be set based on players minds as well. In the game, players roll the dice and it determines the steps they could move on the map, earning money by investment on properties, buying stocks or using cards, when the game ends, the only player who are not broke or owns the most in finance wins the play. Free Play This is the classic mode in the series, all the players have the same initial cash, deposit and cards at the beginning, and all these could be set freely, players even can set, the price increase days, play time, player number, group play, etc as much as they wish. Challenge Play This is a new play mode. Players are facing the challenges from the landlords. There are 3 difficulties: easy, normal and hard to choose for each landlord. Players need to win them in different levels in the circumstance with short of talents, initial cash and properties to get their special achievements. Classic Maps The franchise was known to the public in 1989, classic maps take the torch from its predecessors, using tiles to link small and large properties, banks, lotto's, shops, news and magic house. Investing small properties is the main way to gain the profits. Other than this, players needs to keep and eye on other players and NPCs like gods’ movements. Using large properties, cards, banks and magic house to increase their income and face the emergent affairs or sabotage opponent’s plans. Brawl Maps It starts in Richman 10, in this mode, small property tiles is replaced by mines, missiles and bombs, using attack cards could bring damage to opponents’ finance and that is the core to win the play. In this franchise, brawl maps have different routes from classic maps. Maps on brawl mode are more complicated, why not using missiles to attack the opponents on the road, or place the mines at the corners. Property Investing Buy empty land, build houses or chain stores on it, receive rentals from players who pass by. Buy properties as many as possible, and level up the buildings hard for large amount of rentals. When in group play, the properties could be leveled up by teammates. Stock Buying In the play, players could adjust the proportion of cash and deposit when passing by banks. Cash is the key to invest properties and card purchase, deposit could bring a considerable interest from banks monthly. In offline mode, deposit could be used to buy stocks, be smart and earn some extra financial income. Card Cards are the original content in this series, and it is the most strategic system in game, also the unique feature different from other monopoly genre games. Players could buy limited cards in shops by cash. There are different kinds of cards, some of them could level up the buildings, some could control others movements and summon gods. In this franchise, we add some new features, hope players would enjoy them. Tip 1: Don’t miss the guy who wears white suit and a masque. Tip 2: A penny saved is a penny eared. Mechanics After this series develops 30 years or so, we add a brand new feature - mechanics. It is a special tile in the maps, having different effects in different maps, when it’s on, it could probably change the direction of the road, may turn on or off the banks and shops and even mess up the location of mines and bombs. Characters Each character has their unique transit vehicles. They are even variable with many kinds decorations. Xiaomei, October, Miss Money, etc. Many well known Richman characters are confirmed to join this play.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2074800/header.jpg?t=1666326432",
    "Price": 17.09,
    "Developers": "CMGE",
    "Publishers": "SOFTSTAR ENTERTAINMENT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_03689a85493c5b6549ba0c003e0d92b1c620998c.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_77dfc1e0b89a50c54e61e943dff38cb637066218.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_6eabf7fda13d81be0b23dbd3514bd6658917b1aa.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_251ee651c4ad66dd77c840c0152c673d1846d893.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_c782535ff70181806fb2f10b95c620ea23cf7fba.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_3aba34190da0b509bfbe49d4cc0efb732aa17711.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_459e6ee323ac937ff6c6eeeeaf9f370395439edd.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_735108238eb2822ed7d155fc5682c9fa4dee409c.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_27790199036f9fae7e0dc6f61c1cf002b119d29e.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_8f25536d34c592362b9be492303642f642354d9b.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_74e2e05b2fa38762fa3095646e37bf0c5e6ab7f3.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_f5ad6e6017cc7ea627c6dd179269249107a69577.1920x1080.jpg?t=1666326432,https://cdn.akamai.steamstatic.com/steam/apps/2074800/ss_9efeb30e1c814f31a881d694883b1c499ea95fef.1920x1080.jpg?t=1666326432",
    "Slug": "richman-11",
    "Meta Title": "Richman 11: Oct 19, 2022, CMGE and Full Overview",
    "Meta Description": "Looking for information on Richman 11? Check out the release date (Oct 19, 2022), developer insights from CMGE, and a complete game summary.",
    "Alt Text Image": "Official header image for Richman 11 game - Steam 2074800",
    "Canonical URL": "https://gusku.site/game/richman-11",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Richman 11\", \"description\": \"Looking for information on Richman 11? Check out the release date (Oct 19, 2022), developer insights from CMGE, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CMGE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SOFTSTAR ENTERTAINMENT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2074800/header.jpg?t=1666326432\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}