{
    "AppID": 1972630,
    "Name": "Slimesventure: Your Destination",
    "Release date": "Sep 29, 2022",
    "About the game": "An incident or mishap is rare, but not impossible. But who hasn't lost their identity card and had to build a completely new life, even though they actually had a good life in front of them? Now you have to work hard to earn a measly wage again and somehow have something to eat and a place to sleep. Time is running, even if you don't want it to. For this reason, you should choose your path in life wisely. You are wanted and need to hide. Your last visit in the Kinghall of Avron made you a criminal. You make your own luck, but you have only 100 Days! Help strangers by solving their given quests and get acquainted with them. Explore an open world and find their treasures. Explore caves and collect their resources. Get enough sleep and manage your life by starting your own Kingdom. You are wanted, but when you are faster than your chasers in stocking up your resources and military power, you can stand against them and Win. My royal brother once said: 'A king is not just a brilliant presenter. He is the result of his actions, decisions and lifestyle.' It was a normal day in the continent of Arvon when suddenly a letter flew into my home. The letter was already scorched and half of it was no longer readable. But there was no mistaking the name of the sender. It came directly from my mother. M: “Dear son, I hope you are doing well.” S: 'I am really fine! But I’d like to see you again…' M: “I have moved to another realm a short while ago.” S: 'From another realm? She just moved to this realm, why?' M: “Perhaps you’re wondering how that came to be? Son, listen to me carefully now. My personal assistant has made an incredible discovery. The […] is you!” S: 'What about me? Why is this letter so burnt! I can’t read anything at all from Mother, who I haven’t seen in weeks.' M: “You have to see your brother and […] confront him.” S: 'I just don’t get it, what is mother trying to tell me!' I ran to my brother in the castle and confronted him. The guards didn’t want to let me in at first, but I managed to sneak into the Hall of Consolation anyway. S: “Brother! I have received a letter from mother! I have something important to discuss with you!” B: “If there isn’t my brother. How did you get in here! Say Squire!” S: “i got past the guards…” – B: “i don’t care!” […] B: 'You broke into this room and you have to take the consequences for this!' I escaped from the guards and immediately boarded a train for protection in a neutral city. I took the fastest route across the lake. The times are not particularly good and I probably have to expect very high prices. Once I arrived, I took my first steps in the new city where I will be living from now on. But where Is my identity card now?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1972630/header.jpg?t=1664459289",
    "Price": 7.99,
    "Developers": "Leon Schröder",
    "Publishers": "Leon Schröder",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_67d5647e549ac2b7cd20a70da35a1deebcd784f2.1920x1080.jpg?t=1664459289,https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_de35842034f967652b6f638cfbf711eea55cabb0.1920x1080.jpg?t=1664459289,https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_3dcfcc910d36780c09bcd14ef45d8a69808b9e61.1920x1080.jpg?t=1664459289,https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_260482a35c6b39a5e5ae9eab43ff356948aee36e.1920x1080.jpg?t=1664459289,https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_f0db336dcddd434f7d79f52f02c2fbb32b692e49.1920x1080.jpg?t=1664459289,https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_95d129598c125a5fb64581d15cb0c7ba2727ab4e.1920x1080.jpg?t=1664459289,https://cdn.akamai.steamstatic.com/steam/apps/1972630/ss_c18507d57a00b371041e28660310d9270346602c.1920x1080.jpg?t=1664459289",
    "Slug": "slimesventure-your-destination",
    "Meta Title": "Slimesventure: Your Destination: Sep 29, 2022, Leon Schrö...",
    "Meta Description": "Looking for information on Slimesventure: Your Destination? Check out the release date (Sep 29, 2022), developer insights from Leon Schröder, and a comp...",
    "Alt Text Image": "Official header image for Slimesventure: Your Destination game - Steam 1972630",
    "Canonical URL": "https://gusku.site/game/slimesventure-your-destination",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Slimesventure: Your Destination\", \"description\": \"Looking for information on Slimesventure: Your Destination? Check out the release date (Sep 29, 2022), developer insights from Leon Schr\\u00f6der, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Leon Schr\\u00f6der\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Leon Schr\\u00f6der\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1972630/header.jpg?t=1664459289\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}