{
    "AppID": 2010920,
    "Name": "Symphony Of Motion",
    "Release date": "Oct 17, 2022",
    "About the game": "WHAT´S THIS ALL ABOUT? Symphony Of Motion offers a new unique way to create and experience music without the need for any prior musical knowledge. Whether you're a seasoned musician or a complete beginner, this is a new and intuitive way to create and experience music. In its simplest form, you just move your hands around to create unique sounds, melodies, and rhythms. There are no “wrong” notes to worry about (as you always play in a specific scale) and you can always stay on perfect tempo with the build-in perfect timing assistant. For the more experienced musicians, it also offers new levels of expressional depth with its unique motion-based synthesizer modulation, multi-pitching drums/melodic pads, a lot of customization options, a built-in looper, and a drum kit creator. LIVE MOTION-BASED SYNTH MODULATION Symphony Of Motion offers a new level of depth to musical expression, as the sounds follow the movements of your hands like an orchestra follows the movement of it's conductor. You can dual play and live modulate any of the 100+ synthesizers with acceleration, angular acceleration, position and rotation - plus there are multiple different motions to modulation options to choose from that all sound different. LIVE DRUM PITCH SHIFTING You can play any drum sample at a varying pitch by tilting your wrist to different angles while playing. This gives you the ability to play unique and fresh-sounding beats with an added layer of depth in your expression. MELODIC PADS Melodic pads are percussion pads that play musical notes rather than drum hits. For example, you could create a multi-octave xylophone, orchestral drum, or cowbell set in any note or scale you want. Melodic pads also have varying pitches, so one pad can play many different notes by changing the angle of your wrist or by transposing it by pressing down on the trigger button. This allows you to play a multi-octave melody - just by hitting a single melodic pad! DRUMKIT BUILDER You can duplicate, reposition, scale, change pitch/volume/color/shape/settings, and the sample of any drum and melodic pad to make your own dream kits. LOOPER You can record, cancel and undo previous recordings with the build-in one-button looper. There's also a view where you can adjust the volume, stop or delete any previously made recordings. You can also visualize any synthesizer recording so that you can see what was being played while the loop was being recorded. PITCH BENDING While playing the synthesizer you can pitch bend from any note to any other note or play totally fretless. CURRENT FEATURES Build in tutorials that guide you on your journey Drum and melodic percussion kit builder Large selection of motion reactive synthesizers and different modulation options to choose from Live pitch shifting drums Multi pitched melodic percussion pads Easy to use one button looper Recorded loops overview and volume control Perfect tempo automation (Quantization) Many customization options Mesmerizing audio-reactive environment",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2010920/header.jpg?t=1666018526",
    "Price": 13.49,
    "Developers": "Instrumental Leap",
    "Publishers": "Instrumental Leap",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2010920/ss_2000adbd20e55dc857c0fa670ddd3154da05b7e9.1920x1080.jpg?t=1666018526,https://cdn.akamai.steamstatic.com/steam/apps/2010920/ss_3b5bb20f57ed46c69ecbcc0f08018b56ecf38850.1920x1080.jpg?t=1666018526,https://cdn.akamai.steamstatic.com/steam/apps/2010920/ss_9a7d6b5262c380a336f506e0333f32240ac1e440.1920x1080.jpg?t=1666018526,https://cdn.akamai.steamstatic.com/steam/apps/2010920/ss_4bdf9c3c97159018d8d2b61052ff6b7d380dca97.1920x1080.jpg?t=1666018526,https://cdn.akamai.steamstatic.com/steam/apps/2010920/ss_76ee48e95dcd9d0e1b7293b2e67c08033f6b1c3c.1920x1080.jpg?t=1666018526",
    "Slug": "symphony-of-motion",
    "Meta Title": "Symphony Of Motion: Oct 17, 2022, Instrumental Leap and F...",
    "Meta Description": "Looking for information on Symphony Of Motion? Check out the release date (Oct 17, 2022), developer insights from Instrumental Leap, and a complete game...",
    "Alt Text Image": "Official header image for Symphony Of Motion game - Steam 2010920",
    "Canonical URL": "https://gusku.site/game/symphony-of-motion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Symphony Of Motion\", \"description\": \"Looking for information on Symphony Of Motion? Check out the release date (Oct 17, 2022), developer insights from Instrumental Leap, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Instrumental Leap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Instrumental Leap\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2010920/header.jpg?t=1666018526\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}