{
    "AppID": 1663640,
    "Name": "The Last Oricru",
    "Release date": "Oct 13, 2022",
    "About the game": "The Last Oricru is a story-driven action RPG, that puts you in the middle of an ongoing conflict between two races, on a partly terraformed planet, isolated from outer space by a protective barrier. Your decisions will bring interesting twists into the gameplay, as you can heavily influence the conflict and its outcome. You will experience hundreds of intense fights in a brutal medieval meets sci-fi world, where every decision has its consequences. Level up your hero, improve your skills before facing one of many boss fights and get ready for an unprecedented amount of possibilities. Key features Thrilling split screen couch coop for shared experience Rewarding story system bearing vast impactful decisions Intriguing deep storyline revealing an unknown planet Unique game world combining fantasy and sci-fi background Coherent RPG elements for immersive game-play Challenging action packed combat system Different tactical possibilities for co-op and the single player Advanced skill set supporting player cooperation Intriguing Story Dig into the forgotten past of the world. Uncover the conspiracy behind the events that take place as you play. Let sides of the conflict make you understand their motives for fighting or disregard everything and everyone and just make the world burn. The story of the Last Oricru is complex and it may take multiple different play-throughs to make all pieces of the puzzle finally click together. Impactful Decisions Massive decision tree in which your decisions lead to different outcomes, affecting story, characters, game endings but also visuals of levels or even the gameplay flow. Every action, sub-quest or life taken can affect your reputation with each faction. There are multiple ways to play through The Last Oricru and no right or wrong decision. Your decisions will shape the fate of the world, literally. Challenging Combat The combat is easy to learn but hard to master and aims to create a tough but rewarding experience. Melee and ranged weapons with unique attack animations and secondary abilities, shields, techno-magical items, weight management and upgrade system offer a wide range of customization for your play-style. You will encounter various mass fights, in which you can prove your loyalty by aiding your comrades in arms but also fight your way through unsuspecting and surprised enemies, as you travel through a number of distinct areas of the war-torn world. Be prepared to die... A lot! Couch Coop Invite your friends over or tell your significant other to join you in your adventures! The Last Oricru is designed to make co-op a unique experience, so for example you can find new fun ways to defeat bosses or reach special secret areas. The Classic RPG character stat system also enables each of you to specialize your character differently, so you can reap the benefits of role diversity: become beefy melee tank and protect your archer friend or become a duo of mages and use one of co-op only spells to wreak havoc among enemies. You may also want to be a pair of swordsmen, hacking your way through enemies should-by-shoulder. It's entirely up to you and your partner-in-game. Previews Niche Gamer “The concept of combining Darksouls and Mass Effect feels like a great choice.” Desconsolados “…it (the demo) has left me wanting more.” “GoldKnights is creating something ambitious, interesting and with personality.” RpgSpainCom “...a Souls-style game but more accessible to all types of players” Mein-MMO-de “Being a mixture of sci-fi and the Middle Ages, The Last Oricru creates a very unique atmosphere that is at most comparable to the Elex series by the German studio Piranha Bytes. The game mechanics can make The Last Oricru a feast for co-op fans” Zing.cz “The premise of the story and, among other things, the peculiarly sarcastic humor intrigued me so much that I really started to look forward to the final game.”",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1663640/header.jpg?t=1665947293",
    "Price": 35.99,
    "Developers": "GoldKnights",
    "Publishers": "Prime Matter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_5e1084a85919a47a2299ab53b858f2534dfd80f2.1920x1080.jpg?t=1665947293,https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_cfd66055231e0ee4766105e2eafb6db4122c54d4.1920x1080.jpg?t=1665947293,https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_442bca24cda131e0c153f4784580646999a6f18d.1920x1080.jpg?t=1665947293,https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_dade8564e889774338603663f584484d67b5b617.1920x1080.jpg?t=1665947293,https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_5fb17d6f4ea03c99fd8a885d12ceecfdf75b5f28.1920x1080.jpg?t=1665947293,https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_38926e5090663d040b268c605afd4dc2f22b3e69.1920x1080.jpg?t=1665947293,https://cdn.akamai.steamstatic.com/steam/apps/1663640/ss_62d1ac52e674f1b5a707ef03d2c938d1479827da.1920x1080.jpg?t=1665947293",
    "Slug": "the-last-oricru",
    "Meta Title": "The Last Oricru: Oct 13, 2022, GoldKnights and Full Overview",
    "Meta Description": "Looking for information on The Last Oricru? Check out the release date (Oct 13, 2022), developer insights from GoldKnights, and a complete game summary.",
    "Alt Text Image": "Official header image for The Last Oricru game - Steam 1663640",
    "Canonical URL": "https://gusku.site/game/the-last-oricru",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Oricru\", \"description\": \"Looking for information on The Last Oricru? Check out the release date (Oct 13, 2022), developer insights from GoldKnights, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"GoldKnights\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Prime Matter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1663640/header.jpg?t=1665947293\", \"offers\": {\"@type\": \"Offer\", \"price\": 35.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}