{
    "AppID": 1096140,
    "Name": "Timemelters",
    "Release date": "Oct 12, 2022",
    "About the game": "' This wonderful weird thing has classic written all over it. ' - Eurogamer - ' It feels like you’re getting to play tactical general and frontline soldier all at once. ' - Edge Magazine - ' A unique interesting take! I can't really compare it to anything I've seen before! ' - SplatterCatGaming - --------------------------------- Missing a good old linear experience - that isn't repetitive - with a great storyline and innovative game mechanics? TimeMelters: Tome I - Witches and Pyres might be the game for you! You can start playing the Story Mode at 5pm (solo or with a friend) with some pizza and finish it around 3am, the perfect game night! And then there's another 10 hours of gameplay time with the Challenge Mode! Created by the co-designer of Sang-Froid: Tales of Werewolves , TimeMelters brings you to a mythical land of dreams and nightmares, where witch trials seem the only answer to the preternatural forces threatening the land. TimeMelters is a strategy-adventure game that features a unique game mechanic: Time Travel, which allows the players to go back in time and fight alongside themselves. You play as Teagan, a witch whose powers were just recently unleashed by an unwelcome guest. Now, you must venture forth in a desperate effort to cleanse the countryside from the seeping evil that is corrupting it. Something is rotten in the Kingdom of Hogendale. Creation is stricken. Trees and beasts sicken, wither and are reborn as shrieking, malevolent shades. The dead claw their way out of the poisoned earth to swarm mindlessly over the land. No living man or woman is safe from their dripping talons. Whole towns are brought to ruin. King Ionracas’ dream of a lasting Pax Hogendala vanishes in an unnatural whirl of blood and misery. It must be the Witches! Who else could be responsible for this chaos? The King decrees their death by fire. And thus — many an innocent woman is condemned to the sacred pyre. Now, the flames await you. --------------------------------- Features: Unique Time Shift game mechanic: rewind time and fight alongside yourself, not as an AI, but in a fully deterministic fashion. Plan out truly custom strategies and play to your own style! Hybrid Action-Strategy gameplay: Plan a strategy and execute it all in real time, across more than 20 distinct missions! Puzzle maps, boss fights, escort missions, survival, etc. -- each mission has distinct objectives and brings unique twists on the time travel mechanic! Co-op mode: Play the full campaign with a friend online! Startling storyline: Engaging campaign with all the twists, turns, nooks, crannies and what-the-bleep-just-happened moments you would -- and should -- expect from a story based on Time Travel! Challenge Mode : Test your brain power with 40 mind bending, 4D thinking challenges! Skill Tree: Choose how your spells upgrade -- yielding ever more powerful magic and intricate build choices! Original Soundtrack: Sumptuous, expansive soundtrack filled with epic moments (and a few earworms)! Why make this game? First and foremost, we try to make games that we ourselves want to play. As we get older. we don't always have a lot of free time in the day, and might only have 30 minutes here and there to game. So we wanted to create something that gets you into the action quick. No constant updates, long load times, or insane menu management. This game is for someone that wants strategy and intense action right away, coupled with a perk system to mix it up and a great storyline. What to expect: We are a small team of 3 people and it's taken us 5 years to make this game. While we are experienced and passionate developers in our own right, please don't expect AAA graphics. What you can expect though is some never before seen game mechanics and innovative systems. Because what TimeMelters may lack in cutting edge graphics, it makes up for with its unique design and captivating storytelling! Anyway, we hope you'll love TimeMelters as much as we do! Happy gaming!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1096140/header.jpg?t=1665590359",
    "Price": 17.99,
    "Developers": "Autoexec Games",
    "Publishers": "Autoexec Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_05cc94cecd8708d9b0c2966ad88d48db95b6cac2.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_74fcee4c1d36141f8803b47370249344f33fe57d.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_e1580304988d0335c53c9450d47fd35cd9085703.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_a6e07e3dd2fc03ac33893363be3d1dfa6dcdf4b0.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_3ad2489e8c49b719e206699d165da0e9ca2466f7.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_37642e0c409adb9926364c3e2ff588b8303b1ed9.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_c3c43666b7e49a6b24c0d4eb7007c1127d21c8c2.1920x1080.jpg?t=1665590359,https://cdn.akamai.steamstatic.com/steam/apps/1096140/ss_f92bc1df35dd68b3e513dbc72bfbe1bc33f86dca.1920x1080.jpg?t=1665590359",
    "Slug": "timemelters",
    "Meta Title": "Timemelters: Oct 12, 2022, Autoexec Games and Full Overview",
    "Meta Description": "Looking for information on Timemelters? Check out the release date (Oct 12, 2022), developer insights from Autoexec Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Timemelters game - Steam 1096140",
    "Canonical URL": "https://gusku.site/game/timemelters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Timemelters\", \"description\": \"Looking for information on Timemelters? Check out the release date (Oct 12, 2022), developer insights from Autoexec Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Autoexec Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Autoexec Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1096140/header.jpg?t=1665590359\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}