{
    "AppID": 1659420,
    "Name": "UNCHARTED™: Legacy of Thieves Collection",
    "Release date": "Oct 19, 2022",
    "About the game": "Are You Ready To Seek Your Fortune? Seek your fortune and leave your mark on the map in the UNCHARTED: Legacy of Thieves Collection. Uncover the thrilling cinematic storytelling and the largest blockbuster action set pieces in the UNCHARTED franchise, packed with all the wit, cunning, and over the top moments of the beloved thieves – Nathan Drake and Chloe Frazer. In an experience delivered by award winning developer Naughty Dog, the UNCHARTED: Legacy of Thieves Collection includes the two critically-acclaimed, globe-trotting single player adventures from UNCHARTED™ 4: A Thief’s End and UNCHARTED™: The Lost Legacy. Each story is filled with laughs, drama, high octane combat, and a sense of wonder – remastered to be even more immersive. Discover the breath-taking sights From thick jungles to snow-capped mountains, exotic islands to rain-soaked streets, explore every inch of stunningly beautiful environments in spectacular detail. Immerse yourself in the cinematic storytelling with super-sharp 4K resolution*, and Ultra-Wide Monitor support**. Enjoy a host of enhanced graphical adjustment features such as adjustable Texture and Model Quality, Anisotropic Filtering, Shadows, Reflections and Ambient Occlusion. Feel the thrilling gameplay in your hands Experience haptic feedback and dynamic trigger effects designed for UNCHARTED: Legacy of Thieves Collection by playing with the DualSense™ controller through a wired connection to your PC. With full control remapping and support for the DualShock®4 controller ***, XInput Game Controllers, and a wide range of other gamepads and keyboard and mouse, you can leave your mark on the map any way you like. For those that want to brighten things up even more, try out RGB support for Razer Chroma peripherals and Chroma Link compatible devices, as well as for Logitech models. Optimize the adventure Unearth a wide variety of modes and PC-centric enhancements such as improved UI for game options, reimagined user interfaces, the addition of scale sliders for some menus, GPU and VRAM detection and management options, as well as adding Auto Pause, Minimize in Background and Variable Load Speed support along with a host of other additions. AMD Fidelity FX Super Resolution 2 Supercharge your framerates as you seek your fortune as Nathan and Chloe with next-level temporal upscaling technology from AMD. FSR 2 uses cutting-edge algorithms to boost your framerates and deliver high-quality, high-resolution game experiences in UNCHARTED across a wide range of compatible graphics cards. UNCHARTED 4: A Thief’s End Winner of over 150 Game of the Year awards. Several years after his last adventure, retired fortune hunter Nathan Drake, is forced back into the world of thieves. Fate comes calling when Sam, Drake’s presumed dead brother, resurfaces seeking his help to save his own life and offering an adventure Drake can’t resist. Drake’s greatest adventure will test his physical limits, his resolve, and ultimately what he’s willing to sacrifice to save the ones he loves. On the hunt for Captain Henry Avery’s long-lost treasure, Sam and Drake set off to find Libertalia, the pirate utopia deep in the forests of Madagascar – leading to a journey around the globe through jungle isles, far-flung cities, and snow capped peaks on the search for Avery’s fortune. ● A globe-trotting adventure with the largest and most detailed environments in the UNCHARTED franchise ● A more personal story for Nathan Drake, raising the stakes for the award-winning storytelling of Naughty Dog. ● Fluid combat and traversal with the use of the grapple hook creates even more dynamic and thrilling action set pieces. UNCHARTED: The Lost Legacy In order to recover an ancient artifact and keep it out of the hands of a ruthless warmonger, Chloe Frazer must enlist the aid of renowned mercenary Nadine Ross and venture to India’s Western Ghats to locate the Golden Tusk of Ganesh. In Chloe’s greatest journey yet, she must confront her past and decide what she’s willing to sacrifice to forge her own legacy. ● An all-new setting for adventure in the south western coast of the Indian peninsula, featuring an exotic mix of urban, jungle, and ancient ruins environments. ● The action-packed set pieces and captivating narrative that fans have come to expect from Naughty Dog and the UNCHARTED series. ● Builds on the acclaimed UNCHARTED franchise gameplay with updated systems and refinements, including cinematic combat, exploration, and traversal of jaw-dropping environments, complex puzzles and more. * Compatible PC and 4K display device required. ** Compatible PC and display device required. *** Use DUALSHOCK 4 USB wireless adaptor or a compatible micro-USB cable to connect to PC. ©2022 Sony Interactive Entertainment LLC. Created and developed by Naughty Dog LLC. UNCHARTED is a registered trademark of Sony Interactive Entertainment LLC and related companies in the U.S. and other countries.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1659420/header.jpg?t=1666386909",
    "Price": 49.99,
    "Developers": "Naughty Dog LLC,Iron Galaxy Studios",
    "Publishers": "PlayStation PC LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_417913fbee123c5e35718ebef63bc8a6ce435adf.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_a1816dd536122dd740043c2b9440136503904215.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_e570e5f369ff6cd0471f80d99f5a86c3b03a2285.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_b171bf276c5f6edb99ca96be0912b64b9136c2ad.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_af9770abac008e4b94565082f4312c51488d3c90.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_5cb662759eabcff8c1a69e0339282cadc62cbc23.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_2388ce4647c02da56a301f4a36f32d4e7f40e50c.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_96f1667fe0492ec641a726f6ebc25cc401062759.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_a2f6322488a915ad00af9a724936d7ca3868f1fd.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_fc6b83b8404e5413c81befac910895fa95b79c0d.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_a623a4cfbbfbe3448799ac17675f5bdb09654a1d.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_600b77114f9037fb4a50da3960fd456d3597b015.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_2e80708833b1f5011cfbb1352d40fca3e1fa9dd7.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_452f412782a0f53a0986d751d4a365a469d2e07c.1920x1080.jpg?t=1666386909,https://cdn.akamai.steamstatic.com/steam/apps/1659420/ss_a8192bd34ea0528473f4d3825d4900a1334af86a.1920x1080.jpg?t=1666386909",
    "Slug": "uncharted-legacy-of-thieves-collection",
    "Meta Title": "UNCHARTED™: Legacy of Thieves Collection: Oct 19, 2022, N...",
    "Meta Description": "Looking for information on UNCHARTED™: Legacy of Thieves Collection? Check out the release date (Oct 19, 2022), developer insights from Naughty Dog LLC,...",
    "Alt Text Image": "Official header image for UNCHARTED™: Legacy of Thieves Collection game - Steam 1659420",
    "Canonical URL": "https://gusku.site/game/uncharted-legacy-of-thieves-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"UNCHARTED\\u2122: Legacy of Thieves Collection\", \"description\": \"Looking for information on UNCHARTED\\u2122: Legacy of Thieves Collection? Check out the release date (Oct 19, 2022), developer insights from Naughty Dog LLC,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Naughty Dog LLC,Iron Galaxy Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PlayStation PC LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1659420/header.jpg?t=1666386909\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}