{
    "AppID": 2152000,
    "Name": "Unscramble Heroes",
    "Release date": "Oct 2, 2022",
    "About the game": "Calling all keyboard warriors that know (some) English! The generic fantasy setting is being overrun by monsters with scrambled words for names. Unscramble the words using your sword (keyboard) and shield (brain) to defeat wave after wave of minion and master. Earn experience based on the level (word length) of each foe and LEVEL UP! to improve your abilities. Collect hearts and items to extend your battle and ACHIEVE (ments) greatness. Etch your name in the HALL OF HEROES (Steam Leaderboards) and compete against your fellow keyboard warriors to claim the title of UNSCRAMBLE HERO!!! Unscramble Words This game contains thousands of common American English words. As enemies appear on screen, a mix of letters will appear below them. Unscramble the letters and type the correct word to defeat the enemy and move on. You even get a little bit of help -- the first and last letters are already in the correct position! Gain Experience Each word you unscramble grants you experience. The longer the word, the more experience! You can adjust the word length in the options, or go for particularly challenging words during the boss encounters. Level Up Think of it like a word based RPG where you gain experience and level up. Yup, you read that correctly. A word based RPG. Upgrade Skills Once you've acquired enough experience to level, you can spend points to enhance your abilities. Gain more health so that you can spend more time unscrambling words. Slow down the monster spawn rate so that you won't be overwhelmed. Start with more items. There are many paths to go down, but only so many points to spend. Don't worry, you can change your mind at any time! Unlock Achievements Can you hit max level? Can you attain a frankly unhealthy amount of points? Did you forget to use your items again? All of these are achievable metrics that you can show off to your friends. Post to Leaderboards This game supports Steam Leaderboards and there are a number of leaderboards to compete on.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2152000/header.jpg?t=1664719682",
    "Price": 0.0,
    "Developers": "Christopher Freeman",
    "Publishers": "Christopher Freeman",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2152000/ss_6dda6114dd7b98f257b49abaa25e44bed82c3ff5.1920x1080.jpg?t=1664719682,https://cdn.akamai.steamstatic.com/steam/apps/2152000/ss_acaeafacb1a55e70aa765083add876956ba4da09.1920x1080.jpg?t=1664719682,https://cdn.akamai.steamstatic.com/steam/apps/2152000/ss_83ce6b7914885d56b31ad4cad3905e1c095cc8cd.1920x1080.jpg?t=1664719682,https://cdn.akamai.steamstatic.com/steam/apps/2152000/ss_458e796141cf9a63572a65231805a769f569c830.1920x1080.jpg?t=1664719682,https://cdn.akamai.steamstatic.com/steam/apps/2152000/ss_31a2e6d3e178f8812f0aff7ea4b5aa73aee67f98.1920x1080.jpg?t=1664719682",
    "Slug": "unscramble-heroes",
    "Meta Title": "Unscramble Heroes: Oct 2, 2022, Christopher Freeman and F...",
    "Meta Description": "Looking for information on Unscramble Heroes? Check out the release date (Oct 2, 2022), developer insights from Christopher Freeman, and a complete game...",
    "Alt Text Image": "Official header image for Unscramble Heroes game - Steam 2152000",
    "Canonical URL": "https://gusku.site/game/unscramble-heroes",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unscramble Heroes\", \"description\": \"Looking for information on Unscramble Heroes? Check out the release date (Oct 2, 2022), developer insights from Christopher Freeman, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Christopher Freeman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Christopher Freeman\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2152000/header.jpg?t=1664719682\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}