{
    "AppID": 2170500,
    "Name": "Voxella",
    "Release date": "Oct 18, 2022",
    "About the game": "Welcome to the world of Voxella! Here we see a young Muigi plopped into the world, with nothing to do but discover. Complete quests for other people, find treasures, explore dark caves and mysterious factories, unlock the secrets of the world and have a friendly conversation with a giant spider! Voxella is an open world exploration-based RPG, filled to the brim with personality and chock full of items, people, and monsters to be found! Of course, to get those items, you'll find yourself doing lots of quests for these people... and some quests for the monsters too! And in doing those quests, you may find out the real reason why you've been placed in this strange fantasy world... Open World Environment The world of Voxella is expansive and randomly generated, though there are some notable landmarks. You can visit the big city, camp out by the beach, explore the deadly but absurdly small factory, or do all of the above and more! Each individual room has unique elements that come together to form an interesting world. Unique Characters There's over 40 unique characters to meet in Voxella, and plenty of interesting quests, too! You can bring logs to an incompetent lumberjack, give a snowman some fashion advice, or simply have a nice chat with a giant death worm. And when you're done with that, why not go over the the crafts festival to shop a little? Tons of Items Voxella has lots of exploration and lots of quests, so it's only natural that there's lots of items, too! Some of these items can get you out of trouble, like the paper crane, while others can be used to mow down enemies, like the deadly instar. Armor and accessories provide special boosts, while other items, like lava lamps and kites, may just be purely fun to play with. With over 200 items, there's sure to be something for every playstyle! Fun and Difficult Combat The world of Voxella is treacherous, and filled with evil monsters. You'll find yourself dodging attacks while bringing down plenty of your own, with a wide arsenal of magic, ranged, and melee attacks! And if violence isn't your thing, you can always bribe you way out of an encounter... or just ask politely!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2170500/header.jpg?t=1666248122",
    "Price": 5.99,
    "Developers": "Theepicosity",
    "Publishers": "The Okey Collective",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2170500/ss_6ccd641f94932ba3b6cb80a69eeb8afba09187ae.1920x1080.jpg?t=1666248122,https://cdn.akamai.steamstatic.com/steam/apps/2170500/ss_77845e67701ec0d9a2a8c929f182b9f85683193e.1920x1080.jpg?t=1666248122,https://cdn.akamai.steamstatic.com/steam/apps/2170500/ss_bb9728cdc590503ea5cd50e3f0ca078b59946f71.1920x1080.jpg?t=1666248122,https://cdn.akamai.steamstatic.com/steam/apps/2170500/ss_9f5ea16231ec089ac50be95cc550faeb18014d07.1920x1080.jpg?t=1666248122,https://cdn.akamai.steamstatic.com/steam/apps/2170500/ss_769d380a61c2e1cea6a946a1f3df12d033dc2240.1920x1080.jpg?t=1666248122",
    "Slug": "voxella",
    "Meta Title": "Voxella: Oct 18, 2022, Theepicosity and Full Overview",
    "Meta Description": "Looking for information on Voxella? Check out the release date (Oct 18, 2022), developer insights from Theepicosity, and a complete game summary.",
    "Alt Text Image": "Official header image for Voxella game - Steam 2170500",
    "Canonical URL": "https://gusku.site/game/voxella",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voxella\", \"description\": \"Looking for information on Voxella? Check out the release date (Oct 18, 2022), developer insights from Theepicosity, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Theepicosity\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Okey Collective\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2170500/header.jpg?t=1666248122\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}