{
    "AppID": 2154090,
    "Name": "Vs Chat Pack",
    "Release date": "Oct 13, 2022",
    "About the game": "Vs Chat Pack is a Twitch streamer game pack that you play with your viewers. Four games in four different genres, all focused on Twitch chat interactions. Viewers play by typing various commands in your Twitch chat, and each game allows your viewers to individually impact the game experience! No setup needed, just type your channel name in-game and you're good to go! The four games in Vs Chat Pack are: Predicting Vs Chat A strategy prediction game - Sphere Fighters will duke it out in an arena, but who will perform the best? Before each round, Sphere Fighters with random stats and abilities will be presented. You and each viewer will individually pick a Sphere. You get points from each elimination your chosen Sphere Fighter does, and if it's the last Sphere standing. After a certain amount of rounds, whoever has accumulated the most points wins the game! You and up to 5000 viewers can play Predicting vs Chat. Running Vs Chat An endless runner where your viewers make all the obstacles - how far can you make it, and who will be the one that stops you? Viewers can also cooperate at certain times to create special surprises for you. These can make the run harder, so keep an eye out for whatever your viewers throw your way! Typing Vs Chat Type to survive! In a zombie apocalypse, you're being swarmed from all sides by zombies that your viewers will spawn in. You must shoot the zombies by typing their names - each zombie is named after the viewer that spawned them in. Remember to type 'reload' to reload your gun when you run out of bullets. Viewers are able to spawn in different kinds of zombies too, so be careful! Drafting With Chat Cooperate with your viewers in this deckbuilding card game. 10 increasingly difficult opponents stand in your way, and before each encounter, your viewers will create new cards for you. Remove old cards in your deck, draft and insert new ones, and see if your deck is up to the challenge! Each card is also named after the viewer that created it. Will your viewers have your back and supply you with helpful cards, or will they sabotage you as much as they can? Whether you're in the mood for an intense gaming session, a relaxing and chill experience, a community-focused stream or you just need a quick in-between game, this pack has got you covered. I hope you have a great time with Vs Chat Pack! NOTE: Vs Chat Pack is designed for Twitch streamers - if you do not stream on Twitch, you will not be able to play the games in the pack. Instead, find a Twitch streamer who is and join their audience! NOTE: This game pack is in English only.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2154090/header.jpg?t=1665648063",
    "Price": 13.49,
    "Developers": "KevDK Games",
    "Publishers": "KevDK Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_94955f5f9f0b6cba4ea72f12e155cbce33ece45e.1920x1080.jpg?t=1665648063,https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_ef9c88a21520fc7f1ccaa0da612b192e61b2b039.1920x1080.jpg?t=1665648063,https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_5a5f14cbe79e5395c425757d020dcf82035fe89a.1920x1080.jpg?t=1665648063,https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_a81ddd59d88d038aff623338044306b4163e7188.1920x1080.jpg?t=1665648063,https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_66ec3f0e108f767a88689e1a25a2a35e572e8dcc.1920x1080.jpg?t=1665648063,https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_bae03e5afb000027aeb50523b1d43b6b1176db27.1920x1080.jpg?t=1665648063,https://cdn.akamai.steamstatic.com/steam/apps/2154090/ss_8073e39f1085d7384abf7f9e01df3173646fb63f.1920x1080.jpg?t=1665648063",
    "Slug": "vs-chat-pack",
    "Meta Title": "Vs Chat Pack: Oct 13, 2022, KevDK Games and Full Overview",
    "Meta Description": "Looking for information on Vs Chat Pack? Check out the release date (Oct 13, 2022), developer insights from KevDK Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Vs Chat Pack game - Steam 2154090",
    "Canonical URL": "https://gusku.site/game/vs-chat-pack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vs Chat Pack\", \"description\": \"Looking for information on Vs Chat Pack? Check out the release date (Oct 13, 2022), developer insights from KevDK Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"KevDK Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"KevDK Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2154090/header.jpg?t=1665648063\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}