{
    "AppID": 2151530,
    "Name": "YOU ARE THE DINNER",
    "Release date": "Oct 12, 2022",
    "About the game": "Don't underestimate zombies 'You Are The Dinner' is a fast, exciting and action-packed, procedural generation, rogue-like 'zombie shooter'. With missions, loot, and trade elements, the player can plan their next run through the zombie-infested streets, seeking help from army units, planes, gunships, or even armed survivors in the city. If you die... Your save file dies too! Psychological factors Going on missions on the streets with millions of zombies turning into predatory monsters looking for prey is no easy task for any human being. As you see the zombies approaching you in crowds and with their terrible presence, your knees will buckle, your hands will tremble, you will see that your bullets are ineffective against these rotten bodies, and you will feel how close you are to death. Moreover, while you watch helplessly as the zombie hordes approach you step by step and tremble with fear, it will be difficult for you to even control your gun, you will not be able to press the trigger, sometimes you will not even be able to aim. 'You Are The Dinner' is not just a game where you go straight and shoot, but also a kind of 'lightened' simulation where you can feel the psychology of a young soldier trying to unobtrusively complete missions in a city full of zombies. In the apocalypse caused by a biological world war, you must plan your missions, taking into account the psychology of this young soldier. So much so that when you lose control and start pressing the trigger wildly, your gun will go out of control, your few precious bullets will run out quickly, and you will be shattered by countless zombies surrounding you. But don't despair, who knows, maybe a group of survivors you've helped before can come out of the city's ruins and pull you out of the zombie hordes. Or your fellow pilots in the airforces can rain death from the air on the wild zombies that surround you. While playing 'You Are The Dinner' you have to strategically plan your every step. This will determine whether you will be the zombies' dinner or not. World War III was not nuclear, it was biological The story of the video game, which we prepared as Endless-Runner, begins with the biological attacks of the warring countries on each other during the 3rd World War. Our hero is trying to fulfill the duties of the military unit he is attached to while rushing to the aid of people who can still protect himself from this virus that turns people into aggressive predators. You will have fun for long hours with this game that we have designed to give you the feeling of 'shooter' in the strongest way possible. Early Access and planned features Let's remind you that 'You Are The Dinner' is fully playable, but some of its features are still under development, and we will add new abilities to the game in the coming period. Available features: Advanced weapon mechanism. Body piercing bullets. Various skills to help you survive in Zombie Apocalypse, Army units constantly fighting in cities overrun by zombies. The ability of zombies to bite different body parts Different rarity loot Trading looted items for new skills and ammunition. Different effects of wounds on different body parts Checkpoint save system New features planned to be added with updates: New weapons, New missions, Various base commanders with different attributes to give you different missions full of surprise elements Improved inventory system, Granades, Medal system for quests. Each medal unlocks new skills and abilities such as summon boosts, new traders, new regions… New mission zones on the world map, Armed human enemies… Occupation forces of enemy countries and surviving armed gangs… We are in the Third World War, so don't be surprised if an enemy emerges from every corner, Cheerful and entertaining soundtracks to brighten your day. Can't we also listen to good music because zombies have invaded the world? Of course we can... And lots of new loot…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2151530/header.jpg?t=1665884945",
    "Price": 3.39,
    "Developers": "INDIELLIGENT",
    "Publishers": "INDIELLIGENT",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2151530/ss_b7817e795cb8f5af8777551c59356c3097129a65.1920x1080.jpg?t=1665884945,https://cdn.akamai.steamstatic.com/steam/apps/2151530/ss_fc86a5451dd0fb4d95ea605ecd0b3727487ba109.1920x1080.jpg?t=1665884945,https://cdn.akamai.steamstatic.com/steam/apps/2151530/ss_b85dc69cbf6e485a0bd50ecbf254ce5dd79597a9.1920x1080.jpg?t=1665884945,https://cdn.akamai.steamstatic.com/steam/apps/2151530/ss_725690b7869ef500f79ec51689a20b6bb0345ce8.1920x1080.jpg?t=1665884945,https://cdn.akamai.steamstatic.com/steam/apps/2151530/ss_2511e190166de2b1d49d8ad23cddf3bceffbc89d.1920x1080.jpg?t=1665884945,https://cdn.akamai.steamstatic.com/steam/apps/2151530/ss_27e24b17177dd6f926c3ca0f5b6a917155dc8a2d.1920x1080.jpg?t=1665884945",
    "Slug": "you-are-the-dinner",
    "Meta Title": "YOU ARE THE DINNER: Oct 12, 2022, INDIELLIGENT and Full O...",
    "Meta Description": "Looking for information on YOU ARE THE DINNER? Check out the release date (Oct 12, 2022), developer insights from INDIELLIGENT, and a complete game summ...",
    "Alt Text Image": "Official header image for YOU ARE THE DINNER game - Steam 2151530",
    "Canonical URL": "https://gusku.site/game/you-are-the-dinner",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"YOU ARE THE DINNER\", \"description\": \"Looking for information on YOU ARE THE DINNER? Check out the release date (Oct 12, 2022), developer insights from INDIELLIGENT, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"INDIELLIGENT\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"INDIELLIGENT\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2151530/header.jpg?t=1665884945\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}