{
    "AppID": 1956600,
    "Name": "Yusetsu",
    "Release date": "Sep 30, 2022",
    "About the game": "Join the Discord We have now opened the discord community, if you have any questions (￣y▽,￣)╭, please click the discord link on the right of (that is, support language below) join us ┏(゜ω ゜)=☞ You can also add our channel in discord: Do you have any questions? I guess you have! ! Game This work is an AVG with a pure love theme. The protagonist you play is emotionally frustrated. During the day, you work in the company to make money. By chance, you meet the hostess of the 'Yusetsu' bar, Fengxiang, and she brings you here. . Here you can drink and chat with girls, and as their friendliness improves, they will slowly open up to you... - There are 3 girls in the game that you can walk through, 27 CGs are available for collection, and some animations are made using Live2D technology to make them more delicate - Each girl has her own favorite wine, and choosing the right one can greatly improve each other's favorability and unlock more plot interactions - Each character has 40 random feedback and lines, and the girls will react differently depending on how the player interacts with the girls Character Fuka CAST: サクラヒカリ The boss of 'Yusetsu', a gentle and reliable big sister, exudes the temperament of a mature woman, and is also a serious cat control. I always feel very at ease with her, but occasionally there is a natural side. Aoi CAST: サクラヒカリ A girl who is as dazzling as the summer sun, no matter who she is, she will be immediately attracted by her extraordinary temperament (it is said to be the daughter of a wealthy aristocrat). There is a slightly sad story behind her pure and kind-heartedness. Mao CAST: 水野七海 The little devil girl, in short, is very cute! As long as you are with her, you can forget all your troubles. But don't think 'cute' is all she has, she has a big dream waiting to come true! About The single-line process for each girl in this work takes about 2 hours, and it takes about 6 hours to complete all 3 lines. The performance of the game bar part was produced by L2D, and Japanese dubbing was added to all the main plots. The script of the game was created by SP.KAKA, the original painting of the game was done by artist '雪', and the music was completed by Yiheweigui Studio and musician sSiuHin. There is no deliberate increase in difficulty in the game, all you have to do is slow down and experience the daily life with the girls. Welcome to the 'Yusetsu' bar, please enjoy a simple and gentle day away from the hustle and bustle of the city!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1956600/header.jpg?t=1664618086",
    "Price": 15.29,
    "Developers": "DSGame",
    "Publishers": "DSGame",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_a21d33052f67f195d1c7c1aa517459f11168b3a9.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_4aac800367d3d41382f99c6f1f2558c049bba79a.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_54164890558067d91568d9a9dbdfeeaa5949f964.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_9ca66185fe4b3e900505bacc6a65a107b5e63bc5.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_0d670c6301db05ebeb022cc84509082c9c99d544.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_a89e8e35d273a587fc99fe37078506cfcd0de3d1.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_1c3d195c2a4ef419213ebf5de738b0d130e76b10.1920x1080.jpg?t=1664618086,https://cdn.akamai.steamstatic.com/steam/apps/1956600/ss_c26ce128cc7a254788a5377e73b3b64278cd78c4.1920x1080.jpg?t=1664618086",
    "Slug": "yusetsu",
    "Meta Title": "Yusetsu: Sep 30, 2022, DSGame and Full Overview",
    "Meta Description": "Looking for information on Yusetsu? Check out the release date (Sep 30, 2022), developer insights from DSGame, and a complete game summary.",
    "Alt Text Image": "Official header image for Yusetsu game - Steam 1956600",
    "Canonical URL": "https://gusku.site/game/yusetsu",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yusetsu\", \"description\": \"Looking for information on Yusetsu? Check out the release date (Sep 30, 2022), developer insights from DSGame, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DSGame\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DSGame\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1956600/header.jpg?t=1664618086\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.29, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}