{
    "AppID": 1947690,
    "Name": "B.I.N.D.",
    "Release date": "Aug 18, 2022",
    "About the game": "[The scenario is equivalent to three light novels, and there are four different endings! 16 beautiful illustrations!] A strong, new female guard and a friendly prisoner. This is a love-hate drama woven by three people: a strong new female guard, a friendly prisoner, and a senior guard who is both kind and strict. A new system that is being tested in a prison in the near future changes the relationship between guards and prisoners. This is a system that connects, binds, and punishes us, the prison guards and the prisoners. 'It is proof that prison guards are absolute.' Chips implanted in every person in the prison were 'linked' by physical contact with each other, allowing for 24-hour monitoring of prisoners by guards. This was supposed to establish an overwhelming hierarchical relationship, but... It's an exciting story of love and hate that takes place in a prison! [The game system is a simple, novel-type adventure game] The game system is a simple, novel-type adventure game. There are no paid items, including tickets to read the story. All of them are completely free of charge. The story can change depending on the choices you make. You can play the game over and over again to reach the ending of your choice! [Main character (guard): Rosa] Birthday: 3/15 Early twenties. An elite new prison guard (position: guard). She has a strong sense of justice and is very serious. He seems to be able to do everything coolly, but he makes up for it with hard work. For better or worse, he is naive and believes in what he believes is right. He believes in what he believes is right. If you work in the field for a couple of years in this prison, you are guaranteed to move on to a higher career. I think of my work in prison as a step in the right direction, and I try my best not to make any 'mistakes. Therefore, she takes a cool and mature attitude to avoid getting involved with others, but at heart she is just a normal girl. [Prisoner: Rain] Birthday: Jan. 23 Late twenties. Has a talent for hacking. Very smart. When he was in college, he did research on small drones. Strong both inside and outside of machines. Bright and refreshing doggy type. Friendly. Small personal space. At first glance, he appears to be a simple personality who doesn't think about anything. Because of this, he is sometimes underestimated by others and gets involved. He has a strong sense of justice, different from the protagonist. He has a strong sense of justice, which is different from the protagonist's. He has the ability to see the true nature of things. He does not trust people unconditionally, but rather observes them first. He does not betray those he trusts. He is so passionate about the people he cares about that he is willing to risk his life to protect them. Conversely, he is willing to do evil for the sake of justice or for someone else. [Senior Guard: Cielo] Birthday: July 2nd. Late twenties. The protagonist's senior and educator. Chief warden. He's in charge of all the prisoners, but he's not in charge like the protagonist. He is also in charge of the guards. He is a calm and mild-mannered person who guides the protagonist correctly at all times. For the protagonist, he is a senior who he admires. A few years ago, a new system for managing prisoners was introduced. One of the prison guards selected for the first test was the senior guard. He is kind to his colleagues, but his attitude toward prisoners changes so much that you would think he is a different person, ruthless and merciless. Twitter ID: @o4novel [About the voice] Synthesized voices used in the game are provided by 'FutureVoice Actors'. Masashi Igarashi DiVo (Digital Voice) [About the music used] The music used in the game is based on the 'About the use of materials' of the 'Classical Music Sound Library'.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1947690/header.jpg?t=1660897934",
    "Price": 13.59,
    "Developers": "株式会社5次元,サイバーズ株式会社",
    "Publishers": "株式会社5次元",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1947690/ss_56857cf1629ee5720e4c0d895bdd81e4b154bb41.1920x1080.jpg?t=1660897934,https://cdn.akamai.steamstatic.com/steam/apps/1947690/ss_f48149152513dc9cb7e8c0fcf54d7835fba591d4.1920x1080.jpg?t=1660897934,https://cdn.akamai.steamstatic.com/steam/apps/1947690/ss_b249d2e98fdbb4b9665154f47af32ec093b4ef43.1920x1080.jpg?t=1660897934,https://cdn.akamai.steamstatic.com/steam/apps/1947690/ss_dedcb8c697607ac375d110163d9526cd53a083e5.1920x1080.jpg?t=1660897934,https://cdn.akamai.steamstatic.com/steam/apps/1947690/ss_a444af58a125303e8c933e49f2e4f27a4937317a.1920x1080.jpg?t=1660897934",
    "Slug": "b-i-n-d",
    "Meta Title": "B.I.N.D.: Aug 18, 2022, 株式会社5次元,サイバーズ株式会社 and Full Overview",
    "Meta Description": "Looking for information on B.I.N.D.? Check out the release date (Aug 18, 2022), developer insights from 株式会社5次元,サイバーズ株式会社, and a complete game summary.",
    "Alt Text Image": "Official header image for B.I.N.D. game - Steam 1947690",
    "Canonical URL": "https://gusku.site/game/b-i-n-d",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"B.I.N.D.\", \"description\": \"Looking for information on B.I.N.D.? Check out the release date (Aug 18, 2022), developer insights from \\u682a\\u5f0f\\u4f1a\\u793e5\\u6b21\\u5143,\\u30b5\\u30a4\\u30d0\\u30fc\\u30ba\\u682a\\u5f0f\\u4f1a\\u793e, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u682a\\u5f0f\\u4f1a\\u793e5\\u6b21\\u5143,\\u30b5\\u30a4\\u30d0\\u30fc\\u30ba\\u682a\\u5f0f\\u4f1a\\u793e\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u682a\\u5f0f\\u4f1a\\u793e5\\u6b21\\u5143\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1947690/header.jpg?t=1660897934\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}