{
    "AppID": 2002430,
    "Name": "♡beAt! -After the Summer-",
    "Release date": "Aug 8, 2022",
    "About the game": "Stories In the center of Tokyo’s metropolitan area. There’s a small talent agency named Yotsuba Productions (428 Prod. for short); where many aspiring idols strive to become the real deal. Since the debut of their idol group “♡beAt (Heartbeat)”, the agency’s popularity has skyrocketed. However—due to a “certain” incident that occured, it was decided to disband ♡beAt prematurely. Now... As summer closes, along with each member going on their own path. The story of ♡beAt, and it's end can be told. Introduction ・Whole script over 5000 lines with the stories ・Original full-color CG artwork ・One-on-one communication mode with the idols ・Original UI design ...and more! Key Features - Designed using Live2D software. - Story takes place across 4 chapters, each one corresponding to a member of ♡beAt from their perspective. - Uncover secret scenarios depending on your choices, and meeting “certain” conditions throughout the chapters. Note (Attention) While the story is relatively for all ages and can be enjoyed as such. There are some scenes that may disturb or cause anxiety for younger audiences, or those who are easily disturbed. In addition, though the story is partially based of real events. It's solely a work of fiction that doesn’t represent any: individual, group or agency. Thus, it should be treated as such with that context in mind. Characters: Core Hato (Stage name)/ Koa Aida (Real name) The star attraction and leader of ♡beAt (Heartbeat), Core Haato, 16 with vibrancy and a cheerful disposition. She takes pride in being the leader, however hides her identity as an idol in order to live a normal life as, Koa Aida. But, after the 'incident' occurred; she decides to openly embrace being an idol and live as, Core Hato. Haru Samidare Formerly debuted as an idol in the early days of ♡beAt (Heartbeat). Haru Samidare, now 21, manages the group and serves as a direct mentor to Koa. Although, being very stern and diligent, she's only seen as unpopular by fans. So, in her downtime, she works secretly as a shrine maiden. Suzu Maikaze The youngest and the 'Sleeping Beauty' of ♡beAt (Heartbeat), Suzu Maikaze, 14 but claims to be 140 years old. She always seems sleepy; yawning while in the mist of conversations. But despite that; she's a breathtaking singer that surpasses Koa (vocally). However, since the 'incident' occured, she's been targeted by a stalker. Yuuka Kasasagi Arriving from Saga prefecture, Yuuka Kasasagi debuts as the latest member of ♡beAt. While, having trouble standing out and feeling like the 'Cinderella' of the group. The fans and her growing popularity tell a different story, as she's considered to be rivaled with Koa. But, with gossip like that spreading around, a lot of angry stans have arised. Saku Mochidzuki A childhood friend of Koa, Saku Mochizuki is the only one who knows Core Hato's true identity (aside from the group). To ensure that it doesn't leak; she decides to join ♡beAt as an assistance for Core Hato.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2002430/header.jpg?t=1660015957",
    "Price": 4.99,
    "Developers": "d'Arc",
    "Publishers": "d'Arc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2002430/ss_5039dc7dd6c3269bc5d9cb1c098f6418ec849aaa.1920x1080.jpg?t=1660015957,https://cdn.akamai.steamstatic.com/steam/apps/2002430/ss_51041713168c458246ef64121c22bac3a41e409b.1920x1080.jpg?t=1660015957,https://cdn.akamai.steamstatic.com/steam/apps/2002430/ss_5b3c053c8e04c45d99eba9c0f5f40b25adad994b.1920x1080.jpg?t=1660015957,https://cdn.akamai.steamstatic.com/steam/apps/2002430/ss_41b35ccaa4b233e361eb186ae6ec37a1a3388e56.1920x1080.jpg?t=1660015957,https://cdn.akamai.steamstatic.com/steam/apps/2002430/ss_24dc9e99657153940f33a48bf7427605dbefa088.1920x1080.jpg?t=1660015957",
    "Slug": "beat-after-the-summer",
    "Meta Title": "♡beAt! -After the Summer-: Aug 8, 2022, d'Arc and Full Ov...",
    "Meta Description": "Looking for information on ♡beAt! -After the Summer-? Check out the release date (Aug 8, 2022), developer insights from d'Arc, and a complete game summary.",
    "Alt Text Image": "Official header image for ♡beAt! -After the Summer- game - Steam 2002430",
    "Canonical URL": "https://gusku.site/game/beat-after-the-summer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u2661beAt! -After the Summer-\", \"description\": \"Looking for information on \\u2661beAt! -After the Summer-? Check out the release date (Aug 8, 2022), developer insights from d'Arc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"d'Arc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"d'Arc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2002430/header.jpg?t=1660015957\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}