{
    "AppID": 1944570,
    "Name": "Boneraiser Minions",
    "Release date": "Aug 5, 2022",
    "About the game": "~ In a time long ago, those with forbidden power over the dead were branded as wretched Boneraisers. Such heathen were hunted, hanged, burnt, and staked, and their remains sealed within sanctified mausoleums. But what those fearfully foolish folk did not realise, is that those whom are already dead, cannot be killed. You are one such filthy Boneraiser! ~ Gameplay As a reviled Boneraiser you must amass an army of skellies and deamons to fight the endless waves of heroes intent to end your necromantic ways. In this gothic-horror auto-battler roguelite, use the bones and souls of slain heroes to raise and upgrade undead minions, and collect powerful relics and spells to turn the tide of war. Unlock meta upgrades to improve your boneraising abilities, but crucially you must also bolster the Godly heroes' forces too in order to gather enough resources to defeat your nemesis King Gigald's crusade! Features Boneraising auto-battler action: Dash around avoiding enemies and collecting their bones to raise and upgrade minions who fight for you! Each minion type has their own fighting styles, from melee pulverisers, to bomb lobbers and magical missilers. Multiple game modes: There's several game modes to keep play fresh. From the Mausoleum Awakening where you must protect your crypt against King Gigald and his forces, making best use of traps and contraptions you place before the show. There's the Endless Skirmishes where the aim is to simply see how long you can last against an ever growing horde of meanies. And then there's Clashful Cards, a collectable adversarial card game, a bit of respite from the endless boneraising! Relics and Spells: There's not just bones to suck on during the fight. You will find curious Relics with strange boosts and abilities, or Spell Scrolls with powerful attacks or buffs to be used at the perfect time! Boneraise Lore meta: Between games use collected coins to increase your abilities and boneraising powers, such as learning to raise Enboned Giants and Possessed Deamons. Meta can also be upgraded and refunded, encouraging you to play around and find your perfect meta loadout! Heroic Force meta: You must also bolster the forces against you too if you wish to survive King Gigald. Why not provoke a Beggar's Revolt, Goblin Looters, or Mercenary Cyclops, and use their bones to raise an ever greater army of dead! Class Heritage meta: By stealing heroes souls you can also learn new abilities and perks for a particular class. Each class offering their own playstyles! Steam Leaderboard: Battle your foes, and your friends, to reach first place on the online Steam leaderboard! Even after defeating King Gigald the crusade wars are endless, and only the greatest legion of undead ever assembled will reach the top spot! ~ Can you resist King Gigald's poundings? ~",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1944570/header.jpg?t=1659771210",
    "Price": 1.59,
    "Developers": "Anthony Case",
    "Publishers": "Caiysware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_fe254df02963df8cd81ad4ce88fc6cf5462afcb3.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_22b857bb98e2081232cf1538e94e2512196c7038.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_2b74ab356590098d97c2205e72ad82a791f5b951.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_7c0220101a6d81c4a325aab3c83d874572720cf2.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_099fe12ed63cc15da3822b78b7f9bb973cf8c62a.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_c6291f03a423f95031b81129bee2827cec993808.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_81e4e696f8013cd91ed790c7bac26d7f2eac42ab.1920x1080.jpg?t=1659771210,https://cdn.akamai.steamstatic.com/steam/apps/1944570/ss_3ca80fc73584aa1cc389a28ab613d3522c4f5a02.1920x1080.jpg?t=1659771210",
    "Slug": "boneraiser-minions",
    "Meta Title": "Boneraiser Minions: Aug 5, 2022, Anthony Case and Full Ov...",
    "Meta Description": "Looking for information on Boneraiser Minions? Check out the release date (Aug 5, 2022), developer insights from Anthony Case, and a complete game summary.",
    "Alt Text Image": "Official header image for Boneraiser Minions game - Steam 1944570",
    "Canonical URL": "https://gusku.site/game/boneraiser-minions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Boneraiser Minions\", \"description\": \"Looking for information on Boneraiser Minions? Check out the release date (Aug 5, 2022), developer insights from Anthony Case, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anthony Case\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Caiysware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1944570/header.jpg?t=1659771210\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}