{
    "AppID": 2077130,
    "Name": "Bounce your Bullets!",
    "Release date": "Aug 24, 2022",
    "About the game": "- I tried to build this in 2 weeks. It might or might not have taken 2 months instead. Please expect it to be what it is and no more. You shoot bullets. Your bullets bounce and get stronger. (Full details of the content below). - If you have any feedback, or find some bug or find anything misleading on the store page, please come say hi on Twitter or in the forums. (links in the sidebar). 1- you cannot stop moving forward. 2- you follow the mouse. 3- you have to prevent enemies from reaching the other side of the screen. You have 9 'lives'. 4- they explode in debris that can only be destroyed with a projectile that is strong enough. 5- if you get hit you lose (no 9 lives on that). 6- your bullets get stronger every few bounces. 7- the goal is just to survive for as long as possible. It gets harder and harder. notes/tips : - debris don't reduce your lives if they reach the other side of the screen, but they still kill you if you touch them. - enemies pop after one hit, no matter their color. - the more bounces a bullet got, the more points it will give. - You must get this to shoot. It is different from the bigger yellow spheres. This one allows you to shoot bullets. The bigger yellow spheres kill you. Don't ask. You will be fine. Red (triangles) bullets. They spawn side yellow bullets when they hit something. After a few bounces they become green. Green (squares) : goes fast. This is strong because it almost guarantees the bullet will hit enough things to upgrade into the next one : Purple (pentagons) : spawns a lot of basic yellow bullets. These little ones will slow down but if they upgrade into red bullets they will perform normally. The main bullet will upgrade into the final evolution after enough bounces : Black/white (hexagons) : Spawns a shockwave after a small amount of time. It will clear the screen from debris and pop all enemies. note/tips : - shapes in debris are deactivated by default. - bullets have a lifetime. - If you were randomly scrolling through, this is the part where you learn that you only shoot yellow bullets (and they then upgrade by bouncing). On top of that there are different 'weapon types' that you can unlock and choose from in the menu. 1- 'Simple shot' . This is what you get at first. Just shoots bullets one by one. You can upgrade it so that it shoots 3 bullets successively. 2- 'Tri-shot' : spawns 3 bullets at once. You can upgrade it so that it shoots 5 bullets at once. Penta-shot I guess. 3- 'Full auto' . Might or might not be dependent on your framerate, as a feature, totally. - You also have an upgrade to double your turn speed. This becomes useful as the game progresses and you have to dodge debris or quickly change direction. - Your ship (let's call that a ship) follows your mouse cursor. - Left click to shoot. - There are no other control you just click. - You can add shapes to debris if you are colorblind. This is the case in the gifs above in the content session. Debris (the flying pizza slices) that are fully filled up can always be destroyed by anything. - You can also remove shapes from everything. This was the original design. But in the end it makes more sense to still have them in most places by default. - The game is made to be played one-handed. - As some of you might have guessed if you are a fine connoisseur of dancing mice, some music is from Kevin MacLeod. (CC-BY 3.0, attribution in game). - The trailer music is Ethernight Club, also by Kevin MacLeod, Incompetech, CC-BY 3.0. - A few other CC0 songs (attribution in game).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2077130/header.jpg?t=1661679122",
    "Price": 0.89,
    "Developers": "Quentin Edel",
    "Publishers": "Quentin Edel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_7ae8a0761982fe826e548788b0d8ed981a935fcb.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_5574b92f47757938ef7648d4f9ab092f1588af56.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_acd23eea0bdc88684c604a40fe3f216afbfc7352.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_e71285f19216a8f82d27c85cecbd2f0591792989.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_cff788a331a9823fac722c057a57d329fbb9fdf6.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_7e586d323d6ca418487a78e9a40c33708052f9f2.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_386b683dd9e10f78e50d60081638c13209c2af17.1920x1080.jpg?t=1661679122,https://cdn.akamai.steamstatic.com/steam/apps/2077130/ss_df9308c3d5f33a689e41ce8f0903e1cf2b41d34d.1920x1080.jpg?t=1661679122",
    "Slug": "bounce-your-bullets",
    "Meta Title": "Bounce your Bullets!: Aug 24, 2022, Quentin Edel and Full...",
    "Meta Description": "Looking for information on Bounce your Bullets!? Check out the release date (Aug 24, 2022), developer insights from Quentin Edel, and a complete game su...",
    "Alt Text Image": "Official header image for Bounce your Bullets! game - Steam 2077130",
    "Canonical URL": "https://gusku.site/game/bounce-your-bullets",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bounce your Bullets!\", \"description\": \"Looking for information on Bounce your Bullets!? Check out the release date (Aug 24, 2022), developer insights from Quentin Edel, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Quentin Edel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Quentin Edel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2077130/header.jpg?t=1661679122\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}