{
    "AppID": 1968730,
    "Name": "Bounty of One",
    "Release date": "Aug 18, 2022",
    "About the game": "Once, you were a legend of the Western Kingdoms, but you were betrayed and fell into disgrace. Now you and your crew are outlaws. A bounty has been wrongfully placed over your head and countless hordes of bounty hunters are coming for you! Will you be able to survive? Will you be able to clear your name? Would you become a bounty of one? Bounty Of One is a fast-paced casual roguelite bullet hell where mobility is key . Play solo or with your friends up to four players on the same screen or remotely with ‘Steam Play Together’. Play with a keyboard or a gamepad. Alone or with your crew, defeat endless waves of bounty hunters Upgrade quickly your skills to survive ever stronger waves of enemies. Collaborate with your friends and split the loot smartly (or argue about it yek yek)! Unleash hell on them and don’t get caught Resist and more will come for you! But you are well prepared and you will show no mercy! Defeat mighty bosses Fight your way through the sheriffs and deputies serving the evil Undertaker. Find your nemesis, beat him and make him pay for your loss! Choose wisely how to upgrade your skills Each run is different due to randomization. Will you focus on attack speed? Damage? Or something more exotic? Discover powerful equipment to help you in your quest Beat the elites and bosses and get their precious loot, which can really change your game style. Some will improve your offensive skills, others the defensive one and some will do a lot of boom boom! Already 33 different items in the Early Access version! Gather your whole crew and choose your hero Try each character: they have their own playstyle with different advantages and flaws. Will you choose Serra the archer? Nigel the old sheriff? Or someone else? There are currently 3 unlockable characters in this version of the game. More will come! Fight your way to the top of the outlaw legends! Be worthy enough to be part of the hall of fames and never be forgotten! At the moment, Bounty Of One contains: 3 characters: each with their own identity and skills 15 enemies: with various patterns to learn 1 bosses for epic fight and awesome loot 33 game changing objects like NitroCrit, Triple Shot and more Each run is different due to randomization An very easy to learn but hard to master gameplay Each run can be completed in 20 to 30 minutes High replayability due to the infamy-based difficulty levels.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1968730/header.jpg?t=1661026256",
    "Price": 3.99,
    "Developers": "OptizOnion",
    "Publishers": "OptizOnion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_0cf5473bf64ee2e3ec1a5d8a7b60c7d11d85380f.1920x1080.jpg?t=1661026256,https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_09894cd5642d69fdff92376e97357cc3cc90b29e.1920x1080.jpg?t=1661026256,https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_6dd5a7527e8e82d6d3a218dae3d558dd21b138f4.1920x1080.jpg?t=1661026256,https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_a54d0cf0bc42df4dfd94b35ca2642dbd24c3e8de.1920x1080.jpg?t=1661026256,https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_608c4d62330ebdfb3949bfb9060d5adb5c4c5616.1920x1080.jpg?t=1661026256,https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_bf1cf81f2a65dcb49e8efe0a609a1e95f37c5370.1920x1080.jpg?t=1661026256,https://cdn.akamai.steamstatic.com/steam/apps/1968730/ss_bb6ced42b1e43118b52ea270a8a432adc5a3b883.1920x1080.jpg?t=1661026256",
    "Slug": "bounty-of-one",
    "Meta Title": "Bounty of One: Aug 18, 2022, OptizOnion and Full Overview",
    "Meta Description": "Looking for information on Bounty of One? Check out the release date (Aug 18, 2022), developer insights from OptizOnion, and a complete game summary.",
    "Alt Text Image": "Official header image for Bounty of One game - Steam 1968730",
    "Canonical URL": "https://gusku.site/game/bounty-of-one",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bounty of One\", \"description\": \"Looking for information on Bounty of One? Check out the release date (Aug 18, 2022), developer insights from OptizOnion, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"OptizOnion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OptizOnion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1968730/header.jpg?t=1661026256\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}