{
    "AppID": 1878190,
    "Name": "Caribbean Marque",
    "Release date": "Aug 16, 2022",
    "About the game": "Welcome to the Caribbean matey! The game takes place in a scaled down version of the real Caribbean, all your favorite islands are there! Cuba, Jamaica, Haiti, Dominican Republic etc. A light RPG This game features light RPG elements. It is at its core still a linear story game about becoming a pirate in the golden age of piracy. This game is a solo dev venture and therefore I would like to clearly state that. Hence the game is aptly priced for its replayability. The path to piracy Once a pirate, always a pirate. Becoming a pirate is a permanent and progressive choice. This game aims to simulate the pressures that forced sailors into piracy and the permanent choice that it was. You start off as a British privateer, free to attack countries your nation is at war with. However the temptation of more spoils in moments of peace may lead you into a life of piracy. As you engage in piratical acts you increase your infamy, gaining access to more tools to help you carry out further acts. This does mean that you will have to leave a life of trading behind as only pirate havens will be safe from then on. Trade to your heart's content Buy and sell different trade goods, always in search of the best deal. Get the latest news from the tavern at each port. Markets are changing everyday, with goods in surplus and shortage. Agree on the voyage Every voyage starts off with a contract that sets out what the crew stands to earn. Decide whether your ship will operate as a pirate or a privateer. Pirates share booty, privateers must pay their crew a fixed salary. Manage your crew Your crew are a useful bunch...as long as you don't make them too mad. Each crew member has unique perks to unlock that may help you against the biggest fish of the sea. It comes at a cost however...you must manage your crew and make sure they don't become to mutinous due to your below average leadership skills or low pay. Upgrade and buy new ships What good is a pirate without a ship? In Caribbean Marque you are able to apply blueprints earned during the story which improve the ship's handling, firepower and health. If a simple blueprint isn't enough for you, feel free to change to a bigger ship, provided you have the coin for it... A story of revenge and treasure Experience a tale of ups and downs filled with tragedy and success. We can't spoil too much but rest assured there will be plenty of banter and shooting.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1878190/header.jpg?t=1660711845",
    "Price": 5.39,
    "Developers": "Tofu Interactive",
    "Publishers": "Tofu Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_30597b611b9ba5379dabaddea840a1bd4b8b5270.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_c75e71cf188570608f1625efbf3f40e495e32cab.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_d54ff9c1df45730d5a90b2b4313f65a13f73ae12.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_62a88c17ed131fe28dbd94ae8186344a6db44a30.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_a648bc9d846e6f003ed9b7a7c8d595d7e5f5b0fb.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_b0ddd54418492d6715687701916b0907cf346fdc.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_7f52d35a0c6f022a3b315bd505e05be105d855b6.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_78779cb2db42adab422e9f86a078cb5acacd88e7.1920x1080.jpg?t=1660711845,https://cdn.akamai.steamstatic.com/steam/apps/1878190/ss_7604a959d210caf8b934caf3cca31d15ac69fa2c.1920x1080.jpg?t=1660711845",
    "Slug": "caribbean-marque",
    "Meta Title": "Caribbean Marque: Aug 16, 2022, Tofu Interactive and Full...",
    "Meta Description": "Looking for information on Caribbean Marque? Check out the release date (Aug 16, 2022), developer insights from Tofu Interactive, and a complete game su...",
    "Alt Text Image": "Official header image for Caribbean Marque game - Steam 1878190",
    "Canonical URL": "https://gusku.site/game/caribbean-marque",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Caribbean Marque\", \"description\": \"Looking for information on Caribbean Marque? Check out the release date (Aug 16, 2022), developer insights from Tofu Interactive, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tofu Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tofu Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1878190/header.jpg?t=1660711845\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}