{
    "AppID": 1825150,
    "Name": "Cells of Immunity",
    "Release date": "Aug 20, 2022",
    "About the game": "Overview of the story Play as a young Thymocyte, training to become one of the primary white blood cells that protect the human body. Meet other cells in training, and find out who is talented enough to become a white blood cell and the fate of the failures. As the story progresses, you'll have the ability to control multiple types of white blood cells, such as T-Killer cells, Macrophages and neutrophils. Each with its unique strengths and weaknesses, command them correctly to overcome all obstacles caused by invading pathogens. Use the correct types of attacks against your enemies in Real-Time action-bar combat in order to defeat your enemies. To serve and protect the human body at all costs. Game Features 1-2 Hours of Gameplay 3 Acts of Story 3+ Playable Characthers 3+ Different Classes Dozens of Items, Weapon and Gear to collect! Over 10 types of encounters! Over 20 different areas to explore! Many types of attacks, elements and status conditions. Details about the game This game is an educational Role-Playing-Game, all about the human immune system. You will experience the lives of many cells involved in the immune system. Learn about the objectives of different cell types involved in the immune response, and fight against invading pathogens. Many factors in this game, such as appearances and interactions between cells, have been altered, to fit better into a game and a good story. Despite the alterations, all events and characters in this game are based upon how the human immune system works in real life, and as a result, we aim to teach everyone who plays our game a bit more about the immune system than they knew before. Furthermore, students in medical or biological areas may find this game useful to visualize the interactions within the human body. Although some amount of scientific accuracy has been lost, this makes a much easier to understand. This game has been developed by University of Warwick students, and the story has been fact-checked by Professors of Warwick, to stay relatively accurate to the actual science behind it. The development of this game has been funded by IATL of Warwick, making it accessible for everyone to play and learn from it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1825150/header.jpg?t=1660997407",
    "Price": 0.0,
    "Developers": "Nova Empyrean",
    "Publishers": "Nova Empyrean",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1825150/ss_0d2ad447671df1200fc5d6ba32d2f5c3142d47ff.1920x1080.jpg?t=1660997407,https://cdn.akamai.steamstatic.com/steam/apps/1825150/ss_473c90e8c9e1eade98b3ec2fe018836f38eaeea9.1920x1080.jpg?t=1660997407,https://cdn.akamai.steamstatic.com/steam/apps/1825150/ss_09241fe289c6b726328d750df2199f9cc7e8f3fb.1920x1080.jpg?t=1660997407,https://cdn.akamai.steamstatic.com/steam/apps/1825150/ss_244991f0903086bbb9313d52d0e5655320aef530.1920x1080.jpg?t=1660997407,https://cdn.akamai.steamstatic.com/steam/apps/1825150/ss_5bacfcae427f80a9feef1a96c2a8a46fbb6f11ca.1920x1080.jpg?t=1660997407",
    "Slug": "cells-of-immunity",
    "Meta Title": "Cells of Immunity: Aug 20, 2022, Nova Empyrean and Full O...",
    "Meta Description": "Looking for information on Cells of Immunity? Check out the release date (Aug 20, 2022), developer insights from Nova Empyrean, and a complete game summ...",
    "Alt Text Image": "Official header image for Cells of Immunity game - Steam 1825150",
    "Canonical URL": "https://gusku.site/game/cells-of-immunity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cells of Immunity\", \"description\": \"Looking for information on Cells of Immunity? Check out the release date (Aug 20, 2022), developer insights from Nova Empyrean, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nova Empyrean\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nova Empyrean\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1825150/header.jpg?t=1660997407\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}