{
    "AppID": 2085970,
    "Name": "Cracking the Cryptic",
    "Release date": "Aug 1, 2022",
    "About the game": "Welcome to the brand new Sudoku app from YouTube’s most popular Sudoku channel, Cracking The Cryptic. Unlike other Sudoku apps, we feature handcrafted and curated puzzles from the world’s best Sudoku constructors. Each collection features puzzles made by various authors that are now familiar names to those who follow the channel. Authors like Phistomefel, Clover, Sam Cappleman-Lynes, Christoph Seeliger, Richard Stolk, jovi_al, Qodec, Prasanna Seshadri and of course, Simon and Mark! Downloading Cracking the Cryptic will give you access to our two launch packs. Our first free collection is a variety pack by Prasanna Seshadri featuring 7 puzzles inspired from our previous Sudoku apps; Sandwich, Classic, Chess, Thermo, Miracle, Killer and Arrow Sudoku. Our first paid collection is Domino Sudoku, a new variant not featured in our previous apps with puzzles from our amazing constructors. We’ll be releasing more free and paid packs in the future so keep an eye on the app for more Sudoku content from Cracking The Cryptic! -------------------- Domino Sudoku Domino Sudoku is named after its domino-like appearance with X's, V's, white dots and black dots placed between cells on the grid. Each puzzle features one or more of these domino types with them all having a different effect: an X means digits in the two cells in the domino must sum to 10; a V means they sum to 5; a white dot means the digits are consecutive; and, finally, a black dot means the digits must be in a 1:2 ratio (ie one of the digits must be double the other). As you can imagine, when you allow the world’s best Sudoku makers to use these rules they are in their element and they’ve made another set of masterpieces for this collection with a huge amount of variety! We’re thrilled that Domino Sudoku includes puzzles by Christoph Seeliger, Sam Cappleman-Lynes, Richard Stolk, Prasanna Seshadri, Phistomefel, Qodec, Clover and jovi_al. In addition, Mark and Simon have written hints for the challenging puzzles themselves so these hints are meaningful and, above all, educational. As a bonus, Studio Goya has curated 10 generated beginner puzzles so that players of all skill levels can enjoy Domino Sudoku! In Cracking The Cryptic’s games, players start with zero stars and earn stars by solving puzzles. The more puzzles you solve, the more stars you earn and the more puzzles you get to play. Only the most dedicated (and cleverest) sudoku players will finish all the puzzles. Of course the difficulty is carefully calibrated to ensure lots of puzzles at every level (from easy through to extreme). The collection launches with 40 puzzles (plus 10 beginner puzzles) and will benefit from a monthly update - 5 new puzzles will be added each month for the first year of release - so there will be 100 puzzles in all. So do join us as we continue to try to revolutionize Sudoku app genre.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2085970/header.jpg?t=1659366586",
    "Price": 0.0,
    "Developers": "Studio Goya",
    "Publishers": "Studio Goya",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2085970/ss_4f92bd1479975f5a586f5af0598fd66b6d87510d.1920x1080.jpg?t=1659366586,https://cdn.akamai.steamstatic.com/steam/apps/2085970/ss_5601836a58dfc659e92711a4feaac0d66cbe29dc.1920x1080.jpg?t=1659366586,https://cdn.akamai.steamstatic.com/steam/apps/2085970/ss_a5dd3a6f785bbbb5be81c9c7810e003df1164859.1920x1080.jpg?t=1659366586,https://cdn.akamai.steamstatic.com/steam/apps/2085970/ss_56e3e409747681cf75cba45f8e2cb500e7fd3d57.1920x1080.jpg?t=1659366586,https://cdn.akamai.steamstatic.com/steam/apps/2085970/ss_2700dfe4d9b7e023b6e5e7ebbaabad41410bada5.1920x1080.jpg?t=1659366586",
    "Slug": "cracking-the-cryptic",
    "Meta Title": "Cracking the Cryptic: Aug 1, 2022, Studio Goya and Full O...",
    "Meta Description": "Looking for information on Cracking the Cryptic? Check out the release date (Aug 1, 2022), developer insights from Studio Goya, and a complete game summ...",
    "Alt Text Image": "Official header image for Cracking the Cryptic game - Steam 2085970",
    "Canonical URL": "https://gusku.site/game/cracking-the-cryptic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cracking the Cryptic\", \"description\": \"Looking for information on Cracking the Cryptic? Check out the release date (Aug 1, 2022), developer insights from Studio Goya, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Goya\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Goya\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2085970/header.jpg?t=1659366586\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}