{
    "AppID": 1989310,
    "Name": "Dragon Mine",
    "Release date": "Aug 17, 2022",
    "About the game": "Dragon Mine is a game about gold miner who is trapped in the gold mine with unknown creatures: some are neutral, some are aggressive, some are annoying. Go through the numerous mazes and try to get to the cave full of gold waiting at the end, but remember - the journey won't be easy. Think fast and move precisely to get to the exit - any delay may result in the escape portal to be covered with mysterious water, blocking your way out. 50 levels, 5 bosses and unusual ending are waiting for you. Some levels are straight-forward run-through mazes that will require speed and precision, some will utilize your outside the box thinking, as the obvious way may be the wrong one. There are places that might look unpassable, but there is surely a way out. Everything should be done fast, as the mazes are being flooded by a mystic water that will kill the player if he touches it, and there is a chance you will find the exit covered with the water if you are too slow in collecting the coins: in some cases even one lost second can decide if you pass the level or not. There are monsters in the mazes that are not happy to see you down there. Some of them will ignore you some will try to make your life harder in a passive way, and some are really aggressive. You can't kill anyone, but everyone can kill you. There are monsters that are always faster than player: you can't outrun them, however they aren't too clever, so you have a chance to outsmart them. This game will require all your concentration, it will make your hands shaking after each level completion, but nice ambient music will help you keep your rage away after you fail again and again. To pass to the new level you need to collect only 80% of all the coins in each maze (except for the bosses), however some achievements will stay unreachable for you till you collect everything (don't worry - the levels are built the way that there is guaranteed enough of time to pass them ideally). In case you have controlling skills and reaction of a super hero, the game is possible to complete in 90-100 minutes, but it is much more likely that it will take you up to 50 (or maybe even more) hours of intense gameplay to complete the game ideally and collect all the achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1989310/header.jpg?t=1660727027",
    "Price": 3.89,
    "Developers": "Peachy Clouds",
    "Publishers": "Peachy Clouds",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1989310/ss_5e9d19dd98faf53f031d2d70552895cbe38e9601.1920x1080.jpg?t=1660727027,https://cdn.akamai.steamstatic.com/steam/apps/1989310/ss_ebdd0833351dc3bf8a9be4ad06268778cb1eba18.1920x1080.jpg?t=1660727027,https://cdn.akamai.steamstatic.com/steam/apps/1989310/ss_0485d0cf4023a690d7c7a0900bd17c5968a94667.1920x1080.jpg?t=1660727027,https://cdn.akamai.steamstatic.com/steam/apps/1989310/ss_9d3aa577e572cb2ce88ec063996099481d878684.1920x1080.jpg?t=1660727027,https://cdn.akamai.steamstatic.com/steam/apps/1989310/ss_67027cb844c4d1611ff59ab0ff60aea95bc2692e.1920x1080.jpg?t=1660727027",
    "Slug": "dragon-mine",
    "Meta Title": "Dragon Mine: Aug 17, 2022, Peachy Clouds and Full Overview",
    "Meta Description": "Looking for information on Dragon Mine? Check out the release date (Aug 17, 2022), developer insights from Peachy Clouds, and a complete game summary.",
    "Alt Text Image": "Official header image for Dragon Mine game - Steam 1989310",
    "Canonical URL": "https://gusku.site/game/dragon-mine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dragon Mine\", \"description\": \"Looking for information on Dragon Mine? Check out the release date (Aug 17, 2022), developer insights from Peachy Clouds, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Peachy Clouds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Peachy Clouds\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1989310/header.jpg?t=1660727027\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}