{
    "AppID": 2075340,
    "Name": "Eo",
    "Release date": "Aug 3, 2022",
    "About the game": "The world always changes. Eo is the goddess of Creation. She created all the gods: Nu, Hades, Zeus, Odin, Thor, Lucifer, Hephaestus, Athena, Maeve, Mephisto, Lilith, Arthemis, Bhaal, Gaia, the Archangels, the Titans and many others. In Eo, the gods are people like you, and they want to be worshipped to be more powerful. So, choose a race, find others, survive, explore, build and change the world. We are trying a new concept where the players will take part in adventures that will actually shape the world and change it - maybe you will destroy and entire village for your god Bhaal or because Gaia fears their advances will destroy a sacred forest. Find a way to communicate with the gods and they will help you with what you desire. Playable races: - Humans - We are the most common race on Eo. We are also called The First Sons, because we were the first people created by the goddess. We are hard workers and we can learn any skills with ease. We start with two basic skills: Lumberjacking, 0.1 and Blacksmithing 0.9 Our race is favoured by the gods Nu, Hephaestus and Athena. - Elves - We were the Second Sons of Eo. Upset with all the flaws she saw in Humans, Eo created us to be faster, lighter, more intelligent and able to brighten the dark with our inner light. We start with two basic skills: Woodworking, 1.6 and Archery 0.6 Our race is favoured by the gods Lilith, Diana and Gaia. - Orcs - We were not created by Eo. We are born from curses cast on elves and humans by wives of the men dead in the war. There was an ancient curse in the land and a wife needed only the blood of her dead husband to bring him back as a horrific creature that would have his revenge. The problem is we rarely remembers our previous life and we just live lives of our own. We feel the hatred and need for revenge and murder, but we can't really explain why. We start with two basic skills: Heavy Weapons, 0.3 and Necromancy, 1.0 The gods that have the most to gain with us are Bhaal and Hades, the only ones that become stronger with more deaths and violence on the land. - Fey - When Eo created Gaia, she immediately spawned us, the Fey. We are Gaia's little helpers, her Archdruids. We protect the forests from devastation, plant trees and even defensive vegetation that help keep men and ravenfolk away. Unfortunately, some of us are dissevered from this way, falling in love with humans, even corrupting animals with orcs and ravenfolk. We start with two basic skills: Druid 0.2 and Healing 1 We are protected by Gaia. - Catfolk - When Lucifer fell, he created Demons and us. We were born to follow the Dark Prince and eradicate all evil. The Prince created all felines to be agile, fast and precise in our fight for Justice. We are the superior mortal beings, in service of the Prince that Brings Light, Lucifer, as well as Bhaal and Lilith. We will bring torture and damnation to all those who are weak and fall to the pleasures of the flesh. - Ravenfolk - We were not created by the goddess Eo. We were born from the mockery of Mephisto and Maeve. Defiants, they looked at the humans and elves, their beauty and perfection, and created us to laugh at Eo. However, we became wise, centered and in many aspects, superior. We start with two basic skills: Endurance 0.3 and Mining 0.5 Two gods protect us: Maeve and Mephisto. - Demon - We are also called Children of Lucifer. Men follow Eo because she forgives. We don't. We don't forgive murderers, thieves and traitors. Men are evil and these men will find only torture when they meet us. We are the true Warriors for what's good and pure. We start with Fire Resistance 0.3 and Intimidate 1.0 We are protected by Lucifer. - Dark Elves - Disgusted by the weakness of elves, our people devoted themselves to Bhaal. The Lord of Murder purges the world of evil and in his trail of blood leaves only the honest and good behind. That is the true meaning of Good. In murder, we found strength, not weakness. We start with Darkness 1.0 and Stealth 0.8 We are protected by Bhaal. - Atlantean - We were created by Nu, Lord of the Seas. We were tasked by Him to create Atlantis, a mighty underwater city. But some of us gave up the Ocean to live among humans, even using magical means to breathe out of the water, which was impossible before. We start with Underwater Breathing 10 and Swimming 10 We are protected by Nu. - Goblin - We are the true children of Mephisto. In the darkness, we do his bidding and from sunlight we hide. We trick, we lie and we find precious things for our Lord. He hates us and he loves us. Our existence makes as much sense as he wills it. We start wil Illusion 0.3 and Stealth 1.0 We are protected by Mephisto",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2075340/header.jpg?t=1659904439",
    "Price": 0.0,
    "Developers": "Fire Game Studios",
    "Publishers": "Fire Game Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_75a067cd8afd71a6372a22ba095992450d68d490.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_eb999a502035172b79345bab83ae53745e82e1a6.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_a6719e24f58228cc46543a266bbc039f4e82e83f.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_b9f4b03e8f0aeb5d9a63595cd6e36d985396ae51.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_63b60cfc7d56cd5785420410e751a1ed1cc5c6ee.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_2521d5074f637adc840348b7aa120f68b55dc314.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_f5c6c02653086a5c8be169feee73a67a9e9e1e94.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_85b499f30b3c12c254f61dc33de747aedb9acef5.1920x1080.jpg?t=1659904439,https://cdn.akamai.steamstatic.com/steam/apps/2075340/ss_b975f3a9a725f39144d1dbe2ce4ac405d841d54d.1920x1080.jpg?t=1659904439",
    "Slug": "eo",
    "Meta Title": "Eo: Aug 3, 2022, Fire Game Studios and Full Overview",
    "Meta Description": "Looking for information on Eo? Check out the release date (Aug 3, 2022), developer insights from Fire Game Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Eo game - Steam 2075340",
    "Canonical URL": "https://gusku.site/game/eo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eo\", \"description\": \"Looking for information on Eo? Check out the release date (Aug 3, 2022), developer insights from Fire Game Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fire Game Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fire Game Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2075340/header.jpg?t=1659904439\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}