{
    "AppID": 2008480,
    "Name": "Everything Has Arms",
    "Release date": "Aug 9, 2022",
    "About the game": "It's hide-and-seek on steroids in VR. And everything has arms! Gameplay Hunters are looking for the heavily 'armed' items in this multiplayer VR prop-hunt game. As mimic you blend in and fool the hunters, high-fiving other mimics for victory. Hunters need to find and catch the flexing flower pots in this fast-paced hide and seek game. Everything has arms in Everything Has Arms. In Everything has Arms you either take on the role of a Hunter or become a Mimic. Mimics can disguise themselves by possessing objects and hide as them. Score by high-fiving other mimics and staying in the game as long as possible. You can only stay in object-form for a limited time, after that your arms pop out. As soon as the hunters spot you, you need to bolt and lose them before they catch you. Hunters need to find and chase down the Mimics. Their finger guns will slow them down and hinder their jumping ability. (Mimics can fire flares with their own finger guns, signaling other Mimics positions on the map.) Mimicking / Hiding All objects that are armless can be possessed by grabbing them with your hand. Press the trigger to use the object as your body. You hide by putting your hands in front of your face, but remember: You can only hide for a limited amount of time! Be smart and use it to get away from the hunters. Movement Well, everything has arms and that’s how you move in the world! You scoot around by propelling yourself with your arms and hands. push yourself away from the ground, similar to a monkey. Grab onto walls with the trigger to hold on, push away from the ground to jump. You can increase your jump by using two hands to push. The movement relies on physics, so you can also wall jump if you time everything right. We definitely recommend Room-Scale VR. Hunters As hunters, your goal is to identify the Mimics in the level, chase them and catch them. Your finger gun fires sticky goo to slow Mimics down and signal them on the map. Mimics can hide from you in object form for a limited time. Mimics Mimics have to play a dangerous hide and seek game. To hide, simply move your hands in front of your face and you become the object you currently possess. Score by high fiving the wall-mounted hands or other mimics. Your flare-finger-gun gives you the ability to point to places in the level for other mimics to see, but the hunters can also see it. The hunters will try to catch you, escape them by running away or by cleverly disguising yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2008480/header.jpg?t=1660055511",
    "Price": 0.0,
    "Developers": "Holocafé",
    "Publishers": "Holocafé",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2008480/ss_5337484019cd9f061b7907a313fdcc01c69101b8.1920x1080.jpg?t=1660055511,https://cdn.akamai.steamstatic.com/steam/apps/2008480/ss_3c4d3e317b0d2097b1705fa09de9f0e4e9cb12bf.1920x1080.jpg?t=1660055511,https://cdn.akamai.steamstatic.com/steam/apps/2008480/ss_6bc54dfec331e21bd3fd67f30c8c6d6b08fef733.1920x1080.jpg?t=1660055511,https://cdn.akamai.steamstatic.com/steam/apps/2008480/ss_0b32657bff422ffbbe8f78263e4407d5dccff8e1.1920x1080.jpg?t=1660055511,https://cdn.akamai.steamstatic.com/steam/apps/2008480/ss_2603785d93548bd6a54cd43e31912422bcf97f0f.1920x1080.jpg?t=1660055511,https://cdn.akamai.steamstatic.com/steam/apps/2008480/ss_d80033cad9898ece25456e81aa2127ed2b628b38.1920x1080.jpg?t=1660055511",
    "Slug": "everything-has-arms",
    "Meta Title": "Everything Has Arms: Aug 9, 2022, Holocafé and Full Overview",
    "Meta Description": "Looking for information on Everything Has Arms? Check out the release date (Aug 9, 2022), developer insights from Holocafé, and a complete game summary.",
    "Alt Text Image": "Official header image for Everything Has Arms game - Steam 2008480",
    "Canonical URL": "https://gusku.site/game/everything-has-arms",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Everything Has Arms\", \"description\": \"Looking for information on Everything Has Arms? Check out the release date (Aug 9, 2022), developer insights from Holocaf\\u00e9, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Holocaf\\u00e9\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Holocaf\\u00e9\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2008480/header.jpg?t=1660055511\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}