{
    "AppID": 1044720,
    "Name": "Farthest Frontier",
    "Release date": "Aug 9, 2022",
    "About the game": "Protect and guide your small band of settlers to forge a town from untamed wilderness at the edge of the known world. Harvest raw materials, hunt, fish and farm to sustain your advancing town. Produce crafted items for villagers to trade, consume, equip and fight with as you battle for your survival against the elements and outside threats (pacifist mode available for players who do not want to engage in combat). Key Features Harvest, Grow, Craft - Harvest 14 different raw materials from wood, stone and clay, to metal ores, wild herbs, and honey. Grow 17 types of food, including forage items, fish and game, plus 10 food crops, each with different characteristics. Produce 32 crafted items and materials in a multi—tiered economy. Build and Advance - Construct 50 different types of buildings as you grow your town from a fledgling settlement to a bustling city. Your town center and housing will advance through multiple building tiers as the prosperity and desirability of your town increases. Upgrade production buildings to increase efficiency and enable production of more advanced items. Most Detailed Farming System Ever - Strategically select from 10 crops with unique growing characteristics and configure crop rotations to maintain soil fertility, avoid heat and frost damage, and prevent the accumulation of diseases. Cultivate your fields over time, removing weeds and rocks, raising fertility and adjusting soil mixture to achieve maximum crop production to keep your growing population fed. Advanced Town Simulation - Villagers actively live their lives and perform their jobs in real time. Watch as villagers carry goods across town from remote work-sites to be processed into materials and crafted into items. See foods and goods delivered to homes, the trade post or stored for later use. Develop roads, transport wagons and improve storage methods to facilitate the efficient movement of goods through your town and prevent spoilage. Randomly Generated Maps - Farthest Frontier is highly replayable and no game is ever quite the same with beautiful, completely randomized terrain generation and resource distribution. Controls allow players to specify the amount of water or mountains they desire, with extreme maps leading to unique challenges. Idyllic to Brutal - Customizable difficulty options allow players to turn off features like invaders and disease, for a more tranquil experience or max out difficulty to truly test their town-builder prowess. Environmental Interaction - Develop your economy based on which resources are locally abundant and produce items for trade to acquire that which you lack. Erect fencing to keep deer away from crop fields and stop bears from raiding food storage. Manage tree cover to prevent underground water supplies from drying up. Balance the need to clear land for agriculture around vital natural resources like wild growing medicinal plants and forage items. All Them Old-Timey Diseases! - Ensure your villagers have clean water to stop outbreaks of dysentery and cholera. Collect berries and plant greens to avoid scurvy and ensure a healthy diet. Make sure villagers are properly shoed and clothed to reduce chances of contracting tetanus, rabies or frostbite. Build a healer’s house to quarantine the infected and provide herbs and medicine for treatment. Manage rodent populations by collecting waste, securely storing food and employing rat catchers to ward off the feared bubonic plague. Fend Off Would-Be Invaders - Choose to play on pacifist and avoid combat altogether or engage with varying levels of raider difficulty to raise the stakes for your town’s survival. Progress from wood palisades to stone walls, build towers and barracks, recruit and equip soldiers in the defense of your town as rising prosperity attracts the attention of raiders and foreign armies seeking plunder. Crate Entertainment is a fully independent developer and publisher located outside Boston, MA. Crate is best known for the critically-acclaimed action-RPG, Grim Dawn. Join the Crate community and help shape the future of development of our games and be among the first to receive news about Farthest Frontier by participating in polls and discussions on our forum.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1044720/header.jpg?t=1660235278",
    "Price": 29.99,
    "Developers": "Crate Entertainment",
    "Publishers": "Crate Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_e1ccf51e3f514b8cd74566dc4f5733127f2bfc85.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_a8bc77cfb2f5184b70e5eeefbe6d0cb23219cbba.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_630013acd6eec95b55db558765faf85caeec6472.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_f046aa92e9897bb54a9da2cebc37fb54009b2d24.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_0e185275769f25c1a06341c2027fc0dc1873cbb1.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_2d3e9332e534911c54bbf568612d7b70a222c9a3.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_42b666f84ea2767dffdc92463c6221c54fb28e3e.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_691b312ec962a150ea807fc28e896b8bf08d941c.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_1ade73f65c28426d51044bc3b0b330a9af8d43f6.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_87544561d73402108ac1a81189759690efa3635d.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_16e7ce88c439172c4404d5b93b8c8489f96032c0.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_7cd93466525fc86c9cba526a5ab356a2a2139d71.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_61754addb74f673f5089cc6f8caa15f4afec3337.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_3474df49b311daae1ac5f3853d80ffb52540afd7.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_fdd54849ddce1d2d26ba0ae6cff518cacb9889df.1920x1080.jpg?t=1660235278,https://cdn.akamai.steamstatic.com/steam/apps/1044720/ss_64247a8e4240ba3ded71353f516604c7804e9bdc.1920x1080.jpg?t=1660235278",
    "Slug": "farthest-frontier",
    "Meta Title": "Farthest Frontier: Aug 9, 2022, Crate Entertainment and F...",
    "Meta Description": "Looking for information on Farthest Frontier? Check out the release date (Aug 9, 2022), developer insights from Crate Entertainment, and a complete game...",
    "Alt Text Image": "Official header image for Farthest Frontier game - Steam 1044720",
    "Canonical URL": "https://gusku.site/game/farthest-frontier",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Farthest Frontier\", \"description\": \"Looking for information on Farthest Frontier? Check out the release date (Aug 9, 2022), developer insights from Crate Entertainment, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crate Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crate Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1044720/header.jpg?t=1660235278\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}