{
    "AppID": 1815630,
    "Name": "Fences 4",
    "Release date": "Aug 24, 2022",
    "About the game": "Features Create shaded areas to organize your desktop Create rules to automatically organize your desktop icons Peek brings your fences to the top for instant access Use folder portals to quickly access files in Explorer Swipe between multiple pages of fences Customize “show desktop” hotkey functionality Works with Windows 10 and 11 Organize your PC by automatically placing shortcuts and icons into resizable shaded areas on your desktop called fences. Designed to work for both Windows 10 and Windows 11, Fences’ vast options for customization are what makes it the world’s most popular desktop enhancement. Peek at your fences for instant access Bring your files, folders, and applications to the top of all your windows with Peek. By pressing Winkey + Space, you can instantly access everything you need inside of a fence without leaving your current application. Create portals for your most used apps and files Stop searching through dozens of icons to find the folder you need. Create a portal that mirrors the contents of a folder onto your desktop within a fence, enabling quick access to its files. Eliminate clutter from your desktop Roll up your fences by double-clicking on the title bar to save space on your desktop. To reveal your fence again, move your mouse over the title bar or double-click it again to view all of the fence’s icons normally. Create multiple pages on your desktop Quickly swipe between pages on your desktop, allowing you to segment different categories of files, folders, and fences into their own unique areas. To change pages, simply take your mouse cursor to the edge of your screen, then click and drag to view a new page of fences. This feature provides greater control over how you can organize your favorite programs, documents, websites, and much more. Quickly hide your fences Instantly clean up your desktop with a simple double-click on any blank area. The icons and fences will disappear, leaving you with a distraction-free desktop. Another double-click will return them to the desktop. If you have specific fences or folders you’d like to exclude from hiding, you can adjust those within the settings.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1815630/header.jpg?t=1661360338",
    "Price": 19.99,
    "Developers": "Stardock",
    "Publishers": "Stardock",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1815630/ss_bb11f405b9a7dc8f50498d88e1546c2d9b3678a1.1920x1080.jpg?t=1661360338,https://cdn.akamai.steamstatic.com/steam/apps/1815630/ss_e2700692cd4369b72f1cbdb023c15fe9547dfd01.1920x1080.jpg?t=1661360338,https://cdn.akamai.steamstatic.com/steam/apps/1815630/ss_8084588f4be9a6914782510225dbfde119641360.1920x1080.jpg?t=1661360338,https://cdn.akamai.steamstatic.com/steam/apps/1815630/ss_eb7a4d5f07c5841de94c71c55091145c2fede1bc.1920x1080.jpg?t=1661360338,https://cdn.akamai.steamstatic.com/steam/apps/1815630/ss_0107c375695d96a73cdab18bf16a3111ac885622.1920x1080.jpg?t=1661360338",
    "Slug": "fences-4",
    "Meta Title": "Fences 4: Aug 24, 2022, Stardock and Full Overview",
    "Meta Description": "Looking for information on Fences 4? Check out the release date (Aug 24, 2022), developer insights from Stardock, and a complete game summary.",
    "Alt Text Image": "Official header image for Fences 4 game - Steam 1815630",
    "Canonical URL": "https://gusku.site/game/fences-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fences 4\", \"description\": \"Looking for information on Fences 4? Check out the release date (Aug 24, 2022), developer insights from Stardock, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stardock\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stardock\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1815630/header.jpg?t=1661360338\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}