{
    "AppID": 1991860,
    "Name": "Force of Warships: Battleship Games",
    "Release date": "Aug 9, 2022",
    "About the game": "Force of Warships is the dynamic online ship battles! The game will give you a valuable experience of participation in military battles! Become the captain of a real battleship and fight against players from all over the world in a dynamic shooter. Steer real ships of the after wartime and the present. Challenge yourself as a captain and send warship of any class to the sea. Use guns, torpedoes, artillery and missiles! Action army games begin! Lead an exciting 3D sea battle, play online with friends against enemies and win blitz epic battles against destroyers, cruisers and battleship! Fight together with players from all over the world, feel the tension of naval combat and wars of ships! Win the Ultimate Victory! ONLINE PvP ACTION GAME Team up and fight multiplayer games with real captains from all over the world. PvP fights will determine the best navy! Prove that you are the best captain in this war game and your fleet is invincible. VARIOUS SHIPS FROM AROUND THE WORLD Drive legendary and modern warships from all over the world from the after wartime and the present! TACTICAL ADVANTAGE Choose the warship that suits best your battle style. All ships will be under your control! And remember, the sea does not forgive mistakes! WEAPON OF VICTORY Use all the weapons of the warship - torpedoes, missiles, guns, and the latest equipment to complete the combat missions of the navy. DEVELOP AND IMPROVE YOUR FLEET Upgrading ships and weapons plays an important role in achieving victory in naval battles. Ship upgrade systems allow your warship to show the highest level in the battle! The system of upgrades and perks will allow you to create a unique fleet for a military shooter. Upgrade your engine, hull and weapons. COOL AWARDS AND TOURNAMENTS Participate in weekly tournaments, win prizes and awards! Complete daily quests and challenges for even greater rewards! GREAT GRAPHICS Modern graphics, excellent special effects, beautiful arenas for sea fight and the irreplaceable spirit of sea battles will allow you to enjoy every second of the battle in the war game! Give the order and a battleship will complete the task! An exciting 3D war shooter will take you to the atmosphere of a naval battle blitz! Compete with your friends for military glory! Ready for the combat blitz? Join Force of Warships - an online military simulator game that will surpass all expectations. This is for fans of PvP, naval combat and everyone who loves action, military and naval shooters. What are you waiting for, captain?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1991860/header.jpg?t=1660036698",
    "Price": 0.0,
    "Developers": "XDEVS LTD",
    "Publishers": "XDEVS LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1991860/ss_5d432faf010921c206d5c744e941147dbdd360b0.1920x1080.jpg?t=1660036698,https://cdn.akamai.steamstatic.com/steam/apps/1991860/ss_7073f8323ad5fb0809deac0ff7124a5019eb0aca.1920x1080.jpg?t=1660036698,https://cdn.akamai.steamstatic.com/steam/apps/1991860/ss_f600ba7b912744f652efa3694d6d74dac1ecf922.1920x1080.jpg?t=1660036698,https://cdn.akamai.steamstatic.com/steam/apps/1991860/ss_8dc5fd84d232bee9a572d348fa17bce2334258eb.1920x1080.jpg?t=1660036698,https://cdn.akamai.steamstatic.com/steam/apps/1991860/ss_e9f088189c225e8801dabe5671553b879db2e65e.1920x1080.jpg?t=1660036698",
    "Slug": "force-of-warships-battleship-games",
    "Meta Title": "Force of Warships: Battleship Games: Aug 9, 2022, XDEVS L...",
    "Meta Description": "Looking for information on Force of Warships: Battleship Games? Check out the release date (Aug 9, 2022), developer insights from XDEVS LTD, and a compl...",
    "Alt Text Image": "Official header image for Force of Warships: Battleship Games game - Steam 1991860",
    "Canonical URL": "https://gusku.site/game/force-of-warships-battleship-games",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Force of Warships: Battleship Games\", \"description\": \"Looking for information on Force of Warships: Battleship Games? Check out the release date (Aug 9, 2022), developer insights from XDEVS LTD, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"XDEVS LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XDEVS LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1991860/header.jpg?t=1660036698\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}