{
    "AppID": 1866180,
    "Name": "Hooked on You: A Dead by Daylight Dating Sim™",
    "Release date": "Aug 3, 2022",
    "About the game": "You wake up on the beach of a strange island. Your memory, wiped. Your pockets, empty. Not another living soul in sight. Except of course the four lusty Killers playing volleyball in the sand nearby… Who are you? How did you get here? Why is the ocean talking to you? Unravel these mysteries and find out what makes each character tick as you flirt, banter, and woo your way into their hearts in this darkly comedic adventure. But choose your words wisely. These Killers are passionate and powerful in equal measure, and this seductive dream can become a nightmare quicker than you think. An All-Inclusive Getaway Get drawn into a choice-driven dating sim, where Killers become lovable, nothing is quite what it seems, and your Dead by Daylight fantasies can finally come true. Order a tropical cocktail, take a long sip, and quench that thirst. Sun &amp; Shade Did you know The Entity has a beach Realm? Not many do. Explore multiple locations, both spooky and serene, on this island paradise at the edge of eternity. Romance different characters with each playthrough to visit new, exciting areas as you enjoy cameos from a few familiar faces along the way. If Looks Could Kill Flirt with 4 completely different, yet equally tantalizing Dead by Daylight Killers. Choose the right words to help them shed their inhibitions, while unlocking deeply intimate sides of their personalities. Earn multiple unique endings for each Killer, from passionate true love, to platonic friendship, to bitter loathing. Just like real dating! Busy Fingers Prove yourself to your paramour by mastering a series of flirtatious minigames to advance the plot. Answer quizzes, hunt for treasure, carve meat, and more, earning praise or scorn based on your performance. Charmed, I’m Sure Buy Hooked on You: A Dead by Daylight Dating Sim™ to unlock two exclusive gifts in Dead by Daylight including the Captured Heart charm , and the shark-chewed Surf Survivor outfit for Jake Park. ------------------------------- WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES - READ THIS NOTICE BEFORE PLAYING A very small percentage of people may experience epileptic seizures or blackouts when exposed to certain kinds of flashing lights or light patterns. These persons, or even people who have no history of seizures or epilepsy, may experience epileptic symptoms or seizures while playing video games. If you or any of your relatives has an epileptic condition or has had seizures of any kind, consult your physician before playing any video game. IMMEDIATELY DISCONTINUE use and consult a physician if you or your child experience any of the following symptoms: dizziness, altered vision, eye or muscle twitching, involuntary movements, loss of awareness, disorientation, or convulsions. Parents should watch for or ask their children about the above symptoms. You may reduce risk of photosensitive epileptic seizures by taking the following precautions: sit farther from the screen, use a smaller screen, play in a well-lit room, do not play when you are drowsy or fatigued.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1866180/header.jpg?t=1659559981",
    "Price": 9.99,
    "Developers": "Psyop",
    "Publishers": "Behaviour Interactive Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_534fcf29e297f176528169ff93fb7fb4e6ed8a63.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_db8a9d74e07604a21140e4a758829b8a4a93ff88.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_362875d39bc9db103d72431bdfa70f8a00034515.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_b90dfeee4305b2ebc08bac298f186b469907ccb4.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_7556c6320765dbb7b5784c2bf58e3327f09926d2.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_12019015d1b88e62e95dc4fb818225807c3f51c4.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_25285823da89b982e797db7f9c67dedb43c548a3.1920x1080.jpg?t=1659559981,https://cdn.akamai.steamstatic.com/steam/apps/1866180/ss_7926791c66bfbd626e5b4d6cf7aa83c2305c21ed.1920x1080.jpg?t=1659559981",
    "Slug": "hooked-on-you-a-dead-by-daylight-dating-sim",
    "Meta Title": "Hooked on You: A Dead by Daylight Dating Sim™: Aug 3, 202...",
    "Meta Description": "Looking for information on Hooked on You: A Dead by Daylight Dating Sim™? Check out the release date (Aug 3, 2022), developer insights from Psyop, and a...",
    "Alt Text Image": "Official header image for Hooked on You: A Dead by Daylight Dating Sim™ game - Steam 1866180",
    "Canonical URL": "https://gusku.site/game/hooked-on-you-a-dead-by-daylight-dating-sim",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hooked on You: A Dead by Daylight Dating Sim\\u2122\", \"description\": \"Looking for information on Hooked on You: A Dead by Daylight Dating Sim\\u2122? Check out the release date (Aug 3, 2022), developer insights from Psyop, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Psyop\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Behaviour Interactive Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1866180/header.jpg?t=1659559981\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}