{
    "AppID": 1198850,
    "Name": "How to Build a Magnificent Kingdom",
    "Release date": "Aug 26, 2022",
    "About the game": "A tragic event has occurred in the once-prosperous Avon Kingdom, a massacre known to most only as the 'Calamity King' incident. The once benevolent regent, King Regnault, went mad and started killing all among his subjects who weren't able to flee the country in time. Now the country lies in tatters with nothing left in its coffers and a pitiful four citizens to its name: Princess Ariadne, who just recovered from a grave illness, her maid Luluka, Knight Commander Grey, and you, a mere Knight Apprentice. Shocked to find the country in ruins one morning, Ariadne doesn't believe for a second the Regnault she knew and loved would be capable of committing such atrocities while she was sick and bedridden. Her first decision as the new queen of Avon requires all her strength and courage, because it's as reckless as it is preposterous. She wants to restore her beloved kingdom to its former glory and clear her father's name. It won't be easy—far from it—but with the help of some good old pillaging and the support of a couple of adventurers, you begin your arduous journey to restore Avon and unveil the mysteries behind its tragic downfall. Getting an entire kingdom back on its feat is no easy task. You'll have to allocate resources and invest in research in order to improve food production, the economy, crafting, technology, and much more. Each upgrade will help the kingdom thrive and make your people stronger, furthering you along the path of restoration. Diplomacy can't always be the answer though, and fighting will be inevitable at times. Control teams of up to eight characters in real-time top-down combat with a staggering breadth of AI customization, available skills, weapon choice, and special abilities to change the tide of battle. With a massive cast comprised of unique melee fighters, tanks, archers, magic users, and healers, you can pick and choose your favorite formation for each battle. Will you be able to withstand the force of the increasingly powerful waves of enemies? As you all work together toward your ultimate goal, you'll get to know each and every one of the supporters of Avon's restoration. Employ the characters in battle to deepen their bonds with you and each other, giving you access to hundreds of unique scenes that explore their personalities and relationships, award you with experience and resources, and grant unique weapons and character-specific abilities. A Kingdom to Rebuild Talk and fight your way across the world to earn resources and reinvest them in the kingdom to grow richer and stronger. Each upgrade will provide benefits in one or more aspects of the gameplay: active and passive income, experience gain, stat increases for your party, and more. Massive Real-time Battles Take direct control of the party leader and let the finely customizable AI guide up to 7 more characters in battle in large-scale real-time skirmishes against hundreds of enemies. Fine-tune every character's equipment and skills until you find a combination that best suits you. More Than 20 Playable Characters You'll need heroes to rebuild the kingdom, and this game has plenty to offer. Discover the personalities and history of over 20 unique and fleshed-out characters by fighting alongside them and deepening your bonds. Replayability and Difficulty Do you feel too powerful after grinding for a tough boss? No problem! Each stage can be replayed indefinitely and with four different difficulty levels, ranging from Normal to Lunatic, the latter of which is sure to provide a tough challenge to even the most seasoned players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1198850/header.jpg?t=1661604381",
    "Price": 22.49,
    "Developers": "Irisfield",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_f38250831ec62c1742f738edb58ce69ddcef62bb.1920x1080.jpg?t=1661604381,https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_c4c7f9e33ec450504999b06dee4f9bf104672958.1920x1080.jpg?t=1661604381,https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_e7891a8366049a823d1167f874da7267f050a33d.1920x1080.jpg?t=1661604381,https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_97ff87b28a701ca0c5b74cb56d80e2d5bf98d4ff.1920x1080.jpg?t=1661604381,https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_4d63bedc171367ca06267c5cb6ddae6069b97ce0.1920x1080.jpg?t=1661604381,https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_65aedf2b5af9b6e320f1b19022decd3b47ee1d52.1920x1080.jpg?t=1661604381,https://cdn.akamai.steamstatic.com/steam/apps/1198850/ss_99833310610046f8a237e595ab87e7b02b87ca7c.1920x1080.jpg?t=1661604381",
    "Slug": "how-to-build-a-magnificent-kingdom",
    "Meta Title": "How to Build a Magnificent Kingdom: Aug 26, 2022, Irisfie...",
    "Meta Description": "Looking for information on How to Build a Magnificent Kingdom? Check out the release date (Aug 26, 2022), developer insights from Irisfield, and a compl...",
    "Alt Text Image": "Official header image for How to Build a Magnificent Kingdom game - Steam 1198850",
    "Canonical URL": "https://gusku.site/game/how-to-build-a-magnificent-kingdom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"How to Build a Magnificent Kingdom\", \"description\": \"Looking for information on How to Build a Magnificent Kingdom? Check out the release date (Aug 26, 2022), developer insights from Irisfield, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Irisfield\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1198850/header.jpg?t=1661604381\", \"offers\": {\"@type\": \"Offer\", \"price\": 22.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}