{
    "AppID": 2114190,
    "Name": "Interstellar Turtle Legend",
    "Release date": "Aug 27, 2022",
    "About the game": "The universe is at war, and you're just a bastard. What choice will you make: Survive through the cracks and survive, or be invincible and kill the Quartet? Can you still hold on to your heart? This is a sea-watching type game that simulates an absurd and realistic universe in which everything is controlled by AI, and the player is just an observer. In the game, the player can move the field of view, zoom and rotate the screen, adjust the speed of the passage of time, and view the detailed information of the object, but cannot make changes to the progress of the game. There are six factions in the universe: the Galactic Commune, the Guardian Council, the Xinghai Group, the Second Empire, the General Alliance, and the Hyperspace Zombies. They are at war. Each faction uses energy to build buildings: docks, turrets, reactors, and command centers. Docks can spawn ships, turrets can fire cannonballs, reactors can create energy, and command centers can expand territory. There is a character system in the game. Each building and ship has a corresponding position: a shipbuilder in the dock, a gunner in a turret, a generator in a reactor, and a general in the command center. As buildings or ships are created and destroyed, people are promoted, demoted, and even killed. At the end of the game, the experiences of the 5 most prolific characters will be compiled into a celebrity resume. At the start of the game, a Travelling Bastard with a neutral faction will spawn, and it will not attempt to attack anything. Wang Ba travels through the universe, witnessing the rise and fall of forces, and making friends with people of different professions. At the end of the game, what the bastard saw and heard during his travels will be compiled into a bastard's diary. Note: The 'Celebrity Resume' and 'Bad Diary' mentioned above will only be generated in the game folder in txt format, and players need to open and view them manually. In the game, music will be played when a certain faction wins: People's Army Loyal to the Party is played when the Galaxy Commune is victorious, a toast song is played when the Guardian Council is victorious, Marching Through Georgia is played when the Xinghai Group is victorious, and Li Zhongtang is played when the Second Empire is victorious, Battle Hynm of Republic is played when the general alliance wins, and It's a Burning Memory is played when the Hyperzombies win. This is a remake of my previous game 'Space Combat Simulator' (published on itch.io). My plan for future updates is to increase the types of ships and turrets, and add new weapons and damage effects. This game is made by me with c++ and windows api, and does not use an off-the-shelf game engine. All fonts, textures and music are made by myself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2114190/header.jpg?t=1661696718",
    "Price": 0.99,
    "Developers": "HappyHorse Studio",
    "Publishers": "HappyHorse Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2114190/ss_91d3defec8568e31731190ab7a5044ff1dd63a2f.1920x1080.jpg?t=1661696718,https://cdn.akamai.steamstatic.com/steam/apps/2114190/ss_1dcdcb5b750cd3eb0f3ee2e7c77f685ec89f92cd.1920x1080.jpg?t=1661696718,https://cdn.akamai.steamstatic.com/steam/apps/2114190/ss_d8edbc3bcaea0e4c90bcf81dc4239fb43594169d.1920x1080.jpg?t=1661696718,https://cdn.akamai.steamstatic.com/steam/apps/2114190/ss_30fd76d9004e6050af2253fb9961afe954d9ebd3.1920x1080.jpg?t=1661696718,https://cdn.akamai.steamstatic.com/steam/apps/2114190/ss_831715617aa0652b3ff1ca53835a0646db81d391.1920x1080.jpg?t=1661696718",
    "Slug": "interstellar-turtle-legend",
    "Meta Title": "Interstellar Turtle Legend: Aug 27, 2022, HappyHorse Stud...",
    "Meta Description": "Looking for information on Interstellar Turtle Legend? Check out the release date (Aug 27, 2022), developer insights from HappyHorse Studio, and a compl...",
    "Alt Text Image": "Official header image for Interstellar Turtle Legend game - Steam 2114190",
    "Canonical URL": "https://gusku.site/game/interstellar-turtle-legend",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Interstellar Turtle Legend\", \"description\": \"Looking for information on Interstellar Turtle Legend? Check out the release date (Aug 27, 2022), developer insights from HappyHorse Studio, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"HappyHorse Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HappyHorse Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2114190/header.jpg?t=1661696718\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}