{
    "AppID": 1372110,
    "Name": "JoJo's Bizarre Adventure: All-Star Battle R",
    "Release date": "Sep 1, 2022",
    "About the game": "Well known for its charismatic heroes, striking art style, and unforgettable catch phrases (“Yare yare daze…”), another installment of JoJo’s Bizarre Adventure is coming! JoJo's Bizarre Adventure: All-Star Battle R! • Stunning visuals authentic to Hirohiko Araki’s Style JoJo’s Bizarre Adventure: All-Star Battle R captures the over-the-top art style that is vintage JoJo, allowing you to experience the JoJo universe with powerful imagery as if Hirohiko Araki's manga had come to life. Now you too can freely move the characters created by Hirohiko Araki with your own hands, and feel as if you’re inside the manga where graphics and text meet to invoke the characteristic “ゴゴゴゴゴ“. • 50 playable characters from all JoJo arcs Jonathan Joestar, Jotaro Kujo, DIO, Jolyne Cujoh, and other characters from JoJo's Bizarre Adventure gather across multiple generations! With 50 playable characters from all arcs, you can experience popular battles from each story, and see characters from different universes interact for the first time! • A variety of game modes JoJo's Bizarre Adventure: All-Star Battle R consists of All Star Battle Mode, Arcade Mode, Online Mode, Versus Mode, Practice Mode, and Gallery Mode. The main mode, All Star Battle Mode, features not only clashes between characters from the original game, but also brand new battles that are unique to All-Star Battle R. You can play through over 100 battles with various settings and conditions. All Star Battle Mode also offers special cosmetic skins for characters and unique illustrations that can be enjoyed in gallery mode. • How the game has evolved from the original All Star Battle Based on the All Star Battle system released in 2014, the game design of JoJo’s Bizarre Adventure: All-Star Battle R reinvigorates the experience with adjustments to the fighting tempo and the addition of hit stops and jump dashes. With new audio recordings from the Part 6 anime voice actors, the full atmosphere of the animated series is realized. Both fans who have played the original All Star Battle and newcomers will be able to enjoy the experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1372110/header.jpg?t=1662126357",
    "Price": 49.99,
    "Developers": "CyberConnect2 Co. Ltd.",
    "Publishers": "Bandai Namco Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1372110/ss_f465973fdd196f2d7b3725e0bc3f485c21f65849.1920x1080.jpg?t=1662126357,https://cdn.akamai.steamstatic.com/steam/apps/1372110/ss_64e3e379d761dcf7061d6ac996868d0df9294901.1920x1080.jpg?t=1662126357,https://cdn.akamai.steamstatic.com/steam/apps/1372110/ss_ed05ffcea4f41632e7ecbc05a2a6013ed7e66df7.1920x1080.jpg?t=1662126357,https://cdn.akamai.steamstatic.com/steam/apps/1372110/ss_efcec6f942fe7670fdda3d6c6eb5ecba445d88aa.1920x1080.jpg?t=1662126357,https://cdn.akamai.steamstatic.com/steam/apps/1372110/ss_daec258b6578597bfbc7c7df71a94bbb87917b94.1920x1080.jpg?t=1662126357",
    "Slug": "jojo-s-bizarre-adventure-all-star-battle-r",
    "Meta Title": "JoJo's Bizarre Adventure: All-Star Battle R: Sep 1, 2022,...",
    "Meta Description": "Looking for information on JoJo's Bizarre Adventure: All-Star Battle R? Check out the release date (Sep 1, 2022), developer insights from CyberConnect2 ...",
    "Alt Text Image": "Official header image for JoJo's Bizarre Adventure: All-Star Battle R game - Steam 1372110",
    "Canonical URL": "https://gusku.site/game/jojo-s-bizarre-adventure-all-star-battle-r",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"JoJo's Bizarre Adventure: All-Star Battle R\", \"description\": \"Looking for information on JoJo's Bizarre Adventure: All-Star Battle R? Check out the release date (Sep 1, 2022), developer insights from CyberConnect2 ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberConnect2 Co. Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bandai Namco Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1372110/header.jpg?t=1662126357\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}