{
    "AppID": 1986040,
    "Name": "Kingdom Draw",
    "Release date": "Aug 2, 2022",
    "About the game": "A hybrid of challenging turn-based strategy and customizable card collection gameplay set in a medieval fantasy universe. Campaigns Gather your armies, ready your spells and delve into an engaging single player campaign. Complete missions for each of the 4 factions to gain more cards and immerse yourself in the unique story of each of Humans, Undead, Orcs, and Elves. With more chapters released each season, unravel the epic story arc underpinning the Kingdom Draw universe. Online Ladder Play Pit yourself against other players from around the world with cross-platform ladder play. Do you have what it takes to ascend the ladder with every victory and reap your rewards? At the end of each season, earn bonus rewards for how high you progressed up the ladder. Make it to the Titan league to have your alias displayed (and glorified for all time) in the Hall of Fame. Deck Building Buy randomised card packs with gems earned through ladder play and campaigns; or redeem victory tokens to obtain specific cards of your choice. Build your own custom, synergising decks to dominate your opponents and become a Titan of Kingdom Draw. With 185 distinct cards to collect, and more cards being released each season, you can always craft new variations to trial out in battle. Turn-based Strategy Hone your turn-based strategy skills. Matches in Kingdom Draw take place on a hexagonal grid where you play army, support, and beast cards on the map. Strategically control locations to earn more resources, take advantage of terrain, and be the first to destroy your opponent’s castle. Use power cards to decimate your enemies, alter your cards’ combat effectiveness, and modify the terrain. Friendly Matches Looking for something more casual? Stick with the devil you know and add friends to challenge them to friendly battles. Friendly battles do not alter your ladder ranking or provide rewards, so you can trial your deck creations in a more relaxed arena. Cross Platform Link your account across multiple platforms, allowing you to continue playing wherever you are. Available on PC, MAC, Linux, Android, Chromebooks, and IOS.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1986040/header.jpg?t=1659439389",
    "Price": 0.0,
    "Developers": "Eternal Technics",
    "Publishers": "Eternal Technics",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1986040/ss_aafd1d4842f9528151a1448056d0c6c0f3929da3.1920x1080.jpg?t=1659439389,https://cdn.akamai.steamstatic.com/steam/apps/1986040/ss_6e53ae0a8ba9b256307973bff97546e1f47422b7.1920x1080.jpg?t=1659439389,https://cdn.akamai.steamstatic.com/steam/apps/1986040/ss_aff73d259372da557b2cd7599714168abaa3bf29.1920x1080.jpg?t=1659439389,https://cdn.akamai.steamstatic.com/steam/apps/1986040/ss_0e6ddd7604028b8fe5d1842a3fffa98a687af65d.1920x1080.jpg?t=1659439389,https://cdn.akamai.steamstatic.com/steam/apps/1986040/ss_0423d23f885871dae5e229bd31c3650fe0604b49.1920x1080.jpg?t=1659439389",
    "Slug": "kingdom-draw",
    "Meta Title": "Kingdom Draw: Aug 2, 2022, Eternal Technics and Full Over...",
    "Meta Description": "Looking for information on Kingdom Draw? Check out the release date (Aug 2, 2022), developer insights from Eternal Technics, and a complete game summary.",
    "Alt Text Image": "Official header image for Kingdom Draw game - Steam 1986040",
    "Canonical URL": "https://gusku.site/game/kingdom-draw",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kingdom Draw\", \"description\": \"Looking for information on Kingdom Draw? Check out the release date (Aug 2, 2022), developer insights from Eternal Technics, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eternal Technics\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eternal Technics\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1986040/header.jpg?t=1659439389\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}