{
    "AppID": 2079960,
    "Name": "Light",
    "Release date": "Aug 19, 2022",
    "About the game": "Current state of the game 1. My game is not completed, but the sound is not completed, so the price is very low. But the puzzle solving elements and the plot elements are all the focus of my development at this stage, so the overall process of the game is no problem. Players who want to experience the puzzle can start quickly. 2. The game is difficult and is not friendly to novice players. I will publish a tutorial this week to help you pass the customs smoothly. 3. In the later stage of the game, I will gradually update the art, sound effects and background music, This process will be very slow because I have a job. 4. I hope everyone will continue to pay attention to my game and I will absorb and adopt your opinions. What is the general plot of the game Roughly narrate the story of the Syrian beach boy escaping from his inner world. What kind of work is this The game is a silent black-and-white anti war game. It is a 2D puzzle game without text introduction. (silence is what I want to achieve the effect of silent film. In fact, the main reason is that I don't have the money to make sound effects.) How long and difficult is the game The game itself needs half an hour to pass the customs as soon as it knows all the puzzle solving methods, and new players need three hours or more as soon as possible. The difficulty of the game is relatively simple. Compared with inside, the game is slightly simpler and the length of the game is similar. How is the game played The game uses WASD on the keyboard to move, space jump, R_ CTRL interaction, f turns on the flashlight. When a player encounters a specific NPC in the game, he can press f to control the NPC to help him pass the level. When a player encounters a specific level in the game, he can press f to obtain the pause time, blink and time reversal. Note: these games will only appear at a specific level, which is closely combined with the plot. About whether the game will be updated First of all, the game art is a little rough and there is no sound effect, which is not very friendly to the player's experience. Therefore, I will optimize these aspects and bugs in the future. However, it depends on the sales volume in the early stage. If my expenses can be guaranteed, I will continue to update it. If you have any ideas and opinions, please send them to my email. I will respond positively and absorb your suggestions. If you don't like this game, what should you do? You can post bad comments in the steam comment area and submit a refund application to steam customer service",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2079960/header.jpg?t=1661090877",
    "Price": 2.99,
    "Developers": "individual",
    "Publishers": "individual",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_c9ba7124c8db80cc69a0a613330d4dfa642a89d0.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_b85d3af1c14d835e9950dc1d8c4ded501a2a5c50.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_a415a0c8e87e8c6d7c29dc2937c315b5ed520758.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_cd6069771e3951a9c938d1684aeeeef47dc740f4.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_4ebcaf315a9ae711975f500c76694dc7dfbd2c18.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_0684e81a01bb64c26c860e1c91c0cdb7a1458626.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_c431335354fd64b71db0c64e58d9369ef4edfc50.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_3fe2c31b9bc3339ca457132f4d9bf4bf2ccca379.1920x1080.jpg?t=1661090877,https://cdn.akamai.steamstatic.com/steam/apps/2079960/ss_fde3bc0f0d1c15afe5ae226d120668e37691ede7.1920x1080.jpg?t=1661090877",
    "Slug": "light",
    "Meta Title": "Light: Aug 19, 2022, individual and Full Overview",
    "Meta Description": "Looking for information on Light? Check out the release date (Aug 19, 2022), developer insights from individual, and a complete game summary.",
    "Alt Text Image": "Official header image for Light game - Steam 2079960",
    "Canonical URL": "https://gusku.site/game/light",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Light\", \"description\": \"Looking for information on Light? Check out the release date (Aug 19, 2022), developer insights from individual, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"individual\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"individual\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2079960/header.jpg?t=1661090877\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}