{
    "AppID": 1760250,
    "Name": "Madden NFL 23",
    "Release date": "Aug 18, 2022",
    "About the game": "Play your way into the history books in Madden NFL 23. Control your impact with every decision in all-new ways. Call the shots in Franchise with free agency and trade logic updates, play your way into the history books in Face of the Franchise: The League, and assemble the most powerful roster in all of Madden Ultimate Team™. Face of the Franchise: The League The League drops you into your fifth NFL season at a skill position of your choice (QB, WR, RB, CB, MLB), and you’re seeking a fresh start with a new team. Negotiate a 1-year “prove-it” contract with one of 32 NFL teams, and show out with great on-field performance to earn rewards and level up. The addition of New Drive Goals and Drive Summaries allows you to tweak your experience throughout a game and get feedback and rewards based on how well you play. Get performance boosts from weekly activities and training between games while Madden Ratings Adjustor Chad Johnson guides your career development by providing ratings updates as you strive for the highest level of prestige on your Road to 99. Will your NFL career rank among the all-time greats? It’s up to you. Franchise Plan and strategize like an NFL head coach with refined scouting, staff management, and weekly strategy features to take your Franchise to the top. New athlete motivations like team location and salary demands factor into contract negotiations and add to the drama of NFL free agency within Franchise. Updated Trade Logic AI represents the value of star players more accurately for fair and more realistic offers. Madden Ultimate Team Develop your dream fantasy roster of current NFL superstars, Hall of Fame legends, and more. Always have something to play for with the first-ever Field Pass challenge and reward tracker in Madden Ultimate Team. Play to earn MUT Champions entry tokens and choose to compete at your convenience. Simplified Set building lets you navigate your content binder more effectively so you can focus on improving your Ultimate Team roster all season. This game includes optional in-game purchases of virtual currency that can be used to acquire virtual in-game items, including a random selection of virtual in-game items.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1760250/header.jpg?t=1660915748",
    "Price": 59.99,
    "Developers": "Tiburon",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1760250/ss_2942d299e617a185f31962732ebe6785f2fdae26.1920x1080.jpg?t=1660915748,https://cdn.akamai.steamstatic.com/steam/apps/1760250/ss_42743736a2e27ade660c2d08c17955f2a131be52.1920x1080.jpg?t=1660915748,https://cdn.akamai.steamstatic.com/steam/apps/1760250/ss_e7658dc3c3041e528cf8a5d19819e0966e9ff923.1920x1080.jpg?t=1660915748,https://cdn.akamai.steamstatic.com/steam/apps/1760250/ss_79ebc88e14ec32f74278a1e7a864c80aa7d53248.1920x1080.jpg?t=1660915748,https://cdn.akamai.steamstatic.com/steam/apps/1760250/ss_2c96ecf0eee060a41e6997e0f20a9b9eda00f292.1920x1080.jpg?t=1660915748",
    "Slug": "madden-nfl-23",
    "Meta Title": "Madden NFL 23: Aug 18, 2022, Tiburon and Full Overview",
    "Meta Description": "Looking for information on Madden NFL 23? Check out the release date (Aug 18, 2022), developer insights from Tiburon, and a complete game summary.",
    "Alt Text Image": "Official header image for Madden NFL 23 game - Steam 1760250",
    "Canonical URL": "https://gusku.site/game/madden-nfl-23",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Madden NFL 23\", \"description\": \"Looking for information on Madden NFL 23? Check out the release date (Aug 18, 2022), developer insights from Tiburon, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tiburon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1760250/header.jpg?t=1660915748\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}