{
    "AppID": 2093420,
    "Name": "Making Lovers After Stories",
    "Release date": "Aug 26, 2022",
    "About the game": "Making Lovers After Stories contains the official extra stories for Making Lovers. Experience the crazy stories that are happening to your favorite girls! Making Lovers is a Japanese-style visual novel produced by Smee, a Japanese developer of romance VNs. Making Lovers After Stories Karen: Karen is a tsundere who had been derided as childish since she had never slept with a man. But over the course of a year, she had evolved into a super normie! Thanks to local PR brochures featuring the flower shop, Karen's own notoriety has been growing. When the old mixer group reconvenes, it's Karen's turn to look down upon the others as she rambles on and on about her boyfriend. Eventually, they start talking about pregnancy, though the roles may be a little reversed... Saki: In their second year of dating, the weather lady starts off her day with a chance of semen showers from her boyfriend. Her work life and love life are both forecast to be sunny! They might even move into a new home together. But when's the wedding!? Unfortunately for her, there are bigger plans: Project Ham. Eleven months after the Hamjiro Prototype model's completion, children around the nation are crawling the floors to imitate their new hamster idol. Plus, an assassin appears before Saki to deal the final blow! Reina: A whole year after working overseas, the protagonist returns to Japan where his girlfriend Reina is waiting. However, when he arrives later than expected, Reina is quite displeased. In his absence, Reina had gotten three times as many work offers as before. With her boyfriend gone and with no interest in other men, she turned to one thing for sexual release: Eroge! Kazami gets addicted to hypnosis games! Akari roleplays as an eroge little sister! Girls A, B, and C go a little crazy, too! A whole year's worth of love makes a glomping sound once Reina's finally alone with her boyfriend! Mashiro: A year after they started dating, our couple spends another chaotic day working at the Leviathan when a terrifying incident occurs that will later be called 'the Dead of Leviathan'—Homard sprays a suspicious liquid that causes instant infantilization upon contact! The Lobster Virus (AB-705) reveals new sides of the already proactive Mashiro!! But is it a direct effect of the Lobster Virus, or is it just Mashiro's clever acting skills? In any case, after being teased by a cuter-than-usual Mashiro... the protagonist wants a turn to be Mashiro's baby. Probably has nothing to do with the virus! Ako: A year after becoming more than just siblings, Ako's love for her brother rapidly evolves. One day, their father finally puts his foot down and is reborn as Ako Ver.2.0! Who can seduce their brother the best? It's Ako vs. Ako!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2093420/header.jpg?t=1661533189",
    "Price": 16.19,
    "Developers": "Smee",
    "Publishers": "NekoNyan Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_4f1809c170ec805deb511bea271a68e28c6e55c7.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_61db010039907e61d827c2109497360a6948ee9a.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_2470375811cd69c666e35f761adbdf7173d6be1b.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_447127f14b9ae032449288472d8ba3768961029c.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_3f049d2a9cd2bf1afe77b09ec33ce7bbd7c1c803.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_1d74e343ea25d1bfdfd61abb5d96246407f9da80.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_0daa6ab38069a44126f9c0e761a47e8acb256f87.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_f002ef4677d9cf8d7a6fdcddb1812ccb5daccc02.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_2f3e22d03ef0dda53bf27ca68a58a8c218a12c72.1920x1080.jpg?t=1661533189,https://cdn.akamai.steamstatic.com/steam/apps/2093420/ss_902d7580a69e9ea8b33ff63fce75a98e986e44c4.1920x1080.jpg?t=1661533189",
    "Slug": "making-lovers-after-stories",
    "Meta Title": "Making Lovers After Stories: Aug 26, 2022, Smee and Full ...",
    "Meta Description": "Looking for information on Making Lovers After Stories? Check out the release date (Aug 26, 2022), developer insights from Smee, and a complete game sum...",
    "Alt Text Image": "Official header image for Making Lovers After Stories game - Steam 2093420",
    "Canonical URL": "https://gusku.site/game/making-lovers-after-stories",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Making Lovers After Stories\", \"description\": \"Looking for information on Making Lovers After Stories? Check out the release date (Aug 26, 2022), developer insights from Smee, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Smee\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NekoNyan Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2093420/header.jpg?t=1661533189\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}