{
    "AppID": 1945990,
    "Name": "Minion Raid: Epic Monsters",
    "Release date": "Aug 8, 2022",
    "About the game": "Experience epic minion adventures as a trainer in the dungeon You have the power over many little minions - train them to become unbeatable fighting machines and take the scepter in your hands! The monsters of the underworld are looking for a new overlord, but the selection in the dungeon is hard... To leave the arena victorious, you need well-trained minions with special abilities. They also acquire them through evolution. Your trainer skills also play a role: the better you are as a drill instructor, the more dangerous your troops will be in battle. Attack is the best defense: Choose a suitable battle strategy! Depending on the training session and the type of minions, they have different fighting abilities. Some are stronger in attack, some are better in defense. Accordingly, you need a clever battle strategy. Choose the attacking minions for the front lines and the minions with a longer range for the back lines. It's also helpful if you know the strengths and weaknesses of your opponents in the dungeon and choose your battle lineup accordingly. Before facing the competition in epic battles, you can try out your minion squad in test campaigns. But if your lineup is suitable, you can also send your minions directly into the arena for the first PvE battle. Let's see how good your training was... There are also tournaments in this idle fighting game - those are fought in PvP mode. Winning the arena will bring you not only higher prestige, but also gold and a better ranking in the league. If you still don't get enough of battling in the dungeon, then create a guild and work together with other guild members to make fat loot. Fame, glory and gold make you an overlord Your mission in this idle fighting game is to seize the power in the dungeon. You'll achieve this by preparing your minions well for battle. As a trainer, you should also advance your own skills. To do this, you'll use the gold you collect through victories in the arena. Idle missions in the tavern also bring you gold. You can use it to upgrade your trainer skills and those of your minions. Afterwards, you fight your way across the dungeon on a map and encounter different enemies. Use your captured resources wisely while training your minions and you'll soon be able to rule over the monsters of the underworld.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1945990/header.jpg?t=1659943057",
    "Price": 0.0,
    "Developers": "NeoBird",
    "Publishers": "upjers GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_6c42796aff80def38c45bd9c5e8c04d6f457fce3.1920x1080.jpg?t=1659943057,https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_a43863ba61dc6c158a76dc4c8dfae0046cf8ab67.1920x1080.jpg?t=1659943057,https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_c3e627d6f60b5fdedc1758dfd8dc3ed92235f06d.1920x1080.jpg?t=1659943057,https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_8d45add11a51d56045030cb1563609a1b6f8283c.1920x1080.jpg?t=1659943057,https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_a513d013ca19e8c3544eaa22b83879e061000dd4.1920x1080.jpg?t=1659943057,https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_aba7a26314eda65b3ff2352191013656df82da83.1920x1080.jpg?t=1659943057,https://cdn.akamai.steamstatic.com/steam/apps/1945990/ss_0b4cb38b1436397430cc7fe554ec0d47cd9ad18d.1920x1080.jpg?t=1659943057",
    "Slug": "minion-raid-epic-monsters",
    "Meta Title": "Minion Raid: Epic Monsters: Aug 8, 2022, NeoBird and Full...",
    "Meta Description": "Looking for information on Minion Raid: Epic Monsters? Check out the release date (Aug 8, 2022), developer insights from NeoBird, and a complete game su...",
    "Alt Text Image": "Official header image for Minion Raid: Epic Monsters game - Steam 1945990",
    "Canonical URL": "https://gusku.site/game/minion-raid-epic-monsters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Minion Raid: Epic Monsters\", \"description\": \"Looking for information on Minion Raid: Epic Monsters? Check out the release date (Aug 8, 2022), developer insights from NeoBird, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NeoBird\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"upjers GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1945990/header.jpg?t=1659943057\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}