{
    "AppID": 1688320,
    "Name": "OneBit Adventure",
    "Release date": "Aug 19, 2022",
    "About the game": "OneBit Adventure is a casual turn-based roguelike where your adventure is a never-ending travel against rogue monsters. The further you go, the more difficult monsters will become, but the greater the loot and experience. Choose from a variety of classes and build the ultimate class, but be wary, OneBit is a very dangerous place full of untold mysteries. Explore various dungeons to loot and ascend your character to survive even longer! Your movement is your main action which can go 4 directions. Attack enemies by bumping into them and constantly moving that direction to attack. Collect coins to buy various items and once your level 15, you will be able to buy new skills from Wizard Sapius. Use these skills to help you battle through tougher foes and survive longer in your travels. Play as a Warrior, Blood knight, Wizard, Necromancer, Pyromancer, Archer or Thief. Each character has its own unique play style, abilities, and weakness. Unlock their true potential by leveling up which opens the world of active and passive skills that make every class unique. Complete various adventure quests and you can ascend your character to the next level. Prestige at level 100 and you will restart at level 1, but with permanently more skillpoints and more bonus XP. OneBit Adventure is a casual roguelike meaning the game is simple to play, but can be challenging the further you go. You have a limited amount of health and if your health reaches 0, its game over. Classic mode allows you to resurrect to continue while hardcore mode provides the ultimate permadeath experience and harder enemies to fight. The end of an adventure is a new beginning as completed adventures are submitted to Rankings where you can challenge your skills against thousands of others between steps traveled, kills and coins collected with Classic and Hardcore mode! OneBit Adventure is also available on Google Play and App Store with cross-sync compatibility! You can play on Steam and on mobile devices with 1 account. Simply load your account with your username and cloud ID and you are ready to switch between them seamlessly! Change the way OneBit Adventure looks completely with unlockable themes that makes the game fit to your liking. If you love 8-bit roguelikes and are looking for something casual to play, then you should consider OneBit Adventure right now. It's meant to be a simply fun experience where you can level up, play around with different combinations of weapons and skills to reach the furthest. It's a relaxing game, but also has leaderboards to compete with other OneBit players around the world! Features • Infinite world generation with 4+ unique dungeons • 6+ bosses to battle • 7+ classes with unique character builds at level 15 • 30+ unique equipment to use • 40+ monsters to battle • Competitive worldwide leaderboard with premium rewards • Cross platform with Android, iOS, and Steam • Hardcore mode for true roguelike experience",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1688320/header.jpg?t=1661136776",
    "Price": 0.0,
    "Developers": "Galactic Slice, LLC",
    "Publishers": "Galactic Slice, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1688320/ss_e3064a12f251b2007729f5d4e0fec603481ef0e3.1920x1080.jpg?t=1661136776,https://cdn.akamai.steamstatic.com/steam/apps/1688320/ss_e8cf248cbba012f0de6fac5a8cf4bf1b4c8e5abd.1920x1080.jpg?t=1661136776,https://cdn.akamai.steamstatic.com/steam/apps/1688320/ss_7a71fd97057955659124c03f6cc52fbd4d566457.1920x1080.jpg?t=1661136776,https://cdn.akamai.steamstatic.com/steam/apps/1688320/ss_a59e46c0ab370a86ab00e1bde8e8110ab6346380.1920x1080.jpg?t=1661136776,https://cdn.akamai.steamstatic.com/steam/apps/1688320/ss_8350a66443e6660e2777935f162c7210a910e4fa.1920x1080.jpg?t=1661136776",
    "Slug": "onebit-adventure",
    "Meta Title": "OneBit Adventure: Aug 19, 2022, Galactic Slice, LLC and F...",
    "Meta Description": "Looking for information on OneBit Adventure? Check out the release date (Aug 19, 2022), developer insights from Galactic Slice, LLC, and a complete game...",
    "Alt Text Image": "Official header image for OneBit Adventure game - Steam 1688320",
    "Canonical URL": "https://gusku.site/game/onebit-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"OneBit Adventure\", \"description\": \"Looking for information on OneBit Adventure? Check out the release date (Aug 19, 2022), developer insights from Galactic Slice, LLC, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Galactic Slice, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Galactic Slice, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1688320/header.jpg?t=1661136776\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}