{
    "AppID": 1969530,
    "Name": "Paranormal Preparatory School",
    "Release date": "Aug 11, 2022",
    "About the game": "This boarding school for supernaturals isn't hell, but it is on top of it! Can you make peace between the vampire and werewolf students, close the portal to hell, and save the world? Paranormal Preparatory School is a 340,000-word interactive comedic dark fantasy novel by David Spain. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. You're the only mortal human student at Cavalcade Academy, a school for supernatural beings. Zombies, werewolves, vampires, and more live and study within its ivy-clad walls. Centuries of hatred between vampires and werewolves have led to deep divides between the two species, and this school is the latest battleground. Your eldritch magic powers will be essential to earn the respect of your peers. With the opening of the elite St. Mary’s Academy next door--a private school full of pampered, privileged mortal humans--your fellow supernatural students will face their first interaction with humanity. Your school’s reputation is at stake, to say nothing of what the wealthy upper-class St. Mary’s students will think of their paranormal neighbors! And now, as a portal to hell opens beneath Cavalcade Academy, you’ll need to ally with vampires, werewolves, humans, a ghost, and a cyborg zombie to close it. Make the wrong decisions, and it could mean the end of you, your classmates, and perhaps even the entire world. Oh, and don’t forget to study for your math exam! Play as male, female, or nonbinary; gay, straight, bi, asexual, or poly Choose a side in a centuries–old feud: ally with the vampire clan or werewolf pack; or try to heal the rift between them. Save the world from the encroaching flames of hell that rise through the portal near your school. Help your classmates promote undead rights--or flee back to the mortal realm. Infiltrate the elite neighboring school to discover the origin of your frightening visions. Accept a vampire’s kiss, return a werewolf’s passion, or transcend the boundaries of death to love a zombie. It’s the end of the world. Don’t be late for class!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1969530/header.jpg?t=1660226718",
    "Price": 3.95,
    "Developers": "Choice of Games LLC",
    "Publishers": "Choice of Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1969530/ss_abed12f11b60065d38eab7f4690e24e47eb071d7.1920x1080.jpg?t=1660226718,https://cdn.akamai.steamstatic.com/steam/apps/1969530/ss_653caea6392b538edd12c1de649c48f7fc4b1833.1920x1080.jpg?t=1660226718,https://cdn.akamai.steamstatic.com/steam/apps/1969530/ss_c5c86e9bd28484b702d6586b0a4e4a3d78f4d06e.1920x1080.jpg?t=1660226718,https://cdn.akamai.steamstatic.com/steam/apps/1969530/ss_e80c5e4b82c8aa79af69d3ef534ae4f86385b5d6.1920x1080.jpg?t=1660226718,https://cdn.akamai.steamstatic.com/steam/apps/1969530/ss_798b0102151d16ad4b8ef1ab26d17c6fcd409729.1920x1080.jpg?t=1660226718",
    "Slug": "paranormal-preparatory-school",
    "Meta Title": "Paranormal Preparatory School: Aug 11, 2022, Choice of Ga...",
    "Meta Description": "Looking for information on Paranormal Preparatory School? Check out the release date (Aug 11, 2022), developer insights from Choice of Games LLC, and a ...",
    "Alt Text Image": "Official header image for Paranormal Preparatory School game - Steam 1969530",
    "Canonical URL": "https://gusku.site/game/paranormal-preparatory-school",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paranormal Preparatory School\", \"description\": \"Looking for information on Paranormal Preparatory School? Check out the release date (Aug 11, 2022), developer insights from Choice of Games LLC, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1969530/header.jpg?t=1660226718\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.95, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}