{
    "AppID": 1873750,
    "Name": "Periphery",
    "Release date": "Aug 19, 2022",
    "About the game": "The refugee capsule lands on a uninhabited planet. You have to survive, rebuild civilization and, if possible, regain control over the Earth. Classic RTS in sci-fi setting: - manage your units - build bases - explore the planet, look for and mine various resources, hunt wild animals - fight and interact with other players - develop economy and diplomacy At the beginning of the game, you, along with other beginners, will be thrown onto one of the uninhabited planets. After reaching a certain economic development and surviving in competition with other players, you will have the opportunity to build your own space fleet and start exploring space and colonizing other planets. The goal of the game is to regain and maintain control over the Earth. The one who owns the Earth is considered the leader of the rating. If the Earth has no owner, the leader is the one whose planet is closest to the Earth. Unlike just RTS, in which the PvP session is designed for a small and finite number of players and the map is available only to the participants of the session, and the session itself lasts only an hour or two. Periphery is MMORTS, it is one huge and open universe for all players, one endless PvP session. Wars here can last several months of real time. When you exit the game, the gameplay does not stop, your colonies continue to live and evolve in real time on the server. For example, you can log into the game in the morning, give orders, then log in in the evening, by which time everything will have been built, resources have been collected, the fence has been repaired, etc. The closer a planet is to Earth, the higher the competition. In addition, some of the resources are not renewable. Therefore, in order to supply the central regions and, as a result, for a successful game, it is also recommended to colonize planets and build colonies somewhere on the periphery. In case you don't really like the constant PvP battles or you like exploration, the universe is quite large and there are places to hide and develop quietly. You can fly away from the center and explore space and quietly build your galactic empire there. If at first minutes it seems too hardcore, don't be alarmed, the maps in the game are quite large, and there is a built-in wiki. As you progress, you will have enough time before encountering other players to get comfortable with the controls, learn the rules, and build your starting base and defenses.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1873750/header.jpg?t=1660927064",
    "Price": 4.99,
    "Developers": "Aleksandr Nagaev",
    "Publishers": "Aleksandr Nagaev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1873750/ss_49dbf4fbe8e5325ac999ea2926fa1ecdaab6c4bd.1920x1080.jpg?t=1660927064,https://cdn.akamai.steamstatic.com/steam/apps/1873750/ss_6b1eafd7301afb29cc42618b68d297754b3cad5b.1920x1080.jpg?t=1660927064,https://cdn.akamai.steamstatic.com/steam/apps/1873750/ss_5e7d773fa703ba8ca3eb3074399d8290665fb385.1920x1080.jpg?t=1660927064,https://cdn.akamai.steamstatic.com/steam/apps/1873750/ss_d7686a08355fed66470413451e6dc92064e626c2.1920x1080.jpg?t=1660927064,https://cdn.akamai.steamstatic.com/steam/apps/1873750/ss_fdbbfccbb571f2e6519755290f5c5e87657bf86e.1920x1080.jpg?t=1660927064",
    "Slug": "periphery",
    "Meta Title": "Periphery: Aug 19, 2022, Aleksandr Nagaev and Full Overview",
    "Meta Description": "Looking for information on Periphery? Check out the release date (Aug 19, 2022), developer insights from Aleksandr Nagaev, and a complete game summary.",
    "Alt Text Image": "Official header image for Periphery game - Steam 1873750",
    "Canonical URL": "https://gusku.site/game/periphery",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Periphery\", \"description\": \"Looking for information on Periphery? Check out the release date (Aug 19, 2022), developer insights from Aleksandr Nagaev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aleksandr Nagaev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aleksandr Nagaev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1873750/header.jpg?t=1660927064\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}