{
    "AppID": 2084030,
    "Name": "Pitch Black: A Dusklight Story - Episode One",
    "Release date": "Aug 10, 2022",
    "About the game": "This is the first instalment of a six episode saga, featuring around one hour of gameplay with features for replay-ability. The world of Dusklight is bleak yet filled with character. The last remaining capital city of a post-apocalyptic wasteland remains in the grips of a deceitful church and tyrannical corporations. With the aid of a unique Auditory Zoom mechanic you will uncover the mysteries of Dusklight. Choices matter, choose to listen and explore, choose to charge and fight, choose the dark or the light. Pitch Black subtly adapts to how you want to play it, and you'll experience different aspects of the narrative depending on how you play. Fight your past, fight for your future, with the choices you make and if you choose to, with your bare hands. Using a unique audio combat mechanic unlike anything you've played before. Don't want to fight? You always have a choice , you can sneak by, or run from enemies. Experience the stealth mechanic here. The World The Pitch Black universe goes beyond this series of games, delve deeper through our Tales of Dusklight binaural Audio book series: Listen to some sound worlds from Dusklight with our interactive binaural ambience explorer. The Tech Purple Jam uses Binaural Audio to construct AAA, highly polished environments, all of which are entirely navigable using only your ears. Binaural Audio implements HRTFs to accurately convey spatial audio information – positioning, distance, roll off, width, environmental reflections; the ways we as humans hear in real life have been captured, remapped and gamified. Feature List Dynamic Mechanics (Stealth, Combat, and more) Diverse areas to explore and interact with Personalised experience through choices and an alternative ending Responsive and Reactive world and dialogue options Original music and sound design for AAA finish. Engrossing dialogue, fully voice acted. Immersive environments through Binaural Audio (DearVR) Player Quality of life Save and Load system Immediate Arrow Key (PC) controls Presence giving Terrain System Player Progress Defined Menu Audio Completely Blind and VI Accessible This product has minimal visual implementation. Visual aids are non-existent, and so any visuals you do encounter give you no advantage whatsoever. This is a true Audio Game with professionally recorded dialogue, sound effects and audio-system implementation. Headphones/Earphones are highly recommended to make use of spatial navigation, unique immersion qualities and to make the game a more playable experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2084030/header.jpg?t=1660430262",
    "Price": 4.79,
    "Developers": "Purple Jam,Harry Cooper,Connor Harrison,Jordan Barry",
    "Publishers": "Purple Jam Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2084030/ss_83e71e40de361345ed74abca6710c40484a2c4c6.1920x1080.jpg?t=1660430262,https://cdn.akamai.steamstatic.com/steam/apps/2084030/ss_7ecaef53a21dcb6e538872885e52dc4723e32c74.1920x1080.jpg?t=1660430262,https://cdn.akamai.steamstatic.com/steam/apps/2084030/ss_f9d14a783e408468ebe827dde87e904df8c388ef.1920x1080.jpg?t=1660430262,https://cdn.akamai.steamstatic.com/steam/apps/2084030/ss_ab5f8ed50b371827647f1bdca6d0fe75d5dbaaa3.1920x1080.jpg?t=1660430262,https://cdn.akamai.steamstatic.com/steam/apps/2084030/ss_e4b3104a525601db835833e2880d2397bdf5e34d.1920x1080.jpg?t=1660430262",
    "Slug": "pitch-black-a-dusklight-story-episode-one",
    "Meta Title": "Pitch Black: A Dusklight Story - Episode One: Aug 10, 202...",
    "Meta Description": "Looking for information on Pitch Black: A Dusklight Story - Episode One? Check out the release date (Aug 10, 2022), developer insights from Purple Jam,H...",
    "Alt Text Image": "Official header image for Pitch Black: A Dusklight Story - Episode One game - Steam 2084030",
    "Canonical URL": "https://gusku.site/game/pitch-black-a-dusklight-story-episode-one",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pitch Black: A Dusklight Story - Episode One\", \"description\": \"Looking for information on Pitch Black: A Dusklight Story - Episode One? Check out the release date (Aug 10, 2022), developer insights from Purple Jam,H...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Purple Jam,Harry Cooper,Connor Harrison,Jordan Barry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Purple Jam Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2084030/header.jpg?t=1660430262\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.79, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}