{
    "AppID": 1986760,
    "Name": "Police Stories: The Academy",
    "Release date": "Aug 2, 2022",
    "About the game": "Police Stories: The Academy is a free version of Police Stories with a new story, missions, and locations. Here, Rick and John are still inexperienced trainees who are just learning to be cops. Another day at the police academy goes awry when unrest breaks out in the city. To make matters worse, a 'rat' who works with the local mafia has turned up at the police station. And, of course, only two student cops can defy all the trouble! Like the original game, The Academy is inspired by SWAT 4 and cop TV shows. A fresh take on top-down shooters with an emphasis on tactics where decisions have to be made in a split second. Rescue hostages, neutralize criminals and defuse bombs in single-player or co-op mode. And remember, shooting first is not the best decision! 3 new missions and locations, plus the police academy training ground. Help young Rick and John become brutal cops! The Surrender System allows you to apprehend the suspects without resorting to violence. Fire a warning shot near them or engage them in melee combat - those are just some of the ways you can make them submit. Issue commands to your fellow cop Rick Jones. Make sure to use him wisely - and who knows, he might save your life in return. Randomly placed criminals, hostages and evidence make every level run unique. The placement changes every time you restart, leading to new interesting situations and opportunities. As a law enforcement officer, you will have access to end-of-the-line police equipment, such as under-the-door cameras, door blast charges and many others. Various types of lawbreakers, from small petty criminals to well organised gangs and terrorists. Each type has not only unique weapons, but different behaviour and shooting skill. Complex Tactical Gameplay: Try not to get spotted, don't waste bullets, regularly check your surroundings and make sure to take criminals down quietly. All your actions are scored in real time. Playing aggressively won't get you a high enough result to start the next mission - so keep that in mind! Co-op. Complete mission together for better scores and more fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1986760/header.jpg?t=1659444876",
    "Price": 0.0,
    "Developers": "HypeTrain Digital",
    "Publishers": "HypeTrain Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1986760/ss_7c08575a1c78b0903a8564caac5459ad8adb1249.1920x1080.jpg?t=1659444876,https://cdn.akamai.steamstatic.com/steam/apps/1986760/ss_22585d72bb99b36b718d4e984a2bc454425c37e8.1920x1080.jpg?t=1659444876,https://cdn.akamai.steamstatic.com/steam/apps/1986760/ss_8a4a0d71fffb21481e81918c8b5b83b92a9c8390.1920x1080.jpg?t=1659444876,https://cdn.akamai.steamstatic.com/steam/apps/1986760/ss_feced6479f8a37ba4be0360142c6e052f7584581.1920x1080.jpg?t=1659444876,https://cdn.akamai.steamstatic.com/steam/apps/1986760/ss_e2b212d1513ba787f5878c5369298a6c5f62fdcc.1920x1080.jpg?t=1659444876,https://cdn.akamai.steamstatic.com/steam/apps/1986760/ss_636e13403b01578d01a8fb87ae2e111074d5f261.1920x1080.jpg?t=1659444876",
    "Slug": "police-stories-the-academy",
    "Meta Title": "Police Stories: The Academy: Aug 2, 2022, HypeTrain Digit...",
    "Meta Description": "Looking for information on Police Stories: The Academy? Check out the release date (Aug 2, 2022), developer insights from HypeTrain Digital, and a compl...",
    "Alt Text Image": "Official header image for Police Stories: The Academy game - Steam 1986760",
    "Canonical URL": "https://gusku.site/game/police-stories-the-academy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Police Stories: The Academy\", \"description\": \"Looking for information on Police Stories: The Academy? Check out the release date (Aug 2, 2022), developer insights from HypeTrain Digital, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"HypeTrain Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HypeTrain Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1986760/header.jpg?t=1659444876\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}