{
    "AppID": 1890030,
    "Name": "PROJECT : KNIGHT™ 2 Dusk of Souls",
    "Release date": "Aug 19, 2022",
    "About the game": "Something seems to have changed : I saw that tall castle in my dream... Where normally there was an island... A tall castle surrounded by dark, ominous clouds... Something seems to have changed... The eternal loop seems to be shattering... But how is it possible... Something tells me to hold on... Something tells me to be stronger... Something tells me to face my fears... In my dream I saw that island... That island that now seems to be so peaceful... I'm now lost and there is no turning back... A lonely knight on top of a deadly castle... Farewell... The Premise : After waking up on top of a large dark castle, you will have to fight your way trough to finally get out of this nightmare... This game is a real time combat collectathon with a cartoony looks in the style of Zelda mixed with Dark Souls where you have to escape from a ominous castle... Collecting is the Key : Collect as many coins and souls as possible by exploring and eliminating the creatures lurking in the castle. You'll need them to unlock different parts of the castle and upgrade your abilities and potions, otherwise you won't be able to defeat the bosses that stand in your way... 50 purple coins are hidden inside the castle so be on the lookout for them, it is said that whoever collects all the purple coins will receive great fortune... New Game Mechanics : Unlike the previous opus, this sequel allows you to block with your shield and inflict enormous damage when your blue gauge is at its maximum. Be careful though and keep an eye on the new stamina gauge which will deplete if you attack or flee... Be sure to take a look at the new mini map, it will help you navigate trough this new nightmare... We strongly recommend to play the game with a controller due to the frequent use of the camera. It is possible to play with the keyboard but it is not recommended. To rotate the camera from left to right with the keyboard use the ( Q and E keys ), from down to up use the ( F and R keys )... To zoom and unzoom the camera use the ( C and V keys ) and finally to reset the camera use the ( K key )... The game as been made entirely with the Smile Game Builder engine and as not been exported to Unity to customize it in any way! So this game is an example of what you can do with the SGB engine without any knowledge of programmation whatsoever! Keep in mind when playing that this engine is made to create turn by turn JRPG and not real time combat action!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1890030/header.jpg?t=1660909514",
    "Price": 8.99,
    "Developers": "Wathitdew Record",
    "Publishers": "Wathitdew Record",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1890030/ss_4ecb431cc45a86228d9bdc501f8f718f325ce5ee.1920x1080.jpg?t=1660909514,https://cdn.akamai.steamstatic.com/steam/apps/1890030/ss_3ff3321bba0d5516c5a619e9fa17d93516c0901c.1920x1080.jpg?t=1660909514,https://cdn.akamai.steamstatic.com/steam/apps/1890030/ss_5452ea3a7ab0726601fbac7c49cdba6ce241c793.1920x1080.jpg?t=1660909514,https://cdn.akamai.steamstatic.com/steam/apps/1890030/ss_eebad6dab9d58b8ca53ac93b59678168b7793aee.1920x1080.jpg?t=1660909514,https://cdn.akamai.steamstatic.com/steam/apps/1890030/ss_455c4536581408eea6d994cc81f5523328e59744.1920x1080.jpg?t=1660909514,https://cdn.akamai.steamstatic.com/steam/apps/1890030/ss_7fc561e8b22cd66d90f180002bec1e60a9d8a904.1920x1080.jpg?t=1660909514",
    "Slug": "project-knight-2-dusk-of-souls",
    "Meta Title": "PROJECT : KNIGHT™ 2 Dusk of Souls: Aug 19, 2022, Wathitde...",
    "Meta Description": "Looking for information on PROJECT : KNIGHT™ 2 Dusk of Souls? Check out the release date (Aug 19, 2022), developer insights from Wathitdew Record, and a...",
    "Alt Text Image": "Official header image for PROJECT : KNIGHT™ 2 Dusk of Souls game - Steam 1890030",
    "Canonical URL": "https://gusku.site/game/project-knight-2-dusk-of-souls",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PROJECT : KNIGHT\\u2122 2 Dusk of Souls\", \"description\": \"Looking for information on PROJECT : KNIGHT\\u2122 2 Dusk of Souls? Check out the release date (Aug 19, 2022), developer insights from Wathitdew Record, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wathitdew Record\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wathitdew Record\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1890030/header.jpg?t=1660909514\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}