{
    "AppID": 2003240,
    "Name": "PSI Masquerade",
    "Release date": "Aug 1, 2022",
    "About the game": "Overview: PSI Masquerade is an online action fighting death game for both PC and smartphone. Fight against other players as one of the many psychics who have gathered in a mysterious place. Just before the battle begins, the psychic abilities of each psychic, as well as the battle stage, are randomly determined. In addition to fighting with psychic abilities, there will also be plenty of items to fight with, such as knives, swords, pistols, and medicines. PSI Masquerade also features a battle royale game mode, but this is not just some ordinary free-for-all battle royale. In this battle royale players can temporarily cooperate with other players during the battle. There is also a team battle. This game is free to play. *** Share your invitation code and receive the Angel Set! *** Please check the account screen at the entrance for details about invitation codes. Psychic Abilities: Combustion, Telekinesis, Time Stopping･･･. PSI Masquerade features a wide variety of psychic abilities. Each player’s psychic ability is randomly determined just before the battle begins. When a psychic ability is added to the player's 'favorite abilities', that psychic abilities's chances of being chosen increase. Outfit Settings: The appearance of each playable character can be customized in great detail. Not only can the color of hair and clothing be changed, but masks can be removed and accessories such as cat ears and animal tails can be worn (outfit settings are purchasable). Friends: In PSI Masquerade, players will be able to send friend requests to other players. Once a friend request has been approved and the players have become friends, each player will be able to send battle invitations to the other. The battle invitation will be sent through push notifications if the player is offline. Differences Between Mobile and PC Versions: The mobile version includes the same features as the PC version however, unlike the PC version there will be advertisements that appear. Unlike the mobile version, the PC version will not use push notifications to send battle invitations to offline friends. Instead, battle invitations will be sent through an in-game notification system. Due to this, players on the PC version will only be able to send battle invitations to online friends. Transferring Accounts: Transferring accounts to different devices is possible in PSI Masquerade. Once an account is transferred to another device, the account will become unusable on the previous device. However, if you would like to play on the previous device again, all that is required is to re-transfer your account back to the previous device. It is also possible to transfer an account from the smartphone version to the PC version, and vice versa. Controls: In the PC version, the WASD keys are used to move and press these keys twice to dash. The right mouse button is used for normal attacks. When holding a weapon, click the mouse wheel to attack with it. For all other controls, use the on-screen buttons by left-clicking on them. On the battle screen, you can operate with the game pad. Practice Room: You can move your character in the 'Practice Room' on the 'Others' screen at the entrance without matching in online battles. Prime Time Bonus: In a room created from 14:00 to 14:15 JST, or from 22:00 to 22:15 JST, You can play without conuming life. Daily Mission: Battle 3 times every day to receive 10 Silver Tokens.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2003240/header.jpg?t=1659366825",
    "Price": 0.0,
    "Developers": "Mururunsoft",
    "Publishers": "Mururunsoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2003240/ss_cdaf4dc975d4a685e7928c5ce66e50115f1c3391.1920x1080.jpg?t=1659366825,https://cdn.akamai.steamstatic.com/steam/apps/2003240/ss_d5ec76cbbf0615187037ca6ccfe12c9615ed7ca1.1920x1080.jpg?t=1659366825,https://cdn.akamai.steamstatic.com/steam/apps/2003240/ss_1b6b45e98398abdc3af1f5b13b618a3c5d6f9b7f.1920x1080.jpg?t=1659366825,https://cdn.akamai.steamstatic.com/steam/apps/2003240/ss_2e9c7b367642bd5a936a7361eec1b312ffcc6ea2.1920x1080.jpg?t=1659366825,https://cdn.akamai.steamstatic.com/steam/apps/2003240/ss_e0ad56ea11fafd6729ddbc806424d17b05379734.1920x1080.jpg?t=1659366825,https://cdn.akamai.steamstatic.com/steam/apps/2003240/ss_0162d8b87f4c37e10db09056169c2ed26f6da986.1920x1080.jpg?t=1659366825",
    "Slug": "psi-masquerade",
    "Meta Title": "PSI Masquerade: Aug 1, 2022, Mururunsoft and Full Overview",
    "Meta Description": "Looking for information on PSI Masquerade? Check out the release date (Aug 1, 2022), developer insights from Mururunsoft, and a complete game summary.",
    "Alt Text Image": "Official header image for PSI Masquerade game - Steam 2003240",
    "Canonical URL": "https://gusku.site/game/psi-masquerade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PSI Masquerade\", \"description\": \"Looking for information on PSI Masquerade? Check out the release date (Aug 1, 2022), developer insights from Mururunsoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mururunsoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mururunsoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2003240/header.jpg?t=1659366825\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}