{
    "AppID": 1985240,
    "Name": "Putinist Slayer",
    "Release date": "Aug 12, 2022",
    "About the game": "What can be better among the stars than the torn faces of the occupiers? Relieve your stress in hurricane action — plunge into deep space and destroy ugly monsters, which the most famous faces of Russian fascism have turned to. Putinist Slayer is an avant-garde game project from Ukraine that illuminates the criminal essence of rashism and its ideologues through the prism of interactive art. Under the fire of Russian missiles, the game is created by the anonymous art group Bunker 22, which was formed during the war. Net income from sales of the game will be donated to the Armed Forces of Ukraine. All enemies of freedom and democracy — propagandists, politicians, military leaders of the criminal government of the Russian Federation will catch hell. Recreate your bravest dreams — burn them with a laser, plasma, byraktars, Molotov cocktails, call the cosmic army of Ukrainian tractor drivers to help. Gameplay Putinist Slayer is a fast-paced roguelike shoot'em up with sticky gameplay. Kill hordes, dodge, upgrade, eliminate bosses and reach new highest records! Comic interpretation of classic shoot’em up mechanics, opens the well-known gameplay from a new side. Diversity power ups, assembled into super powerful combinations and endless game progression with procedural generation provides a limitless space for the emergence of unique game situations that drag on for long hours and allow you to experience the taste of the game in a new way with each playthrough. Fat bosses will try to stop the flow of your anger. Multistage fights with enemy transformations, changing attacks and tactics, will force you to give it your all to protect freedom in the galaxy. The Plot The plot arc of the game goes through history from the destruction of Kyiv in 1167 by the founder of Muscovy, Prince Andrii Bogolyubsky and the crimes of the Soviet Union against the people of Ukraine to the mystical-futuristic version of nowadays. Putinistshas performed a dark ritual that opened a breach to another dimension in the walls of the Kremlin. In a fit of narcotic-mystical insanity, they dove into a distant alien space in order to involve mysterious demonic creatures in their war against all of humankind. However, the Ukrainian Intelligence Services acquired their routes… Sound and Visuals The game 'Putinist Slayer' uses artificial intelligence technologies (neural networks) to create characters in which you can recognize many famous media personalities. They are immersed into a 3D environment with advanced graphic effects. The unusual combination of visual styles creates a unique vibe in which an entire era is reflected through the memes of recent decades. The game will entertain you with music in the genres of rock and electropunk from such bands as VIDMA and Пирятин, as well as modern arrangements of the Ukrainian national anthem. Project Mission Support of the Ukrainian army Net income from sales of the game will be donated to volunteer funds providing assistance to the Armed Forces of Ukraine. We will regularly report on fundraising success on our official website. Gamedev as art Video games are a product of the most powerful field of interactive art in terms of its technological means, which can accommodate absolutely all categories of human creativity and turns the viewer into a participant. The breakthrough of this field attracts businesses that give incredible projects and at the same time push art into the background, putting everything on the rails of soulless commercialization. The Bunker 22 collective intends to act against this sad trend. Indie gamedev with soul, indie gamedev as art — this is what attracts and unites us. New frontiers of informational resistance to the Russian invaders Russian aggression leads to the rapid militarization of the world, the reduction of human freedoms and the reversal of globalization in the opposite direction. The metastases of terror and military conflicts spread to other countries. The largest-scale aggressive military invasion of one country against another with the goal of its total destruction and genocide since the Second World War calls global world security into question. This opens the door to the military adventures of bloodthirsty dictators from the most diverse corners of the world, who are watching with interest how Putin's bloody terror in Ukraine will end. We are trying to counteract this evil in informational and cultural space. Poetizing righteous rage, we support the Ukrainian national spirit. By personifying evil in the images of those who embody the ideology of putinism, we reduce their power and influence. Synthesis of seriousness and absurdity, satire dissolved in psychedelia, provocation, meditative gameplay, and projection of guro aesthetics onto rashists are artistic methods by which we appeal to the player's subconscious in an attempt to counteract the poison of Russian propaganda and the anti-humanictic, anti-Ukrainian deceitful concepts rooted in it. We dream of a free and open world in which there are no such horrors as Russian terror, and people can focus on art, culture, science, achieving personal happiness, harmony and development of all spheres of life. Start right now! Buy the game for yourself and a second copy as a gift for a friend who is poisoned with Russian propaganda. After all, Putinist Slayer includes an interactive session of anti-rashist hypnotherapy. Destroy evil, restore justice, save the universe from the bloody dictatorship of Putin!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1985240/header.jpg?t=1660348073",
    "Price": 4.99,
    "Developers": "Bunker 22",
    "Publishers": "Bunker 22",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_42cfa081fa9615057e4b0e075a7b21e76d7d50e0.1920x1080.jpg?t=1660348073,https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_2c0cada3eac44cc71ae0e6e4a61dbec8800f60cf.1920x1080.jpg?t=1660348073,https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_42a8f61e8abe5def164b6c9f3c86eff8130032be.1920x1080.jpg?t=1660348073,https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_e0f56000a1c8a845569d5614b277e64dd6a848d0.1920x1080.jpg?t=1660348073,https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_1295a6d6ec65267dadfb3e1dbe07b39e986c3c86.1920x1080.jpg?t=1660348073,https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_b62be94af5fc6a7d2a785d51dd6a4fa5c3dafc0b.1920x1080.jpg?t=1660348073,https://cdn.akamai.steamstatic.com/steam/apps/1985240/ss_ae7735ebad89d95e04f6e52aa72082630313c58c.1920x1080.jpg?t=1660348073",
    "Slug": "putinist-slayer",
    "Meta Title": "Putinist Slayer: Aug 12, 2022, Bunker 22 and Full Overview",
    "Meta Description": "Looking for information on Putinist Slayer? Check out the release date (Aug 12, 2022), developer insights from Bunker 22, and a complete game summary.",
    "Alt Text Image": "Official header image for Putinist Slayer game - Steam 1985240",
    "Canonical URL": "https://gusku.site/game/putinist-slayer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Putinist Slayer\", \"description\": \"Looking for information on Putinist Slayer? Check out the release date (Aug 12, 2022), developer insights from Bunker 22, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bunker 22\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bunker 22\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1985240/header.jpg?t=1660348073\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}