{
    "AppID": 1846270,
    "Name": "Re;quartz零度",
    "Release date": "Aug 12, 2022",
    "About the game": "■Work content■ Reset 'destroy' ADV『Re;quartz零度(Re;quartz Raid)』 Compatible with both Windows / Mac, Suspense x BL games for all ages x Famous voice actors! The DVD version and DL card version have been released in advance and have been evaluated as 'BL games that destroy emotions'. The stage of the story is 'Reset World' where the same day is repeated many times. All the characters are 'Lie Spitting'. Feel free to remove the mask or go crazy for the ball ... ■Synopsis■ The mission of the protagonist is to 'put a stop to the madness of the world'. And - 'to find the one who killed him'. The common route 'first day', where all the target characters take. The story then splits into 'last day (front)' and 'last day (reverse)' at the final selection. 'last day (front)'. 'Still ...... I believe in you.'　 There exists a justice there you definitely wanted to protect, no matter how many lies you told. 'last day (reverse)'. 'Was it all a lie ......?' There is someone out there you definitely wanted to protect, no matter what else you hurt. There are different storylines and different endings for the 'last day (front)' and 'last day (reverse)' of every target character. They have two faces - do you love them for who they really are, for everything they are? Or do you hate them? Now, let's uncover the love and hate of these characters... ■Game system■ Command-selective adventure As you progress through the game, you'll see choices along the way. By choosing the options that come up, the story branches. The following features are available during gameplay. ・ Auto play function ・ Skip function (only read part / forced skip can be selected for unread part) ・ Sentence log viewing function ・ Save / load function ・ Quick save / quick load function ・ Config function (voice / BGM / SE volume adjustment) Beautiful illustration As you progress through the game, you will see a special illustration. The number of illustrations is 38 without difference. Stills that you have seen in the game can be displayed in full screen at any time by selecting 'Watch（鑑賞）' from the game title. Multi-end system When you select an option, the ending will branch. There are 19 ending types in all. If you select 'Record（記録）' from the game title, a list of released endings will be displayed. Select the ending title and the scene will be played. Enthusiastic performance by famous voice actors This game is not full voice. However, all still display scenes and ending scenes are full voice. You can enjoy part voice in other scenes. ■Character■ Protagonist Protagonist with an unfortunate [miraculous] fate ■Unity(CV. Kobayashi Yusuke / 小林裕介) He hates getting involved in troublesome and painful matters, and just loves women... but that's because he can't sleep without touching other people. He has a care for his juniors, despite his lukewarm attitude. Target characters A subordinate who hides his 'passion' under his inexpressive face ■Nijo(CV.Mizunaka Masaaki / 水中雅章) A big man who does his duties and eats sweets indifferently, without never showing his emotions. He has sworn to the protagonist that he will 'devote his life, body and soul' to the protagonist, however,... A junior who takes on [filthiness] 'for the sake of his Senpai”(CV.Sakai Koudai / 酒井広大) The only person in the world he worships is the protagonist, whom he calls 'Senpai'. Being a martial artist who specializes in dirty work, he basically doesn't care about anything but his Senpai. He is rather fond of smoking cigarettes. Is it 'passion' or 'pathos' that he hides behind? ■Akira Konoe (CV.Okawa Genki / 大河元気) A music college student born into a noble family, known as 'the piano nobleman'. He is a mysterious young man who gives people a different impression every time they meet him, but in fact his true identity is... [A young lion] who loves, hates, and shoots down the world ■Lionel(CV.Morikawa Toshiyuki / 森川智之) Although he is a talented boss, many people around him die mysterious deaths. He says and does things to the protagonist that suggest some kind of connection with him, but he himself has no recollection of it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1846270/header.jpg?t=1660307457",
    "Price": 34.99,
    "Developers": "B-cluster",
    "Publishers": "B-cluster",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1846270/ss_17385360a90034b890c36249ab0cc57f6c1022b0.1920x1080.jpg?t=1660307457,https://cdn.akamai.steamstatic.com/steam/apps/1846270/ss_74218739f8cc7d86496ad8154742cae59266a41b.1920x1080.jpg?t=1660307457,https://cdn.akamai.steamstatic.com/steam/apps/1846270/ss_ba95963cae690f594503dd717b83ebf6b8035065.1920x1080.jpg?t=1660307457,https://cdn.akamai.steamstatic.com/steam/apps/1846270/ss_4742cf960a803f9df11ae94762599b80cb210bda.1920x1080.jpg?t=1660307457,https://cdn.akamai.steamstatic.com/steam/apps/1846270/ss_3d65c6c5033545347175fc591ff3ca2c9d56f797.1920x1080.jpg?t=1660307457,https://cdn.akamai.steamstatic.com/steam/apps/1846270/ss_7cc252e66a96e2bf79468714e332bb7db9b96570.1920x1080.jpg?t=1660307457",
    "Slug": "re-quartz",
    "Meta Title": "Re;quartz零度: Aug 12, 2022, B-cluster and Full Overview",
    "Meta Description": "Looking for information on Re;quartz零度? Check out the release date (Aug 12, 2022), developer insights from B-cluster, and a complete game summary.",
    "Alt Text Image": "Official header image for Re;quartz零度 game - Steam 1846270",
    "Canonical URL": "https://gusku.site/game/re-quartz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Re;quartz\\u96f6\\u5ea6\", \"description\": \"Looking for information on Re;quartz\\u96f6\\u5ea6? Check out the release date (Aug 12, 2022), developer insights from B-cluster, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"B-cluster\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"B-cluster\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1846270/header.jpg?t=1660307457\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}