{
    "AppID": 2090230,
    "Name": "SCP: Containment Breach Remastered",
    "Release date": "Aug 4, 2022",
    "About the game": "SCP: Containment Breach is a horror video game developed by Joonas Rikkonen ('Regalis') and is based on fictional stories from the SCP Foundation website. The player takes the role of a human test subject who is imprisoned in an underground facility devoted to containing and studying anomalous entities and items labeled SCPs. SCP: Containment Breach Remastered is a huge addition to the game which includes hundreds of new features and items to enhance the play style and all around feeling of the game. Your goal in SCP: Containment Breach Remastered is to escape from Site-19 during a security breach, which leads to the escape of the contained anomalies, while also avoiding security &amp; containment teams sent in to end the breach. You play as a Class-D personnel designated as D-9341 as they attempt to escape an underground research and containment facility operated by the SCP Foundation amidst a containment breach of its numerous anomalies, designated as SCPs. The player is pursued by numerous hostile SCPs, which must be evaded to avoid eath, which is made more difficult by the player needing to blink periodically, allowing one SCP to attack if it is nearby. Certain environments will cause the player to blink more often, decrease the ability for the player to run, and more. Sourced Content Credits Remastered is a mod for SCP: Containment Breach. It includes various community sourced mods and content as well as custom content such as graphical enhancements and gameplay. Creators to all community sourced content are credited in the credits section of the game. SCP: Nine Tailed Fox Shaun Gaylard Vladislav Borisevich revo794 undead003 Alphive Turtle Sandwich/Catnipbuddy enotovski Sic FireFox Arseny Alex Morganidze Anon4743 Caleb Yu Ivan Mikhailov SCP: Box of Horrors Prune Sam Lynch Juan Pablo Arce Skin_ Tobop Reilly Grindle FireFox Niborius Fan Breach Ikobot Ivan Mikhailov The KMan OgaraOrCynder ICAS-14 Ivan Badikov JeLlegendz Idera Kenneth Crooker Project Resurrection Shaun Gaylard Diszxchat Ikobot Vladislav Borisevich Rarity From Valley Of Avalar The KMan Ivan Mikhailov Sam Lynch Juan Pablo Arce DL_Baryonyx KennethCrooker SCP-914 Expansion EternalError SCP-294 More Drinks TheKlabadisco Unlockables Mod Shaun Gaylard Field of View Mod TheHappyJammer Shaun Gaylard Inclination Vladislav Borisevich Earok Sswift RadReed Story of Site Ivan Mikhailov Ultimate Edition Jabka SCP Objects and Anomolies included in SCP:CBR SCP-005 SCP-008 SCP-009 SCP-109 SCP-012 SCP-035 SCP-049 SCP-066 SCP-079 SCP-096 SCP-106 SCP-109 SCP-148 SCP-173 SCP-178 SCP-198 SCP-205 SCP-207 SCP-215 SCP-294 SCP-357 SCP-372 SCP-402 SCP-409 SCP-427 SCP-447 SCP-457 SCP-500 SCP-513 SCP-650 SCP-682 SCP-714 SCP-860 SCP-895 SCP-914 SCP-939 SCP-966 SCP-970 SCP-990 SCP-1025 SCP-1033-RU SCP-1048 SCP-1048-A SCP-1079 SCP-1123 SCP-1162 SCP-1499",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2090230/header.jpg?t=1659755182",
    "Price": 0.0,
    "Developers": "Hunter Pollock",
    "Publishers": "HNT8 Organization",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2090230/ss_569cc4d2f2af32d1f3c662ec2cafa614b8e8cd87.1920x1080.jpg?t=1659755182,https://cdn.akamai.steamstatic.com/steam/apps/2090230/ss_0b72ee376c4cfb36abfc3aec42a091f81c4b32c6.1920x1080.jpg?t=1659755182,https://cdn.akamai.steamstatic.com/steam/apps/2090230/ss_9200f8b5d2b89f4dbbf56c1611ab717cecadf6be.1920x1080.jpg?t=1659755182,https://cdn.akamai.steamstatic.com/steam/apps/2090230/ss_2a3ab3ea49c97f300f5a0861e98bdd6dca82c0ae.1920x1080.jpg?t=1659755182,https://cdn.akamai.steamstatic.com/steam/apps/2090230/ss_0c57acdd4a5cc8ce96906b539d9a692a840b63d5.1920x1080.jpg?t=1659755182",
    "Slug": "scp-containment-breach-remastered",
    "Meta Title": "SCP: Containment Breach Remastered: Aug 4, 2022, Hunter P...",
    "Meta Description": "Looking for information on SCP: Containment Breach Remastered? Check out the release date (Aug 4, 2022), developer insights from Hunter Pollock, and a c...",
    "Alt Text Image": "Official header image for SCP: Containment Breach Remastered game - Steam 2090230",
    "Canonical URL": "https://gusku.site/game/scp-containment-breach-remastered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SCP: Containment Breach Remastered\", \"description\": \"Looking for information on SCP: Containment Breach Remastered? Check out the release date (Aug 4, 2022), developer insights from Hunter Pollock, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hunter Pollock\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HNT8 Organization\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2090230/header.jpg?t=1659755182\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}