{
    "AppID": 824550,
    "Name": "SD GUNDAM BATTLE ALLIANCE",
    "Release date": "Aug 24, 2022",
    "About the game": "In SD Gundam Battle Alliance, Mobile Suits and characters from across Mobile Suit Gundam history take center stage in this all-new action RPG. • A Battle Alliance to Correct a False World The story takes place in G: Universe, a world where Gundam canon twists and turns in ways no one can predict. To correct this world's distorted history, the player leads a 3-unit squadron consisting of Mobile Suits and pilots from across Gundam history - a true Battle Alliance. What Awaits Beyond False History... • Combo action with stunning visuals and dynamic animation Indulge in a wide array of Mobile Suit weaponry to crush many foes with! Control Mobile Suits portrayed with realistic weathering that showcases them as weapons of war as they tear across the battlefield with dynamic animations. • Strange phenomena known as Breaks are twisting legendary moments from Gundam history, and you're in charge to fix them. Experience Gundam history's most famous scenes as you develop new Mobile Suits to add to your arsenal. Gather Capital and expansion parts to transform your favorite machine into the ultimate MS. • Tackle missions with friends in multiplayer! Launch into battle with 2 partners to back you up. In multiplayer, you can play through the game with up to 2 other players in a 3-person team. Enjoy this new SD Gundam action RPG solo, or with friends. • Featured Series Mobile Suit Gundam Mobile Suit Gundam 0080: War in the Pocket Mobile Suit Gundam: The 08th MS Team Mobile Suit Gundam Thunderbolt Mobile Suit Gundam 0083: Stardust Memory Mobile Suit Zeta Gundam Mobile Suit Gundam ZZ Mobile Suit Gundam: Char's Counterattack Mobile Suit Gundam: Char's Counterattack Beltorchika's Children Mobile Suit Gundam Unicorn Mobile Suit Gundam F91 Mobile Suit Crossbone Gundam Mobile Suit V Gundam Mobile Fighter G Gundam Mobile Suit Gundam Wing After War Gundam X Turn A Gundam Mobile Suit Gundam SEED Mobile Suit Gundam SEED Astray Mobile Suit Gundam SEED VS Astray Mobile Suit Gundam SEED Destiny Mobile Suit Gundam 00 Mobile Suit Gundam 00 The Movie -Awakening of the Trailblazer- Reconguista in G Mobile Suit Gundam: Iron-Blooded Orphans Musha, Knight and Command: SD Gundam Scramble /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/824550/header.jpg?t=1661378489",
    "Price": 59.99,
    "Developers": "ARTDINK",
    "Publishers": "Bandai Namco Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/824550/ss_a22c45f7431ae74512946388f9ee367f0e94ab4f.1920x1080.jpg?t=1661378489,https://cdn.akamai.steamstatic.com/steam/apps/824550/ss_a703a8afb06dcb0f66e8b70d0378de3ade885f35.1920x1080.jpg?t=1661378489,https://cdn.akamai.steamstatic.com/steam/apps/824550/ss_a939752bdafcd267d82dcb86a79e09524cbc753d.1920x1080.jpg?t=1661378489,https://cdn.akamai.steamstatic.com/steam/apps/824550/ss_66f7ac23c630a146f2c0c82fc3ab787737984a32.1920x1080.jpg?t=1661378489,https://cdn.akamai.steamstatic.com/steam/apps/824550/ss_10893cae24aa00cddf7e62bec86d16d99d5ebd06.1920x1080.jpg?t=1661378489,https://cdn.akamai.steamstatic.com/steam/apps/824550/ss_712f157493af946dd35d8645a11a93f553f90c3a.1920x1080.jpg?t=1661378489",
    "Slug": "sd-gundam-battle-alliance",
    "Meta Title": "SD GUNDAM BATTLE ALLIANCE: Aug 24, 2022, ARTDINK and Full...",
    "Meta Description": "Looking for information on SD GUNDAM BATTLE ALLIANCE? Check out the release date (Aug 24, 2022), developer insights from ARTDINK, and a complete game su...",
    "Alt Text Image": "Official header image for SD GUNDAM BATTLE ALLIANCE game - Steam 824550",
    "Canonical URL": "https://gusku.site/game/sd-gundam-battle-alliance",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SD GUNDAM BATTLE ALLIANCE\", \"description\": \"Looking for information on SD GUNDAM BATTLE ALLIANCE? Check out the release date (Aug 24, 2022), developer insights from ARTDINK, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ARTDINK\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bandai Namco Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/824550/header.jpg?t=1661378489\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}