{
    "AppID": 1919740,
    "Name": "Silent Love",
    "Release date": "Aug 18, 2022",
    "About the game": "On the Zhongyuan Festival, in Taiping County, a dark theater is staged for the ghost king of Yinshan. On the birthday of the police commissioner, the Commissioner's son sent someone to disturb the drama team, and the paper man and the ghost King memorial tablet under the stage were lit instantly A few days later, at the director's birthday banquet in the same theater, a burning living man fell from the sky, much like the scene in which the ghost king was burned on the Chinese Yuan Festival Who was the victim? Is it possessed? Or murdered? Set up a mourning hall and do things. The story starts from Fengtian Baishi shop. One case has not been closed and another case has arisen. The relevant people have disappeared one after another Game content: This is a game mainly played by reasoning and solving puzzles. In the game, we will show the whole story through a total of 6 chapters (only 2 chapters will be opened in the Early Access, which will be updated later). We need to collect clues and props in the process, obtain the final clues to solve the case and capture the real murderer. By cracking small games, we will get some useful props and clues to help us solve the case. According to the choice of players, the game will produce up to 6 endings. How to develop to the end of the story is in your hands! Developer's words: 'Fengtian baishipu' is adapted from the story outline of the film of the same name. Players can have an immersive plot experience from the perspective of two protagonists. The game combines reality with reality, and film clips are interspersed in the process of the game. The film cast is composed of many old opera bones such as Liu Zhiyang, Zhang Zijian and Wang Kuirong. It has played familiar roles in well-known film and television dramas such as soul ferry and detective Di Renjie. The story is shrouded in a strange atmosphere at the beginning, and the whole process is high-energy. If you are also a fan of thriller suspense films, it will definitely be a palace level enjoyment. We are a group of young people who love to play drum games and write novels. We can't stop the thriller novels about reasoning and solving cases. By chance, we got the movie script of Fengtian, and we decided to make it a game! In addition to the main plot, we also added multiple endings to make the character image fuller and the story line richer. The game integrates the plot story and the current mainstream decryption playing method. The plot is tense and the playing method burns the brain. In addition to decryption, the game adds a lot of trial content. Players catch the murderer through clues between different characters to test everyone's logical reasoning ability. In the production of the game, we uphold the spirit of respecting Chinese traditional history and culture. We have read a lot of materials to verify the design of the scene, the customs of white affairs and the costumes of the characters, and invited authoritative professors of history to supervise the production of the game. The seemingly inadvertent small details are the result of our repeated polishing. I hope the works we try for the first time can get everyone's support. In addition, we are also creating scripts simultaneously. If you are interested, you can leave your attention!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1919740/header.jpg?t=1660877401",
    "Price": 5.99,
    "Developers": "Weird Bunny,Tower Games",
    "Publishers": "Weird Bunny",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1919740/ss_32be02a11363d9fc47d9f44f272fc97ec94889f9.1920x1080.jpg?t=1660877401,https://cdn.akamai.steamstatic.com/steam/apps/1919740/ss_ba9887aa747203c4adc94bdfe094f888ae072c03.1920x1080.jpg?t=1660877401,https://cdn.akamai.steamstatic.com/steam/apps/1919740/ss_c7399dbb3e5cc4275f5bd5fa2ed8994df2eca6ab.1920x1080.jpg?t=1660877401,https://cdn.akamai.steamstatic.com/steam/apps/1919740/ss_af073cf4f4181c61b374c4a1f4c055dec50c28fe.1920x1080.jpg?t=1660877401,https://cdn.akamai.steamstatic.com/steam/apps/1919740/ss_0a318b60d8578b0d15f0c1e113dfa493b9f86402.1920x1080.jpg?t=1660877401,https://cdn.akamai.steamstatic.com/steam/apps/1919740/ss_48541255a2a7cedff918c9112684f3aa30d0eb99.1920x1080.jpg?t=1660877401",
    "Slug": "silent-love",
    "Meta Title": "Silent Love: Aug 18, 2022, Weird Bunny,Tower Games and Fu...",
    "Meta Description": "Looking for information on Silent Love? Check out the release date (Aug 18, 2022), developer insights from Weird Bunny,Tower Games, and a complete game ...",
    "Alt Text Image": "Official header image for Silent Love game - Steam 1919740",
    "Canonical URL": "https://gusku.site/game/silent-love",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Silent Love\", \"description\": \"Looking for information on Silent Love? Check out the release date (Aug 18, 2022), developer insights from Weird Bunny,Tower Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Weird Bunny,Tower Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Weird Bunny\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1919740/header.jpg?t=1660877401\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}