{
    "AppID": 611300,
    "Name": "Task Force",
    "Release date": "Aug 27, 2022",
    "About the game": "Task Force is a low budget tactical shooter made by a couple of dudes. It focuses on close quarters infantry combat and aims to provide competitive arcade-style gameplay inspired by classic third-person shooters. Unfortunately it has amateur animations, store-bought character skins, and there's tons of things missing and unfinished because we ran out of both time and money. But our plan is to develop maps inspired by locations around the world where special operations are conducted. These could be jungles, deserts, urban areas or snowy environments. This requires a lot of realistic high quality content that covers a wide array of regions. Therefore we need a competent team of artists that can create these characters and environments. So if you don't buy this game then how could we possibly pay these guys a livable wage, and just think how shitty you would feel about yourself if you did that to us! TACTICAL THIRD-PERSON GAMEPLAY Gameplay focuses on close quarters infantry combat where communication and teamwork are required. Expanding crosshairs provide a sense of weapon inaccuracy which is affected by recoil, stance, movement, and a few other factors. It rewards bursting by keeping tighter shots more precise while still allowing for accurate spray. STRATEGIC ROUND-BASED GAME MODES Game modes are round-based and mostly focus on single-life objectives. They’ll involve aspects such as planting or defusing bombs, extracting or guarding hostages, and capturing or defending intel. Each map will be designed to a specific game mode but may also have different areas sectioned off for different modes. However instead of telling you what kind of shooter Task Force will be, why don't we tell you what kind of shooter it won't be. There are NO plans to include any of the following: - NO Health Regeneration - NO Weapon Unlocks or Economy - NO Enemy Targeting (UAV) - NO Character Progression - NO Killstreaks, Deathstreaks, or Perks - NO Drivable Vehicles in PvP (Co-op Only) - NO Looting or Weapon Drops - NO Unrealistic Skins So if you've been looking for a classy third-person shooter that doesn't sell out then you've come to the right place. We actually strive to honor the heroes in special operations that put their lives on the line to defend our freedoms. If you want a game that takes itself seriously enough to have military accuracy, inspirational music, competitive leagues and tournaments, yet not so seriously that it's still a 'game' with jokes, taunts, and dancing on dead bodies, then this is the game you've been looking for. Here are some of our map designs we've been working on: KHIMIK Khimik was inspired by the armed conflict with separatist forces in Ukraine and will focus on close quarters industrial combat in a forest environment. JAZAR Jazar was inspired by the liberation of an Iraqi city and will focus on close quarters urban combat in a desert environment. PANTARO Pantaro was inspired by the liberation of a city in the Philippines and will focus on close quarters urban combat in a tropical environment.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/611300/header.jpg?t=1661742432",
    "Price": 5.99,
    "Developers": "Tracer Interactive",
    "Publishers": "Tracer Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_b0cf03c79b84d06d2183a81895181b9711a03aeb.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_9f6bc719bc83a5a52581bc44148add3cfdc5e6ce.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_76661183f1e831b08400b7ad13e23245385027a3.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_23a3bb3e0393dcd999944282b20734d42e44334f.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_afbe973939967316a5863286a77087cdfbe8a8e6.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_1a37a46047dc8156bef78a5632431b443b953d88.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_47c2e8c034c496f61f98fa184a9efc5b89c45a52.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_1007ee903c96c7061f4511c671312b0f3970b06f.1920x1080.jpg?t=1661742432,https://cdn.akamai.steamstatic.com/steam/apps/611300/ss_986cbd62c26743bb76a618a241900a93fc2aa54a.1920x1080.jpg?t=1661742432",
    "Slug": "task-force",
    "Meta Title": "Task Force: Aug 27, 2022, Tracer Interactive and Full Ove...",
    "Meta Description": "Looking for information on Task Force? Check out the release date (Aug 27, 2022), developer insights from Tracer Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for Task Force game - Steam 611300",
    "Canonical URL": "https://gusku.site/game/task-force",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Task Force\", \"description\": \"Looking for information on Task Force? Check out the release date (Aug 27, 2022), developer insights from Tracer Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tracer Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tracer Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/611300/header.jpg?t=1661742432\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}