{
    "AppID": 2053990,
    "Name": "The Monster Under Your Skin",
    "Release date": "Aug 29, 2022",
    "About the game": "Play as an unnamed man who suspects his wife of something, and dive deep into his memories of the day when he was about to propose to her. Your choices can influence the plot, but this doesn't mean that you should act as a 'knight on a white horse' in order to get a 'good ending'. Genre: thriller. What could you expect in this adventure? A thriller story about a man who suspects his wife, Irma, of something strange. The protagonist won't easily admit what exactly his suspicions are, and you'll have to find out for yourself. You will be able to relive snippets of this man's memories and even change them with your own choices. The ending of the game will surely surprise you, because no matter what you suspect the main character or his wife of... You're most likely wrong. Game features Read the text. Press the 'Continue' button. As the plot branches, use your mouse to choose the options for actions or responses of the protagonist and his wife. Enjoy the 3D scenes on the right side of the screen. It's really simple. Although... Wait! Frequently, the game will give you the options for actions or responses that depend on your previous choices in the story. And sometimes... Sometimes some of the events that happen in the game will depend on your luck and, again, on your previous choices. Oh, yes! It's also worth mentioning that the options for actions or responses here don't look like a 'Yes-No-Sarcasm'. The story adjusts to your choices, but this doesn't mean you should only select the 'positive' options in order to get a 'better' ending. Just be yourself. The game has no saves, 'text rewinds' or other simplifications. This adventure needs your one free evening and all your attention. Some dry statistics What is the 'The Monster Under Your Skin' consist of:  game duration is from 40 to about 70 minutes (the duration will depend on what choices you will be making during the game. Well, and on your reading speed, of course);  text and dialogues for a total of 80-90 pages, with a lot of response options;  plot that is a mixture of thriller, romance and a 'secret ingredient';  3 mini-games that depend on your luck and your previous choices in the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2053990/header.jpg?t=1662042184",
    "Price": 7.19,
    "Developers": "R贸man O",
    "Publishers": "R贸man O",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2053990/ss_ddccf67aa8b92acc8ab8df7bdc42aa552fb4fedb.1920x1080.jpg?t=1662042184,https://cdn.akamai.steamstatic.com/steam/apps/2053990/ss_e5618f9729136ed4eabf6463762bcc16c021f76c.1920x1080.jpg?t=1662042184,https://cdn.akamai.steamstatic.com/steam/apps/2053990/ss_5df4816a891602f19987ef7af07694a31eaf0f38.1920x1080.jpg?t=1662042184,https://cdn.akamai.steamstatic.com/steam/apps/2053990/ss_c902eaf6bc8c4cfcad5639b9208479aa03eb44b1.1920x1080.jpg?t=1662042184,https://cdn.akamai.steamstatic.com/steam/apps/2053990/ss_6be37c64879478fd6a9432e5f0949322742408ae.1920x1080.jpg?t=1662042184",
    "Slug": "the-monster-under-your-skin",
    "Meta Title": "The Monster Under Your Skin: Aug 29, 2022, R贸man O and Fu...",
    "Meta Description": "Looking for information on The Monster Under Your Skin? Check out the release date (Aug 29, 2022), developer insights from R贸man O, and a complete game ...",
    "Alt Text Image": "Official header image for The Monster Under Your Skin game - Steam 2053990",
    "Canonical URL": "https://gusku.site/game/the-monster-under-your-skin",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Monster Under Your Skin\", \"description\": \"Looking for information on The Monster Under Your Skin? Check out the release date (Aug 29, 2022), developer insights from R\\u00f3man O, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"R\\u00f3man O\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"R\\u00f3man O\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2053990/header.jpg?t=1662042184\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}