{
    "AppID": 1933650,
    "Name": "The Imperial Gatekeeper",
    "Release date": "Sep 2, 2022",
    "About the game": "While not a national hero, everyone in the army knows of the feats and accomplishments in the recent unification war that earned you the moniker of 'Thill the Spearman.' You thought you had a dazzling military career ahead of you, but you've instead been transferred to the newly created Traffic Security Bureau for reasons you can't begin to fathom. Its chief, Olivia Riedell, insists the world is about to change and your country will no longer require soldiers. Instead, she believes it will embrace hard-working men and women who wield pens instead of swords and rifles. Your sense of duty compels you to accept, but you'll soon learn it's not as comfy a job as you imagined... As the squad leader, you're tasked with questioning applicants wishing to go through the checkpoint and making sure their papers are in order. Compare dates, check photographs and descriptions against the person in front of you, and identify counterfeit documents. There's only so much time in a day though, and your pay depends on your performance. Make sure to move the line along quickly while avoiding mistakes! Progress through the story and perform well in your duties to get transferred to checkpoints in other regions, each with its own evolving rules that dictate who's allowed to enter and under what conditions. Earn your paycheck and browse the wandering merchant's wares to acquire various valuable items that modify or enhance your ability to perform your duties. How about a metal detector that instantly identifies hidden weapons? How about a calming perfume that prevents applicants from getting stressed as quickly? These and many more items will unlock as the game progresses! Security Checkpoint Simulation Receive applicants who wish to cross the checkpoint and verify their documents and stories through the interactive minigame. Use items to handle the most complex cases, and earn evaluation points by being accurate and quick to advance your career. Randomly Generated &amp; Handcrafted Characters Applicants are randomly generated, ensuring no two days on the job are the same. Among those, a cast of unique, handcrafted characters with their own stories and sidequests will appear if the right conditions are met. Of course, not everyone who appears before you will be a friendly, law-abiding citizen. Use wanted posters to identify dangerous criminals who wish harm to the Empire and its people. Interwoven Gameplay and Story The locations you visit, the rules you have to follow, and the characters you meet all play a part in progressing the story. Perform well enough to be noticed by the higher-ups, and keep an eye out for suspicious individuals.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1933650/header.jpg?t=1662178386",
    "Price": 11.69,
    "Developers": "Tengsten",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1933650/ss_bedcc36ad26ec2e5be71122ce2380bb1fc314d71.1920x1080.jpg?t=1662178386,https://cdn.akamai.steamstatic.com/steam/apps/1933650/ss_f0fb39623721bf4709d53a484fccdafc9b94048d.1920x1080.jpg?t=1662178386,https://cdn.akamai.steamstatic.com/steam/apps/1933650/ss_769f44a0c640b294009509696ca06f74e2c709d9.1920x1080.jpg?t=1662178386,https://cdn.akamai.steamstatic.com/steam/apps/1933650/ss_f18bf009dec34bde7c8f002530f1ba06ce790dab.1920x1080.jpg?t=1662178386,https://cdn.akamai.steamstatic.com/steam/apps/1933650/ss_1450585c9659dcbc2749821db1ebd4556a033235.1920x1080.jpg?t=1662178386,https://cdn.akamai.steamstatic.com/steam/apps/1933650/ss_1d084c4f8b36074a84240cc4440c215f6001ca18.1920x1080.jpg?t=1662178386",
    "Slug": "the-imperial-gatekeeper",
    "Meta Title": "The Imperial Gatekeeper: Sep 2, 2022, Tengsten and Full O...",
    "Meta Description": "Looking for information on The Imperial Gatekeeper? Check out the release date (Sep 2, 2022), developer insights from Tengsten, and a complete game summ...",
    "Alt Text Image": "Official header image for The Imperial Gatekeeper game - Steam 1933650",
    "Canonical URL": "https://gusku.site/game/the-imperial-gatekeeper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Imperial Gatekeeper\", \"description\": \"Looking for information on The Imperial Gatekeeper? Check out the release date (Sep 2, 2022), developer insights from Tengsten, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tengsten\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1933650/header.jpg?t=1662178386\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.69, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}