{
    "AppID": 1520760,
    "Name": "Tyrant's Blessing",
    "Release date": "Aug 8, 2022",
    "About the game": "The Tyrant landed in Tyberia bearing promises of a paradise, without war, without suffering… and without death. All Tyberians had to do in order to enter his paradise was to simply die at the hands of his Dead Army. The war was over before it even began, with thousands perishing in the Tyrant's wake, only to be brought into his fold as undying thralls, bound by magic. The few living warriors left are scattered across the remnants of their homeland, tirelessly looking for a way to turn the tables on the tyrannical Tyrant. Lead a great Uprising, defeat the Dead Army, and drive the monstrous overlord back into the depths of the sea from whence he came. Tyrant's Blessing is a tactical turn-based game where your ability to plan, adapt, and strategize is more important than min-maxing your units or finding the sharpest sword in the hoard. Select battles every day, make challenging choices, and cleverly use the strengths of these rag-tag insurgents to defeat the undead hordes and maybe - just maybe - bring real life back to Tyberia. Before you bring the battle to the Tyrant's doorstep, you'll have to make sure you live long enough to reclaim the Island. Decide whether to fight, rescue the living from the Undying, or gather your strength. Every choice matters throughout every day of the Uprising. As you fight your way across the face of Tyberia, face off against random encounters that force difficult decisions. Do you intervene and fight highwaymen, putting your warriors at risk? Do you try to save a child, risking valuable time and resources? Only your morals and ideals hold the answer. Pick your heroic roster carefully. Screeg, the elder wizard advising the Uprising, can only teleport three heroes and a pet at once: Do you send your elite warriors in? Or rookies to train and hold the line? Are they up to the task? Can you handle the consequences? The Tyrant can’t be defeated without destroying an army's worth of the Undying. However, winning is more than simply whacking the enemy as hard as you can. Analyze the fray and plan accordingly. Place warriors around the battlefield to gain strategic advantages. Stay ever mindful of surroundings: kick up dust to make the enemies lose sight or hop over stones and dodge into bushes to avoid enemy attacks. Mind the enemy: every attack is telegraphed, but take care, simply moving away leaves behind a shadow. This remnant of a character can still be attacked if there is no way to avoid it... Knock the enemies out of the way and into obstacles, shield weaker heroes with ones that can tank damage, as well as chain powerful elemental attacks using the environment. Brute force works, but fight smarter, not harder. Each of your heroes has their own personality, properties, and abilities. Who will you choose to put in harm’s way? Enlist twenty hallowed heroes, each with a distinct set of abilities that can dramatically alter the course of any battle. But stay mindful: Not all heroes appear in a playthrough - and not everyone is guaranteed to make it to the finish line of this quest. Pick the right team for the task. An assassin may thrive in confined spaces, while an archer will suffer in close quarters. Some heroes may even bring their pets along, who might provide just enough leverage to win a battle for the group. Even if heroes fall, they can still be freed from the Tyrant's grasp. Track them down, defeat them in combat, and restore them back to their stolen life!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1520760/header.jpg?t=1660053849",
    "Price": 15.99,
    "Developers": "Mercury Game Studio",
    "Publishers": "Freedom Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_640f26702d0ae0058e8e535f71060bc2336ae0cb.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_a4c1d9de0b943505a0d1d62c0e2f5d348c40ebac.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_26e5a50ed446963f759f7c5dd1de91881819fe01.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_322d26ba093650180ccff18655f2b11b5d04cea8.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_4b5b71a03b1fcc10c868666dbffead5bb5bacdc7.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_daf8cee3bd42452b6fc8a92d8b02344958e21193.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_80db88d41992a2982f45f1144d96c595becbdcc7.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_8f9197d3ed7dfa447a8bf9a8a904d1d3d25978ae.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_6b4e66ce1185a7bbfb7524db41a5113a66b37977.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_57ce04b9cd5b3caedf8ff9d714b35909be8484bf.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_3183dad54d8fc052be6fb9bfed14f469d33af2a4.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_37eb2e1aadc2c6a57dde466660b755cdab35078d.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_cf813b893553d3053b58edc499ba78343cd10c98.1920x1080.jpg?t=1660053849,https://cdn.akamai.steamstatic.com/steam/apps/1520760/ss_f204f8a5f5eb33dd2d4e98e360bd37e1fde9bf59.1920x1080.jpg?t=1660053849",
    "Slug": "tyrant-s-blessing",
    "Meta Title": "Tyrant's Blessing: Aug 8, 2022, Mercury Game Studio and F...",
    "Meta Description": "Looking for information on Tyrant's Blessing? Check out the release date (Aug 8, 2022), developer insights from Mercury Game Studio, and a complete game...",
    "Alt Text Image": "Official header image for Tyrant's Blessing game - Steam 1520760",
    "Canonical URL": "https://gusku.site/game/tyrant-s-blessing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tyrant's Blessing\", \"description\": \"Looking for information on Tyrant's Blessing? Check out the release date (Aug 8, 2022), developer insights from Mercury Game Studio, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mercury Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Freedom Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1520760/header.jpg?t=1660053849\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}