{
    "AppID": 1488070,
    "Name": "Vesper: Ether Saga - Episode 1",
    "Release date": "Aug 16, 2022",
    "About the game": "Play the demo: / Vesper, the heroine A combat system combining role-playing, card games and strategy games. Role-playing game Start with the heroine Vesper and win new allied units with unique abilities. Level up your characters, unlock new skills (active and passive abilities), and upgrade them. Fulfill objectives, earn experience… and see the results at the end of the fight! Card Game There are 3 types of cards: Unit Cards: Summon your allies into battle in exchange for ether crystals. Action cards: they are abilities specific to your heroes. Arcane Cards: they are collectible cards that will give you various bonuses! Strategy game Unleash your ULTIMA! Plan your own strategy against your enemies, using the range of diverse combat units available. Keep moving to avoid certain enemy attacks. Your units' layout is important. For example, short-range physical attacks will have more effect on the front line. But beware, this rule can also be used by your enemies. Comic books/video game: an original story based on a new series of comics The entire comic book will be readable in the game, not in the usual format but in a version suitable for reading on screen! Some cutscenes will punctuate the series of completed missions. An episodic game The game and the comic book tell the same story: the first episode of the game matches the first comic book issue. As each future episode is released, you can resume your game from where you last saved to continue the adventure with the content that you had already won! Explore the universe of Etheria As the story goes on, you will unlock areas on the world map. Each location will offer a number of missions to complete in different difficulty modes. As a physical DPS, she uses both melee attacks (swords and spears) and range attacks (daggers and wheelblade). Her powers belong to the darkness element. As a full tank, his abilities can grab the attention of enemies and defend your characters. As a more versatile hero, both tank and physical DPS, Lubikai is a leader, who can call on his fellow Sorajis for reinforcement. And more to come... This episode will have 10 playable characters. In addition to the heroes, you can also have basic units to help you in combat. Fight against a multitude of enemies, exploit their weaknesses and adapt your tactics to defeat them! Some of them may be called in as reinforcements in combat (under certain conditions) but will not be controllable. A floating world surrounding the crystal tree “All is one”. Three words that gave life to a universe. If all is one, then you are not external to the universe; you are the universe. From this belief was born the world of Etheria, the world crystal tree, that breathes soul into matter. In a body borrowed for a limited time, life seeks itself and raises its consciousness by going beyond its limits. When the time of death comes, the world is not the same as it was before. Just like the soul that returns to Etheria is not the same. Infinite, eternal, in perpetual change. Without change, life would not be. Infinite, eternal, in perpetual change. Without change, life would not be. Soul, consciousness, spirit… Whatever you call it, it does not disappear. It uses its experience to transform the Universe. The part of the world you will explore in Episode 1 Every soul returns to where it came from: Etheria, the crystal tree. The siege of Valestiel Vesper , nicknamed 'the Amazon of the Knights of Nyx', is a courageous and determined young woman, able to wield ethereal magic. She provides services to Prince Crimson Nyx. They fight together for the kingdom of Sylvaestris, in a war against the Soraji nomads, that has been lasting for several years. Vesper &amp; Crimson But the dark forces which give Vesper her powers draw The Ekklesia's attention to her. This almighty religious institution is then calling upon Redgrave, a ruthless inquisitor of the Aurora Crux...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1488070/header.jpg?t=1660651601",
    "Price": 17.99,
    "Developers": "Sylvain Harlaut,Jeremy",
    "Publishers": "Sylvain Harlaut",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1488070/ss_8013063d2c5b51bdca128d58ff15bddf67316847.1920x1080.jpg?t=1660651601,https://cdn.akamai.steamstatic.com/steam/apps/1488070/ss_d18ad9ffc052e9a25ca9c78729bb513515d39b7e.1920x1080.jpg?t=1660651601,https://cdn.akamai.steamstatic.com/steam/apps/1488070/ss_a383e7d1b8e2b328902a0fd6b024f3c3d3e9a9d3.1920x1080.jpg?t=1660651601,https://cdn.akamai.steamstatic.com/steam/apps/1488070/ss_3f93b179bc71726c5c9e7d92ab664033d51e2ee9.1920x1080.jpg?t=1660651601,https://cdn.akamai.steamstatic.com/steam/apps/1488070/ss_bef1922bfa9903f3c7e983a455d264bcce59fde3.1920x1080.jpg?t=1660651601,https://cdn.akamai.steamstatic.com/steam/apps/1488070/ss_e161bc1bad9eb63601d1089ed806c5ab09e590ca.1920x1080.jpg?t=1660651601",
    "Slug": "vesper-ether-saga-episode-1",
    "Meta Title": "Vesper: Ether Saga - Episode 1: Aug 16, 2022, Sylvain Har...",
    "Meta Description": "Looking for information on Vesper: Ether Saga - Episode 1? Check out the release date (Aug 16, 2022), developer insights from Sylvain Harlaut,Jeremy, an...",
    "Alt Text Image": "Official header image for Vesper: Ether Saga - Episode 1 game - Steam 1488070",
    "Canonical URL": "https://gusku.site/game/vesper-ether-saga-episode-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vesper: Ether Saga - Episode 1\", \"description\": \"Looking for information on Vesper: Ether Saga - Episode 1? Check out the release date (Aug 16, 2022), developer insights from Sylvain Harlaut,Jeremy, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sylvain Harlaut,Jeremy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sylvain Harlaut\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1488070/header.jpg?t=1660651601\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}