{
    "AppID": 2098510,
    "Name": "Zenkcraft",
    "Release date": "Aug 12, 2022",
    "About the game": "Zenkcraft is a modern spellcraft templating program for Dark Age of Camelot's servers targeting the Shrouded Isles expansion phase (pre Trials of Atlantis). Zenkcraft was originally made back in March of 2019 and always existed as a free to download software but I have made tons of updates and enhancements. Zenkcraft allows you to completely customize your character's template to see all skills, stats, resists, and all other info in a comprehensive and interactive program. Easily add items to your template from several different methods and build your report for a spellcrafter to use. Several features such as Auto Template allow Zenkcraft to calculate and complete your template for you, with tons of other features. All changes are kept in patch notes. Core Zenkcraft Features Modern, interactive Spellcrafting tool with a very user-friendly UI that is tuned to all the settings of the Atlas (formerly Phoenix) server. All expected functionality such as exporting/importing, template guidance, and a variety of settings. Ability to add items directly from DAoC into Zenkcraft by delving an item with shift+i. Includes all stats, procs/changes, quality, etc. Online database with every Orb item in the game, searchable with filters. View all items with a certain proc/charge, see weapon speeds, credit needed, Orb cost, etc. and then import the item directly into your template. Add Spellcrafting gems directly into DAoC with a very easy interface. Upload and download templates from a public online database with a few clicks, showing all kinds of information. Full screen and windowed mode available. Recent Updates: Completed transition to a modern version of the Unity Engine. This will improve overall performance and stability. Added a Vault feature to store items between templates (See Vault Tab). Added a Properties Tab to track armor/weapon types, speed, and other information. This was a necessity in order to finish development of the Vault. Changed save directory to the 'My Documents' folder as opposed to the Zenkcraft directory (in addition to Vault items). This means you can delete Zenkcraft and add a new version, with all templates and Vault items being retained. Several changes to Zenkcraft to align with the Atlas server. Several performance enhancements across multiple functionalities (I'm a better programmer than I was 3 years ago). Completion of Auto Template. Added ROGify, which uses items in the Vault to build a template. There is a lot of information on this in Zenkcraft and this is a very powerful tool, so please check out the Notes and ROGify tabs within Zenkcraft for more info. Added the Spellcrafting Gem reagents (material cost) for all gems and added the info to the Spellcrafting report. Began syncing Atlas Orb items to Zenkcraft and removed all Phoenix Feather items. Added an 'Atlas Keeps' section from the Home screen that visually tracks the status of all keeps through an API call to the Atlas server.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2098510/header.jpg?t=1660308181",
    "Price": 0.0,
    "Developers": "Gas Lantern Games",
    "Publishers": "Gas Lantern Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_840d45e5872670eed2b8266877cc2e07293cb31c.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_e6b1a764c86e9d5e6a299addeafb8fdc80593b56.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_63785d832d5ea6947977e3692565a09b4f9d4893.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_094941d240bad41f90f18d5b65546a1419bb1148.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_3826047ffd968d2ceb0e936a7344f83962847973.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_e0134e011aac4f1610892f4038e13b38643f1493.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_ace4503b7a55f02b7fe19c59a609113df441747f.1920x1080.jpg?t=1660308181,https://cdn.akamai.steamstatic.com/steam/apps/2098510/ss_e3730c470c0e87ef2c8e97f26e5ff6f36cf54e66.1920x1080.jpg?t=1660308181",
    "Slug": "zenkcraft",
    "Meta Title": "Zenkcraft: Aug 12, 2022, Gas Lantern Games and Full Overview",
    "Meta Description": "Looking for information on Zenkcraft? Check out the release date (Aug 12, 2022), developer insights from Gas Lantern Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Zenkcraft game - Steam 2098510",
    "Canonical URL": "https://gusku.site/game/zenkcraft",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zenkcraft\", \"description\": \"Looking for information on Zenkcraft? Check out the release date (Aug 12, 2022), developer insights from Gas Lantern Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gas Lantern Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gas Lantern Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2098510/header.jpg?t=1660308181\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}