{
    "AppID": 1370800,
    "Name": "Baalbek Reborn: Temples",
    "Release date": "Mar 30, 2021",
    "About the game": "The Ministry of Culture, General Directorate of Antiquities of Lebanon presents this teletour, a cooperative project of the German Archaeological Institute and Flyover Zone, taking you on a virtual tour of the Roman temples in Baalbek, a UNESCO World Heritage Site in Lebanon. See today’s ruins in the archaeological park and travel back in time to the third century of our era to enjoy its ancient splendor digitally restored. At each of the 39 stops you can hear explanations of what you are seeing offered by the German archaeologists who have been studying the site for over twenty years. Go up into the air to see the sanctuary’s context in the Bekaa Valley. Learn about the sanctuary’s ancient and post-antique design and use. Marvel at some of the finest examples of ancient Roman architecture in the Near East. Visit one of the best-preserved Roman temples—the so-called Temple of Bacchus. See a recreation of the Temple of Jupiter, one of the biggest shrines in the entire empire. Go atop its roof (impossible to do when you actually visit the site today) to see a dramatic view of the sanctuary, modern town and the surrounding countryside. Find out about the curious cult statue of Jupiter Heliopolitanus. Nothing remains of the statue itself, but, thanks to the generosity of the Louvre, we are able to show you two well-preserved statuettes that reproduce it on a reduced scale. Explore the plaza with its two large altars in front of the Temple of Jupiter rivaling in grandeur the imperial fora in Rome. Hear about the famous oracle housed in the sanctuary. Learn about the enormous technical achievements in the construction of this sanctuary, in which rose granite granite from southern Egypt was used as well as the largest stones in human history. Finally, visit the nearby complex with two temples whose modern names are Temple of the Muses and Temple of Venus. At every stop you can use our Time Warp feature to toggle between views of the ruins today and our reconstructions of how the same features appeared in antiquity. In short, virtual tourism and virtual time travel combine to make it easy for you to appreciate Baalbek’s unique gems of art and architecture. Whether you are preparing to visit Lebanon or wish to deepen your understanding once you return home, this teletour helps you to get the most out of your visit. If current circumstances do not allow you to travel, then travel virtually: Baalbek is an obligatory stop on the bucket list of every world traveler!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1370800/header.jpg?t=1617139716",
    "Price": 0.0,
    "Developers": "Flyover Zone",
    "Publishers": "Flyover Zone",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1370800/ss_917135cd503f26e7463479373ca1b208b753786d.1920x1080.jpg?t=1617139716,https://cdn.akamai.steamstatic.com/steam/apps/1370800/ss_1a93013929f7e9eef331c897edb50c17112a75b0.1920x1080.jpg?t=1617139716,https://cdn.akamai.steamstatic.com/steam/apps/1370800/ss_4be6ae90612be613028e9f1845a3264457ff55b3.1920x1080.jpg?t=1617139716,https://cdn.akamai.steamstatic.com/steam/apps/1370800/ss_9dbb815e2ff09b152db18562e6033a8a06659013.1920x1080.jpg?t=1617139716,https://cdn.akamai.steamstatic.com/steam/apps/1370800/ss_99b6aeab9374ea6e00172097c562b8fae1386b8a.1920x1080.jpg?t=1617139716,https://cdn.akamai.steamstatic.com/steam/apps/1370800/ss_207c2d65615fedc32d032a3b2ddb918f339ff3c2.1920x1080.jpg?t=1617139716",
    "Slug": "baalbek-reborn-temples",
    "Meta Title": "Baalbek Reborn: Temples: Mar 30, 2021, Flyover Zone and F...",
    "Meta Description": "Looking for information on Baalbek Reborn: Temples? Check out the release date (Mar 30, 2021), developer insights from Flyover Zone, and a complete game...",
    "Alt Text Image": "Official header image for Baalbek Reborn: Temples game - Steam 1370800",
    "Canonical URL": "https://gusku.site/game/baalbek-reborn-temples",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Baalbek Reborn: Temples\", \"description\": \"Looking for information on Baalbek Reborn: Temples? Check out the release date (Mar 30, 2021), developer insights from Flyover Zone, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flyover Zone\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flyover Zone\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1370800/header.jpg?t=1617139716\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}