{
    "AppID": 1167300,
    "Name": "Battle Axe",
    "Release date": "Apr 29, 2021",
    "About the game": "Battle Axe Battle Axe is an arcade top-down hack &amp; slash featuring high-quality visuals created by veteran pixel artist Henk Nieborg, true to form game mechanics, and music from the legendary VGM composer Manami Matsumae – retro gamers rejoice! Story For as long as you and your people can remember, your homeland of Mercia has been held in the tyrannical clutches of the malevolent sorceress, Etheldred. Some months ago, a party of mercenaries was dispatched to attempt to put a stop to Etheldred and her evil cohorts, but regrettably none of them have ever returned… Will you meet the same unfortunate fate as their honourable predecessors, or will you return victorious and triumphant? That is all down to you! Gameplay Along with their own distinct traits, your selected hero not only has fierce close-range melee attacks, but also long-range projectiles to vanquish enemies from a distance. Each hero can move and attack in eight different directions and make use of various items. Ælfwyn the Merchant Accumulating gold from fallen enemies permits your hero to buy various items from Ælfwyn -the mysterious travelling merchant. Seek her out and upgrade your weapons to prepare yourself for the dangers that await! Ælfwyn’s wares include health potions, power-ups, and devastating magic scrolls. The Heroes You have the choice between three courageous heroes: Fae the Elf, Iolo the Druid, or Rooney the Marauder. Each hero has their own traits, weapons, and special abilities. Fae wields two deadly blades and swift throwing daggers; Iolo whips his enemies with his mighty beard and can conjure searing fireballs; Rooney carries a lethal cannon which he uses to bludgeon his enemies or launch cannonballs from a distance. Your chosen hero must battle bravely with hordes of Etheldred’s evil minions before confronting the menacing bosses of each region - formidable guardians who are fiercely loyal to Etheldred. Etheldred the Sorceress Etheldred is an evil, domineering sorceress who dwells in a spire in the distant volcanic wastelands to the North. Every seven years she sends her armies South to handpick citizens from each township who will be subjected to a lifetime of servitude, and they are never heard from again… With Etheldred’s next attack looming on the horizon, and the population becoming increasingly desperate, a call is sent out to champions across the land, pleading with them to put a stop to Etheldred’s plans once and for all! This is where you come in, brave champion…help us save the kingdom of Mercia! Features Single-player or Local Co-op. Arcade, Infinite, and New Game+ modes. Superlative pixel art by games industry veteran Henk Nieborg. Heroic soundtrack by the legendary VGM composer Manami Matsumae. An epic adventure for pixel art fanatics, with beautifully designed characters and environments in every frame!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1167300/header.jpg?t=1625479700",
    "Price": 29.99,
    "Developers": "Bitmap Bureau",
    "Publishers": "Numskull Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1167300/ss_18ddd304af71a266cdf147eeea74e6d70b7814c7.1920x1080.jpg?t=1625479700,https://cdn.akamai.steamstatic.com/steam/apps/1167300/ss_b785121ef8454a60b56ee7b2b7cbef08d4f35518.1920x1080.jpg?t=1625479700,https://cdn.akamai.steamstatic.com/steam/apps/1167300/ss_3936bb2406fc40723702a3afd42b3d81fa311366.1920x1080.jpg?t=1625479700,https://cdn.akamai.steamstatic.com/steam/apps/1167300/ss_e9a4ce622e041c5a47d19a90f08379d834bf9bb0.1920x1080.jpg?t=1625479700,https://cdn.akamai.steamstatic.com/steam/apps/1167300/ss_c883c73b82c490550a2d559f8d34f07bf719f979.1920x1080.jpg?t=1625479700",
    "Slug": "battle-axe",
    "Meta Title": "Battle Axe: Apr 29, 2021, Bitmap Bureau and Full Overview",
    "Meta Description": "Looking for information on Battle Axe? Check out the release date (Apr 29, 2021), developer insights from Bitmap Bureau, and a complete game summary.",
    "Alt Text Image": "Official header image for Battle Axe game - Steam 1167300",
    "Canonical URL": "https://gusku.site/game/battle-axe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battle Axe\", \"description\": \"Looking for information on Battle Axe? Check out the release date (Apr 29, 2021), developer insights from Bitmap Bureau, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bitmap Bureau\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Numskull Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1167300/header.jpg?t=1625479700\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}