{
    "AppID": 711920,
    "Name": "Detective Case and Clown Bot in: The Express Killer",
    "Release date": "Jul 19, 2018",
    "About the game": "Detective Case and Clown Bot in: The Express Killer The Express Killer is the sequel to Murder in the Hotel Lisbon . It follows the classic point and click adventure formula from the 80’s and 90’s. The game itself runs at a native resolution of 256x192, the same resolution used by the old ZX Spectrum 48k and the Nintendo DS. Synopsis: Someone has been killing passengers on the express train from Lisbon to Porto, every single day since Tuesday! Someone needs to stop the killer! Once again Garcia is not up to the task (was he ever?) and reluctantly calls upon his old friend and his strange flying sidekick: the mythical Detective Case and the unmistakable Clown Bot. Together, they will board on the express train, bother everyone by asking annoying questions, pick up everyone’s belongings and call them clues, drink and eat for free at the bar (because they are working after all!) and if all goes well, find and stop the express killer. Oh, and they have to babysit Garcia’s kid because his mom is in Porto and Garcia is busy and since they are taking the train to Porto they might as well take him with them. What could go wrong, right? Time for you to board on a brand new adventure filled with humor, cases (this time many cases!), mysteries, and even more characters now than ever before! Will you be able to gather clues, solve the puzzles, succeed the trials, and find the culprit before reaching the final station?! Characters: With the mythical Detective Case , also known as the world worst detective, a man so rough and rude that his witnesses would rather be run over by a slow-moving freight train than to be questioned by him. The hilarious Clown Bot who, although he works as a Detective Case’s sidekick, he hopes in reality that one day he will get a job as a circus clown. Unfortunately, and no matter how many applications he sends, no circus will ever accept a clown that is afraid of children. He never sleeps, so besides working by day as a sidekick, he also works by night as a stand-up comedian in a local bar. People say that he is a joke machine! And Garcia’s kid, what’s his name? Billy Joel? What is he doing here? Key features: The Express Killer has MILLIONS of key features! - An adventure game. - Play as Detective Case and Clown Bot. - Search for clues and interview witnesses. - Crack witnesses in a demanding gameplay. - Solve puzzles. - Take on trials! - Take a rest, have a nap. - Find the express killer (no, really?). - Includes 3 additional cases. Original Soundtrack The reviews for our soundtrack in Murder in the Hotel Lisbon were so positive that we decided to give you an even better one this time! Once again, the music was composed and recorded specially for Detective Case and Clown Bot and features classical orchestra and modern rock. PS: We brought back the original soundtrack from the first game too, of course. A final note to the newcomers: Even though this is a sequel, we made it so that you can fully enjoy the Express Killer without having to play Murder in the Hotel Lisbon! (Although nothing is preventing you from playing it first or after) ;)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/711920/header.jpg?t=1634916188",
    "Price": 6.99,
    "Developers": "Nerd Monkeys",
    "Publishers": "Nerd Monkeys",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/711920/ss_5cdc6f40eaacc9ee7d8a8f81f73292cd3ee64db8.1920x1080.jpg?t=1634916188,https://cdn.akamai.steamstatic.com/steam/apps/711920/ss_91fb6beedec21eb168e1fe168f049752e6289857.1920x1080.jpg?t=1634916188,https://cdn.akamai.steamstatic.com/steam/apps/711920/ss_3d16b8ee2ab1b647007116a2b41b56f08296c4fa.1920x1080.jpg?t=1634916188,https://cdn.akamai.steamstatic.com/steam/apps/711920/ss_2bb21b202e556e2f9f56cd71adff252584c6ef2b.1920x1080.jpg?t=1634916188,https://cdn.akamai.steamstatic.com/steam/apps/711920/ss_d2101f5d60102a009c004a8999694ad89a3f7cbf.1920x1080.jpg?t=1634916188,https://cdn.akamai.steamstatic.com/steam/apps/711920/ss_5466a5ff59008c2fcbe85501267a749f693ce132.1920x1080.jpg?t=1634916188",
    "Slug": "detective-case-and-clown-bot-in-the-express-killer",
    "Meta Title": "Detective Case and Clown Bot in: The Express Killer: Jul ...",
    "Meta Description": "Looking for information on Detective Case and Clown Bot in: The Express Killer? Check out the release date (Jul 19, 2018), developer insights from Nerd ...",
    "Alt Text Image": "Official header image for Detective Case and Clown Bot in: The Express Killer game - Steam 711920",
    "Canonical URL": "https://gusku.site/game/detective-case-and-clown-bot-in-the-express-killer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Detective Case and Clown Bot in: The Express Killer\", \"description\": \"Looking for information on Detective Case and Clown Bot in: The Express Killer? Check out the release date (Jul 19, 2018), developer insights from Nerd ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nerd Monkeys\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nerd Monkeys\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/711920/header.jpg?t=1634916188\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}