{
    "AppID": 421020,
    "Name": "DiRT 4",
    "Release date": "Jun 8, 2017",
    "About the game": "DiRT 4 out now for macOS and Linux. Motorsport by its very nature is dangerous. DiRT 4 is all about embracing that danger. It’s about the thrill, exhilaration and adrenaline that is absolutely vital to off-road racing. And more than that, it’s about loving that feeling. It’s about pushing flat out next to a sheer cliff drop. Going for the gap that’s slightly too small. Seeing how much air you can get in a truck. They call it ‘being fearless’. DiRT 4 also features a game-changing system called Your Stage; an innovative rally route creation tool that allows you to produce an almost-infinite number of unique stages at the press of a button. You choose your location and set the route parameters, then Your Stage does the hard work to create a unique rally stage that you can race, share with your friends and then challenge them to beat your time. Your Stage allows experienced rally players to create longer, more technical routes, whilst newcomers can create simpler shorter routes as they hone their skills. With DiRT 4, Codemasters have sought to combine the levels of thrill and realism from last year’s DiRT Rally with the fearless excitement, accessibility and adrenaline-fuelled races previously seen in its critically acclaimed prequels DiRT 2 and DiRT 3. Featuring classic rally racing that continues to build on the foundations set by the Colin McRae Rally games, the bruising contests from the official FIA World Rallycross Championship, the crazy battles of racing trucks and buggies, and the outrageous fun of open events in Joyride, players will face challenges from locations that span three continents. • OVER 50 OF THE MOST BREATH-TAKING OFF-ROAD CARS EVER BUILT – Including Ford Fiesta R5, Mitsubishi Lancer Evolution VI, Subaru WRX STI NR4 and Audi Sport quattro S1 E2 • 5 INCREDIBLE RALLY LOCATIONS WITH MILLIONS OF ROUTES – Australia, Spain, Michigan, Sweden &amp; Wales • THE OFFICIAL GAME OF THE FIA WORLD RALLYCROSS CHAMPIONSHIP – Race at Montalegre, Lohéac Bretagne, Hell, Holjes &amp; Lydden Hill in a multitude of different series • LANDRUSH – Short-course dirt track racing in Pro Buggies, Pro-2 Trucks, Pro-4 Trucks and Crosskart vehicles in California, Nevada and Mexico • JOYRIDE - Laptime challenges, smash challenges, free-play area and send challenges to friends • DiRT ACADEMY – Taking place at the DirtFish Rally School in Washington, USA, learn the skills, techniques and practice to become the best! • CAREER MODE – create your driver, compete across the disciplines, gain sponsors and build your team with clear goals and rewards • COMPETITIVE GAMING – Daily, weekly and month-long challenges against fellow players from around the world • NEXT GENERATION OF RACENET – Live ladder, leagues and tournaments, cross-platform leaderboards, enhanced CREST telemetry system • TUNING – Tweak your set-up based on vehicle, track and weather conditions to best suit your racing style • DAMAGE &amp; REPAIRS – Wear and tear is faithfully recreated with an improved and realistic damage model. Damage can be repaired by hiring Engineers to work in the team’s Service Area between stages but with a finite amount of time available.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/421020/header.jpg?t=1626098672",
    "Price": 14.99,
    "Developers": "Codemasters,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Publishers": "Codemasters,Feral Interactive (Mac),Feral Interactive (Linux),Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_101e771250373db1e6a4a17955b8bc671d1c4617.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_76b9373f3f4813d771ae84fc9de74ea7be8ef7db.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_0f3f41c4739e829b8093790fa5b767647ddf7045.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_cfeb262662bc7e6f852db299902637c59642273b.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_68353d6b1f74c5478e5b37dbdd47cd5bd94df082.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_4b3b7e63505a6dea85c4fce6d388c8965f9a7546.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_6eadb19eda246707be5ef5971b77ff37250d4f0b.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_a9b5de67ad4ea0708a15e9c5e977347b41a23689.1920x1080.jpg?t=1626098672,https://cdn.akamai.steamstatic.com/steam/apps/421020/ss_75844e17c938565826b161368d032b074a335d14.1920x1080.jpg?t=1626098672",
    "Slug": "dirt-4",
    "Meta Title": "DiRT 4: Jun 8, 2017, Codemasters,Feral Interactive (Mac),...",
    "Meta Description": "Looking for information on DiRT 4? Check out the release date (Jun 8, 2017), developer insights from Codemasters,Feral Interactive (Mac),Feral Interacti...",
    "Alt Text Image": "Official header image for DiRT 4 game - Steam 421020",
    "Canonical URL": "https://gusku.site/game/dirt-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DiRT 4\", \"description\": \"Looking for information on DiRT 4? Check out the release date (Jun 8, 2017), developer insights from Codemasters,Feral Interactive (Mac),Feral Interacti...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Codemasters,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Codemasters,Feral Interactive (Mac),Feral Interactive (Linux),Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/421020/header.jpg?t=1626098672\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}