{
    "AppID": 1338220,
    "Name": "Forsaken Portals",
    "Release date": "Dec 1, 2021",
    "About the game": "Forsaken Portals is a top down space simulation game with accompanying story. It takes place in an open world - mankind has gained the know how to travel to other star systems of the Milky Way, discovered foreign races and cultures and wants to spread out and establish a human civilization in other star systems. The very big fame beckons for ship captains in the interstellar tournament, which mankind wants to win at any price. EXPLORE Explore huge hand designed worlds in space, each of which has its own story to tell. Alien races, factories, resources, space stations, every world is different and exciting. TRADE No one can survive alone in space. Trade with alien races to ensure your survival and build a trading empire. For traders there are also special ship modules that display helpful information about trade routes on the galaxy map. FIGHT Not all inhabitants in space are friendly. Sometimes it is necessary to defend oneself or to assert one's interests militarily. Experience turn-based battles that offer plenty of room for strategic and wise action. ARM YOURSELF Your ship is not fully responsible for your strength in a fight. To arm yourself most effectively, you need to find new weapon blueprints, build them and create a deck. The more you know about your opponent before the fight, the better you can pick your weapons. IMPROVE In Forsaken Portals there are 5 ship classes, from small to large: Corvette Frigate Destroyer Cruiser Battleship You start out with a Corvette and as the game progresses you can improve and buy new ships. MODULES Install modules in your ship to gain special abilities. Some modules help to locate resources, others show the trade goods of remote stations or help to get information about the armament of enemy ships. BUILD YOUR OWN STATION An own space station offers the possibility to craft items, to maintain and improve the ship, to cultivate organic materials and serves as a base for exploring places that could not be reached otherwise. CRAFT Items, weapons, upgrades for ships and space stations, all this can be produced if you have access to the necessary materials. REACTIVATE THE PORTALS Many years ago, an unknown species installed portals to travel through the galaxy. Unfortunately, they do not work anymore. Are you the one who can reactivate them and pave the way for the different races to travel again?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1338220/header.jpg?t=1638646309",
    "Price": 18.99,
    "Developers": "Pottgames",
    "Publishers": "Pottgames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_5cbc04ac52be5c1f645c91e356d4af1bf6177fb7.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_33677b67f25b3180c23b4e8b59a0c16e2287cb31.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_6a9b5ca338b5767990863f252caefb3738945ce9.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_f17eb95616d9c7cd04da9a9ac6c3b9e4e6d26aea.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_fdea82cbb6d4cfa8bf9b6a5072bdd5d59f67315d.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_773a290fbb71ed889fdb5f76383cecbe952b846c.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_5d5331560328d380ada200dbdf95cd1615e08755.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_31e21fe1d5d407451ba2255adc43951dffee1bff.1920x1080.jpg?t=1638646309,https://cdn.akamai.steamstatic.com/steam/apps/1338220/ss_d10a5645cd87910505fc0376c75d88be1728397b.1920x1080.jpg?t=1638646309",
    "Slug": "forsaken-portals",
    "Meta Title": "Forsaken Portals: Dec 1, 2021, Pottgames and Full Overview",
    "Meta Description": "Looking for information on Forsaken Portals? Check out the release date (Dec 1, 2021), developer insights from Pottgames, and a complete game summary.",
    "Alt Text Image": "Official header image for Forsaken Portals game - Steam 1338220",
    "Canonical URL": "https://gusku.site/game/forsaken-portals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forsaken Portals\", \"description\": \"Looking for information on Forsaken Portals? Check out the release date (Dec 1, 2021), developer insights from Pottgames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pottgames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pottgames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1338220/header.jpg?t=1638646309\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}