{
    "AppID": 1019820,
    "Name": "Galaxicus",
    "Release date": "Jun 28, 2019",
    "About the game": "The Galaxicus MMO is equal parts space exploration, space combat, and planetary and empire building. The universe resets every four weeks, making it possible for you to play and succeed across successive campaigns regardless of your skill level. You play along with up to 10,000 other players, each managing colonies while battling seamlessly across about 2.6 billion square light years of space. Your ship can travel through normal and hyperspace. You and every other player begins each four-week Galaxicus war the same: you use a scout-class spaceship to explore the galaxy. By leaving the safety of the Imperial system, you build your own unique empire by exploring, establishing planetary colonies, and capturing colonies begun by rival players. Anyone you encounter within the game will become an ally, a rival, or possibly, in time, a vital teammate. Galaxicus has three regions and each defines your level of commitment to the game: 1. In CORE SPACE, you play a game that requires minimum commitment (ideal if you have a life outside of Galaxicus). 2. In RIM SPACE, a lot more happens. Weapons are hot, ships can attack you, and you can pillage planets, but not capture them. 3. In FRONTIER SPACE, you’re ALL IN. Leave your free time at the airlock! Regardless of the region you choose to play in, there’s a universe of stars to explore and each contains planets that you can orbit (or bypass). You can colonize or mine planets; maybe do both. It’s up to you. You can trade goods, rebuild your ship, and bank resources at any of the four Imperial bases that exist in each region. Your ideal goal is to balance space combat and colony building. That’s how you build your empire. You balance your fleet of ships by using modular components to construct combat ships, freighters and carriers. Your registry of ships lets you carry fighters and personnel to plant your banner on distant star systems. However, don’t forget to leave builders, miners, and harvesters back home or your attackers will run low on vital resources. You will quickly find that playing Galaxicus as a team makes it the best game going. Teams can more quickly explore space and evenly distribute the diverse knowledge gained. Strong members help less experienced colleagues to rapidly pick up valuable skills. History shows that a well-balanced group playing the game as a team stands a much better chance of entering and winning the annual War of the Galaxies competition.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1019820/header.jpg?t=1569806252",
    "Price": 29.99,
    "Developers": "Crimson Leaf LLC",
    "Publishers": "Crimson Leaf LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1019820/ss_e16a2b94ed6eaa9fa546b6b65d2e7610534f2f95.1920x1080.jpg?t=1569806252,https://cdn.akamai.steamstatic.com/steam/apps/1019820/ss_70c47e7e862d283ed5e5dc270214d99415ff39db.1920x1080.jpg?t=1569806252,https://cdn.akamai.steamstatic.com/steam/apps/1019820/ss_9dd864cbf11ee19bb94dfa1cfde31fc60288667e.1920x1080.jpg?t=1569806252,https://cdn.akamai.steamstatic.com/steam/apps/1019820/ss_ea199f17e18ae4a35fb9db2d34078a74ace986ff.1920x1080.jpg?t=1569806252,https://cdn.akamai.steamstatic.com/steam/apps/1019820/ss_69e7ba48f4c3d5eaca889ae5903dffb0ac7ff5ce.1920x1080.jpg?t=1569806252",
    "Slug": "galaxicus",
    "Meta Title": "Galaxicus: Jun 28, 2019, Crimson Leaf LLC and Full Overview",
    "Meta Description": "Looking for information on Galaxicus? Check out the release date (Jun 28, 2019), developer insights from Crimson Leaf LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Galaxicus game - Steam 1019820",
    "Canonical URL": "https://gusku.site/game/galaxicus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Galaxicus\", \"description\": \"Looking for information on Galaxicus? Check out the release date (Jun 28, 2019), developer insights from Crimson Leaf LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crimson Leaf LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crimson Leaf LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1019820/header.jpg?t=1569806252\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}