{
    "AppID": 1709590,
    "Name": "HoneyHoneyHoney!",
    "Release date": "Aug 22, 2021",
    "About the game": "A visual novel set in a world where men and women are kept at arm's length by the law... With three beautiful girls breaking barriers to win your affections, who'll be flying into your arms in the end? FEATURES 10+ hours of story Three branching heroine routes Full Japanese voice acting by seasoned professionals Beautiful 1080p art by Itsuki Ozora, primary illustrator of Marco &amp; The Galaxy Dragon ! SUMMARY It's been 30 years since sexual harassment countermeasures changed our way of life. Our day-to-day is governed by strict regulations dictating the appropriate distance between men and women and the various ways in which they can and cannot interact. As a result, direct interpersonal contact has been painfully reduced... In a society where male and female members must always be six feet apart, even dating requires authorization. But not in these hallowed halls! Can you keep a respectable distance with three dauntless heroines horning in on you? And in a world where distance relationships are the new normal, how long will you be able to keep yourself from getting up close and personal? CHARACTERS Tsukasa Tono “People who wish to date while at the academy have to apply for permission.” As president of the love audit club, Tsukasa has made it her personal mission to ensure all on-campus relationships are approved—or rejected!—in accordance with current gender segregation laws. Despite her dedication to the cause, this black-haired beauty has yet to experience love herself, instead letting her wild imagination read the lewd and obscene into even the most innocent of guy-girl situations. Just as she begins to despair, however, her childhood friend, Shun, transfers to the same academy and agrees to help her research sex and dating—all in the name of science, of course. Arika Chikamori “You don't need to run! You're the only person I chase around like this, you know?” A flashy freshman and the ideological opposite of Tsukasa, this sass-mouthed blonde is a vocal opponent of the gender segregation laws. Arika believes all individuals should be free to love whomever, whenever, and wherever they want. It's no surprise, then, that a certain hands-on situation on her first meeting with Shun invites her to misunderstand him as a bold ally in her fight for free love. Only problem is, now she clings to him at every chance, much to his dismay... Miyuki Mitsumine “I'm happy to lend you my chest whenever you need, Shun.” Also new to campus is Shun's buxom homeroom teacher, Miyuki. Gentle, kind, and well-loved by her students, she also happens to be... Shun's old babysitter from when he was a child?! It's been ten years since they've talked, but 'Ms. Mitsumine' still seems to enjoy doting on him—both on campus and off of it. In fact, whenever they're alone together, all sense of personal boundaries flies out the window, and her true feelings return to the surface...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1709590/header.jpg?t=1631676525",
    "Price": 29.99,
    "Developers": "Ouchi Jikan",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1709590/ss_04b0447c50752be6cfaddec6c5391f3357f0d4f7.1920x1080.jpg?t=1631676525,https://cdn.akamai.steamstatic.com/steam/apps/1709590/ss_1a2fe6df8cde5f0fd2527467817569db26a3c16a.1920x1080.jpg?t=1631676525,https://cdn.akamai.steamstatic.com/steam/apps/1709590/ss_905630beccea82234363331e0a3b8bce052ebe8d.1920x1080.jpg?t=1631676525,https://cdn.akamai.steamstatic.com/steam/apps/1709590/ss_07ea67ee64bed4e706d307a3b774cb348b3a11aa.1920x1080.jpg?t=1631676525,https://cdn.akamai.steamstatic.com/steam/apps/1709590/ss_8422b23cec8efd2bcbebc2ab3abc897e51971c4c.1920x1080.jpg?t=1631676525,https://cdn.akamai.steamstatic.com/steam/apps/1709590/ss_5fd51f964198f81bae8badef9f19fc080c90ad21.1920x1080.jpg?t=1631676525",
    "Slug": "honeyhoneyhoney",
    "Meta Title": "HoneyHoneyHoney!: Aug 22, 2021, Ouchi Jikan and Full Over...",
    "Meta Description": "Looking for information on HoneyHoneyHoney!? Check out the release date (Aug 22, 2021), developer insights from Ouchi Jikan, and a complete game summary.",
    "Alt Text Image": "Official header image for HoneyHoneyHoney! game - Steam 1709590",
    "Canonical URL": "https://gusku.site/game/honeyhoneyhoney",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HoneyHoneyHoney!\", \"description\": \"Looking for information on HoneyHoneyHoney!? Check out the release date (Aug 22, 2021), developer insights from Ouchi Jikan, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ouchi Jikan\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1709590/header.jpg?t=1631676525\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}