{
    "AppID": 962380,
    "Name": "HOT FIT!",
    "Release date": "Nov 30, 2018",
    "About the game": "This story is about a main character working at a fitness gym. Can you meet the expectations of the heroines who are in charge of training?! Let's proceed with the story and enjoy various event scenes! Visual Novel Type Adventure Game, HOT FIT! This story is about a main character working at a fitness gym. Can you meet the expectations of the heroines who are in charge of training?! Sensual event scenes that appear as you progress through the story. Please enjoy the world of Visual Novel Type Adventure Game, HOT FIT! ◆ Story I am a college student aiming for professional instructor. By the time the school begins its summer vacation, I was asked to be a part-time trainer in the gym. The contact person is Mao, a cousin who runs a fitness gym. It has been several years since we last contacted each other. So, I was supposed to start my part time job by living in Mao-chan's apartment. As naturally swept that away, I became the exclusive trainer for female members. Really!? Because of the trauma of the past, I do not get along with women, My older sister cousin, Mao seems to have prepared that solution so that I can overcome it... Some women have a very weak-willed, others are rebellious women. Can I respond to their expectation to become an ideal figure? Although I do not get along well with women yet, can I overcome myself!!?? ◆ Main System ·Message fast forward, voice ON, OFF function ·Volume adjustment for each character's voice, BGM, SE, environmental sound etc. ·Back log ·Auto mode function ·Window or full screen mode ·Skip function about scenes that player has seen once ◆ About this game · Some videos and screenshots on this page are downloadable contents. That is, main events are included in the DLC.　 ·The stories unfold as you go through each scenario. ·There are branches of favorability(flags) system by player's choices. (Only the exclusive stories of each heroine are reflected in this favorability rating.) ·You can experience the story introduction part of this game for free. ·Complete BUNDLE lets you play all these contents, including the free version. ·Apart from Complete BUNDLE, each episode of each heroine is also sold by DLC. ·It is possible to purchase and enjoy just the favorite heroine episode which you want. For example, in Episode Miyu (Harutachi Miyu), you can only play stories centered on Miyu. ·all characters are over the age of 18. Translated by Steam Nyanco Channel.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/962380/header.jpg?t=1582791864",
    "Price": 0.0,
    "Developers": "Cyberworks",
    "Publishers": "Cyberworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/962380/ss_5140eb0f25a5aafd171e837cf1e5290652d5f2f1.1920x1080.jpg?t=1582791864,https://cdn.akamai.steamstatic.com/steam/apps/962380/ss_695cab4f4d3ad6561f61469d0ef791c20fdf9d93.1920x1080.jpg?t=1582791864,https://cdn.akamai.steamstatic.com/steam/apps/962380/ss_84439f2fbd4dd32ac5f2e87f34761fa2ad100e2b.1920x1080.jpg?t=1582791864,https://cdn.akamai.steamstatic.com/steam/apps/962380/ss_332f31ab77dfb3541a421ec697a2c14ca677a53a.1920x1080.jpg?t=1582791864,https://cdn.akamai.steamstatic.com/steam/apps/962380/ss_ace23667ceb88adaa62c2c663272f94a10553365.1920x1080.jpg?t=1582791864",
    "Slug": "hot-fit",
    "Meta Title": "HOT FIT!: Nov 30, 2018, Cyberworks and Full Overview",
    "Meta Description": "Looking for information on HOT FIT!? Check out the release date (Nov 30, 2018), developer insights from Cyberworks, and a complete game summary.",
    "Alt Text Image": "Official header image for HOT FIT! game - Steam 962380",
    "Canonical URL": "https://gusku.site/game/hot-fit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HOT FIT!\", \"description\": \"Looking for information on HOT FIT!? Check out the release date (Nov 30, 2018), developer insights from Cyberworks, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cyberworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cyberworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/962380/header.jpg?t=1582791864\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}