{
    "AppID": 396030,
    "Name": "InCell VR",
    "Release date": "Sep 3, 2015",
    "About the game": "/ InCell is an action/racing game with a bit of strategy and science thrown into the mix in a rare and highly unusual microworld of the carefully recreated human cell. This is the right project to start your acquaintance with VR or receive new VR impressions. The game is focused on Virtual Reality but you can play just fine without a set. Ready steady go! Thanks to all robot-gods out there we will not take this journey alone -  our humble (with a tiny control-everyone mania) assistant is waiting for us (she is so sweet, isn’t she?). The Most Excellent Assistant Zero-Seven (she said that humans may refer to her simply as ‘Your Highness’). So the player’s task is to impress TMEAR07 with experiment on volunteer to unlock new healing technology for humanity. The problem is she doesn’t believe in that possibility because humans are simple and illogical (and she is genius… as always). To cure our volunteer Mrs. Jane Smith and impress TMEAR07  players must select the right way through the objects (organelles) to the cell’s nucleus and do their best in innovative radial racings between selected objects. Each object provides unique abilities to improve racing params or to protect cell with different strategies. How is it going inside the cell? Getting closer to understanding cell structure and organelles functions (which are similar to the real functionality of the organelles) players will improve their skills and will have a chance to impress completely suspicious The Most Excellent Assistant Zero-Seven (who knows why is she so much aware of the other six Excellent Assistant Robots disassembling…). One old and wise robot (he is still remember his 386 childhood) said that it’s a bad idea to make this kind of girl-robot sad… Features Playable with VR (control the movement with your head only, or use keyboard and joystick). Solve the riddle of TMEAR07, find out why doesn’t she believe in the humanity (may be it is just robot’s bad today or some silicon stuff inside your PC makes she sad)? With each new start the cell structure will be generated anew placing the organelles in different locations. This game is a perfect opportunity to learn more about cell microstructure, different organelles and their roles in cell vital activity. Unlock harder difficulties where the true challenge awaits. Hot keys Space - recenter camera position in VR mode M - switch mirroring VR picture on monitor Esc - pause and options menu F5 - hide or show UI F6 - hide or show bathyscaphe F1 - graphics for recommended hardware F2 - graphics for older hardware F3 - decrease rotation speed (highly not recommended, only for experienced VR players) F4 - increase rotation speed (highly not recommended, only for experienced VR players) F7 - reset rotation speed to default Known issues VR on Linux is not yet implemented If you are not using gamepad you may want to plug it off to switch game in mouse/keyboard control mode. Other games by Luden.io / / / /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/396030/header.jpg?t=1646401008",
    "Price": 0.0,
    "Developers": "Luden.io",
    "Publishers": "Luden.io",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_6173af0a8f60776e41d0cdc334b5ea8b61d0e151.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_46f6ebcf51f46b07e4386161ef54eab3a6c8cc7d.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_f5b88af59f79f76a9e249f32ccd8c5016c863717.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_7d0d7e5de66d35113e2270c5753e4e52f08cf995.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_6d2cd4c7ef875537730a30fd86238cd4e91b6c0b.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_e8ff9294a68292c642cfc106babcbf1aadcfb7cd.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_728eebb10382e55c26af98cac9ac90928fb58af2.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_999d0245daf3011b9ca8d6a4baa3cb8fe01f5238.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_e0a678e149f4481964b93ce83f1b5717c2ccaa68.1920x1080.jpg?t=1646401008,https://cdn.akamai.steamstatic.com/steam/apps/396030/ss_776edd2f56226c622692b83fcc6921b6bdd6b1e7.1920x1080.jpg?t=1646401008",
    "Slug": "incell-vr",
    "Meta Title": "InCell VR: Sep 3, 2015, Luden.io and Full Overview",
    "Meta Description": "Looking for information on InCell VR? Check out the release date (Sep 3, 2015), developer insights from Luden.io, and a complete game summary.",
    "Alt Text Image": "Official header image for InCell VR game - Steam 396030",
    "Canonical URL": "https://gusku.site/game/incell-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"InCell VR\", \"description\": \"Looking for information on InCell VR? Check out the release date (Sep 3, 2015), developer insights from Luden.io, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Luden.io\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Luden.io\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/396030/header.jpg?t=1646401008\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}