{
    "AppID": 964650,
    "Name": "Invasion Machine",
    "Release date": "Feb 26, 2020",
    "About the game": "Introduction Invasion Machine is a blend of a sandbox manager and RTS . Your goal is to command troops in an occupied province, in an effort of bringing back peace and order. Kill your enemies, help the civilian population, preserve the resources and the lives of your own soldiers. The Setting What led to our recent occupation of this land is still at the center of a heated political debate. What followed the invasion, was the worst scenario we may ever have imagined - we hoped we’d be able to instill better leadership and let this country rebuild itself. But that’s not what happened, though. Our toppling of the local government created a power vacuum in the area - which is now quickly leading to an unprecedented rise of new powers - the druglords, locally known as Guerrillas. If we don’t stop this transformation, this entire country is gonna explode. We were not preparing for this kind of wae, and it seems it’s the last moment when we can still turn things around. You, as the Commander of this Peace Force are tasked with restoring order and preparing ground for a new, legitimate government. The Mission If we’re to ever leave this land, we must first win over the hearts and minds of the local population. The locals think we’ve ruined their lives and quite frankly - most of them hates us. In order to win their trust - we must do our best to push out the criminal element , neutralize the remaining opposition and offer humanitarian help to them. The Real Mission Politicians run wars, and politicians only care about one thing - getting re-elected. In other words - your real job as the Commander is to make this war look good to the folks back home . Don’t get your soldiers killed, don’t lose too much equipment, and most importantly - don’t let the press see anything that would contradict the official story. And the official story? It’s obviously that we’re winning. The Campaign Divided into 8 chapters. The game takes you through the entire story of the invasion, starting right after the main battle of the war ends . At the beginning you are given just a handful of troops and old, derelict equipment. Unarmored, soft-shell transporters on the frontline? Check . Woodland camo in a desert country? Check . The army wasn’t really prepared for a long invasion, and yours is just one of many missions in this conflict. So if you want better resources - you’re gonna have to prove to your superiors that you’re worth them. The campaign ends once you manage to secure your province and hold elections. When a new government can be trusted with taking the country over, we finally get to go home. What will you be doing in the game? Killing your enemies (car ragdoll, shoot, turret) Using progressively better equipment Arresting those who you don’t kill Disrupting the drug trade Driving cars and leading convoys through conflict area Evacuating the wounded Hiring translators Retrieving damaged vehicles Getting ambushed Completing side tasks, crucial to keeping your bosses happy Sending out patrols Providing security in key locations Searching for contraband Controlling how the press sees this conflict Gaining intel on enemy forces Maintaining your relations with the locals At the same time, your enemy will be: Trying to gain intel about you Patrolling Assassinating your VIPs Kidnapping your VIPs Retributing against locals who cooperate with you Ambushing your patrols Setting off IEDs Making money off contraband sale Trying to push you out of the province What sets this game apart? You’re supposed to preserve your units - your enemy might not treasure the lives of his soldiers, much - but you don’t have that luxury. This means casevacing the wounded and using tactical advantage when possible. Your units are not mindless robots - kill their friend, and they may enter frenzy. Hurt them, and they’ll quickly start bleeding out. Your enemy has no satellite overview of the battlefield, like you do. To fight your forces, they first need to find out where you are. This means the AI will send out recon missions of their own - and if the scouts find high value targets - they’ll report the findings back and call for bigger operations. The locals don’t really have the option of being completely neutral. If the enemy presence is strong in the province, they’ll start cooperating with them, instead of helping you out. Although inspired by real wars fought in the past decade, this game depicts a completely fictional conflict and is not an attempt at social commentary. The characters and incidents portrayed and the names used herein are fictitious and any resemblance to the names, character, or history of any person is coincidental and unintentional.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/964650/header.jpg?t=1610813931",
    "Price": 18.99,
    "Developers": "Pixel Machine",
    "Publishers": "Pixel Machine",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_d639f800c39785ed232d431a3f2e552c78149e6d.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_66dcddc88538d1b5f958ccb4d429989e2e5b7e0e.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_b682318985a095a4b8002d41cc5c028ced607c1c.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_9b0bb0e8e7628d75145d276f57574e75a3a7fdde.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_e01882c6ac3a96ef974d937f9db23285eaef25ac.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_ebb633928badd8b116838b1164327c2b454f1efb.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_38849c627989e9be6da16f9d1f4dc788761e6a1d.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_f665914d932991859789b247d398ac3220c95e7a.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_9de86f0da40c3b8f60755e34b69f9b5dd7812286.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_b89ed715a3cc8422f073e1f61de2b3ca37b57450.1920x1080.jpg?t=1610813931,https://cdn.akamai.steamstatic.com/steam/apps/964650/ss_e1a65eef3d4922919d286ccb22f895165eba4a31.1920x1080.jpg?t=1610813931",
    "Slug": "invasion-machine",
    "Meta Title": "Invasion Machine: Feb 26, 2020, Pixel Machine and Full Ov...",
    "Meta Description": "Looking for information on Invasion Machine? Check out the release date (Feb 26, 2020), developer insights from Pixel Machine, and a complete game summary.",
    "Alt Text Image": "Official header image for Invasion Machine game - Steam 964650",
    "Canonical URL": "https://gusku.site/game/invasion-machine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Invasion Machine\", \"description\": \"Looking for information on Invasion Machine? Check out the release date (Feb 26, 2020), developer insights from Pixel Machine, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pixel Machine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pixel Machine\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/964650/header.jpg?t=1610813931\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}