{
    "AppID": 899310,
    "Name": "Iron Danger",
    "Release date": "Mar 25, 2020",
    "About the game": "Iron Danger is a tactical combat game with a unique time manipulation mechanic. A never before seen combination that blends the tactical depth of turn-based games with the exciting action of real-time games. Tackle challenging encounters with your party of two characters, using a variety of skills and highly interactive environments. Maybe you will set an enemy on fire and kick them into a grain field for a proper barbeque, or set up a trap and fell a tree on top of them. The options are endless and it is you who will be deciding your own approach! You have control over time The core of Iron Danger is its unique time control mechanic. You can rewind time for up to 5 seconds whenever you want, trying different strategies and combinations of moves until you find the right one for the task at hand. The time manipulation allows us to combine real-time combat gameplay with controls from more traditional, tactical turn-based combat games. This gives tactical combat a puzzle-like element, as you can continuously keep trying new approaches to turn impossible odds to your advantage and synchronize the actions of your characters for the perfect outcome. You will die, but you will not fail! Iron Danger is set in a world of lofty fells, primeval forest, and placid lakes... as well as living gods and monsters of steel. The city of Kalevala, home of the humans who rebelled against the gods and forsook their protection, shines in the middle of this world, surrounded by towns, sea lanes and and woodlands under its protection. But from the frozen north, a witch queen is leading her army on a quest for vengeance against the lords of Kalevala. Ancient ruins from the days when gods dwelled on the earth are opening to unleash forgotten powers, tempting humans and striving to overtake the world. You’ll take on the role of Kipuna, a sharp-witted village girl, who becomes imbued with an ancient power that grants dominion over time and death. You must use your wits to control it as you’re drawn into the midst of a war between the city of Kalevala and the armies of the Northlanders driven by their witch queen Lowhee. Your task is to master the power, in order to use it for mankind’s protection, while your enemies will seek to harness it in the service of total destruction. Use unique time-rewind mechanics and experience a new take on tactical combat combining best aspects of real-time and turn-based combat. Use highly interactive environment for your advantage to succeed against impossible odds. Adventure in a world of steampunk fantasy and meet its unique inhabitants inspired by Finnish folklore. Fight epic boss monsters on the path to fulfill your destiny. No grinding; character progression pace is controlled by the story and every fight matters. 15+ hours of gameplay",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/899310/header.jpg?t=1632157998",
    "Price": 2.99,
    "Developers": "Action Squad Studios",
    "Publishers": "Daedalic Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_49fd518993dac40d11452b3dcd8f32a34c0db24a.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_19d39d65d554e623c4b5a755a165e2beee49b7d4.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_61ef018af59b6eb4fcb26f57eff45ad1cc4f6910.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_9a7b8b68dce96110475ee72b2f8a1ba96c18af04.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_301b898f7e1904305e13ccb1ee8be9d5c60125da.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_2a4808177d0f4e2c9c9209c6de81bb6e80d548d5.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_c5581595fa3a2a1ebafbb64424b74479e02dd818.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_92dab08d306a51b1e9ed4e00bcf657177af64509.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_aacf117ada8cfc70e3834b586a3dfcc3f1856317.1920x1080.jpg?t=1632157998,https://cdn.akamai.steamstatic.com/steam/apps/899310/ss_55ad4205ac5b46807dec6de927fcba3193c8500f.1920x1080.jpg?t=1632157998",
    "Slug": "iron-danger",
    "Meta Title": "Iron Danger: Mar 25, 2020, Action Squad Studios and Full ...",
    "Meta Description": "Looking for information on Iron Danger? Check out the release date (Mar 25, 2020), developer insights from Action Squad Studios, and a complete game sum...",
    "Alt Text Image": "Official header image for Iron Danger game - Steam 899310",
    "Canonical URL": "https://gusku.site/game/iron-danger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Iron Danger\", \"description\": \"Looking for information on Iron Danger? Check out the release date (Mar 25, 2020), developer insights from Action Squad Studios, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Action Squad Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Daedalic Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/899310/header.jpg?t=1632157998\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}