{
    "AppID": 900330,
    "Name": "King-Dom",
    "Release date": "Jul 30, 2018",
    "About the game": "'How about a nice game of Chess ... Weaponised?' 'Verily, A Gameth That Hath The Familiar ... And Yet Also, The Not-So !-)' PC 64-bit, Windows 7+, DirectX 11, shader model 4.0, full-screen/windowed. A TWO-PLAYER ONLY online (choose an opponent from your Steam friends list) Chess, in an edgeless landscape called 'Kingland', with upgrades. You can choose to play a traditional game of Chess (choose landscape size 'Chess'), or enhanced Chess in one of nine million procedurally-generated landscapes. Koins can be collected, to purchase reinforcements, and bombs retrieved, to toss at the enemy! Cheese can be picked up to replenish pieces' energy levels. You can use one Rook to build board square paths across empty landscape, and two corner Rooks to enclose and fill rectangular areas, to claim territory and 'magically mine', or 'pop-up', goodies from Kingland. You can move your King inside a Rook to beat a hasty retreat. Knights can perform a double move (two of the standard moves in one). Etc. The game is not officially early release, but please do not assume that means no further development will occur. Please see the Facebook page for current and future additions. If you don't like something, or have suggestions you would like to see, or the game does not function correctly on your particular machine or graphics card, please email me first, rather than instantly posting a negative review. In the case of bugs, please include a screenshot where possible. King-Dom-maddma@outlook.com You may notice, I haven't specified minimum hardware requirements. Apologies. Me is very, very software, but not at all hardware, so I dunno. Hopefully it helps if I list my PC's specs ?-) Acer Predator G5900 Intel Core i5 CPU 650 3.2 GHz 8GB DDR3 RAM NVIDIA GeForce GT 340 Windows 10 64-bit x64 Update (18/3/19): It runs plenty-fast on me old machine, but now also have a new PC: Intel Pentium CPU G4560 3.5 GHz 8GB DDR4 RAM 2400 MHz NVIDIA GeForce GTX 1050 Ti Windows 10 64-bit x64 And, yes, me is very, very, very happy with how Kingland runs there !-) Also, I can actually record actual videos of King-Dom with me new machine … will be posting a proper one this week ... First, both players (Steam friends) must be running Kingdom to start a game. There are two start game options listed first on the title screen, Landscape (procedurallly-generated map) and Kingland (as saved by the editor). Whomever is to be player One, and thus have the first move in the game, then does this: 1) press Start Landscape Game 2) choose a landscape number and type: click on a digit's top half to increase it, or bottom to decrease 2) select the pre-arranged opponent from your Steam friends list, and press PLAY to send the invitation or 1) press Start Kingland Game 2) choose from your list of editor-saved (or downloaded) Kinglands 2) select the pre-arranged opponent from your Steam friends list, and press PLAY to send the invitation Meanwhile, back at the player TWO ranch: 1) you will receive the invitation, thus press the TICK button to accept it Next, the selected Landscape will be terraformed, or the Kingland transferred. This will take a little while, but the result will be cached to hard-drive, for instant future playing (eg: when load a saved game). The game comes with '000000' Chess, Standard and Big landscapes pre-saved. The remaining options on the title screen are: load a previously saved game (either type), start the Kingland Konstruction Kit (editor), and Quit !-) There are four landscape sizes: 1) Chess (no enhanced game options are enabled - only flat terrain permitted) 2) Standard = 64 x 64 board squares 3) Big = 128 x 128 4) Massive = 256 x 256 There are three landscape terrains: Generally Flat Undulatingly Hilly Toweringly Mountainous There are one million initial seed numbers for the procedurally-generated landscapes. Thus this gives 9 million different landscape permutations (for playing King-Dom), and one million very similar Chess boards (for playing standard Chess). Simpy point at the center of the base of a piece, and LMB to select it, then point at a valid board square to perform a move (green cursor). You can press the RMB, and move the mouse, to rotate the camera, and the mouse wheel zooms in and out of your selected piece. Keys 'Z' and 'X' can be used to cycle through your pieces. The save game button at screen center right is available when it is your move, and obviously causes both player's machines to save the current state of play. At the screen lower right is a 'Draw' button which causes the battle to be declared a draw if both players have pressed it. The screen lower center shows camera direction and angle buttons, when you are not in the shop. The rest of the details here pertain to (enhanced) King-Dom, not (traditional) Chess ... To build a straight line of board squares using your selected Rook, just point at where the final board square of your intended path would be, and press LMB to build it. Or you can use two Rooks, one on each opposite corner of an enclosed rectangle of board squares (maximum size 32x32), to fill the inner area with board squares, by pointing at where any of those squares would be. Rooks can build only once per move, and as the squares magically fall from the night sky, they might randomly 'pop-up' goodies from out of Kingland. Building board will also mark your territory, with silver or gold squares. These cannot be used by your opponent's pieces, except in the case of a Knight performing a double move. If your selected piece has any bombs, point at an empty board square to toss it there (red cursor). Bombs can be tossed over more squares when tossing from a higher to a lower altitude. Press 'B', or click on the bomb icon, to toggle your Bomb-O-Scope! Pieces caught in a bomb blast radius of 3 squares will have their energy reduced by 1/4. A small amount of energy is also lost by pieces (1/200) per moved square (knights move one or two squares per move). Energy is replenished by collecting cheese from the board, which will be consumed by pieces as required, giving a 1/4 energy boost. You can also drop a cheese on the start square of your next move, by clicking the cheese icon before moving a piece, to allow another piece to retrieve it. Your King can move to the same square as one of your Rooks to enter it, by pointing at the Rook's board square (instead of the base of the Rook). To exit, simply attempt to move the Rook one square diagonally. A Rook containing a King cannot build board squares. Knights can perform a double move (two of the standard moves in one). Purchased pawns can move one square in any direction, and can only take an opponent piece when moving diagonally. The board also contains Koins (Silver 500 and Gold 1000 K - Kurrency), and during your move, you can enter the shop using the trolley button at the left of the screen. In the shop, you can select your desired piece, if affordable, and then you should press on an empty board square next to your king, to purchase the reinforcement piece, and place it next to its leader. Z = select previous piece X = select next piece B = Bomb-O-Scope on/off (or LMB on bomb icon) F = Pawn-Faces on/off M = RMB-rotate fix-mouse on/off F1 = if Chess (not King-Dom) change view between selected piece and board center F2 = if Chess (not King-Dom) camera buttons on / off F3 = anti-aliasing on/off F4 = low visibility mode on/off (low runs faster) As you point at the landscape, a virtual board square is drawn, which can be added via LMB. An existing pointed-at board square is removed by LMB with SPACE pressed. You can join an added square to the last square you have previously added (yellow cursor) by pressing CTRL. This allows you to add (or remove) straight paths of board squares (new square in-line with previous), or entire rectangular areas. If there is already a board square there, then LMB will add the current editor object (as at screen lower-right) upon it, replacing any existing object, again with SPACE pressed to remove an object. However, if the current editor object is a tree or a rock, then no virtual square is drawn, and you would be adding or removing such objects from the landscape instead. You can LMB in the map at screen top-left to move the cursor to the corresponding landscape location. The controls at the bottom of the screen are divided into Landscape (lower-left) and Objects (lower-right). The first three Landscape buttons are Small / Medium / Big Random Hill, which will be applied at a random location in the map. Also pressing CTRL will apply a valley instead of a hill. The next three buttons are Hill Show / Apply / Undo. These are used to Show the result of pressing Apply to apply the current hill settings, centered upon the current editor cursor location. Next are three sliders: hill Height and Radius, and Water height. First two define the hill size as used by the Show and Apply buttons. Height ranges from - through zero to +, Radius is 1 upwards. Water, obvious. Next are two buttons (left &amp; right) for choosing landscape texture/colours (keys Z/X). The Objects controls show the current editor object with (left &amp; right) buttons (keys V/B and C), a size slider for trees and rocks, and three buttons: if current editor object is a tree or rock, will randomly place objects in a small / medium / big area, centered on the cursor location. To the right center of the screen, the three buttons are Load, Save, and Upload to the Steam Workshop. During Load and Save, a folder button exists at screen lower-left. This will open the Kinglands folder, and yes it is safe to rename your own '.kgl' files, as long as you do not change the extension, of course. Downloaded Kinglands which you have subscribed to in the Steam Workshop should NOT be renamed. Upload is only permitted if the Kingland has valid pieces, ie: both players have the same numbers of pieces, and only one King each. CURSOR COLOURS: Green = the board square location which is the camera's target Yellow = the previous added board square which will be joined with a path or rectangle Also drawn, if the mouse is diagonally inline with previous board square, is a second yellow cursor. This makes it a much simpler task to add a square of board squares (rather than an accidental rectangle). Cursor Keys = move editor cursor (camera target) around landscape SPACE = turns Add into Remove CTRL = joins to previous Add/Remove board square Z = previous landscape texture/colours X = next landscape texture/colours C = invert piece editor object player V = previous editor object B = next editor object L = load a Kingland S = save current Kingland Your suggestions for the evolution of Kingland are craved - please see the email address below - and I have more I'll be adding in coming weeks. The Facebook page lists the planned additions to the game ... please consider liking it ?-) The email address for suggestions/bugs: king-dom-maddma@outlook.com Infinite thank yous !-) maddma",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/900330/header.jpg?t=1554141466",
    "Price": 2.99,
    "Developers": "maddma",
    "Publishers": "maddma",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_0cada2975e3be0858d37b1b39acbf76f2490940a.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_f468ffbe13c993182e930df2d5b18b2660a41aca.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_cbf234fddfabbccabbc5af117afaa21d25f3b069.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_c2f2044a2f79d0901500e57d95f75ce76db00543.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_cee7e91eee4ee97f8300cf3970aafbfa822b9e31.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_d75c4ff22e71e911bea25ae475cb94fbeed007e4.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_97f0b94e5a1652f34f95b25dd16664cfe1cdb2d9.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_9a8ef3713c51437f251519778d7b046d18f5e94b.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_2d57c868376a62eada69e8fa6158cd45327f0984.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_f0f42b5f301ff0e6a852b1e8559c06cde9189fa2.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_b3458a2575fbdd2e44c8318cec33fd0609959a8c.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_da51415b0c6c12bbbe7674edddad55431fae11e8.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_ddc6cefa7cf491f6a54798e52368e21e01ad32d7.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_2eb908d639e31ffa7fabe0f4a91cc646b1cf5b61.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_d971173771449d76db86e6b516da3bc740ede315.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_5361c5409b0444faa5cb08d33646e7b2e264a482.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_c6a5bb3f19e2a7e97357a8c06d933f10bf75ccb2.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_da54c260dc184c9153ba692b552daaaaaa04f6b0.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_a4a9436b8a3c081808fc5ccb56b3fd705c6106bf.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_daa8e880ba4d2ac0f9948a888cb6a5c10e94f389.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_e50ecf09a859adc34eec2e76831dc4f0141e057c.1920x1080.jpg?t=1554141466,https://cdn.akamai.steamstatic.com/steam/apps/900330/ss_4e979ea9b99eee447225aacfccc33668f44bf8f6.1920x1080.jpg?t=1554141466",
    "Slug": "king-dom",
    "Meta Title": "King-Dom: Jul 30, 2018, maddma and Full Overview",
    "Meta Description": "Looking for information on King-Dom? Check out the release date (Jul 30, 2018), developer insights from maddma, and a complete game summary.",
    "Alt Text Image": "Official header image for King-Dom game - Steam 900330",
    "Canonical URL": "https://gusku.site/game/king-dom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"King-Dom\", \"description\": \"Looking for information on King-Dom? Check out the release date (Jul 30, 2018), developer insights from maddma, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"maddma\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"maddma\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/900330/header.jpg?t=1554141466\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}