{
    "AppID": 1485190,
    "Name": "Maelstrom: A Yaoi Visual Novel",
    "Release date": "Apr 6, 2021",
    "About the game": "Disgraced soldier Demetri is exiled to Secren, a dangerous world devoid of women. Earthlings are smaller and weaker than the violent men of Secren. Demetri's only hope for survival is to bond with a strong mate who can love and protect him. The heterosexual Italian-American is reluctant. He's not a homophobe, but he won't have gay sex to survive--or will he? Based on the Bestselling novel series by author Yamila Abraham, and illustrated by the internationally renowned art studio Dany&amp;Dany! Finally, Maelstrom fans have a new format to enjoy this extremely popular story. While mostly linear in presentation, Maelstrom includes three possible love interests for Demetri to choose from, and has a number of pivotal choices to guide the story. Multiple endings can be achieved in every route! Maelstrom is rated 'Mature Players' only. There is no explicit sex or nudity illustrated in the game, however, it is heavily implied, vividly described, and alluded to. A 150,000 Word Game with Numerous Endings Four Love Interests Many Steam Achievements! Press 'v' on your keyboard to have all text read aloud Up to 35 Gorgeous CGs! 17 Different Music Tracks Your Favorite Characters from the Novels Plus Amazing New Ones! Mostly Linear Storytelling, with Pivotal Choices Added Happily Ever After Endings for Every Route! High Stakes Drama Add Authenticity to Demetri's Inevitable Seduction! A Sci-Fi Game with a Wild West Motif Characters Play as Demetri. He disobeyed an order to try to save the lives of his squadron. They died, and he ended up court martialed. He has 20 years hard labor on Secren and thinks he can get by without becoming someone's boyfriend. It's not like he's a homophobe, he just isn't into dudes--for now. Sadly, having to bond with a man may be the least of Demetri's problems. Planet Secren is a violent and dangerous world. Things become real for him fast, and he doesn't know what he's going to do. Helix was the only love interest in the original novel series (who was named Maelstrom) and is the 'cannon' route here. Helix is the hero you need to survive this horrible planet. How long can you resist this charming mine-lord? Jader isn't evil, he's just a victim of the horrible circumstances on his planet. When he injured his leg he couldn't mine anymore and had to join a biker gang of cannibalistic criminals. He doesn't like what he's become, and takes drugs to numb his pain. He'd become clean and walk away from it all for a guy like Demetri. Zheng Li is the reason Secren is such a terrible planet. He lives in his lofty fortress above all the suffering. For him, miners are just disposable assets. He thinks it's fine for the weak ones to die. That just lets stronger miners take their place. Now that he wants Demetri he'll have to open his eyes to how horrible he let things get. AVAILABLE NOW! Sawyer is a mystery wrapped in an enigma! Unlock the Sawyer Bonus Love Interest Route after you successfully get good endings on the Helix, Jader, and Zheng Li routes. ​ A whole plethora of side characters support the action in this game! We want to make more yaoi games! We'd appreciate your support for Maelstrom: A Yaoi Visual Novel Other Games from Y Press Games",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1485190/header.jpg?t=1655240533",
    "Price": 15.99,
    "Developers": "Y Press Games",
    "Publishers": "Y Press Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_281f6e044200c11e2223e5bb88fdfc78b07b5327.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_6ac959a2d037071c5b0ffda0ac573daba9ef7d25.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_3bec814e5e5d0379e21ae2d1e298d743e4c948a7.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_debb54b35f63bd322fa6926615c0656a57eebcaf.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_892235f5fb7dcbb1c8a6a250199bd0220e352138.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_55b876555871c0ccfccb9405c5157a25bd3b9c79.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_cd445d5bd104b33876bea5099f0f351b39d1a4fd.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_b36dfffaa3278c54a61f5dad78169902293ee6da.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_9987daf61af79e890cb7550325038d6e1951153d.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_17f43ebd621cf593d5590ff8b3c9244540f72e30.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_251070b05a905cb761aab6deea13dfc776cc77c9.1920x1080.jpg?t=1655240533,https://cdn.akamai.steamstatic.com/steam/apps/1485190/ss_717498cd613d2d7046d0c4e4bc623f223fef970b.1920x1080.jpg?t=1655240533",
    "Slug": "maelstrom-a-yaoi-visual-novel",
    "Meta Title": "Maelstrom: A Yaoi Visual Novel: Apr 6, 2021, Y Press Game...",
    "Meta Description": "Looking for information on Maelstrom: A Yaoi Visual Novel? Check out the release date (Apr 6, 2021), developer insights from Y Press Games, and a comple...",
    "Alt Text Image": "Official header image for Maelstrom: A Yaoi Visual Novel game - Steam 1485190",
    "Canonical URL": "https://gusku.site/game/maelstrom-a-yaoi-visual-novel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Maelstrom: A Yaoi Visual Novel\", \"description\": \"Looking for information on Maelstrom: A Yaoi Visual Novel? Check out the release date (Apr 6, 2021), developer insights from Y Press Games, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1485190/header.jpg?t=1655240533\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}