{
    "AppID": 1943490,
    "Name": "Magic Griddlers 2",
    "Release date": "Mar 28, 2022",
    "About the game": "For all griddlers fans, it’s time to dive into a new adventure in Magic Griddlers 2! A wicked warlock has captured six magicians in the world of magic. He locked them away in tall magical towers and enchanted the locks. Solve all 120 griddlers to get to the bottom of his magical secrets. In this sequel to Magic Griddlers, you will find unique nonograms with a fantasy theme. Complete all these magical puzzles and become a true hero of Wonderland! Step into the fairytale forests of the Enchanted Valley, climb the high Crystal Mountains, dive into the clear waters of a magical lake and pass through a trial by fire. Do you have the bravery to go in search of such incredible, but dangerous wonders? 120 unique puzzles makes for a challenge for true nonogram fans. Six locations in six worlds, each presenting its own magical element. New and improved controls! Gameplay built on logic and nothing else: you’ll never have to guess a solution again! Improved tutorial. Choose your training level depending on your skills, and complete only the parts of the tutorial that can help you. The game offers wonderful, calming music, premium-class graphics and a classical fantasy atmosphere. This is a game for a true hero that has the courage to go in search of wonders. Use your skill to solve each logic puzzle and defeat the forces of treacherous wizardry and dark magic. It’s time to depart from the everyday bustle and immerse yourself in an atmosphere of adventure with classic griddler gameplay! Set off in search of wonders, solve all the villain’s puzzles, and free all the magicians in this world of magic! A Griddlers game 120 unique levels and 6 locations Gameplay built on logic alone with no need for guessing More than 12 hours of gameplay with relaxing music New and improved tutorial, 3 help sections Choose a training level based on your skills and complete one of 2 tutorial parts you really need Special tasks and more than 15 colorful trophies Colorful high-quality graphics helps you to sample the atmosphere of magic world!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1943490/header.jpg?t=1648531116",
    "Price": 4.99,
    "Developers": "Creobit",
    "Publishers": "8Floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1943490/ss_7a238ed6b07b010f4ae6fd0ed6f6b8a6a8c0630d.1920x1080.jpg?t=1648531116,https://cdn.akamai.steamstatic.com/steam/apps/1943490/ss_ac22a5436d07b88d2ae1e73240bfb64aea537afe.1920x1080.jpg?t=1648531116,https://cdn.akamai.steamstatic.com/steam/apps/1943490/ss_004d339bd2f6dc85e018812c31442bfcc096bf52.1920x1080.jpg?t=1648531116,https://cdn.akamai.steamstatic.com/steam/apps/1943490/ss_30e993bdfef76554fcecfef895b3f1c047cc7ff9.1920x1080.jpg?t=1648531116,https://cdn.akamai.steamstatic.com/steam/apps/1943490/ss_165eb0c71908fd1beaf5f9ea5645ff84f1b9b3c2.1920x1080.jpg?t=1648531116",
    "Slug": "magic-griddlers-2",
    "Meta Title": "Magic Griddlers 2: Mar 28, 2022, Creobit and Full Overview",
    "Meta Description": "Looking for information on Magic Griddlers 2? Check out the release date (Mar 28, 2022), developer insights from Creobit, and a complete game summary.",
    "Alt Text Image": "Official header image for Magic Griddlers 2 game - Steam 1943490",
    "Canonical URL": "https://gusku.site/game/magic-griddlers-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magic Griddlers 2\", \"description\": \"Looking for information on Magic Griddlers 2? Check out the release date (Mar 28, 2022), developer insights from Creobit, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8Floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1943490/header.jpg?t=1648531116\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}