{
    "AppID": 531080,
    "Name": "Minotaur's Maze",
    "Release date": "Apr 12, 2017",
    "About the game": "IMPORTANT NOTE: Oculus Touch Controls are not supported or tested. Only HTC Vive controls have been tested. If you play with an Oculus it is recommend that you use a gamepad. Minotaur's Maze is a tactical tabletop dungeon crawler brought to life in VR. Classic Fantasy Gaming Experience Dozens of Unique Monsters Randomized Dungeon Layouts and Item Drops Overview Harrowing encounters, tactical gameplay, fantastic miniatures, and dark, forbidding dungeons. Every time you play, it’s a different experience generated and managed by a digital game master. You never know which monsters, potions, spells, and equipment you will encounter along the way, and it’s up to you to make the most of it. Sometimes, you’ll charge into battle, wielding powerful weapons and armor, while other times you’ll execute a carefully planned sequence of spells to annihilate your foes. The object of the game is always the same: Reach the bottom level of the dungeon, retrieve the Lyre of Electra, and return to the surface. One of the charms of Minotaur’s Maze is the surprising variety of situations you’ll find yourself in. No two games are ever the same. Minotaur’s Maze was designed for VR from the start. It’s streamlined — complex enough to be interesting, but simple enough to learn in a few minutes. It feels good to play for 20-40 minute sessions (about how long we like to wear an HMD), and you can probably beat it in a few hours — once you “get gud'. No nausea! We specifically used a third person perspective of a minature world because it eliminates gross artificial movement, awkward teleporting mechanics, and other problematic issues with VR. Multi-Input Device. You can play with hand controls or a gamepad, using a VR HMD or a standard monitor or TV, depending on what you prefer. 3D Audio. The sounds of the dungeon are positioned using binaural 3D, to create a totally immersive experience. This is a game that works in VR - because it was designed for VR - from day one. UPDATES: Apr 14, 2017 - 0.13, Made bugfixes based on user feedback. Murphy's law, these were new bugs that slipped past QA! Apr 18, 2017 - 0.14, Some UI issues addressed, Save/Continue added back in, other misc. bugfixes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/531080/header.jpg?t=1492572349",
    "Price": 9.99,
    "Developers": "Sisyphus Games",
    "Publishers": "Sisyphus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/531080/ss_663622d89b8fc66ddb5585989e556d43d9a80d3d.1920x1080.jpg?t=1492572349,https://cdn.akamai.steamstatic.com/steam/apps/531080/ss_26c0b6950121162fb691dea4b5d4cd907e4b103f.1920x1080.jpg?t=1492572349,https://cdn.akamai.steamstatic.com/steam/apps/531080/ss_6fcdb0a5bd321e189bbcf1e169b237452eda6455.1920x1080.jpg?t=1492572349,https://cdn.akamai.steamstatic.com/steam/apps/531080/ss_35596927fb8fb5ce8fd2ab53f3580847af4bf80f.1920x1080.jpg?t=1492572349,https://cdn.akamai.steamstatic.com/steam/apps/531080/ss_a0f4aa432509dba995acbe150c65b010b57e49fa.1920x1080.jpg?t=1492572349",
    "Slug": "minotaur-s-maze",
    "Meta Title": "Minotaur's Maze: Apr 12, 2017, Sisyphus Games and Full Ov...",
    "Meta Description": "Looking for information on Minotaur's Maze? Check out the release date (Apr 12, 2017), developer insights from Sisyphus Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Minotaur's Maze game - Steam 531080",
    "Canonical URL": "https://gusku.site/game/minotaur-s-maze",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Minotaur's Maze\", \"description\": \"Looking for information on Minotaur's Maze? Check out the release date (Apr 12, 2017), developer insights from Sisyphus Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 12, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sisyphus Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sisyphus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/531080/header.jpg?t=1492572349\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}