{
    "AppID": 387270,
    "Name": "Mystical",
    "Release date": "Jul 31, 2015",
    "About the game": "Mystical is a different kind of puzzle game. Collect hundreds of items in five mystical places and combine them all in the given time. Manage your gold coins needed to purchase each item. Find multiple bonus items that will be of great help in the most critical moments. Once you have gained enough experience, you must go in search of artifacts and relics scattered across 26 unique mini-games put your visual and cognitive abilities to the test. Start your medieval quest for knowledge without further delay! Visit a total of 5 places of power in order to collect hundreds of items scattered throughout the vast world of Mystical. Find the objects belonging to the same family and group them to further your knowledge of that type. From the village to the dungeon through the castle, the crypt and the temple, you must overcome the increasing difficulty and aquire the multiple bonuses that cross your path. Your main quest is a quest of knowledge, of learning everything you can about all the items in the world. To assist you, you're going to need to find gold to buy every item you need in your quest. The more items you create, the more you learn. Gradually you will earn the title of scholar. Then you will gain the sacred keys that give you access to the secret rooms of Mystical. Behind these doors, 16 magical artifacts and 10 enchanted relics await you. Knowledge, mental alertness, dexterity and visual acuity will be among the essentials to accomplish these new tests. Maybe one day you'll have all these treasures... Overview In Mystical, you must perform each trio and each twin within the time limit to win. A trio is a family of 3 items. A twin is the same item twice. Then for each trio, you have 3 twins. When you play, each family of the current stage are shown at the top of the screen. You can scroll them with the right mouse button. To perform a trio, you must buy each item within that trio by clicking on them in the main area. When they are in your bag slot at the bottom of the screen (15 items max), you can validate the combination by using a magnifying glass. To perform a twin, you must buy the same item twice. When the twin is in your bag, you can validate it in the same way as trio. You can put several combinations in your bag before validate them. You can buy the items out of the correct order but you will win more points if you buy them in the order shown. When you do this, it is called a perfect trio. In the same way, to perform a perfect twin, buy the 3 twins in the correct order. The green lights under the families shown at the top of the screen will light if perfect trio and/or perfect twin matches are made for this family. I suggest you do them all... Don't forget to pick up gold coins and magnifying glasses. Each item you put in your bag costs 1 gold coin and you will need magnifying glasses to validate the combinations in your bag. You lose if you run out of time, if the central area is full or if your purchased item bag is full without any solutions. Mystical has 5 levels of increasing difficulty. The levels are the village, the castle, the crypt, the temple and the dungeon. There are 10 stages for each level. The families of items are different and specific to each level. For each stage, you can win a bronze, silver, or gold cup depending on your score. All stages can be restarted at will to help you improve your results (points and/or elapsed time). On the other hand, you must successfully complete a stage to access the next one. In the same way, to access the castle (level 2) you must completly finish the village (level 1) and so on. Levels overview The village (Level 1 – Novice) - 10 families (same item / different colors) in the final stage (stage 10). - This level is designed to allow you to learn the game and gradually understand the basic concept of gameplay. - To help you in this level, the inventory bonus is activated automatically. This bonus shows what you have completed and what you still need to create. The castle (Level 2 – Apprentice) - 12 families (same item / different colors) for the final stage. The first stage has 3 families. - Wall of gears in the background to destroy. - Bomb bonus item to help you if you need places. The crypt (Level 3 – Master) - 15 families (different items / same utility) for the final stage. The first stage starts with 6 families. - Bomb items + stone items to search for diamonds (good to increase your score). - Key items + chest items to gain bonus items that you can keep for use in other stages. The temple (Level 4 – Expert) - 15 families (different items / each item of an equipment set) for the final stage. The first stage starts with 6 families. - Bomb items + stone items to search for diamonds (good to increase your score) - Key items + chest items to gain bonus items that you can keep for for use in other stages. - Wall of gears in the background to destroy. The dungeon (Level 5 – Scholar) - 20 families (different items / races of Mystical) for the final stage. The first stage starts with 11 families. - Bomb items + stone items to search for diamonds (good to increase your score) - Key items + chest items to gain bonus items that you can keep for other stage if you want. - Wall of gears in the background to destroy. - To help you in this level, the inventory bonus is activated automatically. This bonus shows what you have completed and what you still need to create.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/387270/header.jpg?t=1556549285",
    "Price": 0.0,
    "Developers": "Philippe Forgeur",
    "Publishers": "Philippe Forgeur",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_6770106c7d16ed5b652ec054978034bf991c87cc.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_c1dfd9bc7612f91c6cf1976183d09a7162b0afd2.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_a38056d0e7e8d618718ec8fd71f4dbb3a67213a2.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_18b8ade18615ee6b41b2c9b64a206e4487226d02.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_9ae6151af3b79c2e0c16a95e8ec88ba0b9bfa402.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_d8697e3b538e6f18c6ca2e13c5d194795495a5c2.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_e974b52b656391ae24142da6f28e1f19d0041f48.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_6b2b51a580a1031e4e9fec52aa0871a39710d67f.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_7cd126538aca68761bbcc60ceb241a6a67250de4.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_b09a70babc966288ce4710c6fc649782ab2bae5d.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_1b5c5f6844b5fd2147f35039db837744487005a5.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_b09a70babc966288ce4710c6fc649782ab2bae5d.1920x1080.jpg?t=1556549285,https://cdn.akamai.steamstatic.com/steam/apps/387270/ss_0bdef43d05201bb75eca5e06ce61ae32a9bcad68.1920x1080.jpg?t=1556549285",
    "Slug": "mystical",
    "Meta Title": "Mystical: Jul 31, 2015, Philippe Forgeur and Full Overview",
    "Meta Description": "Looking for information on Mystical? Check out the release date (Jul 31, 2015), developer insights from Philippe Forgeur, and a complete game summary.",
    "Alt Text Image": "Official header image for Mystical game - Steam 387270",
    "Canonical URL": "https://gusku.site/game/mystical",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mystical\", \"description\": \"Looking for information on Mystical? Check out the release date (Jul 31, 2015), developer insights from Philippe Forgeur, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Philippe Forgeur\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Philippe Forgeur\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/387270/header.jpg?t=1556549285\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}