{
    "AppID": 1992980,
    "Name": "Pentomino",
    "Release date": "May 31, 2022",
    "About the game": "Game Features This is a very intuitive puzzle game, which can be played smoothly by 6-year-old children to 99 year old people. Its lower limit is very low and its upper limit is very high. It may be the easiest and most difficult puzzle game. Those who can full score pass all levels are geniuses. From easy to difficult, from low to high, the game has 14 sections，from A to N，148 levels for you to challenge. After each section is cleared(passed), the puzzle of this section can be generated again, which is not repeated every time. You can challenge again and again. This game will not have any video or graphic strategies to help you draw gourds to solve your puzzles. This is the most powerful puzzle game. Your world is unique. Explore your own world. The Secret Of the Game Five cube can form up to 12 different shapes. 12 is a magical number. One dozen is 12, 12 months, 12 hours, 12 hours, 12 zodiac signs, 12 volts, 12 function keys, 12 color rings. Why 12. What's the secret behind the number 12? If you are a child or student, this game will give you the most intuitive way to understand the NP problems (the first of the seven mathematical problems) that can be seen everywhere in daily life. The game will give you the most intuitive way to understand: why is the world so complex and so difficult. What is one of the reasons why predicting the future is so difficult? The future may be impossible to predict at all. There are nearly 8billion people in the world. Each person is a unique shape. If it cannot be calculated, it cannot be predicted; If it cannot be predicted, it cannot be controlled; Can we control everything? NP-&gt;P ? (million dollar prize is waitting you). Invention Of the Game Pentomino, or five grid dominoes, is known in China as the 'brain racking twelve pieces'(伤脑筋十二块) ,Some data records show that it was invented in the last century and many scholars have studied it. The invention of the well-known game 'Tetris' is based on the research and simplification of five grid dominoes. Personal guess: Maybe its invention history may go back hundreds or thousands of years. The five small square elements are very similar to Gobang(Renju), and gobang is a simplified version of Go. It is also very similar to the pattern on Chinese mahjong. And these games are very old. This fit space logic is very similar to the tenon and mortise structure. The tenon and mortise structure appeared and applied in ancient Egyptian civilization, Lianghe civilization and ancient China. Maybe this game is a tool or toy for ancient craftsmen to study the tenon and mortise architectural structure. Why Make This Game After the Spring Festival, I strolled around Zhengjia Plaza in GuangZhou on Sunday, February 13, 2022, I found that there was a building block toy named 'catamino' in a toy store. Generally, I was not interested in this childish toy, but after the clerk explained it patiently and tried it for a while, I found that the game was surprisingly difficult and full of challenges. After going home and consulting relevant materials, I found that it was a very difficult mathematical problem and a very interesting spatial logic game. The original 'brain racking twelve pieces' was so difficult that it was a very interesting game because its nightmare difficulty was daunting and out of reach. It must be redesigned to bring happiness and challenges to more people.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1992980/header.jpg?t=1657395232",
    "Price": 3.99,
    "Developers": "zeroSpace",
    "Publishers": "zeroSpace",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_a4503f604d3233b72c71b49ba9c796bd64e8c0b6.1920x1080.jpg?t=1657395232,https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_7fa344ee7a3f297cd309664a2b68b10324ca2e23.1920x1080.jpg?t=1657395232,https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_2c0b0aa0cb03054d3adda3dcb3d931fe624ae38f.1920x1080.jpg?t=1657395232,https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_827003a8467c62848a838bce543f4c3665c037f9.1920x1080.jpg?t=1657395232,https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_2228446339244432242af30077bd735dc8ce0d44.1920x1080.jpg?t=1657395232,https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_336107f6edc20cf4dd60fcd0ce01035860e075e9.1920x1080.jpg?t=1657395232,https://cdn.akamai.steamstatic.com/steam/apps/1992980/ss_fd4d78dd84e373bb967770b636800df03f26f915.1920x1080.jpg?t=1657395232",
    "Slug": "pentomino",
    "Meta Title": "Pentomino: May 31, 2022, zeroSpace and Full Overview",
    "Meta Description": "Looking for information on Pentomino? Check out the release date (May 31, 2022), developer insights from zeroSpace, and a complete game summary.",
    "Alt Text Image": "Official header image for Pentomino game - Steam 1992980",
    "Canonical URL": "https://gusku.site/game/pentomino",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pentomino\", \"description\": \"Looking for information on Pentomino? Check out the release date (May 31, 2022), developer insights from zeroSpace, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"zeroSpace\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"zeroSpace\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1992980/header.jpg?t=1657395232\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}