{
    "AppID": 671190,
    "Name": "Pro Motion NG",
    "Release date": "Sep 25, 2017",
    "About the game": "An industry standard for two decades, talent from game studios like Yacht club Games, Wayforward, HalfBrick studios, and many more, have been using Pro Motion to create the sprite animations, static images, environment art, and tile-sets for their top tier pixel art games. The latest version, Pro Motion NG, continues to add and improve upon an already proven and powerful tool-set, enabling pixel artists of all skill levels to bring their imaginations to life. Dive right in and use the basic brush tools in conjunction with the layer features to sketch out your design.. quickly and easily perfecting the desired sizes, shapes and placement of all key elements - then use the large array of drawing, blending, dithering, and shading features to refine your objects and add detail. Use the rich array of color management tools to finalize your overall color scheme and arrange your indexed color palette. Once your mock-up has allowed you to reach the desired aesthetic and designs, branch out to specific project files to begin working on the individual assets, animations, and tile-sets. Change layer opacity or blending mode for special effects. You can even simulate specific console effect modes like the transparency effects seen in Super Nintendo games. Create a master project which displays your other projects as separate layers, so you can always see how the most recent and polished versions of all your assets work together to form a finished game screen. Use the large array of features such as onion-skinning, animated brushes, and time-line editing to animate all the characters, effects and objects for your project. Even use classic color-cycling features to bring single images to life. Pro Motion NG is not only a powerhouse of tools for creating pixel art and animations in general, it also offers many custom features to help you perfectly match the color fidelity, resolutions and graphical limitations of classic game consoles and computers. If truly legit retro pixel art is your goal, there is no tool better than Pro Motion NG. Unleash your imagination and make every pixel count, with Pro Motion NG Excerpt of Features - Simple color index and alpha transparency - Layer system including effects settings, transparency, locking - Pixel size definition to have sizes like 2x1 - Support for pattern drawing to create endless textures - Sprite Sheet support (reading/writing), PNG/BMP - Tile map editor with auto optimization, mirroring, flexible export, in place tile modification - Pen pressure support for brush sizes, colors, dithering and gradients - Pixel perfect drawing to remove smeared pixels in real time - Animated brushes (brush is animation itself) - Automatic realtime dithering patterns - Over 25 different paint modes such as translucent, brighten, darken, shade, soften, color cycle, halftone, tint... - AnimPainting to automatically flip through frames while drawing - Draw symmetrical images with a special symmetry drawing tool - Brush container to save and organize brushes, objects and animations for reuse - Single color, text or custom brushes selected from an image part - Key frame definition - Several playback modes (ping-pong, loop, play...) - Speed modification during playback - Light table/onion skinning to ease animating - Insert/delete/append/copy/revert ranges of frames - Append animations - Define colors in RGB/HSB/HSL color schemes - Create smooth color ramps - Use gradients to fill objects with different color shades (linear, contour, radial...) - Sort palette by hue, saturation, brightness or color - Ordered and random dithering - Modify contrast, saturation and brightness of a range of palette colors Coming soon - Free multi layer move tool (in addition to current layer scroll feature) - In place layer rotate/scale",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/671190/header.jpg?t=1572455336",
    "Price": 39.99,
    "Developers": "Cosmigo Software Development",
    "Publishers": "BrashMonkey LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/671190/ss_e469fde3296436ce6d0d9a357845474082465e5f.1920x1080.jpg?t=1572455336,https://cdn.akamai.steamstatic.com/steam/apps/671190/ss_2df48914f47cf612140e5923e1ff1b878cb804c5.1920x1080.jpg?t=1572455336,https://cdn.akamai.steamstatic.com/steam/apps/671190/ss_dc96938baa96f6890a1bf2b6c816abdec4b6627f.1920x1080.jpg?t=1572455336,https://cdn.akamai.steamstatic.com/steam/apps/671190/ss_0ebae9c717de6558b968a4f2012102016991f7e6.1920x1080.jpg?t=1572455336,https://cdn.akamai.steamstatic.com/steam/apps/671190/ss_64b16e87283e3e29077661d437ae3db6427076b7.1920x1080.jpg?t=1572455336",
    "Slug": "pro-motion-ng",
    "Meta Title": "Pro Motion NG: Sep 25, 2017, Cosmigo Software Development...",
    "Meta Description": "Looking for information on Pro Motion NG? Check out the release date (Sep 25, 2017), developer insights from Cosmigo Software Development, and a complet...",
    "Alt Text Image": "Official header image for Pro Motion NG game - Steam 671190",
    "Canonical URL": "https://gusku.site/game/pro-motion-ng",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pro Motion NG\", \"description\": \"Looking for information on Pro Motion NG? Check out the release date (Sep 25, 2017), developer insights from Cosmigo Software Development, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cosmigo Software Development\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BrashMonkey LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/671190/header.jpg?t=1572455336\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}