{
    "AppID": 1972250,
    "Name": "Project: Maidenless",
    "Release date": "May 27, 2022",
    "About the game": ":::::::::::::::::::::: ABOUT THE GAME ::::::::::::::::::::::::::::::: We are currently in the Combat Alpha phase of Early Access, features listed below are planned and not yet implemented! To get access to the Alpha please head to our discord and apply for a key! Planned Features THE RAID When you want to set off for adventure you can queue up for a specific map you want to play (maybe that map has more iron which is what you need right now) and maybe invite some friends and form a party for the Raid. In the Raid you will be up against A.I opponents as well as other players! Fight to the death or maybe join up with other adventures to take town a far stronger opponent. A.I enemies would consist of low level grunts and small time enemies that by themselves wouldn’t pose much of a threat but if you get outnumbered or maybe another player group comes up while you are fighting you might be in trouble. There would also be boss type enemies that would drop rarer materials and equipment for the player but would also be a much more daunting task to undertake. Maybe you just enter a Raid solo to farm wood or maybe you go in to farm rare Gems from the bosses…or maybe you just go in to hunt other players and take what they have, the choice is yours! THE MAPS Throughout the different maps you would find material nodes scattered around such as Trees, different types of Ore nodes, Plants &amp; Herbs, Animals to hunt and skin. In loot containers you could find specific crafting materials like Sword molds, Rare Jewels, Crafting schematics etc. The items you can bring back home with you will be limited by a Tetris style inventory system with the addition of weight to consider. Brining in a backpack will greatly increase the amount of stuff you can bring out of the Raid but it will also slow you down and make combat much more difficult. During combat you should temporarily drop your backpack on the ground to minimize your weight, after the fight you can go back and retrieve your backpack from where you dropped it. Dying in the Raid will result in you being sent back to the hub town naked with only the items in your stash remaining, similar to how Escape From Tarkov works. The Stash is a permanent inventory that is unaffected by death in raid, you can store items and materials here to keep them safe before entering a Raid. The space in your Stash will be limited but can be increased by leveling up and crafting upgrades! CHARACTER AND STATS Leveling up wont work the way it does in other RPG’s, Stats like Strength, Dexterity, Health, Stamina etc. will be determined by the gear you have equipped and potential magical buffs you have active. Leveling up your character will primarily focus on arbitrary things like Crafting skills, Harvesting skills, Stash space and more! XP for leveling up is earned by doing Quests, Harvesting Materials, Crafting Items, Killing Enemies, Surviving Raids etc. Once you earn XP it can never be lost, dying does not affect your XP or Lvl so even if you died in your last raid you will still be making overall progress by leveling up! EQUIPMENT AND CRAFTING The equipment would be primarily all focused around crafting and trading, you might find a broken sword on a dead enemy but the weapons you craft will be of much higher quality. Of course there is always the option to loot other players in the world after you defeat them. While crafting you will increase your crafting skill related to that particular type of armor or weapon. Higher crafting skill means faster craft times and better quality armaments! Add Gems and enchantments to gear to add stats or bonuses like Extra Health or Lightening Damage or maybe you just want a pickaxe that gathers more per hit! EXTRAS For players who would just want a place to test builds and weapon combinations you would have The Arena. A place where you can queue up for a 1v1, 2v2 and 3v3 battle with other players. In The Arena you don’t lose any gear or items when you die but you also can’t loot the other players if you win, it would be a place purely for PvP.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1972250/header.jpg?t=1653642648",
    "Price": 14.99,
    "Developers": "Grossly Incandescent Games",
    "Publishers": "Grossly Incandescent Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_a715a29f1d71517dae2ae0fb05db297626f3fbc3.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_4a26a6140d15db904583ec282f05e147c07d9c3d.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_e78e898733544aabbaa941895f84ce2a75aedece.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_aea97f93deb8754cb7a3bf0b1f3cb7a202c12134.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_0071c6b62c7a9e1aedaee0c1002ab008a02ea3a9.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_6d41e07c169308822006ac4c51cb430a7aadcbbf.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_c797fe69a031de8591f1d408e70dd202a1c501d8.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_41a6d679e341946f12253eed25fa00456d909e62.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_495e04905918b76b04e453ebe94ef49d498539f6.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_b202305f9050c39134c3ee077da86fc9e5172f73.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_0a01d1ede207289ab9c74c115590c2c101051296.1920x1080.jpg?t=1653642648,https://cdn.akamai.steamstatic.com/steam/apps/1972250/ss_51a9da19a03552039dc7a9e182922d66bc281a9c.1920x1080.jpg?t=1653642648",
    "Slug": "project-maidenless",
    "Meta Title": "Project: Maidenless: May 27, 2022, Grossly Incandescent G...",
    "Meta Description": "Looking for information on Project: Maidenless? Check out the release date (May 27, 2022), developer insights from Grossly Incandescent Games, and a com...",
    "Alt Text Image": "Official header image for Project: Maidenless game - Steam 1972250",
    "Canonical URL": "https://gusku.site/game/project-maidenless",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project: Maidenless\", \"description\": \"Looking for information on Project: Maidenless? Check out the release date (May 27, 2022), developer insights from Grossly Incandescent Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Grossly Incandescent Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Grossly Incandescent Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1972250/header.jpg?t=1653642648\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}