{
    "AppID": 340960,
    "Name": "Pulsen",
    "Release date": "Jul 27, 2015",
    "About the game": "Pulsen is a music and rhythm game featuring 85 songs. Core gameplay is easy to learn but hard to master, and involves hitting four directional arrows to the beat of the music as they pass by the screen. Every song has five or more difficulties and its own set of challenging arrow patterns and play style. Score is determined by how well arrows are hit in time with the music. Song experiences can be enhanced and customized with numerous song modifiers, settings, and arrow noteskins. Compete against a friend locally and compare scores with friends in-game on Steam. Key Features EXPANSIVE SONG LIST: 85 songs from independent artists! DESIGNED FOR ANY SKILL LEVEL: 5-6 difficulties for every song totaling over 440 charts! BRING A BUDDY: Play solo or with a friend in local two player. MULTIPLE WAYS TO PLAY: Play with a dance pad, computer keyboard, game controller, or drum set controller. CUSTOMIZE YOUR SONG EXPERIENCE: Tons of song modifiers, settings, and arrow noteskins. GET IN THE ZONE: Unique song Effects keep songs engaging and keep you on your toes. WORKOUT MODE: Track your exercise intensity while playing songs with no down time. STEAM INTEGRATION: Compare scores in-game with friends, unlock achievements, and collect trading cards. Achievements and Trading Cards are still in development. AND MORE!: Remappable controls, dynamic resolutions and aspect ratio, and mouse functionality. List of Songs Adraen - Killin' Your Dudes Azrael-II - Never Fade BANDETTO - Headrockin' Signs from There Came an Echo - Big Giant Circles feat Aureylian Blenderblaster - Boom Blenderblaster - Dreams and Nightmares Blenderblaster - Hyped Blenderblaster - Living Colours Blenderblaster - Satellite Signal Comma King - Bringing Me Down Comma King - Forever Blue Comma King - Halcyon Comma King - Retro-Specced Comma King - Smile Through the Stars Comma King - Zenone Danny Baranowsky - Crypteque from Crypt of the Necrodancer Danny Baranowsky - Mausoleum Mash from Crypt of the Necrodancer D-Mode-D - Just Love (Mayhems MMAAYYHHEEMM Remix) DJ DISITE - Hypnosis Dj-Greene - Holiday Hurricane Dj-Greene - Irish Trance Dance DustZallax orig Chipzel - Super Hexagon Remix Emoticon - Wishing Well Fredgy - Sarcolemma Furries in a Blender - I Ate All the Food Furries in a Blender - Sqweg the Dragon Furries in a Blender feat Entity and Lawlzy - Synapse Hydlide feat SquaDus - Regret hyi - I Control Idris - I Believe Idris - Wonderland Idris &amp; Zyrion - Serendipity J-Mi &amp; Midi-D - Life is a Journey (The Paradise Last Mix) J-Mi &amp; Midi-D feat Hanna Stockzell - All Night Long (The Paradise Last Italo-Disco Mix) Jackal Queenston - Murder Machine Ken Wank - I Gotta Have Mix Ken Wank - Make Your Moves Mix Kitsune^2 - Hot One Kitsune^2 - Jetpack Cutie (Entertain Us Re-Edit) Kitsune^2 - Rainbow Medication Kitsune^2 - Steel Monster Above the City Kitsune^2 - Tung the Icelandic Space Warrior Kyle - Techno Rocker (Remix) Losstarot - Cosmo Memory Losstarot - CTRL ALT BELIEVE Losstarot - Lunatic High Losstarot - Onigiri Losstarot - Wildfire Losstarot feat GUMI - Calamity Losstarot feat GUMI - Starburst Mayhem - Laugh at Life Mayhem - Spinback MGD Assault Force - Speak Sins MGD Sound Team - Future Destination MIDIhead - Fall Awake (Lars Hausmann Remix) MIDIhead - Speeder Freak Monolithic - The Dark Odyssey - I Breathe Fire Oscillator X - Style On My Speed Dial PSURG Sound Team - The Collapse Renard - Claustrophilia Renard - I UPDATED MY LIST Renard - Kyle Ward the Space Pumpkin Renard - She's An Angel Renard - System Failure Rotteen - Koan Rotteen + Emoticon - Figurehead Shirobon - This Love Sonitus Vir - Stormy Weather Soul Pacific - Cali Coast (Psionics Remix) Speed Edit Sta - Dystopia of the Sun Sta - Finite Sta - Noiseproof Sta - Savvy Sta - Unified Chaos The Icarus Kid orig daniwell - Nyan Cat (Rainbow Poptart Remix) The liquid movement &amp; Sta - Lovesick (Xyzzy Mix) The Queenstons - Commuting The Queenstons - Guiding Light The Queenstons - I Control The Queenstons - I Prefer the Sky The Queenstons - Our Special Place typeMARS - Sky Destiny WipEOut - Canon-D WipEOut infected - SYSTEM ERROR NOTE: Some sections of this game contain flashing lights which may cause an adverse reaction in some users.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/340960/header.jpg?t=1609449736",
    "Price": 14.99,
    "Developers": "4-Panel Footprint",
    "Publishers": "4-Panel Footprint",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_781e40f5695e927f2b67a14db71db7516620d3b2.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_3e11fb5f360bd97d664c85ebf37636e78913c73e.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_1173e95c429de2e5627eb3b0827b9b90666d7762.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_3e8c3953459a92f23247fc746d33f117dad993d1.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_671303958bc2d40d5fa6a61850f9240653a28a72.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_9304e4cebd1940d5c1e0a52375d2ec14b61c48e8.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_e2232aea67974fe5ea445d9d4138b481bd275a08.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_8f48ec77f83937349615b210059ad7c8a2bfe37e.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_2cf252b2681971e0390eca4c89e0c545d1c4fbcb.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_bcb3d15d6e19997f14ac53915b617b06a865ff24.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_a87935176a5769b86758b7ab6df868ef2f2c8f4a.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_e80e6c4122b181b3cb54cbdc4d93950aeb97acd5.1920x1080.jpg?t=1609449736,https://cdn.akamai.steamstatic.com/steam/apps/340960/ss_df6be241b067404788bcbe32cb95e3ebd20a07f5.1920x1080.jpg?t=1609449736",
    "Slug": "pulsen",
    "Meta Title": "Pulsen: Jul 27, 2015, 4-Panel Footprint and Full Overview",
    "Meta Description": "Looking for information on Pulsen? Check out the release date (Jul 27, 2015), developer insights from 4-Panel Footprint, and a complete game summary.",
    "Alt Text Image": "Official header image for Pulsen game - Steam 340960",
    "Canonical URL": "https://gusku.site/game/pulsen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pulsen\", \"description\": \"Looking for information on Pulsen? Check out the release date (Jul 27, 2015), developer insights from 4-Panel Footprint, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"4-Panel Footprint\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"4-Panel Footprint\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/340960/header.jpg?t=1609449736\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}