{
    "AppID": 754150,
    "Name": "Rolling Line",
    "Release date": "Apr 27, 2018",
    "About the game": "Rolling Line is a model railway simulator where you can build your own layouts and share them for others to play! Explore and drive trains on pre-made official layouts, any one of 1000s of player-made layouts on the Steam Workshop, or create your own! Read in-game magazines Rolling Line has its own official magazine! Read about updates, community content, layout building guides and much more. You can read these magazines in-game or even view them online here: / Download and share through the Steam Workshop Layouts and liveries (train color schemes) can be shared and downloaded on the Steam Workshop! Browse over 1.5k layouts and over 3k liveries made by countless skilled community members. Simply click to subscribe to workshop items, and they will appear in-game, simple as that! Explore pre-made official layouts The built-in official layouts include scenery and trains from New Zealand, America and Brazil! Features: Play on both PC (without VR) and in VR (HTC Vive, Valve Index (with finger tracking!), Oculus Rift and Windows Mixed Reality) Build and share your custom layouts on the Steam workshop Share and download custom train paint-schemes (liveries) on the Steam workshop Operate table-top model railways standing in human-scale Explore anywhere in your layout on foot in miniature scale Drive trains in human-scale with hand-held controllers Drive trains in miniature-scale from within the cab Multiple trains to choose from (all completely free!) like diesel, steam and electric Wide range of freight and passenger wagons Pickup and throw wagons as physics objects Sandbox style world, where custom tracks and scenery can be built anywhere Dynamic day/night cycle Dynamic weather Set up working signals and level crossings Overhead wires and track electrification Simple color painting system, where you can create custom colors to paint props and scenery Save files are in plain text, so you can easily copy and share them Locomotive and wagon modding with custom 3D models and textures Custom 3D terrain using modding to import your own 3D models Read in-game magazines with information about updates and community content Play in VR or on PC Rolling Line has been built from the beginning to be both a PC game (first person style) and a VR game. You can play with a keyboard a mouse just like any PC game or train sim, but if you have a VR headset (Oculus, Vive, Valve Index and WMR) connected then it will automatically launch in VR. If you have the Valve Index controllers then you can even make use of full finger movement tracking! VR controls can also be fully re-binded using the SteamVR Input System. Just like a model railway Layouts in Rolling Line are designed to look, feel and operate like a real hobbyists model railroad, with switch boards to control the tracks, portable hand-held controllers to drive trains, and complete control over the rooms lighting. Freely push wagons around on the rails with your hands to build trains and take control of them using DCC-style hand-held controllers! Build your own tracks and scenery Place pieces of track and scenery to build your own huge (or tiny) railways! Choose from a huge range of props like trees, buildings, vehicles, shapes, etc. Paint different colors onto props and terrain using a simple color painting system. Choose from a variety of colors or edit your own hues and palettes. Place down chunks of terrain to build hills and path ways, or use external 3D modelling tools to create your own complex 3D terrain (via modding). You can build your custom layouts entirely by hand in VR, or play on PC to make use of PC-only map making shortcuts. You can share your layouts on the Steam workshop and easily download other peoples layouts. All layouts you make can be easily backed up and shared in plain text, which means you can copy-paste an entire save game between friends! Explore in human scale or miniature Switch between human-sized room scale and railway-sized miniature scale at any time, any where. You are not limited to only driving trains in miniature, but can fully explore and entire layout at the scale of a person. Drive trains from right inside the cab in miniature, and view the world from the driver's perspective! Choices of locomotion Choose between a range of locomotion options, including standard teleporting, grabbing the world around you to move yourself around and free directional movement with the trackpad. Other options like manual rotation (if you cannot use room scale) and setting your player height help support a range of VR setups. Rolling line offers an immersive experience of both controlling a model railroad and driving trains from within the world itself. Whether you enjoy exploring model railways, the joy of controlling model trains, the experience of a scenic railway journey or the freedom of building your own tracks and creations, then Rolling Line can deliver!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/754150/header.jpg?t=1643829472",
    "Price": 19.99,
    "Developers": "Gaugepunk Games",
    "Publishers": "Gaugepunk Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_bf485d5b125637f10fc4e40a7e361391b57449f0.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_b1bac8cac979fc70101fa1b012959522584bb924.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_b2d9567eea4f4fd6edf8ca3b3980371f690d69cf.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_5ca1de3da800e5c55e34dfa46048a91c565c4c40.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_f744378c7bea3786456360beec195914943fb805.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_bd40bcef56ff1b619a56a70ebfcb497f58044da4.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_73380d9332d930118cdd605210ef6da01052d166.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_2bf48ec2b3e10f4e086c06c64dbff97c1ba2389d.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_45e2bfd95b088cd08167577478a3b8fdf588a979.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_a6696655d898b21d1d50b4f653660b9c80c1a8eb.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_cabfdaa07ba329cdbbdd9ccae65bded5e2c6994e.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_a91492325b90156550e4479061ce48e642dd3ba7.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_bafddc50854fab8794db24190ee13b1602b30a6e.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_c34410b68756a8c7d9a563dae7cbb31d3cf1df19.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_058cdfc3109f21349851338dd63c34f6d81066f8.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_15d69c32e281faa579454c199359aa3827d9f7e2.1920x1080.jpg?t=1643829472,https://cdn.akamai.steamstatic.com/steam/apps/754150/ss_c1cce165d89a5918ad8fdd92f165c65c82e56c95.1920x1080.jpg?t=1643829472",
    "Slug": "rolling-line",
    "Meta Title": "Rolling Line: Apr 27, 2018, Gaugepunk Games and Full Over...",
    "Meta Description": "Looking for information on Rolling Line? Check out the release date (Apr 27, 2018), developer insights from Gaugepunk Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Rolling Line game - Steam 754150",
    "Canonical URL": "https://gusku.site/game/rolling-line",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rolling Line\", \"description\": \"Looking for information on Rolling Line? Check out the release date (Apr 27, 2018), developer insights from Gaugepunk Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaugepunk Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaugepunk Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/754150/header.jpg?t=1643829472\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}