{
    "AppID": 2004650,
    "Name": "SailSim",
    "Release date": "Jun 8, 2022",
    "About the game": "SailSim was originally developed for the Android platform and its controls are for the time being optimized for touch input. A PC version of the app was requested by many users and this is the initial attempt at it. If things go well here, the PC version shall be supported much more and optimized for the best experience. 🔸 Try out different sailing vessels to see how they behave 🔸 Learn different parts of a sailboat and what they do 🔸 Learn sailing through simple yet instructive courses 🔸 Check out different symbols, terminology and sailing equipment 🔸 Use sailing instructor guidelines as you practice or complete courses 🔸 Have fun if learning is not your thing by exploring or competing ⚫ Currently available vessels are ◼ Laser - Olympic ◼ Catalina 22 - Classic (Fin Keel) ⚫ Current Sailing Features ◼ Keel Control ◼ Keel vs Vessel velocity &amp; mass effect ◼ Boom Direction ◼ Boom Jibe &amp; Tack forces ◼ Boom Vang Control ◼ Main Sail Folding &amp; Unfolding ◼ Jib Folding &amp; Unfolding ◼ Jib Sheet tension &amp; Winch Control ◼ Rudder vs Velocity control ◼ Rudder &amp; Turning circle based on vessel mass ◼ Rudder reverse control ◼ Outboard engine control ◼ Outboard engine prop walk effect ◼ Drift effect vs Sail direction ◼ Vessel Heel &amp; Potential Capsize effects ◼ Jib and Main Sail 'Rudder Pull' when used separately ◼ Wind dynamics based on vessel velocity and direction ◼ Much more... As a Live-Aboard I wanted to create something anyone could use for learning as well as for those rainy days when going out to sea is difficult but you still want to sail. The sailing simulator was created to give an idea to those who are interested about the basic principles of sailing as well as to provide some knowledge in a fun and intuitive way. Although by no means this should be considered as an exact replication of the actual sailing process, it does provide things you shall encounter when you step on any boat. If learning is not your thing, it is very addictive to just play with a sailboat and physics applied to it when the wind is howling outside and you have nothing better to do. Some controls and reactions of the sailing vessels in this simulator have been set intentionally in an awkward way and not as a typical Sailing Game would do it. This is done to try and replicate what you shall encounter when controlling a sailboat by yourself. I have many ideas and additions I would like to make to this simulator so if you like its direction, spread the word as I develop it under way or in a marina whenever my batteries are charged from solar or the engine. ⭕ I try and upload updates every week with something new and interesting added to the sailing simulator. Make sure you update to the latest available version as i fix bugs and release fixes and new functions as i go. ✴ Please note that i designed the simulator with good graphics and physics in mind. Since i do not have the resources to check the simulator on older devices, if your device is older than 2 - 3 years, the simulator might not work. Unsupported older devices may manifest faults as broken texturing or in general the look of the simulator will not be as in the description screenshots. If your device doesn't support the simulator, try using a newer device or look into updating its Operating System. ✴ If you find faults (bugs) not related to graphics but based on general behavior, please don't hesitate to mention it and i should have it fixed in no time. I do try to check everything before i publish a new update but no one is perfect and things do tend to slip my mind from time to time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2004650/header.jpg?t=1654695216",
    "Price": 2.99,
    "Developers": "Demetris Rouslan Zavorotnitsienko",
    "Publishers": "Demetris Rouslan Zavorotnitsienko",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2004650/ss_d73abc9d730c48173bdbefa3cc75245d6e264c9a.1920x1080.jpg?t=1654695216,https://cdn.akamai.steamstatic.com/steam/apps/2004650/ss_271a96f21560e543c4c21ea73e6659b01abd5738.1920x1080.jpg?t=1654695216,https://cdn.akamai.steamstatic.com/steam/apps/2004650/ss_9d06907311cc440d5a7a85f2ac7d34fcd84b313b.1920x1080.jpg?t=1654695216,https://cdn.akamai.steamstatic.com/steam/apps/2004650/ss_8b84b10f2057d11e2f9f7e06627071eb6fbe6270.1920x1080.jpg?t=1654695216,https://cdn.akamai.steamstatic.com/steam/apps/2004650/ss_e1fa79c955c3d2b8307bc2957917eb6794b002d5.1920x1080.jpg?t=1654695216",
    "Slug": "sailsim",
    "Meta Title": "SailSim: Jun 8, 2022, Demetris Rouslan Zavorotnitsienko a...",
    "Meta Description": "Looking for information on SailSim? Check out the release date (Jun 8, 2022), developer insights from Demetris Rouslan Zavorotnitsienko, and a complete ...",
    "Alt Text Image": "Official header image for SailSim game - Steam 2004650",
    "Canonical URL": "https://gusku.site/game/sailsim",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SailSim\", \"description\": \"Looking for information on SailSim? Check out the release date (Jun 8, 2022), developer insights from Demetris Rouslan Zavorotnitsienko, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Demetris Rouslan Zavorotnitsienko\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Demetris Rouslan Zavorotnitsienko\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2004650/header.jpg?t=1654695216\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}