{
    "AppID": 1046630,
    "Name": "Tank Maniacs",
    "Release date": "Dec 5, 2019",
    "About the game": "Please note that Tank Maniacs offers only local multiplayer but thanks to Steam's Remote Play Together feature, you can play online with your friends and they don't even have to own the game. Probably the best couch party game in the world. Probably. Tank Maniacs is a chaotic local multiplayer couch party game for one to four players. You and your fellow pilots will battle it out in post-apocalyptic arenas reminiscent of the once beautiful landscapes of our planet. Your task is simple: eliminate the competition in any way possible. To ensure the unfairness of these encounters, the showrunner will bombard you with environmental hazards and powerful upgrades that can turn the tide of battle in a heartbeat. Engage in free-for-all or team-based combat with friends, or try beating the unforgiving AI bots. If you want to be successful in the arena, you’ll have to master the weird tanks with various gameplay mechanics and familiarize yourself with the different maps that offer a wide range of challenges. Or you can just shoot your friends to bits, that’s fine too. Main features Couch madness for up to 4 players 8 beautiful levels with unique features 11 wonderfully weird tanks (including the Thanksgiving “Turkey Tank”)! 12 wacky characters 4 game modes + team based variations Dynamic commentary Unforgiving AI bots Twitch integration with in-game voting Fun, cartoony art style with hand-drawn graphics Punchy electro-rock soundtrack Steam Remote Play Tank Maniacs was born to be enjoyed by your friends on your side, so you can laugh in their faces when you beat them. But thanks to Steam Remote Play Together, you can play together even if you're hundreds of miles apart. Just make sure you still make fun of the guy with the poop rank at the end! Twitch Extension Tank Maniacs is all about having fun together. And what better way to do this than ruining your favourite streamer’s day? Vote on in-game events through our Twitch extension and help or disrupt the players on the battlefield. You can join from desktop and mobile as well, so you can be part of the fun from wherever you are. Controller support We support pretty much all controllers that you can connect to your PC. If you find one that we don't send us a mail and we'll try to sort it out. The year 20xx. After the Post-Nuclear War most of the population is gone. A brilliant man called the ‘Showrunner’ created Tank Maniacs to be the main source of entertainment for the remaining folk. He’s selected the most infamous veterans and exotic warrior creatures from all over the world to have them fight in his carefully designed arenas. They’re kept in his city-sized zeppelin with a fully functioning tank factory inside until they’re ready for a match. Pilots may fight in the most imaginative and peculiar arenas from all over the Post-Nuclear world. Gotta feed that audience not only with violence but amazing places they’ll never be able to visit. Or dreadful places. Mostly dreadful ones.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1046630/header.jpg?t=1589708661",
    "Price": 5.99,
    "Developers": "GAMELAB",
    "Publishers": "GAMELAB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_84de026e6425df28b3486005f0ae828ed10a1269.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_fc5c2a76bf5099b408561f819a7f1db016930245.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_58c0d4cde76588fedfdbe5de6e0c0c253abc568a.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_d2f7996ffe45d1e8152a43b4c1ed33a0db22b0d6.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_3614c7a54eec38f0d7789fd3666d26ff420c5428.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_f0755dd0139d04bc4668b8e8743ab5ade90f22a8.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_775225117145c9b5d528b2a216026ff41eb65a5d.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_e2a2b04240bede7da80c3c5edcbc7e76e77ccb46.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_384439353f03fb6fe2320280cf883d49cfb8dcf6.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_652bc69781a2b0f80dfcc224595b5110d2170e6d.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_4259569d9b6fc531a7cf70e3545421590f6f76e7.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_2deaa99eb3c6ad0a570c3ebbdb5c729a1a071e26.1920x1080.jpg?t=1589708661,https://cdn.akamai.steamstatic.com/steam/apps/1046630/ss_c51af8c5709d1a574229afdbd5120e9b029ddae1.1920x1080.jpg?t=1589708661",
    "Slug": "tank-maniacs",
    "Meta Title": "Tank Maniacs: Dec 5, 2019, GAMELAB and Full Overview",
    "Meta Description": "Looking for information on Tank Maniacs? Check out the release date (Dec 5, 2019), developer insights from GAMELAB, and a complete game summary.",
    "Alt Text Image": "Official header image for Tank Maniacs game - Steam 1046630",
    "Canonical URL": "https://gusku.site/game/tank-maniacs",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tank Maniacs\", \"description\": \"Looking for information on Tank Maniacs? Check out the release date (Dec 5, 2019), developer insights from GAMELAB, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"GAMELAB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GAMELAB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1046630/header.jpg?t=1589708661\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}