{
    "AppID": 1260810,
    "Name": "Touhou Blooming Chaos 2",
    "Release date": "Jun 24, 2021",
    "About the game": "Gamepad support will be available in 10 days after the release on April 10th. While English and Japanese supports require a period to be added. We hope for your understanding. As the sequel of Touhou Blooming Chaos, Touhou Blooming Chaos 2 is now under the development. Not following the prequel's linar storytelling, TBC 2 will be introducing new gameplays inspired by those popular nowadays. Then what is the feature here? A New Teleportative Incident? 　 One day, our Cirno having fun playing around, like usual, decides to walk back to her home, the Misty Lake, through the Beast's path. However, she soon finds that following the memorized path could lead to somewhere else totally unexpected. Cirno, thinking it’s just the consciousness fooling her, attempts few more times until she finds that expect for the Human Village, all other familiar places are terribly dislocated and one would never reach his destination. Also, seemed to be pushed by an unknown force, youkais become aggresive and startstrikingeach other. Why would it happen? Could it be another incident? And how will the residents of Gensokyo, bored for long, face it? ▲Gensokyo in spatial disorder, and the Human Village as the point of departure. Rogue Dungeon-crawling Gameplay. 　 You’ll be controlling one of the varied characters to fight from minions to bosses in known places of Gensokyo. Everything is randomly generated, so each run always offers you different experience. ▲A rogue experience with purely randomized layouts and enemies. (1) Normal Rooms While its Layout and enemies is randomized, normal room is your main battle area. Eliminate all enemies and the gate to the next rooms opens. ▲Gates attached to a room are opened only after cleaning it. (2) Puzzle Rooms Puzzle rooms occasionally appears in the dungeon, featuring a puzzle. Great award awaits you once you resolve it. ▲Once resolved, the curse of the treasure chest is lifted. (3) Korindo’s Branch Store Korindo’s branch store sometimes appears in the dungeon, acting as a supply station selling you goods, with a certain odd of presenting items of better quality. Beside that, it functions exactly the same as the store in the Human Village. ▲Korindo the in-dungeon version, offering items of significantly better average quality. (4) BOSS Rooms Every end of the floor, a Boss Room appears as a larger room for a boss fight. Girls of Gensokyo shall launch wonderful danmaku battles here and gain rewards for victory! Raise your spirit and make it! ▲Have wondeful danmaku battles with mighty and graceful girls of Gensokyo! 2, Basic Mechanic 　 (1) Dealing Damage A playable character always possesses three ways of offense: attack, dash, and skill. Attack : No consumes. The most common way to deal damage, and is divided into melee ones and ranged ones depending on the character. Different attacks perform differently in various casts. ▲With no consumes, Attack is the most steady way of outputing damage. Skill : Each character possesses three skills based on their original spellcards. Divided into offensive, assistive, and areal. Use them wisely and your fun is doubled! ▲Beautiful and powerful! Dash : A short and invincible dash for avoiding incoming attacks. While it’s not a main way to deal damage, dashing can cause special effects depending on the character. For example, Cirno freezes enemies she dashes through for a short period while Youmu deals damage to them. ▲Dashing doesn’t only help you running away from hazards, but also inflicts special effects. (2) Build Your Characters Characters gain experience from battles, and attribute points from leveling up. Gather and distribute those points to strengthen your character, and makes your future decision clearer. Fix the weakness to make a well-rounded character? Or build a madly polarized one of your own personality? It’s all up on you! ▲Build up attributes to build your own most powerful character! (3) Forge Your Equipments Equipping various suits doesn’t only gains additions on your attributes, but also grants you passive effects. Also, equipment can be forged. Keep the properties you prefer, and eventually craft the best one of yours! ▲Reforge your equipment and make your best arrangement. 3, Rich Cast 　 (1) More Than 10 Playable Characters Cirno, Youmu Konpaku, Sanae Kochiya, Rin Satsuki... In future undates, there will also be Reimu, Marisa, Alice, Hina, Clownpiece, Suika, Kokoro, Yuka and more, just to satisfy the favour of controlling your favorite character! ▲Control various characters, and get totally different experience. (2) More Than 30 Available Bosses 　 You’ll be encountering bosses of more than 30 kinds. Though they may not be playable, it’s enough impressive presenting as just bosses! Cheer up, and fight with mighty girls of Gensokyo with fantasy danmaku! ▲Rich amount of bosses to keep your curiosity of exploration flesh! 4, Collective Gameplay that should Suprise No One (1) Character Collection Collect enough certain items, and you can unlock a playable character in the pantheon! ▲Now, you should’ve unlocked Sanae! (2) Skin Palette Collection While a character is unlocked, collect enough certain items, again, and you can unlock a new color palette for this character! ▲Now, you should’ve unlock a new palette “Deified Oni of the Wind” for Sanae! (3) Music Collection Once a track is played during the game, you can always replay it in Music Room. ▲Just enjoy some music when away from battles, calming down your tensed mind. (4) Image Collection Whether you get a game over, or defeat a boss, you can get a piece of image of one’s failure portrait (with clothes damage). The requirement though, it’s that you need to beat that Tengu reporter who is known for taking secret photos. ▲well.. Challenge the Dungeon 　 Besides the friendly one for the main plot, we’ve also prepared special dungeons for those who seek challenges, these include ones that forbid all pre-brought items and starts at level 1, ones with time limit, and one with boss rushes... so on. As we said, richness is only found in danger, the more difficult, the better the reward, so keep challenging! ▲Dungeons with more varied themes, for every player who loves challenge.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1260810/header.jpg?t=1651156277",
    "Price": 5.99,
    "Developers": "二色幽紫蝶,re零同人社",
    "Publishers": "二色幽紫蝶,东游鉴",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_6a566191c87318fdc747c90f3aa27d3b4d77eafc.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_eb9c2d107f4ac4301bbfb7353403bf6c4d3fd454.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_4b02687b3a695c6f4b5e7db0227a3ac5eeb3039a.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_cf68f62839db94d607fe8d6f770bf74484ba6eb6.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_5866680dc50eba0d85a00f84cdb8a5126c5c8b8f.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_07e61627eee03b3465b4a24c92787cab116739ac.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_5e8f2010df2cdf76ba0a66200357fd6bd0c1aeac.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_16b603abcfe101730f929e8b5d18f9742ef95a62.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_f674f6f5bf44a6b2b540ef163928c609d8629872.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_c1881b1740b18c84b50a843d0d79e9fd5dcbdaa5.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_59f417ebe0464fb5e02ccd88fff6de64c865b6df.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_234f759def71894ab678139b87ca46975b83816f.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_3bca2e9a554f363fca2340349d12f6bb62e0df8b.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_4811b13cea439e1f921a856ac6086ec61c768080.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_10c668dd5e1e06d5b5ae8c6815c6f95e49e13633.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_d629a28c4bfd3b1ce1286a7a920b98b9d8df3e27.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_aba383145bb7a791d0c24071c0a7691058f85694.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_356bca19837058b2237746cfdc9609de9d438f6f.1920x1080.jpg?t=1651156277,https://cdn.akamai.steamstatic.com/steam/apps/1260810/ss_95361b38d7d35a17d1691c1590c99afbbbb5005c.1920x1080.jpg?t=1651156277",
    "Slug": "touhou-blooming-chaos-2",
    "Meta Title": "Touhou Blooming Chaos 2: Jun 24, 2021, 二色幽紫蝶,re零同人社 and F...",
    "Meta Description": "Looking for information on Touhou Blooming Chaos 2? Check out the release date (Jun 24, 2021), developer insights from 二色幽紫蝶,re零同人社, and a complete game...",
    "Alt Text Image": "Official header image for Touhou Blooming Chaos 2 game - Steam 1260810",
    "Canonical URL": "https://gusku.site/game/touhou-blooming-chaos-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Touhou Blooming Chaos 2\", \"description\": \"Looking for information on Touhou Blooming Chaos 2? Check out the release date (Jun 24, 2021), developer insights from \\u4e8c\\u8272\\u5e7d\\u7d2b\\u8776,re\\u96f6\\u540c\\u4eba\\u793e, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e8c\\u8272\\u5e7d\\u7d2b\\u8776,re\\u96f6\\u540c\\u4eba\\u793e\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e8c\\u8272\\u5e7d\\u7d2b\\u8776,\\u4e1c\\u6e38\\u9274\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1260810/header.jpg?t=1651156277\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}