{
    "AppID": 35700,
    "Name": "Trine Enchanted Edition",
    "Release date": "Jul 2, 2009",
    "About the game": "Trine is a fantasy action game where the player can create and use physics-based objects to beat hazardous puzzles and threatening enemies. Set in a world of great castles and strange machinery, three heroes are bound to a mysterious device called the Trine in a quest to save the kingdom from evil. The gameplay is based on fully interactive physics - each character's different abilities help the player battle an army of undead and defeat hazardous contraptions. The player can at any time freely choose whoever is best suited for the upcoming challenge or puzzle: The Wizard is able to summon objects to help solve puzzles and create new ways to overcome obstacles, the Thief uses her agility and dead-on accuracy to swiftly surprise the monsters, and the Knight unleashes mayhem and physical destruction wherever he goes. Trine Enchanted Edition Trine Enchanted Edition is a remake of the original Trine with dazzling new visual effects and numerous gameplay improvements! Online and local co-op with up to three players Mid-level saving: Save anywhere to play as long or short sessions as you like Stunning new graphics based on the Trine 2 engine Both Trine Enchanted Edition as well as the original Trine are included in the Enchanted Edition. The different versions are selectable from the game launcher. All Trine purchases have been automatically updated to Trine Enchanted Edition. Note: The original Trine is only included in the Windows and Mac versions. Key Features 3 Heroes – Amadeus the Wizard, Pontius the Knight and Zoya the Thief, each with their own skills: Wizard is able to cast physically simulated objects and levitate them in the totally interactive game world Knight is a mayhem-bringer like no other, able to destroy objects and smash skeletons to pieces with his weapons, including the mighty Storm Hammer! Thief can hit enemies from a distance with her accurate arrows but she also has a grappling hook to easily swing from one platform to another Solve challenges and puzzles in many different ways – combine the characters' abilities and let your mind come up with creative solutions never seen before Online and local co-op with up to three players Characters gain experience points that can be used to upgrade their abilities Fully interactive game world with life-like physics 15 carefully designed and challenging levels with a distinctly unique atmosphere and graphics, including the Astral Academy, Crystal Caverns, Dragon Graveyard, Forsaken Dungeons, Fangle Forest and the Ruins of the Perished. Many different items to collect - each affecting the characters' abilities Well-hidden secret chests in every level 3 difficulty levels to choose from Amazing 19-track soundtrack composed by acclaimed Ari Pulkkinen Fun and challenging Steam Achievements to unlock Trine (Original Version) Trine Enchanted Edition also includes the original version of Trine for Windows and Mac. The game version can be selected from the game's launcher. The original version also has some additional language subtitle options: Finnish, Turkish, Portuguese, Romanian in addition to those present in Trine Enchanted Edition (English, French, German, Italian, Spanish).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/35700/header.jpg?t=1620222376",
    "Price": 3.74,
    "Developers": "Frozenbyte",
    "Publishers": "Frozenbyte",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_20bcdff20ea02555d45ce7c6b3a838c180db1c02.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_0a675f8e6f7cc0bc8dc44cd3eea952e37700601d.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_bb35507b7d69fbb4d90e4a7f3ea68278377d119b.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_1157f426ae88660f65981161ae27b1b9ce441e68.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_9e9f4fba2ce6f3dc8724b7e0ad297c230ec3506b.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_bce87363247b68e5cf12da35f2f661c84853cfaa.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_db7f31ccc756673a6f3dabd7cf6fb5c30983bc26.1920x1080.jpg?t=1620222376,https://cdn.akamai.steamstatic.com/steam/apps/35700/ss_c0e7319debc9082e2bf282220022e1289b1fe907.1920x1080.jpg?t=1620222376",
    "Slug": "trine-enchanted-edition",
    "Meta Title": "Trine Enchanted Edition: Jul 2, 2009, Frozenbyte and Full...",
    "Meta Description": "Looking for information on Trine Enchanted Edition? Check out the release date (Jul 2, 2009), developer insights from Frozenbyte, and a complete game su...",
    "Alt Text Image": "Official header image for Trine Enchanted Edition game - Steam 35700",
    "Canonical URL": "https://gusku.site/game/trine-enchanted-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trine Enchanted Edition\", \"description\": \"Looking for information on Trine Enchanted Edition? Check out the release date (Jul 2, 2009), developer insights from Frozenbyte, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 2, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frozenbyte\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Frozenbyte\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/35700/header.jpg?t=1620222376\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.74, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}