{
    "AppID": 520300,
    "Name": "Underworld Dungeon",
    "Release date": "Jul 31, 2017",
    "About the game": "Underworld Dungeon is a rogue-like action-adventure, in which you explore a ruined Greek dungeon hidden within the depths of the Underworld. As you dig deeper, ancient weapons and armor will be uncovered which you can combine to create more powerful gear. You will need all the items you can scavenge and craft to conquer this challenging dungeon; a dungeon that masks unspeakable horrors, mythical secrets and finally, the promise of a lost soul, which awaits you at the end of it all. Inspired by games such as The Binding of Isaac, Dark Souls and Terraria, Underworld Dungeon aims to create a dark, procedurally generated world filled with item crafting, dungeon looting, many secrets and items to discover, as well as a challenging combat system which would require the player to use their wits and skills to confront each enemy and situation. Features: Over 100 weapons, armour pieces and gear Multiple brutal bosses for you to face on your journey A semi-permament death system, allowing for new items to be unlocked for future playthroughs A fully fledged crafting system, allowing for the most devastating of weapons Full Steamworks support, with Achievements and Leaderboards included Many secrets and NPC's to be discovered inside the dungeon Gameplay: Combat in Underworld Dungeon will be challenging. You must use different weapons and abilities along with your own wits and skills to confront each room of enemies. Stamina - Every action uses a varying amount of stamina such as swinging a sword or dashing. This means that you must use your stamina wisely and consider each action carefully to avoid being temporarily stunned with a depleted stamina bar. Shield - Bringing your shield up will halt your stamina bar from recharging and slow you down. However, it will also block incoming damage from enemies with varying strengths. (ie. Iron Shield blocks 75% damage while a Wooden Shield blocks 65%) Dash - Dashing allows you to rapidly move away from an enemy's attack but does not grant you invincibility. Thus, you must use it carefully as it takes away quite a lot of your stamina and leaves you vulnerable to an enemy afterwards. Procedural Generation: The dungeon is randomly generated at the start of each run, with biomes, objects, enemies and rooms being different, providing a fresh and challenging experience each time. Items and resources are also randomly generated, allowing you to have a different build each run. On one run, you could be a warrior with a shield and a flaming axe, whilst on another, you could be a hunter with teleportation and a throwable spear.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/520300/header.jpg?t=1641141145",
    "Price": 0.0,
    "Developers": "InfernoSoul,Fromjaf Games",
    "Publishers": "Fromjaf Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_3c881e3818aef28cc9b209fe40270e6f47d587bc.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_db46462392f78e9bfc9c33c97c8712498a20bff5.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_39397bd12d0eade054829a7cf11e0a55caf19e54.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_9385e130a1b5344ccaee632fa7f09efa3b49c8a0.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_4ce3c5c5055df69bd97fb5a87822546f9879cc06.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_299634a0f8cd632c175976ae5033c02a83de231d.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_590b3dca32abe95617a01ab92393e5176052cae7.1920x1080.jpg?t=1641141145,https://cdn.akamai.steamstatic.com/steam/apps/520300/ss_91718a6e0c4e4758e6f6bddf8a80fe1ae6fa0e7f.1920x1080.jpg?t=1641141145",
    "Slug": "underworld-dungeon",
    "Meta Title": "Underworld Dungeon: Jul 31, 2017, InfernoSoul,Fromjaf Gam...",
    "Meta Description": "Looking for information on Underworld Dungeon? Check out the release date (Jul 31, 2017), developer insights from InfernoSoul,Fromjaf Games, and a compl...",
    "Alt Text Image": "Official header image for Underworld Dungeon game - Steam 520300",
    "Canonical URL": "https://gusku.site/game/underworld-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Underworld Dungeon\", \"description\": \"Looking for information on Underworld Dungeon? Check out the release date (Jul 31, 2017), developer insights from InfernoSoul,Fromjaf Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"InfernoSoul,Fromjaf Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fromjaf Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/520300/header.jpg?t=1641141145\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}