{
    "AppID": 619230,
    "Name": "VEmpire - The Kings of Darkness",
    "Release date": "Jul 24, 2019",
    "About the game": "'Those that do not fear history are condemned to relive it.' VEmpire - The Kings of Darkness is a vampire themed digital deck-building game, inspired by one of history's most influential royal dynasties - the house of Habsburg. And: It is an honest &amp; complete product, 100% Pay2Win free! There are no microtransactions or payments within the game &amp; there never will be! VEmpire is a turn-based card game about building an empire that is stronger than your opponent’s! To win: Knock down the empire-points of your opponent to zero before he does! You can choose to play against the AI, which is a serious opponent in VEmpire or invite a friend for a casual duel. Save &amp; Load AI-games whenever you want to train yourself! After some experience you may try the 'The rise of the first father' campaign. VEmpire is a deck-building game like Dominion or Ascension, just to name two popular games of this genre. It provides innovative mechanics and an exciting, atmospheric theme that is about the resurgence of the Habsburg rulers as terrific vampires! VEmpire includes more than 100 unique cards with amazing artwork in four factions! All cards (vampires, locations, artefacts &amp; spells) are drawn based on real historical characters, famous ancient buildings and gory battles! DESTROY YOUR OPPONENT It is the goal of the game to destroy the Empire of your opponent. Look out for Attack-Cards to build up your dark army, but do not forget to protect &amp; strengthen your own Empire of blood! SELECT YOUR KING Decide the king &amp; faction you want to battle with. Depending on this choice you get your start-deck and your private-deck in the Market-Place to acquire cards from. COLLECT GROUPS You collect and play Groups, the most powerful entities in the game, which are designed after its historical examples (e.g. Pairs like ‘Sisi’ &amp; ‘Franz Joseph’). They count twice if they are completed in your Empire! HOLD CARDS Location-Cards not only provide you with permanent guldens every turn but also with 'hands', which means holding-ability, this gives you more strategic flexibility and control! PLAY POWER-CARDS Play Power-Cards for fast and surprising play! Depending on your chosen king &amp; faction there are different types of Power-Cards available for you at the Market-Place. ACQUIRE OR ATTACK, ACQUIRE OR EMPIRE Attack-Cards can be played for acquiring new cards or they can… you guess right: ATTACK! Empire-Cards can be played for acquiring new cards or they can be played into your Empire to increase your empire-points. PLAY SPELLS Use offensive or defensive Spell-Cards, depending on your strategy and all for one goal: knock down your opponent! HOW TO WIN In VEmpire it is the goal to destroy your opponent by pushing his Empire-Points to zero! Buy Attack-Cards at the Market-Place to build up your army. Buy Empire-Cards at the Market-Place to protect and strengthen your Empire. But: Once played into your Empire, the cards stay there, they are lost for buying! GAME START The game starts with the flip of a dime. The winner will choose its King of Darkness first and play first! The opponent will therefore select his King from the remaining ones. Each player starts with a start-deck of 10 cards: The chosen King and 9 Mercenaries! THE MARKET-PLACE You could buy new and better cards from the Market-Place with the gulden-values from your cards by playing them from your Hand for 'Spend'. As the game starts, the Market-Place is built out of the cards from both selected factions. The two leftmost cards are your private-deck and consists of attack- &amp; empire-cards which are under the spell of your selected king, therefore only you can acquire those cards! The two rightmost cards are the private-deck of your opponent. Only he can buy those cards. However with spell-cards you can banish cards also from your opponent’s private cards. The three cards in the middle of the Market-Place are available to both players, those are the location- &amp; spell-cards from both factions. This means that each king-duel combination provides a fresh and unique collection of cards, which offers different tactical and strategic challenges and possibilities in every game. At the beginning of the game and at the end of every turn both players draw 5 cards from their Deck. In the very first round the player in second place draws 6 cards! If your newly drawn Hand does not have enough guldens to buy a card, you can recruit additional Mercenaries in order to be able to buy the cheapest or even the most expensive card from the Market-Place. Be aware of the Mercenary-Limit. At the beginning of the game you can only “Empire” one Mercenary per turn. A completed group however increases this limit by one! Before the cards for the next turn are being drawn from the player’s Deck, all played cards (except the “held” ones) go back into the players Discard-Pile. This means that played cards will stay in the game and will appear again later because if the Deck is empty the Discard-Pile will be shuffled and becomes the new Deck. This is not true for cards which were played into the Empire or cards which have gone into the Graveyard! During your turn, you can: Attack your opponent from your Hand with attack-cards Play cards from your Hand for acquiring new cards from the Market-Place Play cards from your Hand into your Empire to increase your power Play location-cards from your Hand into your Empire for permanent guldens and holding-ability Play spell-cards from your Hand for immediate effects Play power-cards and surprise your opponent Hold cards until the next turn HISTORY &amp; DARK TIME-TRAVELERS All cards in the game belong to one of four specific factions. This means that every card is under the powerful spell of one King of Darkness. A King controls the affiliates of his specific time-period, meaning just he can acquire them! But you guess very right, the mighty habsburg rulers are just bound to their king – by no means are they bound to a specific time – they could be seen as dark &amp; ancient travelers of time, appearing all at the same time – again, but bloodier then ever… At the beginning of the game the player can select his king resp. his faction! Therefore, both players have their own private-deck available for acquiring at the Market-Place exclusively. But you can use the spell-cards from both factions and this brings great freshness and new challenges into every game! They have been known throughout the centuries as the lords and ladies of Habsburg. European high-born. Influencers of men, manipulating the very fabric of human society across the four corners of the Earth. Sometimes for the good, sometimes for the detriment… always to their own ends. In time, as man and the world evolved, their dynasty, like all dynasties before it, dwindled as the last vermillion rays of the setting sun. But even as the lords of Habsburg seceded power in the early 20th century and slipped into a slumber far removed from the public eye, their name and influence remained. A peculiar, unrelenting resilience. One that’s led me to my exhaustive studies for over twenty years academic pursuit which reveals a terrifying truth… The lords of Habsburg are immortal. Nonhuman stewards of the secret of blood-the knowledge of its memory and power, and the dark magic to wield it. They are creatures of the night Nosferatu. Izcacus. Vampyr. And their sleep is over. Four lords of Habsburg have returned from the grave, intent on rebuilding their once great empire. By sheer luck, or perhaps divine will, they return in disaccord. Recalling the power from four distinct eras of history, each lord seeks to rebuild the empire in their own image. They beckon forth kin of old to sit beside them, and use blood secrets from battles and events of days remembered. I fear they will stop at nothing to attain their desires. With God’s grace, they will destroy themselves in the process. If not, I pray the world will believe my journals and witness the truth behind… VEmpire: The Kings Of Darkness. – Jakob, The Chronicler ‘3 October The history of the Hapsburg dynasty is the inspiration for our extraordinary theme. Our artists did an amazing job in turning mighty rulers into terrific vampires. Our cards are subtle interpretations of historical characters, places and events. We love to look at VEmpire as an atmospheric blend of game-mechanics, artwork, story and music. Hopefully you will enjoy this experience as much as we do!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/619230/header.jpg?t=1563983488",
    "Price": 13.99,
    "Developers": "Wolfgang Lueger",
    "Publishers": "Vempire Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_b14c172b0911ce5165141183f37aa06466e2b04e.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_4a46ebe8acdc0934520952937152d7a99ecc0d8c.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_f86b8899e404cab361de6d8dc405465855758367.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_ea9e3d11f6c40b0014f4cd6e153462a3e74bd05a.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_536bb68ecb3aea9db4da2efaedbd07fdb793ab68.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_b561083ea68ae6f39d9453a5628fe7ff581f3063.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_12927b694d6f9b0a4281e9b4cb53d0f65438c757.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_b235095f4d8c7155bfaef051400dc80fa7309e17.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_820ae400144a2336fafd0728c90b419d81e34859.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_e0571c499f9686f590c842d47fb926e0525d23c4.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_e1472a9a208a656ed7d84de663fa3aa442cff97b.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_d24a4397af55c566cc240052eb26f1012fed5eb8.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_5bf4fc82701751c135c58af60ebc4d51a90693f2.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_3c8c47908acaa4263668f1af5a13dfccc83d5b62.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_08059265a00bd33c912d64171d4502d9b0899f5f.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_436bd05c8d55749f512955ea42f3eec719c4e22c.1920x1080.jpg?t=1563983488,https://cdn.akamai.steamstatic.com/steam/apps/619230/ss_3d4694ef926d81e801c986226b6d69a8d0b3bc51.1920x1080.jpg?t=1563983488",
    "Slug": "vempire-the-kings-of-darkness",
    "Meta Title": "VEmpire - The Kings of Darkness: Jul 24, 2019, Wolfgang L...",
    "Meta Description": "Looking for information on VEmpire - The Kings of Darkness? Check out the release date (Jul 24, 2019), developer insights from Wolfgang Lueger, and a co...",
    "Alt Text Image": "Official header image for VEmpire - The Kings of Darkness game - Steam 619230",
    "Canonical URL": "https://gusku.site/game/vempire-the-kings-of-darkness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VEmpire - The Kings of Darkness\", \"description\": \"Looking for information on VEmpire - The Kings of Darkness? Check out the release date (Jul 24, 2019), developer insights from Wolfgang Lueger, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wolfgang Lueger\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vempire Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/619230/header.jpg?t=1563983488\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}