{
    "AppID": 455340,
    "Name": "Warhammer 40,000: Armageddon - Da Orks",
    "Release date": "Aug 18, 2016",
    "About the game": "The year is 941.M41, and a massive Space Hulk appears in the Armageddon star system. It is believed uninhabited, and the citizens of Armageddon wonder what riches they will discover when salvage companies survey it. Little do they know that a huge Ork invasion force is hidden within, ready to bring death and destruction upon the unsuspecting Imperial world... The fate of Armageddon hangs in the balance, and your actions will determine the outcome. As Ghazghkull Thraka's most trusted Nob, take command of the Ork hordes and unleash the greatest WAAAGH! in history upon the imperial world of Armageddon. Prove once again that “humies is all weak scum that deserve ta get stomped”. Make sure that even the Space Marines will not save the day, against the great green tide. Warhammer 40,000: Armageddon - Da Orks is the second installment in the series of wargames about the wars for Armageddon, one of the most iconic conflicts in Warhammer 40,000 universe. In this hex-based, turn-based strategy game, players will lead the Orks against the Imperial forces of the Armageddon Steel Legion and Space Marines from a variety of Chapters, under a scorching sun, through hostile ash wastes, and in the shadows of gigantic Hive Cities. The game features an engaging dynamic campaign which can end with the historic defeat or an epic victory. While advancing through the campaign, the player will have the ability to carry over battle-hardened veterans from scenario to scenario, using their experience and upgrading their equipment. Multiplayer battles can be played on a variety of predesigned or skirmish maps, on PC or iPad, using Slitherine's award-winning PBEM2++ system. Players can choose any of the five available factions: Steel Legion, the Orks, Ultramarines, Salamanders and Blood Angels, with a huge variety of units available to each faction. On top all this extensive modding options are available through a powerful and easy-to-use game editor. Features Large campaign divided into 3 acts and 18 separate scenarios, portraying the Second War for Armageddon from the Orks perspective. Any scenario can also be played individually. A bonus tutorial campaign showing Ghazghkull Thraka's rise to power. Fight alongside Ghazghkull Thraka, Mad Dok Grotsnik and other voiced legends of the war. Carry over battle-hardened veterans from scenario to scenario, using their experience and upgrading their equipment and weaponry. Detailed combat model with 20 different units stats, custom terrain, cover and morale effects. Fight through hostile ash wastes, treacherous volcanic canyons, acid polluted rivers, dense jungles, the outside and inside of massive Hive cities. 400+ unit types divided into 7 classes, representing the Orks, Armageddon Steel Legion, Blood Angels, Ultramarines and Salamanders and even gigantic Gargants and Titans! 200+ weapons, each with their unique stats and graphical effects, with up to 3 different weapon systems per unit 10 hand crafted Multiplayer maps, and infinite replay in multiplayer skirmish mode. Powerful and easy-to-use game editor",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/455340/header.jpg?t=1575555536",
    "Price": 19.99,
    "Developers": "Flashback Games,The Lordz Games Studio",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/455340/ss_cd84e4c71a994c4482429ebcd315b7535c797d5f.1920x1080.jpg?t=1575555536,https://cdn.akamai.steamstatic.com/steam/apps/455340/ss_911f24abf372b735cb25d23004f495b9508f0168.1920x1080.jpg?t=1575555536,https://cdn.akamai.steamstatic.com/steam/apps/455340/ss_5fc8fa817fa1e68a7f9c234264b3496c351e42ad.1920x1080.jpg?t=1575555536,https://cdn.akamai.steamstatic.com/steam/apps/455340/ss_f63ffd44e4dc1bff643f84bdaf0784e23ba1ba85.1920x1080.jpg?t=1575555536,https://cdn.akamai.steamstatic.com/steam/apps/455340/ss_7cc7a59a1ae180d602f2507eb2999784dd8cdcef.1920x1080.jpg?t=1575555536,https://cdn.akamai.steamstatic.com/steam/apps/455340/ss_4afc9e3bbb6417a9c4d0aaf737396ff39c5a2da0.1920x1080.jpg?t=1575555536",
    "Slug": "warhammer-40-000-armageddon-da-orks",
    "Meta Title": "Warhammer 40,000: Armageddon - Da Orks: Aug 18, 2016, Fla...",
    "Meta Description": "Looking for information on Warhammer 40,000: Armageddon - Da Orks? Check out the release date (Aug 18, 2016), developer insights from Flashback Games,Th...",
    "Alt Text Image": "Official header image for Warhammer 40,000: Armageddon - Da Orks game - Steam 455340",
    "Canonical URL": "https://gusku.site/game/warhammer-40-000-armageddon-da-orks",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warhammer 40,000: Armageddon - Da Orks\", \"description\": \"Looking for information on Warhammer 40,000: Armageddon - Da Orks? Check out the release date (Aug 18, 2016), developer insights from Flashback Games,Th...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 18, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flashback Games,The Lordz Games Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/455340/header.jpg?t=1575555536\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}