{
    "AppID": 583620,
    "Name": "3D Organon Anatomy",
    "Release date": "Jun 23, 2017",
    "About the game": "*****PLEASE NOTICE, THIS IS THE PERSONAL EDITION OF 3D ORGANON ANATOMY***** FOR ACCESS TO THE ENTERPRISE EDITION search ‘3D Organon Anatomy | Enterprise Edition’ (for desktop) and ‘3D Organon VR Anatomy | Enterprise Edition’ (for VR version). 3D Organon Anatomy is an interactive human anatomy application featuring all 15 body systems. 3D Organon unfolds life-like high resolution 3D models covering every aspect of the human body. It features an extensive knowledge-base of anatomical definitions with the terminology based on the official Terminologia Anatomica . The application delivers accurate visual and textual information, immediate response time, and intuitive navigation. It satisfies the highest standards of medical and scientific accuracy. All anatomical definitions and clinical correlations are written by professors of anatomy and medical professionals. The new STEAM version of the app includes the human ‘Actions’ module, with animations of joints and bones. This update brings you more stunning features, such as multiple workspaces, a live anatomy annotation tool during navigation, a unique topographic anatomy layout, help tutorials, and visualization of anatomy with incredible detail. Game changer multi-user anatomy trainer The new ‘Network’ module allows STEAM users to join multi-user online training sessions created by subscribed educators and institutions. The new awesome virtual anatomy trainer enables you to attend online anatomy lessons and communicate with your teacher and peers in real-time with voice and chat messages. The new module is cross platform, setting no barriers for users joining a session with any supported device (VR and non-VR). Get in touch with us at prosupport@3dorganon.com for more details. Who is 3D Organon Anatomy for? The app is designed to suit a range of individuals from medical and allied-health students, to patients, artists, and curious minds. It helps students grasp the challenging subject of anatomy, but it is also easily understood by laypeople without a medical background. The upgrade to an Enterprise license grants access to advanced teaching tools that could complement any anatomy curriculum. Educators and healthcare professionals can now visualize and explore anatomy as never before. THIS IS THE DESKTOP VERSION OF 3D ORGANON ANATOMY Why 3D Organon Anatomy is the most motivating anatomy app? Amazing life-like high detail graphics for better user experience Visualize anatomy using the latest 3D technologies Join multi-user anatomy training sessions created by subscribed educators and institutions Skeletal system and joints animations without an additional cost! Start understanding anatomy within minutes You can add and subtract whole body systems on your screen at once Unique topographic anatomy layout: you can select from regional body systems and view the systems of interest, excluding others Switch between customized workspaces for quicker anatomy model access Real-time identification of anatomy — hover mouse pointer on a structure during navigation and an annotation will show up (without clicking) Hundreds of pages of anatomical definitions and medical texts are included New help menu with explainer video tutorials Take notes related to a selected structure and make drawings layered on top of the presentation view Study from hundreds of preconfigured scenes based on popular anatomical views found in anatomy atlases and textbooks The developer of 3D Organon Anatomy has been awarded as the ‘Startup of the Year’ in the prestigious iAwards contest organized by the Australian Information Industry Association. Our team is also behind the world’s first fully-featured virtual reality anatomy atlas — the award-winning app 3D Organon VR Anatomy . 3D Organon Anatomy includes detailed male and female models. It features all body systems: Skeletal, Connective, Muscular, Arterial, Venous, Nervous, Lymphatic, Heart, Respiratory, Digestive, Endocrine, Urinary, Reproductive, Sensory organs, and Integumentary/skin. Awesome features Rotate, Pan, and Zoom in/out functions Double tap to select and focus on a structure Use navigation panel for quick view of all positions of human model Hide or Fade selected structures Save your models in Favorites for later reference Discover Lock mode — a powerful tool enabling you to operate on user-defined structures and body systems Single- and Multi-select modes Beautiful symmetry of human organs and structures that make the learning experience easy and appealing Realistic X-ray mode (Fade others button) Live search tool Listen to anatomical terminology in English Isolate view of any selected structure(s) Addition/subtraction buttons for displaying muscles into layers, from deep to superficial",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/583620/header.jpg?t=1647386450",
    "Price": 24.99,
    "Developers": "Medis Media",
    "Publishers": "Medis Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_47fcd950ea438c15c6fd44a03410419efcbeb6b9.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_5eb20946c941d425de29d0e827069e48fb997536.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_279eaf9ba492f8f03b5836fed79273223ad0d946.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_d8749fc6ec2d55e6587aff1b2a356125eb4cbc37.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_f39fdf4a299905e14642be94666a23aff4a02d37.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_de9780629a429cf9f9371f1584305f48a64aa983.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_306b1f01cf9a826fa31dc48b8ea61897870d5da6.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_9a164d630db0f48c297714667be430f3e186d458.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_1c686549a1753b9a6815b0611f64b7532f46a3d0.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_1856b0ccd737d54614363006953f9680a1e96f36.1920x1080.jpg?t=1647386450,https://cdn.akamai.steamstatic.com/steam/apps/583620/ss_306712bb931dfc1c2f035406a8d7a4ea2f5bec07.1920x1080.jpg?t=1647386450",
    "Slug": "3d-organon-anatomy",
    "Meta Title": "3D Organon Anatomy: Jun 23, 2017, Medis Media and Full Ov...",
    "Meta Description": "Looking for information on 3D Organon Anatomy? Check out the release date (Jun 23, 2017), developer insights from Medis Media, and a complete game summary.",
    "Alt Text Image": "Official header image for 3D Organon Anatomy game - Steam 583620",
    "Canonical URL": "https://gusku.site/game/3d-organon-anatomy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"3D Organon Anatomy\", \"description\": \"Looking for information on 3D Organon Anatomy? Check out the release date (Jun 23, 2017), developer insights from Medis Media, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Medis Media\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Medis Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/583620/header.jpg?t=1647386450\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}