{
    "AppID": 1124080,
    "Name": "Active DBG: Brave's Rage",
    "Release date": "Apr 21, 2022",
    "About the game": "8 unique playable characters, over 300 cards, 16 difficulty settings, and 8 different stages! More exciting content is on the way! Brave's Rage is an active-time roguelite deckbuilding game. Our unique active-time card battle system allows players to activate “bullet-time”, find the perfect timing to attack or block, and follow up with powerful combos to deal with any situation they encounter during their adventure. Choose your braves, recruit your teammate, construct your deck, and defeat some of the most fearful foes to save the princess! Brave's Rage is a roguelite deckbuilding game with a twist. A classic deck-building game with some new twists! You must have played roguelite deckbuilding games before, but have you ever played an active-time roguelite deckbuilding game? We have brought some of the most popular features from ATB RPGs and Action Games into our iteration of a classic deckbuilding game. In Brave's Rage, don't just sit, click and watch your cards get played! You can activate bullet-time at any time to determine the timing of your card play. Sometimes it just takes a carefully-timed block to turn the tide completely! Of course, people always say 'the best defence is a good offence', this is also true for Brave's Rage. Make sure you read the actions of your foe and take advantage of the bullet-time! You can time your move to dodge and then connect with counterattacks. Or maybe unleash a powerful AOE attack to hit them all at the same time! Choose your braves, craft your deck, play in different styles, and experience a different adventure every time you set off! Eight different playable characters (with plans to add more!) with their own sets of cards and unique skill trees. There are also randomized map quests and events to make your braves stronger (well... most likely)! And don't forget to loot all the powerful items and gear along your way. Find your most comfortable build and bring home the princess! And...obviously, it is dangerous to go alone! Create a duo with another brave to go further. Construct strategies and find synergies, double the builds and quadruple the fun! Set off on an epic journey, experience Brave's Rage - A (Very!) Active Deckbuilding Game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1124080/header.jpg?t=1656390796",
    "Price": 9.99,
    "Developers": "ISVR",
    "Publishers": "Astrolabe Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1124080/ss_69ccdc1eb40cbc5334fc1406c5a8f213d28a279c.1920x1080.jpg?t=1656390796,https://cdn.akamai.steamstatic.com/steam/apps/1124080/ss_80a4b194d7eb69ec5d87c532da327eadb5426373.1920x1080.jpg?t=1656390796,https://cdn.akamai.steamstatic.com/steam/apps/1124080/ss_7ae8013df50721d59d295446ee2d789dcf990ad9.1920x1080.jpg?t=1656390796,https://cdn.akamai.steamstatic.com/steam/apps/1124080/ss_745f6a40517e2a9bb25b20af8d58172d5d1f97f8.1920x1080.jpg?t=1656390796,https://cdn.akamai.steamstatic.com/steam/apps/1124080/ss_b8460486c063d4bf2fdf6ed2081c951f11fbf693.1920x1080.jpg?t=1656390796",
    "Slug": "active-dbg-brave-s-rage",
    "Meta Title": "Active DBG: Brave's Rage: Apr 21, 2022, ISVR and Full Ove...",
    "Meta Description": "Looking for information on Active DBG: Brave's Rage? Check out the release date (Apr 21, 2022), developer insights from ISVR, and a complete game summary.",
    "Alt Text Image": "Official header image for Active DBG: Brave's Rage game - Steam 1124080",
    "Canonical URL": "https://gusku.site/game/active-dbg-brave-s-rage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Active DBG: Brave's Rage\", \"description\": \"Looking for information on Active DBG: Brave's Rage? Check out the release date (Apr 21, 2022), developer insights from ISVR, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ISVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Astrolabe Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1124080/header.jpg?t=1656390796\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}