{
    "AppID": 1756800,
    "Name": "Casino Tycoon Simulator",
    "Release date": "Nov 30, 2021",
    "About the game": "CASINO TYCOON Money, power, prestige, passion, crypto... In Casino Tycoon you`ll find more than them. Live the Las Vegas ambiance like in the peak. Your goal is, making more money with using your sources. Run your own casino, develop and buy some more machines and tables. Run the slot, roulette, blackjack world. In Casino Tycoon, taking the effect of the crypto market is more enjoyable than you thought. YOU ARE THE BOSS! Start with running your own casino and enjoy with the flow of the game while your huge safe filling with money. Your growing and becoming more popular casino will spread your fame and reputation. In Casino Tycoon the world is yours... THE PRESTIGE SCENE Create your own world`s prestige scene in Casino Tycoon. Run your casino and make it number one. This move will bring prestige points to you. With your increasing fame, you`ll get more prestige points and more money. You will get more stuff with using your prestige points. SLOT MACHINES, BLACJACK TABLES Enchant your clients with buying slot machines, roulette tables and blackjack tables. Make more fun of them. Make your machines and tables earn more money.More tables will get more clients. BUY YOUR OWN BAR Buy your own bar and accommodate it. Open services for your clients. When your clients take services from your bar, they stay more in your casino. In this way, you can collect more prestige points. YOU CAN BE THE BIG WHALE OF THE CRPTO WATERS Crypto money business will help you to increase your prestige. Earn with bitcoin mining. Multiply your money`s worth while buying and selling crypto money. It is the law of the nature, big fish eats little fish. Action! IN CASINO TYCOON THE SHOW MUST GO ON! Increase your prestige points and add on your casino more showrooms. Glowing showrooms will enchant your clients. While your casino full of your clients you can make more fun! INCREASE YOUR SECURITY TO TOP LEVEL While you running a prestigious casino the things that you must do are not ending with coordinating your money flow and taking care of your clients. There are much more... In Casino Tycoon you have to make your casino a safe place. Buy security cameras, get rid of the thieves and protect your money. Add more security cameras in your casino. In a prestigious casino, nobody wants to struggle with the rooking things. Protect your casino with your cameras and destroy the rooking possibilities. ESTABLISH THE DOMINANCE OF YOUR CASINO For more money, repair and take care of your tables and machines. Make the ambiance look better. You`ll have so much fun while running this casino.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1756800/header.jpg?t=1650206147",
    "Price": 14.99,
    "Developers": "Cracked Bone Studios",
    "Publishers": "Cracked Bone Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_71802f85d42d62d045c5ee86ffd7e460edb84885.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_eb7359cf9022f15d37307fd270e92131b2dc882b.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_6c5ce2ade661242e358612e6cd7eef2ce1b195ee.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_3610652a792427b9682be76cf502a681a8045d79.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_9ea13cdfd67a0316863c7449e07802d0b3f36111.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_d42426ea279870a0e206c4dfa10e323cf0fc9995.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_f62e4867d8adee208eaadf2b4ca7426f10f69748.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_bd25211e4005a6adff4f48927e8121628a092b2e.1920x1080.jpg?t=1650206147,https://cdn.akamai.steamstatic.com/steam/apps/1756800/ss_0fd74990422a484bf8fe2f5068db9da5e1f07117.1920x1080.jpg?t=1650206147",
    "Slug": "casino-tycoon-simulator",
    "Meta Title": "Casino Tycoon Simulator: Nov 30, 2021, Cracked Bone Studi...",
    "Meta Description": "Looking for information on Casino Tycoon Simulator? Check out the release date (Nov 30, 2021), developer insights from Cracked Bone Studios, and a compl...",
    "Alt Text Image": "Official header image for Casino Tycoon Simulator game - Steam 1756800",
    "Canonical URL": "https://gusku.site/game/casino-tycoon-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Casino Tycoon Simulator\", \"description\": \"Looking for information on Casino Tycoon Simulator? Check out the release date (Nov 30, 2021), developer insights from Cracked Bone Studios, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cracked Bone Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cracked Bone Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1756800/header.jpg?t=1650206147\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}