{
    "AppID": 579020,
    "Name": "Constructor",
    "Release date": "May 26, 2017",
    "About the game": "IN THIS TOWN ANYTHING GOES. You can’t rise to the top without taking a few others down. If that means engaging in a workplace accidents, dodgy deals, and a shifty trick or two then so be it! You're going to need every trick in the book if you want to go from small-time slumlord to property tycoon ! In Constructor , you take on the role of a budding property tycoon who must do battle with your competitors to create a thriving and profitable city... in ANY way you see fit! Build houses and factories, cope with the incessant demands of your tenants as well as keeping a whole bunch of UNDESIRABLE characters under control! This ‘colourful’ group of degenerates can also be used against the competition with humorous and catastrophic effect! After all, it's time you stopped playing by the rules and did things your way, and who knows you might even get away it, too! Have you ever looked at your rival's town and thought 'That's quite a nice property you've got there. Mind if I take it?' Well, stop looking and send your trusty Foreman over to rip up the fence panels! Soon enough, you'll find yourself the proud owner of a previously used property - no deposit necessary! Sell it out from under your rival's nose for a quick profit or place your own tenant inside it for long-term gain. Of course, if you're not so interested in what the property can do for you but more about what it can do to your rival then simply let it fall into disrepair. Soon enough it'll become infested and eventually explode... hopefully taking out a few of your rival's men or properties with it! CRIME IS YOUR GREATEST TOOL. If all else fails, call in the Mob… Send your Gangsters around to take out your rival's most important properties, or hit their people to thin their ranks before you move in for the finishing blow. The more they kill the better the weapons your Gangsters will be able to access including but not limited to pistols and the devastating laser! A force to be reckoned with if ever there was one. Of course, if you've got cold feet and dealing with the Mob isn't your cup of tea you can also hire the services of various undesirables to do your bidding. Show your rival's just how much you really care by sending Mr Fixit over to provide 'assistance' with one of your rival's properties. If you'd prefer to just watch the carnage unfold send the happy-go-lucky chainsaw wielding Psycho over to carve up your rival's investments, and maybe just about anyone who tries to stop him! Just watch that whilst all this is happening that you don't forget about the latest nagging from the Council or it might just be closing time... for good! Just when you thought you'd earned yourself a tea break... Boom! The Council are on your back about some issue or another, and if you don't keep them happy you'll either lose some of your hard-earned investment properties or risk being closed down . Permanently. Keep them happy, though, and you'll be rewarded with special marks that can be sold for a quick cash injection, or as a way of staying in good with the Council as you proceed to ignore every one of your tenant's incessant demands. Treat your tenants well, though. In Constructor they're not only your most important form of income, you're going to need them if you want to breed additional children to one day join your workforce. This is especially true if you want to stay ahead because you'll need all of the help you can get to ensure that your factories continue churning out resources, gadgets, and of course industrial pollution. If you think you've got what it takes to be successful in the world of Constructor then put on your hard-hat and start digging. You've got tenants to please, rent to collect, and rivals to keep guessing. After all it's your town... so deal with it! TAKE A GANDER AT THESE FEATURES. An interactive tutorial guides you through the very basic concepts of Constructor from building your first properties to taking over your first properties. Six free play scenarios that test your ability from Financial Conquest all the way up to the perfect Utopian State. Keep things interesting by adding an opponent or three into the fray. Assist Nigel Plasterboard of Cobble &amp; Stones across six multi-staged story missions. Why did Nigel abandon you during the tutorial? Who is Vincenzo? Are you even reading this? We'll never really know. Five different locations including lush countryside towns, an abandoned industrial sector, and a lush tropical jungle. The ever-present Council will keep you hard-pressed as it periodically harasses kindly asks you to complete various tasks based not only on your own progress, but that of your rival's as well. If your rival suddenly has an increase in active Hippy Communes then you can bet your most expensive property that you'll be hearing about it. Law enforcement helps you protect your investments from your rivals. If you're feeling a little more unlawful then consult with the Mob and create Gangsters of your own to deal with the problems directly. Populate your town with ten different tenants each with their own ridiculous demands and quirky personalities. From slovenly Slobs up to the snobby Sloanes you'll have no shortage of unfortunate residents to charge exorbitant rental fees! Getting tired of that one Major always complaining about a tree you planed in his garden? Kick him out and move in someone else who has a finer appreciation of garden apparel. Whatever that means. Six different Super Tenants each with their own function to help your town run just that little bit better. Keep them happy, though, because they tend to demand just a little extra attention than your average tenant. Seven wacky and completely undesirable... undesirables . Rob them blind with the Thief or blow them up with Mr Fixit. No job is too dirty for this lot. Well, unless it happens to be Mr Fixit bodging the plumbing, and spreading raw sewage all over someone's garden. Use your tenants to breed new members of your workforce. Look after your people by sending them to the hospital to keep them in peak physical condition. Decorate your town, and keep your tenants happy, with multiple garden decorations. Protect and improve your various properties by equipping them with various gadgets such as the Burglar Alarm or release the hound with a well-placed Dog Kennel among other gadgets... Design and share city maps with online multiplayer battles against up to 3 of your mates.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/579020/header.jpg?t=1560786182",
    "Price": 29.99,
    "Developers": "System 3",
    "Publishers": "System 3",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_f6ac28685d9cfff2ef226d93ed99ffa640622d27.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_0c802529ecadb9800f21ec7a03d8baa4e558d78c.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_ea3040463c4771e5a25c57168f4c5932c09a36ea.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_dc0108d2d508e130178d2a0f3c6cb0964ad2daa2.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_0d4b3a2b9df4bab72804c7668428ca82d28c1c31.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_348f6c6ef9ee2b3bb13b524342da29342158cf1c.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_118810dcb35e38a721036ddc6ab5f2c06bb80da9.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_2048c5ed923d4a1f262ad313bee1c961003b1062.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_1d4a9685e9d691f8f1c350f518de75eaf56a39ff.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_beac04c649c2bdefff9b56a5dd128c237ff8c4af.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_590ff7b7dde6fbefa3097bdcae024d368dd084af.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_2b67098badce1a600327110344b48f8e4f0331e1.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_bc9f85ed499f5a1f1aab371dd5355919cee8557c.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_86d968db4a2b5129a4b3ea322440df94a4df0b24.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_814e8ad8cb048c09f0815a6599d4fe40811f2483.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_e159ee7b9d6082167704dbf3c12e46398ef7edf0.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_0d589af4784800e98df5e278066fcc4dfc8cd1d1.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_9414abe4c5a1e5e6cbbe0decdcaa1634cb8e51a2.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_9702b00068a63a08724749853476717b3d76e683.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_246a1c7b57d0a687dcb08c57b032c321d6ede7af.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_31adfd3585820faebf04f9d5768e2188300e8ec6.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_a57cc848ff4da23eb622c1401517951a0cdf259e.1920x1080.jpg?t=1560786182,https://cdn.akamai.steamstatic.com/steam/apps/579020/ss_ea1bfee5c5c25a08791544fc75cad7fa13aea571.1920x1080.jpg?t=1560786182",
    "Slug": "constructor",
    "Meta Title": "Constructor: May 26, 2017, System 3 and Full Overview",
    "Meta Description": "Looking for information on Constructor? Check out the release date (May 26, 2017), developer insights from System 3, and a complete game summary.",
    "Alt Text Image": "Official header image for Constructor game - Steam 579020",
    "Canonical URL": "https://gusku.site/game/constructor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Constructor\", \"description\": \"Looking for information on Constructor? Check out the release date (May 26, 2017), developer insights from System 3, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"System 3\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"System 3\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/579020/header.jpg?t=1560786182\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}