{
    "AppID": 325670,
    "Name": "CRYENGINE - Wwise Project DLC",
    "Release date": "Oct 7, 2014",
    "About the game": "The EaaS Wwise Project DLC gives you access to the official Wwise Project used to integrate all Audio in the CRYENGINE SDK levels. The project will give a good overview of the possibilities Wwise and CRYENGINE have to offer and shows best practices in how to set up the project structure in Wwise, and to use it together with CRYENGINE's Audio Controls Editor (ACE). By installing the Wwise Project DLC you will enable the Audio Controls Editor to display all setup connections between CRYENGINE’s ATL and the Wwise audio middleware. This in turns gives you the freedom to rearrange connections any way you want. Additionally you can use the Wwise Project DLC as a reference to learn how Crytek Audio Designers use Wwise. We hope this will help you on your path to create your own Wwise project running with the new CRYENGINE Audio Translation Layer (ATL). Instructions to set up this DLC can be found in the CRYENGINE Documentation. Audiokinetic's Wwise Middleware can be used for free in your CRYENGINE projects if you are using a maximum of 200 media assets. The folks at Audiokinetic will provide you with a Wwise license that suits your projects requirements, register with them to receive a license, at the link below, they have multiple options that cover scenarios from student academic to AAA. / If you are not planning to sell your game commercially Audiokinetic is offering a free license for non-commercial projects without media asset restrictions. The Audiokinetic Wwise Non-Commercial License can be used for creating game prototypes, developing freeware or working on academic projects. If you later on plan a commercial release of your game and exceed the limit of 200 assets you can purchase an appropriate Wwise commercial license. For more information on this please visit: / If you have questions regarding Wwise licensing they will gladly answer them. Legal All Audio content of the Wwise SDK Demo project: Crytek GmbH. All rights reserved. © 2015 Crytek. The Audio Content contained in this project is the property of Crytek. If you would like to have the Original Audio Assets, used as part of the CRYENGINE-Wwise Project DLC, to use or modify for a commercial purpose or public demonstration, please contact Crytek directly.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/325670/header.jpg?t=1478096559",
    "Price": 0.0,
    "Developers": "Crytek",
    "Publishers": "Crytek",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/325670/ss_5800896729b17c6bbd71a5f2a075775e4346f7a2.1920x1080.jpg?t=1478096559,https://cdn.akamai.steamstatic.com/steam/apps/325670/ss_8e87d76adb029c0454823e73279f70de20432777.1920x1080.jpg?t=1478096559,https://cdn.akamai.steamstatic.com/steam/apps/325670/ss_e6d72124356010697ceeac4679731ab6998882e1.1920x1080.jpg?t=1478096559,https://cdn.akamai.steamstatic.com/steam/apps/325670/ss_e84db429898772951ca64ab219c466291851dd61.1920x1080.jpg?t=1478096559",
    "Slug": "cryengine-wwise-project-dlc",
    "Meta Title": "CRYENGINE - Wwise Project DLC: Oct 7, 2014, Crytek and Fu...",
    "Meta Description": "Looking for information on CRYENGINE - Wwise Project DLC? Check out the release date (Oct 7, 2014), developer insights from Crytek, and a complete game ...",
    "Alt Text Image": "Official header image for CRYENGINE - Wwise Project DLC game - Steam 325670",
    "Canonical URL": "https://gusku.site/game/cryengine-wwise-project-dlc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CRYENGINE - Wwise Project DLC\", \"description\": \"Looking for information on CRYENGINE - Wwise Project DLC? Check out the release date (Oct 7, 2014), developer insights from Crytek, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 7, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crytek\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crytek\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/325670/header.jpg?t=1478096559\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}