{
    "AppID": 381210,
    "Name": "Dead by Daylight",
    "Release date": "Jun 14, 2016",
    "About the game": "Death Is Not an Escape. Dead by Daylight is a multiplayer (4vs1) horror game where one player takes on the role of the savage Killer, and the other four players play as Survivors, trying to escape the Killer and avoid being caught, tortured and killed. Survivors play in third-person and have the advantage of better situational awareness. The Killer plays in first-person and is more focused on their prey. The Survivors' goal in each encounter is to escape the Killing Ground without getting caught by the Killer - something that sounds easier than it is, especially when the environment changes every time you play. More information about the game is available at Key Features • Survive Together… Or Not - Survivors can either cooperate with the others or be selfish. Your chance of survival will vary depending on whether you work together as a team or if you go at it alone. Will you be able to outwit the Killer and escape their Killing Ground? • Where Am I? - Each level is procedurally generated, so you’ll never know what to expect. Random spawn points mean you will never feel safe as the world and its danger change every time you play. • A Feast for Killers - Dead by Daylight draws from all corners of the horror world. As a Killer you can play as anything from a powerful Slasher to terrifying paranormal entities. Familiarize yourself with your Killing Grounds and master each Killer’s unique power to be able to hunt, catch and sacrifice your victims. • Deeper and Deeper - Each Killer and Survivor has their own deep progression system and plenty of unlockables that can be customized to fit your own personal strategy. Experience, skills and understanding of the environment are key to being able to hunt or outwit the Killer. • Real People, Real Fear - The procedural levels and real human reactions to pure horror makes each game session an unexpected scenario. You will never be able to tell how it’s going to turn out. Ambience, music, and chilling environments combine into a terrifying experience. With enough time, you might even discover what’s hiding in the fog. WARNING: PHOTOSENSITIVITY/EPILEPSY SEIZURES - READ THIS NOTICE BEFORE PLAYING A very small percentage of people may experience epileptic seizures or blackouts when exposed to certain kinds of flashing lights or light patterns. These persons, or even people who have no history of seizures or epilepsy, may experience epileptic symptoms or seizures while playing video games. If you or any of your relatives has an epileptic condition or has had seizures of any kind, consult your physician before playing any video game. IMMEDIATELY DISCONTINUE use and consult a physician if you or your child experience any of the following symptoms: dizziness, altered vision, eye or muscle twitching, involuntary movements, loss of awareness, disorientation, or convulsions. Parents should watch for or ask their children about the above symptoms. You may reduce risk of photosensitive epileptic seizures by taking the following precautions: sit farther from the screen, use a smaller screen, play in a well-lit room, do not play when you are drowsy or fatigued.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/381210/header.jpg?t=1658761787",
    "Price": 7.99,
    "Developers": "Behaviour Interactive Inc.",
    "Publishers": "Behaviour Interactive Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_659500624438a4aa77bfdf304cba3ecebcd92ed9.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_ca6b39f2fcac8feb75d23976b1be31290d58d159.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_4075aac79adfe1a5b71665d2cc5ff7d52122650b.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_d3778cc9576bf3457f4ba896a443a114c0455753.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_b142095e4f9e5d9db978270ea09e8b9149db9f18.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_430577c364a68dbe24e8a1d895bd678ea04b87d5.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_969a7841466e12f063c2d9a72520cce1c3b2f331.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_cd57ce3a42d66d90164534ad71388527f1e0cf7b.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_bd49ddb8318bf9d54cb185b57c7fccfe7cb609c0.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_6f14934aaec5f564c8092c85dca236e04935db9d.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_b20e7868e4a80f619fb2e4ef69f7228048a68e99.1920x1080.jpg?t=1658761787,https://cdn.akamai.steamstatic.com/steam/apps/381210/ss_42f2866b00cf92cbe84bc8bb32c1fe65911c074c.1920x1080.jpg?t=1658761787",
    "Slug": "dead-by-daylight",
    "Meta Title": "Dead by Daylight: Jun 14, 2016, Behaviour Interactive Inc...",
    "Meta Description": "Looking for information on Dead by Daylight? Check out the release date (Jun 14, 2016), developer insights from Behaviour Interactive Inc., and a comple...",
    "Alt Text Image": "Official header image for Dead by Daylight game - Steam 381210",
    "Canonical URL": "https://gusku.site/game/dead-by-daylight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dead by Daylight\", \"description\": \"Looking for information on Dead by Daylight? Check out the release date (Jun 14, 2016), developer insights from Behaviour Interactive Inc., and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 14, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Behaviour Interactive Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Behaviour Interactive Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/381210/header.jpg?t=1658761787\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}