{
    "AppID": 1162480,
    "Name": "DIMENSION REIGN - ROGUELIKE DECKBUILDER",
    "Release date": "Mar 18, 2020",
    "About the game": "The world has changed and is now under a tyrant’s rule. Facing hordes of enemies, Edge and Camilla, twins who somehow survived must seek revenge to reclaim their world. DIMENSION REIGN is a RPG roguelike, deckbuilding adventure game set in a fantasy world in ruin. Control two characters at once and chain multiple breaks together to decimate entire screens of enemies before they can even get in a hit. Loot, build a deck, and battle legions of enemies in a unique meld of card-play as you journey through the realms seeking revenge. Carefully make your way over to the boss who waits at the back of the dungeon. DIMENSION REIGN is a highly engaging roguelike, deckbuilding adventure game set in an ever-changing hellscape. The rapid gameplay requires quick judgment and fast response. Build your deck as you journey across a bleak landscape. If you want to survive, you will have to carefully consider the order of your attacks when overwhelmed by the waves of enemies. Look out for enemies' health bar and attacks value on-screen and come up with the best counter-attacks to take them down. There are several paths you can take, each with its own risks. One path may be layered with multiple monster encounters in a row followed by an elite encounter, putting your life in danger. Choose your route strategically, different locations give different rewards (Gold, relics, Cards, Dimensions Stones, ...). Explore a network of procedurally generated ruins filled with enemies to fight. Paying attention to which route to take as well as the forks in the road is crucial to building your character’s run in DIMENSION REIGN. The more dangerous routes you take, the greater your battle rewards will be! Play as two heroes with their own skill sets and job types while fighting your way through an unpredictable ever-changing world. Issue combat commands to each hero with your ability cards. Select from unlockable character classes before setting out on each run. Customize skills, weapons, to find the perfect combat combination for your play style. Pick the cards you feel provide the strongest advantage and use powerful card synergies to combine the abilities of your two heroes. Massacre your enemies as a Samurai Vampire, a Shinigami Cleric, a Kunoichi Witch, or a Ninja Rogue. Strike down menacing bosses and their puppets to recover valuable loot to equip on the fly and unlock new perks. Scavenge what you can to personalize your deck and turn hard-earned Dimension Stones into skills upgrades. Equip powerful loot for each class of hero.  Skills can be used to buff yourself or debuff enemies during a run. With so many cards and relics to choose from, no two runs will be the same. Pick the relics that fit your style, forcing a relic that doesn’t combine with your hero abilities is a losing strategy. Overcoming a series of unholy creatures to powerful gargantuan bosses offers a distinct tactical challenge. You'll need to spend as much time planning your approach as executing it. Pull off your best chain effects taking into account the weapons and attacks available and the enemy characteristic to increase your chances of survival. There are many different types of enemies and each requires a slightly different tactic to take on.  Chain multiple breaks together and decimate entire screens of enemies before they can even get in a hit. Every decision matters! If you get an instant kill against your enemies,  win a free action that doesn't cost a turn. Every hit that connects will allow you to continue attacking for a limited period of time. Connect chains with a variety of attacks and destroy enemies without taking any damage.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1162480/header.jpg?t=1644410979",
    "Price": 17.99,
    "Developers": "ScopeNext Inc",
    "Publishers": "PQube",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1162480/ss_33df6735439d62d7e203e5f73136dbcaa727a396.1920x1080.jpg?t=1644410979,https://cdn.akamai.steamstatic.com/steam/apps/1162480/ss_b944db246180819785af034dd63ce960b46143aa.1920x1080.jpg?t=1644410979,https://cdn.akamai.steamstatic.com/steam/apps/1162480/ss_af64b587660a5d332493515896b114a547dea3f8.1920x1080.jpg?t=1644410979,https://cdn.akamai.steamstatic.com/steam/apps/1162480/ss_ce308473d7e1361196dbc46276e0584f607f1536.1920x1080.jpg?t=1644410979,https://cdn.akamai.steamstatic.com/steam/apps/1162480/ss_e089e34f87391ef75e01f545c92ce1d7a853042b.1920x1080.jpg?t=1644410979,https://cdn.akamai.steamstatic.com/steam/apps/1162480/ss_6bbd5e40b2a7406d1c02068e8470f978d2c73ed0.1920x1080.jpg?t=1644410979",
    "Slug": "dimension-reign-roguelike-deckbuilder",
    "Meta Title": "DIMENSION REIGN - ROGUELIKE DECKBUILDER: Mar 18, 2020, Sc...",
    "Meta Description": "Looking for information on DIMENSION REIGN - ROGUELIKE DECKBUILDER? Check out the release date (Mar 18, 2020), developer insights from ScopeNext Inc, an...",
    "Alt Text Image": "Official header image for DIMENSION REIGN - ROGUELIKE DECKBUILDER game - Steam 1162480",
    "Canonical URL": "https://gusku.site/game/dimension-reign-roguelike-deckbuilder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DIMENSION REIGN - ROGUELIKE DECKBUILDER\", \"description\": \"Looking for information on DIMENSION REIGN - ROGUELIKE DECKBUILDER? Check out the release date (Mar 18, 2020), developer insights from ScopeNext Inc, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ScopeNext Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PQube\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1162480/header.jpg?t=1644410979\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}