{
    "AppID": 1681580,
    "Name": "Draken - Escape from Vampire Lair",
    "Release date": "Mar 22, 2022",
    "About the game": "Draken is a hardcore survival FPS rogue-like with modern weapons that need to be operated as is in real life: Insert magazine, load chamber, and check safety. Vampires abducted you for blood and left for dead in their deep dungeon. Your mission is to climb back up to the surface and escape. Please Note: Draken is a highly experimental game in the sense that it was not designed with the player in mind. This means that the game world exists as it is and the player is invited to that world. The game doesn't know the existence of the player and will not cater to deliver a fun or winnable experience. Rather, it aims to portray an average person left for dead in a deep underground vampire lair. This means that lethal monsters will be lethal. This means that your lack of firearms knowledge will not conveniently not count. This means that you are who you are in the game - a left over bloodbag for insane vampires far from the protection of civilization. You are welcomed to join the world, but please remember that this is not a vampire theme park before you purchase. FIREARM OPERATION Draken features many firearms together with physics-based ballistic simulation. What makes this even better is that the firearms need to be operated as they would in real-life. This means that the player will have to insert the magazine, pull the slide, change safety and even fix weapon malfunctions. This transforms the game from the traditional 'point and click' FPS experience to a tactically sound experience. ACTIVE RAGDOLL PHYSICS Physics-based death animation, aka Ragdoll effects, are common in modern gaming nowadays. Draken features active ragdoll physics - an advanced form of ragdoll physics that allows all body parts to be simulated by physics even when they are alive. This is unlike the traditional ragdoll, which only uses physics for death animation. Active ragdoll allows NPCs to trip over objects, slip or fall when shot and even struggle to get back up on their feet. SURVIVAL Draken features three survival elements: Hunger, thirst, and sleep. You, as a civilian abducted by vampires and left for dead deep in their vampire lair, will have to scavenge, buy, sell and even steal to stay alive. Items exist as physical objects in Draken, and consequently, volumes and weight will play their role. PROCEDURAL GENERATION Draken underworld is a unique location that many will not forget: It is a multi-story vampire lair after all. But what makes this even better is that the levels are randomized randomly for every new game. This provides a unique pathfinding narrative for the player and will keep the game's replay value steady for many play-throughs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1681580/header.jpg?t=1657491922",
    "Price": 19.99,
    "Developers": "Terapoly",
    "Publishers": "Terapoly",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1681580/ss_be3905e0c04c46d59c88c72d794e42e056762fac.1920x1080.jpg?t=1657491922,https://cdn.akamai.steamstatic.com/steam/apps/1681580/ss_622c54f0a53178ee96bd45d16e22c628c64f48e2.1920x1080.jpg?t=1657491922,https://cdn.akamai.steamstatic.com/steam/apps/1681580/ss_ff629f55fd6ebbde068878a252832ad3b099a30c.1920x1080.jpg?t=1657491922,https://cdn.akamai.steamstatic.com/steam/apps/1681580/ss_f60d5e1cabe0bf4722896d9e3e72f9e29d92c302.1920x1080.jpg?t=1657491922,https://cdn.akamai.steamstatic.com/steam/apps/1681580/ss_a66c608cc5ff2df4ca2eb676eb4c96d366e2a223.1920x1080.jpg?t=1657491922",
    "Slug": "draken-escape-from-vampire-lair",
    "Meta Title": "Draken - Escape from Vampire Lair: Mar 22, 2022, Terapoly...",
    "Meta Description": "Looking for information on Draken - Escape from Vampire Lair? Check out the release date (Mar 22, 2022), developer insights from Terapoly, and a complet...",
    "Alt Text Image": "Official header image for Draken - Escape from Vampire Lair game - Steam 1681580",
    "Canonical URL": "https://gusku.site/game/draken-escape-from-vampire-lair",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Draken - Escape from Vampire Lair\", \"description\": \"Looking for information on Draken - Escape from Vampire Lair? Check out the release date (Mar 22, 2022), developer insights from Terapoly, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Terapoly\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Terapoly\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1681580/header.jpg?t=1657491922\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}