{
    "AppID": 1324780,
    "Name": "Easy Red 2",
    "Release date": "Jan 6, 2022",
    "About the game": "Easy Red 2 is the game for those who know just what they want from a World War 2 shooter: simulation in weapons and mechanics, historical accuracy in battles, and expansive maps leaving room for large-scale infantry and vehicle combat alike. In this new version of Easy Red, we wrote everything from scratch to reach a quality of game mechanics and optimization to manage and graphical design that looks appealing yet also runs well on lower-end machines. Fronts of War In Easy Red 2, you will be taken to both the European and Pacific fronts of the war. On the European front, you will be taken to the shores of Anzio, Italy - working your way towards the bombed peaks of Monte Cassino . You will also be taken to Kos - the Greek island invaded by the Germans in 1943. In the Pacific, you will go to Kwajalein - the Japanese-occupied island invaded by the United States Marine Corps in 1944. As you can view in the changelogs here , during most of 2021 and 2022, Easy Red 2 received at least an update a week, usually more. We want to keep this practice up and deliver new features very often such as new weapons, uniforms, vehicles, factions, game modes, and more. Usually, the new features we introduce come from suggestions that users can give on the Discord server here . For information about future content that will be added, check out the Easy Red 2 roadmap here: / Simulation and Immersivity That’s what we want for Easy Red 2. We want the player to feel a hint of the real emotions, thoughts, and sense of adrenaline rush of the battlefield. Around the player will be a fury of explosions, gunfire, devastation, orders, and yells from those around them. The player will be rewarded not for his kills obtained, but for his strategic prowess and survival skills on the field. Large battles and historical locations All campaigns take place in large open-world maps that are reproductions of the real locations of historical battles, with the plans and layout of the battles faithful to events that have historically occurred. Squad-based Gameplay No one fights alone. A good, hard-earned victory requires a good hardened team- so jump in as the squad leader , the medic , or maybe the radioman . You’ll always have a job to do within your squad. In our levels, we particularly focused on creating dynamically occurring sub-objectives that differ from the main mission objectives. For example, while the main objective of the greater team may be to conquer a specific area, a sub-objective could be requesting a tank to clear its way from an anti-tank gun that has been sighted, or getting your squad to take out that anti-tank gun yourself. This allows the gameplay to play out slightly differently each time depending on how everything plays out. Vehicles War machines changed warfare forever, and the second world war proved that unequivocally. Prepare to jump into a Panzer 4, M4 Sherman, M3 Lee , or any other tank that dominated the real battles fought in the game. We decided to let the player have full control of the crew within their vehicles; they will be able to drive and shoot tanks, as long as there are crewmen to operate each armament. Also, battles don’t stop when a tank is disabled- lots of tank crews in World War 2 had time to escape from the scuttled tanks and survive the battles, and so do they in Easy Red 2. If you lose your tank in a fight, you’ll need to bring your crew (or what’s left of your crew) back to your lines safely on foot. Multiplayer Play online in both PvP and PvE missions from either the base game, your own missions from the Mission Editor, or from the workshop! Play with your own squad or join a squad of your friends Create a match whenever you want and on any map you want! Map &amp; Mission Editor The Map Editor makes it possible to create custom maps using brush tools to raise/lower the terrain, paint the textures, or add grass and props from the base game. The Mission Editor allows anyone to create their own missions for the game using maps from the base game or maps made with the Map Editor. Both maps and missions can be shared &amp; downloaded from the Steam Workshop Here's a gameplay from a Workshop map made by the community: Devastation of war Explosions will destroy sandbags, walls, fences, vehicles, defenses, and entire buildings throughout the battlefield. This can radically change the power positions and tides during a fight. Enemy fire suppresses you and your squad, lowering your accuracy and decreasing your overall peripheral vision. You will have to learn how to move safely within a combat scenario and keep your helmet on your head without it getting shot or blown off. Optimization Everyone wants a smooth playing game, so we designed our graphical style to bring about pleasing animations, textures, and effects while leaving room for a high and stable frame rate, even despite the extreme amount of units and vehicles that will be on screen, contributing to your immersion in the fight.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1324780/header.jpg?t=1656063994",
    "Price": 7.99,
    "Developers": "Marco Amadei",
    "Publishers": "Corvostudio di Amadei Marco",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_b2b0878fae4ca5d5dbfbdf815e8c4008c6f93ab1.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_6e1148d4c4e6ce81f35182db91bf7ec0af913bb9.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_cc2073d19c60321b8861e5a961ccc78d9e9a8b73.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_f0d2b4b0c06387dc746df8bf0e00ab2a15b31555.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_e65024a9f992b9cc8f1b48b9d8766ebaf930cadd.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_f2690ea4e895bac7beb2f5d6930c6ef8e0e156d2.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_2781895b112ac5d342a04a20d87cfd7f0775514d.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_ff5a9c3623440cae07127ab62dd10012b1a6d3de.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_da824ab9725723fd078046f8943da9b981ead75a.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_520be47d83fa14bdde94093f941691967e8c9546.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_a7cd1c4ca19ab65dfa128d8cee147a1e8bd3edda.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_3964be33df92da8e5c86f21afaaba6be4d660e04.1920x1080.jpg?t=1656063994,https://cdn.akamai.steamstatic.com/steam/apps/1324780/ss_c4d949766ec284325614a6ebbabcb69db5481712.1920x1080.jpg?t=1656063994",
    "Slug": "easy-red-2",
    "Meta Title": "Easy Red 2: Jan 6, 2022, Marco Amadei and Full Overview",
    "Meta Description": "Looking for information on Easy Red 2? Check out the release date (Jan 6, 2022), developer insights from Marco Amadei, and a complete game summary.",
    "Alt Text Image": "Official header image for Easy Red 2 game - Steam 1324780",
    "Canonical URL": "https://gusku.site/game/easy-red-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Easy Red 2\", \"description\": \"Looking for information on Easy Red 2? Check out the release date (Jan 6, 2022), developer insights from Marco Amadei, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marco Amadei\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Corvostudio di Amadei Marco\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1324780/header.jpg?t=1656063994\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}