{
    "AppID": 391240,
    "Name": "Forgotten Lore",
    "Release date": "Oct 5, 2017",
    "About the game": "What is Forgotten Lore? An online trading card game, powered by a single dev's passion! Forgotten Lore has online matchmaking, playing with friends, an actual in-game text chat with your opponents, workshop support for player to design their own cards built into the game, a complete deck builder with support for as many decks as players can create, tons of unique cards, and an ambitious Tome system. If this wasn't enough, players within Forgotten Lore completely control the community's economy. Gameplay At the start of a duel, each player is granted 64 HP. The goal is to get the opponent's HP to zero through turned based combat. Souls are used as currency to summon spirits from pages (cards) within a tome (deck), built before the match. Every card is unique, so there are tons of combinations of abilities. Not only are the cards unique, but the tome that carry them have special abilities as well. The soul-gathering is actually different for every tome, so matches will be extremely varied. Deck building Players start out Forgotten Lore by constructing a tome by filling it with pages before the match. Each tome (deck) can have up to 64 pages (cards). Each tome has a unique ability, so read carefully when deck building! For example, the tome Leech grants 2 souls each turn, but slowly kills its user by sapping away 1 HP each turn. With the tome Mill, souls can only be gathered by sacrificing your own pages before summoning them. And lastly, the Necromancer tome gathers souls by instead using the player's HP directly. Workshop support Workshop item editing is built directly into the game! Build all sorts of interesting or even overly powered broken monsters! The cards built in the workshop are submitted me directly to look at, after they hit a certain number of votes from other players. Accepted cards with unique art may even earn revenue from the game! Check out for more information. Player ran economy All cards granted to players (aside from the starting deck, of course) are completely freely controlled by the owner. This means they are free to be placed on the Steam Marketplace (as soon as valve allows, per their ToS) or even traded between friends. This is a real-deal digital trading card game. Community Please join me on Discord and the Steam forums! I'd love to chat directly if you have any questions/concerns or need support. / I've put a lot of love and passion into Forgotten Lore. Please, give it a try!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/391240/header.jpg?t=1568874927",
    "Price": 0.0,
    "Developers": "Coty Getzelman",
    "Publishers": "Coty Getzelman",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_c207a9718ea19ad9f632ab8e36eaf3f180539154.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_cf2443402aad8bbbc8e624a6eea620fa026108d7.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_ef6b9676ef8272be3c134e6a6083f9355666f624.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_69044a8d5c8786b7d5db0e0ef26f79ddd70c0887.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_c4f3ef2b7d6e6bf348ea00ce825ac5d0e5277cd5.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_b220dae308004198fb4b88da316a149b715df262.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_64707c5b9912a50cbe9c99990ac881a9e8421ff6.1920x1080.jpg?t=1568874927,https://cdn.akamai.steamstatic.com/steam/apps/391240/ss_3313e2a46a848543347a9140bafc484d32f55735.1920x1080.jpg?t=1568874927",
    "Slug": "forgotten-lore",
    "Meta Title": "Forgotten Lore: Oct 5, 2017, Coty Getzelman and Full Over...",
    "Meta Description": "Looking for information on Forgotten Lore? Check out the release date (Oct 5, 2017), developer insights from Coty Getzelman, and a complete game summary.",
    "Alt Text Image": "Official header image for Forgotten Lore game - Steam 391240",
    "Canonical URL": "https://gusku.site/game/forgotten-lore",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forgotten Lore\", \"description\": \"Looking for information on Forgotten Lore? Check out the release date (Oct 5, 2017), developer insights from Coty Getzelman, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Coty Getzelman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Coty Getzelman\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/391240/header.jpg?t=1568874927\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}