{
    "AppID": 614140,
    "Name": "Illusoria",
    "Release date": "May 30, 2017",
    "About the game": "Illusoria is a 2D platformer game that recalls all of those platformers that emerged during the nineties. Games such as Flashback, Heart of Darkness or Another World. Illusoria is a game where players can immerse themselves in a fantasy world full of wonderful characters and terrible monsters. A place where death lurks past every corner and where patience and expertise will be your best allies. The Prophecy has been fulfilled, and the Puppet Master has emerged from the void; a being capable of corrupting the worlds he encounters with its mere presence, turning living beings into abominations that attack and kill everything within reach while he gains power. As Keeper of the Flame, you must protect the kingdom of Illusoria, its inhabitants and Amelia, its empress. To achieve this, you must acquire the power of the Guardian throughout your adventure in order to defeat the Puppet Master and his host of monsters. Time is against you and the Empress is counting on you. Features and Gameplay: The player will have the chance to play at his own pace throughout the story and as your power increases so will your combat prowess. The main skills include running, crouching, rolling, climbing, clinging to ledges or making leaps of different lengths depending on the accuracy needed for the jump. Progressing through the story the player will learn how to toss fireballs, create flaming shields for protection against enemies or lunge at enemies while engulfed in flames. But until then, you will be vulnerable. The game lets the player choose between rushing through the levels or stopping to discover more about the history of Illusoria and its inhabitants through a system of notes and scrolls that the player can collect throughout the adventure. The game’s HUD, reduced solely to the text boxes during dialogues, has been removed for a better immersion into the world of Illusoria. During the loading screen, you will see your character progress on his journey across Illusoria in an illustrated map that will be revealed as you complete the different areas of the game. What’s so special about Illusoria? Illusoria’s art is very special, as the environments and interface is created from digital illustration. The animations and characters used throughout have been traditionally painted frame by frame in order to get a unique polished look. This also comes complete with a rhythmic soundtrack, composed by Victor Riera, where greater importance was used on environmental sound to create a suitable atmosphere for each level within the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/614140/header.jpg?t=1526041961",
    "Price": 0.99,
    "Developers": "Under The Bridge",
    "Publishers": "BadLand Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_c1bdb77083840859230704366023b3d0fc445a7a.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_af35af909ea284720e4ae1a307cb221cf9e0ed73.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_dfaccaf3d3a7d8cda09804f9eaae09863b33f990.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_c0cfaaf35b6a099bfa40f08852089f7379616667.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_dbed9b973fb6da7fbefdf82ab2203dc056902833.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_ba82ce4635711dd3b1cc60241d49590123b2bf28.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_a7228e6db4acdc33309904d81cef51cb180ba60e.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_cff7de4945a98cdd61a6c9257e11bffa949da1e8.1920x1080.jpg?t=1526041961,https://cdn.akamai.steamstatic.com/steam/apps/614140/ss_5fe25262e40124a45f1f39463933320422fc1209.1920x1080.jpg?t=1526041961",
    "Slug": "illusoria",
    "Meta Title": "Illusoria: May 30, 2017, Under The Bridge and Full Overview",
    "Meta Description": "Looking for information on Illusoria? Check out the release date (May 30, 2017), developer insights from Under The Bridge, and a complete game summary.",
    "Alt Text Image": "Official header image for Illusoria game - Steam 614140",
    "Canonical URL": "https://gusku.site/game/illusoria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Illusoria\", \"description\": \"Looking for information on Illusoria? Check out the release date (May 30, 2017), developer insights from Under The Bridge, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Under The Bridge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BadLand Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/614140/header.jpg?t=1526041961\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}