{
    "AppID": 476700,
    "Name": "Island 359™",
    "Release date": "Feb 26, 2018",
    "About the game": "You step off the chopper and into the sweltering heat of the jungle, grab your gear, and head off in search of fame, fortune, and prehistoric beasts. Nobody knows exactly why dinosaurs have shown up on this remote jungle island, but you know you can take them out. You've been hired as a mercenary to kill as many of these things as possible, and the good news is the checks have all cleared. Island 359 is a Virtual Reality survival game for the HTC Vive and Oculus Touch. Players will scrounge for weapons, upgrades, food, and other items they can find to survive for as long as they can against hordes of dinosaurs, as they explore the increasingly dangerous, beautiful, and expansive island. You're a mercenary, the money's no good to you if you're dead, so you're going to need to survive long enough to get out if you want bragging rights and a fat bank account. Accessibility Modes (Reach Assist, Bump Turns, Seated Mode) All New Survival Mode Virtual Reality Shooter Mercenary and Arcade Modes Global Leaderboards See Your Entire Body in VR with Virtual Self Multiple Player Movement Systems (Sprint, Teleport, Trackpad) Mercenary Store Realistic Weapons Throwable Melee Items and Explosives Upgradable Weapons and Character Stats Intelligent Dinosaurs Incredible Jungle Island Presence Chopper Rides Climbable Ladders Now Featuring our all new Survival Mode. Can you last on six square miles of dino infested island with only your wits to guide you? Loot, craft, and fight for your life as you attempt to uncover just what happened on Island 359. Survival Mode Features: Over six square miles of ferocious dinosaur infested island for you to explore Craft useful items and weapon upgrades from found items throughout the island Forage for food, weapons, scrap metal, duct tape, and whatever you can find to craft into more useful items. Over 30 unique item blueprints to discover via experimentation at Crafting Tables Smart Holographic Watch featuring a map, vital statistics, and your missions/active stories Find forty-five unique Survivor Stories and attempt to uncover just what happened on Island 359 Classic Survival Tropes (Health, Hunger, Stamina, Energy). Fight, Eat, Run, and Sleep Radio Towers (enable them to see a better world map) Cook compies you've hunted for the first time ever! See your entire body in VR! Using our Virtual Self solve, you can now see your body in Island 359. It works with or without the HTC Trackers (and even works with Oculus Touch!). Just step into the boots and follow the easy-to-follow instructions and get calibrated! Kick some Jurassic in Island 359 using your Virtual Self!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/476700/header.jpg?t=1626902447",
    "Price": 14.99,
    "Developers": "CloudGate Studio, Inc.",
    "Publishers": "CloudGate Studio, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_e89b165779010ec5f4d7bd93eb401b79ec46af28.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_c3da5e9c12c53378450099a146e7260587dd39e1.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_09a0299c5b5fb51cf4e3ffefd3fcdfe9880d3de3.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_dced41a474452a88b368f38e4d79bee5fee59794.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_c29305965ffe142f4556220220e9f0a972b4f654.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_66512ad170926cfe23f149c0dd616441a825c09c.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_4702d54ee6b53fff771cc05a1201b95e9515ebd2.1920x1080.jpg?t=1626902447,https://cdn.akamai.steamstatic.com/steam/apps/476700/ss_3003cebf67bf7ff42d143700ee8c85dd9276cb69.1920x1080.jpg?t=1626902447",
    "Slug": "island-359",
    "Meta Title": "Island 359™: Feb 26, 2018, CloudGate Studio, Inc. and Ful...",
    "Meta Description": "Looking for information on Island 359™? Check out the release date (Feb 26, 2018), developer insights from CloudGate Studio, Inc., and a complete game s...",
    "Alt Text Image": "Official header image for Island 359™ game - Steam 476700",
    "Canonical URL": "https://gusku.site/game/island-359",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Island 359\\u2122\", \"description\": \"Looking for information on Island 359\\u2122? Check out the release date (Feb 26, 2018), developer insights from CloudGate Studio, Inc., and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CloudGate Studio, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CloudGate Studio, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/476700/header.jpg?t=1626902447\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}