{
    "AppID": 359140,
    "Name": "Kick Ass Commandos",
    "Release date": "Nov 17, 2016",
    "About the game": "Lock and Load! It's time to KickAss and... Well, it's just time to KickAss. Grab your machinegun, flamethrower, rocket launcher and grenades. Assault the enemy base and free commandos to join your team while you destroy everything you see. Make your way through enemy bunkers to rescue your comrades, and kill everyone else you encounter! KickAss Action Weather Forecast: Bullet Storm with Hail of Grenades Explosions. Big, Big Explosions. Did we mention the Explosions? Grenades, Flamethrowers, Machineguns, Rocket Launchers Colonel Stone is the leader of the KickAss Commandos. He is tough as nails and takes no crap from anyone. If you want to be a KickAss Commando under his command, you personally owe him 100 pairs of boots taken from the bodies of 100 dead enemies! Lex Lightning - Men want to be him, and women want to be with him. The magic of his mustache simply drives the women crazy, and his prowess on the battlefield makes his enemies shrink like your balls in a winter speedo. Sgt. Mohawk is by far the strongest commando. He once pulled a broken down tank to the top of the hill to use it as his personal shoulder-mounted rocket launcher. Corporal Blaze is also known as the “hottest” Commando, but that’s not because of his looks. He’s used his flamethrower to torch enemies across the globe. Corporal T-Bone is so proud of his chiseled physique that he never wears a shirt, not even on missions in the arctic. Lieutenant Ginger is the newest officer to join the Commandos. Rumor has it the only way he made it to the Commandos is because his family is connected to the highest levels of the government. He has a lot to prove if he wants to be accepted by the other Commandos. Delta Ops - If we told you anything about these super secretive, elite forces, we’d have to kill you. So we’ll leave it at that. Nameless Privates - Don’t bother to get to know them, because they probably won’t last long. Great for clearing minefields, going around dangerous corners, or just about any place bullets might fly. General Irons is the unquestioned, totalitarian leader of the elite Tiger Division. During battle, he can usually be found sitting up high in a tower or on a wall directing his legion of soldiers and firing rockets into oncoming foes. He has made a blood oath to one day personally kill Colonel Stone with his bare hands! Major Schwarz was totally incompetent and dropped every weapon he ever held, so they promoted him up the chain of command and gave him a crate of grenades. He’s not accurate, but he’s got butterfingers and grenades in volume. Before joining the most evil enemy organization on the planet, the Commandant was know as the world’s most deadly assassin. General Irons personally recruited him to head up the Division’s secret operations battalion. Red Devils usually work in squads of 5 or more basterds. They all wield powerful shotguns to spray waves of deadly bullets at their foes. Rumor has it the Fire Strykers snort lines of cayenne pepper before charging into battle with flamethrowers, setting fire to everything in their path. Entire cities have been burned to the ground by these faceless, ruthless killers. Killer Snipers are deadly for miles away. The combination of their next-gen, high powered rifles, along with their genetically modified “eagle eyes” makes them one of the world’s most accurate and efficient killers. Use cover such as trees, trucks, or even nameless privates to get close enough to take them out. Troopers are plentiful and disposable. These guys are a dime a dozen. Nobody wants to be killed by the standard enemy lackeys, so if you fall to them in battle make sure you eat one of your own grenades so nobody knows! The Rocket Brothers are the most feared tandem of killers the world has ever seen. These brothers are giants among men and carry rocket launchers that fire 5 rockets at a time. If someone feels the need to have a rocket launcher that big, does it mean they're trying to compensate for something else being too small? Inside every enemy Tank is a tiny little baddie who wasn’t brave enough to fight like a man, and that just won’t do. It’s your job to pry them open like canned beans and put the smack down.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/359140/header.jpg?t=1572354185",
    "Price": 4.99,
    "Developers": "Anarchy Enterprises",
    "Publishers": "Anarchy Enterprises",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_010b14609e52bcd9834144b689e18db6a9e7bb44.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_5696a6bc0a948726dddbedcb93d97a366798cb1f.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_4ee6fb610b4ad9f1965eb96858ac3e2a62ee3e23.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_614ad0f03c3782c33e2155a808aaa68e3669d486.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_b7967a4bca3c8fcf0f496afcc21188e076493d25.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_b5626e9d20add3ef2a0860455d7658b0c9085472.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_a81df2ff5ce0616ca5684a1b1ccc7bc9db4e7bfe.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_6d00a0481fa2904035b232133279d222c4862bc7.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_cbd64785d01b5708e9d681528f7bf8fba5257230.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_6764ccaf40263621b8fcb9cf51171494a2a37d90.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_906eb34578c78eb615f584d91b7b2aef7515c60d.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_4b42669c5e0ae43498e8327dba1fb401a7187ed0.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_378721403f76725e9497e3f6c3ef94513024fad9.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_e9445275722aa2fb4688cd1440c68cc26a2b2f82.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_5bb4366e0ad9c98a244b5757da041a0685394a3c.1920x1080.jpg?t=1572354185,https://cdn.akamai.steamstatic.com/steam/apps/359140/ss_b516148c8a2adba788b1ad1bda2e5ee35f002899.1920x1080.jpg?t=1572354185",
    "Slug": "kick-ass-commandos",
    "Meta Title": "Kick Ass Commandos: Nov 17, 2016, Anarchy Enterprises and...",
    "Meta Description": "Looking for information on Kick Ass Commandos? Check out the release date (Nov 17, 2016), developer insights from Anarchy Enterprises, and a complete ga...",
    "Alt Text Image": "Official header image for Kick Ass Commandos game - Steam 359140",
    "Canonical URL": "https://gusku.site/game/kick-ass-commandos",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kick Ass Commandos\", \"description\": \"Looking for information on Kick Ass Commandos? Check out the release date (Nov 17, 2016), developer insights from Anarchy Enterprises, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 17, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Anarchy Enterprises\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Anarchy Enterprises\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/359140/header.jpg?t=1572354185\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}