{
    "AppID": 1329810,
    "Name": "Nexagon: Deathmatch",
    "Release date": "Jun 9, 2020",
    "About the game": "Fight battles in a televised tournament in a completely destructible environment where losing means death and winning means freedom. Recruit an unstoppable team of cracker-jack combatants with varying fighting skills and weapons and construct an impregnable fortress of defense, laden with deadly traps and devastating weaponry. Traverse an unforgiving arena collecting rewards and infiltrate the enemy’s stronghold with the intention of destroying it... Happening the years following the brutish skirmishes near the Orion Nebula, a strong feeling of general well being seemed to permeate even into the darkest corners of parliament, where a wild and daring decision concerning the treatment of prisoners was made; a chance for freedom that would supply the Galaxy with an extraordinary new form of entertainment ... THE PIT. Delivers the full package of character building, strategic resource management, and a never-before-seen depth of real-time tactics!! Story Since the late 25th century, Earth's population has skyrocketed, and the face of our blue planet has been transformed into a complex grid of concrete, polymers, and steel. Oxygen trickles into the atmosphere by virtue of precious biospheres that dot the skies in a suspended fragile mesh several miles above the surface. Humans toil and commute alongside the masses of alien races that have since inhabited Earth's centers. Together they have concocted the most voluble and copious of environments known to mankind since the Garden of Eden. At the turn of the fourth millennium, pessimistic speculation led philosophers to believe that Earth was bound for troubled times and that great suffering would engulf the helpless inhabitants. As usual, they were wrong. In fact, in the years following the brutish skirmishes near the Orion Nebula, a strong feeling of general well being seemed to permeate even into the darkest corners of parliament, where a wild and daring decision concerning the treatment of prisoners was made; a chance for freedom that would supply the Galaxy with an extraordinary new form of entertainment ... THE PIT. Features Nexagon is real-time 3D tactics with a refreshing twist on action/strategy gaming. Strike out into a completely destructible environment, where every structure, weapon, building or otherwise, can be entirely obliterated. Design and manage your own persistent, editable base of operations, build defensive structures, traps, weapons, and lavish gardens to please the crowd and protect your investment. Purchase units that gain experience and undergo physical changes over time, becoming more powerful from match to match. Battle your way through 3 separate divisions of enemy contenders, increasing your network value to one day compete in the ultimate fight for freedom … the Nexagon. Gain extra credit supporting your network sponsors through the use of billboards and control of advertising locations. Earn sufficient credit to buy some heavy hitters who will send smaller enemy units crashing into buildings or flying right out of The Pit entirely. Take control of stationary weapons and send mortar fire raining down upon your rivals.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1329810/header.jpg?t=1591729864",
    "Price": 6.99,
    "Developers": "Strategy First",
    "Publishers": "Strategy First",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1329810/ss_ad7e2cbff636088b87d2cc095c6b9f808b579b7e.1920x1080.jpg?t=1591729864,https://cdn.akamai.steamstatic.com/steam/apps/1329810/ss_3b36ffc9d554872c40bf6042022ebb72d121c115.1920x1080.jpg?t=1591729864,https://cdn.akamai.steamstatic.com/steam/apps/1329810/ss_41a9e2f407b81c92630db37d2bfdfb7a70482496.1920x1080.jpg?t=1591729864,https://cdn.akamai.steamstatic.com/steam/apps/1329810/ss_9e1bf9695b0d0b6d242510420cd9dc56b6a43d0d.1920x1080.jpg?t=1591729864,https://cdn.akamai.steamstatic.com/steam/apps/1329810/ss_55c88312a13c96ad9443bc22a3b1d6b7c2517ad9.1920x1080.jpg?t=1591729864",
    "Slug": "nexagon-deathmatch",
    "Meta Title": "Nexagon: Deathmatch: Jun 9, 2020, Strategy First and Full...",
    "Meta Description": "Looking for information on Nexagon: Deathmatch? Check out the release date (Jun 9, 2020), developer insights from Strategy First, and a complete game su...",
    "Alt Text Image": "Official header image for Nexagon: Deathmatch game - Steam 1329810",
    "Canonical URL": "https://gusku.site/game/nexagon-deathmatch",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nexagon: Deathmatch\", \"description\": \"Looking for information on Nexagon: Deathmatch? Check out the release date (Jun 9, 2020), developer insights from Strategy First, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Strategy First\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Strategy First\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1329810/header.jpg?t=1591729864\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}