{
    "AppID": 1211050,
    "Name": "Once More",
    "Release date": "Oct 27, 2021",
    "About the game": "There exists a library where books rest without words. Instead, those who read these books see what the authors themselves imagined. It is within this Great Library that the protagonist, Felix, makes a deal with the reaper Shifa: if he can show her the difference between romance in the worlds of fiction she's lived through, and how romance plays out in reality, she'll allow him to add a single book to the Library's collection. With a newfound hope, Felix accepts the deal so that he can add a single book to the library: the diary of his late girlfriend. Will he move on and find a new partner, or will he find the ending he's always wanted for himself? The choice will be yours as you explore the lives of students at Lilia Matsumoto University to satisfy the reaper watching over your life, all so you can find true love! Though, that's only if you make the best choices, and being able to trade your lifespan for all the knowledge in the universe might not be the best idea... In Once More, you'll be able to foster relationships and maybe fall in love (or out of love!) depending on how you interact with the characters. Unfortunately, love takes work, and Felix is going to have to prove his love is true if he wants to reclaim the happiness he once lost. Characters You'll be wearing the shoes of Felix, our unlucky protagonist who has made a deal with death itself. Whether or not he's able to move on and reclaim the happiness he once held is entirely up to you, so please take good care of him. His personality is very subdued, but if you can help him meet the right people he may just find himself again. Shifa is a reaper who works in the Great Library, where she categorizes every text written throughout history. Her tendency to act like the main character of the last book she read comes from her current dilemma of being unable to tell fiction from reality, the former of which is her only understanding of Felix's world. Mima used to be Felix's girlfriend, but a great tragedy separated them. In order to reclaim the future he never got to have with her, Felix has decided to make a deal with the reaper Shifa in order to one day see her again should he be unable to move on. She was the type of girl who was always smiling, and had a big impact on Felix's life. Yuria grew up playing piano and has a tendency to push others away when they try to get close to her. Even though she's not easy to get along with at first, hidden underneath her ice cold exterior is an incredibly caring girl. Though depending on who you ask, she's less of an icy queen and more of an awkward girl. Cami is a film student and is a super upbeat girl who's always willing to help others if she's able to. Her passion for film is what motivates her as she sets out to find her own goals in life, even if hindered by her past ones. She seems to shine when she's in front of the camera, but for some reason she prefers to stay behind it. Nia is the childhood friend of Felix and has a passion for making games. While she tends to make jokes at Felix's expense, she does have a serious side to her that comes out when she's passionate about something, or someone. Her current AI project has her overextended, perhaps you can lend her a hand? Features - High Quality Character Art, Backgrounds, GUI, and CGs - Original OST composed by some of the best contemporary artists - Multiple endings, with impactful choices - Professional Voice Acting - Extra features like a Music Room, CG and Background Viewers, and Scene Jumping - A story-rich experience",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1211050/header.jpg?t=1635353824",
    "Price": 14.99,
    "Developers": "Malheur Games",
    "Publishers": "Malheur Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_6eab85d81f6561030bc7d38a1f02e1ed8ef3ef94.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_c18629154bd5169a9387c04b0fcc515ebe92ce5f.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_5c7fab941576aaebd932f0bef78b1c5b29b8c209.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_b5d57f64f39762d3e56b514d61c2e8e2da14a1e0.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_a7d214385fb5b536247b4ca1a46135f3ef7ebd81.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_7d197064149cca9ecff69d75b1ed91327e54fec9.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_fea1a4dbd7c9c3fb4167ee507d347878452cc3cb.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_61912100a8ae2909afa0dc469173f4761aed376c.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_64377acf9a65c0b7df606e8ede2f40ba5cc34670.1920x1080.jpg?t=1635353824,https://cdn.akamai.steamstatic.com/steam/apps/1211050/ss_a77dee22be6f8f454edf922a97c9fd94f1fa862a.1920x1080.jpg?t=1635353824",
    "Slug": "once-more",
    "Meta Title": "Once More: Oct 27, 2021, Malheur Games and Full Overview",
    "Meta Description": "Looking for information on Once More? Check out the release date (Oct 27, 2021), developer insights from Malheur Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Once More game - Steam 1211050",
    "Canonical URL": "https://gusku.site/game/once-more",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Once More\", \"description\": \"Looking for information on Once More? Check out the release date (Oct 27, 2021), developer insights from Malheur Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Malheur Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Malheur Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1211050/header.jpg?t=1635353824\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}