{
    "AppID": 1029630,
    "Name": "Power & Revolution 2019 Edition",
    "Release date": "Mar 12, 2019",
    "About the game": "The new evolution of Geopolitical Simulator 4, the hyperrealistic simulator of today's world! In Power &amp; Revolution 2019 Edition, play as the Head of State and extend your influence around the globe. By playing as several countries, try to change the destiny of our planet with orchestrated actions. Play as the head of the legal or illegal opposition and seize power! STRATEGY, SIMULATION AND MANAGEMENT Power &amp; Revolution 2019, is a simulation of our current world, recreating its features in-depth and across a number of domains: economic, political, military, social, financial, environmental, energetic, transportation... All countries of the world are represented with their own features. The calculation and scenario engines include more than 100,000 data, 15,000 texts and 10 hours of recorded dialogue. A detailed and animated 3D world map helps to support the players, with all the borders, regions and important and strategic locations of the world The game combines management stages of economics, commerce, wargames, construction, espionage, simulation, and political influence and manipulation. Players can opt for the management of just one country or several simultaneously and design collaborative strategies to change the world's destiny. There are game settings across multiple domains: degree of activity of terrorist organizations, probabilities of natural disasters, reactivity of populations, outbreak of wars. More than twenty contextual scenarios with current events from today's world are integrated. Players can choose to play as a head of state or as a leader of the political opposition. THE PLANET IS BEING THREATENED! The entire world is on the brink of collapse: global warming, social unrest, rising populism, the risk of global conflict, overpopulation, terrorism, cybercrime, new war zones, pollution, shortages! As the leader of up to 30 nations simultaneously, attempt to implement cohesive and effective policies that will collectively guarantee a viable future for the planet. And in another new play mode, 'Chaos 2030', experience the world that could exist in the near future if things break down: amid the global chaos, develop solutions to maintain your power and grow your influence... One specific scenario, 'Global Warming', based on the goals of the IPCC (Intergovernmental Panel on Climate Change), has the objective of limiting global warming to 1.5° Celsius for 2100, and to reduce CO2 emissions by 45% by the year 2030. As the head of the 30 largest CO2 emitters, initiate a global energetic transition by pursuing policies on infrastructures (dismantling of thermal power industries, constructing power plants with renewable energies…), finance (taxes on petroleum products, carbon tax...), the environment, innovations (CO2 capture, development of electric vehicles…)… and all while avoiding energy shortages and maintaining a balanced budget as well as social stability! PLAY AS THE OPPOSITION Choose your political party or illegal organization and try to overthrow the powers that be by force, revolution or democratic election! Control the opposition forces, manage the party budget, talk to the media, take a position on legislative bills, start protest movements, win your independence, infiltrate the spheres of power, raise an army with the help of foreign countries or illegal groups and conquer all the territory or the capital city ! MOST REALISTIC DEPICTION OF CURRENT CONFLICTS Yemen, Syria, Libya, Nigeria, ...The world map includes all the war zones down to the smallest details : occupied territories, cities under seige, localized military units, international military bases, terrorist group manpower and equipment... CITY BATTLE PHASES Detailed maps of cities with main buildings, town squares and main roads and maps specifically for important capitals Lots of components to control : demonstrators, hooligans, armed extremists, rocket launchers, riot police, police vans, snipers, armored tanks... Progress through the scenario by capturing symbolic locations : parliament, television station, bank, headquarters, presidential palace, bunker,... PLAYABLE SCENARIOS About twenty scenarios are included in the game, such as 'Chaos 2030', 'Global Warming', 'Revolutions! ', 'Struggle for Independence', 'World Threats', 'Chaos in Libya', 'Terror in Nigeria', 'The Yemen Conundrum', 'The Somali Menace', 'Reelection Campaign', 'Conditions for Women', 'Long Live Tyranny!' OTHER NEW FEATURES OF THE 2019 EDITION • Geopolitical and economic data updated as of January 1, 2019 • New political characters with 3D animated faces • Implementation of a 'Digital Tax' on the online giants. • Fighting for women's rights with a sufficient and comprehensive budget (combating sexual violence, educational policy on gender equality...) and specific laws (harassment on the street, abolition of male-dominated mentoring, fighting female circumcision…) • Possibility of taking over and governing a conquered country • Legislation on motorway tolls • Play up to 30 nations simultaneously in the same game • The possibility of a tax on cannabis if it is legalized and its economic sector is opened • Carbon tax (on CO2 emissions) • Establishment of the legal age for consuming alcohol • Active defense mode for missile-launcher units and destroyers that can automatically bomb enemy units entering a protected zone (allowing you to establish lines of defense) • Distinguishing missile launcher movements from missile trajectories for all missile launchers • Management of the electric car and self-driving vehicle industry • The possibility of dismantling infrastructures on the map • Closing and re-opening of nuclear power plants • New technology: self-driving cars, hyperloop train (at more than 1000 km/h, constructible on the map), CO2 capture plants, high-density batteries, third generation nuclear power plant (EPR) ; and the addition of progress levels for scientific research. • Simulation of electricity shortages • Quantification of illegal economic sectors (drugs) • Proliferation of riots in the region • New displays, new comparative maps: global warming temperature curves up to the year 2100; social inequality; malnourished populations; terrorist threats; deaths due to drug use; environmental maps including forested areas, deforestation, organically cultivated areas; maps related to women's rights (salary equality, practice of female circumcision). • Game option of whether or not to include actual historic results in calculating election results. • New achievements. • Various gameplay adjustments and bug corrections MULTIPLE INTEGRATED OPTIONS • Game operating as single-player with a multi-country mode allowing play with several countries simultaneously • Game settings: terrorist activities, probabilities of natural disasters, reactivity of the populations, outbreak of war • Player ranking online and in real time • Incorporation of your own photos, logos, names to make the game even more realistic • Interactive tutorial and game help available at all times during the game (in beginner mode) • Learn about geopolitics by playing the QUIZZ mode, including more than 3000 questions • Enjoy different configurations with double screen or 4K screen offering a customized interface • More than 20000 texts and 12 hours of dialogs. 100% in English",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1029630/header.jpg?t=1572373316",
    "Price": 49.99,
    "Developers": "Eversim",
    "Publishers": "Eversim",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_7648bbf55d3c59156df9d941d2288f8d7da7147e.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_69c4464c1178be83f806e206769595825a7997fa.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_7e9b9599ec914e4746d9666a958273ffd2c02521.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_2867c1b3d5f582e2e1f19251945a675efe5bb087.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_b05a87ea43e3c33b5876c3e2c8062da7b49db59e.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_62be96e7a829beb18036fe1a8a8afab86c6db49a.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_05f194017eb1228f312f0ce3797a4bd258f9615a.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_1b39bc0004a9795c65a3aee4985cbad8f397ebc5.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_21da7f190e31fb2b417e20f03e1e03fbf1534e82.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_928a2d00802f72af10f9e355f0e3da8fa81bfc59.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_1a10ab9b4cfa35801f06830c01f2047a316a10de.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_b6402a930480f31a711a16e2e3b487660531b744.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_ccddbe50f9e57e4ca0c9edc7d5e269a2eb60722c.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_2cc77e771e94aa08b678fb8a60799c01ae8dad1c.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_815e9b76d8f18ed7e33cdcc14b5392763d4e4add.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_0ea8499e60f2918274f73b87353d29fcd2b07717.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_e05186ea23036d10437bfa115ca97a23b6bc2570.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_4729496e0e9cd0faf0e3e2c96175fb751d4b21f2.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_16bd7919c29e993bcd5b7245176fba67a25bd02d.1920x1080.jpg?t=1572373316,https://cdn.akamai.steamstatic.com/steam/apps/1029630/ss_ca761bef29c88a822cbb87eef7559689a51d18ca.1920x1080.jpg?t=1572373316",
    "Slug": "power-revolution-2019-edition",
    "Meta Title": "Power & Revolution 2019 Edition: Mar 12, 2019, Eversim an...",
    "Meta Description": "Looking for information on Power & Revolution 2019 Edition? Check out the release date (Mar 12, 2019), developer insights from Eversim, and a complete g...",
    "Alt Text Image": "Official header image for Power & Revolution 2019 Edition game - Steam 1029630",
    "Canonical URL": "https://gusku.site/game/power-revolution-2019-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Power & Revolution 2019 Edition\", \"description\": \"Looking for information on Power & Revolution 2019 Edition? Check out the release date (Mar 12, 2019), developer insights from Eversim, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eversim\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eversim\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1029630/header.jpg?t=1572373316\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}