{
    "AppID": 115320,
    "Name": "Prototype 2",
    "Release date": "Jul 24, 2012",
    "About the game": "Welcome to New York Zero. The sequel to Radical Entertainment’s best-selling open-world action game of 2009, Prototype® 2 takes the unsurpassed carnage of the original Prototype and continues the experience of becoming the ultimate shape-shifting weapon. You are Sgt James Heller, husband to a deceased wife and child and a soldier left simply to die. As the game’s all-new infected protagonist, players will experience Sgt James Heller cutting a bloody swathe through the wastelands of post-viral New York Zero. Equipped with unparalleled new shapeshifting powers,players will gradually build a vast genetic arsenal of deadly new biological weapons and abilities as they hunt, kill and consume their way toward the ultimate goal – to kill…Alex…Mercer! Are you ready to murder your maker? Key Features: The Power of Tendrils: Prepare to unleash the ultimate form of shape-shifting devastation. Sgt James Heller’s incredible new Tendril power lets you lift and tear apart cars and military vehicles, ensnare powerful infected beasts and even rip large groups of enemies to shreds. Get ready to unleash hell! Customize Your Killer: Prototype 2 delivers the raw power of character customization back into your hands, allowing players to creatively mix-n-match a devastating range of new Mutation perks into their ultimate Prototype. Faster and bigger locomotion abilities, sharper claws or even enhanced disguise abilities – the choice is yours! Hunt – Kill – Become: Imagine having the power to track down any enemy by unleashing a powerful sonar-pulse from your body! Sgt James Heller brings an all-new dimension to the Prototype experience by letting you Hunt, Kill and Become anyone standing in your way. Disguise yourself as a soldier, scientist or anyone at all whilst absorbing their memories and acquiring new abilities. It doesn’t get any better than this! Bring Down the Devil: Gamers will experience the epic story of Sgt James Heller attempting to take down the devil himself… Alex Mercer. Unraveled against the explosive backdrop of New York Zero and it’s vicious factions warring for control over the infection, Prototype 2 sets the stage for the ultimate showdown “event” videogame of 2012. Size Does Matter: Utilizing the unparalleled technology of Radical’s proprietary ‘Titanium 2.0’ engine, Prototype 2 will redefine gamer’s expectations of over-the-top open world action. Witness building-sized Infected behemoths bullrushing entire city streets, whilst gliding and parkouring across swarms of highly trained Blackwatch soldiers. Prototype 2 = Bigger, Badder, Better! New York Zero: An All New Open-World Hunting Ground! The New York that humanity has come to know and love over the years no longer exists…it is now New York Zero, or more simply, NYZ. PROTOTYPE 2’s NYZ open-world sandbox is broken up into three completely distinct zones. From the heavily militarized “Green Zone”, to the overcrowded refugee shanty town camps of the quarantined “Yellow Zone”, all the way to the war-ravaged nightmare known as the “Red Zone” – this is a city unlike anything gamer’s have experienced before. The home of Alex Mercer, the Red Zone portrays a nightmarish vision where the Blacklight virus has completely overrun the city’s shattered skyscrapers and population, with infection and the risk of death at every corner.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/115320/header.jpg?t=1655761001",
    "Price": 39.99,
    "Developers": "Radical Entertainment",
    "Publishers": "Activision",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_9f302432e700dcbef4c4826104c04f28cc5b165e.1920x1080.jpg?t=1655761001,https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_4ce08b05421fbacaa129a869ed518aeafafa5863.1920x1080.jpg?t=1655761001,https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_42451e4ba490394f581d5f522853cd841d7a90d5.1920x1080.jpg?t=1655761001,https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_7cfd7473b9167071ef2fe07356c0bc55ef59fe0a.1920x1080.jpg?t=1655761001,https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_5bd27877ffe765470628908533c05b7342b6d009.1920x1080.jpg?t=1655761001,https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_a9031e4a6d26f8418e5fe7e457f9cacf7ba75892.1920x1080.jpg?t=1655761001,https://cdn.akamai.steamstatic.com/steam/apps/115320/ss_35a04ee6917f9afe48a1fbc8d9846d1bbf280295.1920x1080.jpg?t=1655761001",
    "Slug": "prototype-2",
    "Meta Title": "Prototype 2: Jul 24, 2012, Radical Entertainment and Full...",
    "Meta Description": "Looking for information on Prototype 2? Check out the release date (Jul 24, 2012), developer insights from Radical Entertainment, and a complete game su...",
    "Alt Text Image": "Official header image for Prototype 2 game - Steam 115320",
    "Canonical URL": "https://gusku.site/game/prototype-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Prototype 2\", \"description\": \"Looking for information on Prototype 2? Check out the release date (Jul 24, 2012), developer insights from Radical Entertainment, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2012\", \"author\": {\"@type\": \"Organization\", \"name\": \"Radical Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Activision\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/115320/header.jpg?t=1655761001\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}