{
    "AppID": 1405260,
    "Name": "Rebellion",
    "Release date": "Feb 4, 2022",
    "About the game": "Rebellion is a souls like and roguelite action game about your revenge saga. Unfairly imprisoned, you seek to cross swords with the King again, for the last time! Or at least that's what you thought... Escape the jail, explore the castle and it's different areas, find and recruit allies, choose to fight or sneak from enemies. These castle corridors will always present unprecedented challenges Imprisoned Forever? Waking up without remembering where you are, you find yourself inside a small stone room, which suddenly opens, and then realizes that you are in a prison. The King. You must kill the King. Every decision may be cost your life With stealth mechanics, you may choose to sneak from enemies and pick your fights. A journey of revenge and betrayal Seeking for answers and fighting for your freedom, you will face several enemies with the same combat characteristics as you have. Allies may be your greatest hope in an bloody environment of suspense and terror. Discover that there is a truth behind the reign origin's, and therefore nothing could stop your rebellion for the freedom! Features: Scenarios with procedurally generated layouts, with alternative progressions to story. The best Roguelike style. Fight alone or in groups, with recruited allies, creating yout particular squad, managing their equipment and fight behavior. Choose your fight-style between different attack moves, dodge, parry, kicks to unblock your enemies defense. Sneak away or behind your enemies, picking your fights and backstabing them when the opportunity comes! Handcrafted AI, enemies with the same movement capabilities as the player, plotting personalized strategies. Fighting an enemy alone is easy, fighting two is difficult, fighting 3 is a certain death. Alternative paths: some will only appear based on the level of experience of the player, others will be dependent of decisions that the player makes during his journey. Improve yours skill fights and your level, defeating enemies, getting new weapons and learn how to die less and explore more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1405260/header.jpg?t=1644855416",
    "Price": 4.99,
    "Developers": "TGM",
    "Publishers": "TGM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1405260/ss_5f8908cf35b3a9bacf46508bc71f1db7f5182cc4.1920x1080.jpg?t=1644855416,https://cdn.akamai.steamstatic.com/steam/apps/1405260/ss_94837189e656cf0f58f3c3c287ecbcc765685f7a.1920x1080.jpg?t=1644855416,https://cdn.akamai.steamstatic.com/steam/apps/1405260/ss_db7bc4f61606de65d8186f2da7d821e1de91d786.1920x1080.jpg?t=1644855416,https://cdn.akamai.steamstatic.com/steam/apps/1405260/ss_9a75599e31229d1cbe1a975f579e946a5710bf1f.1920x1080.jpg?t=1644855416,https://cdn.akamai.steamstatic.com/steam/apps/1405260/ss_a743abb700a0ccc623899b77499338d034e6967e.1920x1080.jpg?t=1644855416,https://cdn.akamai.steamstatic.com/steam/apps/1405260/ss_5e9fc80c8301b7761bc9206783728a90269465b6.1920x1080.jpg?t=1644855416",
    "Slug": "rebellion",
    "Meta Title": "Rebellion: Feb 4, 2022, TGM and Full Overview",
    "Meta Description": "Looking for information on Rebellion? Check out the release date (Feb 4, 2022), developer insights from TGM, and a complete game summary.",
    "Alt Text Image": "Official header image for Rebellion game - Steam 1405260",
    "Canonical URL": "https://gusku.site/game/rebellion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rebellion\", \"description\": \"Looking for information on Rebellion? Check out the release date (Feb 4, 2022), developer insights from TGM, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"TGM\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"TGM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1405260/header.jpg?t=1644855416\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}