{
    "AppID": 745810,
    "Name": "SAS",
    "Release date": "Jun 6, 2018",
    "About the game": "SAS is an Open World Multiplayer PVP and CO-OP Survival Game. Set in a vast environment that features Building, Crafting, Taming, Riding, Flying and Exploring Wildlife, Dinos, and Dragons as well as Horrific Creatures and Instances with the ability to Morph into Spirit Animals. SURVIVE AND FIGHT FOR YOUR TRIBE • Start your journey by freeing your tribe mates who have been captured by the Evil Lord and his evil minions and are held captive in various instances around the map. • Survive the harsh elements and get the necessary tools, weapons, and structures you may need to defeat the different tier bosses to save your tribe. • Cleanse the world of the evil that is a threat to your tribe and restore peace &amp; harmony for all while gaining the Spirit Animal powers along the way to prevent evil to regain control. SPIRIT ANIMALS • There is a large variety of Spirit Animals for you to transform into. From a fast rabbit to a dangerous bear. All of the Spirit Animals have their own abilities! • You unlock all the 11 Spirit Animals by cleansing the world of evil that you will find in various instances throughout the world and defeating the Evil Lord’s Elite Monsters. • Will you roam the land or the mighty skies with your Spirit Animal of your personal choice? VARIETY OF CREATURES, TAMING &amp; MATING • There are over 100 different creatures in the world of SAS. From elephants to dinosaurs &amp; dragons. As you try to fulfill your mission to save your goal you also need to deal with these creatures. • You can tame the creatures as well. Taming is a dangerous task so be careful not to die along the way. You can ride your tamed creatures. • Not only can you tame the creatures but if you have a male &amp; female creature you can also have them mate. RIDEABLE MOUNTS • You can defeat mini-bosses to obtain one of the two dragon mounts! • There are other animals like horses, birds, turtles and many more that you can also ride on land, air and in the sea! • Are animals not your favorite choice of transportation? Then perhaps going around on a boat or flying carpet is more for you. EXTENSIVE CHARACTER CREATION &amp; SOCIAL ANIMATIONS • When creating your own unique character you can get crazy. From the tiniest person to the world’s tallest person. Have fun with the creation! • Once you created your character you can craft clothes from 6 different tires. From basic protection to the epic warrior outfits. • Once you are in the world of SAS you can then use over 45 Social Animations. Want to flex your muscles or do a rain dance? You can! OVER 300 CRAFTABLE ITEMS • There are over 300 craftable items in the game. Make epic bases and decorate them with all that you can imagine. • 4 tiers of building material are currently in the game. From basic sticks and wood to advanced stone and concrete. • And if there are other tribes starting trouble you can use siege weapons to defend yourself. The Story of Spirit Animal Survival At the beginning of existence, our Creator made it such that Humans and Animals had a mutual understanding of one another allowing them to communicate together which in turn forged a bond of peace and harmony. It was not until Humans became overrun with greed and an insatiable need for power that the Humans began the gratuitous killing of animals beyond what they needed for food and survival. Angered by the Humans actions, the Creator separated the two populations, assigning them their own respective villages and different languages. As a punishment for their ignorance, the Humans and Animals were then completely segregated and the ability to communicate was lost. Although the balance between the Humans and Animals was in peril, the Creator passed a piece of his primal essence to a few select kind and honest Humans which allowed them to still understand the animals and to yield the power of the 11 Spirit Animals by taking on their animal forms. As the Creator was bestowing the gift of the Spirit Animal to the few select Humans, elsewhere dark and malevolent energy manifested. The Dark Lord saw this schism between Animal and Man as an opportunity to overrule the World with His darkness and evil. To accomplish his evil goals, the Dark Lord gathered the most corrupt of the Humans and promised them the power of their own to rule the World if they were to supply Him with both Animal and Human sacrifices to feed this insatiable hunger for fear and pain of all living creatures. Now, the time has come for those few gifted Humans who bear the Spirit Animal to defeat the evil forces that prevail and bring light to the darkness once and for all. Your quest begins with your Tribe being attacked by the forces of evil, when many parts of the World are set afire, people are being captured and offered for sacrifice, causing much pain and suffering. As the sole survivor, unsure of why you were spared during the torment and massacre, your mission is to find your people, free them, and fortify your Tribe’s village. The only way to defeat the Dark Lord is to summon the collective power of the 11 Spirit Animals, using their gifts and abilities to kill the Soldiers of Darkness and their armies of destruction.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/745810/header.jpg?t=1595795623",
    "Price": 14.99,
    "Developers": "True Illusion Software",
    "Publishers": "True Illusion Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_2beb437fc57c2a30de767e0ec332de2fe6ee8e2c.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_d2b8529628790b1c59253cb237bc5b1584d5ba78.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_ac4cafb2178436eeceac2ce532bc48581e085bc5.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_73e614cfdf614f9b1070a78d155154ecfc56978e.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_ffc1fa34d086d216d74f336cad2faffc86af4dc0.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_ddb3907e6767b702b86d9995eaa6840a7256c0f3.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_49897d0be74797c6bd74e65e2054c44f16664407.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_be38c58cbfe41e8eff13d1fe52a66b484981b569.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_f9425e6713e0749a52b9cfd4d881124415b5c2f1.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_9a1bedec38b3389ffd29a3fd0d689db6ba59391d.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_bc44c8d94960a411ca3c20b86ad71dcc980dfb97.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_609363fd5d7b5efe6dc88f97bf8e663e99fe7d6c.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_222154e213d59c2fb29db5876779c64c43bfd02c.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_c40313de65644512c83d37f3f62481dd77210d41.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_3c150baff5141e72ccd4f1e1a9f3a7a41d035f1e.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_4dde4fa1ac2f3482e6f567ee25b166b528268cef.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_f6ef6376767a78b732b7e844894d2c8577639879.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_93ef510275e8a5c13bd293c0cfcd0f86ccb4667c.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_ec2055407f56dc901c238e72cf8118360c064805.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_9ab9d08f5523aa65039efaca1b13683292d17bb0.1920x1080.jpg?t=1595795623,https://cdn.akamai.steamstatic.com/steam/apps/745810/ss_8a8fb672ade9c70dacf52dbebda3a9c2742ecf6a.1920x1080.jpg?t=1595795623",
    "Slug": "sas",
    "Meta Title": "SAS: Jun 6, 2018, True Illusion Software and Full Overview",
    "Meta Description": "Looking for information on SAS? Check out the release date (Jun 6, 2018), developer insights from True Illusion Software, and a complete game summary.",
    "Alt Text Image": "Official header image for SAS game - Steam 745810",
    "Canonical URL": "https://gusku.site/game/sas",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SAS\", \"description\": \"Looking for information on SAS? Check out the release date (Jun 6, 2018), developer insights from True Illusion Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"True Illusion Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"True Illusion Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/745810/header.jpg?t=1595795623\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}