{
    "AppID": 818380,
    "Name": "Seasonal Soccer",
    "Release date": "Mar 20, 2018",
    "About the game": "Xmas special: Winter Wonderland -level added with 1 new achievement! is pixel stylished game, which respects the traditions of good old style soccer-games! The object of the game is to score by moving the ball beyond the goal line into the opposing goal and defend own goal. This game may cause happy moments, frustration, nostalgic memories and more. Choose your team from 8 different choices and play on single player mode against CPU... and beat the opponent AI team! good old times soccer games with easy controls and amazing pixel graphics? Have you ever wanted to dive into those memories again and enjoy 100% pixel style and simple game play? With no need to follow the complicate plot? Looking for a time to relax and let your mind wander? Or perhaps a game with simple game controls and amazing pixel graphics? Or a game that includes speed and requires accuracy? Well, believed it or not, this game have it all. Seek no more, you have found what you have searched. idea for Seasonal Soccer has started and inspired by the passion of football in a town of Myllykoski. That village, located in the final frontier Finland, surrounded by a thick forests and fertile oat fields, has a truly passion for football. Together with legendary worldwide paper industry pioneer Myllykoski Paper decision to build a a football pitch with spectator stands in 1947 and continuous support, football club Myllykosken Pallo −47 (or MYPA, formerly MyPa) did many miracles in football history. In addition to regular football, the village was also in the fashion of playing legendary Amiga soccer games. Inspired by this spectacular passion to the football, Seasonal Soccer is here for you to play. And we also hope that we can 'ignite the candle' and inspire people all around the world to start a career in football. play against CPU by selecting one of these teams: Russia, Belgium, France, England, Finland, Switzerland, Spain or Honduras. If you win (or lose..), you can choose new opponent. On this Early Access version you can't win World Cup tournament (yet), but you can play 2 levels and win the match against CPU and have fun! You can also let AI play your team players and only 'manager' a team, but in hard situations you will need to take control. Of course you can also play all time with 100% control of your players. is a pixel-style retro AAA-game (graphically). The game does not take the whole screen, so it is easy to play also at the work place, school etc (of course at a break time). Screen resolution is excellent 900x640 size and you can also choose Full Screen! (New!). Full Screen mode is still experimental and while playing in full screen mode, it is possible that you cant see incredible graphics frames which appear when you or enemy made a goal. Improved Full Screen mode A new Windows runtime using DirectX 11 Improved performances with new engine optimizations Faster loading times Hunt Achievements (currently 1) You can play against CPU (We promise that it is challenging.) You can choose from 8 different teams (Russian, Belgium, France, England, Finland, Switzerland, Spain or Honduras.) You can change your team and opponent from the options menu. Each team has its strengths and weaknesses How long will you play, it is up to you. We believe that this game can entertain you as many hours as you wan't, because if your moves are different so will be every match. So you can spend minutes or even hours by playing this game without getting bored. How much gameplay will this game give you, it is up to you. This game do include music and you can also listen applauses and cheers yells from the audience while playing against opponent team. On this stage on Early Access, you can play 2 football fields/levels, but as it is said every match can be different.. There is no referee in the football field (yet), so this game might not be totally realistic in every aspect. football player have been used to test play &amp; consult to plan opponent team strategies and movements, strengths and weaknesses, in order to offer players the most genuine experience. Available for PC &amp; Mac 'Seasonal Soccer is a small top down soccer game in the genre of snes soccer games. there is no online multiplayer or local, just singleplayer. but for a moment of your time its a moment of fun' -Press Start To Begin Curator",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/818380/header.jpg?t=1609119713",
    "Price": 1.14,
    "Developers": "F-Games",
    "Publishers": "JTS Development",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_80b6c8dbcb5018be127126e17239b05129606c0c.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_b9e578a4545a705fa9459d96e4734c7a64ff4d82.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_726f9bc50e6c16a02b61aff7828575301c42eba8.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_932f5dc25ceb69465716f55706aec88ed3d6734a.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_bfad83a63db7fe7b2f559aa302f5a46383656ff2.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_2034225072400f7d5ce23d2893691445e495d53e.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_5c5bc4662ed4b58fc526b9c1ecfbc7f3a812ba31.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_83ac25ce6cd09e5f62d01960a70a62279c49adb5.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_f366a4bae6efa181b3c9107123ff8f4cfc531f9c.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_4da2087640c60ffec64c8a115b3f98d7d38b3835.1920x1080.jpg?t=1609119713,https://cdn.akamai.steamstatic.com/steam/apps/818380/ss_de2f1bdf0d0718fa9c9c6c24a1c519e96170c32f.1920x1080.jpg?t=1609119713",
    "Slug": "seasonal-soccer",
    "Meta Title": "Seasonal Soccer: Mar 20, 2018, F-Games and Full Overview",
    "Meta Description": "Looking for information on Seasonal Soccer? Check out the release date (Mar 20, 2018), developer insights from F-Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Seasonal Soccer game - Steam 818380",
    "Canonical URL": "https://gusku.site/game/seasonal-soccer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Seasonal Soccer\", \"description\": \"Looking for information on Seasonal Soccer? Check out the release date (Mar 20, 2018), developer insights from F-Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"F-Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JTS Development\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/818380/header.jpg?t=1609119713\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.14, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}