{
    "AppID": 1300550,
    "Name": "Song of sheep gathering in Philia",
    "Release date": "May 13, 2020",
    "About the game": "Fixed text box design to improve character recognition rate in OCR translation. ******* 'It's the worst, I can't do anything about it ...' Masturbation Dependence ' A modern, downtown area. The main character, Miyasumi Mashiro [Miyazumi Mashiro] is 21 years old who suffers from masturbation dependence. At the back alley where you can get lost in your thoughts I'm in the middle of rubbing something about the concept bar 'Philia', which has a special tendency. Mashiro who collapses on the spot due to the surprise of the turmoil and the daily stress. Mashiro, who was directly supported by 'Philia', finally hesitated while being improved. They will go to 'Philia' as people who have a confession, a propensity and a dependency. Mashiro, who became close to one of the three guests he met, You have been proposed a strange relationship called 'Friendship to eliminate habits' ...? [Personal introduction] 《Main character: Recipient》 Miyasumi Mashiro (Miyazumi Mashiro) 21 years old Occupation: Freeter. I have no interest in anything but my own pleasure, and I can't build a close relationship with others. However, I like talking to others and I am friendly. In my heart, I want to have close friends. Masturbation dependence (sex dependence). Compulsive to masturbate (I can't help but not to be), impulsive (I want to get rid of immediately), Greedy (relentless), repetitive (repeating). [Cheat character 1] Momo Hanada (Momo Hanada) 26 years old Occupation: Drug seller. There is no suspicious atmosphere, and he is a friendly older brother type. Carefully grilled and very familiar with plants. Propensity: Nosophilia. The sick or sick body (even mentally) becomes the target of sexual arousal, Rather than a devoted desire to care, he is excited about the affected person and the diseased state itself. [Cheat character 2] 32-year-old Toru Ukino (Hiwano Toru) Occupation: Freelance writer. With a calm demeanor, there is no way to grab it. Feelings of likes and dislikes are thin, I don't even talk about myself. Since I am only interested in the hips, I find it difficult to have a physical relationship with another person. Propensity: Pigofilia (buttock sex). There is a greater inclination toward the buttocks than the so-called 'butt lover', and the target of sexual preference is 'buttocks only'. [Cheat character 3] Yellow coral (Kitsurubami Coral) 23 years old Occupation: Manager of a video rental shop. Very fine splatter, moving things, Because AV is classified, Mania often visits. His expression changed, and there was no grip. When he gets angry, he looks scared like a Yankee, and when he laughs, he looks innocent like a child. Propensity: Hygrophilia. Excite yourself against the secretory fluid itself, such as sweat, menstrual blood, saliva, semen, and tears. [Sub character] Shinonome Aoi 36 years old Occupation: Owner of 'Filia' It looks much younger than age and is often mistaken for an employee. Mild and gentle. Always smiling and honorific to everyone. To get excited about the singing voice, For the BGM of the store, a CD without songs selected by himself is played. Propensity: Acousticicophilia (acoustic love). Excitement and lust with sounds such as music, songs, voices, and breaths. The player becomes the main character and chooses his own destiny. Bring happiness to his beloved and many others. Visual novel. ****** This work includes elements of sexual activity and disagreeable sex. Contains nudity or sexual content. There are depictions of drugs and alcohol. Contains explicit or fresh adult sexual content.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1300550/header.jpg?t=1589371427",
    "Price": 9.99,
    "Developers": "MagicHouse",
    "Publishers": "MagicHouse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_1da0861e17cec9c412ea69c845833766e76098f6.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_1e4a4969d5c8f7783acd9a387d6805a90b76c1ee.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_9758699eb3d1a7820b6695890e7150064f9f2c9b.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_d0ec5b40f4d80ec5103e897cbbc63269a2a75e68.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_adad930ad7ff66a6c8cfb5399d3a9904637a0e9d.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_5e0c38dec4bf47f73daa6df428c77903df0b0e28.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_c24eb17562ca175d91bd5b14cf239fe271b272a6.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_c01bc51b9d790fc9db4091da03e484cb95ab00e4.1920x1080.jpg?t=1589371427,https://cdn.akamai.steamstatic.com/steam/apps/1300550/ss_d17b37401ddd36e4eb4c64e81164719a0472620c.1920x1080.jpg?t=1589371427",
    "Slug": "song-of-sheep-gathering-in-philia",
    "Meta Title": "Song of sheep gathering in Philia: May 13, 2020, MagicHou...",
    "Meta Description": "Looking for information on Song of sheep gathering in Philia? Check out the release date (May 13, 2020), developer insights from MagicHouse, and a compl...",
    "Alt Text Image": "Official header image for Song of sheep gathering in Philia game - Steam 1300550",
    "Canonical URL": "https://gusku.site/game/song-of-sheep-gathering-in-philia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Song of sheep gathering in Philia\", \"description\": \"Looking for information on Song of sheep gathering in Philia? Check out the release date (May 13, 2020), developer insights from MagicHouse, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"MagicHouse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MagicHouse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1300550/header.jpg?t=1589371427\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}