{
    "AppID": 487250,
    "Name": "Spaera",
    "Release date": "Sep 13, 2016",
    "About the game": "SPAERA is a head-to-head puzzle fighting game, using an unique match-3 cascading mechanic as its core system. The world of SPAERA is heavily inspired by characters, gameplay and themes from games that we loved to play as we were growing up. We've created a roster of eight original characters that you can select, each with his or her own individual story. Players can battle the computer in the game's campaign mode, or against live opponents in local and online matchmaking. HOW TO PLAY Players choose a unique character as their avatar, each with four of their own unique spells that can vary from Attack types to Protection types. Once the game begins, Players receive a continuous stream of puzzle pieces that are arranged in different color and shape configurations. Players are then tasked to match 3 or more of the same color blocks in order to trigger a clearing response. When clearing is initiated, any color on the active puzzle piece that is not the same colors as the cleared ones will cascade downwards on the board, enabling setups for complex combos and chains. There is also a power meter that will increase as you clear blocks or obtain and clear special block types that enable the player to issue magic spells to either support their own board or attack their opponent. The first person to force their opponent to have nowhere else to place their puzzle piece wins the match. SPAERA FEATURES Our lead artist and his team are amazing. Seriously, check out the screenshots for yourselves. All graphics and animations were hand drawn! We like to think of SPAERA as something that everyone can enjoy; it's pretty easy to pick up, but you can add a lot of depth to your strategy. In many ways, SPAERA represents a mashup of a lot of the games that we love: games that you can just pick up and play by yourself or with friends without too much fuss. It's fun, quick, and easy, just like a favorite snack. Head-To-Head multiplayer with server supported Matchmaking, Ranks, and Ladders enables endless fun and depth. We are trying to build a community of people that can be positive and enthusiastic about playing with us and each other, and hopefully help us to continue develop more games that everyone can enjoy. WHO ARE WE? Blazing Orb is founded by a pair of coders that have always been gamers at heart with huge love for RPGs, platformers, side-scrollers, fighting games, and puzzle-strategy games. SPAERA is our attempt to pay homage to all the influences and good times that we've had growing up playing these games, and hopefully be able to pay forward all the fun to others.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/487250/header.jpg?t=1519077832",
    "Price": 9.99,
    "Developers": "Blazing Orb LLC",
    "Publishers": "Blazing Orb LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/487250/ss_f6ea88ce4659bb2a177e5e6ed3ebb47dca3dce13.1920x1080.jpg?t=1519077832,https://cdn.akamai.steamstatic.com/steam/apps/487250/ss_37287c984e984c807415112e5120629f86c1cb55.1920x1080.jpg?t=1519077832,https://cdn.akamai.steamstatic.com/steam/apps/487250/ss_a61b0690ec744ac8f634b5b72b99778a43587325.1920x1080.jpg?t=1519077832,https://cdn.akamai.steamstatic.com/steam/apps/487250/ss_0587dfa093c62e537a875c60c7d7321bf7b74f5d.1920x1080.jpg?t=1519077832,https://cdn.akamai.steamstatic.com/steam/apps/487250/ss_bb5f65daf81d46791b979be2acea3d1ac3bff70b.1920x1080.jpg?t=1519077832,https://cdn.akamai.steamstatic.com/steam/apps/487250/ss_63ef6c004834cfa378b22fd5d9cc8475d6826ed9.1920x1080.jpg?t=1519077832",
    "Slug": "spaera",
    "Meta Title": "Spaera: Sep 13, 2016, Blazing Orb LLC and Full Overview",
    "Meta Description": "Looking for information on Spaera? Check out the release date (Sep 13, 2016), developer insights from Blazing Orb LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Spaera game - Steam 487250",
    "Canonical URL": "https://gusku.site/game/spaera",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spaera\", \"description\": \"Looking for information on Spaera? Check out the release date (Sep 13, 2016), developer insights from Blazing Orb LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 13, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blazing Orb LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blazing Orb LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/487250/header.jpg?t=1519077832\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}