{
    "AppID": 1567720,
    "Name": "Streamer Dancefloor",
    "Release date": "Apr 22, 2021",
    "About the game": "Special Note: Several people have been able to run the app with an integrated graphics card, however to run smoothly you MUST lower your resolution to 1280x720 with the lowest graphics quality. In addition you can also turn off the 'Enable character VFX' checkbox, which will turn off all particle effects other than the donation coin fountain (which is significantly reduced to save your CPU) RESOURCES: If you're looking for instructions for how to use the app, you can press F1 at any time to get a full list of instructions, or visit the youtube channel for tutorials on all the Streamer Dancefloor features -yqsFRgZOg-7tZKU2t If you'd like to try some of the ready to use venue backgrounds taken from popular Toronto venues pre-covid click here: -images-streamer-dancefloor/ OBS SETTINGS NOTE: The preferred settings I use is Window Capture with Capture Method set to Windows Graphics Capture, probably want to turn off capture cursor as well. DESCRIPTION Streamer Dancefloor lets you create a custom virtual dancefloor for your chatroom on Twitch, Facebook or YouTube . Featuring dozens of dances and avatars, the chat can find many ways to engage with the music and environment. The host can use the camera controls setup multiple cameras at different angles which can then trigger based on scene changes within OBS (requires the OBS websocket plugin). Once setup, you can either load in video loops or backgrounds inside the Streamer Dancefloor app, or you can use the Chroma Key filter within OBS, and use the various features in OBS to layer and control where your dancefloor appears within your stream. Includes a top 10 widget to show which of your dancers and drinkers has been having the most fun! Other ways to customize your dancefloor include: - Use Twitch Point Rewards to trigger dances, skins and emotes - Monetize your dance by making certain dances or skins triggered only with bit or dollar donations (USD only for now) - Enable and disable different dances and skins to make your dancefloor more your style - Change the arrangement of the dance positions and number of dance positions (up to 100) to fit your exact virtual room - Change the Exit/Entrance points to set where the chat enters or exits the room",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1567720/header.jpg?t=1624841276",
    "Price": 12.99,
    "Developers": "StreamerTech",
    "Publishers": "StreamerTech",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_8ccf89abea45e940b02a29c66a6d91de7c3eb9d1.1920x1080.jpg?t=1624841276,https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_f92ed857c1aca9021408f36dcbbb0545359cf577.1920x1080.jpg?t=1624841276,https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_6c949580973e0526050c86855dd94b3dea3c8174.1920x1080.jpg?t=1624841276,https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_5aaa3d62974572df0b82b7660c42e118526c4c0b.1920x1080.jpg?t=1624841276,https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_13c3ee801fff4e34128c04f10ca7c5d63abe808e.1920x1080.jpg?t=1624841276,https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_2df2961bb4f4157b6fb47f18085f5397edb0ee6d.1920x1080.jpg?t=1624841276,https://cdn.akamai.steamstatic.com/steam/apps/1567720/ss_6f62e04af76d3dcdd2189c1ec071d367ba437b1b.1920x1080.jpg?t=1624841276",
    "Slug": "streamer-dancefloor",
    "Meta Title": "Streamer Dancefloor: Apr 22, 2021, StreamerTech and Full ...",
    "Meta Description": "Looking for information on Streamer Dancefloor? Check out the release date (Apr 22, 2021), developer insights from StreamerTech, and a complete game sum...",
    "Alt Text Image": "Official header image for Streamer Dancefloor game - Steam 1567720",
    "Canonical URL": "https://gusku.site/game/streamer-dancefloor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Streamer Dancefloor\", \"description\": \"Looking for information on Streamer Dancefloor? Check out the release date (Apr 22, 2021), developer insights from StreamerTech, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"StreamerTech\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"StreamerTech\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1567720/header.jpg?t=1624841276\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}