{
    "AppID": 1840130,
    "Name": "Sword of Atlas",
    "Release date": "Apr 27, 2022",
    "About the game": "Sword of Atlas combines fast-paced, real-time strategy with grid-based combat in this inventive addition to the tactical roleplaying game genre. Taking inspiration from genre giants such as Final Fantasy and Fire Emblem, Sword of Atlas puts you in charge of an eccentric cast of characters as they struggle against the might of an evil empire and dark magics. The RPG experience has been truncated, allowing you to enjoy the story, growth, and skill progression you expect from any RPG in a shorter timeline. The fate of your party is in your hands, as a frenetic, tactical combat system intersects with a character-driven story in this one-of-a-kind tactical roleplaying game. Story-Driven Gameplay Having received a mysterious, talking sword, the protagonist is thrust straight into a world of action and consequence. Build your party as you travel through the floating isles of Atlas, picking up a steadfast warrior, esoteric mage, anxious archer, and gregarious bard, each with their own unique set of skills. As you travel, learn more about each character and their stories, while also unraveling the mysteries of this shattered world and the sword you carry. Classic RPG Mechanics Sword of Atlas features iconic RPG mechanics including an Active Time Battle system, where each party member has their own real-time action meter. Master the rhythm of your party to defeat the foes along your path. Traverse the world and strategize combat utilizing a grid-based environment . Find cover-tiles, utilize Fountains of Healing, avoid traps, and use the environment to your advantage against hordes of enemies! Strategic Combat Each companion brings with them a suite of unique skills. Employ a bard's healing melody, a mage's dark invocations or a hunter's piercing arrows. Unlock new abilities as you progress, proving to your enemies that you are not to be trifled with. 8 Unique Levels Explore ruined villages, snowy battlefields, flying airships, and more across eight unique levels, each tied to a companion's story. Learn more about your story, while mastering each zone's distinct battlefield. About FAFO Studio FAFO Studio is made up of University of Utah EAE graduate students of Game Design. Sword of Atlas is a culmination of two semesters of work brought together into a two hour playable experience. We hope that you'll enjoy this project as much as we've enjoyed its development! We would additionally like to thank students from Berklee College of Music for their incredible contributions to this project.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1840130/header.jpg?t=1651167880",
    "Price": 0.0,
    "Developers": "FAFO Studio",
    "Publishers": "FAFO Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1840130/ss_751734641b2b2d3c964a9597daca485a20d7401d.1920x1080.jpg?t=1651167880,https://cdn.akamai.steamstatic.com/steam/apps/1840130/ss_1f89c95637c94ab89a58f2d70de5f603466882e8.1920x1080.jpg?t=1651167880,https://cdn.akamai.steamstatic.com/steam/apps/1840130/ss_f04ee3b484fd44e48330b5dd4438ed00c5e5b889.1920x1080.jpg?t=1651167880,https://cdn.akamai.steamstatic.com/steam/apps/1840130/ss_176085b583cfe8ea6987ce9d68727786f5af118b.1920x1080.jpg?t=1651167880,https://cdn.akamai.steamstatic.com/steam/apps/1840130/ss_4b38d338b43d6208a4602737885effb389c04950.1920x1080.jpg?t=1651167880",
    "Slug": "sword-of-atlas",
    "Meta Title": "Sword of Atlas: Apr 27, 2022, FAFO Studio and Full Overview",
    "Meta Description": "Looking for information on Sword of Atlas? Check out the release date (Apr 27, 2022), developer insights from FAFO Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Sword of Atlas game - Steam 1840130",
    "Canonical URL": "https://gusku.site/game/sword-of-atlas",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sword of Atlas\", \"description\": \"Looking for information on Sword of Atlas? Check out the release date (Apr 27, 2022), developer insights from FAFO Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FAFO Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FAFO Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1840130/header.jpg?t=1651167880\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}