{
    "AppID": 1849820,
    "Name": "Telepath Tactics Liberated",
    "Release date": "Mar 14, 2022",
    "About the game": "Deep tactics Ever played an SRPG and thought 'Gosh, I wish I could shove enemies off cliffs'? Ever wished you could hack through trees to open up a path, build a bridge to cross water, or dunk enemies into that same water? This is the game for you! Telepath Tactics Liberated is a strategy RPG influenced by classics like Fire Emblem, Disgaea, Shining Force, and Final Fantasy Tactics. Come experience a well-told tale of redemption, revenge, and liberation with challenging battles and a large cast of unique characters! Story The Strider sisters escaped from slavery at a young age. Taken in by the reptilian lissit and trained in the art of fighting, they now undertake a journey to rescue their father and liberate the mines from their former oppressors, recruiting dozens of unlikely allies and facing down sinister villains along the way. Features Build an army from dozens of unique characters across 24 base classes! Promote your characters to a selection of 48 powerful prestige classes! Learn more than 150 different skills! Shove enemies off of cliffs or into each other! Fling enemies into environmental hazards like traps, chasms, water, and lava! Destroy walls, freeze water and lay explosives, changing the face of the battlefield to your advantage! Create bridges to forge new routes around the battlefield; place traps and build barricades to force enemies to engage on your terms. Keep your army well-supplied; make hard choices about your resources both on and off the battlefield. Use the built-in campaign editing suite to build your own campaigns with unique characters, battles, cut scenes, items, skills, and dialogue--and download other peoples’ creations to play! As a ground-up remake of the 2015 indie classic Telepath Tactics, Telepath Tactics Liberated features the same awesome map design, varied character roster, and deep turn-based tactics of the original in an entirely new engine! If you love SRPGs, this is an experience you simply shouldn't miss out on.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1849820/header.jpg?t=1651151712",
    "Price": 24.99,
    "Developers": "Sinister Design",
    "Publishers": "Sinister Design",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1849820/ss_445d6e037fe8de6777a40a0a2dcac60df7e71015.1920x1080.jpg?t=1651151712,https://cdn.akamai.steamstatic.com/steam/apps/1849820/ss_7b04c5967313d792b81253a7916e5c10db21c9c0.1920x1080.jpg?t=1651151712,https://cdn.akamai.steamstatic.com/steam/apps/1849820/ss_9e70d8093b36d85a7693ba69f4619732ccd8be23.1920x1080.jpg?t=1651151712,https://cdn.akamai.steamstatic.com/steam/apps/1849820/ss_1ddb36455975c05e10d83245dab482972522b875.1920x1080.jpg?t=1651151712,https://cdn.akamai.steamstatic.com/steam/apps/1849820/ss_5c59db32f43d263926d9ef78ef1050d7b4394d30.1920x1080.jpg?t=1651151712",
    "Slug": "telepath-tactics-liberated",
    "Meta Title": "Telepath Tactics Liberated: Mar 14, 2022, Sinister Design...",
    "Meta Description": "Looking for information on Telepath Tactics Liberated? Check out the release date (Mar 14, 2022), developer insights from Sinister Design, and a complet...",
    "Alt Text Image": "Official header image for Telepath Tactics Liberated game - Steam 1849820",
    "Canonical URL": "https://gusku.site/game/telepath-tactics-liberated",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Telepath Tactics Liberated\", \"description\": \"Looking for information on Telepath Tactics Liberated? Check out the release date (Mar 14, 2022), developer insights from Sinister Design, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sinister Design\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sinister Design\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1849820/header.jpg?t=1651151712\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}