{
    "AppID": 1940040,
    "Name": "The Price Of Flesh",
    "Release date": "May 2, 2022",
    "About the game": "This game is not for minors, or for anyone sensitive to psychological horror/triggering content. This game may not be fun for straight guys! There's a lot of DICKS! I don't know how much more clear I can be about this LMAO! This sexual content in this game is generally built for Women, Members of LGBTQ+, Masochists/Submissives, and experimental people with open minds that also love horror. By all means, straight dudes can absolutely buy it, but just be aware that two of the paths are dick heavy and only one isn't &lt;3 Welcome to The Price Of Flesh! This game is a hybrid between Survival Horror and NSFW. While the adult content is optional (it can be toggled when starting a new game file), the vibe of the overall game is still somewhat sexual, and the horror content is very intense- hence the minimum age. You begin the game in an auction, and you are what's being sold. You can choose one of three paths, being sold to one of three bidders. Mason: If you are bought by Mason, you'll be taken off the grid, deep into the dark Canadian wilderness. Mason's goal is a good hunt, and you are his prize. On this path you'll not only be dealing with Mason, but the mountain itself, and all the danger upon it. You'll need survival skills, and to keep your wits about you. You'll need to manage your health, the freezing temperature, and the onset of insanity to have a chance of surviving. Celia: If Celia buys you, you'll be taken to the basement floors of an abandoned office building. Celia is a bit high strung, and she's looking for a way to relax. Unfortunately, her preferred methods of unwinding are a bit violent. One wrong move and you may lose your life. Her path is more psychological, and you'll need to be smart and stealthy to stay alive. Unfortunately, there's no way to tell time underground- and you'll never know when she's going to come back. Derek: Derek belongs to a sort of 'club'. If he's the one to purchase you, then you'll find out what this club is all about. In the middle of the desert, five killers bring five victims- including you. Not only will you have five murderers to contend with, but you'll have to worry about the searing heat of the desert. There's no food and no water, and the clock is ticking for your own survival- and that of the other four victims. You may need to work together if you want to make it out alive.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1940040/header.jpg?t=1652451730",
    "Price": 14.99,
    "Developers": "Gatobob",
    "Publishers": "Gatobob",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_793805fd79faa7ffb944c40e37474c922a4624c9.1920x1080.jpg?t=1652451730,https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_79013375665ee94e5ac4813257a12c0a54eee41b.1920x1080.jpg?t=1652451730,https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_e8e9298567ee491e3c145128f70a14b8e61da823.1920x1080.jpg?t=1652451730,https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_494f67beded5789b5ea8079b272277d8eb747680.1920x1080.jpg?t=1652451730,https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_7d1d1b71a82c99d37cf058f9efaa4bec4c6bc3a7.1920x1080.jpg?t=1652451730,https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_770d0bf9c08c3872cd39f6c40007181ea6c93bcd.1920x1080.jpg?t=1652451730,https://cdn.akamai.steamstatic.com/steam/apps/1940040/ss_e2f5adf11aa911354e5673939d71f3b8655203a7.1920x1080.jpg?t=1652451730",
    "Slug": "the-price-of-flesh",
    "Meta Title": "The Price Of Flesh: May 2, 2022, Gatobob and Full Overview",
    "Meta Description": "Looking for information on The Price Of Flesh? Check out the release date (May 2, 2022), developer insights from Gatobob, and a complete game summary.",
    "Alt Text Image": "Official header image for The Price Of Flesh game - Steam 1940040",
    "Canonical URL": "https://gusku.site/game/the-price-of-flesh",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Price Of Flesh\", \"description\": \"Looking for information on The Price Of Flesh? Check out the release date (May 2, 2022), developer insights from Gatobob, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gatobob\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gatobob\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1940040/header.jpg?t=1652451730\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}