{
    "AppID": 938380,
    "Name": "Townsmen - A Kingdom Rebuilt",
    "Release date": "Feb 26, 2019",
    "About the game": "Welcome, your Highness! A vast land awaits your settlers and is ready to be colonized. Send your architects and builders to plan and construct a city. But also send your craftsmen, to cut some wood and to mine ore. Make sure your fields are on fertile grounds, to get all the food for your hungry subjects! Townsmen – A Kingdom Rebuilt hands the crown to you: Guide your people from their first steps in a small village to a massive medieval metropolis with thousands of inhabitants. Overcome the challenges that lie ahead. Your citizens have various needs in order to stay happy. And you have to keep them happy, to keep the tax coins rolling which you need to build even more. Beware, as there are many things in the world that will disturb the happiness: Seasons will change the demand for certain goods – more water is needed during summer, more clothes in winter. Catastrophes may hit your prospering city, the plague, a large fire or an avalanche won’t make anyone happy nor will a bandit attack! A huge variety of houses to build and many different jobs for your subjects will keep you busy. The armory will produce weapons for your soldiers, to keep your citizens save from bandits. The bakery or the butcher’s workshop will provide food, the monastery, the juice manufacture and the vineyard will bring the drinks – and everything can be bought at the marketplace! Make sure to have an eye on the daily routines of your people – besides jobs &amp; food, they also need a place for recreation like a park, houses to live and entertainment in the jousting grounds or the tavern! Each of your deeds is meaningful: If you order your folks to build a house, if you send them to a new job – everything will reward you with experience points. This progression system will allow you to research techniques that for example increase the amount of taxes you get or make your watchtowers more efficient. In every map you play! FEATURES City-building gameplay set in medieval times Complex economy sim and deep production chains Over 150 different town- and production buildings Seasons and weather effects that influence gameplay Citizens have their own daily routines with different demands The overarching “town level” brings player progression for every single deed – you’ll be a better sovereign each time you play the game Devastating disasters like fire, the Plague, drought and many more 26 diverse scenarios and challenging tasks Unrestricted endless mode on 24 maps Optional military feature with soldiers and bandits New townie language for livelier interactions",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/938380/header.jpg?t=1654097041",
    "Price": 19.99,
    "Developers": "HandyGames",
    "Publishers": "HandyGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_e9116831abb23cf0cf46e1e32ca04417adabb459.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_a6fdaa27dcc28c550b3df3666013b5edaf7c991c.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_53c12e8b0978c65912a58b5ef3c49f089753d830.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_a1039fb07ca06cfc896b5c3cf02b7d01da08fc35.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_ac84f69204ce4a68901ae9e02d62ca41f5c2004c.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_8a8a20146632f79088c2822f03ed5770ffb863e7.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_b1689f4dcb51dde63c9424f6810ee36b1c34170c.1920x1080.jpg?t=1654097041,https://cdn.akamai.steamstatic.com/steam/apps/938380/ss_9d7461fc43adc32b47dfa12ac80ea1e568a8b4d1.1920x1080.jpg?t=1654097041",
    "Slug": "townsmen-a-kingdom-rebuilt",
    "Meta Title": "Townsmen - A Kingdom Rebuilt: Feb 26, 2019, HandyGames an...",
    "Meta Description": "Looking for information on Townsmen - A Kingdom Rebuilt? Check out the release date (Feb 26, 2019), developer insights from HandyGames, and a complete g...",
    "Alt Text Image": "Official header image for Townsmen - A Kingdom Rebuilt game - Steam 938380",
    "Canonical URL": "https://gusku.site/game/townsmen-a-kingdom-rebuilt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Townsmen - A Kingdom Rebuilt\", \"description\": \"Looking for information on Townsmen - A Kingdom Rebuilt? Check out the release date (Feb 26, 2019), developer insights from HandyGames, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"HandyGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HandyGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/938380/header.jpg?t=1654097041\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}