{
    "AppID": 788700,
    "Name": "ValeGuard",
    "Release date": "Aug 23, 2018",
    "About the game": "ValeGuard is a Tower Defense, Town-Management hybrid that combines Turn-Based City-Building with Real-Time Combat. Each day you construct your defenses, train troops, and prepare for attack. When enemies come in the night, you defend with towers, troops, and heroes with powerful abilities! Save as many towns as you can, while you travel through the Vale. Choose wisely, because each town unlocks unique assets and a hero to aid in future battles. Defeat is not the end in Valeguard. Each play you can unlock more heroes and discover new strategies to achieve victory! Build in the day and defend at night The quiet hamlets of the Vale stand defenseless. As the ValeGuard you act as mayor, merchant, and general for each village. Balance your workforce to provide food, housing, troops, and fortifications. When enemies threaten your villages, take on the role of commander with pause-able, real-time combat. Gather resources, craft weapons, and train troops Juggling resources is key to success in ValeGuard. Wood and iron are required to craft weapons. These weapons are then used to create troops or towers. Trade with merchants and buy items on the black market Gold is the most valuable of all resources and cannot be mined. Trade wisely and spend your gold carefully to ensure you have the funds you need. Random events and levels make each play unique Pumpkin patches, graveyards, wizard towers, and other town features can alter the way a town is managed and defended. Navigating nightly events can mean avoiding a deadly fight, or acquiring a magical item. Sometimes risk pays off while other times caution is wisest. Hop from town to town as you travel across the map of the Vale Each town provides a new hero, technology, and bump to starting resources. Not all villages will survive the war and when a town is destroyed, these perks are lost with it. Choose each town carefully to balance your party and defensive strategy for the long-term. Build walls, towers, and traps to defend your village There are many ways to defend a village in ValeGuard. Adapt, and uses what defenses are available to best support your heroes. Unlock new heroes through special events and quests Start the game with a single hero class and unlock rare and powerful heroes as you play. With more hero options you can begin to build a more balanced and powerful party. Upgrade Units With Armor and Mounts Towers are dependable and simpler to build but are static and don't gain experience. Troops are more demanding but can be moved to defend where needed. Troops can also be upgraded with armor, mounts, and gain levels with experience. Confront the dark generals in a final epic battle The final confrontation is difficult and success depends on a successful campaign. All your choices of tech, upgrades, heroes, and more will determine if you can hold out in the final battle.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/788700/header.jpg?t=1634338316",
    "Price": 9.99,
    "Developers": "Lost Tower Games",
    "Publishers": "Lost Tower Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_3a89745f6a64c0d96b520d950b27d4847f7dd0c6.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_a72999bc555e7de829261193c8f3405ec6b48927.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_c91f80c5e8229bb66745fac6dd13244d474f3bcf.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_53fa6b68cd5d167e3a00d1d22c4ea0693d6d87dc.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_b5bd37d4eb4108c2df7597b69ec5b04022810ff2.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_5e5346dec6433aa166a0dc2d1faa3da173097a17.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_1719156bafce9d43b0ee6627037835f410e5520b.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_ea240b047eabdb63e2506334bdc27db9b8365df9.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_c7830a0696d181e831911107782113ece78e0716.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_befa0539f5a057277a6b3c84c7c27f618756821e.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_2a0b9e9060b52f8f2d02e575672e7989b74f3cd5.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_bfd8f2d9f9cfd1b78f921ea842a385d75b46bee5.1920x1080.jpg?t=1634338316,https://cdn.akamai.steamstatic.com/steam/apps/788700/ss_f4fdbdafab1f5d06640b91f32cbc4b995cb3bf88.1920x1080.jpg?t=1634338316",
    "Slug": "valeguard",
    "Meta Title": "ValeGuard: Aug 23, 2018, Lost Tower Games and Full Overview",
    "Meta Description": "Looking for information on ValeGuard? Check out the release date (Aug 23, 2018), developer insights from Lost Tower Games, and a complete game summary.",
    "Alt Text Image": "Official header image for ValeGuard game - Steam 788700",
    "Canonical URL": "https://gusku.site/game/valeguard",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ValeGuard\", \"description\": \"Looking for information on ValeGuard? Check out the release date (Aug 23, 2018), developer insights from Lost Tower Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lost Tower Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lost Tower Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/788700/header.jpg?t=1634338316\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}