{
    "AppID": 1771540,
    "Name": "ZenVR",
    "Release date": "Dec 13, 2021",
    "About the game": "All of us want to better control our emotions and manage stress. ZenVR is the meditation learning system you’ve been looking for! With an instructor-led classroom experience, ZenVR will teach you real meditation beyond relaxation and guide you to take your skills off the cushion and into your everyday life. The growing curriculum of classes is built with real meditation teachers and proven in research conducted at Georgia Tech to teach you skills to improve your everyday mental wellbeing. Easily fit meditation into your weekly routine. Lessons 1 - 4 (each a half-hour-long class) are available now. You’ll also receive access to PRACTICE mode where you can build personalized sessions to conveniently review techniques and concepts and/or to simply meditate guided or solo. We'll be releasing more lessons, PRACTICE mode settings, modes and features as we continue expanding! We encourage completing each lesson at your own pace. Please take your time between lessons to reflect on talks, work on techniques, and practice building a regular habit of meditating. When you are ready to continue on your journey through the ZenVR curriculum: complete Lesson 4 in LEARN mode to begin the Making Peace With Rain Lesson Pack when it releases in December 2021. We also encourage you to join the online ZenVR Community on your preferred socials for active discussions with fellow meditators and regular zen content designed to supplement your practice and encourage you to build the habit. It's been found that community can enhance one's practice by promoting focus and motivation. Visit www.ZenVRapp.com/connect to join us and fellow meditators. Welcome Aboard and Happy Meditating! 🧘 ------------------ ZenVR is launching in Early Access! We want your voice to help shape where we go from here and what features we prioritize first! As your meditation practice grows, we'll be growing alongside you as we evolve not just the Meditation Learning System but the virtual world into a Zen retreat you can come to anytime. We're proud to launch with v1.0 of LEARN mode and PRACTICE modes and excited for upcoming announcements on release dates and details regarding new lessons, meditation environments, modes and features! Reviews and feedback on our socials and Discord {LINK REMOVED} are always appreciated!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1771540/header.jpg?t=1644085504",
    "Price": 19.99,
    "Developers": "Satori Studios Inc.",
    "Publishers": "Satori Studios Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1771540/ss_6a7f2a4e4720fc280631acfb2e92344e193242fb.1920x1080.jpg?t=1644085504,https://cdn.akamai.steamstatic.com/steam/apps/1771540/ss_69a8f1e06c03d6992f058192b23c10f7fd54d596.1920x1080.jpg?t=1644085504,https://cdn.akamai.steamstatic.com/steam/apps/1771540/ss_013577cdc97da8a2daa6ce529fa61fe849361038.1920x1080.jpg?t=1644085504,https://cdn.akamai.steamstatic.com/steam/apps/1771540/ss_28f9049fe4c4615782fadad48fe72415765fed05.1920x1080.jpg?t=1644085504,https://cdn.akamai.steamstatic.com/steam/apps/1771540/ss_e4a606508e97dc0a7d5c200900b4093a2be93065.1920x1080.jpg?t=1644085504,https://cdn.akamai.steamstatic.com/steam/apps/1771540/ss_a4674e092e2cf6a1708369c4f49ea623f7f864bf.1920x1080.jpg?t=1644085504",
    "Slug": "zenvr",
    "Meta Title": "ZenVR: Dec 13, 2021, Satori Studios Inc. and Full Overview",
    "Meta Description": "Looking for information on ZenVR? Check out the release date (Dec 13, 2021), developer insights from Satori Studios Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for ZenVR game - Steam 1771540",
    "Canonical URL": "https://gusku.site/game/zenvr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ZenVR\", \"description\": \"Looking for information on ZenVR? Check out the release date (Dec 13, 2021), developer insights from Satori Studios Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Satori Studios Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Satori Studios Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1771540/header.jpg?t=1644085504\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}