{
    "AppID": 694280,
    "Name": "Zombie Army 4: Dead War",
    "Release date": "Feb 18, 2021",
    "About the game": "Hitler’s hordes are back for more in this spine-chilling shooter from the makers of Sniper Elite 4! Abominable occult enemies, epic weapons and a harrowing new campaign for 1-4 players await in 1940s Europe, as you fight to save humankind from undead Armageddon! Shocking New Campaign The resistance have defeated Zombie Hitler and cast him into Hell – but the dead rise once again with greater hunger than before! Continue the alternate history of Zombie Army Trilogy in huge new levels, and uncover a sinister plan that takes the Survivor Brigade across Italy and beyond! Fight the forces of darkness in corpse-riddled canals, survive a Zombie Zoo, and journey to dark, inexplicable places no person has been before…and lived to tell the tale! Award-Winning Gunplay Experience the genre-defining ballistics Rebellion made famous in the Sniper Elite series, and put it to good use against the shambling hordes of the damned! Upgraded Kill Cams and Dismemberment The X-Ray Kill Camera returns! Watch in gory-ous slow motion as bullets, bombs and more destroy bones and organs in X-ray. Marvel as your bullets tear off a rotten limb or two, and shiver as the dead KEEP COMING! Deep Progression and Customisation Build the slayer that suits you as you rank up! Fancy yourself a guardian angel? Take damage for your teammates! Like that turret so much? Why not take it with you? Then kill in style as you unlock new outfits, emotes and taunts! Killer Melee When the dead surround you, fight back with enhanced melee combat! Barge through crowds, stomp on heads and dispatch the living dead with fearsome takedown moves! Epic Weaponry Harness the power of fire, lightning, and divine essence to upgrade your guns at workbenches, and create homespun hell raisers! An assault rifle that shoots lightning? A pistol with a flaming Bayonet? Anything goes in humankind’s last stand! Monstrous Multitudes Take on legions of ghoulish grabbers, hulking armoured elites, terrifying shadow demons, explosive suicide generals and a host of other surprises! When you’re staring down the fleshy barrel of a ZOMBIE TANK, you’ll wish you’d stayed behind the sofa! Bigger, Badder Horde Mode Extend your SLAYcation in the expanded Horde Mode. The longer you survive, the bigger the map gets. How long can you fight back without joining the horde of the LIVING DEAD? Extend Your Slay-Cation! Want more? Additional seasons of Zombie Army 4 are out now! Unveil the secrets of the occult in the new 3-part ‘Hell Cult’ campaign and face off against the terror of the skies in the horrifying ‘Death From Above’! From extra missions to new characters, weapons and more, get ready to blow apart your undead foes in new and terrifying ways!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/694280/header.jpg?t=1652368094",
    "Price": 49.99,
    "Developers": "Rebellion",
    "Publishers": "Rebellion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_3587327234fd23ba82aa7c7b0854d536f85f3e02.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_4b002f1432e65ad4a6c02afb3af8aaee080214dd.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_bba4378450f73000dcff9d85cbf14977075839a3.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_4b244971f2c21e002a4dfa4e5af7441618e44f3d.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_61ae732ace66ee008fa5fbe349e11a703e9c2dfa.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_5f07f1fe91a3671572b23088de86481937364540.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_084a8946bbdc3b6ebe958f62328cb4c4a8d37970.1920x1080.jpg?t=1652368094,https://cdn.akamai.steamstatic.com/steam/apps/694280/ss_052edc1172dbfaf7590e4530624679cc283d0752.1920x1080.jpg?t=1652368094",
    "Slug": "zombie-army-4-dead-war",
    "Meta Title": "Zombie Army 4: Dead War: Feb 18, 2021, Rebellion and Full...",
    "Meta Description": "Looking for information on Zombie Army 4: Dead War? Check out the release date (Feb 18, 2021), developer insights from Rebellion, and a complete game su...",
    "Alt Text Image": "Official header image for Zombie Army 4: Dead War game - Steam 694280",
    "Canonical URL": "https://gusku.site/game/zombie-army-4-dead-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie Army 4: Dead War\", \"description\": \"Looking for information on Zombie Army 4: Dead War? Check out the release date (Feb 18, 2021), developer insights from Rebellion, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Rebellion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Rebellion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/694280/header.jpg?t=1652368094\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}