{
    "AppID": 927730,
    "Name": "3D Earth Time Lapse PC Live Wallpaper",
    "Release date": "Oct 5, 2018",
    "About the game": "WINDOWS 10 ONLY! We see the wallpapers on our screen every day. Apart from increasing the resolution, they have not changed for many years. Today we have powerful devices and wallpaper is still a flat picture. Our plan is simple! take the wallpapers to a new level. 3D Earth Time Lapse PC is a project that simulates the view from the International Space Station ISS which acts as an interactive wallpaper that is displayed under Windows icons and windows. Thanks to this, each time your wallpaper will be unique and ready for your instructions! You can change the direction, height or speed of orbiting to the ground. After selecting any country, its name will be displayed so you will always know where you are. 3D Earth Time Lapse PC also has a system of positioning the earth relative to the sun. When you have the night and the wallpaper in the place where you live it will also be the night. You can also manually set the rate of the day and night changes. The land is built of high-quality 16K textures on which you can see details like lakes or rivers and at night we will see the night lights of roads and cities. In addition, the land has effects like storms or auroras. The project contains most of the countries that you can highlight and choose your own to fly to it on demand. 3DM Live Wallpapers is not responsible for correct mapping/changes of borders and names of all countries. We are not the creators of the system of division into countries. The 'Game Mode' button will allow you to stop the wallpaper when you want to play the normal game. This will cause the wallpaper will not drill down on the CPU and video card. Thanks to this you can play as always and then return to your wallpaper and unique views. The wallpaper has an extensive menu where you can change the modes and effects of the camera, graphics settings and many more. Wallpaper Features &gt; 16k Earth Maps Resolution. &gt; Full Flight Control. &gt; Real-time Or Manual Sun Position and Speed. &gt; Interactive countries with names, borders and the biggest cities. &gt; Game Mode button to stop wallpaper to play normal games. &gt; Globe mode to see all the earth. &gt; Different globe position. &gt; Home button to fly to your country. &gt; Graphics settings. &gt; Flying objects. &gt; More details like thunderstorms, Aurora, moving clouds. &gt; Probably something more ... and will be more ;) WINDOWS 10 ONLY! Multi-screen Users: We recommend using the same size screens. The wallpaper will be automatically fitted to your multi-screens. The menu is draggable so now you can place it where do you want. For the best experience, you can set earth position on one side to keep the earth at only one screen. How to Turn Off This Wallpaper?: To turn off this project you can select 'Close the app' button inside the menu. Also, you can run 'Game Mode' and use 'X' in the right top corner. How Do Interactive Wallpapers Work? Interactive wallpaper works just like a normal game, but it is displayed under icons and windows of the Windows system. The wallpaper is active all the time so that you always have a unique view. Unlike standard 'flat' wallpapers, this one will always be something else. A 3D environment posed for interaction, which allows you to influence its appearance. Can I Play Games With This Wallpaper? Of course! To reduce almost to 0 using the processor and graphics card at any time you can 'pause' the wallpaper and return to it when you finish playing. Also recommended when working on larger projects or renderings. Unfortunately, at the present moment, it is not possible to automate this process. Consumption Of Pc Resources As it is a 3D application it must take its own. We have this in mind and therefore maintaining low demand is our priority. 3D Earth Time Lapse PC also appears on mobile devices (Android) and works great on medium range phones. The wallpaper also has graphics settings so you can limit some effects. Just like in games, you can set options for your PC hardware. Why Earth? The idea came up years ago when I watched recordings from the ISS International Space Station. The views are amazing but I missed one ... freedom of flight control. The graphics engine allows more, for example, interactive countries. And that's how the project was made ...;) Do the Project Will Be Developed Of course, we still have ideas and sometimes users themselves share their ideas with us that we will try to add in the amendments. Unfortunately, we are very limited by the use of PC resources so we can not implement all ideas. For example, we could use texture 64k! (sic!) but the project would take almost 4GB when it's just a 'wallpaper' ;d Support We are a tiny team that wants to create interactive applications that diversify well-known Windows wallpapers. We try to make each project unique, bringing something new to your screen. Every support is valuable to us. Ratings and comments help us move forward and make even better interactive wallpapers. 3D Earth Time Lapse PC is our first project on the Steam platform, but we promise that with your support there will be more truly unique projects. Have A Nice Flight! 3DM",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/927730/header.jpg?t=1644363315",
    "Price": 2.99,
    "Developers": "3dm_live_wallpapers",
    "Publishers": "3dm_live_wallpapers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_d7cc574c5acec57de5ee38fed614b31704ad13bb.1920x1080.jpg?t=1644363315,https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_ed074b243600324843a5b5bd223bbfe0fdc78350.1920x1080.jpg?t=1644363315,https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_26759431aa7aef539f0a26a1366eadd51ff65bc1.1920x1080.jpg?t=1644363315,https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_b231f9c665fb2798a7f3a5751b22a2d34031db42.1920x1080.jpg?t=1644363315,https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_f6425ede91b02ecf9e0e94b48d02f25da004c7f4.1920x1080.jpg?t=1644363315,https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_460e86a9a405c83b9c10c62c668294bd50b33b33.1920x1080.jpg?t=1644363315,https://cdn.akamai.steamstatic.com/steam/apps/927730/ss_a0d0f9870d84e4694da3f8d08be747480259a69d.1920x1080.jpg?t=1644363315",
    "Slug": "3d-earth-time-lapse-pc-live-wallpaper",
    "Meta Title": "3D Earth Time Lapse PC Live Wallpaper: Oct 5, 2018, 3dm_l...",
    "Meta Description": "Looking for information on 3D Earth Time Lapse PC Live Wallpaper? Check out the release date (Oct 5, 2018), developer insights from 3dm_live_wallpapers,...",
    "Alt Text Image": "Official header image for 3D Earth Time Lapse PC Live Wallpaper game - Steam 927730",
    "Canonical URL": "https://gusku.site/game/3d-earth-time-lapse-pc-live-wallpaper",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"3D Earth Time Lapse PC Live Wallpaper\", \"description\": \"Looking for information on 3D Earth Time Lapse PC Live Wallpaper? Check out the release date (Oct 5, 2018), developer insights from 3dm_live_wallpapers,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"3dm_live_wallpapers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3dm_live_wallpapers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/927730/header.jpg?t=1644363315\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}