{
    "AppID": 1081730,
    "Name": "3D Organon VR Anatomy",
    "Release date": "Jul 4, 2019",
    "About the game": "***PLEASE NOTICE, THIS IS THE ENTERPRISE EDITION OF 3D ORGANON VR ANATOMY*** CONTACT YOUR INSTITUTION OR prosupport@3dorganon.com FOR LOGIN INSTRUCTIONS. The 'GUEST' access to selected features and models is FREE for everyone without an account. 3D Organon is the world's leading XR medical anatomy platform. Available in 16 languages. You can now visualize the skeletal system, muscles, vessels, nerves, and other organs in 3D. Delve into the human models and see what you are made of. The app integrates an extensive knowledge-base of anatomical definitions with terminology based on the official Terminologia Anatomica. The Guest mode access in the app is free for everyone and includes the entire models of the male and female skeletal systems and connective tissues. Live animations of joints and bones in the human ‘Actions’ module are also included. A subscription license grants full access to all body systems, microscopic anatomy, body actions, interactive quizzes, bone mapping, cadaveric images, remote network session creation, and many more. 3D Organon is established in over 70 countries and has been adopted by prestigious universities, hospitals, military units, associations, museums, libraries, and high schools across the globe. It’s been recommended by leading publications reporting on the future of science, education, and medicine, such as Huffington Post, Scimex, SBS, Futurism, and many others. The virtual reality version of 3D Organon has been featured in the MWC19 conference in the keynote speech of Cher Wang, the chairwoman of HTC, and by Mark Zuckerberg, co-founder and CEO of Facebook, in the OC3 conference. 3D Organon is the first software platform in the world to integrate an ultrasound simulator for VR that does not require a mannequin or other special equipment. The latest 2022 release provides a fully immersive virtual reality training solution for medical and healthcare students, with volumetric scanning in real-time and detailed anatomical views. For the first time, VR controllers simulate curved, linear, and cardiac probes in an all-in-one solution. 3D Organon has exceptional educational benefits, including gamification of learning, because students find the experience stimulating, engaging, and entertaining. The 3D models in the app can add important cognitive input, which enhances the in-depth understanding of key anatomical concepts and retention of knowledge. 3D Organon integrates advanced teaching tools that could complement any anatomy curriculum. Educators and healthcare professionals can now visualize and explore anatomy as never before. Who is 3D Organon VR Anatomy for? The app is designed to suit a wide range of individuals, from medical and allied-health students to patients, artists, and curious minds. It helps students grasp the challenging subject of anatomy, but it is also easily understood by laypeople without a medical background. The application delivers accurate visual and textual information, immediate response time, and intuitive navigation. It satisfies the highest standards of medical and scientific accuracy. A qualified team of anatomy professors and medical professionals are the authors of the anatomical definitions, formative assessment clinical anatomy quizzes, and clinical correlations in 3D Organon. Game changer multi-user anatomy trainer The ‘Network’ module allows participants to join multi-user online training sessions hosted by educators and institutions. The anatomy trainer enables you to attend remote anatomy lessons and communicate with your tutor and peers in real-time through voice chat and messages. This module is cross-platform, setting no barriers to users joining a session via any supported device. All major pc-powered and standalone virtual reality headsets, desktop, tablet, and smartphone platforms are supported. Key highlights *****Unique stereoscopic presentation of 3D anatomy in an immersive environment *****Explore 15 human body systems with over 12,000 realistic anatomical structures *****Explore 18 detailed microscopic anatomy models comprising thousands of microanatomy structures in 3D *****Body actions module with over 550 animations of muscles and organs *****Multi-user cross-platform module for up to 200 concurrent users *****Hundreds of interactive, USMLE-style clinically oriented questions suitable for formative assessment *****Detailed mapping of bone surfaces, borders, parts, and landmarks *****Hundreds of cadaveric and medical images *****X-ray mode when fading single or multiple structures *****Available in English, Latin (terminology), Chinese simplified, Chinese traditional, German, Spanish, Portuguese, Italian, French, Dutch, Russian, Ukrainian, Georgian, Polish, Thai, Greek (UI) *****Combine any two languages simultaneously *****Easily understand the spatial relationships between anatomical structures *****Learn, teach, and assess anatomy with the latest technology advancements *****Scale-up and reposition 3D models for an enlarged view *****Accurate anatomical terminology and definitions *****Anatomy models blueprinted and supervised by medical professionals with precision and esthetics *****System-based anatomy module *****Regional anatomy module *****Ultrasound simulator in VR *****Bone spurs tool for osteophytes assignment on bones and articular surfaces *****Tumor growth tool for demonstrating malignancy development and spreading on tissues and organs *****Pain effect for realizing pain points or regions on 3D models *****3D painting *****Save your models in Favorites for quick access *****Built-in 360° video recorder *****Switch among five different environments (tutorial room, teaching room, black, white, camera passthrough MR) *****Vertical and horizontal rotation, panning, scaling of 3D models *****Mixed Reality mode for realistic integration of 3D Organon into your environment (Vive Pro and Vive COSMOS only --in beta) *****Real-time switching between male and female models *****Separate male and female skeletal systems for accuracy in pelvic anatomy *****Addition/subtraction buttons for displaying muscles into layers, from deep to superficial *****Discover Lock mode — a powerful tool enabling you to operate on predefined Regional scenes by subtracting selected body systems *****Demonstrate anatomy to discuss with students, colleagues, and patients Human body systems available in the Guest mode access (2 systems) *Skeletal (male/female) *Connective Human body systems in the Subscription access (15 systems) *Skeletal (male/female) *Connective *Muscular *Arterial *Venous *Nervous *Lymphatic *Heart *Respiratory *Digestive *Endocrine (male/female) *Urinary (male/female) *Reproductive (male/female) *Sensory organs *Integumentary/skin (male/female) Microscopic anatomy models *Blood vessels and capillary bed *Bone cross-section *Bronchial tree *Cranial nerve nuclei *Ear (external, middle, inner) *Eukaryotic cell *Eye *Glomerulus *Liver lobule *Lymph node *Multipolar neuron *Nephron *Peripheral nerve *Skeletal muscle fiber *Skin *Small intestine *Stomach *Tooth To run 3D Organon VR Anatomy on Windows Mixed Reality supported headsets, please ensure you have installed the free app 'Windows Mixed Reality for SteamVR' from the STEAM store and follow the relevant setup instructions. Visit for more info on 3D Organon apps.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1081730/header.jpg?t=1647290412",
    "Price": 0.0,
    "Developers": "MEDIS MEDIA",
    "Publishers": "MEDIS MEDIA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_b32e4dbcb3afdfdb1e05fac881d65386e50b497d.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_41df275db0ec1dc95760f5a26e4268a513c462d3.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_8afa4c64735d14ac7182a8679c30860dfb0d136c.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_b783ce8723ea35ae2dd178ab7abe0720e7591aed.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_538e2d653be2daa9320587aa6a8b311e802583bd.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_aa5dc90c1d1588f86772c199c916b9a624884924.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_b2156bfaddd07fec8d0eda748e1145b326b713d7.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_0b689096ca855ccaed5dff893b23b229f1de4097.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_c24774597276e772bf4aa9935618efddf3afbc77.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_36ba797b69a9668c30e01320e69eb80019cc4b6f.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_fb4511e5d24e7a5615bee0937d3bfe72f710b1d9.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_16caa66b362dcd95a9e1e77125fca81800ddf4d9.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_bf92a4f42f923a9b1aba398948576d4d34e59daa.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_0f34a4047fba6b3c524db758750983c4f58490d3.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_a410a592e4d2ad3b5e933358a6471e472a0f4e4e.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_5f6c954e5d6d74e61f65b6100c74f905675815df.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_66e8fc8d0b1ed40ff91b2390870d883556154686.1920x1080.jpg?t=1647290412,https://cdn.akamai.steamstatic.com/steam/apps/1081730/ss_b32e4dbcb3afdfdb1e05fac881d65386e50b497d.1920x1080.jpg?t=1647290412",
    "Slug": "3d-organon-vr-anatomy",
    "Meta Title": "3D Organon VR Anatomy: Jul 4, 2019, MEDIS MEDIA and Full ...",
    "Meta Description": "Looking for information on 3D Organon VR Anatomy? Check out the release date (Jul 4, 2019), developer insights from MEDIS MEDIA, and a complete game sum...",
    "Alt Text Image": "Official header image for 3D Organon VR Anatomy game - Steam 1081730",
    "Canonical URL": "https://gusku.site/game/3d-organon-vr-anatomy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"3D Organon VR Anatomy\", \"description\": \"Looking for information on 3D Organon VR Anatomy? Check out the release date (Jul 4, 2019), developer insights from MEDIS MEDIA, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"MEDIS MEDIA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MEDIS MEDIA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1081730/header.jpg?t=1647290412\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}