{
    "AppID": 1696670,
    "Name": "Agarta",
    "Release date": "May 27, 2022",
    "About the game": "Have you ever woken up in the morning, while waiting in line at the bank, watching politicians lie by looking people in the eyes, or just watching all the injustices you've been through, feeling that you didn't have the strength to shout? Even if it didn't, it definitely will one day. Because as an ordinary person, all the decisions that affect your life are made by those who hold power expensive drinking tables. Nothing else remains more than the torture of waking up in the morning to go to work, or the tears you shed to fall asleep at night. Agarta is a story written in blood by a serial killer based on this “cry for life”, shaped around our moral judgements and decisions that make us human, and who understands that “truth” and “good” can only be “gain” in the world we live in. Cerrah, the serial killer who has committed murders in many countries of the world for thirty years, and whose name or anything else are not known other than the nickname given to him by the media, sought by Interpol with the Red Notice, reappears. Questioning the concepts of justice and law, Cerrah embarks on a struggle against those who hold power and aim to expand their personal empires that they created by protecting their personal interests. By directing and making the choices, you will bring Cerrah to one of the 22 possible endings. Agarta has been designed to show you the value and significance of every decision you make and every choice you make. Because every choice you make is also a renunciation and you cannot undo any decision. Agarta's script team includes Ali Rıdvan Tekeoğlu, as well as Taha Ulukaya, the screenwriter of the web series 'The Cheat', which has received awards in many international festivals. Temperament Model Every decision you make affects the personality of the character you direct. When you reach each final of the game, you are presented with an analysis of your character as a result of the decisions you make. Thus, you can see the effects of the choices you have made. Specifications • Cinematic FMV type Interactive thriller filmed in 4K with real actors. • Over 100 selections leading to one of the 22 finals without pause. • A Temperament Model consisting of the sum of the choices made. • The cast includes artists such as Mehmet Küçük, Burak Sarımola, Berna Adıgüzel, Yaşar Aydınlıoğlu, Alper Türedi. • For a realistic gameplay, selections cannot be undone.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1696670/header.jpg?t=1657103159",
    "Price": 9.99,
    "Developers": "FF Digital",
    "Publishers": "FF Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1696670/ss_5285b2763a9b6f0aa3a4708c405b22d621290685.1920x1080.jpg?t=1657103159,https://cdn.akamai.steamstatic.com/steam/apps/1696670/ss_3f2394ba8d69a157bf26617f49ef825474a1723b.1920x1080.jpg?t=1657103159,https://cdn.akamai.steamstatic.com/steam/apps/1696670/ss_718b0413b159f74ea119f8fa23a5a12f14a3601e.1920x1080.jpg?t=1657103159,https://cdn.akamai.steamstatic.com/steam/apps/1696670/ss_071fc2419bf3c2ef70f404ce6fc3d56985a477b7.1920x1080.jpg?t=1657103159,https://cdn.akamai.steamstatic.com/steam/apps/1696670/ss_6ea03bbd5cfa276553e383ebd8cd253f8f454822.1920x1080.jpg?t=1657103159",
    "Slug": "agarta",
    "Meta Title": "Agarta: May 27, 2022, FF Digital and Full Overview",
    "Meta Description": "Looking for information on Agarta? Check out the release date (May 27, 2022), developer insights from FF Digital, and a complete game summary.",
    "Alt Text Image": "Official header image for Agarta game - Steam 1696670",
    "Canonical URL": "https://gusku.site/game/agarta",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Agarta\", \"description\": \"Looking for information on Agarta? Check out the release date (May 27, 2022), developer insights from FF Digital, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"FF Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FF Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1696670/header.jpg?t=1657103159\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}