{
    "AppID": 1806400,
    "Name": "Alpha Shark",
    "Release date": "Dec 10, 2021",
    "About the game": "As the Alpha Shark you must eat to survive and defend your territory from other sharks who may challenge you. This vibrant coral reef is full of mysteries and places to explore. In these nutrient rich waters, fish are boundless, but after a while you may simply wish to swim in the tranquil water and enjoy the scenery. Features Grow as you eat and become the biggest shark Starve and shrink when you don't eat enough Eat other sharks Eat fish / sea life A leaderboard that shows the largest 10 sharks in the current lobby Large semi-procedural map Explore the beautiful reef and find hidden locations Treasure hunting Interactable vegetation Lots of fish First / Third-shark perspectives Ultrawide monitor support Save settings Screensaver mode In screensaver mode the game will be in single player mode, locked in first-person (shark), the HUD will be disabled, and the sharks movement will become more static allowing the player to move around and create beautiful underwater screensavers. Wallpaper mode This mode is similar to screensaver mode except the movement controls are now mouse-click driven in order to support the software called 'Wallpaper engine' that players have requested / mentioned in the past. Multiplayer / Matchmaking To join a random open lobby simply click 'Join' on the main screen To host your own game, click 'Host'. Other players will be able to join as described above by clicking 'Join' You can invite and join friends using the Steam overlay. Press [Esc] on the keyboard Host clicks 'Invite' Host uses invite dialog to invite other player(s) Other player(s) start Alpha Shark Other player(s) press [Shift]+[Tab] to activate the Steam overlay Other player(s) click 'Play Game' in the Steam chat window Note: You will not be able to join games that have a full lobby. For transparency, multiplayer is tested with 4 players and bots to emulate large lobbies. The game should support up to 250 players per server. You may find that adjusting the max players can improve or degrade your gameplay experience. There is a built in text chat, but no voice chat. If you wish to work as a team it is suggested that you use Discord or Steam Chat. Controls Keyboard &amp; mouse Look: Mouse Swim: WASD Fast swim: WASD + Left-Shift Attack: Left-click Switch view: v Free look: Left-ctrl Menu: Esc Xbox controller Look: Right-stick Swim: Left-stick Fast swim: Left-stick + Left-trigger Attack: Right-trigger Switch view: Y Free look: Left-bumper Menu: Start",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1806400/header.jpg?t=1645966525",
    "Price": 2.99,
    "Developers": "Revmatek",
    "Publishers": "Revmatek",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1806400/ss_66eceea4e9c66429c22836252ed3bc0ba7488389.1920x1080.jpg?t=1645966525,https://cdn.akamai.steamstatic.com/steam/apps/1806400/ss_95db78a8a7e0ec017ee04484f437d9041e8d012d.1920x1080.jpg?t=1645966525,https://cdn.akamai.steamstatic.com/steam/apps/1806400/ss_a34aaba3cbcdeb017d4c8a1b46b5cae12397a90f.1920x1080.jpg?t=1645966525,https://cdn.akamai.steamstatic.com/steam/apps/1806400/ss_ef2f132b8142d37af70d6afa7e27b07b22044595.1920x1080.jpg?t=1645966525,https://cdn.akamai.steamstatic.com/steam/apps/1806400/ss_2a72f00fb8e1db43466ada55c46e78b714021630.1920x1080.jpg?t=1645966525",
    "Slug": "alpha-shark",
    "Meta Title": "Alpha Shark: Dec 10, 2021, Revmatek and Full Overview",
    "Meta Description": "Looking for information on Alpha Shark? Check out the release date (Dec 10, 2021), developer insights from Revmatek, and a complete game summary.",
    "Alt Text Image": "Official header image for Alpha Shark game - Steam 1806400",
    "Canonical URL": "https://gusku.site/game/alpha-shark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alpha Shark\", \"description\": \"Looking for information on Alpha Shark? Check out the release date (Dec 10, 2021), developer insights from Revmatek, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Revmatek\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Revmatek\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1806400/header.jpg?t=1645966525\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}