{
    "AppID": 435730,
    "Name": "apartment: a separated place",
    "Release date": "Feb 14, 2020",
    "About the game": "Nick Connor just got dumped by Madison, his girlfriend of four years. Enter his life in the wake of their breakup and explore his memories of their relationship. Apartment: A Separated Place is an intimate look at Nick's state of mind as he picks through the wreckage of his relationship with Madison. Join him as he seeks self-consolation in the apartment they once shared. Venture outside to visit his neighbors: a displaced loner, a lost daughter, a grieving widow, an uncertain newlywed. Enter their apartments — their lives, their relationships, their innermost thoughts — as they seek their own resolutions. a•part•ment is a story-driven game, a bit like an interactive novel or movie where the way you play helps to tell the story rather than giving you power over it. We wanted to create a strong connection between you, the player, and the characters whose stories are told in the game. Different sections of a•part•ment have different mechanics that put you in the lives of the characters you play. In some sections you actively build the story, in others the story is in the environment and unfolds as you progress through it. Key Features A Personal Story: a•part•ment explores the story of a breakup first hand. You will join Nick as he reflects on his relationship with Madison -- how they met, how they broke up, and milestones in between leading to that point. An Interactive Anthology: Just beyond the walls of Nick's apartment are his neighbors, each with their own struggles for you to discover. Their stories are told through a series of interactive vignettes, with different mechanics designed specifically to convey their stories in a relatable and emotionally powerful way. In these vignettes you get to step into their shoes, experience a part of their emotional turmoil, and understand how they relate to the important people in their lives. Text-Based Experimentation: In games, text is often something you want to skip in order to get to the “good parts.” In a•part•ment, we want to make text the “good part” by using it in unique and interesting ways. Text and reading are central to the game. a•part•ment is a short game! A playthrough of a•part•ment runs about the length of a movie (2-2.5 hours, shorter if you hustle).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/435730/header.jpg?t=1581699655",
    "Price": 14.99,
    "Developers": "The Elsewhere Company",
    "Publishers": "The Elsewhere Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/435730/ss_c9addc88c8c3b5fab0c13ba7c4da34e7cfc2d3f1.1920x1080.jpg?t=1581699655,https://cdn.akamai.steamstatic.com/steam/apps/435730/ss_2c7c4ce8d36cd94e623f6a94b4b8e8e9477f1cf8.1920x1080.jpg?t=1581699655,https://cdn.akamai.steamstatic.com/steam/apps/435730/ss_92ae0e4718b5284e3ab9c9622153f87679cedce7.1920x1080.jpg?t=1581699655,https://cdn.akamai.steamstatic.com/steam/apps/435730/ss_053154b1d889a663a10e573c72b5010691ac9da1.1920x1080.jpg?t=1581699655,https://cdn.akamai.steamstatic.com/steam/apps/435730/ss_ed6e57adde21a45797d2f7c6e3d587f3d2762f81.1920x1080.jpg?t=1581699655,https://cdn.akamai.steamstatic.com/steam/apps/435730/ss_0857958b80c054f95746a46985e7d4f2fbcaa51c.1920x1080.jpg?t=1581699655",
    "Slug": "apartment-a-separated-place",
    "Meta Title": "apartment: a separated place: Feb 14, 2020, The Elsewhere...",
    "Meta Description": "Looking for information on apartment: a separated place? Check out the release date (Feb 14, 2020), developer insights from The Elsewhere Company, and a...",
    "Alt Text Image": "Official header image for apartment: a separated place game - Steam 435730",
    "Canonical URL": "https://gusku.site/game/apartment-a-separated-place",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"apartment: a separated place\", \"description\": \"Looking for information on apartment: a separated place? Check out the release date (Feb 14, 2020), developer insights from The Elsewhere Company, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Elsewhere Company\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Elsewhere Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/435730/header.jpg?t=1581699655\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}