{
    "AppID": 1358490,
    "Name": "Ash & Rust",
    "Release date": "Apr 1, 2022",
    "About the game": "*Please try the Demo before buying! This is a game for hardcore players, made by hardcore players. Many of the game's systems will not be suitable for everyone. I am just one developer, funded from my own savings, so please keep in mind the current level of polish will not compare to the AAA billion dollar competitors. Over time and with community support we aim to smooth out the rough aspects. Thank you!* For seasoned ARPG lovers, this is a hardcore and unique Indie entry to the genre. Fight your way through mysterious places, face mighty foes, and construct the perfect build. Enemies are strong and smart, but you'll have a massive arsenal of tools and abilities to master in order to vanquish them. Dive in, OMEN! Ash &amp; Rust is a top-down ARPG in a Dark Fantasy setting with a focus on: Extreme build diversity and depth. Abilities, Traits, and Gear interact with each other in deep ways, via an elegant UI grid system. Place Augment shapes into your Activated Inventory to enable them. The more shapes you can fit into the inventory the more power you can amass, so figuring out clever ways to piece things together can become a satisfying secondary skill. Design your own Abilities from scratch! Pick from 4 base types, then choose your payload and Element type. As you level, add as many augments as you can fit to tailor your ability to your exact needs. Choose from hundreds of augment and equipment options that combine to achieve interesting and deep playstyle types. For example, infusing the 'Spell Weaving' trait onto your character makes it such that each time a different ability is cast, you stack up a buff. Casting the same ability twice in a row resets the stacks. Visceral, Satisfying Combat Fully animation-based attacks and collider-hit physics. 'Sticky' movement and casts. (Prevents character 'sliding' and other unsatisfying combat-feel). Master the timings of animations and attacks to dodge enemy abilities, block projectiles, and line up your own devastating counter-moves. Replayability Lots of loot: Weapons, Gear, Augments, Trinkets, and more, which all have significant impacts on your power, build, and playstyle. Strategic Combat: Smart and strong enemies and bosses use A.I. Behavior Trees to respond to your actions: moving out of AoE, kiting when appropriate, dodging attacks, etc. Gorgeous and mysterious places to explore. Full PBR materials (physically based rendering), real-time volumetric lighting, responsive foliage and terrain, and other advanced technical features. Branching quests with dialogue choices. Your actions and responses shape the possible paths available to you. Character customization. Design the physical appearance of your character. And much more! The World and Setting You are...NOT the hero. You're just an Entity, plucked from the Aether after dying to join a powerful organization. You are one of many OMENs, granted power and authority in exchange for servitude. You fulfill the wants and desires of overlords, creatures, and companies - the highest bidders. Your missions will take you to the farthest reaches, exploring wondrous places and meeting many characters. Some cower at your coming, but many eagerly embrace you. Some things are just as they seem, while others are smoke and mirrors. You can amass great influence as an OMEN, what mark on the world will you leave? Ongoing Development It is my plan to support and develop this game for years to come. This is a passion project and I absolutely love working on it. My aim is to continually add new end-game modes, new loot, new places, new enemies, and Quality of Life improvements. In its current state there are still some non-core aspects that are rough around the edges. Many NPCs are not Voice acted yet. Performance/Optimizations: Though I generally try and optimize as I go, there are still many aspects that can be optimized further so that the game will run better on a wider range of hardware. Vfx clutter: There can be a lot of visual noise particularly with certain vfx. I'm working on toning them down and finding a happy medium between coolness and noise. Placeholder assets: many of the games assets, such as environment objects, certain enemies, vfx, etc are placeholder and will eventually be replaced. Character Customizer is rudimentary at the moment. I have plans for both more choices and more features (facial customization, body part sizing, etc). I'll be working on polishing all these aspects and more! Thank you for your patience! Design Philosophies New content should never obsolete old content. E.g. the level cap will never be raised, the power range of newer items will never outscale older items, etc. Instead, new content should generate new playstyles, new types of builds, and new combat strategies, without making previous ones less effective. Stat multipliers and large Area of Effects are kept to a MINIMUM. In AnR, there are no multiplicative scaling stats, only additive stats, many with built-in Diminishing Returns, and large AoE takes heavy augment investment, thus reducing character power in other areas. This should help remove the main culprits of forcing all builds down certain paths to be end-game viable. No non-progression based combat systems. In other words there will never be combat mechanics that are not based on utilizing your build to defeat it. For example: no environment traps, no quests where you use some vehicle/turret to defeat enemies, no long-cooldown transformation forms ('apocalyptic' mode, etc). In AnR, your unique build means everything, and I don't want to gate/shoehorn your progress behind some arbitrary mechanic.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1358490/header.jpg?t=1654043312",
    "Price": 24.99,
    "Developers": "Ash & Rust Studios",
    "Publishers": "Ash & Rust Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1358490/ss_5655f29cc46862e7e63e07dbc3578ed181e8aeeb.1920x1080.jpg?t=1654043312,https://cdn.akamai.steamstatic.com/steam/apps/1358490/ss_cbd99206b5569efb177ce09e5c612467407a7484.1920x1080.jpg?t=1654043312,https://cdn.akamai.steamstatic.com/steam/apps/1358490/ss_522f7cde0b7e0a2ccd62b171621e9da5787f563f.1920x1080.jpg?t=1654043312,https://cdn.akamai.steamstatic.com/steam/apps/1358490/ss_eccc36c525b27c105cff91f1ff93bcb528ea7191.1920x1080.jpg?t=1654043312,https://cdn.akamai.steamstatic.com/steam/apps/1358490/ss_c17b464223846a9cf7e9fb85908ac7678d9d41a2.1920x1080.jpg?t=1654043312",
    "Slug": "ash-rust",
    "Meta Title": "Ash & Rust: Apr 1, 2022, Ash & Rust Studios and Full Over...",
    "Meta Description": "Looking for information on Ash & Rust? Check out the release date (Apr 1, 2022), developer insights from Ash & Rust Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Ash & Rust game - Steam 1358490",
    "Canonical URL": "https://gusku.site/game/ash-rust",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ash & Rust\", \"description\": \"Looking for information on Ash & Rust? Check out the release date (Apr 1, 2022), developer insights from Ash & Rust Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ash & Rust Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ash & Rust Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1358490/header.jpg?t=1654043312\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}