{
    "AppID": 792570,
    "Name": "BattleCON: Online",
    "Release date": "Sep 3, 2018",
    "About the game": "First released as a tabletop game in 2012, BattleCON has gained a worldwide following for top-notch character design, beautiful presentation, and crunchy conflict-driven gameplay. Put your skills to the test with friends and rivals from around the world in the official online adaptation of this tabletop classic! In this deeply strategic, full-information battle card game, you will choose your fighter from a diverse roster of spell-slinging duelists, tag-teaming werewolves, time-traveling boxers, dimensional knights, and more! Each fighter brings their own unique sub-system to combat, and comes with their own complete kit–no deck building or collecting necessary! As with any fighting game, the fighters have fixed skill sets. Knowing and mastering the interactions between your abilities and your opponents' skills is key to victory. Weave together the elements, transform your fighter, set traps, mutate your cards— the possibilities are endless! A faithful implementation of the board gaming classic, now with special effects, voice acting, new art, and more! 19 Playable Fighters, with new fighters released monthly, plus online-exclusive fighters Seven and Riflam! Real-time online multi-player games with opponents from around the world. Play cross-platform with users on PC, Mac, and Linux (mobile platforms coming soon). Find opponents with automatic matchmaking, or challenge rivals directly from your in-game friends list. Interactive tutorial mode teaches the basics as you play. Meticulously balanced and regularly updated. With each update, we introduce new fighters and improved playability and balance. We implement new fighters every few weeks. Many of these are favorites from the classic BattleCON Board Game, but others are brand new and exclusive to BattleCON Online! As in popular battle arena games, you can play fighters on a free rotation, or have them forever for a one-time purchase with in-game or real-world currency. We also offer Season Passes that allow you to acquire new fighters automatically, and daily quests and events to help you earn gold and unlock new fighters. BattleCON Online gives you all the control of the tabletop edition of BattleCON, with a fully managed digital platform. The game includes animations, voiceovers, alternate costumes, and the latest balance patches and tournament rulesets. You can even watch replays and challenge friends directly! BattleCON boasts one of the best communities in tabletop gaming, and now in digital gaming as well! Enjoy weekly video tutorials, lively community discussions, fan-organized tournaments, and more by joining our online community from within the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/792570/header.jpg?t=1573344682",
    "Price": 0.0,
    "Developers": "Level 99 Games",
    "Publishers": "Level 99 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/792570/ss_83c6c1c6cb44cc11d8f87123d3f1146f0a2bb366.1920x1080.jpg?t=1573344682,https://cdn.akamai.steamstatic.com/steam/apps/792570/ss_7fe9258db816e5cdc5450e223ce0b85439c59110.1920x1080.jpg?t=1573344682,https://cdn.akamai.steamstatic.com/steam/apps/792570/ss_c74ebbb841ce5bef657087d4b648237c62e8653c.1920x1080.jpg?t=1573344682,https://cdn.akamai.steamstatic.com/steam/apps/792570/ss_8f7045af601518a91edfa3f68804ab21a2b78167.1920x1080.jpg?t=1573344682,https://cdn.akamai.steamstatic.com/steam/apps/792570/ss_d9b1678bf943022d7b4798ca15b150f696259f30.1920x1080.jpg?t=1573344682",
    "Slug": "battlecon-online",
    "Meta Title": "BattleCON: Online: Sep 3, 2018, Level 99 Games and Full O...",
    "Meta Description": "Looking for information on BattleCON: Online? Check out the release date (Sep 3, 2018), developer insights from Level 99 Games, and a complete game summ...",
    "Alt Text Image": "Official header image for BattleCON: Online game - Steam 792570",
    "Canonical URL": "https://gusku.site/game/battlecon-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BattleCON: Online\", \"description\": \"Looking for information on BattleCON: Online? Check out the release date (Sep 3, 2018), developer insights from Level 99 Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Level 99 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Level 99 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/792570/header.jpg?t=1573344682\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}