{
    "AppID": 1804590,
    "Name": "Beyond dreams",
    "Release date": "Nov 18, 2021",
    "About the game": "This is the game of a UE4 individual independent game developer from China. In this pixel game with simple plot, you will face 21 carefully designed bosses (two of them are plot characters), 16 magical treasures, difficult battles and challenge modes that bring new experience!!! Boss Challenge In addition to the plot, the other 19 bosses have their own characteristics. Most of them have changeable skill groups and will not be released in a certain order. Moreover, the bosses have many mechanisms, such as Legion summoning, transformation, extremely fast moves, blood returning, blinking and so on. treasure Each time the protagonist defeats a lower Lord, he can obtain a magical treasure. Each treasure has special attributes and its own active skills. Although he can only equip three pieces at the same time, it can still help the player better pass the customs. Game mechanism It adopts the physical limitations of soul games and rare supplies. Players need to skillfully use jumping, tumbling and treasure skills to avoid death. Challenge mode After customs clearance, you will unlock the very fun challenge mode. In this mode, you will unlock the other two supporting roles, one is the bloodthirsty female god of war, and the other is the king of bad words proficient in calling. They will bring you a new game experience after customs clearance!!! About me and the game Most of the art and music audio materials in the game come from paid commercial materials purchased from the material website, and some free commercial materials from these platforms. I thank these authors very much. Players will see their list after customs clearance. This game really took me a lot of time and effort. In addition to most art music, it was completely completed by me. I really hope you can like him. Of course, you are very welcome to point out his shortcomings in your comments.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1804590/header.jpg?t=1637253138",
    "Price": 8.99,
    "Developers": "狐一",
    "Publishers": "狐一",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1804590/ss_1b11d19b4790d8f1beaad5daa31e303a90377b01.1920x1080.jpg?t=1637253138,https://cdn.akamai.steamstatic.com/steam/apps/1804590/ss_930e2e82ccbd777496ba7938aa040915021adcfa.1920x1080.jpg?t=1637253138,https://cdn.akamai.steamstatic.com/steam/apps/1804590/ss_be1da2438ed3052f0722dce23d942026abdc5459.1920x1080.jpg?t=1637253138,https://cdn.akamai.steamstatic.com/steam/apps/1804590/ss_52c5570398b400838f7c7fa4ae2bb8588ea0d92c.1920x1080.jpg?t=1637253138,https://cdn.akamai.steamstatic.com/steam/apps/1804590/ss_1f51ff88e9630bd8bff50fcf48f2b3e18c663f51.1920x1080.jpg?t=1637253138",
    "Slug": "beyond-dreams",
    "Meta Title": "Beyond dreams: Nov 18, 2021, 狐一 and Full Overview",
    "Meta Description": "Looking for information on Beyond dreams? Check out the release date (Nov 18, 2021), developer insights from 狐一, and a complete game summary.",
    "Alt Text Image": "Official header image for Beyond dreams game - Steam 1804590",
    "Canonical URL": "https://gusku.site/game/beyond-dreams",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beyond dreams\", \"description\": \"Looking for information on Beyond dreams? Check out the release date (Nov 18, 2021), developer insights from \\u72d0\\u4e00, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u72d0\\u4e00\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u72d0\\u4e00\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1804590/header.jpg?t=1637253138\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}