{
    "AppID": 1252780,
    "Name": "Bloons Monkey City",
    "Release date": "Apr 10, 2020",
    "About the game": "Create, upgrade, and customize your very own Bloons Monkey City in this groundbreaking blend of city building and tower defense awesomeness! UNIQUE SIMULATION + STRATEGY GAMING Take back the wilderness from the invading bloon hordes and pop your way from a modest settlement to a thriving metropolis. Attack bloon-infested territory adjacent to your city, win a short tower defense game, and add the captured territory to your city as a space on which to build. Buildings are the heart of your city, and each one has a specific purpose - individual monkey towers for battle, upgrades for those towers, farms and banks to drive your economy, power to supercharge your city, epic buildings for epic powers, and decorations to make your city more awesome. Every time you build, your city looks cooler, you increase your power potential in tower defense play, and you open up even more rewards and challenges. AMAZING DEPTH AND VARIETY All 21 of the fully awesomized and carefully balanced Bloons TD 5 towers are available within Monkey City, with completely new unlock mechanics. More than 130 buildings and decorations give you endless strategies and city design options. Explore the wilderness to find treasure tiles and uncover 11 powerful special items like the Banana Replicator and the Dark Temple Idol. Burst bloons on 55 all new tower defense maps or test your mastery on 13 wildly challenging original special missions. Either way, be ready to encounter all new bloon waves and special bloon attack patterns like Cash Starve or Fast and Furious. REINFORCE YOUR FRIENDS Connect with Facebook and Game Center friends, then help each other win and expand. Send Supply Crates back and forth for bonus starting cash. Visit friends' cities to check out their strategies and their city design skills, and while you're there root out any bloon spies to win a reward for both you and your friend. SHOW OFF YOUR SKILLS Build up the strongest lineup of monkey towers possible and compete with other players for the best score in weekly Contested Territory events. Use the latest in monkey science to send player vs. player bloon attacks, then see whose defenses are the strongest and earn extra rewards for victory. Download for free and play Bloons Monkey City now! Pro tip: You can move your buildings when they are not upgrading or damaged - just tap and hold then move to a free captured tile!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1252780/header.jpg?t=1586507166",
    "Price": 0.0,
    "Developers": "Ninja Kiwi",
    "Publishers": "Ninja Kiwi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1252780/ss_eff01c03aa46f017f1d884952904fa63c19d13da.1920x1080.jpg?t=1586507166,https://cdn.akamai.steamstatic.com/steam/apps/1252780/ss_aab9577545cd55a63919686789fbe37f84ab21eb.1920x1080.jpg?t=1586507166,https://cdn.akamai.steamstatic.com/steam/apps/1252780/ss_6f9b052e95b9c75c64bea5002e90650caf124563.1920x1080.jpg?t=1586507166,https://cdn.akamai.steamstatic.com/steam/apps/1252780/ss_1742010b526e5bae8b42e986c59fcb8efc83fba3.1920x1080.jpg?t=1586507166,https://cdn.akamai.steamstatic.com/steam/apps/1252780/ss_92e3f004b9de507fa0aaa3ba4f20394353ab6e37.1920x1080.jpg?t=1586507166",
    "Slug": "bloons-monkey-city",
    "Meta Title": "Bloons Monkey City: Apr 10, 2020, Ninja Kiwi and Full Ove...",
    "Meta Description": "Looking for information on Bloons Monkey City? Check out the release date (Apr 10, 2020), developer insights from Ninja Kiwi, and a complete game summary.",
    "Alt Text Image": "Official header image for Bloons Monkey City game - Steam 1252780",
    "Canonical URL": "https://gusku.site/game/bloons-monkey-city",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bloons Monkey City\", \"description\": \"Looking for information on Bloons Monkey City? Check out the release date (Apr 10, 2020), developer insights from Ninja Kiwi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 10, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ninja Kiwi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ninja Kiwi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1252780/header.jpg?t=1586507166\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}