{
    "AppID": 1015930,
    "Name": "Blood Rage: Digital Edition",
    "Release date": "May 27, 2020",
    "About the game": "Ragnarök is coming! The sky is falling and the end is upon you… In Blood Rage, the digital adaptation of the hit strategy board game , you lead a proud Viking clan in their final fight for glory and the right of passage to Valhalla before the world finally comes to its fiery conclusion. Take command of your warriors, pillage villages, make good use of gifts from the gods and conquer your place with Odin in Valhalla. Life is fleeting, but glory is eternal. Now is the time for rage! Created by acclaimed designer Eric Lang (Rising Sun, Arcadia Quest, Chaos in the Old World), Blood Rage lets you lead one of the seven ancient Viking clans : The Wolf, Bear, Serpent, Raven, Ram, Wild Boar and Stag clan. Each with their own unique miniatures of warriors and leaders. In Blood Rage, your goal is to achieve the greatest amount of glory before the end of the third and final age—and the arrival of Ragnarök. Each god is generous in their own way: Frigga provides resources and support, Tyr strengthens your clan in battle while Loki rewards losing battles or punishes the opposing winner. Drafting gifts from a god will determine the strategy you want to implement. Choose your cards wisely or deprive your opponents of precious gifts. For your clan, there are many paths to Glory : • Invade the mythical land of Midgard and its nine provinces, pillaging their villages and the province of Yggdrasil. • Crush other clans in ferocious battles and encounter legendary creatures from Norse mythology. • Fulfill quests in honor of the mighty gods. • Die gloriously in battle or from Ragnarök as any Viking was born to do. • The only losing strategy in Blood Rage is to cower from combat . Earning your place to Valhalla in single-player mode is glorious. Eternal triumph, however, can only be achieved by reaching the top of the leaderboard in ranked online multiplayer . Fight to gain entry to Valhalla : Pillage, fight, sacrifice… Experience a new type of strategy game where victory can only be achieved by commanding your warriors in the field of battle in the face of final doom. Welcome to Midgard : Dozens of 3d scanned miniatures and a dynamic board faithful to the original boardgame. Multi-layered strategy game : Blood Rage mixes draft, hidden cards, resource management and its sheer load of trickery. Plan your strategy but be ready to adapt to your opponents’ choices: winning battles is not always the best course of action. Up to five Players : Introducing the ‘5th player expansion’ giving the options to play up to five players. All the miniatures from the Ram, Wild Boar and Stag clans as well as the God Gifts cards from the ‘5th Player Expansion’ of the board game are available in this digital edition for free. Become the greatest Viking Leader : Play solo against AI, local multi-player via hotseat or online multiplayer with ELO ranking and leaderboards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1015930/header.jpg?t=1647256078",
    "Price": 19.99,
    "Developers": "Endava",
    "Publishers": "Asmodee Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_78d87ff688960d84e102d61b0196c77510300e99.1920x1080.jpg?t=1647256078,https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_c3fe9fea69b2535ef55608d6a73f6f9f9e4e71da.1920x1080.jpg?t=1647256078,https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_000cb7f9e97f62bf46f8025dda38e28cd3424542.1920x1080.jpg?t=1647256078,https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_bd1ec74a8226dbd1a98e7cc7592fdf4d492b14c3.1920x1080.jpg?t=1647256078,https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_2464394c32c0e426b3a04e5a795c3a44335d0f71.1920x1080.jpg?t=1647256078,https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_689f71367d8e6fb0b7954c0f388ae66c79f53563.1920x1080.jpg?t=1647256078,https://cdn.akamai.steamstatic.com/steam/apps/1015930/ss_f8340069b0a2c7be86e8de3227f4344d2b897024.1920x1080.jpg?t=1647256078",
    "Slug": "blood-rage-digital-edition",
    "Meta Title": "Blood Rage: Digital Edition: May 27, 2020, Endava and Ful...",
    "Meta Description": "Looking for information on Blood Rage: Digital Edition? Check out the release date (May 27, 2020), developer insights from Endava, and a complete game s...",
    "Alt Text Image": "Official header image for Blood Rage: Digital Edition game - Steam 1015930",
    "Canonical URL": "https://gusku.site/game/blood-rage-digital-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blood Rage: Digital Edition\", \"description\": \"Looking for information on Blood Rage: Digital Edition? Check out the release date (May 27, 2020), developer insights from Endava, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Endava\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Asmodee Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1015930/header.jpg?t=1647256078\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}