{
    "AppID": 871940,
    "Name": "BrawlQuest",
    "Release date": "Jun 28, 2022",
    "About the game": "BrawlQuest is a game about FIGHTING, EXPLORING &amp; CREATING. Get ready to embark on a big adventure... FIGHT Our combat system mixes tactics and action. You've got to watch your positioning, HP &amp; Mana as you choose to fight via melee or ranged using magic. There are spells &amp; abilities thrown into the mix, and a choice of 3 classes that you can switch between to maximise your damage output. As your character levels up you have to choose to put points in 1 of 3 character stats: STR (how hard you hit), INT (how strong your spells are) and STA (how many hits you can take). Each one defines your role and ability in combat. Each mob comes with its own unique abilities and each boss has a strategy you need to learn to succeed. Fight as a group with personal loot for each kill and grind out powerful gear! EXPLORE The world of BrawlQuest is entirely hand-crafted. There are secrets hidden all over the place: hidden passageways, bosses, characters &amp; more. It's rare that a partially hidden route off the beaten path won't lead to some rare item and the very best gear in the game can only be earned through investigative work of this nature. All across the land are human settlements with non-player characters. Each one has a conversation tree and there are over 200 lines of dialogue. From the normal, lore-expositing kind to the downright strange Dancing Men. Hop on your horse and get moving... there's a lot to see! CREATE The world of BrawlQuest is yours to modify: with uninstanced player building, crafting &amp; more. Set up your home with trophies earned from your hardest battles; head down the mines and gather materials to turn into powerful weapons &amp; armour; speak to strange denizens of the world for clues at crafting spells &amp; uncovering secrets. Is there a Cow mount? Of course there is. Anything else? Yes! Thank you for asking. We've also got... NPCs with conversation trees (and over 100 lines of dialogue!) A large open world with a fair bit of variety Boats! And Pirates! And Pirate Boats! Non-combat Pets that are useless but also adorable An amazing original soundtrack composed by JoeyFunWithMusic Lots and lots (and lots) of items and gear A Prestige system allowing you to make your armour seriously beefy with potentially infinite progression Silly &amp; goofy jokes and Easter eggs. I guess we'd call that 'personality'? An extremely slow moving Cow mount, dropped by a Cow mini-boss (he deserves his own spot on this list) No micro transactions! Seriously! If you see a cool mount, you know that that player has EARNED it",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/871940/header.jpg?t=1656410336",
    "Price": 0.0,
    "Developers": "Luven Interactive LTD",
    "Publishers": "Luven Interactive LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/871940/ss_889cb2fa09ec78c14a5afef9d3babc34d9d0bbad.1920x1080.jpg?t=1656410336,https://cdn.akamai.steamstatic.com/steam/apps/871940/ss_a60dfa4c2000e529940f8adbdfb2cc568d9c8db9.1920x1080.jpg?t=1656410336,https://cdn.akamai.steamstatic.com/steam/apps/871940/ss_8c17150ff6680e71a79abdd030d538c706ea19ee.1920x1080.jpg?t=1656410336,https://cdn.akamai.steamstatic.com/steam/apps/871940/ss_9b85318556b7b35bedff90c78e0cbcb76ed4da63.1920x1080.jpg?t=1656410336,https://cdn.akamai.steamstatic.com/steam/apps/871940/ss_429c82a61629c98d101f749cda982068f6b1bb8e.1920x1080.jpg?t=1656410336,https://cdn.akamai.steamstatic.com/steam/apps/871940/ss_d7fad18a63d629a0d0579cd7deec292a62b96b60.1920x1080.jpg?t=1656410336",
    "Slug": "brawlquest",
    "Meta Title": "BrawlQuest: Jun 28, 2022, Luven Interactive LTD and Full ...",
    "Meta Description": "Looking for information on BrawlQuest? Check out the release date (Jun 28, 2022), developer insights from Luven Interactive LTD, and a complete game sum...",
    "Alt Text Image": "Official header image for BrawlQuest game - Steam 871940",
    "Canonical URL": "https://gusku.site/game/brawlquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BrawlQuest\", \"description\": \"Looking for information on BrawlQuest? Check out the release date (Jun 28, 2022), developer insights from Luven Interactive LTD, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Luven Interactive LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Luven Interactive LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/871940/header.jpg?t=1656410336\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}