{
    "AppID": 809900,
    "Name": "Calvin Tucker's Farm Animal Racing",
    "Release date": "Mar 9, 2018",
    "About the game": "Calvin Tucker’s Farm Animal Racing is a wacky, cartoonish kart game with loads of typical redneck, toilet humor, about eight wacky animals from a redneck farm. Their crazy organized tournaments brings them from the Farm to the tropical Pirate island, from the Polar Regions to Egypt, and from inside the Pyramid they are warped back in time to the Medieval times and returning by a UFO back in time again. How does that sound for crazy? Every track is filled with interactive elements, anything can happen at any time... Track and Tournaments Twelve unique tracks are available in tournaments, and also in Quick Race once unlocked. Once you have won a tournament, the golden trophy will appear and the next tournament (if available) will be unlocked. The six environments are: F.A.R.T. HQ - The Farm Track is all about the Farm. Immense fields of corn, flowers and just grass, big red farmers barns and windmills, a small town and a cozy creek: this is the place where the Redneck Farm animals come from. Medieval Madness - Medieval World, where our farm animals discover immense castle walls and towers, small and dirty villages and where everything seems cool and happy. But it's not all happy and shiny in Medieval World: Part of this world is the Dark Forrest, where danger is all around you... The Pirate Bay - The Pirate Track is the feared Pirate Bay, located on a small island in the Pacific. The lower part of the island is a hard to pass jungle, and the higher part of the island is the dangerous part: dangerous cliffs, weak bridges and a creepy tunnel with a skull shaped entrance.. Nova Zembla - The Polar track have crazy roads, tunnels and bridges entirely made of ice, our farm animals won't like the cold and the danger of this track. Who will be first in this challenging arctic race? Egypt Encounters - Burning hot sand, ancient walls and treasures, and rocky canyons, Egypt is the complete opposite of the previous Polar world but it's certainly not easier! Especially the tricky inside of the pyramid is hard to master. Rosewell - The UFO level contains alien / UFO marks in cornfield, supermarket, parking lot and of course many UFOs. Watch out for the invasion! The story: One day some animals from the redneck farm sit together and think there should be more in the world to discover than just the Farm. The main idea comes from Billy-Pete “the Pig”, who isn't satisfied with his small and dirty shack. Everyday Billy-Pete has to listen to the stories of the adventurer of his slimey, clumsy (and always bragging) friend Slimey Billy “the Frog”, who claims to have seen it all during his journeys. Billy-Pete takes a closer look at his savings from the last couple of years, and decides to take the gamble: To travel all around the globe and organize some exiting racing tournaments just for the fun and of course for the adrenaline. He hires the strong and the fearsome Billy-Barry “the Bull” to protect him from any danger he might encounter in the world, but not before the silent but cool Billy-Cool “the Sheep” with his sunglasses decides to join the party for reasons only the mystical Billy-Cool knows. Soon Mr. Billy Goat and his lovely cow-wife Sue-Ella Stripe decide to race as well, just for the fun of it, and then even chicken Sue-quack decides to join. While the party engineers and prepares their crazy vehicles, crazy cat Billy-Slick, decides to join because otherwise there is no one left at the Farm for him to harass or to oppress. Their crazy organized tournaments brings them from the Farm to the tropical Pirate island, from the Polar regions to Egypt, and from inside the Pyramid they are warped into time to the Medieval times and returning by a UFO back in time again.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/809900/header.jpg?t=1520588489",
    "Price": 2.99,
    "Developers": "Team 6 Studios",
    "Publishers": "Funbox Media Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_185228be5ffd27ef674669b1e0541f72105813bc.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_65aa79f87302e030c68d3e7fbfd2107755110147.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_ab9aebfdf271181dd3d6e209ca33629b0b557e89.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_5adcdddb6ab308ac47d0afa1de9cb670a26e85f5.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_7b7e6ec00541d69aa9c83d75860df95b37d1d9e3.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_a8d70ba1b2a3ec539fb5b328bcd35b3a77c6786f.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_08915e8bbe3a2e591fe06d065ef92e8ab98bb115.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_4ece36d2b301b1696e2e71665755e7ece963c63c.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_00cacde96bb06e9f6ade05d98891076a8eaf25f3.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_3bdbedec2ce1f3be05d66985fd4723410c72c326.1920x1080.jpg?t=1520588489,https://cdn.akamai.steamstatic.com/steam/apps/809900/ss_32ed7af91b85a51a76c713ce141d43ac35d92f52.1920x1080.jpg?t=1520588489",
    "Slug": "calvin-tucker-s-farm-animal-racing",
    "Meta Title": "Calvin Tucker's Farm Animal Racing: Mar 9, 2018, Team 6 S...",
    "Meta Description": "Looking for information on Calvin Tucker's Farm Animal Racing? Check out the release date (Mar 9, 2018), developer insights from Team 6 Studios, and a c...",
    "Alt Text Image": "Official header image for Calvin Tucker's Farm Animal Racing game - Steam 809900",
    "Canonical URL": "https://gusku.site/game/calvin-tucker-s-farm-animal-racing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Calvin Tucker's Farm Animal Racing\", \"description\": \"Looking for information on Calvin Tucker's Farm Animal Racing? Check out the release date (Mar 9, 2018), developer insights from Team 6 Studios, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team 6 Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funbox Media Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/809900/header.jpg?t=1520588489\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}