{
    "AppID": 899470,
    "Name": "Chook & Sosig: Walk the Plank",
    "Release date": "Jun 17, 2019",
    "About the game": "Chook &amp; Sosig: Walk the Plank is a mischievous, charming and character-driven adventure. Along with a few friends, Chook &amp; Sosig get creative while roleplaying as pirates. When you need to hunt for fabled treasure, you need some weird pals to join your quest! Join a ghostly chicken and a wobbly spaghetti cat as they seek fabled treasures, solve puzzles, wear dashing hats, and who knows what else! Through point and click gameplay and hilarious dialogue with oddball characters, the world of Chook &amp; Sosig is brought to life with hand-drawn art, comedic charm and delightfully detailed cartoon-inspired animation. Explore a seaside world with beloved characters including Min, Hebble, Cow and countless naughty goblins. Shape the story and unfold comedy adventure! They may not be actual pirates, but they’ve heard all the classic tales. What could go wrong? Lively, hand-drawn world: Enjoy the cute (and occasionally spooky) stylings of this cartoon-inspired artstyle, lovingly drawn from scratch and full of thoughtfully detailed animation. Vibrant characters: Get to know the whole crew, adventuring with a cheeky group of friends playing several different roles (and costumes!). Multiple endings: If treasure and unimaginable riches doesn’t sound like a lofty enough goal, you could always overthrow the local sea deity and be worshipped as a god! Super funky soundtrack: Enjoy the musical stylings of Japan-based Nathan Cleary, with over 7 tracks to bop along to! In-game sounds also include true seaside soundscapes, captured by the developer at her seaside location in New Zealand! Expanding the Chook &amp; Sosig universe: With fans like Markiplier, this beloved spaghetti cat and ghost chicken has been on several previous adventures, such as A Case of Murder, Hit the Club and Long Weekend. Walk the Plank is their biggest adventure yet! TookiPalooki is a one-woman indie game development studio, based in Hawke’s Bay in New Zealand. TookiPalooki games are inspired by the beauty and quirkiness in nature, as well as cartoons, skeletons and other critters. Her titles often feature the award-winning Chook and Sosig, a sensible ghost chicken and a spaghetti cat. Published by Armor Games Studios, Chook &amp; Sosig: Walk the Plank is her largest release to date, imbued with careful details, friendship and kind-hearted comedy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/899470/header.jpg?t=1565224765",
    "Price": 9.99,
    "Developers": "TookiPalooki",
    "Publishers": "Armor Games Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/899470/ss_e06dbedefb7494640ab2e821272f03e94b51e5bc.1920x1080.jpg?t=1565224765,https://cdn.akamai.steamstatic.com/steam/apps/899470/ss_212861f4fd6cfcc45abd93decf81f5ddeac7fbad.1920x1080.jpg?t=1565224765,https://cdn.akamai.steamstatic.com/steam/apps/899470/ss_ace5a0bcd92cdd916dead63974ceb560e14b6ebc.1920x1080.jpg?t=1565224765,https://cdn.akamai.steamstatic.com/steam/apps/899470/ss_1df9efc9b53c5cb7072809a3d720f1b5f82dd580.1920x1080.jpg?t=1565224765,https://cdn.akamai.steamstatic.com/steam/apps/899470/ss_907f461aa7c4c86da4d4ec250790deac87317825.1920x1080.jpg?t=1565224765,https://cdn.akamai.steamstatic.com/steam/apps/899470/ss_4a495aa7f56c04059fee3247e4c4022d921e7caa.1920x1080.jpg?t=1565224765",
    "Slug": "chook-sosig-walk-the-plank",
    "Meta Title": "Chook & Sosig: Walk the Plank: Jun 17, 2019, TookiPalooki...",
    "Meta Description": "Looking for information on Chook & Sosig: Walk the Plank? Check out the release date (Jun 17, 2019), developer insights from TookiPalooki, and a complet...",
    "Alt Text Image": "Official header image for Chook & Sosig: Walk the Plank game - Steam 899470",
    "Canonical URL": "https://gusku.site/game/chook-sosig-walk-the-plank",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chook & Sosig: Walk the Plank\", \"description\": \"Looking for information on Chook & Sosig: Walk the Plank? Check out the release date (Jun 17, 2019), developer insights from TookiPalooki, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"TookiPalooki\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Armor Games Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/899470/header.jpg?t=1565224765\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}