{
    "AppID": 501350,
    "Name": "Dimension Hunter VR",
    "Release date": "Sep 25, 2017",
    "About the game": "The parasitarias cerebrum cancer, or the Dance Dance Party Hat as it was originally marketed, was the No.1 selling party accessory of 2082 on our world. Attach the hat to one of those white wine spritzer drinking wallflowers and watch as they dance like nobody's watching (and occasionally lose control of their bladder). In 2092, the scientific community had discovered thousands of medical uses for the party hats, or brain crabs as they were now referred. These ranged from a remedy for ADHD for small children to curing erectile dysfunction in the elderly. No one knew where they originally came from but, wow, they made us feel sexy! Over time the brain crab became our friend, our family, and our go-to guy. Nobody expected what happened next...in 2096 reports started to emerge that users of the brain crab were unable or unwilling to remove their purple-headed friends. Over the following months, the crabs started to slowly burrow into the host's skulls and this triggered some sort of transformation in the host's DNA - mutating them into grotesque monsters, beasts, and croc wearers. Not even the sweet release of death was enough for these cheeky symbiotic crustaceans to let their hosts go; die and they would have you back up within an hour, chatting about the latest fad diet to hit the crabby world - and we are so tired of dieting. Please help us - kill us, kill us allllll!!! The dimension ship USS Ulysses' crew has been infected with a deadly inter-dimensional biomechanical parasite. The ship's crew has activated all of the dimension gates allowing the virus to spread throughout time and space causing anomalies and destruction across the ship. It's your mission to: Destroy the infected crew. Close all of the dimensional gates Hunt and exterminate any infected in other dimensions Destroy the Ulysses before it destroys every dimension! We know what you're thinking, not another skinless zombie shooter mission, well don't be a Pessimistic Pete. Our scans show lots of species and Dimensions have been infected so before you know it you will be slaughtering aliens, werewolves, cyborgs, dinosaurs, demons, and weird fish men that we don't even have a name for yet...let's call them Jeff...death to all JEFFS!!!! MFING JEFFS KILLED MY WIFE…. JJJJEEEFFFFF!!!!... ETC!!! We will send you weapon upgrades and care packages as and when we can but it's not Christmas, so don't expect a lot. We have also fitted you with our patent pending anti-brain crab helmet, it's our only prototype so please give it a polish before returning home. Your helmet will afford you some protection but it's not going to stop them from trying to get to your grey matter. As my mother always used to say, “A clean, crab-free helmet is close to godliness”...... my mother was insane, obviously, but still great advice. Dimension Hunter allows you to immerse yourself in this tongue in cheek, over the top, retro-arcade experience, with a unique choice of free or railed movement. Fast paced, hardcore, fluid gameplay mechanics with a unique, and yet familiar, comic book style of carnage and gore. Dimension Hunter gives you a unique mix of 17 locomotion methods from arcade railed to free Thumbstick movement and everything in between. Play the way you want to play!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/501350/header.jpg?t=1514362948",
    "Price": 0.99,
    "Developers": "Pocket Money Games",
    "Publishers": "Pocket Money Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_22de63369a49b99bb66c171c77b10c227096b39d.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_a49e3b9444c04a24f9cb3c9463199185df0e6bde.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_fb9622645ad5503428fbbfadacfa76a27c2ffebf.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_f1bda38127121e2a2d3a8cf6332a21f495fa36b0.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_305440037628dfcc9bd5b4577e021dc99875f64d.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_edd7711dccd0e6e615fe584a912e14d167f30021.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_daf788f868abc86dd4020d8b9f5303c22e5319d2.1920x1080.jpg?t=1514362948,https://cdn.akamai.steamstatic.com/steam/apps/501350/ss_b613f60d96a0eda585e576441e32a6a1bb001466.1920x1080.jpg?t=1514362948",
    "Slug": "dimension-hunter-vr",
    "Meta Title": "Dimension Hunter VR: Sep 25, 2017, Pocket Money Games and...",
    "Meta Description": "Looking for information on Dimension Hunter VR? Check out the release date (Sep 25, 2017), developer insights from Pocket Money Games, and a complete ga...",
    "Alt Text Image": "Official header image for Dimension Hunter VR game - Steam 501350",
    "Canonical URL": "https://gusku.site/game/dimension-hunter-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dimension Hunter VR\", \"description\": \"Looking for information on Dimension Hunter VR? Check out the release date (Sep 25, 2017), developer insights from Pocket Money Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pocket Money Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pocket Money Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/501350/header.jpg?t=1514362948\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}