{
    "AppID": 1450060,
    "Name": "Down and Out",
    "Release date": "Dec 14, 2021",
    "About the game": "Prepare for a brand new challenge. A truly immersive experience of surviving on the city streets awaits you, as you battle to prove yourself as the toughest and meanest! Fight, make money and become the king of the streets in the all-new VR fighting game from Zatun - Down &amp; Out! Experience the life of a ruthless street brawler with no place to call home, as you build both your wealth and reputation by punching your way through the opposition! But this is only the beginning! Play the right cards and throw the right punches, and battle your way through the street fighting circles. You might have started with nothing, but you can end up as the richest, most badass person in the city. Down and Out’s combat system rewards careful planning and execution of your attacks. Instead of blindly throwing punches, the key to victory lies in carefully watching the opponent for the right opportunity- between their attacks and movements, find the instant where you can land your strikes to maximum effect! Down and Out gives you, the player, the ability to forge your own path. With a broad open world and a freestyle combat system, the choices you make are yours and yours alone, as you carve out your place in the street-fighting rings of the big city. Whether you follow Down and Out’s thrilling storyline, or strike out on your own and freely explore the game world as you want, you can be sure of the time of your life. Be ready for the fight of a lifetime. Forced to live on the city streets, your story plays out through a series of meticulously planned story quests that will take you from being a poor nobody to being powerful and infamous. Discover the lives of the characters you meet on the streets, and choose how your own tale will play out!! Can you fight tooth and nail against the dangers of the big city fighting rings, where only your strength and cunning will keep you safe? We can’t wait to see! A brand-new combat system, custom-made for VR. Tired of mashing buttons and wiggling joysticks? In Down and Out, you literally get to call the shots with our new combat system, developed specially for the game’s VR experience. Every punch you throw will be your own, using movements inspired by real-life fighting styles and integrated seamlessly into your motion input. It’s the closest you’ll get to actual streetfighting! A Success Story to remember. You might start on the streets with empty pockets, but Down and Out’s engaging story quests will let you advance to the ranks of the wealthy and powerful… if you survive the fights along the way. Unique gameplay with bold visuals. Down and Out immersive visuals blend a catchy mix of realism with the pop and pizzazz of your favourite comic books, bringing the city to life as you navigate streets full of colour, lights… and deadly enemies who would like nothing more than to break every bone in your body. Smarter than ever before! Down and Out’s AI will challenge you like very few games have done before. The game’s AI adapts to your moves, and no two enemies will fight in the same way. Your opponents will analyse your techniques and learn from your mistakes- so make sure you do the same, or your story will be over before you know it! If you want to rule the streets in Down and Out, you’ll have to take on wave after wave of enemies- each one tougher and smarter than the last. But remember, each victory brings you money and fame, and one step closer to your goal. Tired of fighting? Take a quick break! Fighting for your life and money can get a little intimidating-so Down and Out offers a host of activities on the side, for when your fists need some rest! Explore the city freely, doing side missions, riding bicycles and shopping carts, and check out the many activities and minigames that wait for you on the streets. Mark out your territory! The city is your canvas- and your kingdom. Design your own personal graffiti and use it to claim your territory- but be wary, because your rivals won’t just sit there and let you take over their streets. Be ready to defend your turf, and yourself! Play Ball! Prove your basketball skills by shooting hoops around the city. Take a break from the fighting and make a quick buck by showing us some sick 3-pointer throws! Maybe you’re the next LeBron James, and just haven’t realised it yet. You’re not alone in this! Life on the streets is harsh and unforgiving, but it needn’t be lonely. Adopt a stray dog in the game and he’ll always have your back. Keep him happy and well-fed, and your new furry friend will be there for you no matter what. Diamonds in the rough: As you walk the streets in Down and Out. Everywhere you go has helpful items waiting to be picked up and used, even in the most unlikely places like dumpsters and garbage cans. From food to transportation to even improvised weapons, Down and Out is full of goodies ready to be snatched up as long as you keep your eyes open. But remember, take too much and too often, and it’ll attract unwelcome attention from the authorities! Flaunt your hard-earned cash at the in-game store selling a variety of items to make your life just a little bit easier. Whether you need to heal after a particularly brutal fight, or just want some new swag to look good- we’ve got you covered. With its immersive visuals, engaging gameplay, and unique story, Down and Out allows players to test their mettle on the streets, where strength is the only law that matters. Down and Out has something for everyone, veteran brawlers and new players alike- so come late 2021, get ready to shape your destiny in the mean city streets, with nothing but your wits and your fists to guide you. Whether you are a hardened veteran or a new player, Down and Out will let you experience the adrenaline of streetfighting like never before. Discover the survivors of the dark side of city life, as their struggle- and yours- is told through Down and Out. Down &amp; Out will soon be available for Oculus Rift, Oculus Quest, Steam, and probably PSVR later this year. Join our Discord to keep track of our game updates -",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1450060/header.jpg?t=1644656096",
    "Price": 14.99,
    "Developers": "Zatun",
    "Publishers": "Zatun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_f2e6bcd917b3e5a05f1538c5a1e55a2148d30253.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_ff7bec19df5cfaa91ede4c1a12e8fe1315e37b3e.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_6210ded30b32e2ee9175e4afce46c6c308afc232.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_6a0db5a4ecb007e9113acaf2448bf79224626ef9.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_e07e0ef03cfd66dc296a83821b065978a007e558.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_d02f639c890102f0ccb72a3eea7ad50ecbdad236.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_f87a9debaa7f85e9476134395d4ff7d3aec53b3b.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_b8cffb599f79015cfb408c10cebcfa249b2e21cc.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_6e418163a36b7a98bdcf205d740de23ebda666a5.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_96433e6fdd7c6285b754afdc76754f887e158228.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_610ea5ef7cc9ea080954c2c5abb21b335c55fd1e.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_3dfd27b5d71fd9e37a5d2b850399cf4c3ea2ccd4.1920x1080.jpg?t=1644656096,https://cdn.akamai.steamstatic.com/steam/apps/1450060/ss_4d7dee4270f0e47a37bd8a805a8074e4f0c7ba3a.1920x1080.jpg?t=1644656096",
    "Slug": "down-and-out",
    "Meta Title": "Down and Out: Dec 14, 2021, Zatun and Full Overview",
    "Meta Description": "Looking for information on Down and Out? Check out the release date (Dec 14, 2021), developer insights from Zatun, and a complete game summary.",
    "Alt Text Image": "Official header image for Down and Out game - Steam 1450060",
    "Canonical URL": "https://gusku.site/game/down-and-out",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Down and Out\", \"description\": \"Looking for information on Down and Out? Check out the release date (Dec 14, 2021), developer insights from Zatun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zatun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zatun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1450060/header.jpg?t=1644656096\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}