{
    "AppID": 443320,
    "Name": "Family Tree Heritage Platinum 9 - Mac",
    "Release date": "Feb 24, 2017",
    "About the game": "Family Tree Heritage makes searching for ancestors and creating your tree easy. Find records and important documents for your ancestors with one click for seamless searches to the world’s largest genealogy database FREE – no subscription required. Don't lose your hard work now that Family Tree Maker is retired. Save your trees, charts &amp; research locally with Family Tree Heritage! Export your data files from Family Tree Maker into Family Tree Heritage. Search Ancestry.com directly from Family Tree Heritage, if you are an Ancestry subscriber. Fast &amp; Easy! Find Your Ancestors and Create Your Family Tree! Create Your Family Tree – Quick &amp; Easy! Search Your Ancestors – FREE!* Share Your Family Story – Charts, Books &amp; More! Direct Access to FamilySearch Family Tree Heritage is fully integrated with the new Family Tree of FamilySearch. Import records directly and build your family tree quickly. No subscription required for worldwide searches Search billions of records with 1-click from the software Easy access to nearly 1 billion documents and records—Free! Design Trees, Charts &amp; Reports! Create colorful trees, heirloom-quality charts, reports and family books that will be cherished by your family members now and in future years, with Family Tree Heritage’s genealogy design tools. New Features Exciting new features to help you easily research your ancestors and share your family story. Interactive Research Timeline Uncover new information about your ancestors. The research timeline helps you uncover clues that will assist you in researching your family history by uncovering events in an ancestor’s lifetime. These events may have affected your ancestors, such as a war or immigration issue, and they can point you to additional resources to help you learn more about your ancestors. There are several pre-designed event groups to choose from. You may also add your own events. The Timeline view is interactive: click on names, dates, and places to see how it responds. A Timeline report is available for printing. Tags Tag ancestor similarities—up to 3 tags per person. You can create your own set of Tags and assign up to three Tags to the various individuals in your database. This is a popular and useful new feature among genealogists. The tags display on various screens and reports in Family Tree Heritage. Color Coding Easily identify individuals and family lines. This four color filing system has gained popularity among genealogists over the past few years. This feature allows you to add background colors to the name boxes for individuals and/or family lines. The color coding will display on various screens and reports, allowing you to easily track individuals from both the maternal and paternal sides of your mother and father’s ancestors. Four-Color Fan Charts Enhanced Fan Chart With color coding, you can now generate a Four-Color Fan Chart and include siblings in the first generation of the chart. More Features than Any Other Genealogy Program! Lists &amp; Calendars End-of-Line Individuals List Sorted Place List Sorted Individuals List Sorted Marriages List Source and Citation List Family Reunion Contact List Custom Lists Birthday Calendar Anniversary Calendar Records &amp; Reports Family Group Record Individual Summary LDS Individual Reports LDS Couple Reports Modified Register Page of Testimony Blank Family Group Sheets Advanced Management Reports Research Log Sorted Place List with Events Possible Problems Duplicate Individuals List Unlinked Individuals List Relationship Report Database Comparison list Detailed Change Log User-Friendly Interface Modern Interface with 17 Skins Share on Flash or Thumb Drive 1-Click Search to Billions of Records Advanced Features GenRelationship™ Examiner Indexed &amp; Advanced Search GenCollaboration™ GenResearchManager™ GenSourceCitation™ MapQuest® Locator New Features Color Coding to ID Generations Interactive Research Timeline Tagging Updated FamilySearch Database Ancestry Charts Box Charts With Photos Standard Ancestry Chart Ancestry Wall Chart Wall Chart with Siblings Descendant Charts Standard Descendants Chart Descendants Wall Chart Dropline Chart, Line of Descent Simple Dropline with Photos Family Charts Publish a Family Book Ahnentafel Chart (German Ancestor Chart) Ahnentafel with Siblings Cascading Family Group Charts Pedigree Fan Charts Four Color Fan Chart Quarter Circle Fan Chart Half Circle Fan Chart Full Circle Fan Chart Large Wall Charts Ancestry Wall Charts Descendant Wall Charts Descendant Dropline Charts Line of Descent Charts Wall-Sized Fan Charts Pedigree Charts Basic Pedigree Chart Blank Pedigree Charts Pedigree Chart Documented Pedigree Chart with Images Cascading Charts Family Books &amp; Scrapbooks Publish a Family Book Ancestral Book Reports Descendant Book Reports Lists &amp; Calendars End-of-Line Individuals List Sorted Place List Sorted Individuals List Sorted Marriages List Source and Citation List Family Reunion Contact List Custom Lists Birthday Calendar Anniversary Calendar",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/443320/header.jpg?t=1519148268",
    "Price": 0.0,
    "Developers": "Incline Software",
    "Publishers": "Individual Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_f4e021e4ab0f8699ec35a8b2610c0c2f1fedf808.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_8ccdd9c15a581c68bcaac264d6fcde649a9a9e9f.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_84c455d1704d7ff2fb8988869d864455d73d97cf.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_962a3e602540e63fe19060eb4cd921f4f169e04d.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_caf09e520b0116dcf57ed63aa9c9bf70c1703729.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_c5db4d7a900ac42c4cb55392f4760258eb1a5f2f.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_06b3d15f9507d717adb7ebc438c83d8c5c4fd757.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_318932ffedf825691a11bb85f4390b7092cfff0e.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_f4e021e4ab0f8699ec35a8b2610c0c2f1fedf808.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_8ccdd9c15a581c68bcaac264d6fcde649a9a9e9f.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_84c455d1704d7ff2fb8988869d864455d73d97cf.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_962a3e602540e63fe19060eb4cd921f4f169e04d.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_caf09e520b0116dcf57ed63aa9c9bf70c1703729.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_c5db4d7a900ac42c4cb55392f4760258eb1a5f2f.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_06b3d15f9507d717adb7ebc438c83d8c5c4fd757.1920x1080.jpg?t=1519148268,https://cdn.akamai.steamstatic.com/steam/apps/443320/ss_318932ffedf825691a11bb85f4390b7092cfff0e.1920x1080.jpg?t=1519148268",
    "Slug": "family-tree-heritage-platinum-9-mac",
    "Meta Title": "Family Tree Heritage Platinum 9 - Mac: Feb 24, 2017, Incl...",
    "Meta Description": "Looking for information on Family Tree Heritage Platinum 9 - Mac? Check out the release date (Feb 24, 2017), developer insights from Incline Software, a...",
    "Alt Text Image": "Official header image for Family Tree Heritage Platinum 9 - Mac game - Steam 443320",
    "Canonical URL": "https://gusku.site/game/family-tree-heritage-platinum-9-mac",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Family Tree Heritage Platinum 9 - Mac\", \"description\": \"Looking for information on Family Tree Heritage Platinum 9 - Mac? Check out the release date (Feb 24, 2017), developer insights from Incline Software, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 24, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Incline Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Individual Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/443320/header.jpg?t=1519148268\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}