{
    "AppID": 410900,
    "Name": "Forts",
    "Release date": "Apr 19, 2017",
    "About the game": "/ Active Development Since launch, Forts has been heavily supported with: Multiplayer Training - Missions specifically designed to get new players up to speed with online play. Frequent updates - Fixes, new features and rebalancing. Free DLC - Tons of Guns weapon pack, repair station, additional commander characters and more (see examples below). Modding - Workshop integration for the built-in map editor and player weapons, tech and campaigns. New features are added regularly. Ranked Multiplayer Leaderboards - 1v1 bi-monthly seasons with collectable medals. Seasonal Content - Halloween theme, Holidays theme, etc. Vibrant Community - Forts Discord with an active, helpful and informative membership, plus frequent tournaments. _______________________________ Core Gameplay Forts is a physics-based RTS where foes design and build custom bases, arm them to the teeth and blast their opponent's creations to rubble. Build an armoured fort in real-time and arm it to the teeth. Collect resources, develop your tech-tree, unlock advanced weapons to target your opponent's weak points, and feel the satisfaction as their fort comes crashing down. Features Build forts of any size and shape, as you fight Up to 8 players in online multiplayer with co-op and team deathmatch Ranked multiplayer matchmaking and leaderboards 28 mission single-player campaign Challenging skirmish mode Unlockable tech-tree Various materials and hidden rooms 16 unique weapons 4 factions 12 commander characters with unique game-changing abilities Powerful replay system Built-in level editor Steam Workshop Support Designed from the ground up to support mods Update highlights include... New Multiplayer Training Missions! To help skill up new players, we have added a new ‘Training’ tab to the multiplayer screen, under which are three missions to teach rookie commanders some of the techniques they will need to survive in online battles. Featuring an all new environment and SFX, these missions teach AA defense skills, rush building and structural durability. In addition to this, players can create their own training missions and upload them via the Steam Workshop. _______________________________ Tons of Guns This major free update adds two tech buildings which allow commanders access to six formidable new weapons. The Armoury unlocks Flak guns to clear the skies of enemy projectiles, and EMP rockets to power down enemy tech, both of which can be upgraded to the Shotgun and twin Rocket launcher, respectively. The classic Cannon is now found in the new Munitions Plant, where it is joined by it's little brother, the burst-firing 20mm Cannon. The Factory now produces two beam weapons, the classic Plasma Laser and the new Firebeam, great for penetrating fortifications to ignite them from within. _______________________________ Repair Station In an effort to reduce APM and to add another element of strategy, we have created the Repair Station. Available as a device built directly from the Reactor, the Repair Station repairs damage to surrounding building materials and devices as and when they are damaged in exchange for an ongoing resource cost. Multiple Repair Stations can be built at a time, but should be placed with care to maximise their coverage, while also ensuring they don’t put too much of a strain on your economy. Ranked Multiplayer Players who opt to play ranked matches will have the result of their battles figure into their score, and their rank will be adjusted accordingly on the public Leaderboard. Seasons last for two months, with medals given out to the table toppers in the 1v1 arena. _______________________________ BPO Commanders Three Black Penguin Oil commanders enter the fray, bringing new abilities to open up fresh multiplayer strategies. Will you choose the self-propelled projectile obsessed Seep with his extra-fast missiles, the insidious Shockenaugh and her explosive barrel incursions, or the all-or-nothing Scattershot with his focus fire?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/410900/header.jpg?t=1656813666",
    "Price": 14.99,
    "Developers": "EarthWork Games",
    "Publishers": "EarthWork Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_2f6d5b838eeeaca83e62f6cdec94cf37bdd58980.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_10b4f751819aae65c3be2c97a8cfe41fc630f111.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_e8eedae6a27b161884debba5992faceea3907112.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_7488057828186ff37b15f969f19dfa9a349992ed.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_42641f401c001b413de101695bbb9ad3210f1707.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_6710d9a3b4f15dac72a4285635052e062f2276dc.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_bb139a6018b0806c83da955cbf2be0d376051b9a.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_592c20f707bba12a78c3defdee3f851703c98c30.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_80e9b6d3c8e44ea22fba28ee070addfb1d3e8585.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_1f053a768c84677f2f0dedad690fde3ffb686ada.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_8c6e16ed3b6a3ff7a16d76c0b95713e8557206e1.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_87b29c8013aa933254f93ee950f51309ce928fb3.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_5b41508c7e6e95965c2169436a41e7e7fbcd6daf.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_f85c340ad89fff40644734f68c5f39d9dbabf9ee.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_d3201565a18dfd7e4631b28b966dc13d29f8465c.1920x1080.jpg?t=1656813666,https://cdn.akamai.steamstatic.com/steam/apps/410900/ss_e74d34ccafa63907d7e3f1f11f2f3b87e0dd737a.1920x1080.jpg?t=1656813666",
    "Slug": "forts",
    "Meta Title": "Forts: Apr 19, 2017, EarthWork Games and Full Overview",
    "Meta Description": "Looking for information on Forts? Check out the release date (Apr 19, 2017), developer insights from EarthWork Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Forts game - Steam 410900",
    "Canonical URL": "https://gusku.site/game/forts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Forts\", \"description\": \"Looking for information on Forts? Check out the release date (Apr 19, 2017), developer insights from EarthWork Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"EarthWork Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EarthWork Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/410900/header.jpg?t=1656813666\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}