{
    "AppID": 727720,
    "Name": "Found Horror Game 11.exe",
    "Release date": "Aug 16, 2018",
    "About the game": "You are Ina, a woman working alone as a gas station attendant late one night. Tonight just seems like another boring uneventful evening manning the counter, but in the pitch blackness of night things are falling into place, ensnaring you with glee into a sick, perverted, disturbing nightmare. It probably would've been best if you just hadn't come in for work, honestly. When I was in school, I used to spend a lot of time coming up with game ideas and writing them down in notebooks, creating supplementary material of what the games would be like with video tapes and cassettes, and starting to develop and then abandoning partially finished game projects in engines like Games Factory and RPG Maker. I'm Dusk Golem aka AestheticGamer, known in some corners of the internet as an absolute horror enthusiast and fanatic. But the truth is, once upon a time I was a huge scaredy-cat. I was convinced I hated horror because I was just too scared by it. Scary experiences would plague me with nightmares, but it also struck a strange fascination within me. I didn't put the pieces together that I actually liked horror until near adulthood, but I always had an attraction to the dark, to Halloween, to ghost stories, to nightmares, and to the twisted. ' Found Horror Game 11.exe ' is a game compiling recreations of some of these scrapped games and ideas I wrote down in notebooks years ago. I've changed some of the details, for example some of these originally were fan games or used copyrighted stuff I could never sell and have replaced with original materials I have made and can use. None of the game's themselves are tremendously long (each around 15-45 minutes), but each one is crammed full of secrets. There is 11 games in all, with only Game 1 being available at the start. Once the community of players have met the requirements given per game and post them in the Steam Community Discussion Board for the game, I will unlock the next game for all owners to play. Others games feature other protagonist, but all of who must reach the end of the game (but occasionally, there's more than one end to a game). Each game is different, but also similar. The ideas came from my nightmares... Or at least I think they were my nightmares, but what else could they be? I jotted them down in various notebooks of mine, recorded ideas I had for these projects on tapes and cassettes, and some of the ideas even went far enough along to get made into incomplete games I started then never came back to. But I'm coming back to them now. The games themselves range from a simple haunted house simulator, to a creepy dating sim situation, and even a trap-ridden labyrinth of horrors. The scenarios themselves are varied, elusive, and strange, even moreso than they may first appear to be. I want to share these games with you, and maybe if I do, it'll finally stop. FEATURES: 11 small games exploring eleven separate but connected ideas, but with a unique gameplay experience for each one. Every game has a twist or two, and a unique creepy experience. A unique episodic structure experimenting with community involvement and unlocking more over time and effort. Loaded with secrets to find and uncover, and goals for the community as a whole to work towards and discover. An ominous air begins to flow over you. Things are not as they always seem, and an unsettling atmosphere will always keep you on your toes. An unnerving sound design featuring various artists along with a few original compositions, featuring voice acting for the leads. This is best enjoyed in a dark environment wearing headphones, call it a 'Horror Ritual' for immersion, if you will. Multiple endings to several of the games to experience, and unlockables.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/727720/header.jpg?t=1576457715",
    "Price": 3.99,
    "Developers": "Yai Gameworks",
    "Publishers": "Yai Gameworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_03d81947d285bc57514f311e023046fbf50bb652.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_b7f912b5ab0b204ebc16b8c3ce14ab3b223ebf3b.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_6b50732c186bd43b19d062c060a04100d5510759.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_28df26f51ab610450b26666cb8b55e9cfc285afa.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_2206c7d1f0c4b4456137c827c2bde150b83a9eb6.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_abc005942f3838b28df270fb17f643799d5fc907.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_d029bd78df64ce2c7cbdb321142740c2149d12ba.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_7bcbb32c9e0d1443849b19ce1506a55436c3bf85.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_77a33be0e5baa35386678d04832cf8c8772c3741.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_266644a0469a3c0443e97f77b64d2943623d4222.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_c6c1606c50e4c7a2fc51a42e3ca7dcd4c20696a4.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_41885540c16d6ee27341bb2a250d5f35da6bee25.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_8d9fdb2163d8c203bc5c23bf3a3df36d45d670a2.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_284a16acb264e8c77d351620cb48863a4b9cd54b.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_2b4540214722a926f59d1255b480b536c8d4fae4.1920x1080.jpg?t=1576457715,https://cdn.akamai.steamstatic.com/steam/apps/727720/ss_b0b20f74bb5f147fb5222f3aceec9879d5fcefa1.1920x1080.jpg?t=1576457715",
    "Slug": "found-horror-game-11-exe",
    "Meta Title": "Found Horror Game 11.exe: Aug 16, 2018, Yai Gameworks and...",
    "Meta Description": "Looking for information on Found Horror Game 11.exe? Check out the release date (Aug 16, 2018), developer insights from Yai Gameworks, and a complete ga...",
    "Alt Text Image": "Official header image for Found Horror Game 11.exe game - Steam 727720",
    "Canonical URL": "https://gusku.site/game/found-horror-game-11-exe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Found Horror Game 11.exe\", \"description\": \"Looking for information on Found Horror Game 11.exe? Check out the release date (Aug 16, 2018), developer insights from Yai Gameworks, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Yai Gameworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yai Gameworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/727720/header.jpg?t=1576457715\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}