{
    "AppID": 1166800,
    "Name": "Grand Academy II: Attack of the Sequel",
    "Release date": "Nov 7, 2019",
    "About the game": "Congratulations! We are delighted to welcome you back to the Grand Academy for Future Villains, the world's finest evil preparatory school. It's sophomore year, and everyone's back for a deliciously meta sequel. Grand Academy II: Attack of the Sequel is a hilarious 215,000-word interactive novel and sequel to Grand Academy for Future Villains, by Katherine Nehring, where your choices control the story. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. In the space between worlds, between stories, beyond time and space itself, the Grand Academy for Future Villains trains the bad guys that every epic saga needs. Behold our dormitories, each befitting their narrative genre: horror, fantasy, sci-fi, or thriller. This year holds terrifying new challenges: a roommate, a pet, and the ominous Board of Visitors and Overlords, who have come to review the Academy's accreditation. Under the Board's steely gaze, you may be eligible to receive a destiny, which every true villain craves. They have also set each genre against one another in the house tournament. Will you lead your house to victory, betray your comrades, or perhaps both? And of course your 'friends' are back, too. Aurion, Kinistra, Phil. Why, even your maleficent mother, Maedryn the Terror of Three Worlds, is here. Or shall I call her…Professor Maedryn? Play as male, female, or nonbinary (or unhuman), gay, straight, bi, or ace. Play the game as a standalone, or import a saved character from Grand Academy for Future Villains. As Science Fiction, Fantasy, Horror, and Thriller battle each other, use your genre-savvy to lead your genre to victory -- or to seize a destiny for yourself. Raise an illicit monstrous pet in your dorm room! Support your mother's plans for school domination -- or break free and steal her clone army. As a TA, help your favorite professor get tenure - or sabotage their chances, and as the RA of Sci-Fi, Horror, Thriller, or Fantasy, figure out what's best for your evil little charges. Discover the Academy's fatal weakness! Acquire the metafictional tools you'll need to win the game of genre against genre! What can you do with a plot-hole digger or a flashback gun? Defeat your nemesis! Or save them! Or smooch them! And when things look bleak just remember: it's a trap! But you should know. You set it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1166800/header.jpg?t=1573756105",
    "Price": 4.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1166800/ss_d90eec461cc32b3ef05916d75c5b6c2f8d9c7668.1920x1080.jpg?t=1573756105,https://cdn.akamai.steamstatic.com/steam/apps/1166800/ss_141e2b5ff7f7ee1c4b960f1c165979da3882c6b5.1920x1080.jpg?t=1573756105,https://cdn.akamai.steamstatic.com/steam/apps/1166800/ss_7d27d9d8aff921980e4550fa5c3e4d3d0e08c65f.1920x1080.jpg?t=1573756105,https://cdn.akamai.steamstatic.com/steam/apps/1166800/ss_c5c2eef2190496d032eb35d6ad047f2f2ab18657.1920x1080.jpg?t=1573756105,https://cdn.akamai.steamstatic.com/steam/apps/1166800/ss_00f986c3c7eb950d707b1a79651742f499448108.1920x1080.jpg?t=1573756105",
    "Slug": "grand-academy-ii-attack-of-the-sequel",
    "Meta Title": "Grand Academy II: Attack of the Sequel: Nov 7, 2019, Choi...",
    "Meta Description": "Looking for information on Grand Academy II: Attack of the Sequel? Check out the release date (Nov 7, 2019), developer insights from Choice of Games, an...",
    "Alt Text Image": "Official header image for Grand Academy II: Attack of the Sequel game - Steam 1166800",
    "Canonical URL": "https://gusku.site/game/grand-academy-ii-attack-of-the-sequel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Grand Academy II: Attack of the Sequel\", \"description\": \"Looking for information on Grand Academy II: Attack of the Sequel? Check out the release date (Nov 7, 2019), developer insights from Choice of Games, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1166800/header.jpg?t=1573756105\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}