{
    "AppID": 1182060,
    "Name": "Heavens Tournament",
    "Release date": "Oct 17, 2020",
    "About the game": "Heavens Tournament is a hardcore realistic fighting Virtual Reality game that will test your power, reflexes, dexterity and skills. So, although it has anime characters, the fighting won't be anything like the animes that we're used to watch. You will actually have to keep your guard up, dodge, hit hard and make smart decisions, just like in a real fight with combat realism being the main philosophy, that's one of the reasons that there isn't TouchPad locomotion, because footwork is extremely important in a fight, due to that, Room Setup is necessary to play this game. Wanna hurt the opponent? Then swing your arms like you would in a real fight. And do expect to feel your arms heavy and lungs burning a little while playing this game ;) It has a unique feature that the opponent will block the incoming attack according to the direction that the player is striking or even try to knee the player if they see a level change of the player going for a takedown. The combat has a simple realistic fighting system, such as, the wider and faster your attack it, the more damage it will deal, just like in real life. It sounds silly, but this is one of the only or the only game like that out there for now. Most VR games out there, you can knock the opponent down by just waving the controller on the their faces really fast, and that's very unrealistic. Expect real challenges, each opponent having a different fighting style and ability. Although the combat is realistic, Heavens Tournament has a few flashy abilities inspired by Animes (and my personal favorite, Hunter x Hunter), making the combat even more fun. This game can be a stress reliever or just some casual fun if you wanna play on Easy mode. Or a challenge, workout or practice if you wanna try the Hard mode. Room setup and 2 towers are required for this game with the minimum space of at least 2m by 1.5m or 6.5 feet by 5 feet. Voice Actors Vicente and Matsumoto: Blaque Pauldron, Arthas: Mr. Pebble Fynis: Kenya, Nellaen: Caterina, Luke: Relle, www.youtube.com/RellePlays",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1182060/header.jpg?t=1617741564",
    "Price": 7.99,
    "Developers": "InitiativeVR",
    "Publishers": "InitiativeVR",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1182060/ss_e8ac2334390a35ae9e0bc36c44e8b93d99ba3695.1920x1080.jpg?t=1617741564,https://cdn.akamai.steamstatic.com/steam/apps/1182060/ss_ceb2feb18b2d525cf1bd628eeecadb3fb444a09e.1920x1080.jpg?t=1617741564,https://cdn.akamai.steamstatic.com/steam/apps/1182060/ss_1c115c032d600c8f797adc24a2cf5fb036eabb31.1920x1080.jpg?t=1617741564,https://cdn.akamai.steamstatic.com/steam/apps/1182060/ss_343b316e86c30be60249f73807383df71d3d988f.1920x1080.jpg?t=1617741564,https://cdn.akamai.steamstatic.com/steam/apps/1182060/ss_070265936e60af63d48ac3a35d5235f4ef4cdcdd.1920x1080.jpg?t=1617741564",
    "Slug": "heavens-tournament",
    "Meta Title": "Heavens Tournament: Oct 17, 2020, InitiativeVR and Full O...",
    "Meta Description": "Looking for information on Heavens Tournament? Check out the release date (Oct 17, 2020), developer insights from InitiativeVR, and a complete game summ...",
    "Alt Text Image": "Official header image for Heavens Tournament game - Steam 1182060",
    "Canonical URL": "https://gusku.site/game/heavens-tournament",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heavens Tournament\", \"description\": \"Looking for information on Heavens Tournament? Check out the release date (Oct 17, 2020), developer insights from InitiativeVR, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"InitiativeVR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"InitiativeVR\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1182060/header.jpg?t=1617741564\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}