{
    "AppID": 1132900,
    "Name": "Knife road",
    "Release date": "Sep 26, 2019",
    "About the game": "Overview This is a travel game through time and space. Players travel through different time and space and use various weapons to challenge the tasks given by different time and space. According to the scores obtained in different time and space, the corresponding honorary title is obtained, a total of thirteen honorary titles, and the highest honor is ‘Time And Space Guardian’. Game Features Perfecting the detailed overhead sci-fi worldview setting; Different game modes; A gripping game challenge. gameplay Game Guide Game Introduction: The game guide scene is an important scene to lead the player to understand the game. The player can follow the various game operation prompts in the wizard scene to play the game step by step, so as to understand some basic operations of the game. You can experience the game as you like. Bar shooting Game Introduction: Bar scene is the Shaoguan mode, the scene is divided into four levels, each level has a corresponding level of tasks, you can complete the corresponding tasks according to the prompts in the game. Level 1: The beauty in the center of the stage will throw things at you, use the weapons in your hand to hit the love and glare balls to score, and the lightning ball will hit the points. The level can be used to hit the love and glare balls with weapons such as ‘Flying Knife’,’Lightning Ball’,’Aura Sphere’ and ’Light Sword’. Players can use the appropriate weapons according to the game. (Please refer to 'Game Weapons' for specific use of weapons) Level 2: There is a beautiful woman in the center of the stage tied to the roulette. The darts target will appear randomly on the roulette. You can use the weapon in your hand to hit the dart target to score. Be careful not to hurt the little girl. The level suggests that the player makes  Hit the dart target with weapons such as ‘Flying Knife’,’Lightning Ball’ and ’Aura Sphere’. Players can use the right weapon for the game. (Please refer to 'Game Weapons' for specific use of weapons) Level 3: At this level, there will be many beautiful women with green hats running to you, using the weapons in their hands to hit the green hat to score, also do not hurt the beautiful women, but will deduct points. This level can use a ‘Flying Knife’,’Lightning Ball’,’Aura Sphere’ and ’Light Sword’ attack the hats on the heads of beautiful women, and players can use the right weapons according to the needs of the game. (Please refer to 'Game Weapons' for specific use of weapons) Level 4: This level is also a combination of beauty and hat. The beauty on the stage will slap your hat, use the weapon in your hand to hit the hat to score, and accidentally hurt the beauty will deduct points. This level can use a ‘Flying Knife’,’Lightning Ball’,’Aura Sphere’ and ’Light Sword’ attack hats thrown by beautiful women, and players can use the right weapons according to the needs of the game. (Please refer to 'Game Weapons' for specific use of weapons) Guardian Life Crystal Gameplay Introduction: Guardian Life Crystal Scene is an endless mode. In the game, evil forces will continue to attack the life crystal. You need to use the weapon in your hand and the Guardian Templar to protect the life crystal from it. The violation of evil forces. There are also some auxiliary props in the game, players can use the long-range weapons in their hands to attack the props chest to get the props. This level can use weapons such as ‘Flying Knife’,’Lightning Ball’,’Aura Sphere’ and ’Light Sword’.‘Flying Knife’,’Lightning Ball’ and ’Aura Sphere’ are long-range attack weapons that can attack enemies remotely; ’Light Sword’ is a melee weapon that can fight close to the enemy. (Please refer to 'Game Weapons' for specific use of weapons) Test Of Tolerance Introduction: The trial scene is endless mode. There will be a lot of ninja warriors in the game, and you will move around in the field to reach the players. After that, you can let the player not give the player a fatal blow. Players need to use the weapons in their hands to perform a one-to-many fighting challenge with the ninja. At the beginning of the game, the player can only use the long-range weapon flying knife and the melee weapon lightsaber to attack the ninja, as the killing score becomes more and more High, players can Unlock the corresponding range of attack weapons - palms and wave missiles, so you can experience the game. The level can use weapons such as ‘Flying Knife’,’Lightning Ball’,’Aura Sphere’ and ’Light Sword’. ‘Flying Knife’,’Lightning Ball’ and ’Aura Sphere’ are long-range attack weapons that can attack enemies remotely; ’Light Sword’ is a melee weapon that can fight close to the enemy. (Please refer to 'Game Weapons' for specific use of weapons) Huyi Temple Introduction: Huey Temple scene is an entertainment mode, the player is in a mysterious area, and some magical creatures appear from time to time during the interview. Players need to use the melee weapons in their hands to slash and hit similar Jelly creatures get a little bonus. If you hit a creature's eye, you get double points. Of course, if you use a chopper bomber, the bomber will explode, and the corresponding three points will be deducted. Players need to pay attention! This level can make With melee weapons such as ’Light Sword’, ’Light Sword’weapons can cut off the oncoming creatures. (Please refer to 'Game Weapons' for specific use of weapons) Scene Introduction Game Guide: Introduction: 'Make a move and then move'. Take you to the door of the journey of time and space. Bar Shooting: Introduction: Strong drums, sly crowds, enchanting sexy women and young crazy men. Even sitting in the corner is full of collisions and out of control sneer. This is a bar? The light is dazzling, but it is not so noisy; although the music is very popular, it is as smooth as a waterfall; the red wine is charming, but it is so tempting. come on!!! Guardian Life Crystal: Introduction:Introduction: The crystal of life named 'Narwu' is threatened by evil forces. As a guardian, you need to defeat the invaders with the Templar to protect the crystal of life. Test Of Tolerance: Introduction: Among the vast mountains, there is a mysterious ninja village. Only by constantly testing yourself and breaking through the limits can you become an excellent ninja. HUYI TEMPLE: Introduction: This once respected sacred place is now ridiculous, but recently it has been reborn! After two thousand years of scrubbing of nature and wind and rain, the new Temple of Huey has become a test ground for the warriors of time and space. With the hope of the new era and the glory of the old times, the temple of Huy is standing still! Game Weapon Ranged weapon Flying Knife Weapon: How to use:Press the trigger button all the way, then swing the arm forward to give the flying knife a forward moving speed. When the certain speed is reached, release the trigger button to make the flying knife fly out. 'Lightning Ball': How to use: 1. Press the left or right button of the right handpad touchpad to switch to the 'Lightning Ball' mode; 2. The hands are closed, and the handles on both sides are pressed at the same time to generate the 'Lightning Ball'. When a certain degree is raised, the hands can be separated. (Remember: do not release the trigger button before throwing out). 3. When you throw it out, you first need to aim at the enemy, then throw it out, release the trigger button where you need to throw the hand, then you can fly out and hit the target. 'Aura Sphere': How to use: 1. Press the left or right button of the right hand touchpad to switch to the 'Aura Sphere' mode; 2. Close the hands and press the trigger button on both sides to generate the 'Aura Sphere'. When it is bred to a certain extent, it can be launched. (Remember: Do not release the trigger button before throwing it out). 3. When you throw it out, you first need to aim at the enemy with both hands, then throw it out. When you need to throw the loose hand, use both hands to release the trigger button at the same time, then you can fly out and hit the target. Melee weapon Light Sword Weapon: How to use:1. Press the left or right button of the right handpad touchpad to switch to the lightsaber mode. 2. Keep pressing the handle trigger button, the lightsaber will appear; when the trigger button is released, the lightsaber disappears. Game Title Beginner's Guide、Rookie One、Excellent Newcomer、Elite Knife、Flying Kife Master、Sharp Knife Master、Hellboy、Cracker、Earl Of The Sky、Star Marquis、Duke Of Empire、Imperial Guardian、Cosmic Guardian、Time And Space Guardian",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1132900/header.jpg?t=1570597682",
    "Price": 1.99,
    "Developers": "上海星界",
    "Publishers": "上海星界",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_796edea0fd5d57cf3c74bf9a24b269dbf8ec1e9c.1920x1080.jpg?t=1570597682,https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_09cfe25b117976d24149e97a99d36b7b43418053.1920x1080.jpg?t=1570597682,https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_487e3363e86646e7f2db5a950cbb19babeb72832.1920x1080.jpg?t=1570597682,https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_079a4355d41f8a117761d252c122d7681c748677.1920x1080.jpg?t=1570597682,https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_c8b9e77f842bd23d06ebcfa622cdbd920345ad15.1920x1080.jpg?t=1570597682,https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_0935abffb86228d615ea22a6b6e639bbcceea126.1920x1080.jpg?t=1570597682,https://cdn.akamai.steamstatic.com/steam/apps/1132900/ss_1f7f3df909f11e2c0f5bac695340ba5b2025b30d.1920x1080.jpg?t=1570597682",
    "Slug": "knife-road",
    "Meta Title": "Knife road: Sep 26, 2019, 上海星界 and Full Overview",
    "Meta Description": "Looking for information on Knife road? Check out the release date (Sep 26, 2019), developer insights from 上海星界, and a complete game summary.",
    "Alt Text Image": "Official header image for Knife road game - Steam 1132900",
    "Canonical URL": "https://gusku.site/game/knife-road",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Knife road\", \"description\": \"Looking for information on Knife road? Check out the release date (Sep 26, 2019), developer insights from \\u4e0a\\u6d77\\u661f\\u754c, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e0a\\u6d77\\u661f\\u754c\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e0a\\u6d77\\u661f\\u754c\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1132900/header.jpg?t=1570597682\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}