{
    "AppID": 1590160,
    "Name": "Liberte",
    "Release date": "Feb 15, 2022",
    "About the game": "In Liberté, you immerse yourself in the rogue-like adventure that infuses the French Revolution-era setting with cosmic horrors know from H.P. Lovecraft. Choose your allies, fight relentless enemies and decide who will bring the new order in the terror-filled Paris. Your stats don't dictate the outcome of a fight. Get into a perfect position to snipe multiple enemies at once and use dodge and roll to avoid getting hit. Enemies clearly telegraph their attacks, so if you mess up, you know how to improve. With each level you climb, enemies become faster, coordinate their attacks better and fill the screen with their deadly abilities. Skills in Liberte use a unique cooldown system - instead of waiting idly for skills to recharge, jump into the fight! With each hit of your melee weapon, your skills recharge one cooldown point. Weaving chains of basic attack combos and burst damage skills allows you to clear entire rooms of enemies with ease! Your equipment and skills and are defined by what Cards are in your Deck and in what order you play them during a run. At the moment, there is a little over 100 cards in the game. Some of these cards create powerful synergies with others. To make things easy to grasp, we have assembled the cards into Sets. For example, in the Pistolier Set, you’ll find pistol skills and cards that improve ranged attacks. The Assassin Set contains sneaky skills and talents that make your backstabs stronger. You can mix these cards in any way you want. Sets are here only to suggest good combinations. You start with 40 unlocked cards and 3 starter decks to try things out. Once you get a feel for things, Liberte encourages you to modify and create your own decks. Play the game solo, or in co-op - local, online or any mix of the two. Party leader decides when the players venture forth into a mission. However, during a mission, every major decision (like, which faction to side with) is made using a Vote system. When you’re playing online and run into a Story area, each player sees his own version of that space, based on where in the game’s story he is. So, there are no conflicts and no spoilers when playing with others. And of course, everyone gets their fair share of loot. King Louis has died in mysterious circumstances. Now that Paris has no ruler, four factions clash to win the City for themselves. Play as René - a Parisian with an obscure past, whose close connection to supernatural beings places him right in the middle of the intrigue. Fight for the rights of the spiritual 💀 Tribe Rebuild the power of the aristocratic 👑 Crown Cleanse the evil with the devout ⛪ Congregation Spread anarchy with flame-loving 🔥 Rebels And hey, if you want to focus on the story, Liberte comes with a Story Mode that makes combat a breeze. Along with the revolt came Lady Bliss, a ruthless deity that brought you back from the dead to do her will. Solve the mystery of the blight that turns Parisians into numbed monsters, all serving the horrifying Lady Bliss. Enter her wicked gardens, and see what her arrival means for the city and its future. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1590160/header.jpg?t=1658409476",
    "Price": 11.99,
    "Developers": "Superstatic",
    "Publishers": "Anshar Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_9e7d12d0239db7615c4720815fd8a83f651379ff.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_af7a6119419bf5637397555fe3e51cbe1f467bb1.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_f8cb69d400ee13e64527d7e6eb58ee1feb7bc123.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_38255f692293acb44e40e1ab686ec92c085a5f62.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_bfc053beb119c80cfb6690f16456afc486c935dc.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_bae12c726c8507a214efe04849fe24edcd603834.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_32e450df06c8b36206ac6df4aada3b4df6407962.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_12617fee07da82dcbc49795de27356edd8dbb529.1920x1080.jpg?t=1658409476,https://cdn.akamai.steamstatic.com/steam/apps/1590160/ss_d393b3b1aa32bf8008365110ea7a2d40849698b9.1920x1080.jpg?t=1658409476",
    "Slug": "liberte",
    "Meta Title": "Liberte: Feb 15, 2022, Superstatic and Full Overview",
    "Meta Description": "Looking for information on Liberte? Check out the release date (Feb 15, 2022), developer insights from Superstatic, and a complete game summary.",
    "Alt Text Image": "Official header image for Liberte game - Steam 1590160",
    "Canonical URL": "https://gusku.site/game/liberte",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Liberte\", \"description\": \"Looking for information on Liberte? Check out the release date (Feb 15, 2022), developer insights from Superstatic, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Superstatic\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Anshar Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1590160/header.jpg?t=1658409476\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}