{
    "AppID": 680400,
    "Name": "Light Tracer (VR & NON-VR)",
    "Release date": "Jan 14, 2018",
    "About the game": "If we need to describe this game in brief sentence, this game is like an evil soul living in a cute body. I'll tell you why: --How long does it take to beat the game? Half an hour? C'mon, what can you do within 30 minutes in this game, maybe clear the first chapter? That's only 1/8 of all the levels, and pretty much the easiest part! --So you mean you'll keep doing the laser cat trick for 4 hours? No kidding! Light Tracer has 8 chapters with TOTALLY DIFFERENT gameplay and machanics and puzzles! Could you please check the reviews from media? Here are some examples. Light Tracer is a well-crafted VR platform title. Once you get used to the controls, it becomes challenging enough to keep you coming back for more --VRFocus Light Tracer is a wonderful, if at times way too tough VR experience. It looks and sounds great, and will keep players busy for a very long time. --PXS-Sense.nl It’s a lot of “pat your head and rub your stomach” level complexity as my brain tried to sync up two distinctly separate things in order to help the princess on her journey, especially the further up the tower I climbed. -- PlayStation Lifestyle See? This game is challenging! --But what about that best kids and family game award? They are probably wrong, because if you let a kid play the latter levels they will probably cry and quit -- I don't think they can figure out the puzzles or even the action part. If there has to be an award for Light Tracer, it should be 'Most hardcore VR game' or something. --Hardcore??? Are you serious??? With this chibi character? Don't be fooled by the visualization! It's cute, no problem, but it's not an 'easy-come-and-go' thing! There are boss fights for each chapter and it feels like the battles in Legend of Zelda! It involves action, puzzle-solving and patience, which is just what a hardcore game means! --OK, OK, I get it, it's Legend of Zelda in VR? Sorry but you are wrong again! It's not ripping off Zelda, instead, everything here you will see is original. Just, the developers try to mix some classic feel of Mario, Legend of Zelda, and Monument Valley into VR, with their original control scheme. But you should soon see that this make the game feel even different from those classic games when you play it in VR! Honestly I don't know how to explain it well and that's the reason why there's so much misunderstanding to it. But from what everyone says after playing it, it's a game that any curious person shouldn't miss. --Anything more? Yes, Light Tracer is on Steam now and if you want to check if we are wrong just try it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/680400/header.jpg?t=1591268200",
    "Price": 14.99,
    "Developers": "Void Dimensions",
    "Publishers": "Oasis Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/680400/ss_dcf77a7e25766b12a257df0729172647acceafd4.1920x1080.jpg?t=1591268200,https://cdn.akamai.steamstatic.com/steam/apps/680400/ss_1f736e33700e493765a500e92a118418e7fe7663.1920x1080.jpg?t=1591268200,https://cdn.akamai.steamstatic.com/steam/apps/680400/ss_453658ff2244f17ffb2365c0b9f8a0dc3a141c3c.1920x1080.jpg?t=1591268200,https://cdn.akamai.steamstatic.com/steam/apps/680400/ss_7e483ab2948dbc01bd5a6672ca1753070d72fd45.1920x1080.jpg?t=1591268200,https://cdn.akamai.steamstatic.com/steam/apps/680400/ss_ab16ddef7bc37c95d4ac321d2dec76dcd84ce5e9.1920x1080.jpg?t=1591268200,https://cdn.akamai.steamstatic.com/steam/apps/680400/ss_3aee260b29c6cc6cca6e200b9cc4f40e349e0029.1920x1080.jpg?t=1591268200",
    "Slug": "light-tracer-vr-non-vr",
    "Meta Title": "Light Tracer (VR & NON-VR): Jan 14, 2018, Void Dimensions...",
    "Meta Description": "Looking for information on Light Tracer (VR & NON-VR)? Check out the release date (Jan 14, 2018), developer insights from Void Dimensions, and a complet...",
    "Alt Text Image": "Official header image for Light Tracer (VR & NON-VR) game - Steam 680400",
    "Canonical URL": "https://gusku.site/game/light-tracer-vr-non-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Light Tracer (VR & NON-VR)\", \"description\": \"Looking for information on Light Tracer (VR & NON-VR)? Check out the release date (Jan 14, 2018), developer insights from Void Dimensions, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Void Dimensions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oasis Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/680400/header.jpg?t=1591268200\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}