{
    "AppID": 1487800,
    "Name": "Little Hats",
    "Release date": "Sep 30, 2021",
    "About the game": "Please know that the current trailer is outdated and will soon be replaced by an up-to-date one showing all the new features of the game, improved looks, and overall more smooth gameplay. Little Hats is an open-world survival game mixed with RPG elements, in which you play as a Gnome! Set in a magical world, you will have to survive, build, and explore, in order to discover the secrets of the forest and the many lands that lay beyond. The game focuses a lot on, gathering resources, building with a system that allows the player to be creative, and exploring, going on quests in many beautiful landscapes, as well as large human buildings, towns, and cities. Little Hats now also has a Passive Mode for the really young players, which will disable all monsters and scary creatures. Early Access Please know that the game is still in a very early stage and that you will more than likely encounter bugs and glitches while playing. For more information about early access, please read the section above called Early Access Game. Bugs and Glitches If you find the time, please report any bugs and or glitches that you find through Steam, or by sharing them in the discord server so that I can fix them, thank you very much! A link to the Discord server can be found in the Game Info section usually located on the right of this page. Open World Little Hats offers a big, hand-made, open world that will be expanded as the game grows. The game starts in a magical forest near a mountain range, where everything is relatively safe for Gnomes, but as you progress through the game you will have to journey further and further away from the forest into the low lands. This is where the majority of the game will take place. You will have to find, and talk to Gnomes and other creatures to receive quests, trade, upgrade and learn new abilities, in order to make progress. Beware of the Humans! some of them might help you but most will not, it is better that Gnomes remain secret to them. Most of the animals however will be happy to help you and bring you somewhere. Singleplayer, Co-op Right now I am developing Little Hats as a single-player game. I would however like to add in a Co-op mode at one point in time, I cannot make any promises yet because my first priority will be to finish and perfect Little Hats as a single-player game for the PC, it will also depend on how well the game sells, and how many players it has. Dutch Culture This game is mainly inspired by Dutch culture, yet it will not be a one hundred percent accurate representation of the Netherlands, or of Dutch culture during a specific time in history. Rather it will be a new fantasy world with Dutch culture from a number of different time periods blended together, in combination with classic fantasy elements. Dutch Folklore The most important piece of Dutch folklore used in this game is, of course, the Gnome. Besides Gnomes, there are many more magical creatures and legends from Dutch folklore that will make an appearance in the game. So what about those mountains? Those who have basic knowledge of the Netherlands, or have been there, will tell you that the Netherlands has no mountains at all, and that is absolutely right. This is where my inspiration from Anton Pieck and other artists comes into play. Anton Pieck Anton Pieck is a famous Dutch artist, most well known for his amazing drawings depicting old nostalgic scenes, mainly from the Netherlands, but also from various other countries and cultures. He is also well known for his depictions of fairy tales and his work for the Dutch theme park the Efteling. You will find that a lot of this project has been inspired by his drawings, in particular, the Gnome towns and the mountain landscapes. Gathering, Crafting, Building Building things is another big part of Little Hats. With a unique building system, you will be able to build a house brick by brick, or, plank by plank! Unless you would rather just place one entire wall at a time, you can do that as well, on top of that you will also be able to disable and enable the snapping feature, which will allow you to snap the objects right next to each other, or place and rotate them completely freely any way you like! As the game progresses, more materials and resources will be added, and with it more craftable objects to build with. I will listen carefully to the player and improve the building system based on their feedback. My goal is to give the player many options, and a lot of freedom to create amazing things. Early Access Trailer Please know that the trailer shown above is the Early Access trailer for Little Hats, and mainly shows the first part of the map in the forest near the mountains, where the Gnomes have their settlements and towns. The majority of the game is planned to take place in a much bigger area called the lowlands that will look like the Netherlands a lot more. Due to a number of reasons I had to develop the forest/mountain part of the map before the lowlands part of the map.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1487800/header.jpg?t=1652477697",
    "Price": 17.99,
    "Developers": "Tim Venekamp",
    "Publishers": "Tim Venekamp",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_6bc49c5435fbd35bfdd0adbe13ec8d61701df7bc.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_0deb2d0f6ba024336fdb2d40d84820b62d7656c6.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_86a06cf6e9a8922979228620b79e3184ecf05ced.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_672ce9bbe4f51283fe0348af35ddf1fcc4d4897a.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_5583231eda43ac2eab87087060dafed4c2c9890e.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_85eeff691d6299a35a5715206b240462814d3b9d.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_f53ebcaa21db0a12e81daf186aa13f7bffaae7f8.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_53abee3195d0239874f9e83a9ddbbdcc57c21a5d.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_76f339cfb91dd96f89b4a444c71615b30e6e3ded.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_e1a0d004dcc415567ce5eb64816bb01ae5df0a74.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_802ebbb79d7193739f569d32aba3bd8db392cbe1.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_6d240f9223636ca794ea84e2d57d2e5e797560de.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_4bd1e9ff2d03e732c7e7c25dd48eb6cc02bad9f9.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_fd23ba758b92049f98ddd7ad82acef81dca5a55f.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_c2d99901b8e9046615f6f9e5cc13a84d506a0060.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_e46228560d231ba194dda5c66e14372fc5a855d9.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_14a197f0668e153f5048d8b8115fc549a2bd4126.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_3f517aa170ddee2ba32faf29e4136a216f127df3.1920x1080.jpg?t=1652477697,https://cdn.akamai.steamstatic.com/steam/apps/1487800/ss_dce17d592ab3fbc225140912fbcc35ff272fca9f.1920x1080.jpg?t=1652477697",
    "Slug": "little-hats",
    "Meta Title": "Little Hats: Sep 30, 2021, Tim Venekamp and Full Overview",
    "Meta Description": "Looking for information on Little Hats? Check out the release date (Sep 30, 2021), developer insights from Tim Venekamp, and a complete game summary.",
    "Alt Text Image": "Official header image for Little Hats game - Steam 1487800",
    "Canonical URL": "https://gusku.site/game/little-hats",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Little Hats\", \"description\": \"Looking for information on Little Hats? Check out the release date (Sep 30, 2021), developer insights from Tim Venekamp, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tim Venekamp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tim Venekamp\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1487800/header.jpg?t=1652477697\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}