{
    "AppID": 784080,
    "Name": "MechWarrior 5: Mercenaries",
    "Release date": "May 26, 2021",
    "About the game": "BE YOUR OWN WEAPON OF WAR Welcome to the year 3015! It’s a hell of a time to be alive. Humanity has colonized thousands of star systems spanning a vast region of space known as the Inner Sphere. The golden age of cooperation and advancement is now a distant memory, and humanity has once again splintered into disparate factions all vying for supremacy. In the midst of these Succession Wars, power hungry Mercenaries like yourself are in a privileged position to capitalize big time. It’s dangerous work but that’s why you’re here, right? If you’ve got an itch to blast, wreck, stomp and go all out ballistic, step inside and become your own weapon of war! STORY As the inheritor of a once-prominent Mercenary company, reborn in the flames of its near destruction at the hands of conspiring factions, your quest for glory and revenge will stretch light-years as you chase threads of interstellar intrigue along your journey to becoming an elite MechWarrior and mercenary commander. THE INNER SPHERE Home to thousands of star systems and an array of stunning biomes, the Inner Sphere is alive with activity, purpose, consequence, and variety. Systems will be captured and reclaimed, major events will unfold, and new technologies will come to light. The rigors of war will be seen with each passing week as your relationships with the various factions fluctuate according to the relentless Succession Wars and your choices as the leader of a Mercenary outfit. GAMEPLAY The battlefields of the future are dominated by BattleMechs, hulking machines of war capable of leveling entire cities. As a BattleMech pilot you’ll rain havoc upon enemy ‘Mechs and targets, including tanks, ground vehicles, aircraft, advanced defenses, and reinforced bases. Few things can withstand the power of a ‘Mech for long, and the worlds of the Inner Sphere are veritable playgrounds of destruction awaiting your shielding defense or crushing devastation. BATTLEMECHS 'With over 50 unique ‘Mech chassis and hundreds of sub-variants, all fully-realized with high-fidelity models, damage states, and equipment, no two ‘Mechs are the same! Whether acquired from scouring the markets of the Inner Sphere for rare and valuable chassis and equipment, or salvaging directly from the wreckage of your annihilated enemies and the spoils of war, the maintenance and operation of your BattleMechs will be vital to your success both as a MechWarrior and a Mercenary outfit commander.' THE MERC LIFE Off the battlefield, as the leader of a Mercenary company you will need to manage all the key components of running a unit. You’ll need to maintain and acquire ‘Mechs and equipment, hire and field MechWarriors from throughout the Inner Sphere to join you on the battlefield, and manage your relationships with the Great Houses of the Inner Sphere, all of whom are vying for your contribution to their staggering war efforts. Of course, with each Contract comes negotiation, and with each victory comes consequence. OTHER FEATURES With the vast scope of the Inner Sphere and its complex system of world generation providing huge variety and replayability, the MechWarrior 5: Mercenaries experience offers no end. Outside the campaign, a fully-featured Instant Action system will allow you to customize and kick off isolated missions at any time, free from campaign restrictions. With four-player co-op supported both within the campaign and the Instant Action system, you can experience the full breadth of the MechWarrior 5: Mercenaries universe alongside your friends. Mods extend your game even further! Unlock the boundless creativity of the community to alter and expand the game in amazing ways. With a full editor and interface supporting gameplay mods out of the box your creativity will know no limits.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/784080/header.jpg?t=1657106132",
    "Price": 29.99,
    "Developers": "Piranha Games Inc.",
    "Publishers": "Fireshine Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_fc28a3cfc03fcde4f58f94f65dfeecfd302ccb04.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_087e39da0e8bc229aa7c24845dffab8c803e4df6.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_43dabfd854a8072b93de8bb516ea3119d3154b22.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_c3fdc0a19ef8cc710352190d83b9d8858d47553b.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_b08c959c139342246c742504129dbfdfdd38dc04.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_7ad09dce9856d392cf52fbac4602826566e66e85.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_c2ec7c5db1bdc7406ed62b60c7a67569cfbb688d.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_4d98ff9ec909e4864aa306cf1762a8a3fc92ffff.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_641f037d1b0c213d00f8bde4915e39d0d790d62d.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_a7ba0e8ec230ae81160bdc393d175be0bf0d2bd8.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_d96a359aba1223091a00e98595f2892dd7fa276d.1920x1080.jpg?t=1657106132,https://cdn.akamai.steamstatic.com/steam/apps/784080/ss_884ff57bf4a0bca9e14f29343df2d1e1b154da8b.1920x1080.jpg?t=1657106132",
    "Slug": "mechwarrior-5-mercenaries",
    "Meta Title": "MechWarrior 5: Mercenaries: May 26, 2021, Piranha Games I...",
    "Meta Description": "Looking for information on MechWarrior 5: Mercenaries? Check out the release date (May 26, 2021), developer insights from Piranha Games Inc., and a comp...",
    "Alt Text Image": "Official header image for MechWarrior 5: Mercenaries game - Steam 784080",
    "Canonical URL": "https://gusku.site/game/mechwarrior-5-mercenaries",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MechWarrior 5: Mercenaries\", \"description\": \"Looking for information on MechWarrior 5: Mercenaries? Check out the release date (May 26, 2021), developer insights from Piranha Games Inc., and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Piranha Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fireshine Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/784080/header.jpg?t=1657106132\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}