{
    "AppID": 1386340,
    "Name": "Monads II",
    "Release date": "Jan 7, 2022",
    "About the game": "The second work following ' Monads ', released in 2019. About Series ‘The ensemble about loneliness.’ Inspired by classic SRPGs, 'Monads' is a trilogy series that adds the charm of the story of colorful characters intertwining with their own views and worries to battle rules represented by tile-based turn-based battles. This series is basically a 'Tactics' game. Among the various characters, You can find the effective combination for each stage environment, and the same character also have different powers depending on which abilities you choose within a certain constraint. In addition, there are various levels of difficulty, from 'Beginner' to 'Legend', to play games according to your preference. Anyone, ranging from users who want to appreciate the story without burden to strategy game enthusiasts who love special challenges, can play this. Characteristics There are three main characteristics that distinguish 'Monads' from other games that look similar. First, units 'retreat' before they die if enough damage accumulates. a parameter named 'Will' decreases depending on events in battle, such as being damaged or friendly units being removed. This will make the unit retreat easily. Of course units can die, if you don't give a chance to retreat and do a lot of damage. In this case, the vestige remains in the tiles and lowers the will of the surrounding units, regardless of if it is friendly or not. These will require deeper thought as the difficulty increases. And 'Will' also affects 'Morale', which is a shared resource needed to use Ultimate skills. Secondly, it has the rules of puzzle game in macroscopic view. No random, so same behavior always leads to the same result, and you can revert and try different actions whenever you want. While encouraging new strategic attempts by players, the frustration from mistakes is intended to be minimized. Finally, we completely ruled out meaningless repetition. The fastest way to grow a character and gain new abilities is to just follow the scenario. But players who enjoy new attempts and challenges can retry former stages with all characters. There is no reward for repeating same play, but providing additional skill points from higher difficulty reflects the 'aesthetics of challenge', core intention of this work. Scenario Player will follow the path of the group divided into three groups. Lucius, a typical hero who lost everything overnight in a conspiracy but tried to fight back and defend justice. Deus, a mysterious sage who was considered the savior in part I, but tries to turn the crisis of being deprived of the means of counterattack and drifting abroad into an opportunity. Noel, the head of the Royal Guards, who is on the side of the empire to make the world one, desperately hopes that this war and sacrifice will be the last tragedy in history. Unlike the first part, in which each figure was in charge of a chapter, two conflicting characters per each groups are in charge of the narrative. However, it is the same that characters from different backgrounds, thoughts, and intentions influence each other and create a flow of events. We tried to give the expectations and joy of feeling the omniscient point of view of the performances of the characters struggling for the best he thought.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1386340/header.jpg?t=1643799075",
    "Price": 14.99,
    "Developers": "Team Monad",
    "Publishers": "Team Monad",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1386340/ss_ebf18c2f23ba83665c41ad83cef14362ebe67aea.1920x1080.jpg?t=1643799075,https://cdn.akamai.steamstatic.com/steam/apps/1386340/ss_e1f2514de483818302174d2cb943a417ce90300d.1920x1080.jpg?t=1643799075,https://cdn.akamai.steamstatic.com/steam/apps/1386340/ss_3fc6ce1c89849d636ef2a20d6fdc8c1a08db9b8a.1920x1080.jpg?t=1643799075,https://cdn.akamai.steamstatic.com/steam/apps/1386340/ss_63252b5507294be39f19b3a4280351fb76647a83.1920x1080.jpg?t=1643799075,https://cdn.akamai.steamstatic.com/steam/apps/1386340/ss_917f4929c2d751206b132bd54751743f5ecebadb.1920x1080.jpg?t=1643799075",
    "Slug": "monads-ii",
    "Meta Title": "Monads II: Jan 7, 2022, Team Monad and Full Overview",
    "Meta Description": "Looking for information on Monads II? Check out the release date (Jan 7, 2022), developer insights from Team Monad, and a complete game summary.",
    "Alt Text Image": "Official header image for Monads II game - Steam 1386340",
    "Canonical URL": "https://gusku.site/game/monads-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monads II\", \"description\": \"Looking for information on Monads II? Check out the release date (Jan 7, 2022), developer insights from Team Monad, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Monad\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team Monad\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1386340/header.jpg?t=1643799075\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}