{
    "AppID": 1927720,
    "Name": "Monument Valley: Panoramic Edition",
    "Release date": "Jul 12, 2022",
    "About the game": "Discover Monument Valley - A quest for forgiveness in a strikingly beautiful and mysterious world. Embark on a journey of forgiveness along with Ida, the silent princess, through impossible environments and illusionary puzzles. Experience this meditative and calming puzzle game by manipulating monuments and creating evolving paths to explore new, surreal, and mysterious worlds. Step into the new expanded world of Monument Valley: Panoramic Edition - and experience more intriguing impossibilities than ever before. The Modern Classic Comes to PC. In this multi-award-winning title, solve tricky but immensely satisfying puzzles with optical illusions at their core. Evolve landscapes to reveal paths that would have otherwise been impossible without your help. As you progress, discover beautiful architecture, transforming landscapes through pushing, pulling, clicking, raising, lowering and more. Ida is not alone in this world, and you will need to use your wits to outsmart the enigmatic Crow People who block the path from Ida quest for forgiveness. Simply Explorative Click to manipulate a beautiful variety of worlds, all built for a one-of-a-kind PC experience. Designed for players of all ages and experience levels, Monument Valley allows players to explore evolving environments, transforming scenic and visually stunning landscapes as you play. Everyone should be able to pick up, enjoy and complete Ida’s journey. This is the biggest and best way to play Monument Valley yet. Beautifully Reimagined Whether playing in Full HD, TV or on ultrawide 21:9 displays, Monument Valley looks better than ever with stunning full-screen panoramic artwork. With more perceptible visuals than ever before, what secrets will you uncover? Every World Included Monument Valley: Panoramic Edition is the total collection of all Monument Valley content - with every chapter, add-on and DLC to make this the ultimate game to add to your collection. Inspired by minimalist 3D design, optical illusions, and ancient architecture from around the world, every monument is a unique, hand-crafted world to explore. Panoramic Collection Out Now Monument Valley: Panoramic Edition and Monument Valley 2: Panoramic Edition are both available at an exclusive bundle price when purchased together on Steam. The Panoramic Collection is the best way to play the Monument Valley series - with every chapter and DLC included. ustwo games are proud independent developers, best known for the award-winning Monument Valley series, Land’s End, Assemble with Care and Alba: A Wildlife Adventure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1927720/header.jpg?t=1657629763",
    "Price": 7.99,
    "Developers": "ustwo games",
    "Publishers": "ustwo games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_319b7a1b2d7f915948b39f5a3a122ac7511215b5.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_0474efd930abd8f71baca1dd9536102c6d81df70.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_c3c31892e894f72d70f2d3ad02018678ba817093.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_ec78324ecc18d1cce20735d686aa0f5625211a20.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_747754e9b8f75a23edaef78ac878ef484e80e0a0.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_e65bb12ed5a23d5ef5289bec6b852a88d50b2c2e.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_bbf94077184d75cb5f06ae33b553a36fdc18d281.1920x1080.jpg?t=1657629763,https://cdn.akamai.steamstatic.com/steam/apps/1927720/ss_9119340ef97932c2be7226c87da94e5c62510616.1920x1080.jpg?t=1657629763",
    "Slug": "monument-valley-panoramic-edition",
    "Meta Title": "Monument Valley: Panoramic Edition: Jul 12, 2022, ustwo g...",
    "Meta Description": "Looking for information on Monument Valley: Panoramic Edition? Check out the release date (Jul 12, 2022), developer insights from ustwo games, and a com...",
    "Alt Text Image": "Official header image for Monument Valley: Panoramic Edition game - Steam 1927720",
    "Canonical URL": "https://gusku.site/game/monument-valley-panoramic-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monument Valley: Panoramic Edition\", \"description\": \"Looking for information on Monument Valley: Panoramic Edition? Check out the release date (Jul 12, 2022), developer insights from ustwo games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"ustwo games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ustwo games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1927720/header.jpg?t=1657629763\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}