{
    "AppID": 811290,
    "Name": "Project Pastorate",
    "Release date": "May 31, 2018",
    "About the game": "Premises The fragile stability is no more, so the land is crying for help. You, as one of the Devoters, are begged to restore peace and return hope to the hearts of common folk. While investigating the most hideous crimes you will also have to make some grueling choices that will inevitably affect the whole country. Outstanding hallmarks Atmospheric visuals Animated and voiced cutscenes Genuine and original characters Lifelike dialogue Immersive soundtrack Enthralling battle system Unique puzzles Multiple endings depending on your moral choices Outset On December 31, 999 AD, Pope Sylvester II, an infamous blasphemer, who received his post by beating the Devil at dice, solemnly celebrated the last Mass. The bell rhythmically tolled the last moments of mankind before the Judgment Day. “Our Father in heaven, save and protect us sinners from the infernal flames and the hellhounds that bared their fangs to tear our souls.” It didn’t help. The end of the world came right on schedule and showed no mercy. Only a fortunate few managed to escape the cataclysm on a remote and unknown island. This community subsequently spawned the first Pastor, the hierarch under whose wise government the new state grew and flourished with time. Eventually, new Pastors came, and with them changed the flock. Changed until the handmade paradise was stricken with the deafening thunderclap — a murder was committed. Then another one and another one… At that time arsons, cattle rustling and robberies began. Gradually, the darkness superseded the sunlight… Lambs grew weary of being laid under a hatchet, so they cried and crawled to their Pastor, begging the Father to hurriedly deal with the flayers, restore order in the common house. Thus, the Devoters appeared, the hope and support of ordinary people, their defenders and protectors, bringing a silver lining into the hearts tormented by injustices. There is no cold fierce enough, no heat hot enough, no storm or hurricane deadly enough to stop the Devoters from fighting the wicked with seething zeal and ready swords. They live for the sake of their people. And for the sake of their people, they would die. This is their story, unveiled and unadorned, exactly as the Pastorate chroniclers told it over many generations. ' First, love dies. Then hope is gone. There's only one thing immortal — faith. Faith will stay alive and roam the Earth forever, even after the last human's breath. The stones and the wind will treasure it until new souls come, ready for His words, eager to let them in. Thus spoke the Pastor. And our faith grew stronger. ' PLEASE NOTE that this is only THE FIRST episode of the game and the rest of the episodes will be sold separately as DLC",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/811290/header.jpg?t=1598821358",
    "Price": 1.99,
    "Developers": "PsyRob",
    "Publishers": "PsyRob",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/811290/ss_535095e3b09685848fd411c9ce17ef4b6bcbe208.1920x1080.jpg?t=1598821358,https://cdn.akamai.steamstatic.com/steam/apps/811290/ss_e58d9885d678afde0563c9448cd53b75d3c250cb.1920x1080.jpg?t=1598821358,https://cdn.akamai.steamstatic.com/steam/apps/811290/ss_f431bb1e61f90dcce619a5fb8fe8920d3cb0ccd1.1920x1080.jpg?t=1598821358,https://cdn.akamai.steamstatic.com/steam/apps/811290/ss_55c7bb79d89ec3be7d8f0bdaadf7fd681381d94b.1920x1080.jpg?t=1598821358,https://cdn.akamai.steamstatic.com/steam/apps/811290/ss_0ddb957cd2453342fe83d8c6643574fab96d3a89.1920x1080.jpg?t=1598821358,https://cdn.akamai.steamstatic.com/steam/apps/811290/ss_600d224a4a084462d596f592bd3be0e25d592f6e.1920x1080.jpg?t=1598821358",
    "Slug": "project-pastorate",
    "Meta Title": "Project Pastorate: May 31, 2018, PsyRob and Full Overview",
    "Meta Description": "Looking for information on Project Pastorate? Check out the release date (May 31, 2018), developer insights from PsyRob, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Pastorate game - Steam 811290",
    "Canonical URL": "https://gusku.site/game/project-pastorate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Pastorate\", \"description\": \"Looking for information on Project Pastorate? Check out the release date (May 31, 2018), developer insights from PsyRob, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"PsyRob\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PsyRob\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/811290/header.jpg?t=1598821358\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}