{
    "AppID": 809440,
    "Name": "Protolife",
    "Release date": "Jun 15, 2018",
    "About the game": "15 years since the first colonization parties landed on Gagarin-5. 15 years of tedious yet satisfying work on making this planet our home. I miss these years now. It all happened in mere days. The corruption spread across our lands, waves of crimson doom washed away our mushroom farms, and giant worms devoured our cities. As far as I know, only few thousands of people were able to escape into the emergency bases. Now the thing.. is dormant. It sleeps during the day, and grows only slowly over the night, filled with tumors, blights and rolling, nauseating pink lights. This small opening seems to be our only chance to fight back, to clean the planet. And we are sure to take it. Gameplay Stand to defend a distant human colony against the growing lifeform that devours everything in its wake. Build complex defenses from the simplest element possible – a single block, save few remaining settlements and clean the planetary surface from the corruption in this original tower-based RTS. Initially built for a Ludum Dare 38 game jam, it was completely redesigned, got a graphics update, tons of new content, but still works around a simple idea: build towers from blocks, contain the enemy, survive the night onslaught and strike back. Key features Unique approach to building process: Every tower is constructed from patterns of simple blocks. Build your defense grid piece by piece the way you like it, upgrade, combine, optimize space and resources to survive against the overwhelming odds. An enemy unlike usual RTS adversaries: Growing, living entity designed to exploit every small weakness in your defense. The more space it takes from you, the more powerful it becomes. Freedom of strategy and flexible defense perimeter: Go for quick low-tier tower rush or bunk with well-defended artillery posts, then collect your blocks and rebuild the defenses on the spot — just mind the free space and resources left. Direct control over the builder: Or two? Dynamically switch between several battlefronts and dominate over the enemy. Over 30 levels with variative gameplay and win objectives. Random missions generator with an adjustable difficulty level and special rewards. Custom towers editor where you can construct your own powerful weapon. Remappable keyboard or gamepad controls. Please note that the game was not designed for mouse control.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/809440/header.jpg?t=1567905277",
    "Price": 11.99,
    "Developers": "Volcanic Giraffe",
    "Publishers": "Volcanic Giraffe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_58f3bed3bd090d23589cbf73dce6eb0093a48655.1920x1080.jpg?t=1567905277,https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_1718eebe23e1afc30a25fbf03af1549a4172c94f.1920x1080.jpg?t=1567905277,https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_64082ccf5c0d19c465a7ad77bfbe325fd017fd9f.1920x1080.jpg?t=1567905277,https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_0b572098f25202e0d49f8357abae6329a8191cdd.1920x1080.jpg?t=1567905277,https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_3c3153b26aca50d8a0c47695f3cdbcd8d9dc17a1.1920x1080.jpg?t=1567905277,https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_7440f89cb8f016d67ac4d7ec5b2fda87a36287c0.1920x1080.jpg?t=1567905277,https://cdn.akamai.steamstatic.com/steam/apps/809440/ss_a557b5443d44811f1e1e6f9daea2e29d03836244.1920x1080.jpg?t=1567905277",
    "Slug": "protolife",
    "Meta Title": "Protolife: Jun 15, 2018, Volcanic Giraffe and Full Overview",
    "Meta Description": "Looking for information on Protolife? Check out the release date (Jun 15, 2018), developer insights from Volcanic Giraffe, and a complete game summary.",
    "Alt Text Image": "Official header image for Protolife game - Steam 809440",
    "Canonical URL": "https://gusku.site/game/protolife",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Protolife\", \"description\": \"Looking for information on Protolife? Check out the release date (Jun 15, 2018), developer insights from Volcanic Giraffe, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Volcanic Giraffe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Volcanic Giraffe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/809440/header.jpg?t=1567905277\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}