{
    "AppID": 1314820,
    "Name": "RealFlight Trainer Edition",
    "Release date": "Aug 13, 2020",
    "About the game": "Start your RC journey with RealFlight Trainer Edition Learn to fly with the #1 radio-control flight simulation brand in the world. RealFlight Trainer Edition is powered by the industry-leading RealPhysics™ engine, and designed by both full-scale and RC pilots. This unmatched realism makes RealFlight an essential tool for any new RC pilots learning to fly. Hone your skills in RealFlight's True-to-Life digital environment so you can pilot your physical models safely with confidence and style! Beginner Airplanes and Helicopter Included RealFlight Trainer Edition contains 6 essential trainer aircraft from Horizon Hobby. The flight characteristics are meticulously reproduced, and electronic assistance like SAFE, AS3X, and more are included on the simulated airplanes. Practice in the simulator and you’ll be ready to solo the real thing in no time. Aircraft included: Blade 230 S V2 E-flite Apprentice STS 1.5m E-flite Habu STS 70mm EDF HobbyZone Aeroscout S HobbyZone Carbon Cub S+ 1.3m HobbyZone Sport Cub S Fly at Eli Field Eli Field is a well-equipped flying field in Monticello, IL. It’s the home flying field for Horizon Hobby, and many of the aircraft in this title were developed there! With side-by-side paved and grass runways, and plenty of open space, it’s the perfect place to learn to fly. Learn from Experienced RC Pilots RealFlight's training modules help take the mystery out of flying model aircraft. An experienced pilot talks you through the use of flight assistance features and gives you the knowledge you need to succeed. Upgrade to RealFlight 9 Coming Soon When you are ready for over 150 more aircraft, more flying sites, and other features like Challenges and Multiplayer, you can upgrade to RealFlight 9. A discount is available on the RealFlight 9 store page . Controller Required RealFlight requires a controller to run and supports a large number of options: Option 1 (Recommended): For the best experience, we strongly recommend the Spektrum™ InterLink® DX simulator controller. It is specially designed for RealFlight and all your controls will come pre-configured by default. Option 2: Use your own RC Radio with an interface. The Spektrum WS2000 wireless dongle works well for this, and there are other 3rd-party wireless interfaces available. This option may require some user setup. Option 3: Use any 4-axis game controller such as a gamepad or an advanced flight stick. *Note: See the Announcements and Community Discussion for purchase links.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1314820/header.jpg?t=1658426337",
    "Price": 39.99,
    "Developers": "Horizon Hobby, LLC",
    "Publishers": "Horizon Hobby, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_e08a0c8b1a27d0220155ee4a4e2a5842f2b8e7bc.1920x1080.jpg?t=1658426337,https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_9b5339bb29948ac5642237e774d47da1159a75fb.1920x1080.jpg?t=1658426337,https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_aa8aaaccccc0f27e08acad2e0c3484adca5429ed.1920x1080.jpg?t=1658426337,https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_fd822b24bc2b9f67ab3f540089cfd1042bdbd130.1920x1080.jpg?t=1658426337,https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_d080d10898c59c2d3d6b366a305f4e1733a84d0e.1920x1080.jpg?t=1658426337,https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_fffb908809a7b3198c77c3a8514cd736efa2e6ba.1920x1080.jpg?t=1658426337,https://cdn.akamai.steamstatic.com/steam/apps/1314820/ss_6868218de5df60c07e781797d3dacb5019f048ef.1920x1080.jpg?t=1658426337",
    "Slug": "realflight-trainer-edition",
    "Meta Title": "RealFlight Trainer Edition: Aug 13, 2020, Horizon Hobby, ...",
    "Meta Description": "Looking for information on RealFlight Trainer Edition? Check out the release date (Aug 13, 2020), developer insights from Horizon Hobby, LLC, and a comp...",
    "Alt Text Image": "Official header image for RealFlight Trainer Edition game - Steam 1314820",
    "Canonical URL": "https://gusku.site/game/realflight-trainer-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RealFlight Trainer Edition\", \"description\": \"Looking for information on RealFlight Trainer Edition? Check out the release date (Aug 13, 2020), developer insights from Horizon Hobby, LLC, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Horizon Hobby, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Horizon Hobby, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1314820/header.jpg?t=1658426337\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}