{
    "AppID": 716640,
    "Name": "Sigma Theory: Global Cold War",
    "Release date": "Nov 21, 2019",
    "About the game": "STORY From the creators of the award-winning sci-fi game Out There... In the near future, a paradigm-shifting scientific discovery looms over the world, promising radical new technologies. The world’s superpowers realize they could have the power to destroy the global financial system, wipe out entire countries or even gain access to immortality. However, this discovery — called “The Sigma Theory” — can only be harnessed by a handful of scientists. You are placed at the head of your country’s Sigma division. Your objective is to ensure that it is your nation that reaps the benefits of Sigma Theory before anyone else. To achieve this you will have powerful resources at your disposal: a cadre of the world’s most elite covert agents, advanced tactical drones and, of course, your own skills in diplomacy and subterfuge. It’s a cold war out there, one in which mankind must face up to its future. THE ULTIMATE ESPIONAGE SIMULATION Turn-based espionage: Use your special agents to dominate the world. Seduction, blackmail, manipulation, industrial espionage… Every low blow is both permitted and encouraged. Dynamic narrative: Develop and manage your relations with over 100 NPCs: lobbies, armed groups, politicians… Alliance, deception or assassination, you choose. Field operations: Direct the kidnapping of your targets during gripping pursuits through the world’s greatest cities. Discretion or direct confrontation, your agent’s life is in your hands. Recruitment First, recruit a team of four special agents from 50 unique unlockable characters to support your missions. Each comes with their own story, motivations and traits that define their behavior during missions. Access the investigator, soldier, hacker, seducer and other archetypes to complete your Sigma division and execute your strategy. Espionage When your team is ready, assign them missions around the world to gather scientists, discover compromising documents on local politicians, and more. Exploit your agents’ abilities to seduce, manipulate and bribe your targets over to your side or have them neutralized. Counter-espionage Other nations will also use their agents to infiltrate your country and seize your scientists. Track, capture and interrogate them to gain information on your enemies, then exchange them for ransom when they are no longer useful. Exfiltration Order your agents to exfiltrate scientists recruited to your cause during gripping turn-based exfiltration phases through the world’s greatest capitals. Choose the position your drones wisely to support these delicate missions. Diplomacy In Sigma Theory, diplomacy is the key to achieving your goals. Meet your foreign counterparts and further your objectives using flattery, threats or blackmail. You can also recover your captured agents, advance your research, and much more. Develop your relations with powerful lobbies and armed and influential groups to obtain their favor. But be careful, they may turn on you. Tech Tree Sigma Theory is the cause of this cold war. Rally scientists from around the world to your cause to discover new technologies to gain the edge and change the world. Mind control, destabilization of the world economy, robot soldiers, immortality… Will you keep these discoveries for yourself or share them with the world? Games that inspired us: XCom, Phantom Doctrine, Plague Inc, Pandemic (board game), Rocket Ranger, Tropico, Armello, Civilization, curious expedition and so much more",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/716640/header.jpg?t=1615826756",
    "Price": 17.99,
    "Developers": "Mi-Clos Studio,Goblinz Studio,FibreTigre",
    "Publishers": "Goblinz Publishing,Fractale",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_a174a2dac17aab21c298be4e0f8bfe11995024c2.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_458b36afc8c8869d01b4c5c458901673872637d4.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_e3951cb2d3c6bc201698d5e0f736c3816d28f1e2.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_fdba19886c2f19ce1b43b086fe84e61e6e43034a.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_cfc2eb7a7519f56b4fe90138d1611949ea7dfe5c.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_da9a50e94d230ce4f6c2eae6dcfae2c7f80e214c.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_2f9779359c5cc8c7ac27490dc8482b7e7f942121.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_a87427e21c4b4ec825cffde298633e531424c787.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_99a43f6daa4f752abb853a98ade00666b51d77fd.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_a82f248eb48f677d195eb760d935ac74e49fbec1.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_1c9dacbd196ecbf0b2a4b8243645fec4adca0d07.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_d0c3e6f3660dc0e756abe05be8e11a7ae7c0e18a.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_eb36c8b24c3ed312b9b83320903cc65ff00b14b7.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_677fa76235dbfd3e12cc4a6121c460c805edc93f.1920x1080.jpg?t=1615826756,https://cdn.akamai.steamstatic.com/steam/apps/716640/ss_86f28d04123dadfd059eeaefed53d1014557a6ac.1920x1080.jpg?t=1615826756",
    "Slug": "sigma-theory-global-cold-war",
    "Meta Title": "Sigma Theory: Global Cold War: Nov 21, 2019, Mi-Clos Stud...",
    "Meta Description": "Looking for information on Sigma Theory: Global Cold War? Check out the release date (Nov 21, 2019), developer insights from Mi-Clos Studio,Goblinz Stud...",
    "Alt Text Image": "Official header image for Sigma Theory: Global Cold War game - Steam 716640",
    "Canonical URL": "https://gusku.site/game/sigma-theory-global-cold-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sigma Theory: Global Cold War\", \"description\": \"Looking for information on Sigma Theory: Global Cold War? Check out the release date (Nov 21, 2019), developer insights from Mi-Clos Studio,Goblinz Stud...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mi-Clos Studio,Goblinz Studio,FibreTigre\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goblinz Publishing,Fractale\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/716640/header.jpg?t=1615826756\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}