{
    "AppID": 1063870,
    "Name": "Solstice",
    "Release date": "May 31, 2021",
    "About the game": "Solstice is a very retro wargame, heavily inspired by the classic games Lords of Midnight, Doomdarks Revenge and Sorderon's Shadow. Solstice is not a remake of any of these games but takes its lead from these games to develop a new gaming challenge for lovers of turn-based, menu driven strategy. Displayed using hand-drawn artwork, and using a pseudo-3D technique, often referred to as landscaping, which echoes the games of the time. Set in the mythical land of Dourfrost, a land, trapped in an eternal winter, a land of fantastic beasts, magic and war, Explore and battle across an open world, populated with 11 different mythical races (at launch), and well over a hundred and twenty characters, each with his or her likes, dislikes, needs, aims, desires and loyalties that shape the game and conflicts to come. On release, Solstice will feature one very challenging, turn-based scenario, offering many hours of game-play. The Rise of the Demon King. While the lords and ladies of Dourfrost have squabbled over petty disputes and brokered and broken pacts and alliances, a dark power has been rising in the south. A power that will shake the entire land and threatens to overwhelm all that stands before it, and enslave everyone in its path. Sator Grimward, a dark sorcerer, once thought long defeated, has risen again and united the tribes of the Ice Guard. Can Calith, king of the free folk muster the lords and ladies of Dourfrost, and overcome old bitterness, to bring a force of Freefolk, Dwarfs, Fey, Sidhe, Giants, and 6 other races together to defeat the rising storm. JimJams games are a small, indie development team with a love for the retro games of the '80s and '90s. We only develop games that embrace that era, aiming to provide true classicly styled gaming, with a massive retro feel, maybe with a slight hint of what these games would have been with a little more processing power. We don't aim to develop AAA games, but simply to bring our passion for a time gone by to those who love truly classic themed and inspired games. If this is a genre and era that you love, then our games are for you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1063870/header.jpg?t=1622527740",
    "Price": 2.99,
    "Developers": "JimJams Games",
    "Publishers": "JimJams Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1063870/ss_ba51018990b0b560db990b6884e4e049e79dcd78.1920x1080.jpg?t=1622527740,https://cdn.akamai.steamstatic.com/steam/apps/1063870/ss_0fad7cd8554655a60530cc33174886b5c71e55ea.1920x1080.jpg?t=1622527740,https://cdn.akamai.steamstatic.com/steam/apps/1063870/ss_954de975028bbe046fa30103b1431130485526ea.1920x1080.jpg?t=1622527740,https://cdn.akamai.steamstatic.com/steam/apps/1063870/ss_004296670149ce1addcc5ae9e4620412079b2a9c.1920x1080.jpg?t=1622527740,https://cdn.akamai.steamstatic.com/steam/apps/1063870/ss_b1b0ca1fec882ed3cd645e87ff02f1098cb23989.1920x1080.jpg?t=1622527740,https://cdn.akamai.steamstatic.com/steam/apps/1063870/ss_ba51018990b0b560db990b6884e4e049e79dcd78.1920x1080.jpg?t=1622527740",
    "Slug": "solstice",
    "Meta Title": "Solstice: May 31, 2021, JimJams Games and Full Overview",
    "Meta Description": "Looking for information on Solstice? Check out the release date (May 31, 2021), developer insights from JimJams Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Solstice game - Steam 1063870",
    "Canonical URL": "https://gusku.site/game/solstice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Solstice\", \"description\": \"Looking for information on Solstice? Check out the release date (May 31, 2021), developer insights from JimJams Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"JimJams Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JimJams Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1063870/header.jpg?t=1622527740\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}