{
    "AppID": 1049130,
    "Name": "SPECIAL FORCE VR: INFINITY WAR",
    "Release date": "Aug 8, 2019",
    "About the game": "Scenario In the near future, the situation of the world falls into deterioration as territorial disputes for securing resources and civil war to protect the nation and religion. The military intervention in the disputed area of the United States, Russia, and other major powers continued, and China, which emerged on the strength of this powerful economic power, is also taking part in power games. It was the arrival of the so-called 'A New Cold War'. The United States felt the need for a new military paradigm for maintaining order and power, and created a Military Alliance Force (MAF), which is shaped differently from the existing Peacekeeping Force, by bringing together the countries that have maintained diplomatic ties, including the EU. Russia and China, feeling a sense of crisis, have united the South American military alliance and the Middle Eastern countries that have established a diplomatic confrontation with the United States and from the Anti-US Alliance. They advocated peace in the world and a balanced development of the world, so official military movements were impossible. However, each country needed a military organization capable of carrying out complex and diverse operations in various fields in order to protect its own interests and its citizens, and this became the main role of the Special Forces in each country. Overview PvP Competition: up to 8 players available Generalized Movement System: Free movement support using the controller buttons that become the standard of current PvP games Game Mode: Single DeathMatch, Team DeathMatch, Demolition Character: Each character provides a variety of strategic plays through unique attributes and abilities (Delta Force, Night Fox, Max, Spetznaz) Weapon: Rifle, Pistol, Grenade, Smoke Bomb Thrilling VR Experience Special Force VR: Infinity War combines VR's realistic combat style and convenience with a high level of combat experience Players can become the best Special Forces by using firearms and throwing grenades Players can defeat enemies with a variety of tactics: using various weapon combination, hiding behind obstacles, etc.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1049130/header.jpg?t=1615454646",
    "Price": 5.99,
    "Developers": "Dragonfly GF Co., Ltd.,Reality MagiQ",
    "Publishers": "Dragonfly GF Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1049130/ss_13a2f5c235cc9aed7fad55eb24c38bd49eae998d.1920x1080.jpg?t=1615454646,https://cdn.akamai.steamstatic.com/steam/apps/1049130/ss_6ee0dc442256244eba6976b885dc12cc0ff858cc.1920x1080.jpg?t=1615454646,https://cdn.akamai.steamstatic.com/steam/apps/1049130/ss_3bb91a88281bcb357ba8c88192b5014ab8ce779d.1920x1080.jpg?t=1615454646,https://cdn.akamai.steamstatic.com/steam/apps/1049130/ss_963f97fed7a14d78517c87889db094d8844ba82a.1920x1080.jpg?t=1615454646,https://cdn.akamai.steamstatic.com/steam/apps/1049130/ss_1827a26203769449099b18edef74e3f17eefc9b8.1920x1080.jpg?t=1615454646",
    "Slug": "special-force-vr-infinity-war",
    "Meta Title": "SPECIAL FORCE VR: INFINITY WAR: Aug 8, 2019, Dragonfly GF...",
    "Meta Description": "Looking for information on SPECIAL FORCE VR: INFINITY WAR? Check out the release date (Aug 8, 2019), developer insights from Dragonfly GF Co., Ltd.,Real...",
    "Alt Text Image": "Official header image for SPECIAL FORCE VR: INFINITY WAR game - Steam 1049130",
    "Canonical URL": "https://gusku.site/game/special-force-vr-infinity-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SPECIAL FORCE VR: INFINITY WAR\", \"description\": \"Looking for information on SPECIAL FORCE VR: INFINITY WAR? Check out the release date (Aug 8, 2019), developer insights from Dragonfly GF Co., Ltd.,Real...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dragonfly GF Co., Ltd.,Reality MagiQ\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dragonfly GF Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1049130/header.jpg?t=1615454646\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}