{
    "AppID": 1078370,
    "Name": "Succubus x Saint",
    "Release date": "Mar 28, 2022",
    "About the game": "Taken in by the church, Liruna has been training to become a saint. Unfortunately, when her father passes away, the role is instead given to one of her fellow trainees, and Liruna is tasked with taking part in a whole different kind of ritual. However, her misfortune doesn't end there. The ritual goes terribly wrong, resulting in a curse and a meddlesome succubus being freed alongside an army of monsters that have been sealed away for centuries! To make matters even worse, members of the church are kidnapped and imprisoned all over the world! It's up to Liruna to find the four Sealing Orbs to prevent herself from succumbing to the terrible curse the succubus laid upon her and put the monsters in their place! Join Liruna in her quest to save herself and her world! Using the church as your base, set off for expeditions to different locations across the world! There's no JRPG combat in Succubus x Saint, but you'll be tasked with avoiding obstacles around the map in real time, making for a fresh and different experience! While managing your stats, explore dungeons, avoid traps and monsters, gather items, and sell mana back to the church to buy useful gear that'll help you along the way. Make sure not to let the curse seize hold of you while exploring, or you're sure to have a hard time! Thankfully, the newly freed succubus isn't all that bad. To make exploration easier, she's hidden a variety of outfits and accessories throughout the dungeons for you to find, which will surely aid you in your goal. A succubus wouldn't lie to you, right? Survival Exploration Manage your stats while venturing out into the wild, and make sure the succubus's curse doesn't take over Liruna! Item Management Gather gear and items to help you in your mission, and make good use of everything you've accumulated to succeed. Expressive Art Sprites are layered and show different effects depending on Liruna's status, making the art feel truly alive. Difficulty Options From Easy to Lunatic, choose a difficulty that suits you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1078370/header.jpg?t=1657294268",
    "Price": 14.99,
    "Developers": "AisStew",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1078370/ss_cf7ac8d636bfe4d32710c21795e90403f9df7da1.1920x1080.jpg?t=1657294268,https://cdn.akamai.steamstatic.com/steam/apps/1078370/ss_82548211945fe8eb475e53c6863c1da53822f7a1.1920x1080.jpg?t=1657294268,https://cdn.akamai.steamstatic.com/steam/apps/1078370/ss_1b60f43a8d10309cc756cd161251582557c4d16d.1920x1080.jpg?t=1657294268,https://cdn.akamai.steamstatic.com/steam/apps/1078370/ss_c5c6196f1f6b5b3d5ce8e5e10a752a474703fedc.1920x1080.jpg?t=1657294268,https://cdn.akamai.steamstatic.com/steam/apps/1078370/ss_e506390d94d69ff704635535689e1be163a8f806.1920x1080.jpg?t=1657294268",
    "Slug": "succubus-x-saint",
    "Meta Title": "Succubus x Saint: Mar 28, 2022, AisStew and Full Overview",
    "Meta Description": "Looking for information on Succubus x Saint? Check out the release date (Mar 28, 2022), developer insights from AisStew, and a complete game summary.",
    "Alt Text Image": "Official header image for Succubus x Saint game - Steam 1078370",
    "Canonical URL": "https://gusku.site/game/succubus-x-saint",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Succubus x Saint\", \"description\": \"Looking for information on Succubus x Saint? Check out the release date (Mar 28, 2022), developer insights from AisStew, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"AisStew\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1078370/header.jpg?t=1657294268\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}