{
    "AppID": 1159430,
    "Name": "Systematic Insanity",
    "Release date": "Mar 28, 2021",
    "About the game": "Nami - a Perfect Student - receives a 'special award' on her Graduation Day - but then inherits the challenges of its illogical consequences. Her popularity.. her intelligence.. - and even her beauty - become 'gambling tokens' - in a game tailored just for her. Witness the Story of Nami as she confronts the spell of a crazy conspiracy! Will she win against the modern witchcraft of social manipulation? Systematic Insanity is like reading a novel while watching a movie. Novels are read. Movies are watched. Why not try 'reading a movie'? This Cinematic Reading Experience™ is now available on Steam! Cinematic Reading Experience® is a Signature Trademark of SECRETSOF® What Systematic Insanity OFFERS: - A way for Kinetic Novel Lovers to enjoy a 'niche' movie-like visual novel - A Cinematic Reading Experience (reading a novel while watching a movie) - A Secret Story that can be worth your time and dime - A Combination of Narrative Expression and Animated Art Sequences - An Extra Art Gallery with 15+ Art Images - with Story Trivia Information - A Bonus 'Secret Epilogue' separate from the Main Story Route - A Moral Ethical Lesson That Could Add Value To Your Life - A Rare Chance to Discover the Story of Nami - Original STEAM Version offers quality-enhancement updates. Systematic Insanity is a dramatic mystery story. As the story progresses through its final chapters and climax, the title itself - 'Systematic Insanity' - can begin to make sense. One of the Best Features of Systematic Insanity is the Story itself. Those who fully play this 'movie game' can understand its gameplay design. Go beyond first impressions to uncover its 'secret story'! Clue: The Yellow Door Nami is the heroine of Systematic Insanity. Since she excels in both academic and athletic subjects, she's considered a Perfect Student and School Role Model. Her near-perfect status, abilities and ethical values are put to the test. She never thought that her Final Exam would be on her Graduation Day! Mysterious Red-Haired Lady She is refined in taste and manner and is extremely wealthy too. Beyond these first impressions, lies a weird discovery which includes a biological secret that mirrors herself. Loraine is Nami's Best Friend. She learned to break her 'shy shell' with Nami's inspired guidance. As the School's Official Event Host, she is also fondly called MC Loraine. Her close friendship with Nami becomes a Key Link to the Story's Events. Nami in Bikini Mode. In Systematic Insanity, the heroine's 'need to wear' a swimsuit has a logical reason behind it and is actually a key point in the story's events. It has more to do with friendship, courage and sacrifice and is not just a display of beauty and sexiness. It is a noble choice. Final Notes: Summary Systematic Insanity is a movie game with a hidden story factor. If you can remember that simple joy of enjoying a story you liked, then this movie game might be worth your buy and try. If you're now curious or simply interested.. then why not play this 'movie game'? It could be that special hidden gem - YOU NEVER KNEW YOU WERE LOOKING FOR. Witness the Story of Nami. It is the Story of Systematic Insanity. FAQs Q: How I Do Pause This Movie Game? A: The Menu Button is also the Pause Button. Each Conversation Moment is a chance to PAUSE and SAVE. Q. Will there be a Sequel? A:There are no promises at this time. But the Secret Epilogue is a potential clue. Q: Why is the title called Systematic Insanity? A: As you discover the Final Chapters, it begins to make more sense. The Best Way to understand it - is to Fully Watch it yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1159430/header.jpg?t=1655099827",
    "Price": 8.99,
    "Developers": "SECRETSOF",
    "Publishers": "SECRETSOF",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_a443135f102a36d9946105d2d71a1e1004546ec7.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_515cdd12358836f28a0091af626ad45eca15bf9c.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_df0c59580b61b6bb11fde439d9b78b029bd4a9c7.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_e20d25b070db08ab3421a8a688ca9304a969a1df.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_ef6a65fd15961a33910ddb0f9f27b68e952be8fc.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_b9db29b7f638dc1a9acc6cfaccaa1585207c63a0.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_14bc7d6b3bd816903d3d73dc4d090f46124c25ac.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_8f64ba1bc0465d9f701e594fedfcfa8020b1af56.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_03f7f71af4ec8f8da51cdd89a16f29aa923c2e33.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_85ad338af11593f14ce9a526dee3704076b9137f.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_ce13f50389ac50e2b6ac7f45322aec1755ba2ecc.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_9e4f1c2343454974a34e394a195e7fdd59924102.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_5de43854469f486bd77a086d0e7a9a8af5f468a9.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_0d60198a0b7e493265ff7c88f979cd5add740bd2.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_b6330620857c5af74bdb9867afed5e92bf65f023.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_1ce61d988fa633463d17cf327321ca79b56661d3.1920x1080.jpg?t=1655099827,https://cdn.akamai.steamstatic.com/steam/apps/1159430/ss_7f2441599ff396abed59855b97fc8083063f1444.1920x1080.jpg?t=1655099827",
    "Slug": "systematic-insanity",
    "Meta Title": "Systematic Insanity: Mar 28, 2021, SECRETSOF and Full Ove...",
    "Meta Description": "Looking for information on Systematic Insanity? Check out the release date (Mar 28, 2021), developer insights from SECRETSOF, and a complete game summary.",
    "Alt Text Image": "Official header image for Systematic Insanity game - Steam 1159430",
    "Canonical URL": "https://gusku.site/game/systematic-insanity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Systematic Insanity\", \"description\": \"Looking for information on Systematic Insanity? Check out the release date (Mar 28, 2021), developer insights from SECRETSOF, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"SECRETSOF\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SECRETSOF\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1159430/header.jpg?t=1655099827\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}