{
    "AppID": 415860,
    "Name": "Tactical Craft Online",
    "Release date": "Feb 12, 2016",
    "About the game": "Dear players. Please take note that the game is quite complicated therefore requires a lot of training and patience, so I advise those that prefer simpler games not to waste their time. The game is in the pre-alpha version currently, so it is possible to see and experience a variety of bugs, balance changes and experimental mechanics. I am making the game alone, in any free time I have, so I can not always devote enough time to answer every question. The world will not be reset, so enjoy creating lasting landmarks. Thank you for understanding and I hope you enjoy the game. Online Multiplayer Sandbox meets Tactical RPG! One single massive world for all players. Full freedom of choice, interactions between players, hostilities and trading. Everyone is absolutely equal: you are what you have achieved in the world of the game. In-game items can only be crafted from resources of the game world. Single shared environment where everyone lives, builds, produces and battles. Every action affects the world story, and you can become the part of it, and start your own lasting impression! Key features: Fully generated world for research Various biomes (forest, desert, mountains, and plans are many more) Two game modes: real-time mode for mining, production, construction and other peaceful game functionality and Turn-By-Turn mode for fighting. Component crafting system. Destruction of all objects in the game world is possible. Development of various skills and parameters for a unit that the player chooses. Various effects can afflict units: fractures, poisoning, bleeding and more. Various types of bots for PVE: peaceful animals, zombies, bosses. Full player interaction in one world. Private player territory restricting access to equipment and warehouses of other players. Building various buildings from many types of resources available. Farming Trade and economy Clans and clan territories Dungeon - basements, crystal caves, glades Fishing Food and Hunger system Day and Night cycles Genetics system Weapons from World War I Repair and modification of weapons Electricity Steam Achievements Project Development Plans: Various dungeons (natural and artificial - mines, cave systems, arenas) Livestock Complex chemical mixtures for experiments New technologies and resources More Weapons from the First and Second World Wars New types of bots and bosses with different behaviors. Transport Railway Robotics Natural phenomena Radioactive zones, diseases Global events (meteoric crashes, bots invasion, bosses challenge) Trade and economic development Mail, letters, notes The development of clans. Alliances (community of clans)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/415860/header.jpg?t=1541831124",
    "Price": 0.0,
    "Developers": "Crematorium of Time",
    "Publishers": "Crematorium of Time",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_77701f968eb855f261226c736b66a28765c87cb0.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_407513282cf29e29131e7a8752f2789c4b044dcf.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_2ab1479ed411c32c49c7fc5e147db61787bba229.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_7ac37a6faae8a128f6b565d5c7f92be30ce4c300.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_0c659ec95780a141853224054b66e16534624000.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_86f6056072dd4d93dc8f75d3bfb63d24d7c9290b.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_8d116bf55af3ea87dac8dd3f97df098df0cf3077.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_067b58168797d37fce4e8e37a200309bddfb38ba.1920x1080.jpg?t=1541831124,https://cdn.akamai.steamstatic.com/steam/apps/415860/ss_ef91faca88c46300b9ce0e96590cdbd8f5c429ef.1920x1080.jpg?t=1541831124",
    "Slug": "tactical-craft-online",
    "Meta Title": "Tactical Craft Online: Feb 12, 2016, Crematorium of Time ...",
    "Meta Description": "Looking for information on Tactical Craft Online? Check out the release date (Feb 12, 2016), developer insights from Crematorium of Time, and a complete...",
    "Alt Text Image": "Official header image for Tactical Craft Online game - Steam 415860",
    "Canonical URL": "https://gusku.site/game/tactical-craft-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tactical Craft Online\", \"description\": \"Looking for information on Tactical Craft Online? Check out the release date (Feb 12, 2016), developer insights from Crematorium of Time, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 12, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crematorium of Time\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crematorium of Time\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/415860/header.jpg?t=1541831124\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}