{
    "AppID": 1851970,
    "Name": "The Last Days of Sodom",
    "Release date": "Dec 28, 2021",
    "About the game": "Play as a Fallen Angel fighting a host of Enemies through the burning Streets of Sodom, the Underworld and Third City of Hell. An exciting third-person shooter where the player will have to use intelligence as well as the trigger finger. Multiple different types of enemies. Male and female protagonists. Original Punk, Ambient and Classical soundtrack. A story based on Sumarian Legends, The Book of Enoch and other Ancient writings. This story has no beginning and no end. In the past a race of Angels, on a distant world had reached the limit of their development, they had exhausted the natural resources of their planet and had faced stagnation and decline. With their eventual decline before them they built the ship known as the Sky Citadel, a mobile space city in which they could travel across the sea of stars to find new worlds, which they could exploit and dominate, enslaving any existing populations they might find. After travelling the vastness of space and time, they came upon the Earth. A planet rich in the minerals they needed for their technology. They found vast deposits of gold deep within the subterranean caverns, a valuable resource which they hoped would be a catalyst for a renaissance of their disintegrating culture. Upon the Earth they discovered many lifeforms all of which were far more primitive than themselves, lifeforms which they could, using their science and magic, change and modify to create slaves and playthings for their pleasure and use. They took their Angel essence and mixed it with the beasts of the grasslands to create docile and willing comfort males and females to satiate their lust. They mixed their essence with the apes to create the slaves to mine minerals they desired. They used their essence with the fishes of the oceans to create the builders of the great undersea city. They created a myriad of giants, dwarfs, fabulous beautiful creatures, monsters and abominations. These creations were later to be known as The Fae. In time when the Angels had taken vast amounts of gold from the Earth, they left to continue their odyssey of conquest and exploitation, leaving 199 Angels on Earth to oversee the planet’s domination. In time the Angel overseers came to feel love for their subjects, and began to breed with them, and eventually school them in the arts of warfare, science, architecture, medicine, and aesthetics. Within time, the overseers, freed their slaves, and adopted an egalitarian societal model. Eventually the former slaves and their former overseers built vast cities together creating a paradise upon the Earth. Eventually the Sky Citadel returned after a long and unsuccessful voyage. At this stage most of the technology of the Sky Citadel no longer functioned, and all the knowledge of the home planet was now lost in the mists of time. The Angels had decided that they would now have to establish a new home upon the Earth. However the inhabitants of the returning Sky Citadel were horrified to find that the 199 overseers had created a new society and had genetically intermixed themselves with the slave races. The action the Angels took was swift and brutal. Led by the first clone of the master, the Angel Champion, the angels attacked the fabulous city of Atlantis, capturing most of the overseers, crippling their wings, torturing them, and eventually imprisoning them in the caverns of Subterrania. They then moved the Sky Citadel closer to the Earth causing fluctuations in the weather, the result of which was a global flood that wiped out the civilisation of the Overseers. Very few of the Fae survived and those that did were forced to live hidden away and in secret. The Angels re-established the old order using a newly created slave race, part Angel, part ape, to develop the science and technologies, the Angels needed to repair and develop the Sky Citadel, which by this time was little more than a floating hulk, with most of the technology no longer functioning. The original science, technology and knowledge which had been behind the building of the Sky Citadel were by this time long forgotten and lost to time. The Angels were now relying on their slaves to eventually develop an advanced civilisation which the Angels would then take control of. In the meantime deep in the caverns of the Earth, the former overseers, and now Rebel Angels, along with a few of the Fae which had survived the flood had overthrown the guard race keeping them prisoner. All of the guards had renounced their allegiance to the Angels, and had joined the Rebels. The Rebel Angels had then begun building a huge city so that they and their allies could live in comfort and safety. As the Rebels had been the Scientists, Alchemists and Thinkers of the original Angel society they were able to utilise what resources they had at hand. There were many new discoveries one of these being Brimstone Fire, the sulphuric blue energy with which they could power and light their great city, and another being Vril, the energy source which when combined with Brimstone Fire and focused through different mineral lenses could produce a super energy. With the discovery of Vril work began on the Brimstone Ray, a canon so powerful it would be capable of neutralising all of the advanced technology on the Sky Citadel. There was however a problem for the Rebel Angels, the four gems, which were to form the lenses needed for the Vril accumulators, the essential energy focusing component of the Brimstone Ray, were located in the Rebellion friendly City of Sodom on the surface above, city which was under attack by the Angel Army. The Angels had sent agents into Sodom who had learned of the existence of the gems, but not the location. They had then used ‘Rain of Fire’, a primitive but effective technology, where sulphur pellets were shot at a target from the Sky Citadel to destroy the city. Then as Sodom burned and it’s citizens were reduced to panic and madness, the Angel soldiers moved in searching for the gems. It is at this point our two heroes enter the story, a Rebel Angel foot soldier and a Dark Angel Resurrectionist. They must find the gems before the Angels do, escape the falling city of Sodom, travel beneath the Dead Sea, cross the Bridge of the Damned and enter the newly built Third City of Hell, and take the gems to the Vril multiplyers so that the Brimstone Ray can be fired.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1851970/header.jpg?t=1640730335",
    "Price": 1.99,
    "Developers": "Abomination Games,Tony McKormack",
    "Publishers": "Pagan Fire Muzick",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1851970/ss_aeebaa6a8857c2f2b12a840b4ab847873c815bb3.1920x1080.jpg?t=1640730335,https://cdn.akamai.steamstatic.com/steam/apps/1851970/ss_0e5b3d66d18cc8e5f28a6332337c14b3df19d70e.1920x1080.jpg?t=1640730335,https://cdn.akamai.steamstatic.com/steam/apps/1851970/ss_0fb8211856de39cfb846344c50754ba63f7390f8.1920x1080.jpg?t=1640730335,https://cdn.akamai.steamstatic.com/steam/apps/1851970/ss_f62dcfd7a0149d974cbf0f635eae1a74203c9097.1920x1080.jpg?t=1640730335,https://cdn.akamai.steamstatic.com/steam/apps/1851970/ss_124b9c43ee407ecefbe47620c73b9b703a27fc0a.1920x1080.jpg?t=1640730335,https://cdn.akamai.steamstatic.com/steam/apps/1851970/ss_afa0d5d09be76660e8e9f018ba976f8cc9ff7ee2.1920x1080.jpg?t=1640730335",
    "Slug": "the-last-days-of-sodom",
    "Meta Title": "The Last Days of Sodom: Dec 28, 2021, Abomination Games,T...",
    "Meta Description": "Looking for information on The Last Days of Sodom? Check out the release date (Dec 28, 2021), developer insights from Abomination Games,Tony McKormack, ...",
    "Alt Text Image": "Official header image for The Last Days of Sodom game - Steam 1851970",
    "Canonical URL": "https://gusku.site/game/the-last-days-of-sodom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Days of Sodom\", \"description\": \"Looking for information on The Last Days of Sodom? Check out the release date (Dec 28, 2021), developer insights from Abomination Games,Tony McKormack, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Abomination Games,Tony McKormack\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pagan Fire Muzick\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1851970/header.jpg?t=1640730335\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}