{
    "AppID": 1799850,
    "Name": "Transformation Tycoon",
    "Release date": "Dec 18, 2021",
    "About the game": "[18+] Transformation Tycoon is a transformation themed, tycoon-style business simulation game. You have just unlocked a patented new technique to transform people into other sexes, animals, items, mythological beings, and more. What do you plan to do with this new knowledge? Make money, of course! You have rented a small clinic on a city street where visitors can be transformed into the body of their dreams--for a price, of course! In this business simulation / tycoon-style game, you research new types of transformations to satisfy a growing pool of eager applicants. Hire employees to help you out and incentivize them with their own illustrated transformations. Take out loans to help you grow and begin advertisement campaigns to spread the word of your services. Upgrade your transformation chambers and move to larger, more prestigious locations. Grow your fame to attract applicants from local legends, Hollywood stars, and all manners of international celebrities each with their own reason for being transformed, or having others in their inner circle be transformed. Do all this to change the world one transformation at a time and become the ultimate TRANSFORMATION TYCOON ! IMPLEMENTED FEATURES: - Hire and manage employees from a unique cast of illustrated characters and perform transformation on them as their skills progress. Happy employees are efficient employees, and nothing makes them happier than giving them the body of their dreams! - Research new transformation types via paying research test subjects. - Hundreds of generated/randomized clients featuring thirteen transformation types: Feminization, Defeminization, Masculinization, Demasculinization, Feralization, Inanimation, Shrinking, Growth, Corruption, Purification, Personality, Fantasticalization, and Merging. - Story clients: repeat customers with storylines that progress alongside your clinic. - Alternate transformation choices: The transformation a client is expecting doesn't always have to be the one you're giving them! - Maintain your inventory of transformation crystals. Don't fall short of a crystal type when you need it most! - Configurable automatic inventory restocking, so long as you can afford it. - Advertise your clinic to increase application rate. - Handle Random Events that may help or hurt your finances, fame, infamy, employee morale, and more. - Employee client delegation can be enabled to auto-process already seen generated clients to help you see new characters more easily. - Relocate your clinic to attract more prestigious clients from local businessmen and women to Hollywood actors and actresses to international celebrities - Construct additional transformation chambers to process more clients at once, as well as upgrading existing ones to perform transforms more quickly and with a better chance at good results. - Take out and repay loans for temporary cash increase, but be wary of interest and daily payments! - Transformation calibration slider minigame to create skill-based transformation results for perfectionist players. The minigame can also be skipped by enabling on Autocalibration. - Rise the twelve tycoon ranks: Transformer-In-Training, Beginner Matter Mutator, Amateur Body-Morpher, Apprentice Alterator, Initiate Reengineer, Professional Remaker,Esteemed Recombinator, Metamorphosis Master, Renowned Reconstitutor, Regeneration Magnate, Titan of Transfiguration, and Transformation Tycoon! - Comes with a built-in Client Writer, allowing you to create your own generated and story clients that can be added to your game or shared with friends. We already have a number of community-written clients in the game and are always welcome to officially incorporating more! See Early Access for more information on what we still plan on adding to the game. NOTE : This game is centered around transformation themes including gender-bending (male to female, female to male, or inbetween), transformation into animals and anthropomorphic beings (anthros, furries), inanimate transformations (statues, clothing, adult toys), merging / absorption / transformation into body parts, shrinking, growth, and more. Undesired transformation themed can be disabled by simply not researching those transformation types , though game balance and content level is affected. Transformation lengths vary between a few days to being permanent, depending on the client. Be aware there are text-based descriptions of nudity and adult acts .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1799850/header.jpg?t=1656015198",
    "Price": 0.0,
    "Developers": "Blue Fairy Media LLC",
    "Publishers": "Blue Fairy Media LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_b6f4996b8c5a58f6f1f914a5b99864e08587e1d0.1920x1080.jpg?t=1656015198,https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_563feb7f2e4738dd3595a1e422513a5e025e2697.1920x1080.jpg?t=1656015198,https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_62e5b518d82c62004021e2878b22892f8b7d0293.1920x1080.jpg?t=1656015198,https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_3b77927f137fbfa32769ed789640c7d9600919a5.1920x1080.jpg?t=1656015198,https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_414919865404f4cc8118a3d413ed79af12b0af28.1920x1080.jpg?t=1656015198,https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_a571d25f0bdc9d53a695efc1a9c7f03ac1a35d86.1920x1080.jpg?t=1656015198,https://cdn.akamai.steamstatic.com/steam/apps/1799850/ss_09f5d977811650c80c73f1e9be95eb25d7b2d8d1.1920x1080.jpg?t=1656015198",
    "Slug": "transformation-tycoon",
    "Meta Title": "Transformation Tycoon: Dec 18, 2021, Blue Fairy Media LLC...",
    "Meta Description": "Looking for information on Transformation Tycoon? Check out the release date (Dec 18, 2021), developer insights from Blue Fairy Media LLC, and a complet...",
    "Alt Text Image": "Official header image for Transformation Tycoon game - Steam 1799850",
    "Canonical URL": "https://gusku.site/game/transformation-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Transformation Tycoon\", \"description\": \"Looking for information on Transformation Tycoon? Check out the release date (Dec 18, 2021), developer insights from Blue Fairy Media LLC, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Fairy Media LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Fairy Media LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1799850/header.jpg?t=1656015198\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}