{
    "AppID": 1096410,
    "Name": "Vampire: The Masquerade - Coteries of New York",
    "Release date": "Dec 11, 2019",
    "About the game": "Vampire: The Masquerade - Coteries of New York is a narrative experience set in the rich universe of Vampire: The Masquerade 5th Edition. It presents the struggle for power between two vampiric factions - the Camarilla and the Anarchs - bathed in the night lights of the Big Apple. Vampire: The Masquerade - Coteries of New York presents the conflict between two vampiric factions: the traditionalist Camarilla and the fiercely independent Anarchs among the landmarks and night lights of the Big Apple. It's a unique, atmospheric, single-player narrative experience, set in the rich universe of Vampire: The Masquerade 5th Edition. Choose one of three pre-defined characters and play as a Ventrue, Toreador or Brujah Each playable character offers a selection of powers (Disciplines), different ethical approaches to certain issues, and unique dialogue lines Character-oriented quests allow you to meet four unique non-playable characters: a Tremere sorcerer, a Nosferatu detective, a Gangrel of conflicted loyalties and a Malkavian multifoliate online personality with their own agendas. Win their hearts and minds and up to two of them will assist you in the finale Depending on your choice of the Clan you will be able to see the events from a distinct perspective. One playthrough is not enough to see all the game has to offer! Different paths leading to a grand finale that will leave you surprised and eager to see more Suitable for both Vampire: The Masquerade veterans, and fans of mature narrative-driven games who are newcomers to the setting The game does justice to the mature themes of the World of Darkness, and takes advantage of the excellent atmosphere of the source material. What is Vampire: The Masquerade – Coteries of New York ? Vampire: The Masquerade - Coteries of New York aims to translate the complex and fascinating world of vampires, their nightly struggles for power and attempts to hold on to their humanity. How do you play Coteries of New York You act as a newly-fledged vampire in New York. You have to learn what it means to be one of the Kindred in a huge, vibrant, contemporary metropolis. On your way you’ll meet different NPCs – other vampires, thin-bloods, ghouls, humans... and more. You will perform tasks that will put test your humanity and take part in a complex and often brutal struggle for power between the Camarilla and the Anarchs. You’ll interact with key NPCs - form unique bonds and relations and learn your undead companions’ deepest secrets... or see them abandon you. You’ll feast on the living and will ask yourself about the very nature of humanity. You will have to keep track of your Hunger or the Beast inside you will take over. You will make choices for the character, including which storylines to pursue and how to approach the different situations presented. You will take part in a narrative experience with branching dialogue choices, memorable characters - all among iconic locales of the Big Apple. You will be able to use Disciplines that will help you in combat and conversations, but be aware that every use of a Discipline may increase the level of your Hunger. Left unchecked, your Hunger will force you to give control over to the Beast: a dark side of your nature which wishes only to feed... no matter the cost. If it’s called Vampire: The Masquerade, does that mean you have something in common with World of Darkness, Bloodlines 2, the cult tabletop RPG system, or...? Yes, exactly! Coteries of New York is set in the same universe as Bloodlines 2, but our game offers different experiences and stories. Do you plan to expand the universe of Coteries of New York As for post-launch support, we’ll keep you updated. We would love to expand Coteries’ stories, but it depends on many factors and we do not want to over promise anything. Which platforms will Coteries of New York be available on? Coteries of New York is available on PC (Windows, Mac OS and Linux), PS4, Xbox One and Nintendo Switch in Q1 2020. Does the game support controllers? Yes! You’re able to play the PC version both with mouse and keyboard, as well as with a controller.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1096410/header.jpg?t=1643188514",
    "Price": 19.99,
    "Developers": "Draw Distance",
    "Publishers": "Draw Distance",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_41ed0251a5b70e568946db552612cce4050593e2.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_eb7b03b2783c6f9ce9e77af1c196e1be13c999df.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_cfefbf7edf7e62bc69a806ebf0372303628ff086.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_a7c9859b2076a10d661afa1f3415aaaf5cbe3ede.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_0187923895b8a901ec7e212ea1332ef65678e540.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_d51c96a6d907c02736a1206d0b201e22a864ccf9.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_62a2b271b36c87ade234f5648f642987c65d9747.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_cccebcd6b32a7bbc6586b290909b27372012a6d0.1920x1080.jpg?t=1643188514,https://cdn.akamai.steamstatic.com/steam/apps/1096410/ss_5ab2974d40df4780ad2a3907ee31c6a985e75e04.1920x1080.jpg?t=1643188514",
    "Slug": "vampire-the-masquerade-coteries-of-new-york",
    "Meta Title": "Vampire: The Masquerade - Coteries of New York: Dec 11, 2...",
    "Meta Description": "Looking for information on Vampire: The Masquerade - Coteries of New York? Check out the release date (Dec 11, 2019), developer insights from Draw Dista...",
    "Alt Text Image": "Official header image for Vampire: The Masquerade - Coteries of New York game - Steam 1096410",
    "Canonical URL": "https://gusku.site/game/vampire-the-masquerade-coteries-of-new-york",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vampire: The Masquerade - Coteries of New York\", \"description\": \"Looking for information on Vampire: The Masquerade - Coteries of New York? Check out the release date (Dec 11, 2019), developer insights from Draw Dista...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Draw Distance\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Draw Distance\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1096410/header.jpg?t=1643188514\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}