{
    "AppID": 1608400,
    "Name": "Vermillion - VR Painting",
    "Release date": "Jul 26, 2021",
    "About the game": "If you've ever watched a painter at work, you've undoubtedly felt the urge to try it for yourself. But getting an easel and expensive supplies is a serious commitment. Vermillion gives you professional oil painting equipment with all the tools you need to create beauty on the canvas, without the messy living room. You can paint seated, standing, or even lying down. Use the floating web browser to learn to paint with the full length step-by-step tutorials, alongside your favorite artists on YouTube, or project reference photos on the canvas. Vermillion features realistic wet-on-wet color mixing, undo, layers, and a wide range of simulated brushes. Developed with the feedback of both traditional and digital artists, you're sure to get the fun of oil painting without any of the frustration. Once done, share your masterpiece as an image in up to 8K. Or, create a beautifully varnished 3D model export for your VR home, Sketchfab, or VR social applications. Vermillion is a VR painting simulator, bringing the full analogue joy of oil painting into the digital world. Get the unrivaled sense of accomplishment from creating something beautiful on the canvas, without the messy living room. With the same ease-of-use as real life, it is accessible to both complete novices as well as seasoned (digital) artists. Mix up your desired color on the palette, make your mark on the canvas with the wide range of unique brushes, and get going on your first (or next) masterpiece. Note to Cosmos owners: Please follow the instructions on the support page to get your controllers working. FEATURES: Analogue color mixing Vermillion allows you to blend colors as you would with real paints. Dip your brush into multiple colors, and mix a new color by whisking the brush on the palette - and yes, yellow and blue make green! Integrated web browser with canvas projector Never painted before? No problem! The easel has a web browser right next to it, allowing you to paint along with your favorite artists on YouTube for the first time without needing physical equipment, and giving you convenient access to the internet's vast library of learning resources and reference material. Vermillion comes with an hour long in-game paint-along teaching you how to paint a cute robin - you'll hardly believe what you are capable of! The browser can even be projected onto the canvas, so you can easily trace your reference. You can also display local images on the browser. Designed for wet-on-wet painting Vermillion is made for wet-on-wet painting. It mixes color not only on the palette, but also on the canvas, allowing you to create perfectly smooth gradients with just a few strokes. Use a dry brush to blend colors further, or to move paint around to create a variety of effects from reflections to grass. Layers While Vermillion is made to be the ultimate wet-on-wet experience, sometimes you just need to paint on another layer for detail work. Which is why it's fortunate that there is currently support for four separate layers! Fine control over every mark Exert fine-grained control over your brushwork through the pressure with which you press the brush into the surface. Use the hand steadying tool to compensate for the lack of a physical canvas to rest your hand against. Distinct brushes From the two inch brush all the way down to the rigger, there's a brush for every occasion. Sharable You can export your finished painting as a 3D model to use in your VR home, share through Sketchfab, or use in social VR applications. Vermillion also offers up to 8k image export of your finished piece, which can be used for canvas prints! Made for streamers With a controllable spectator camera to offer great views of the process while streaming or recording, as well as full LIV support, you'll be sure to create amazing content. Paintings in the trailer and screenshots by David Kühnel, Chad Munn and Markus Franz.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1608400/header.jpg?t=1658756540",
    "Price": 19.99,
    "Developers": "Thomas van den Berge",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1608400/ss_b8c5cd541aa28f37fd1eb469567775c5aa75f3e5.1920x1080.jpg?t=1658756540,https://cdn.akamai.steamstatic.com/steam/apps/1608400/ss_3a6a31e094ab6a9d46170fa690e38cc8f21f0824.1920x1080.jpg?t=1658756540,https://cdn.akamai.steamstatic.com/steam/apps/1608400/ss_4797106ce024953a0be0ed0deb144e59f3235a52.1920x1080.jpg?t=1658756540,https://cdn.akamai.steamstatic.com/steam/apps/1608400/ss_070da6f12e8516326acebb7dcc240d932bdd63ca.1920x1080.jpg?t=1658756540,https://cdn.akamai.steamstatic.com/steam/apps/1608400/ss_be4be30b2772da504e12187af2c029c47b44686f.1920x1080.jpg?t=1658756540",
    "Slug": "vermillion-vr-painting",
    "Meta Title": "Vermillion - VR Painting: Jul 26, 2021, Thomas van den Be...",
    "Meta Description": "Looking for information on Vermillion - VR Painting? Check out the release date (Jul 26, 2021), developer insights from Thomas van den Berge, and a comp...",
    "Alt Text Image": "Official header image for Vermillion - VR Painting game - Steam 1608400",
    "Canonical URL": "https://gusku.site/game/vermillion-vr-painting",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vermillion - VR Painting\", \"description\": \"Looking for information on Vermillion - VR Painting? Check out the release date (Jul 26, 2021), developer insights from Thomas van den Berge, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Thomas van den Berge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1608400/header.jpg?t=1658756540\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}