{
    "AppID": 1611600,
    "Name": "WARNO",
    "Release date": "Jan 20, 2022",
    "About the game": "Are you ready to take command? Deploy into an authentic, expansive, and meticulously researched Cold War real-time strategy game with WARNO . As the spiritual successor to the acclaimed Wargame series, WARNO is the ultimate next-gen World War III battle simulator. Two years have passed since Gorbachev’s overthrow in a coup by hardline communists, and now, in the dark summer days of 1989, the Cold War finally turns hot. The armies of NATO and Warsaw Pact have deployed in a divided and tense Germany. Conflict is imminent. The only thing left is to wait for the inevitable Warning Order that will begin it all. War is coming home, commanders… WARNO - Warning Order - lets you command your customized battlegroup and lead hundreds of Cold War-era units to victory on dynamic, tactical battlefields. Choose between the arsenals of NATO or the Warsaw Pact, and fight across a multitude of solo and online modes against challenging AI or human opponents in massive 10v10 battles. Show your mettle as a strategic commander in the turn-based Army General campaigns depicting a devastating, techno-thrilling World War III in Western Europe. Take Command of Your Battlegroup The Cold War-era armed forces of six nations - aligned to NATO or Warsaw Pact - can be led into a hyper-detailed World War III: U.S., West Germany, United Kingdom, and France square off against the Soviet Union and East Germany. From conscripts and main battle tanks to mobile SAM systems, self-propelled artillery, scout helicopters, strike aircraft, and fast interceptors, each WARNO nation has its unique arsenal of vehicles, planes, and soldiers. More than 600 different military units are featured, such as the mighty M1A1 Abrams , the British MCV-80 Warrior , French Gazelle scout helicopters, German Leopard tanks, Spetsnaz special forces, SU-25 Frogfoot , the East German KPz T-55AM2 or Mil Mi-24 Hind helicopter gunships. In the Armory, each unit can be inspected and compared in detail. An array of famous military formations and brigades, each with their unique identity, act as the parent division of your personal battlegroup. Use the units available, choose your economy of forces, and customize your troops in WARNO’s enhanced battlegroup building system. A New Dimension to War Experience 4 massive turn-based strategic Army General campaigns centered on the NATO’s CENTAG and Warsaw Pact’s Central Group of Forces area of responsibility in 1989, placing you right in the heart of the war near the infamous Fulda Gap. The Army General campaigns let you command hundreds of units and military formations, down to the platoon level, including the U.S. 11th Armored Cavalry Regiment and 3rd Armored Division, West German 5. Panzerdivision, Soviet 79th Guards Tank Division and 27th Guards Motor Rifle Division, and the East German 7. Panzerdivision. New scripted Operations will allow you to undertake daring tactical combat missions that tell captivating stories of an all-too-real conflict. Immerse Yourself Witness an ever-evolving battlefield that never looked more beautiful, from the detailed environments to the brutal destruction unleashed. The latest incarnation of Eugen’s proprietary engine simulates modern land and air combat in Western Europe to the fullest extent. The maps are rich with tactical options and objectives, from hills, small villages, dense forests, meandering rivers, bridges, and industrial zones to be captured. Be wary of ambushes or outflanking maneuvers as you continuously advance the dynamic frontline that contributes to a side’s victory or defeat. Lead your chosen battlegroup into battle as an expert commander, taking advantage of all the available tactical tools. Combat in WARNO is an all-encompassing contest of smarts, tactics, and mastery of your units. Combat Evolved Take to war across a wide variety of game modes, including stand-alone Skirmish missions playable in solo, cooperative, or multiplayer. Battle against an enhanced and challenging AI or pit your tactical prowess against other human players, in intense ranked 1v1, 2v2 to 4v4 team matches to all-encompassing 10v10 battles. Take advantage of a host of quality-of-life enhancements catering to new players and veterans of Eugen Systems’ previous titles. This includes issuing commands during pre-combat deployment, Rules of Engagements, AI-assisted Smart Orders, and much more. WARNO in Steam Early Access will be constantly updated with new content, including new features, mechanics, units, scenarios, campaigns, and more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1611600/header.jpg?t=1655374011",
    "Price": 39.99,
    "Developers": "Eugen Systems",
    "Publishers": "Eugen Systems",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_41c049fec5049ee8ee574ab10aa413d887ec7ae3.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_e717794984190d4ef45a2d86a27c58e35e42ec0b.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_e8399362a910cc9c6532524c6a0d8d42b7d83640.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_322d9614ace65cf2b257df368e11b157e3dbe1d6.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_91a6f61f3f6638d03176f5e97fb9a0bb6cf01f26.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_1af0ef79af128c7150dc564938223b433d352699.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_07495062fa9aecfd3c3380827e7bd673ba2755ad.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_ab39c77b4a22ad4bb5aa72422ea4acc816976469.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_1e6685b4351e0b05b97bc686f8a4639471226c01.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_1127abc34d407f25fd7cbe25a2337a09bfb2e222.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_e38bcdbf18aab80870eece6d43851c404cf93ee7.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_cf13b4655abc969b75a5b37d0f75290632fc2c13.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_c31374dc5cdf05409f4f8b1f1c22b5e0d85a0282.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_1ddccb599c6dc7d8964b16bca1b790d26184fa36.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_f3a9ca3a5562f1937df7577132c34ae2ae96a39d.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_5e5df000909e0fa78a8295171787614c2cf67abe.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_f618835638f8ea792ec4da04e5bc528c2c5833ff.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_24fe46e2dc0333f018f1a62aded028c35b6d4aa4.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_dd03f655bc31aaac0ab70b994e4122718e1ea3e5.1920x1080.jpg?t=1655374011,https://cdn.akamai.steamstatic.com/steam/apps/1611600/ss_6bcb83b4575c5f5af666ae17d0328d29182dc293.1920x1080.jpg?t=1655374011",
    "Slug": "warno",
    "Meta Title": "WARNO: Jan 20, 2022, Eugen Systems and Full Overview",
    "Meta Description": "Looking for information on WARNO? Check out the release date (Jan 20, 2022), developer insights from Eugen Systems, and a complete game summary.",
    "Alt Text Image": "Official header image for WARNO game - Steam 1611600",
    "Canonical URL": "https://gusku.site/game/warno",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WARNO\", \"description\": \"Looking for information on WARNO? Check out the release date (Jan 20, 2022), developer insights from Eugen Systems, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eugen Systems\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eugen Systems\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1611600/header.jpg?t=1655374011\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}