{
    "AppID": 398150,
    "Name": "Ace of Protectors",
    "Release date": "Jun 27, 2016",
    "About the game": "'Can you see this?! I can't believe it! According to the legend of the Venux, You will be the Ace of Protectors. That means, You're the only hope to save our world, Ace of Protectors.' There is a fantasy world called as the Venux. The Venux is a different-dimension world from the Earth. One day, 'Master', who is only the god in the Venux, She recognized that devils were coming to destroy the Venux. But humans in the Venux didn't have enough power to defend the Venux from devils. However, she also knew the legend of the Venux. According to the legend of the Venux, there was a hero called as 'Ace of Protectors'. 'Ace of Protectors' will come back to the Venux to defend the Venux from devils. People in the Venux don't know who Ace of Protectors is. But, certainly, Ace of Protectors will come back soon... ◆ Two characters to save the Venux world - There are two characters to save the Venux. One is 'Estel', a man who's a special force member called 'specialist' in the Earth. However, during doing one mission, he came to the Venux by unknown power. Another is 'Yuri', a girl who is an elite protector in the Venux. She's leading all of protectors and protecting Master. You will control two characters. ◆ A hero to save the Venux. - Devils are coming to destroy the Venux! They are trying to revive their lord, 'Dark Lord'. The Venux will be in danger when he revives. However, According to the legend of the Venux, there was a hero who was called as 'Ace of Protectors', and was died with the Dark Lord long time ago. The legend says, Ace of Protectors will come back when the Venux is in danger. But anyone don't know who they are. Only one thing is certain, Ace of Protectors is coming back to the Venux... ◆ The Venux world is with you. - There are 40+ side quests and 50+ gears for each of your characters. Craft special gears! Special Gears are much stronger than Normal gears. Don't forget to help your friends! By clearing your friends' quests, you'll get rewards and special access to craft special gears and your friends will like you. When they start to like you, they may give special gifts to you! ◆ Levels, stats, and Skills to make you stronger. - Your characters must be stronger than now to fight devils. Take down your enemies, craft special gears, help your friends, and use your skills. Do your best to save the Venux. Experience you earn will make your characters get more power. ◆ Save and load your journey. - You are able to save and load your journey. Steam Cloud lets you save and load your data easily wherever you are. Keep your progress. You can play your saved data in both Windows and Linux. ◆ Intels, Steam Achievements, and Steam Trading Cards. - Collect Intels which help you to understand the game. There are many achievements for you. Try to achieve them and get special rewards. 'Ace of Protectors' supports both Steam Achievements and Steam Trading Cards! ◆ 'Ace of Protectors' supports gamepad controllers. - You can enjoy 'Ace of Protectors' by using gamepad controllers! X-input based controllers like Steam Controller and X-Box Controller are available to use.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/398150/header.jpg?t=1572138304",
    "Price": 1.99,
    "Developers": "xPathfinder",
    "Publishers": "xPathfinder Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/398150/ss_c9a005e09941038c514e4409ba7c753543e015d2.1920x1080.jpg?t=1572138304,https://cdn.akamai.steamstatic.com/steam/apps/398150/ss_2d1fdb814db301d887a4c184661cea32e856eff7.1920x1080.jpg?t=1572138304,https://cdn.akamai.steamstatic.com/steam/apps/398150/ss_9185a190742822d5140f16afdfb759423e9b1911.1920x1080.jpg?t=1572138304,https://cdn.akamai.steamstatic.com/steam/apps/398150/ss_8f4aa7f27ecf58a6b95b333d87dcaf9748869bc8.1920x1080.jpg?t=1572138304,https://cdn.akamai.steamstatic.com/steam/apps/398150/ss_d4a427ad32ab63a6e518d37f876d156f64916e2d.1920x1080.jpg?t=1572138304,https://cdn.akamai.steamstatic.com/steam/apps/398150/ss_2485efda3bca09cf95dfd1248b4fb4ead9cf3261.1920x1080.jpg?t=1572138304",
    "Slug": "ace-of-protectors",
    "Meta Title": "Ace of Protectors: Jun 27, 2016, xPathfinder and Full Ove...",
    "Meta Description": "Looking for information on Ace of Protectors? Check out the release date (Jun 27, 2016), developer insights from xPathfinder, and a complete game summary.",
    "Alt Text Image": "Official header image for Ace of Protectors game - Steam 398150",
    "Canonical URL": "https://gusku.site/game/ace-of-protectors",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ace of Protectors\", \"description\": \"Looking for information on Ace of Protectors? Check out the release date (Jun 27, 2016), developer insights from xPathfinder, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"xPathfinder\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"xPathfinder Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/398150/header.jpg?t=1572138304\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}