{
    "AppID": 431950,
    "Name": "Age of Fear 4: The Iron Killer",
    "Release date": "Apr 30, 2021",
    "About the game": "In the years following the conclusion of AGE OF FEAR 3: THE LEGEND , a surging tide of criminal activity has thrown the realm into disarray. The rival gangs of the Iron Five have risen to prominence, leaving little in the way of peace or security in King William's lands. It's in this climate that the recently-graduated Vampire Hunter Angela embarks on a quest into corruption and murder after her inaugural hunt takes an unexpected turn. Along with her companion Nazell, Angela will go head-to-head with the criminality that threatens to sink the realm into its deepest Age of Fear! AGE OF FEAR is a long-running series of fantasy turn-based strategy games loved by fans for its tabletop wargame battle system and in-depth RPG customization. Age of Fear 4 is the latest addition and offers a lengthy, story-driven campaign complete with many new twists and enhancements to the series' trademark gameplay! (scroll down for a list of features) FEATURE LIST ⭐ HUNT FOR CLUES - play as a detective in a non-linear, high fantasy murder mystery with major choices to make! Experience a plot full of intrigue, humour and familiar faces! ⭐ CRAFTING - collect ingredients from enemies and environment, and craft all the most powerful artifacts! ⭐ INVISIBILITY - are you tired of enemies seeing all your moves? Cast a spell and whoop... you disappeared. However, the AI can do it too. ⭐ HEX-FREE BATTLES - test your tactics with a novel movement system where size matters and units aren't constrained by artificial grids! ⭐ OPEN WORLD - are you bored with the main storyline? No worries, you can always take a side-quest or play procedurally-generated battles. Play this game as you want! ⭐ GLOBAL EVENTS that occur while exploring the World Map, à la Battle Brothers. This feature is still being developed and could serve to provide more lore and fun unit interactions conditional on the player's party! ⭐ FACTION BASES which can be upgraded as you explore the Age of Fear world. Investing in base upgrades will unlock additional recruitable units, skills and locations to explore! ⭐ MERCENARIES - recruit your troops from multiple races and factions! Will a Dwarven Warrior work with a bloodthirsty Orc? ⭐ ALIGNMENTS such as Evil and Holy. Units from opposite sides won’t like each other and may desert. A bit of diplomacy (or charisma!) is needed to manage such relationships. ⭐ EXTENDED STORY including many sub-quests, optional events, alternative endings, more detailed lore, etc. ⭐ FREQUENTLY UPDATED - we take our work seriously and patch our games often with new features and content. Also, whenever possible, those updates are back-ported to all our previous games! ⭐ COMMUNITY-DRIVEN - we listen to our players and continuously improve! Go and check our forums, everyone has their say and we implement those suggestions. ⭐ FULL OF JOKES - who said strategy games have to be serious? All the best fantasy jokes have a home here! ⭐ PARTY CUSTOMIZATION - build and upgrade a custom army from more than two hundred unique units, skills and spells (but be aware of racial animosities!). ⭐ DEEP BATTLE MECHANICS - learn the basics in a hurry, then develop new strategies around a huge variety skills, spells and battle hazards like neutral factions and environmental effects (yes, you can anger bystanders!). ⭐ EASY TO MOD - create your own missions, or even full-fledged campaigns, to be shared with the Steam community! ⭐ FANTASY STORYTELLING - get wrapped up in a spectacular storyline featuring a motley crew of characters, globetrotting adventures and fantasy shenanigans galore. All hand-illustrated! ⭐ PERMANENT DEATH - accept the grim realities of death where all units that fall in battle stay dead... unless an evil Necromancer raises them as Zombies. ⭐ ARTEFACTS AND RELICS - discover numerous unique weapons, armours, potions and treasures, with the rarest granting powerful OP skills and stat bonuses. ⭐ ADVANCED AI - our AI is built upon a self-organizing network of agents and meta-heuristics algorithms (yes, we are PhD-smart!). Discover one of the most sophisticated AI systems you've ever played against! ⭐ LOW HARDWARE REQUIREMENTS - run the game even on that old potato laptop of yours. Your stone-age computer is good enough! ⭐ COLOR-BLIND MODE - a special mode with higher contrast and outlined fonts. ⭐ ...everything else we come up with! Purchase only if you want access to the latest features in the Age of Fear series, and please keep in mind that this is an evolving product. If you're hungry for a no-nonsense, old school turn-based strategy game, you've met your match in the Age of Fear series. Enter the fantasy world of Age of Fear today!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/431950/header.jpg?t=1658180043",
    "Price": 14.99,
    "Developers": "Leslaw Sliwko",
    "Publishers": "Age of Fear",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_2c54c61dd2cb2d9605fadc1de9a64a3d889472d8.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_6ab72a9b773ee438890defa9d030e382fd67dea0.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_4368a030c86a574a6f3a5505446003bb5abab9ed.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_ef2b5e5d6b98c05f9c273e38ec199b3c7aab4591.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_02c143862f66638ce4f3fc5b243ae83d7f8d71f5.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_20771769d89ee0c8279b72c44b18f35b943caae3.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_79cce5c3515d94206a009afc64451166a8c02436.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_edaa042a4317e434bad1359ea8d4ddc4aa00969d.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_b8950bb37f401809a7ff41935795b465b869f7a7.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_6588c2c5dc60ad7ca37695fd17c14b96c14687ba.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_fe82d029ce0912f8a8cf2a89c8180f9bde8b9cf7.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_27c62a37cb6c297ec2c0088f88d874dc6d46d328.1920x1080.jpg?t=1658180043,https://cdn.akamai.steamstatic.com/steam/apps/431950/ss_7e6ec5abf9ad57948c406f79d125838a72fbb0e5.1920x1080.jpg?t=1658180043",
    "Slug": "age-of-fear-4-the-iron-killer",
    "Meta Title": "Age of Fear 4: The Iron Killer: Apr 30, 2021, Leslaw Sliw...",
    "Meta Description": "Looking for information on Age of Fear 4: The Iron Killer? Check out the release date (Apr 30, 2021), developer insights from Leslaw Sliwko, and a compl...",
    "Alt Text Image": "Official header image for Age of Fear 4: The Iron Killer game - Steam 431950",
    "Canonical URL": "https://gusku.site/game/age-of-fear-4-the-iron-killer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Age of Fear 4: The Iron Killer\", \"description\": \"Looking for information on Age of Fear 4: The Iron Killer? Check out the release date (Apr 30, 2021), developer insights from Leslaw Sliwko, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Leslaw Sliwko\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Age of Fear\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/431950/header.jpg?t=1658180043\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}