{
    "AppID": 963300,
    "Name": "Angel, Devil, Elf and Me!",
    "Release date": "Nov 7, 2018",
    "About the game": "Ayumu is just your average bachelor until out of nowhere three gorgeous women from a fantasy world burst through a portal into his living room. It turns out our 'normal guy' Ayumu is somehow the descendant of a legendary Hero and of course, any children he has will be incredibly powerful! Join Ayumu as his everyday life is turned upside down while beautiful girls from across dimensions battle it out for his 'essence'! Ayumu, not being the type who enjoys seeing these lovely ladies tear each other (and his house) apart, steps in. He pleads that they not fight over him, the three decide it is up to Ayumu to choose one among them to become his bride. Each girl puts their 'gifts' on display in an attempt to win him over. Rizabel a saucy succubus princess of hell who wants to seduce Ayumu so she can have powerful children that rule over hell. Elysia, the motherly angel, wishes to marry Ayumu to prevent his overwhelming essence from falling into the wrong hands. She takes a more soothing, pampering approach. She really takes care of Ayumu and that precious 'essence'. Hilda the leader of a clan of Dark Elves hopes to marry Ayumu so that his offspring will provide her with a strong warriors in the future. She has a very stoic demeanor but she's a novice when it comes to romance and her awkward attempts to woo Ayumu might just do the trick. Entrench yourself in the tale of an unlikely Hero's descendant who finds himself beset by bombshell beauties from another world as he tries to figure out just how he is going to handle this with these three other-worldly women and lead a happy married life. Translated version of the original Japanese Visual Novel Original artwork HD upscaled with 16:9 and 4:3 variants Hours of story content Main female characters fully voiced with original Japanese dialogue Enhanced with character sprite animations Gallery and Scene selections Angel, Devil, Elf and Me! is the English localization of a Visual Novel originally created by prolific Japanese developer Norn/Miel. We at Cherry Kiss aim to provide an authentic Japanese Visual Novel experience to gamers outside of Japan. ** PLEASE NOTE ** All characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/963300/header.jpg?t=1649036398",
    "Price": 11.99,
    "Developers": "Norn",
    "Publishers": "Cherry Kiss Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_41534d2bf31905b13a5810f97b1d6173a912830c.1920x1080.jpg?t=1649036398,https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_75cd6b3cb83c8e25b9de31230cf612279c110c17.1920x1080.jpg?t=1649036398,https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_67406e9ae84834115e10c5760fecbc7b3eda34db.1920x1080.jpg?t=1649036398,https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_d4809ac39f4da3d6187b2375804edab68af4cc69.1920x1080.jpg?t=1649036398,https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_4dbda05854da9bce7265d43caf65d397fc4d1e68.1920x1080.jpg?t=1649036398,https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_95863057790c7589f1bbf0964df6d79c14b78563.1920x1080.jpg?t=1649036398,https://cdn.akamai.steamstatic.com/steam/apps/963300/ss_031982de23a426d2fb098ae4ba086a246ddc9b9c.1920x1080.jpg?t=1649036398",
    "Slug": "angel-devil-elf-and-me",
    "Meta Title": "Angel, Devil, Elf and Me!: Nov 7, 2018, Norn and Full Ove...",
    "Meta Description": "Looking for information on Angel, Devil, Elf and Me!? Check out the release date (Nov 7, 2018), developer insights from Norn, and a complete game summary.",
    "Alt Text Image": "Official header image for Angel, Devil, Elf and Me! game - Steam 963300",
    "Canonical URL": "https://gusku.site/game/angel-devil-elf-and-me",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Angel, Devil, Elf and Me!\", \"description\": \"Looking for information on Angel, Devil, Elf and Me!? Check out the release date (Nov 7, 2018), developer insights from Norn, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Norn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cherry Kiss Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/963300/header.jpg?t=1649036398\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}