{
    "AppID": 1627110,
    "Name": "Blowjob Simulator",
    "Release date": "May 24, 2021",
    "About the game": "Join Our Discord: Blowjob Simulator is a blowjob simulation 'game' that gives you a fully customizable photo-realistic woman that performs oral sex. With modes such as manual mode, which allows you to control her head with the mouse, and auto mode, which will make her automatically perform, you can adjust your experience to your liking. There are also a large variety of customization options, with more on the way. Some of the features that are in the current state are: - Mouse-Based Blowjob Movement (Manually control the blowjob with your mouse) - AI Blowjob (Varying Stroke Lengths &amp; Speed) - Auto Blowjob (Hands-free mode) - Body Color Adjustments - Eye Color &amp; Brightness Adjustments - Hair Adjustments - Hair Color &amp; Brightness Adjustments - Breast Jiggle Physics - AI-based Blowjob Movement - AI-based Eye Movement - Blowjob Speed Adjustments - Camera Switching - Camera Auto Cycling (Auto Cycles between the different preset cameras.) - Penis Color Adjustment - Orgasm Hotkey (Facial &amp; Deepthroat) - Breast, Weight, and Waist Size Adjustments - Graphics Adjustment Settings - Keyboard, Mouse, and Gamepad Controls - Moonlight Compatibility For Streaming To Your Phone PRE-PURCHASE WARNING: This game is not suited for anything below the minimum required computer specifications. This game is extremely graphically intensive, and while we've provided many graphics adjustments to make it work properly on lower-end systems, it may not function as intended without proper hardware. This game contains photo-real and high poly assets, and features realistic hair that eats up a lot of processing power. Some hair assets are optimized better than others, and will improve frame rates, so keep this in mind. We are constantly working to optimize the game to make it quality and playable with a GTX 960 and up! Heads Up! This is not currently intended to be played like a game. There is no story line, there are no point systems, there are no achievements, in the end result it's meant to be played hands-free whilst you.. Do other things.. There may be a point in the future where game-like features are added, but for now it's a simulator. Please do not purchase this if you are seeking anything other than a simulator, I do not want anyone spending money on something they won't enjoy! All of the games up-to-date features can be viewed in the video before purchasing, there is nothing not shown in the video that is in the game! Thank you for your support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1627110/header.jpg?t=1647994230",
    "Price": 4.99,
    "Developers": "NSFW Sims",
    "Publishers": "NSFW Sims",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1627110/ss_6bf959baf9e6fce1996fb5452e51983ef3ce3c0e.1920x1080.jpg?t=1647994230,https://cdn.akamai.steamstatic.com/steam/apps/1627110/ss_04d929751f0d9f87c488d03cc046012dfadb4b92.1920x1080.jpg?t=1647994230,https://cdn.akamai.steamstatic.com/steam/apps/1627110/ss_869648ea0e16e5d4cebc59af85a7f225e5fd5a09.1920x1080.jpg?t=1647994230,https://cdn.akamai.steamstatic.com/steam/apps/1627110/ss_f9abf1962cd04df1e22df773f8dc002ea550b99a.1920x1080.jpg?t=1647994230,https://cdn.akamai.steamstatic.com/steam/apps/1627110/ss_f75add385a5e16579c9ebd43668109686bd2fcb1.1920x1080.jpg?t=1647994230",
    "Slug": "blowjob-simulator",
    "Meta Title": "Blowjob Simulator: May 24, 2021, NSFW Sims and Full Overview",
    "Meta Description": "Looking for information on Blowjob Simulator? Check out the release date (May 24, 2021), developer insights from NSFW Sims, and a complete game summary.",
    "Alt Text Image": "Official header image for Blowjob Simulator game - Steam 1627110",
    "Canonical URL": "https://gusku.site/game/blowjob-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blowjob Simulator\", \"description\": \"Looking for information on Blowjob Simulator? Check out the release date (May 24, 2021), developer insights from NSFW Sims, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"NSFW Sims\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NSFW Sims\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1627110/header.jpg?t=1647994230\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}