{
    "AppID": 987150,
    "Name": "BMX The Game",
    "Release date": "Aug 28, 2020",
    "About the game": "Description: BMX The Game is the new era for BMX games . Made by a passionate team of this sport which wants to deliver the game that the BMX community deserves . The main game mechanic of BMX The Game consists of performing tricks and acrobatics with the bike while roaming freely around the Barcelona city , providing different scores according to its complexity and difficulty. Game Features: Realistic Physics: Making the rider, bike and objects behave and react as in real-life situations, emphasizing the pace and beauty of BMX. Freeride: Roam the City freely, performing tricks and acrobatics without limitations. Just as in real life! Famous BMX Spots &amp; Bike Parks: In addition to some of Barcelona City’s BMX Spots, the game will also recreate some real places and indoor and outdoor parks from all over the world that are iconic within the extreme sports scene. Intuitive Gestural Control System (IGCS): Real-life BMX riders have a vast array of different tricks. BMX The Game allows performing different tricks and its multiple combinations thanks to its Intuitive Gestural Control System, using the game controller analogue sticks (Dual Analog gamepads are required). That completely differs from the traditional system of pressing buttons to do tricks. Personalized Characters: Players can make their avatars unique, choosing from a wide range of physical attributes. Select the gender of their own rider avatars, customizing their appearance through the editing of their different physical attributes (face, hairdressing, body types,...). Bike Editor: Customize the visual aspect of the bike (colours, stickers, props,...) and also its parts (wheels, pedals, seat, …), which affects its attributes to better suit different playing styles. Clothes Editor: Personalize your clothing style (caps, shirts, sneakers, trousers...) and stylish cosmetic elements within a wide variety that will also grow with more content. Replay Editor: The game constantly records the last 60 seconds of gameplay. Players can access at any given moment this simple yet powerful editor, to set cameras and their movement paths at different keyframes, creating spectacular video sequences, ready to share with the game’s Community and Social Networks. You could take a screenshot too! Powerful Park Editor: Through the use of a simple but powerful set of park editing tools, create incredible parks to ride. The Props Library provides loads of different items (ramps, half-pipes, benches, …) to further decorate and make unique BMX Parks play alone or share with the Community. Parks shall be outdoor or indoor, and users may choose among different size templates to start editing. Construction Mode/Props Placer: As you can do on Park Editor, move, delete or place any prop in the game to build new BMX Spots in the City, which can be then played alone or shared with the Community. Expansion &amp; Evolution: Through new updates, along time, will offer exclusive and attractive contents and new game modes, more city and incredible parks, cool clothes and customization, setting the ground for future content expansions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/987150/header.jpg?t=1611741754",
    "Price": 24.99,
    "Developers": "Barspin Studios",
    "Publishers": "Barspin Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_0bc858b56339ba98ef0283c33aa0cafc37832007.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_d8f25774a87d4328022612965f3467b3ecb364ed.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_4c0d2b6779eb911d49c104fe67c3a203ecedb9ec.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_2c6bb08339c3215763bb073c0240ee04ef18c1b4.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_fb4479b07c4aff48358ba9e732ded5dd32765a3c.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_5b70b13bee3317c30b1315d37fbd91f27920ce1d.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_26807e18dc48ed320b68de48d009866ff3e64bae.1920x1080.jpg?t=1611741754,https://cdn.akamai.steamstatic.com/steam/apps/987150/ss_d3478787ee628154e23232d4fc0e0201dd6a4dea.1920x1080.jpg?t=1611741754",
    "Slug": "bmx-the-game",
    "Meta Title": "BMX The Game: Aug 28, 2020, Barspin Studios and Full Over...",
    "Meta Description": "Looking for information on BMX The Game? Check out the release date (Aug 28, 2020), developer insights from Barspin Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for BMX The Game game - Steam 987150",
    "Canonical URL": "https://gusku.site/game/bmx-the-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BMX The Game\", \"description\": \"Looking for information on BMX The Game? Check out the release date (Aug 28, 2020), developer insights from Barspin Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Barspin Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Barspin Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/987150/header.jpg?t=1611741754\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}