{
    "AppID": 965210,
    "Name": "Café International",
    "Release date": "Jul 1, 2021",
    "About the game": "A fun and challenging strategic board game. The legendary game (Board Game of The Year 1989 Germany, over one million sold) is back, a fun and challenging strategic board game! Using the officially licensed caricatures from the original board game, you'll find that not every guest wants to sit next to each other in Café International. So it's up to you to keep everyone happy, by seating them at the right tables, according to their nationality and gender to score maximum points. Every puzzle fan will simply love Café International! Although the rules are straightforward and the game is easy to play, it's sure to challenge even the most strategically gifted minds. To be awarded maximum points, you'll need to clear as many tables as possible by really thinking about where to seat your randomly chosen guest cards... In classic mode you can play against up to three players either human in a local multiplayer game or computer opponents that play in one of three different difficulty settings, providing a challenging strategy. Play with friends over the Internet via 'Steam Remote Play Together'. If you have activated an audio channel to your friends, it is almost like sitting around the table together. With the right move, you can even trigger a scream or two from your opponents! For an optimal adaptation, we blended the most popular rules of the boardgame and the cardgame to a great new playing experience. With a medium-sized and variable floorplan, this version offers not only the best possible overview about the available tables, but also revives all the well-known elements of the boardgame, like the bar and the Jokers. Features Strategically place international guests at tables to earn points Quick tutorial for an easy start Help function for when you need visual clues Choose from Solitaire, Classic or Time Game Local multiplayer or play with friends via Steam Remote Play Challenge against up to 3 computer opponents each with 3 levels of skill",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/965210/header.jpg?t=1626366896",
    "Price": 9.99,
    "Developers": "Application Systems Heidelberg",
    "Publishers": "Application Systems Heidelberg",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/965210/ss_4c9f06cdb9b0df0a4181230337e3478aa7877dbd.1920x1080.jpg?t=1626366896,https://cdn.akamai.steamstatic.com/steam/apps/965210/ss_85efed36700ba3009f7438e606e11e6ef16be4dd.1920x1080.jpg?t=1626366896,https://cdn.akamai.steamstatic.com/steam/apps/965210/ss_4ecaeb37568ef7632ba1cc6549cd0a8928e5b620.1920x1080.jpg?t=1626366896,https://cdn.akamai.steamstatic.com/steam/apps/965210/ss_c00cec17d10058185c8605ad33c7bca6cdd48f6a.1920x1080.jpg?t=1626366896,https://cdn.akamai.steamstatic.com/steam/apps/965210/ss_9df337cd25f641a9fdfa42450363bc4ef56241e4.1920x1080.jpg?t=1626366896",
    "Slug": "caf-international",
    "Meta Title": "Café International: Jul 1, 2021, Application Systems Heid...",
    "Meta Description": "Looking for information on Café International? Check out the release date (Jul 1, 2021), developer insights from Application Systems Heidelberg, and a c...",
    "Alt Text Image": "Official header image for Café International game - Steam 965210",
    "Canonical URL": "https://gusku.site/game/caf-international",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Caf\\u00e9 International\", \"description\": \"Looking for information on Caf\\u00e9 International? Check out the release date (Jul 1, 2021), developer insights from Application Systems Heidelberg, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Application Systems Heidelberg\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Application Systems Heidelberg\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/965210/header.jpg?t=1626366896\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}