{
    "AppID": 865770,
    "Name": "Caffeine",
    "Release date": "May 25, 2018",
    "About the game": "Caffeine is a social broadcasting platform for gaming, entertainment, and the creative arts. With Caffeine you can engage in real-time with the broadcaster or your viewers -- no more long delays when chatting. Welcome to the future of broadcasting. Real-time Means Real Social Other platforms have a massive delay between the broadcaster and viewers — sometimes a full minute! Since Caffeine is insanely fast, you won’t be waiting for messages and reactions. Instead you’ll be having frictionless conversations powered by our proprietary chat system that surfaces the best messages to create a meaningful and unique experience for each user. Find Content You Love Caffeine supports broadcasting of hundreds of games, but it is also the home of entertainment, podcasting, talk shows, news, fashion, cooking and more. Our community is always introducing something new to Caffeine, using our real-time platform to elevate their content. With Caffeine’s social-driven recommendation system, it is easier than ever to find content you will love. Broadcasting Made Dead Simple Start broadcasting in just a few clicks. We built our own broadcasting software to create a powerful, simple, and fun way to engage using real-time video. Use the super simple client to broadcast a game, or just use your browser or iPhone app to broadcast yourself. No need to mess with bitrates, stream keys, IP addresses, or any other nonsense - including partnership programs. No Partner Program Required Caffeine makes it incredibly simple to monetize your content through the use of digital items and without the need of a partnership program. As viewers purchase digital items to participate in and enhance broadcasts, Caffeine will award broadcasters with Credits based on this activity. You will be able to apply to cash out your credits for real money starting in July 2018. We’re just getting started and have plenty of surprises on the way.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/865770/header.jpg?t=1528886941",
    "Price": 0.0,
    "Developers": "Caffeine, Inc",
    "Publishers": "Caffeine, Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/865770/ss_6ae71af0e296eb3eab1929c7d92a806b71c73b7c.1920x1080.jpg?t=1528886941,https://cdn.akamai.steamstatic.com/steam/apps/865770/ss_f8eddfb796c477048b4bd49f77d6740d2d48d3ba.1920x1080.jpg?t=1528886941,https://cdn.akamai.steamstatic.com/steam/apps/865770/ss_1194946ba2e9bf76990c2b6bd3f97325d08be6a2.1920x1080.jpg?t=1528886941,https://cdn.akamai.steamstatic.com/steam/apps/865770/ss_e69fe0c293b2e43a2a7cf472bade6e808f8f8cc0.1920x1080.jpg?t=1528886941,https://cdn.akamai.steamstatic.com/steam/apps/865770/ss_5ac6594d3e52083449e78d826c07d7cccc3a7aa6.1920x1080.jpg?t=1528886941",
    "Slug": "caffeine",
    "Meta Title": "Caffeine: May 25, 2018, Caffeine, Inc and Full Overview",
    "Meta Description": "Looking for information on Caffeine? Check out the release date (May 25, 2018), developer insights from Caffeine, Inc, and a complete game summary.",
    "Alt Text Image": "Official header image for Caffeine game - Steam 865770",
    "Canonical URL": "https://gusku.site/game/caffeine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Caffeine\", \"description\": \"Looking for information on Caffeine? Check out the release date (May 25, 2018), developer insights from Caffeine, Inc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Caffeine, Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Caffeine, Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/865770/header.jpg?t=1528886941\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}