{
    "AppID": 1838100,
    "Name": "Conveyance",
    "Release date": "Jan 30, 2022",
    "About the game": "Your 3D conveyor transportation and machine processing sandbox construction kit. Using conveyors, machines and logic modules you will create inter-connected logistics that produce and store all manner of objects from the basic raw blue ore through to the fabled golden cube . Conveyance rewards progress with faster conveyors, faster machines, and smarter logic modules. The end game though isn't necessarily to strive to unlock all these things (although that is super fun), rather, it is to explore, construct and improve your small table-sized world of creation to look and behave exactly how you think it should. Streamlined, compact and efficient...or ridiculously over-engineered...it's up to you! Key Features Your construction toolkit includes 12 machines and 5 logic modules, as well as a uniquely powerful conveyor system to join all of the inputs and outputs together. Conveyance is also fully 3D which means you can go up in the world and create various 'levels' of machinery, connections and componentry. All machines, except for the ground-based Miner, can operate as high above your humble creation as need be. The casual gameplay of Conveyance is underpinned by a sandbox play style with zero time limits. Within this core design, the following features are available: Multiple machine types including Miners, Splitters, Factories, Containers and Vaults Powerful 3D node-based conveyor system allowing complete flexibility with belt layout Configurable Factory recipes to create the needed production line items Freeform layout or grid-snapping when in Construction mode Efficiency driven rewards including faster conveyors and quicker recipe creation Logic modules that enhance behaviour and awareness including the speed radar, warning strobe and power switch Intuitive and powerful camera controls including saved presets Sophisticated editing tools including drag, drop, multi-select, clone and extrude Design helpers when editing in 3D above ground level including conveyor alignment legs and unique 'Level Masking' tool Collection of static props for those extra visual touches including witches hats, barriers and signs Built in mini-tutorial and quick-help Chill background sound tracks, no stress here... Future Roadmap We're excited by our first release of Conveyance, but also, equally excited by our short-term future roadmap. It might sound a bit strange to be discussing future plans when we've just released our 1.0 version, but it is important for us to convey (no pun intended) our genuine commitment to this product. The confirmed additional features, which unfortunately didn't make the first drop in time, include Automated switching logic Lighting More machine types Additional items and recipes Feature requests from community feedback Please join us in our journey this year to deliver and enhance what we hope will be a unique (and most importantly, fun) experience within the genre. We're truly focused on making Conveyance the best it can be. Best wishes to all from the teeny-tiny team here in Australia...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1838100/header.jpg?t=1643601280",
    "Price": 10.99,
    "Developers": "John Hnidec",
    "Publishers": "John Hnidec",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_1ac3f016cbbe5b0881e3c2776d36936c2c9efaea.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_f9f50654e58626e0aeb01c91a3dad791cf3d6d3c.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_8d8506d42bda04f3304ac0d36d4c89393b4614ab.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_4ae48143407237ba5e03f1d92339163c3efac878.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_c20119d39a95afd7918c8081faff2d8826384b1e.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_3a4c42c90a409023d4055a128851ac691168f9ba.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_ff373b89bf0f2baac7dacd5e8114d2876e7a0dea.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_5bc680b2fdaa273f21618e9b43e3254cced0e8c2.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_227b7f2a931920163b0b0c81513ceda0de9a9293.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_537dac5145583a37770a64bab849ff7fd0fdf351.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_e5dae4bb7bc2178d85c00703572eba1d6ebb0dab.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_c674fdb28c9c5029addae4d0772a809fd9f0e010.1920x1080.jpg?t=1643601280,https://cdn.akamai.steamstatic.com/steam/apps/1838100/ss_80ef9c7e8edc2d246ad13abcdbd892f4161d7c3b.1920x1080.jpg?t=1643601280",
    "Slug": "conveyance",
    "Meta Title": "Conveyance: Jan 30, 2022, John Hnidec and Full Overview",
    "Meta Description": "Looking for information on Conveyance? Check out the release date (Jan 30, 2022), developer insights from John Hnidec, and a complete game summary.",
    "Alt Text Image": "Official header image for Conveyance game - Steam 1838100",
    "Canonical URL": "https://gusku.site/game/conveyance",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Conveyance\", \"description\": \"Looking for information on Conveyance? Check out the release date (Jan 30, 2022), developer insights from John Hnidec, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"John Hnidec\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"John Hnidec\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1838100/header.jpg?t=1643601280\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}