{
    "AppID": 1893050,
    "Name": "DOOM TOMB",
    "Release date": "Mar 22, 2022",
    "About the game": "Cut to the chase with DOOM TOMB! A chase-based PvP arena game. Two teams of rival explorers find themselves trapped in an ancient tomb where they've accidentally unleashed a Demon that possesses one of them! The unlucky explorer has to chase and catch a rival to cast the demon upon them before their life runs out. Work with your team to avoid the Demon and survive long enough to complete objectives and unlock an escape. Take advantage of your team's unique skills and items you find along the way as you navigate obstacles in a 3D arena. Enjoy the thrill of the chase as you outrun and outsmart your opponents! Join the community discord server to learn what's next, join play sessions, and submit feedback! Features: Fast paced gameplay Evade the demon by jumping through windows or off high buildings. Run through tight corridors to break line of sight! When possessed, use your tether to grapple to a surface and soar through the air to close the gap on those you hunt! Unique abilities Select from a set of abilities with their own distinct play styles: Deceive your enemies by spawning a running clone, or going invisible! Out-maneuver your enemies by climbing walls, or gliding through the air! Change the map landscape by deploying obstacles or jump pads! And many more abilities! Unique items Select which type of item you'd like to collect around the map. These can give you a speed boost to evade / catch your enemies, give you willpower to help you survive, or help you disrespect and humiliate your foes! In Game Map Editor Create your own custom maps in game, them play them online with others! Join the community discord server to share your custom maps! Teamwork In DOOM TOMB's 2v2 game mode, cooperation is the difference between a good team and a great one. Coordinate the collection and installation of elevator components around the map to unlock an escape. Help your possessed teammate by body blocking or trapping enemy explorers. Taunt the enemy Demon to draw attention away from your dying teammate.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1893050/header.jpg?t=1657673536",
    "Price": 0.0,
    "Developers": "Blue Boa Games",
    "Publishers": "Blue Boa Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1893050/ss_26d2fe9993b8e87e2f515040dedfadb9797474bd.1920x1080.jpg?t=1657673536,https://cdn.akamai.steamstatic.com/steam/apps/1893050/ss_681b25fdc178ab6ce50f2145fae4d3d8414c555c.1920x1080.jpg?t=1657673536,https://cdn.akamai.steamstatic.com/steam/apps/1893050/ss_8b7b8534218c78a4062110111bd4f2938f8bd7e7.1920x1080.jpg?t=1657673536,https://cdn.akamai.steamstatic.com/steam/apps/1893050/ss_7f10901e3fa9c4453fd86b667d846b027d9b4588.1920x1080.jpg?t=1657673536,https://cdn.akamai.steamstatic.com/steam/apps/1893050/ss_0bbe3db4d51450fea8d57adc4b2e7d41944bb6ab.1920x1080.jpg?t=1657673536,https://cdn.akamai.steamstatic.com/steam/apps/1893050/ss_ebe6ef180e6563bd74bc22d3e9bbcbbfd97ad129.1920x1080.jpg?t=1657673536",
    "Slug": "doom-tomb",
    "Meta Title": "DOOM TOMB: Mar 22, 2022, Blue Boa Games and Full Overview",
    "Meta Description": "Looking for information on DOOM TOMB? Check out the release date (Mar 22, 2022), developer insights from Blue Boa Games, and a complete game summary.",
    "Alt Text Image": "Official header image for DOOM TOMB game - Steam 1893050",
    "Canonical URL": "https://gusku.site/game/doom-tomb",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DOOM TOMB\", \"description\": \"Looking for information on DOOM TOMB? Check out the release date (Mar 22, 2022), developer insights from Blue Boa Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Boa Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Boa Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1893050/header.jpg?t=1657673536\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}