{
    "AppID": 835860,
    "Name": "Dreadnought",
    "Release date": "Oct 14, 2018",
    "About the game": "Dreadnought is about one thing: team-based, capital ship combat. It’s a free-to-play shooter that puts you at the center of battles in space and above the surfaces of colonies across the solar system. But it’s not just you and your guns against the world. You have your teammates—outlaw captains like yourself—and a range of ballistic weaponry, Goliath nuclear torpedoes, and long-range Tesla cannons to fill out your earth-shaking arsenal. Combat in Dreadnought takes place at a deliberate pace, giving you just enough time to react to an ever-changing battlefield. During each match, you’ll be able to respawn as a different vessel and switch up your strategy—all while the opposing team does the same. Winning isn’t just about cannons, missiles, and torpedoes. Each vessel is equipped with an energy management system that gives your crew the ability to activate shields, boost engine power, and amplify weapon damage. Using this energy wisely is key to coming out on top. Every battle gives you Credits and XP, which you can spend to unlock a range of ships, weapons, and modules. Fly ships from 3 manufacturers – The tough and rugged Jupiter Arms, the solid and bulky Akula Vektor, and the sleek and ethereal Oberon. 'Have you tried Dreadnought? Best free game out there. Graphics are awesome, kinda feels like I'm stealing by playing this one' - JPanman 'Boom. Straight facts right here! Dreadnought is awesome, free to play, and not pay to win! ' - @Elite_CR 'At first i didn't think I'd EVER like the corvette ships... turns out, they're a whole lotta fun! Dreadnought is a blast (pun intended)' - @TrashPandaGrr ' I'm here to say that Dreadnought, the free to play large spaceship biffing game, is fun as hell and very pretty ' - @badthingsliker 'So very proud to represent Dreadnought! Every time I get online and interact with the amazing community they have, I am reminded how lucky I am!' - MTNrhyno Fight in 8v8 matches – Unleash your guns alongside friends—or complete strangers. Command your own capital ships – Over 70 vessels across 5 specialized classes. Outwit opponents – Maneuver your ship up, down, and across vast battlefields. Adapt and conquer – Respawn in different ships and loadouts during matches. Create the perfect loadout – Equip weapons, modules, and more. Choose from thousands of combinations. Customize your ships – Look more colorful in victory—and defeat. Personalize your captain – Suit up in a wide range of unique outlaw apparel. Mix up the battlefield – Play classic game modes like Team Deathmatch, Onslaught, and Conquest. Advance your rank – Gain experience to unlock more advanced ships and modules. New ships – We will keep adding more ships across all 3 ship manufacturers New maps – More space and terrestrial battle arenas are coming in the future More game modes – Havoc and co-op PvE missions are on the horizon! Daily login bonuses – Play often to get rewards Prestige system – Rise from fresh-faced rookie to veteran outlaw Crew progression – Level up your officers with specialized skills Community events - Take part in limited-time events for special rewards Additional languages – Coming soon More to come – Stay tuned! Battles are never pay-to-win. You can’t “buy power” for your ship—just items to customize its appearance. We deploy game updates and quality-of-life improvements at least every 2 months. We also regularly release new content for the in-game market. We listen: tell us what you think about the game (and what you’d like to see in the future) in our community forums! The beta test period for Dreadnought has ended. All players are required to have a Steam account and complete a quick, one-time accounting linking process. Please note: if you participated in the beta, all progress and balances you have achieved will remain intact. Thank you for playing! Add us to your Steam wish list to be informed when Dreadnought launches and follow us to receive updates on ongoing development.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/835860/header.jpg?t=1625234794",
    "Price": 0.0,
    "Developers": "Six Foot,YAGER",
    "Publishers": "Grey Box,Six Foot",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_fe56bf8042e5fc10e18b48fa59b032d3dad9864d.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_051f8699f078f5d2c99a49313447bcbc5e47d713.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_8c3d6b8ccb319b20d317261e6fa760a7a644f7f0.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_3dbdae96692fd7d14b5b7dc7a25eeb47f5c19e54.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_219b90cd0b918f126cdde868edfe2bd80b8f97c7.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_729dcf60c4f26a5bfd1f06969f05843aa8e173d4.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_b4fc0c89547a36caace8435754723901f3239526.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_7af5a02ba4fbca472f3e0cbbdca38010fd90186b.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_e6ecf121ced3e6290e996f44ce4d44d6aaed1088.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_c0c7a165a0c4143831272eef971d9367d7898ce8.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_54fca3be97c521d35c862fb3ac2dee7d0c2d051b.1920x1080.jpg?t=1625234794,https://cdn.akamai.steamstatic.com/steam/apps/835860/ss_27eab5cffb2e5d72481909fa8e30644a60400438.1920x1080.jpg?t=1625234794",
    "Slug": "dreadnought",
    "Meta Title": "Dreadnought: Oct 14, 2018, Six Foot,YAGER and Full Overview",
    "Meta Description": "Looking for information on Dreadnought? Check out the release date (Oct 14, 2018), developer insights from Six Foot,YAGER, and a complete game summary.",
    "Alt Text Image": "Official header image for Dreadnought game - Steam 835860",
    "Canonical URL": "https://gusku.site/game/dreadnought",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dreadnought\", \"description\": \"Looking for information on Dreadnought? Check out the release date (Oct 14, 2018), developer insights from Six Foot,YAGER, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Six Foot,YAGER\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Grey Box,Six Foot\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/835860/header.jpg?t=1625234794\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}