{
    "AppID": 1670240,
    "Name": "Echo of Ayllu",
    "Release date": "Oct 2021",
    "About the game": "The project is currently in early access. Official release : Q2 - 2022 After the last great galactic war, humanity plunges into darkness and the last survivors struggle for their lives, in a world where robots have seized power. Play as the resistance, opposing forces or friendly little aliens and... back the tide of history. ENTER THE BATTLEFIELD Build a supercharged deck made up of 8 characters: 7 Allies and 1 Champion. Games are fully customizable, live against your opponent! FULL CONTROL In Echo of Ayllu, you decide your own way to win with Artifacts : - Thunder : Win the game by stealing all the opposing energies. - Domination : Smash the opposing characters! - Tempus : Control the battlefield across space and time! The traditional mana system is over too. Each character placed on the board bring an amount of Power Particles in play that the player can use as they wish. The Powers Particles boost your characters by multiplying their attack and can unlock powerful abilities. Use them wisely, these resources are precious. THREE FACTIONS - Terra (Earth) - Proxima - Elysia. MULTI-MODES Many modes have been implemented: Standard, Reversal, Mirror, Draft, Unlimited ... have fun everytime, everywhere! INTERPLAYER MARKET . Fed up with paying boosters all the time when new cards are released? Echo of Ayllu offers you an in-game market where all players can meet to buy, trade or sell their cards. Do business, collect, or have fun speculating if you want, everything is possible. Echo of Ayllu is a real trading card game! LEADERBOARD Climb the seasonal leaderboard, earn rewards in tournaments, control the galaxy! ADVENTURE . Dive into a spectacular vision of the future of our humanity. And make history. The magnificent adventure mode will introduce you to the basic mechanics of the game, but also to the liabilities of the main characters . Sit back, get ready to take off. Social Join colonies, form your crew, build alliances. Let's talk! Discover the news around the game, and get your beta access! 'My friend and I have been walking in the vast Siberian desert for several weeks. The burning days passed by - the freezing nights too. And yet, we were still there. Nothing could have overcome our determination. It guided our steps. The atrocities of the new wars, all these repeated invasions have brought up in us old visceral forces that we should never have known. And despite all that, there was nothing we could do to prevent it ... this genocide ... The whole earth is nothing more than a vast ruin, a shadow of a civilization that it has housed ... at the mercy of a planet that owes it everything. We didn't know it yet, but my companions and I weren't alone. We thought we were the last bastion of invisible resistance. In reality, we were the very first link. Billions of billions of kilometers away; allies, friends ... whole armies were preparing. A science from another time came to us and we were not only going to change the course of our destiny, but also that of all of humanity. All... of... Humanity. But that we didn't know yet.' - Rover Hamilton, October 2417",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1670240/header.jpg?t=1644977176",
    "Price": 0.0,
    "Developers": "Gaiac Games",
    "Publishers": "Gaiac Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_45a59cda7564c142fe20f0bbc68714f1daf64222.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_a9e2d91874392e932c971937e2bd27849db88c7c.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_13ecc94de61167f48338799209bcf99ad4cec794.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_0075c816a3eaae8c1ecf7fb93153e481ff546794.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_3e395acfee83184b45bcf25108778566b3997882.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_0635c168faa1edd6e1875322742e7e3f7405db3c.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_7ef26e5f7332032247abca0c9cec5fae8f15bb10.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_8ed1d9d9767e51993272a5e017c862539cd92b4c.1920x1080.jpg?t=1644977176,https://cdn.akamai.steamstatic.com/steam/apps/1670240/ss_52e0d05da150b9368ba220ed0e2d5c3e84cd7f53.1920x1080.jpg?t=1644977176",
    "Slug": "echo-of-ayllu",
    "Meta Title": "Echo of Ayllu: Oct 2021, Gaiac Games and Full Overview",
    "Meta Description": "Looking for information on Echo of Ayllu? Check out the release date (Oct 2021), developer insights from Gaiac Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Echo of Ayllu game - Steam 1670240",
    "Canonical URL": "https://gusku.site/game/echo-of-ayllu",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Echo of Ayllu\", \"description\": \"Looking for information on Echo of Ayllu? Check out the release date (Oct 2021), developer insights from Gaiac Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaiac Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaiac Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1670240/header.jpg?t=1644977176\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}