{
    "AppID": 1954640,
    "Name": "真空战姬",
    "Release date": "Jul 11, 2022",
    "About the game": "'IN SKY GRIL' -- the United States girl love + flying chess strategy game Qq group: 1056914831 ------------------------------------------------------------------ Game shows Note: all players in this game are 18 years old or older. The game will focus on the hero Of the beginning of Spring to unfold a series of stories, through the player's play to reach different endings. The main plot of the game is about 360,000 words, the branch ending is about 100,000 words, the small theater events that can be explored are about 60,000 words, and there are about 52 sets of CG. The main plot content is 34 chapters in total, and all dubs are in Chinese except the small theater events. characters intro The game characters each person has a unique charm bright characteristics, I hope to meet the needs of everyone. Gameplay is introduced 1. Avg mode, use the traditional AVG mode to tell a wonderful story, which end will you go to as The beginning of Spring? 2. The fetter value system, which can be accumulated by the player's combat results in avG options or flying chess system, can unlock different attributes and skills for each character, and even affect the entry of branch endings. 3. Team editing: it can edit the ordering of the characters we control in the flight chess mode, or use cost to edit the skills we hold. Each skill has different cost consumption, and different skill matching of different characters will produce different effects. 4. Flying chess system, on the flying chess board, players can control up to 4 roles to fight, the ultimate goal is to reach the end to win, each piece has a unique advantage, our pieces can grow to get more powerful attributes and new skills! ----- Chess piece content --------- dice: players through throwing points to advance the number of steps, a certain number of pieces to reach the end of the game victory. ---------HP: represents the health value of the player or the enemy. If our HP is 0, it will return to the starting point and cannot restart temporarily. If the enemy HP becomes 0, it can return to the starting point and start again in the next round Vivid painting performance effect oh! ---------MP: Represents the energy required to release a skill by the player or enemy. If MP goes to 0, the skill cannot be released. --------- skills: Abilities that can be used by us or the enemy, with various effects that affect the outcome of the battle. --------- props: We can use a variety of props to affect the progress, a maximum of one prop can be retained in a match, new props can choose whether to replace the original prop. ----- Random events --------- contingency: At the beginning of battle chess, unexpected events will appear randomly in some grids. When a piece comes to this grid, strange events will be triggered, which will have various effects on the game. --------- prop: at the beginning of battle chess, some grids will randomly appear prop events. When a chess piece comes to this grid, strange props will be triggered and put in the prop bar to wait for use. ----- Other Functions --------- Surrender: Surrender to restart the game. --------- Story mode: Story mode can skip this battle to the next story. ----- Battle settlement --------- Points settlement: Earn points through various actions in combat. Points are the currency of the game and can be purchased in the store for a variety of items. Story mode is not available. --------- fetter settlement: after the battle, the fetter points of the related personnel can be obtained, and accumulated into the fetter value, the first player can get double fetter value. Story mode is not available. 5. The large map system, which is interspersed throughout the game, allows players to use various functions, such as buying things in the store with points, or exploring the small theater plot, which costs 1 action point per exploration. Once consumed, they cannot continue to explore the small theater. More hidden elements for you to see! A variety of hidden elements, need to achieve certain conditions can be acquired!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1954640/header.jpg?t=1657802076",
    "Price": 6.99,
    "Developers": "PEARFLOWER",
    "Publishers": "PEARFLOWER,LoveStoryProject",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_f0d36f29451fe2c32773466342cc45d7f11d9eb3.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_4415e431fb738025976d31bd1e0699e6e3bd629a.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_41e0a4abf6a52545b0bcf086692622bf3e059a73.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_330898c03b60ea76b88ef1020341dac112fed176.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_f07bc986dce7e81908c4a0ed06c63844598fce59.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_cff112237d976756d6681e9991cc6c06199206a2.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_169a239e32d5bec46d7b33f78eb044c40130ca51.1920x1080.jpg?t=1657802076,https://cdn.akamai.steamstatic.com/steam/apps/1954640/ss_955e9df1b1dcd18cc09902ad4e8dde2e0e3a4876.1920x1080.jpg?t=1657802076",
    "Slug": "",
    "Meta Title": "真空战姬: Jul 11, 2022, PEARFLOWER and Full Overview",
    "Meta Description": "Looking for information on 真空战姬? Check out the release date (Jul 11, 2022), developer insights from PEARFLOWER, and a complete game summary.",
    "Alt Text Image": "Official header image for 真空战姬 game - Steam 1954640",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u771f\\u7a7a\\u6218\\u59ec\", \"description\": \"Looking for information on \\u771f\\u7a7a\\u6218\\u59ec? Check out the release date (Jul 11, 2022), developer insights from PEARFLOWER, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PEARFLOWER\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PEARFLOWER,LoveStoryProject\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1954640/header.jpg?t=1657802076\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}