{
    "AppID": 1105420,
    "Name": "Game of Thrones Winter is Coming",
    "Release date": "Nov 14, 2019",
    "About the game": "Game of Thrones Winter is Coming is a PC strategy game based on the HBO drama television series, officially licensed by Warner Bros. Interactive Entertainment under HBO, and developed and published by YOOZOO Games. Play the role of an ambitious Westeros lord, determined to save a people plagued by war and put a stop to the endless disputes between the Seven Kingdoms. This new strategy game has been built using the Unity engine and has beautifully rendered characters and scenery designed by renowned artists. Game of Thrones Winter is Coming has been designed to give players a balanced combination of strategy and roleplaying for a unique gameplay experience. Build your base, expand your territory, recruit characters from the show, train your army, and make history. 1. Dive into the World of Westeros - Westeros Like You've Never Seen It Before: The world of Game of Thrones Winter is Coming has been crafted and designed to recreate a geographically accurate version of Westeros with all the major castles from the show. - Sit on the Iron Throne: Party up with your friends and raise an army to compete with other lords over the castles across Westeros. Eventually, your quest is to sit on the Iron Throne and become the ruler of Westeros. - It's Down to You: Will you cut down those who seek to betray you? Or conquer cities and rule over vast lands? Make your own choices and create your own legend in the struggle for power. - Relive the story of Westeros: Interact with events from the show and play through your favorite moments as a Westeros lord. 2. Meet All Your Favorite Characters - See Game of Thrones and its characters from a different perspective. Forge your own path and progress together with your favorite characters from the TV show as you recruit them in your army. - Use Commanders you have recruited from the show in battle. Check their attributes, ranks, guards, and armies, and use their unique skills in battle. 3. Expand Your Territory and Build Your Base - Customize your castle and add an array of different areas with their own distinct features and upgrades to help you build your kingdom. - Then explore a vast and varied recreation of Westeros with over 30 different terrain and weather types in an ever-changing world. 4. Destiny Calls Your Troops, 10,000 Faces Arise - Battle among 10,000 other players that can all fights across the world simultaneously, conquering kingdoms across Westeros. - Select your commanders, set your battle formation, and use their abilities to complete missions in both PvE and PvP for great rewards. - See the story of Game of Thrones unfold again and unlock exclusive hidden storylines through a wide variety of PvE missions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1105420/header.jpg?t=1583118085",
    "Price": 0.0,
    "Developers": "YOUZU (SINGAPORE) PTE. LTD.",
    "Publishers": "YOUZU (SINGAPORE) PTE. LTD.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1105420/ss_2865cdbf1670dc3cf2652316b52fe2e507c661da.1920x1080.jpg?t=1583118085,https://cdn.akamai.steamstatic.com/steam/apps/1105420/ss_2c9a3a45f6fdc74a8ebf8b04a917a41e6c06d7b1.1920x1080.jpg?t=1583118085,https://cdn.akamai.steamstatic.com/steam/apps/1105420/ss_5b894f27ae296719be6455835f36199e05c51adf.1920x1080.jpg?t=1583118085,https://cdn.akamai.steamstatic.com/steam/apps/1105420/ss_e15d1c6b72b740e81f7f71c4cf4f713b3cc177e0.1920x1080.jpg?t=1583118085,https://cdn.akamai.steamstatic.com/steam/apps/1105420/ss_4587e99b34f1de28e3967428d51445203728c551.1920x1080.jpg?t=1583118085",
    "Slug": "game-of-thrones-winter-is-coming",
    "Meta Title": "Game of Thrones Winter is Coming: Nov 14, 2019, YOUZU (SI...",
    "Meta Description": "Looking for information on Game of Thrones Winter is Coming? Check out the release date (Nov 14, 2019), developer insights from YOUZU (SINGAPORE) PTE. L...",
    "Alt Text Image": "Official header image for Game of Thrones Winter is Coming game - Steam 1105420",
    "Canonical URL": "https://gusku.site/game/game-of-thrones-winter-is-coming",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Game of Thrones Winter is Coming\", \"description\": \"Looking for information on Game of Thrones Winter is Coming? Check out the release date (Nov 14, 2019), developer insights from YOUZU (SINGAPORE) PTE. L...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"YOUZU (SINGAPORE) PTE. LTD.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YOUZU (SINGAPORE) PTE. LTD.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1105420/header.jpg?t=1583118085\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}