{
    "AppID": 1274360,
    "Name": "幽灵高校(Ghost College)",
    "Release date": "May 28, 2021",
    "About the game": "Chapter 1 DLC has been released Currently with Xiao Yuan home line has been completed, is now doing the remaining two branches, respectively, by Mr. Wang caught, and escape alone. Expected 2-3 weeks to update to this DLC again. Thank you all for your support, your support is the source of my production power. Latest update statement version 1.0.0.8b I found the problem of reading the archive, because of an encryption program caused by the release of the last encrypted version, the archive and then read the archive problem, the past archive can not be used, a million apologies. To express my apologies, all players who played for free before June 10, screenshot contact my email, I will, at the time of the release of the official version, give a magical prop. I'm really sorry for the bad experience I've had with the game for the first time and the bugs. But as long as you contact me, I will find a way to help you solve the problem. I also hope you give a positive feedback, thank you! The next update will be updated on the player run Fix the bug that 403 walls can be passed through Fix the bug that the night archive reads the file (previous archives are recommended not to use) Fix the dormitory building toilets appear, search the emergence of the bug (test fix) Plot of the game This game takes place in a university, where an ordinary college student is involved in a paranormal event, but is unable to escape from the event. In these paranormal events, you will reveal the hidden secrets of this university. Gameplay 1. The game is designed with a 2D horizontal board, in which the player can move left and right and not up and down. Items in the game that have hints can be interacted with. The plot of the game will change depending on your level of exploration and the companions you meet. Form of game on sale The game will be free as a prologue chapter, and subsequent chapters will be charged as DLC. The game contains 6 chapters in total, the price will be adjusted according to the length of the chapters. Progress in the development of the game 1. At present, the game has only completed a small part of the daytime, the night battle-related plot is still under development, I will collect feedback from players for the design of future games. 2. subsequent releases will complete the access to Steam cloud storage and trophies 3. The next game will be released in the form of weekly updates until the official version is released. 4. I am currently developing the game alone, if you encounter any problems in the game, you are welcome to give feedback. Contact QQ Group：1077218323",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1274360/header.jpg?t=1634004192",
    "Price": 0.0,
    "Developers": "血色双眸",
    "Publishers": "血色双眸",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_04e39ca5170bbcabcf260bb861a75753c4eb143a.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_4ed789a42e0ac95a3860a09423556aae2dd85f49.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_283c4d87b6f4781057be795fa6b4b2ff835bf25e.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_5b5aa898a0dc3b2487365f0643d7715e4d551104.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_1624e1faccad900c208de78445ffb4ed2f5495e2.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_03f201b84d7210c8b0516b17aee803f69b0deab5.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_d17e6398e27bea4a50a0436f9f722178715ad7ff.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_d8d99c79ccd2e248733e156232002067062eac8b.1920x1080.jpg?t=1634004192,https://cdn.akamai.steamstatic.com/steam/apps/1274360/ss_8a6c8ed0245bba5695fe2c6acafce16496d8b638.1920x1080.jpg?t=1634004192",
    "Slug": "ghost-college",
    "Meta Title": "幽灵高校(Ghost College): May 28, 2021, 血色双眸 and Full Overview",
    "Meta Description": "Looking for information on 幽灵高校(Ghost College)? Check out the release date (May 28, 2021), developer insights from 血色双眸, and a complete game summary.",
    "Alt Text Image": "Official header image for 幽灵高校(Ghost College) game - Steam 1274360",
    "Canonical URL": "https://gusku.site/game/ghost-college",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5e7d\\u7075\\u9ad8\\u6821(Ghost College)\", \"description\": \"Looking for information on \\u5e7d\\u7075\\u9ad8\\u6821(Ghost College)? Check out the release date (May 28, 2021), developer insights from \\u8840\\u8272\\u53cc\\u7738, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u8840\\u8272\\u53cc\\u7738\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u8840\\u8272\\u53cc\\u7738\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1274360/header.jpg?t=1634004192\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}