{
    "AppID": 423890,
    "Name": "Gods and Idols",
    "Release date": "Dec 12, 2016",
    "About the game": "The Father of all Gods, Oberon, has become a myth even to the immortals of the universe, to those willful spirits that have ascended beyond the form of humanity and now flit through the tides of the universe as naturally as walking occurs to mortal men. You are one of these immortal beings, once human but now a divinity that seeks power through worship, seeking to guide your faithful in this darkness from the dangers of all sides. There is much ruin and destruction - wrecks in the battlefield of the gods, but you are yet capable of sculpting planets into hospitable, even lush, wonderlands for your followers. Their temples will exalt you, and in your name, they will launch great fleets to expand your divine empire. You will shield them from the stellar radiation, the envy of their rivals, and much darker entities that lurk between the space of the cosmos. But mere benevolence is not always enough. There will be enemies, but you need not rely only upon your posthuman followers to deal with them; the primal forces of the universe are at your disposal. Disrupt the asteroid belts, plunging a hail of destruction upon the entire stellar system of your foes. Kidnap their planets into a pocket universe of our holding, their populations ready to be dealt with at your will. Or simply destroy their suns in artificial supernovas, leaving nothing alive in their wake. There was a time when such acts would have been thought horrific. But now, as the end of the universe approaches, as the forces of entropy threaten to extinguish all life, light and hope, you must gather what power you can to brace against the incoming horrors of the Black Sun. Command the power to destroy entire star systems Create raw planets and their moons from asteroid belts Develop an intricate economy with dozens of resources Upgrade and develop your planets with gleaming cities Construct powerful fortresses to crush your foes Erect monumental temples in your own honor Command vast fleets faithful to your godliness Duel ancient monsters in the depths of space Gods and Idols is free to download, and free to play. If you want to support us there will be an ingame shop where you can purchase Essence, a resource used for many things in the game. Essence is also gained by just playing the game. We'd love to hear your feedback on this, please let us know if we screw up!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/423890/header.jpg?t=1657595289",
    "Price": 0.0,
    "Developers": "Viking Tao",
    "Publishers": "Viking Tao",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_2a1d2537df2fb3d24b833f67b96cf66e95af7b20.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_6b67e216ef18f783e87912f13e3764b06d654562.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_32cc55ed7699294a6ff193cdc97d1c78634c3ec2.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_6466ac9b28750ad0314c20ddec249ed87c2ec220.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_1f0c1f9057c54bc840f84ddbde4d90af0fddb137.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_dbc7d3ec8fc15a2e6248d35141a14829f703775f.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_e717e48bcc89eb23102765de48c0bf2663f1c1d9.1920x1080.jpg?t=1657595289,https://cdn.akamai.steamstatic.com/steam/apps/423890/ss_773d970869db8bb471f632ec3ad0dcb635ce55aa.1920x1080.jpg?t=1657595289",
    "Slug": "gods-and-idols",
    "Meta Title": "Gods and Idols: Dec 12, 2016, Viking Tao and Full Overview",
    "Meta Description": "Looking for information on Gods and Idols? Check out the release date (Dec 12, 2016), developer insights from Viking Tao, and a complete game summary.",
    "Alt Text Image": "Official header image for Gods and Idols game - Steam 423890",
    "Canonical URL": "https://gusku.site/game/gods-and-idols",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gods and Idols\", \"description\": \"Looking for information on Gods and Idols? Check out the release date (Dec 12, 2016), developer insights from Viking Tao, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 12, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Viking Tao\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Viking Tao\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/423890/header.jpg?t=1657595289\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}