{
    "AppID": 1157790,
    "Name": "I Can't Believe It's Not Gambling 2(K)",
    "Release date": "Dec 16, 2019",
    "About the game": "Not getting enough of a gambling fix in your non-specific sports game of choice? Look no further! I Can't Believe It's Not Gambling 2(K) is a Slot Machine and gambling simulation game (with basketball on the side). Enjoy all the casino-like fun you might find in a sports games without spending another penny in a game where that sh*t doesn't belong! Instead, you can spend significantly less money in this game and get all the same not gambling thrill! Features Spin Slot Machines and win prizes! * It's totally not gambling...trust us! Earn new skins for your Slot Machines! Unlock new Slot Machines, collect everything Spend Imaginary Money Use Imaginary Credit Cards Developer Note: Hi all, This time around, we do want to get a little serious... As much as we enjoy parody, we do hope this is the last entry of the ICBING franchise. * It probably won't be and that's sad. We feel this trend in the big names of the game industry is taking a dangerous path with regards to gambling and we hope to call attention to the very real predatory actions of these titles. Micro-transactions and DLC are a part of modern development and can offer paths to continuing employment for game developers ( important! - we all want to keep making games for you all) and evolve the worlds you want to spend more time in. The important thing to understand is that with games that are expected to have years of balance and content updates, there's almost no way that all content in all games can be free forever. HOWEVER. Locking exciting content behind toxic walls of infinite grind with the alternate to literally gamble for rewards with real money, we think is unacceptable. This, on top of already full-price games, and finding these mechanics in games directed for children, is well beyond the acceptable line of morality to us. These practices feed into vulnerable, addiction-prone individuals and financially drain them. Even if you don't purchase our game, we want this to serve as a reminder of the seriousness of this matter and a point of entry for information. For starters, know that there is help out there. If you or someone you know needs help with addiction (game-related or not), please refer to the links in-game for Gambling Addiction Help. We are also including resources that show research done into these game industry practices and how dangerous they really are. Hopefully this invites more discussion in the game industry and will eventually lead to meaningful changes in how we can continue to make content that players enjoy. We hope you find some enjoyment from I Can't Believe It's Not Gambling 2(K) but we do want this satire to be an entry point for people to research and understand the scary reality of these concepts. We do also want to encourage people to donate to Addiction Help programs around the world and will be holding sales weekends where we will be donating to these programs ourselves as well. We will share updates when these are live so that you can share them with your friends to support a cause AND get a neat little parody game. Thank you for reading. Now get to Not Gambling!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1157790/header.jpg?t=1617055111",
    "Price": 1.99,
    "Developers": "Mutant Entertainment Studios",
    "Publishers": "Mutant Entertainment Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1157790/ss_808dfe80b83cdcb8d0786ce0dd6cea0adb53d1f5.1920x1080.jpg?t=1617055111,https://cdn.akamai.steamstatic.com/steam/apps/1157790/ss_ce3b814704620813f94b3c56db23fffb08ee68af.1920x1080.jpg?t=1617055111,https://cdn.akamai.steamstatic.com/steam/apps/1157790/ss_795e3fba3f97761b9c8932484de24b4e88673185.1920x1080.jpg?t=1617055111,https://cdn.akamai.steamstatic.com/steam/apps/1157790/ss_ed9a0e3e6df75c39a8d5ca4b0177eba8d3b59932.1920x1080.jpg?t=1617055111,https://cdn.akamai.steamstatic.com/steam/apps/1157790/ss_b2c3a846fc7ed8cf6486ebb5a77782b334394acd.1920x1080.jpg?t=1617055111",
    "Slug": "i-can-t-believe-it-s-not-gambling-2-k",
    "Meta Title": "I Can't Believe It's Not Gambling 2(K): Dec 16, 2019, Mut...",
    "Meta Description": "Looking for information on I Can't Believe It's Not Gambling 2(K)? Check out the release date (Dec 16, 2019), developer insights from Mutant Entertainme...",
    "Alt Text Image": "Official header image for I Can't Believe It's Not Gambling 2(K) game - Steam 1157790",
    "Canonical URL": "https://gusku.site/game/i-can-t-believe-it-s-not-gambling-2-k",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"I Can't Believe It's Not Gambling 2(K)\", \"description\": \"Looking for information on I Can't Believe It's Not Gambling 2(K)? Check out the release date (Dec 16, 2019), developer insights from Mutant Entertainme...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mutant Entertainment Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mutant Entertainment Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1157790/header.jpg?t=1617055111\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}