{
    "AppID": 684620,
    "Name": "JetX VR",
    "Release date": "Apr 11, 2019",
    "About the game": "JetX features an arcade racing, epic battles in the arena and a rich variety of modes. Players can race with friends or compete against the bots to reach for the first place in the online leaderboard. Our game is an inviting challenge originally built for Virtual Reality, now also available for PC. Crystal caves, otherworldly landscapes, space wastes in a sharp low-polygon aesthetics. Arm yourself, collect power-ups and go ahead to the victory! Motion Is Life - Designed from scratch for VR to minimize motion-sickness, JetX features a powerful, unique flight system that gives you extensive control and impressive freedom. I mmersive VR - JetX is the fastest VR game ever made. PC\\VR Multiplayer - Race and battle against HTC Vive, Oculus Rift and PC players together, regardless of your platform of choice. VR support is optional. Dynamic PvP battles - Carefully crafted combat mechanics and a variety of impactful power-ups always ensure no two fights feel the same. Clever Bots - Never feel alone and even play offline: Designed to challenge and push you to your limits, our bots are not to be underestimated. Multiple Weapons - Swap weapons on the fly or master your favorites; with multiple guns to choose from, you are sure to find a fit for your playstyle. Game Modes - Pick from our expanding list of game types, including Race, Arena, Boss Battle, Energy Core and more to come! Live Leaderboard - Veni, vidi, vici! More levels, game modes, weapons, and new, awesome features are coming. Stay tuned! Motion Sickness: While many players will be able to jump right in without worry, we recommend sitting down for your first few games. Motion-sickness, should you experience it, dramatically decreases after one or two sessions. If you still have trouble, the game’s Safe Mode feature (accessible via the pause menu) will help alleviate your dizziness. A Word From Singularity Lab: This is one of our first complete game projects and we are extremely excited to hear any feedback you may have! The whole team at Singularity Lab has carefully crafted and polished each aspect of the game, in order to bring you the best possible experience. We really hope you will like JetX! Thank you and see you in the game! Team Singularity. Available for arcade on SpringboardVR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/684620/header.jpg?t=1648311984",
    "Price": 34.99,
    "Developers": "Singularity Lab",
    "Publishers": "SA Industry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_076ad229724b6276352908128210b4913c7dc338.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_f0aa23d4e895704fbb8c887a51a6fc84ec6c6d5e.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_b8ac088de56fdb58f7017a55bb9f90f1d385e1a8.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_0f086ac42a997b5ee6df2f8bd176fbaeae27305e.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_6967830ab5c3714ce8ebace84c6b670a5d729268.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_08d41ad583b90a42a8063110d3677d8a05459897.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_2c000cd2e9c47f20e06ef930aceadd0a4b14b7fe.1920x1080.jpg?t=1648311984,https://cdn.akamai.steamstatic.com/steam/apps/684620/ss_2284bfe745d82eae6f1055916fded21d87e7053e.1920x1080.jpg?t=1648311984",
    "Slug": "jetx-vr",
    "Meta Title": "JetX VR: Apr 11, 2019, Singularity Lab and Full Overview",
    "Meta Description": "Looking for information on JetX VR? Check out the release date (Apr 11, 2019), developer insights from Singularity Lab, and a complete game summary.",
    "Alt Text Image": "Official header image for JetX VR game - Steam 684620",
    "Canonical URL": "https://gusku.site/game/jetx-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"JetX VR\", \"description\": \"Looking for information on JetX VR? Check out the release date (Apr 11, 2019), developer insights from Singularity Lab, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Singularity Lab\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SA Industry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/684620/header.jpg?t=1648311984\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}