{
    "AppID": 399820,
    "Name": "Kopanito All-Stars Soccer",
    "Release date": "Nov 16, 2016",
    "About the game": "'This is the product of what would happen if the fast-paced and thunderbolt world of Super Mario Strikers met the charming and intense world of Sensible Soccer. Sprinkle some unforgettable scenes from Shaolin Soccer and you have Kopanito All-Stars Soccer.' ⚽️ Skill-based gameplay What does skill-based mean? It means, that you need to learn the game's mechanic over time (like in real life football). You need to work out your precision and reflexes to be a better player. Luck means little in Kopanito. The better player just wins and there aren't footballer stats that can help you. You are the stats . Super-moves also are skill-based, the better you play, the more of them you gain during a match. Some super-moves can neutralize opponent's super-moves. It may not look serious, but we guarantee, that it is. Kopanito's match engine is well-balanced. Use slide tackle to intercept passes or knock-down opponents (or even score a goal!). Pass the ball straight to your teammates (ground or air) or pass the ball between opponents. Score goals using chip shots or by swerving the ball using slow-motion shots. There are various set pieces, like corner kicks or throw-ins too, but no rules apart from that! Don’t forget, it is a fast-paced game - it might be funny and cartoonish, but it’s not that easy. Try it yourself! ⚽️ Crush your opponent with a super-move If you play well-enough, you will be awarded with a super-move . Then you can pull the ball using a super-strong magnet (because why not) or teleport into a different spot on the field, activate a big windmaker to blow things out of your goal-line, perform a super-shot that knockout opponents down on the path of the ball and freeze your opponents with the freeze super-move. ⚽️ Try it with your friends There is support for up to 5 controllers (4 gamepads + keyboard). Try the game with your buddies in a friendly match in various game modes – in any desired combination including 5 vs AI game or play in cooperation through a tournament. You can create own tournaments (league, knockout or league + knockout). You decide about stadium, ball and number of teams. You are the Boss here! ⚽️ Online multi-player You can play with other players around the world in quick match modes: Duel (1 vs 1), Doubles (2 vs 2), Chaos (3 vs 3), Complete (5 vs 5). The Create Party mode allows to customize an online match by choosing teams, stadium, decide of the match duration and invite friends to play against. Neat feature is that local friends can participate in online modes too. ⚽️ AI won’t let you rest Four different difficulty levels. The easiest one is a child's play, while the last one... you'll pull your hair out trying to beat the game. Also, there’s a practice mode if you just want to learn basic moves. ⚽️ Many competitions and teams Complete 17 tournaments and leagues in different parts of the world with regional national teams. A tournament consist of a group stage and knockout stage. In a league we apply a round-robin system. Depending on the type of event, there can be 12, 16, 24 or more teams competing. You can choose from 100+ national teams (even the most exotic ones) from all over the world and play on 7 stadiums . ⚽️ Goal replays and GIF generator Your awesome goals and incredible actions can be converted to an animated GIF and shared with your friends on a different the social media channels. See the collection of GIFs created by the community . ⚽️ Bringing back memories Clear inspirations for the game were classics such as Nintendo World Cup (graphics, crazy super-moves), Sensible Soccer and Kick Off (skill-based gameplay). We've spent countless hours on these games 20 years ago So why not to make something similar today? Having a choice is a good thing. ⚽️ Kopanito on IndieDB ● Facebook ● Twitter ● YouTube ● Official Site",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/399820/header.jpg?t=1506520477",
    "Price": 5.99,
    "Developers": "Merixgames",
    "Publishers": "Merixgames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_320d737ba66d48ff6a407477accea9b0791a1ad3.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_1ba40a49c1178dc97c8b9deaa4f68683de21fdc5.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_b3f88a349c78ed0ea6fc6abd238e529ff24fda33.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_43ae13254ed4ccacbe45cb8a06f99bf1dc63f664.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_19f8fdf818949047948dd14fdb59403398731ffe.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_bde6325ba5ca27674c4bcef84b7de1dce1c7d915.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_681fb2fd30f177160566117bfd282a283c89a325.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_dd075d0fba9a6f8e6d278fca0f3af170e5292198.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_e1237a6fe2848ec46e4c55bb57aa57d356f0a2a5.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_d6f1b20d2aa8938b99f71b7dacb1fe073ab65136.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_464169059d8e77c180c0b52bf2a8e6acb1ef19a7.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_b8f84332649ad6c7d76cda743a2a1f2594fa4955.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_c1c18574796b3227556db5d65b0df4e9d632a0ef.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_cce11a4fe106710c4dbb2c2e7cb385f51021d226.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_54373095f1eb1a5808303f3e886d4ef5b1a16265.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_ab76d4cce6a6883ec551eea9c978af1a4f48b971.1920x1080.jpg?t=1506520477,https://cdn.akamai.steamstatic.com/steam/apps/399820/ss_db553119a6991e5d8fb388775b2d89a80e031dd6.1920x1080.jpg?t=1506520477",
    "Slug": "kopanito-all-stars-soccer",
    "Meta Title": "Kopanito All-Stars Soccer: Nov 16, 2016, Merixgames and F...",
    "Meta Description": "Looking for information on Kopanito All-Stars Soccer? Check out the release date (Nov 16, 2016), developer insights from Merixgames, and a complete game...",
    "Alt Text Image": "Official header image for Kopanito All-Stars Soccer game - Steam 399820",
    "Canonical URL": "https://gusku.site/game/kopanito-all-stars-soccer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kopanito All-Stars Soccer\", \"description\": \"Looking for information on Kopanito All-Stars Soccer? Check out the release date (Nov 16, 2016), developer insights from Merixgames, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Merixgames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Merixgames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/399820/header.jpg?t=1506520477\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}