{
    "AppID": 675960,
    "Name": "Matryoshka Strike",
    "Release date": "Sep 11, 2017",
    "About the game": "Matryoshka Strike is a stylish and colorful shoot-em-up game with the classic characters of Russian fairy tales. Koshchey the Immortal, Baba-Yaga, Dragon Gorynych and others. And of course, Matryoshka. Simple and understandable multi-level gameplay with an increasing level of complexity. Dynamic soundtrack. Including a bonus 'infinite' level. Bonus+ Game soundtrack for FREE! In SteamLibrary\\steamapps\\common\\Matryoshka Strike\\OST Collector's trading cards will be added later in accordance with the new rules of Steam. Backgrounds with characters of paintings by classical Russian artists. Matryoshka - Russian wooden toy in the form of a painted doll. Inside there are smaller dolls. Number of nested dolls from three or more. Usually they have an egg shape. The bottom is flat, Each doll consists of two parts: upper and lower. According to tradition doll painted as a woman in a red sundress and headscarf. Zmey Gorinich - fire-breathing dragon , with several heads. It is a representative of the evil principle in Russian fairy tales and epics. The dragon lives in the mountains, sometimes near rivers of fire guards 'Kalinov most', which leads into the realm of the dead. He's always a lot of goals. The number of heads in multiples of three: 3,6,9,12. Most often, goals 3. The dragon can fly. Baba-Yaga is a character from Slavic mythology. This ugly hag has magic items. In the tales she is like the witch, the sorceress. She knows how to cast, fly in a mortar, lives in a hut on chicken legs. Her house is surrounded by a fence of human bones and skulls. She's luring people to eat them. Baba-Yaga looks like a hunchbacked old woman with a huge hooked nose. Koschey The Immortal - is a character from Slavic mythology. This is a powerful evil sorcerer. His death is hidden. “At sea there is an island, on the island is an oak tree, under the oak tree buried a chest, in the chest is a hare, in the hare - duck, in a duck - egg, in the egg - the death of Koschey.” Koschey – the king of his own Kingdom. Vodyanoy(Vodyanik) - spirit dwelling in the water, the owner of the pond. This negative and dangerous character looks like a naked bloated bug-eyed man with a fish tail. He is dressed in a red shirt, he has got green beard and mustache. He's a werewolf, can turn into a pike, catfish, duck, goose, rooster, log, and even a child and a horse. Vodyanoy lives at the bottom of a river or lake, where he has his Palace. Especially often he lives near an old abandoned mill.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/675960/header.jpg?t=1516391873",
    "Price": 1.99,
    "Developers": "Serf100",
    "Publishers": "Serf100",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/675960/ss_e4f5334616f37c962e8c8e59b10a52378abe1d25.1920x1080.jpg?t=1516391873,https://cdn.akamai.steamstatic.com/steam/apps/675960/ss_50c888ed3ebe8d5c33a1b55614fa6fc4019eefb8.1920x1080.jpg?t=1516391873,https://cdn.akamai.steamstatic.com/steam/apps/675960/ss_cbe1242b85d85eaab375e49a2d031ed23e7123ca.1920x1080.jpg?t=1516391873,https://cdn.akamai.steamstatic.com/steam/apps/675960/ss_2b5c5751f217bf57e449820c094288c748034b16.1920x1080.jpg?t=1516391873,https://cdn.akamai.steamstatic.com/steam/apps/675960/ss_52e53be527b7b6f8fd8a947bdd0e5e7c4ca8165f.1920x1080.jpg?t=1516391873",
    "Slug": "matryoshka-strike",
    "Meta Title": "Matryoshka Strike: Sep 11, 2017, Serf100 and Full Overview",
    "Meta Description": "Looking for information on Matryoshka Strike? Check out the release date (Sep 11, 2017), developer insights from Serf100, and a complete game summary.",
    "Alt Text Image": "Official header image for Matryoshka Strike game - Steam 675960",
    "Canonical URL": "https://gusku.site/game/matryoshka-strike",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Matryoshka Strike\", \"description\": \"Looking for information on Matryoshka Strike? Check out the release date (Sep 11, 2017), developer insights from Serf100, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 11, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Serf100\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Serf100\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/675960/header.jpg?t=1516391873\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}