{
    "AppID": 1655920,
    "Name": "New Slippery Samurai",
    "Release date": "Jul 30, 2021",
    "About the game": "About this game Oda Nobunaga has been transformed into a lotion samurai, but he can't even walk due to the slime of the lotion! But by kicking the wall, he can use the lotion's slime to his advantage and slide through it at speeds that would be impossible for a normal person! Be careful not to kick the wall or you will brake suddenly. If you don't kick the wall quickly enough, you'll be hit by an enemy attack. In addition, as a master of the sword, you can cut down ninjas in time in an instant. You'll be able to slash down any ninja that gets in your way. If you can't find the goal, you can make the ninja tell you where the key is by slashing them. Once you have the key, push forward to the goal! Dodge enemy attacks, kick the walls, and aim for the goal! Game features. A fusion of Lotion and Nobunaga with an unprecedented sense of speed! Slash and slash ninjas to reach the goal! A lot of traps will attack the lotion samurai! A lot of traps will attack the lotion samurai, so be careful because the lotion samurai will die in one hit! Firearms! Water! Water! Annihilation floor! Use the newly added gimmicks to your advantage! You'll have to learn the terrain and hone your acceleration techniques to regain your world ranking! Abe Seimei! Big Prince Shotoku! Defeat Takeda Shingen and unify the world! Character Introduction Oda Nobunaga (Roshon Samurai) -- A warlord and feudal lord from the Warring States period to the Azuchi-Momoyama period in Japan. He is one of the Three Great Heroes. He is the eldest son of Oda Nobuhide of Owari Province (present-day Aichi Prefecture). Became a lotion samurai under the influence of a time slip to the Heian period. May 12, 1534 (June 23, 1534) - June 2, 1582 (June 21, 1582) Abe Seimei--A yin-yang master of the Heian period. He was a yin-yang master in the Heian period (794-1185). He was the founder of the Tsuchimikado family of the Abe clan, which controlled the Yin-Yang dormitory from the Kamakura period to the beginning of the Meiji period. He converted Oda Nobunaga, who came from the Azuchi-Momoyama period, into a lotion samurai. January 11, Enki 21[1] - September 26, Kan'ho 2 . Prince Shotoku -- Imperial family and politician of the Asuka period. Prince Shotoku was the second prince of Emperor Yomei, and his mother was Princess Anabomito, an imperial princess of Emperor Kinmei. Prince Shotoku' is a posthumous title or posthumous name. He was the second prince of Emperor Kinmei, and his mother was the Princess Anahobe. When he drinks a potion, he grows to 50 meters in size. January 1, 574 (February 7, 574) - February 22, 622 (April 8, 622) Takeda Shingen, a warlord of the Warring States period, was the patron of Kai and a feudal lord. He was the 19th head of the Kai-Takeda family, a legitimate branch of the Kai Minamoto clan. His name is Harunobu and his alias is Taro. His official family name is Harunobu Minamoto. He is also a member of the Japan Society for the Promotion of Science. He is also a member of the 'Lotion Samurai' (June 02, 2020), where he appears as a ninja master and converts Nobunaga Oda into a Lotion Samurai.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1655920/header.jpg?t=1650810276",
    "Price": 2.99,
    "Developers": "Retsu Teikoku",
    "Publishers": "Retsu Teikoku",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_6b8c34bac73b85eeafe78fd6c036565e2476fd48.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_b0f01ceb72007aabf9e216bae232ea2b987dae5d.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_796c223e9e786d74a26025d4485c8fa5dda8c4b1.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_c6bda37cf598fceb2e56eb7bf18164e256dce305.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_4112427fc4d09e5154f99fe3567e6e5b7e63a693.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_97914c4227f6d6365613c95b3f817c7d778dbe77.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_c315eaa01b9932cdc6f58dd97c6bd93321a7d6ce.1920x1080.jpg?t=1650810276,https://cdn.akamai.steamstatic.com/steam/apps/1655920/ss_235502bfc3d48b31d73da707c8fe237b32fc5df5.1920x1080.jpg?t=1650810276",
    "Slug": "new-slippery-samurai",
    "Meta Title": "New Slippery Samurai: Jul 30, 2021, Retsu Teikoku and Ful...",
    "Meta Description": "Looking for information on New Slippery Samurai? Check out the release date (Jul 30, 2021), developer insights from Retsu Teikoku, and a complete game s...",
    "Alt Text Image": "Official header image for New Slippery Samurai game - Steam 1655920",
    "Canonical URL": "https://gusku.site/game/new-slippery-samurai",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"New Slippery Samurai\", \"description\": \"Looking for information on New Slippery Samurai? Check out the release date (Jul 30, 2021), developer insights from Retsu Teikoku, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Retsu Teikoku\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Retsu Teikoku\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1655920/header.jpg?t=1650810276\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}