{
    "AppID": 378800,
    "Name": "Police Tactics: Imperio",
    "Release date": "Sep 7, 2016",
    "About the game": "16 years ago, the city of Newport Falls belonged to the criminal organization IMPERIO. The members of this group spread fear and terror and held the once picturesque Newport Falls in a stranglehold of organized crime. For a long time, the police had nothing to oppose this power and IMPERIO was free to do as it pleased. Until one day a wily police officer, John Croft, appeared on the scene. Together with his taskforce, he was able to put a stop to this syndicate's deeds bit by bit. But just before he could arrest the leader, he and his organization disappeared without trace. John Croft, the hero and father of a young boy was found dead a short time later. There were two bullets in his chest. But the case was never solved. IMPERIO disappeared and the city blossomed and developed magnificently. 16 years later, there is no longer any sign of what had happened. IMPERIO has returned and flooded the urban area with its criminal activities. The unthinkable happens when the mayor puts on a large banquet to present his future strategy against organized crime, which has been on the rise for months. During the presentation, a shady man draws a weapon and shoots at the mayor. Bullets fly; glass shatters and panic breaks out everywhere. At first, all that can be seen is the mayor lying on the ground. Next to him, police chief Michael Reese, riddled with bullets. He saved the mayor's life and paid with his own. The killer has escaped unidentified. In POLICE TACTICS: IMPERIO you play as Harvey Croft and take on the vacant office of the police chief. You are responsible for upholding law and order in Newport Falls. Coordinate the emergency vehicles and personnel of the municipal precinct and put a stop to crime. Make sure that no crime goes unpunished and convict the perpetrators! You are the first line of defense in the fight against organized crime. You must prevent crime from prevailing and take out the big fish before it's too late. Collect and examine a wide range of evidence and protect your city before it sinks into a swamp of crime. Use your police units to their full potential. Train and deploy crime scene investigators, special units, police officers and detectives. Manage your headquarters and make best use of your budget to ensure the best standards of law enforcement and hazard defense. With increasing success in the fight against organized crime, you will take on greater responsibility and unlock new areas, units and enhancements. Solve exciting cases, investigate capital offenses and prevent everyday misdemeanors. Will you be able to complete your father's lifework and put IMPERIO in its place once and for all? POLICE TACTICS: IMPERIO is a realistic real-time strategy game, developed by CyberphobX Ltd. and astragon Entertainment GmbH. Features: Uphold law and order in your city Newport Falls Fight organized crime Coordinate a range of different police units Gradually unlock precincts, enhancements and new units Manage and improve your headquarters and forces Realistic emergency vehicles, either U.S. or German police units Dynamic day and night cycles With realistic police radio and sirens",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/378800/header.jpg?t=1654107243",
    "Price": 24.99,
    "Developers": "CyberphobX Ltd.",
    "Publishers": "astragon Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_db7e09d52913674fdb0c41fdecb27fc24a33595e.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_e9e133736479fee4f45849d8167d9b9ce7476b9b.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_c5642fd41ad0254f6175a800dd614c443e601d36.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_e7aa6937d3c3ad006ed8c5da0d1fe2ec0a1b0d18.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_679f58bed338e2aa601607cf007f2f1560a9e8de.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_94eaf26f826284b574ceac70ee67caefab02516a.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_1ec3b1fb62530eba99200ade9f51cf092e6c0545.1920x1080.jpg?t=1654107243,https://cdn.akamai.steamstatic.com/steam/apps/378800/ss_2ccf125e8221c78d75c214fc0f4a8e8d8a52e719.1920x1080.jpg?t=1654107243",
    "Slug": "police-tactics-imperio",
    "Meta Title": "Police Tactics: Imperio: Sep 7, 2016, CyberphobX Ltd. and...",
    "Meta Description": "Looking for information on Police Tactics: Imperio? Check out the release date (Sep 7, 2016), developer insights from CyberphobX Ltd., and a complete ga...",
    "Alt Text Image": "Official header image for Police Tactics: Imperio game - Steam 378800",
    "Canonical URL": "https://gusku.site/game/police-tactics-imperio",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Police Tactics: Imperio\", \"description\": \"Looking for information on Police Tactics: Imperio? Check out the release date (Sep 7, 2016), developer insights from CyberphobX Ltd., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberphobX Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"astragon Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/378800/header.jpg?t=1654107243\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}