{
    "AppID": 556540,
    "Name": "Pyramid VR",
    "Release date": "Aug 31, 2017",
    "About the game": "Remember those days long ago when the idea of gaming was only text? Those adventure games that drove you nuts, typing in 2 words 'go north', 'Take Torch' etc... Frustrating you to no end trying to think of the right combination to just open the freakin door! Well here it is. The chance to actually FINISH one of those games, in true graphical style! No more 2 word commands, just point and click your commands! (OK, this was for the PC version, which is now in VR so reach out, grab that item and use it!) This is a graphical remake of the 1978 Tandy game: Pyramid 2000. (A tribute to the original style games that started it all) We tried to stay as true to the text as possible, but due to not having a graphic artist we had to make do with what we could and it is progressing nicely! Hope to see you at the end! Christopher/Notso : Team/GDD Creator (This team was great, it all went smooth! thanks guys!) Level/room design Scene decorator...Does this sarcophagus come in pink?? Prop Master/funding of the little things required to finish IP rights procurement (License to use music, etc...) Directed and performed VR playtesting. Alvaro Urrutia Luna Coded extended gameplay features and VR integration. Textured, modeled, and structured levels in a coherent art style. Customized, modeled, and polished scene item game objects. Customized, modeled, and created icons for inventory items. Directed and staged camera and lighting effects. Modified/remodeled Logic and UI for VR. Thanks to: Game Engine: Unity, the editor, the team, and the whole community behind it. Framework: Adventure Creator - ICEBOX Studios Music: Derek Fietcher - Ancient Egyptian Music - Pharaoh Ramses II Assets: 3D Everything - Temple of the Pharaoh, Egypt Tomb 2.0 Next Level 3D - Ancient Modular Tombs Kiria - Medieval Barrows and Wagons Matias Romero for the great font. Jason Booth - Texture Painter tool Michal - Volumetric Lights VRTK and TheStoneFox for such a great VR Fundations plugin. We would appreciate a report on the issue instead of a negative rating so we can have a chance to fix the issue. Also please remember that not all Indie games can afford to create their own assets, we did purchase the majority of ours from Unity Asset Store and gave credit to those artists. 3 of us started out on a website called Indieteamup, from 3 different countries. We picked an engine, Unity, a framework, Adventure Creator, and I had the idea for the game. 2 Months later we had a complete game, just needed the set dressing and texturing for release, then along comes the Vive, 2 of us decide to convert it to VR, and here we are. Please enjoy! This was a non-VR game we developed that we converted to VR, so please be patient as we change everything for room space play! This is mainly an exploration game with a few minor puzzles and some treasure to collect. Please enjoy! (This is not in any way meant to be historically accurate so there will be a mix of hieroglyphics and 'god' images unrelated or completely out of context). The final release we might package the PC version with it as well, until then if interested in the PC demo please see our gamejolt page. brought to you by... Notso Entertaining Productions:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/556540/header.jpg?t=1582223919",
    "Price": 1.99,
    "Developers": "Christopher Meyer,Alvaro Urrutia Luna",
    "Publishers": "Notso Entertaining Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_b5e8ccb75cf13c6a2d2f3424a82cdbf75d010590.1920x1080.jpg?t=1582223919,https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_f6f95d7113c04ed03a2b4894e5cb3b231af6a749.1920x1080.jpg?t=1582223919,https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_69edf2cb07054126d7f09646ccd307ddc95fc799.1920x1080.jpg?t=1582223919,https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_949c7dbc78d052080e064e90e07cb43322b2958c.1920x1080.jpg?t=1582223919,https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_143a293373155e7b22226b16356e16b10a03aa02.1920x1080.jpg?t=1582223919,https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_eaf1c8752e4ee0248eef1f1eea5cfe7eacb95d7d.1920x1080.jpg?t=1582223919,https://cdn.akamai.steamstatic.com/steam/apps/556540/ss_c009f7fa3cdae2c63554bd8a91a27a7565a3fdfc.1920x1080.jpg?t=1582223919",
    "Slug": "pyramid-vr",
    "Meta Title": "Pyramid VR: Aug 31, 2017, Christopher Meyer,Alvaro Urruti...",
    "Meta Description": "Looking for information on Pyramid VR? Check out the release date (Aug 31, 2017), developer insights from Christopher Meyer,Alvaro Urrutia Luna, and a c...",
    "Alt Text Image": "Official header image for Pyramid VR game - Steam 556540",
    "Canonical URL": "https://gusku.site/game/pyramid-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pyramid VR\", \"description\": \"Looking for information on Pyramid VR? Check out the release date (Aug 31, 2017), developer insights from Christopher Meyer,Alvaro Urrutia Luna, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Christopher Meyer,Alvaro Urrutia Luna\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Notso Entertaining Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/556540/header.jpg?t=1582223919\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}