{
    "AppID": 610960,
    "Name": "红石遗迹 - Red Obsidian Remnant",
    "Release date": "Sep 4, 2017",
    "About the game": "Game System Introduction ★ A Roguelike gameplay and action system combined dungeon game. ★ Up to three weapons—used alternately in the battle, forming intricate attacks. ★ Props with many varying results to enrich your decisions in adventure as well as your outfits. ★ Monster differentiation system—the same monster may be affected by various differentiation elements, becoming tough to deal with. ★ With similar event mechanism like TPRG, all kinds events contain a certain choice and randomness. What are the creative motive, game plot and game mechanism of the Red Obsidian Remnant? Which games do you use for reference in the process of designing? As our first independent game, we choose the Roguelike dungeon type, because it is relatively well controlled. All the game experience is concentrated in a single hour of the game time, so that we can be more focused to make it rich and harmonious. Faced with the emerging of more and more roguelike dungeon games, what we can think of is to combine our game with ACT in order to make a difference. We hope the finally added plot can make the game more complete though the story is not the main part of the game. Speaking of reference, we’ve seen a lot of good works and I think that encourages us to make our own. So, you may feel intimacy while playing the game. Since we all have been more or less influenced by Falcom, I think our game style is somewhat similar to that. In the aspect of Roguelike elements, we borrow a lot from The Binding of Isaac. I am an old player of the retro arcade games. I played a lot of SNK’s classical fighting games and the Last Blade is my favorite. I like to play on the arcade fighting platform occasionally, to recall the past. What elements of the Red Obsidian Remnant do you think are interesting and innovative? In your opinion, what’s the core of the dungeon exploration roguelike game? It’s our first time to make a Roguelike game, but we played a lot and we learn from others. The Roguelike game is the concentration of the long-term RPG, in which players have to experience a time to develop, and to develop changing routines in order to maintain freshness in each play. The Red Obsidian Remnant is an action game and its fighting routine changes reflect more in moves. Besides, the equipment in the Red Obsidian Remnant is the key to influencing the development of the role. So we let the roles carry more weapons. The moves of each weapon can be used alternately and the combination of different weapons can directly form a fighting style. This can be counted as a solution, which just solved problems in the design. I think rules are born under various restrictions. What are the characteristics of the monster system in the game? How to keep the balance of the monster system and the difficulty of the game? As the action game, its basic part is to design monsters with different moves, based on which we add monster differentiation system. The differentiated monster will be attached around with spinning balls and each kind of the balls carries various effects, which may cause the monster explode or parasitize, split after death. You can simply do the math. Besides, there exist no monsters with pure armors since the armor will lead to the invalidity of the ACT basic system after the attack, and the failure to attack consistently, which will make you feel suck. Therefore, the characteristic of armors here is only adopted as part of the monster’s moves. As for the difficulty and the relationships among monsters, we will enhance the AI initiative of the monsters, times of differentiation and the probability of the emergence of dangerous houses in the high difficulty mode. The premise is to maintain the basic value of monsters. Sina Weibo",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/610960/header.jpg?t=1574320654",
    "Price": 8.99,
    "Developers": "Red Obsidian Studio",
    "Publishers": "Beijing New Era Network Technology Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_f11f90f0e5e2af5ec2ab6ad29a343793052817d9.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_c7d73efe0c25160a96c99b0cdeccbb8c0a069ce2.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_7170d32694771b9036553734004fb8363723a455.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_edbc85bbfa16edb315e80517920081388b47d736.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_8291caf2684024672087831596bdf3eb7c1168b8.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_102b948a38884c46c54dbd4074bc0fda2b58da20.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_d8769147ae4aa43608814740cf99e88879665cee.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_8f852147d49ea0f2f78cfe071a9ae630880f99ba.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_e93998f0ee375894d993c732b630e1f806b4a35b.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_186ba7c66f5ec7280e83645261ad4acd57214649.1920x1080.jpg?t=1574320654,https://cdn.akamai.steamstatic.com/steam/apps/610960/ss_3d1da2d1aaa0235d5684714aad086a2d29ed4548.1920x1080.jpg?t=1574320654",
    "Slug": "red-obsidian-remnant",
    "Meta Title": "红石遗迹 - Red Obsidian Remnant: Sep 4, 2017, Red Obsidian St...",
    "Meta Description": "Looking for information on 红石遗迹 - Red Obsidian Remnant? Check out the release date (Sep 4, 2017), developer insights from Red Obsidian Studio, and a com...",
    "Alt Text Image": "Official header image for 红石遗迹 - Red Obsidian Remnant game - Steam 610960",
    "Canonical URL": "https://gusku.site/game/red-obsidian-remnant",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u7ea2\\u77f3\\u9057\\u8ff9 - Red Obsidian Remnant\", \"description\": \"Looking for information on \\u7ea2\\u77f3\\u9057\\u8ff9 - Red Obsidian Remnant? Check out the release date (Sep 4, 2017), developer insights from Red Obsidian Studio, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Red Obsidian Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing New Era Network Technology Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/610960/header.jpg?t=1574320654\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}