{
    "AppID": 1406020,
    "Name": "Sakura Succubus 3",
    "Release date": "Nov 2, 2020",
    "About the game": "Ogasawara Hiroki was a normal man, until a chance meeting with Japan’s top idol turns his life around. He soon learns that many members of Japan’s elite are actually succubi – and, what’s more, there’s something about his scent which makes them insatiably attracted to him. Hiroki amasses a harem of five beautiful and accomplished women: Ayu, the famous idol; Cosmos, the airheaded social media star; Marina, the level-headed businesswoman; Hifumi, the elegant actress; and Hazel, the chipper tennis player. Managing his full-time job as a photographer alongside an army of clingy succubi girlfriends is a challenge, but it’s a welcome one. Hiroki’s fortunes are on the up, and his future seems rosy. At least, it did… until an encounter with a woman from his past changes everything. This woman introduces herself as Yue, the succubus queen. She and Hiroki share a deep bond, and now she intends to whisk Hiroki away to the succubus realm to keep him for her own. Trapped with Yue, Hiroki is faced with an ultimatum: will he succumb to her advances, or will he try to escape? Ikue Ayu, known as ‘Ayu-Ayu’ by her fans, is one of Japan’s top idols. She’s cute, bubbly, and incredibly humble – but this is nothing more than a front which masks a far more cynical persona. Ayu believes herself to be a queen, and she routinely disparages her fans for their slavish adoration. Stuck-up and arrogant, Ayu is quite a handful when she lets her cute persona drop – but, despite all that, she has a soft spot for Hiroki. Catch her admitting to that, though. Wakatsuki Marina is an intelligent, level-headed businesswoman. As one of the oldest of the succubi, she often acts as an authority figure, and isn’t afraid to dole out discipline. Incredibly wealthy and beautiful to boot, Marina is a catch who’s revered by many. Her only faults would be her short temper (particularly where Ayu’s antics are concerned) and her fondness for drinking. Cosmos Moretti is a part-Japanese, part-Italian succubus who works as a social media star. She uploads lots of saucy photos for her fans on the popular image-sharing website. She has more followers on RapidPound than even Ayu, and – unlike Ayu – she loves and cherishes every single one of them. Devote to her fans, Cosmos wants to make them all smile… But her devotion to Hiroki is stronger, even, than that. Yamamto Hifumi as a famous actress, and the oldest of the five succubi pursuing Hiroki. Kind and mild-mannered, with a penchant for karuta and cooking, she is the epitome of the phrase ‘Yamato Nadeshiko’. Hifumi is a motherly figure who prides herself on settling disputes with love and compassion, as opposed to violence. She particularly enjoys doting on Hiroki, and nothing makes her happier than being used as a lap pillow. Hazel Williams is an up-and-coming tennis star whose name is slowly but surely becoming more known. Almost always seen with a wide smile, Hazel’s the sort of girl who can cheer anybody up. She might seem irreverent, but her determination is second to none, and she spends hours at the gym at a time. She goes jogging regularly, is a proponent of healthy eating, and has iron self-control… when it comes to working out. Her self-control in regards to handsome men and pretty women, alas, is a different matter.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1406020/header.jpg?t=1641833027",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_0f178aaa7412785967ffb65a60edd99420db8037.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_e6bc7384fbb94d703cc7bfe0aa3cf9747bc2c55e.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_4196a1653f5f9d830d43cd57fc1484d8426d3b80.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_a80747cbc9d30d02a4bc588e208267fb5745dca7.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_603b2d5ad7be4af0bac9dcaa7be73e22cee3b1e6.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_3d86ae743769ee235229ef1e6689f58ee81b3090.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_63b73a805b07eaeb22d53a7ae7a86aa8eb28963d.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_d8b6229f19f04d2bb528e3154d19d27f112cc892.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_7135c779067261cb81bab59c1919a57fb9bf5bd4.1920x1080.jpg?t=1641833027,https://cdn.akamai.steamstatic.com/steam/apps/1406020/ss_2fe59748090ed71f019d9ed73f65ee2a671bb890.1920x1080.jpg?t=1641833027",
    "Slug": "sakura-succubus-3",
    "Meta Title": "Sakura Succubus 3: Nov 2, 2020, Winged Cloud and Full Ove...",
    "Meta Description": "Looking for information on Sakura Succubus 3? Check out the release date (Nov 2, 2020), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura Succubus 3 game - Steam 1406020",
    "Canonical URL": "https://gusku.site/game/sakura-succubus-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Succubus 3\", \"description\": \"Looking for information on Sakura Succubus 3? Check out the release date (Nov 2, 2020), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1406020/header.jpg?t=1641833027\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}