{
    "AppID": 1692700,
    "Name": "SimplePlanes VR",
    "Release date": "Dec 17, 2021",
    "About the game": "PILOT SIMPLEPLANES CREATIONS IN VR! Reach out to grab the flight controls, flick a switch to open the cockpit door, sit back and feel the haptics rumble as you guide the stick to a smooth landing. Do it all while keeping your eyes peeled on the jet that just flew by...or the Bush plane landing in the distance, or that giant Mech which appeared in the middle of your runway. Experience the expanded freedom of SimplePlanes as you fly all the crafts again for the first time, in VR. DOWNLOAD AIRPLANES* Over 100,000 airplanes are available to download for free from SimplePlanes.com Find anything from old WW2 bombers to next generation fighters to sci-fi spacecrafts. LOOKING TO BUILD AMAZING CRAFTS? This product doesn't include the ability to build or modify crafts, SimplePlanes does though! After you get to the bottom of this page, you can check out the list showing a quick comparison between SimplePlanes and SimplePlanes VR. DYNAMIC FLIGHT MODEL Flight simulation at its finest. Every little decision the creator made will impact how you fly it. Weight distribution, thrust, lift, and drag are all calculated continuously while flying. Parts can break off in a spectacular fashion while you're flying due to over-stress or by impacting something. The fun won't stop there though. You can keep on flying even with a missing wing if you've got the skills. CHALLENGES Climb in to the cockpit of one of your craft and see how you fare piloting it in the challenges. The challenges will keep you entertained for hours. Land on aircraft carriers, escort bombers, dodge surface-to-air missiles, race through courses, and so much more. SANDBOX Use any craft for any purpose. The sky is the limit. Literally. MODDING IN VR? This product does not support Steam Workshop. However, it shares all of the amazing modding support of SimplePlanes, and thus is fully capable of being modded right out of the box. Mods are fundamentally compatible between SimplePlanes and SimplePlanes VR, but existing mods are not guaranteed to work when VR is enabled. For the time being, any VR specific mods could be uploaded to SimplePlanes' workshop, and be accessible there. You can also enable mods directly in SimplePlanes VR, you just need to do so without the help of Steam Workshop. Hope that clears things up! Still have a question about SimplePlanes vs. SimplePlanes VR? Let's see if this helps... Both games have access to the same crafts* SimplePlanes includes an aircraft builder, SimplePlanes VR does not. Except for those which require building; all challenges, islands, locations, aircraft, etc. are available in both games. Buying both of them on Steam will automatically enable VR in SimplePlanes. After VR is enabled in SimplePlanes you can do everything there, without switching games. *Some factoids about downloading crafts that you should probably know... Although all crafts can be piloted in SimplePlanes VR, not all of them have been optimized for VR, and may not have interactable cockpit controls, for example. After logging in, you can use the search tags to filter to craft which are designed to work in VR. Or, you can choose to check out crafts which may not include VR optimized controls, but may still be really cool to check out in VR. You may also want to check out VR optimized civilian aircraft, or military, experimental, etc. Also, after logging in you can add favorites to your account from the website via your computer/phone, and then easily access those favorites from within the game. We do not restrict you from downloading huge craft on PC once you're logged-in, so you will likely download designs which drop the fps, and result in poor VR performance, so keep that in mind when choosing what to download. The vehicles you'll download are primarily hand-crafted by the SimplePlanes community, and as such may vary in how the uploader intended you to interact with them. Some craft use a more standard control setup, others may deviate to accomplish specific needs/goals. Creators may even include custom instructions to inform you how the craft operates. There are so many amazing aircraft to fly in VR, and we're really excited to have you check them out!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1692700/header.jpg?t=1642190049",
    "Price": 9.99,
    "Developers": "Jundroo, LLC",
    "Publishers": "Jundroo, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_3156744b2935a61afafac0e27a601911c5fb1816.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_00323e2c0f6f3bfc45adacf2a190b8fcd74913ec.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_16520bd0cfc26f08ffffec661d1f9c6f1deb4c74.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_f1721cb562b2929c960288f80b8d58df60ed6bbb.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_37ec4d40e669e3834eefce667a69683d79ae29b7.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_c0ea3f435992b8dae3ae0f3184a08b641dcdeb86.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_a1219e23bbf95376777b7993e07129cb7e61b77c.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_2e159c6f588a7651a465c84c02c85931bff38da8.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_264c315900ab0236fad67b6d12301a01b2d38d2b.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_153470f0ce7ceb80bfbb785797c91e0871c56784.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_3d45adafa05a8a8a545e138f369bf6209e6bbd53.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_65f3aab998f513c1324c59d0ab4adc7777af4728.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_5a5afbebed34f880cbed7a15f3050ae650cfa955.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_f1f6ef14ccb2ea24c16a5a46e4e44b773f2e200a.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_c388e9fa5b2baa18b1dc4725d56624e9e3a7eb27.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_eb45eb1aec47476ae74edc1c64653c9b43af43ec.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_4d9677949b09d96a1531cfaee1b6b235ebd4e32a.1920x1080.jpg?t=1642190049,https://cdn.akamai.steamstatic.com/steam/apps/1692700/ss_802345b856a466d728e580cf1f7ca8f857c4f6bf.1920x1080.jpg?t=1642190049",
    "Slug": "simpleplanes-vr",
    "Meta Title": "SimplePlanes VR: Dec 17, 2021, Jundroo, LLC and Full Over...",
    "Meta Description": "Looking for information on SimplePlanes VR? Check out the release date (Dec 17, 2021), developer insights from Jundroo, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for SimplePlanes VR game - Steam 1692700",
    "Canonical URL": "https://gusku.site/game/simpleplanes-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SimplePlanes VR\", \"description\": \"Looking for information on SimplePlanes VR? Check out the release date (Dec 17, 2021), developer insights from Jundroo, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jundroo, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jundroo, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1692700/header.jpg?t=1642190049\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}