{
    "AppID": 1896650,
    "Name": "Soul In the Chamber",
    "Release date": "Apr 25, 2022",
    "About the game": "You play as an archeologist exploring through the ruins of the long fallen Khal Empire when you recover a mysterious ancient gun. When picking up the gun, the soul of an assassinated emperor is dragged out of the spirit world and becomes entrapped into the body of the gun. Due to your actions, a cataclysmic collision of worlds has begun that only you can stop by returning the emperor to his final resting place in the spirit world. With the emperor at your side, you must traverse the chaos of the oncoming apocalypse as you fight through the vengeful and mad spirits of the fallen empire’s bloody past. Save the fates of both colliding worlds as you uncover the mystery of the emperor’s assassination and the story of the empire’s fall. Heart-Pumping Fast-Paced Traversal Slide, wall-run, and dash your way through a world designed for agility and flowing movement. Build up your momentum as you dodge opponents, traps, and traverse environments crafted to challenge your ability. Precise and Creative Combat With only one shot to take down enemies, use bullet-time and precision to take down your opponents and use their souls to recover your bullet and chain together kills as you move through combat. Gather and use unique modifiers for your shots to creatively take down enemies and use your environment against those who stand in your way. A Vibrant Stylized World Traverse through the beautiful ruins of an empire that fell from a tyrannical imperial dynasty and a bloody civil war. Explore the vibrance of a dying spirit world as well as the chaos of two worlds’ colliding. Endure the onslaught of stylized and unique opponents as well as a treacherous environment as you try to reach your goal. Competitive Speedrunning and Community-based Level Editing Race through levels to get the fastest times with in-game timers and optional objectives to constantly challenge yourself. Create your own levels with an in-game level editor that allows you to experiment with unique level combinations to create challenging and creative experiences. Want to help Playtest? Come join our playtesting Discord server:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1896650/header.jpg?t=1650917933",
    "Price": 0.0,
    "Developers": "Threehaw Company Ranch",
    "Publishers": "Threehaw Company Ranch",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1896650/ss_544276164f5ba75fba1b5169dcafb7f533cbb331.1920x1080.jpg?t=1650917933,https://cdn.akamai.steamstatic.com/steam/apps/1896650/ss_2f4e8566847f5d80eee5d0c6249e52214718ae16.1920x1080.jpg?t=1650917933,https://cdn.akamai.steamstatic.com/steam/apps/1896650/ss_d10d3f8c9725be28652c78b5b1ffdfaf6a2d466c.1920x1080.jpg?t=1650917933,https://cdn.akamai.steamstatic.com/steam/apps/1896650/ss_d4463701e307059b4d1e49863167943a37fa47ee.1920x1080.jpg?t=1650917933",
    "Slug": "soul-in-the-chamber",
    "Meta Title": "Soul In the Chamber: Apr 25, 2022, Threehaw Company Ranch...",
    "Meta Description": "Looking for information on Soul In the Chamber? Check out the release date (Apr 25, 2022), developer insights from Threehaw Company Ranch, and a complet...",
    "Alt Text Image": "Official header image for Soul In the Chamber game - Steam 1896650",
    "Canonical URL": "https://gusku.site/game/soul-in-the-chamber",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Soul In the Chamber\", \"description\": \"Looking for information on Soul In the Chamber? Check out the release date (Apr 25, 2022), developer insights from Threehaw Company Ranch, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Threehaw Company Ranch\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Threehaw Company Ranch\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1896650/header.jpg?t=1650917933\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}