{
    "AppID": 1681840,
    "Name": "Summoners Fate",
    "Release date": "Jun 20, 2022",
    "About the game": "Summoners Fate is a roguelike adventure game that fuses traditional turn-based combat with tactical card combat. Set in the fantasy land known as the Multiverse, you're tasked with the challenge of guiding summoners through perilous quests in search of hidden secrets, powerful cards, titanious team members, and mutated rabbits. The Multiverse is inspired by traditional tabletop environments, stretching from its frozen peaks to barren deserts and colorful woodland to dingy dungeons. Each world offers its own characters to find, mysteries to unravel and bosses to slay. Summoners Fate draws its inspiration from classic tabletop games like Hero Quest and Talisman, combining tactical combat with thoughtful events decided with the trusty roll of a D20. Exploring the Multiverse is done in real-time, allowing you to uncover lore scrolls, shop for powerful cards and even attend a goblin's birthday party (don't forget your gold). Combat brings Summoners Fate into a turn-based game where unit positioning is as important as your spell casting. These tense encounters play out in arena-style maps where the environment isn't just for show, it's a key part of the battlefield. Equip powerful armor from a statue mid-fight. Slam your foes into a wall of spikes. Transform a tree behind enemy lines into an allied fighter. How you control the battlefield is your choice. In between the DnD style events and slaying of enemies you'll be collecting cards, lots of cards. Every Summoner is linked to two classes, including Arcane, Celestial, Nature, Void, and Chaos. These classes offer different playstyles: Chaos contains a lot of fire AOE spells for big damage whereas Arcane provides the ability to mind-control your enemies. Your deck in Summoners Fate is capped at 20 cards, so you can collect all the cards you like knowing they won't hinder your current build. If you wish to change your playstyle halfway through your adventure then simply roast some marshmallows on the campfire and chat with the Cosmic Tortoise. Summoners Fate offers an ever-changing adventure so it's important to adapt to the situation. The Battle Mode allows you to build a constructed deck from the cards you have discovered during your adventures. Bringing this deck, along with two allied units you can test your might against the toughest of foes! 4 Worlds to explore, each with its own events, characters, and bosses 8 Summoners to guide through an adventure, each offering a unique ability for you to master Over 30 characters to meet through world events, all of which can join your adventure Over 300 cards you can collect on your quest to build the perfect deck PvE Battle mode, the perfect arena to master your favorite Summoner",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1681840/header.jpg?t=1656978806",
    "Price": 19.99,
    "Developers": "D20Studios, LLC",
    "Publishers": "D20Studios, LLC,WhisperGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_805472e3275b488b9a97697809b5eb720de4f4d9.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_0412ea56fd53854b492bd606fd91468d1e61e32f.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_e16fced1ad8e93af7930741b842222d1d9baf8df.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_d8be5ab47be549ede240ec78247240f8bb23973b.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_d5cf647714999dec356ade9577e1e3fb5d929773.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_65cb60e1e02250e06fa3bfa22957de26e718c17a.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_d8e911f454d9116fcef1a7c6002692af3326e17b.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_8607969cef6364f895d5c6a6b8049df60d360a1f.1920x1080.jpg?t=1656978806,https://cdn.akamai.steamstatic.com/steam/apps/1681840/ss_94349482e5f9e1980584d98c5646abf23d46d662.1920x1080.jpg?t=1656978806",
    "Slug": "summoners-fate",
    "Meta Title": "Summoners Fate: Jun 20, 2022, D20Studios, LLC and Full Ov...",
    "Meta Description": "Looking for information on Summoners Fate? Check out the release date (Jun 20, 2022), developer insights from D20Studios, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Summoners Fate game - Steam 1681840",
    "Canonical URL": "https://gusku.site/game/summoners-fate",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Summoners Fate\", \"description\": \"Looking for information on Summoners Fate? Check out the release date (Jun 20, 2022), developer insights from D20Studios, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"D20Studios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"D20Studios, LLC,WhisperGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1681840/header.jpg?t=1656978806\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}