{
    "AppID": 541300,
    "Name": "Survive the Nights",
    "Release date": "Dec 21, 2017",
    "About the game": "Survive the Nights is a unique FPS survival game focusing on teamwork, fortification, creativity and strategy. Secure a structure or roam free, the choice is yours. Survive the Nights focuses on realistic survival, post zombie infestation. The game takes advantage of day and night cycles. Preparing during daylight hours when moving around the world is less risky. Make use of existing structures instead of building them. Play as a team to better your chances to survive each night. Use the day time hours to roam the island, find loot and prepare for the night to come. Fortify structures, set traps, start fires, get meals and bandages ready. When the night falls, you will not want to venture too far from a secure structure. Here's some of what Survive the Nights has to offer in early access. Please remember, we’re dedicated to listening to the players. If you have any suggestions, share them our discord. and steam community hub. We’re listening! The dead are a real threat and will kill an unprepared player quickly. Zombie behavior is not the same around the clock. You'll find zombies during the day slower, more docile and lurking in the shadows. They will attack but for the most part need some provoking. Night zombies on the other hand are far more aggressive. They can see further, they're faster, more agile and spawn in greater numbers. They will actively hunt the player so always be on the lookout. Structures are all exciting as there’s no “base building”. You can take control of an already existing structure, fortify and hunker down. Every door can be padlocked Plank over windows on the interior and exterior Power structures to provide much needed light Set traps outside/inside doors and windows Select and secure fixed containers with locks Barricade type fortifications can be free placed to hold back and damage zombies and other players. Hosted gameplay feature runs a server on the local machine. With network setup, this server can be connected to by friends. Solo gameplay feature runs local server and uses local host to connect. The host option allows a player to start a public or privately hosted server.  Create private parties to play only with friends. Create a solo server and play by yourself without the worry of other players possibly ruining your good time. The horde system keeps track of a few statistics including how many 'horde nights' you've survived, how many zombies you've killed, when the horde starts and stops along with the direction the horde is approaching from. Difficulty progresses with the more hordes you survive. Horde difficulty can be set between 1 and your highest achieved difficulty. Realistic food and drink intake is a big part of the game. You don't need to eat too frequently so eating and drinking feels like a smooth mechanic and less like a burden. Eating and maintaining a proper diet can even result in character buffs. Realistic calorie consumption Realistic hydration system Only eat what you need for a day Eat more and build your calorie, stamina and overall health stats Consume cooked foods to lower your chance of sickness Hunt game for larger meals Getting around an island the size of this one isn’t easy on foot. Realistic fuel consumption Realistic part system Vehicles support more than one passenger Vehicles can power structures Powering a structure can provide light to make night time activities easier. Some structures also require electricity to power interior and exterior doors. Power an electric meter with a generator Power a set radius with a generator in the wild Supply a structure or area with electricity Power lights Crafted electrical items like work lamps Power gas pumps to retrieve fuel Simplified text based inventory and crafting allows us to greatly expand on in game items and crafting possibilities without the graphical overhead. Simplified crafting system Combine common items to create other useful loot Create tools like axes, hammers and hatchets by combining crafted handles and found tool heads Craft canteens to store and purify water Combine food items with canteens to create meals that are ready to cook Easy to navigate an search for recipes Search based on recipe or ingredient Use large and small workbenches to craft items both large and small The placement system allows for players to move any crafted or found physical game drop as they see fit. Placement will allow for players to make a structure feel more like their own. Manipulate any loot drop Placement directly from the inventory Place and store goods on counters, shelves or tables Organize your safe house Our mental health system is being developed to discourage 'Kill On Sight' mentality. The zombies are a real threat and you’ll better your chances of surviving with friends and not killing every stranger that comes walking by. PVP is still a factor as it should be and there are means to correct a negative mental state. Kill players repeatedly and pay the price Eat raw or rancid foods and lower your mental state Eat warm meals or fresh foods to raise your mental state Extreme lows in the mental health stat will result in death Our weather system is dynamic including all four seasons along with seasonal vegetation and foliage. Dynamic lighting Dynamic seasons Day and night cycles Realistic star and moon positions Random weather events such as rainstorms and snowstorms Mist and fog system Large hand designed world Woodlands Campgrounds Starting Camps Shipping container camps Farmland Cabins Meadows Rivers Large road system 100’s of fortifiable structures There’s a big difference between day and night, remembering that may be key to your survival. Day and night cycles make for dynamic gameplay. Zombies are scarce and far more docile during daylight hours. Nightfall brings out dead so it’s best to be indoors by then. Traveling at night is not advised. Using a firearm in a town at night would draw hordes. It’s best to stick indoors unless you have a large group of friends. Day Cycle Fell trees Craft planks Hunting and trapping Gather loot and food Fortify a structure Secure doors and containers with locks Fuel generators and prepare power systems Light a fire to keep your health up Craft bandages and prepare for the night Night Cycle Team up with friends Hunker down in your secured structure Avoid firearms use melee Remain as quiet as possible Start generators and power structures Set structure traps Cook meals indoors on wood stoves Try to survive the night Server based leader boards allow you to see who has survived the longest on the server. Each player will also have personal stats seen via the main menu. The game also tracks global stats, seen on our website/forum and discord server. Something we’re including right from the first alpha build is steam achievements. How many nights will you survive? Just like all of our features we’ll gather ideas for Steam Achievements from the community. We’ll expand greatly on achievements but you’ll have many to earn in early access such as nights survived, trees felled, times killed, zombies killed etc. Plans for Future Updates: Expand electrical systems to include full power to the island - The island currently features a massive power station and it has been designed with functionality in mind. The power stations will supply power to substations which can power entire towns.  Expand the tool system - We’d like to incorporate power tools and additional tools into the game to make fortification a quicker process.  Expand on crafting - With the community's help, we’ll expand on all of the crafting categories such as designing and implementing anything that suits the gameplay and is backed by the community.  Expand fortification and add vehicle fortification - Additional trap and fortification types like sheet metal, plywood, bars and fencing. Fortifications added to vehicles.  Additional vehicles - One of our goals is to expand on “mobile survival” such as adding box trucks and eventually trailer trucks which could make for an excellent mobile survival experience.  Vehicle storage and towable generators - Take your loot with you, store goods in on board containers or in trunks. Towable generators and lighting rigs for setting up camp in the wild.  Expand on the leveling system - Do a certain task, gain XP. The more XP, the better you are at doing said task. This will be a simple old school leveling system.  Additional weapons - Weapons will stay civilian based while not adding anything too over the top when it comes to military weaponry. We’d love to hear your ideas for craftable weapons.  Expand hunting - Larger game, more small game trapping options.  Fishing - Spend your days shore side with a line in the water, if you think it’s safe.  Expand on design - Added towns, additional town designs and reworks. Sewer systems, a bridge or ferry to Black Island Prison  Character customization - A full scale character customization feature  including the implementation of a female character Structure manager - Clean structures, paint, repair, add holiday features, remove furniture, display structure stats.  Grouping system - Players can join a grouping system with friends.  Island wide community missions and events - Come together to clear out larger structures. Band together and share your loot to repair the power station and provide the entire island with power.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/541300/header.jpg?t=1656004027",
    "Price": 24.99,
    "Developers": "a2z Interactive",
    "Publishers": "a2z Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_59bd79621f917c7163a938ca31170fbdd227508a.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_5fa2173e4c386d0f212efff9b368aff6a206ff09.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_21df952eaf1b2b2c28e68b8355de4ab7586d72ba.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_2bf999c84508552de329e72772be1770466bca7c.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_fd78d6f8330a99d8a1967ab249e24444adf6cae4.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_07461adc588cc765708cec07f0cf85e8f9a6332a.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_e6c0cf69fc2ba13690b0115f8e1ce4e3e2b6a228.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_cde5c15ffdf01d37ed5a888c292fb81a954c0815.1920x1080.jpg?t=1656004027,https://cdn.akamai.steamstatic.com/steam/apps/541300/ss_0c2fd9bea9cc17639d9b408130f88f19d186513a.1920x1080.jpg?t=1656004027",
    "Slug": "survive-the-nights",
    "Meta Title": "Survive the Nights: Dec 21, 2017, a2z Interactive and Ful...",
    "Meta Description": "Looking for information on Survive the Nights? Check out the release date (Dec 21, 2017), developer insights from a2z Interactive, and a complete game s...",
    "Alt Text Image": "Official header image for Survive the Nights game - Steam 541300",
    "Canonical URL": "https://gusku.site/game/survive-the-nights",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Survive the Nights\", \"description\": \"Looking for information on Survive the Nights? Check out the release date (Dec 21, 2017), developer insights from a2z Interactive, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"a2z Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"a2z Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/541300/header.jpg?t=1656004027\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}