{
    "AppID": 27000,
    "Name": "The Path",
    "Release date": "Mar 18, 2009",
    "About the game": "There is one rule in the game. And it needs to be broken. There is one goal. And when you attain it, you die. Six sisters live in an apartment in the city. One by one their mother sends them on an errand to their grandmother, who is sick and bedridden. The teenagers are instructed to go to grandmother's house deep in the forest and, by all means, to stay on the path! Wolves are hiding in the woods, just waiting for little girls to stray. But young women are not exactly known for their obedience, are they? Will they be able to resist the temptations of the forest? Will they stay clear of danger? Can they prevent the ancient tale from being retold? The Path is a game about growing, about changing, about making choices, about accepting the consequences of these choices. A game about playing, and failing, about embracing life, perhaps by accepting death. Key Features: The Path is a short horror game inspired by older versions of Little Red Riding hood , set in modern day. The Path offers an atmospheric experience of exploration, discovery and introspection through a unique form of gameplay, designed to immerse you deeply into its dark themes. Every interaction in the game expresses an aspect of the narrative. The six protagonists each have their own age and personality and allow the player to live through the tale in different ways. Most of the story, however, relies on your active imagination. The Path is designed with accessibility in mind. There are no ticking clocks or monsters to defeat. No hard puzzles will ever halt your progress. Most activities in the game are entirely optional and voluntary. The player has all the freedom in the world to explore and experience. While The Path does not contain any graphic violence or sexuality, it does allude to these themes. The overall melancholy mood of the game and the potentially unsettling course of events, make The Path unsuitable for children . Despite of its origins in fairy tales, The Path is decidedly a game for the mature mind. The game features a complete realtime 3D environment that can be explored through third person navigation. The characters in this virtual world, including the player's avatars, are governed by a form of artificial intelligence that gives them some autonomy. As a result, nobody knows exactly what you will encounter on your journeys. Next to the multi-layered stylized graphics, The Path features a continuous soundtrack composed by goth rock diva Jarboe (ex-Swans). In fact, there are hardly any sound effects in the game. Instead the music is continuously changing according to what is happening in the game. Like the behaviours of the characters, the music too is never exactly the same twice. For a satisfying experience, it takes about 6 hours to complete the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/27000/header.jpg?t=1447351736",
    "Price": 9.99,
    "Developers": "Tale of Tales",
    "Publishers": "Tale of Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007805.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007806.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007807.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007808.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007809.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007810.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007811.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007812.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007813.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007814.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007815.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007816.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007817.1920x1080.jpg?t=1447351736,https://cdn.akamai.steamstatic.com/steam/apps/27000/0000007818.1920x1080.jpg?t=1447351736",
    "Slug": "the-path",
    "Meta Title": "The Path: Mar 18, 2009, Tale of Tales and Full Overview",
    "Meta Description": "Looking for information on The Path? Check out the release date (Mar 18, 2009), developer insights from Tale of Tales, and a complete game summary.",
    "Alt Text Image": "Official header image for The Path game - Steam 27000",
    "Canonical URL": "https://gusku.site/game/the-path",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Path\", \"description\": \"Looking for information on The Path? Check out the release date (Mar 18, 2009), developer insights from Tale of Tales, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tale of Tales\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tale of Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/27000/header.jpg?t=1447351736\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}