{
    "AppID": 1693070,
    "Name": "THE MADHOUSE | Infected Mansion",
    "Release date": "Nov 18, 2021",
    "About the game": "For those of you who are hungry for survival horror. Welcome to the new world of survival horror, where the elements of survival horror are fused together. THE MADHOUSE | Infected Mansion is a survival horror game where you try to survive from an abandoned house. This game is inspired by Japanese horror games such as 'Resident Evil' and 'SIREN'. ■Announcements Gamepad (controller) full support has been added in Update v1.3.0. You will be able to play the game from start to finish using only the controller. Gamepad (controller) support has been added in Update v1.2.0 (except for some screens). Please refer to the patch notes for details. The inventory system has been improved in Update v1.1.2. Enemies will pause when you are interacting or displaying inventory, allowing you to explore more calmly. Difficulty Correction Update v1.1.0 is now available. The difficulty level of both Easy and Normal has been lowered. ■Overview Survival from extreme conditions in a closed space. This is survival horror at its best. It's a game that combines the elements of survival horror: Fear, Stealth, Exploration/Puzzle solving, and Item management. This is the 'all-inclusive' game experience that packs in all the elements of survival horror. The 'Multiple First-Person Views', which is a feature of this game, will bring a new level of fear, immersion, and strategy to survival horror. Will you be able to survive from the closed and abandoned house? ■STORY As a new virus spreads across the world. In the suburbs of Westbridge City, there have been a series of disappearances. The protagonist slips and falls while hiking in the mountains outside Westbridge and loses consciousness. When he wakes up, he finds himself in the courtyard of an abandoned house. What awaits the protagonist in the abandoned house? ■Multiple First-Person Views Subjective gameplay that elicits fear. The view you can see is not only that of the main character. You can see the view of 'something' lurking in the abandoned house. The 'Multiple' viewpoints create an even more terrifying and immersive experience. [Main Character's View] [Enemy's View] ■Random Roaming (Random enemy wandering) Enemies' roaming routes are not necessarily constant. The randomness of roaming makes enemy behavior difficult to grasp. Enemy behavior that changes according to the player's actions and story progression. In the abandoned mansion, you cannot allow yourself to be distracted from start to finish. ■Multiple Endings The ending will change depending on the player's actions. Will you be able to find a route to survival? ■Fear A deformed creature lurks in an abandoned mansion. Fear of confronting the enemy in an enclosed space. Fear that you can only escape. And the fear is accelerated by the ability 'Steal Vision' to see the vision of others. ■Stealth It is impossible to survive unless you use 'Steal Vision' to see the vision of creature and act without being detected. It is also useful to find a place to hide and lay low. Creatures also have a sense of hearing and will react to footsteps and doors opening and closing. You need to act in such a way that they cannot see you or hear you. ■Exploration / Puzzle Solving The stage of this game is a closed abandoned house. You must explore every corner of the abandoned mansion to obtain items and solve various mysteries. ■Item Management There is a limit to the number of items a player can carry. The player must decide what items to carry and what items to leave behind, and act efficiently. There is also a limit to the number of consumable items, such as healing potions, that can be obtained. It is also important to conserve the consumable items. There are also items that can be used to resist the enemy or create diversions. You must make full use of a variety of items to escape from this extreme situation. ■Amplification of fear and immersion through sound The effective background music and 3D sound amplify the sense of fear and immersion. For those who want to enjoy the horror atmosphere, it is recommended to darken the screen and use headphones so as not to feel stressed. ■Multiple Difficulty Modes This game has multiple difficulty modes (EASY, NORMAL, HARD, MAD), which differ in terms of enemy strength and the number of items available for consumption. MAD mode is a high difficulty mode where you will die instantly if you are attacked by an enemy. If you want to challenge the true horror of the game, please try it. ■Play Time Depending on the player's skills and actions, the game will take about 10 hours to clear on the first play through. ■Steam Achievement This game supports Steam Achievements. Steam Achievements range from easy to difficult, so you can aim to complete them or enjoy tie-up play. ■Live game video streaming and monetization Live game videos are welcome. Monetization is not a problem. The developer of this game, PIYOSHI, loves watching horror games in action, and is always entertained by those who do. We'd love to see you do the same for this game. ■Sharing information among players via Twitter When tweeting about this game on Twitter, please use the hashtag #MadKansen . It will be more fun if you can share information among players such as impressions of this game and live game video streaming. Please use the hashtag if you like. ■About option settings This game is operated using the keyboard and mouse. The key assigned to each action can be changed to any key on the options screen. In addition to the key settings, screen brightness, mouse sensitivity, volume settings, and graphics settings can be customized to suit the player's environment. Please play with the settings you prefer. In the system requirements, we have listed the graphics as 'NVIDIA GeForce GTX 970', but it may work with a lower specification. If the game is too slow, please adjust the graphics settings. ■Note on Language Switching This game is available in English, Japanese, and Simplified Chinese. Depending on the language you use, please set the language settings for this game in the Steam client as follows. Using English: Any language setting is fine. Using Japanese: Set to a language other than Simplified Chinese. Using Simplified Chinese: Set to Simplified Chinese.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1693070/header.jpg?t=1657065488",
    "Price": 9.99,
    "Developers": "PIYOSHI CREATIVE STUDIO",
    "Publishers": "PIYOSHI CREATIVE STUDIO",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_925b3f54534fa1b6812f109333cf4c4cf38dfafe.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_4d4f00c8eed024f23911d734d74770a4cea35f69.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_c728cc975ac62e26f7279028fbdeb5ca3e829cfd.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_fbef5b6c1e60add2949f3487cef0aa3897aa6fe2.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_ba15dcb67347581a0372ef021b695064248c30f6.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_1406337460b446376c9a7d9173c08c1214c43851.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_500c7f9e49b276a12709b150537193b92083793d.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_fe903ed3d51af63166d160a010705a8461a9c609.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_e836a37fd2428586e8ad5cd9fa165c6811eaff75.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_f93b2dc70e19a56f3b18f49453b4e850956493f5.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_47e9a6f2781898db767511f74361521a68292b3b.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_41abda5da704e54aea278b8d38a8eb052f01f6fa.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_2196a96b737e54603ce479e4919104c939442450.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_432e2969cfd314bfb7a479116af47cf90c849e8f.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_1b11ce2742fc58c94546e9a8f6a76964f72b984c.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_b0bceaa718ffbfa1afe8bb595d80f946cd4efe6f.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_b72a87cb424ecab07d7b4edd998af3460c5b9a78.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_2e77f9e2de0b277e3e4caee84b88dc176e738da2.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_a5d306010fe97bb70687aebc0742068f5d697b8e.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_ed29700a617fb0901d0a8c4674b60edca66cdfe7.1920x1080.jpg?t=1657065488,https://cdn.akamai.steamstatic.com/steam/apps/1693070/ss_2fd21c56cdb6a94e5804accc739012a1ba9b6db5.1920x1080.jpg?t=1657065488",
    "Slug": "the-madhouse-infected-mansion",
    "Meta Title": "THE MADHOUSE | Infected Mansion: Nov 18, 2021, PIYOSHI CR...",
    "Meta Description": "Looking for information on THE MADHOUSE | Infected Mansion? Check out the release date (Nov 18, 2021), developer insights from PIYOSHI CREATIVE STUDIO, ...",
    "Alt Text Image": "Official header image for THE MADHOUSE | Infected Mansion game - Steam 1693070",
    "Canonical URL": "https://gusku.site/game/the-madhouse-infected-mansion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"THE MADHOUSE | Infected Mansion\", \"description\": \"Looking for information on THE MADHOUSE | Infected Mansion? Check out the release date (Nov 18, 2021), developer insights from PIYOSHI CREATIVE STUDIO, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"PIYOSHI CREATIVE STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PIYOSHI CREATIVE STUDIO\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1693070/header.jpg?t=1657065488\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}