{
    "AppID": 663430,
    "Name": "This is not RPG",
    "Release date": "Jun 29, 2017",
    "About the game": "First of all, my English is very poor.I'm sorry.I really feel bad about that. I'm a keyboard man. The pursuit of happiness, the escape from pain is everything to me. There is no level at all. It's a person who is daydreaming all day and thinks the dream is pretty good. For me, the game is my second life.... I play all kinds of games, but I'm always annoyed by the wonderful stories of some works, and I get angry even when I'm unhappy,Then in order to vent their anger began to deliberately play games, while facing the NPC and cruel scourge while thinking about if the story is my own to do good..... Originally, I have lived such a life without doubt for myself until..... One day I had a dream. I had a very sad love story. It was only a dream, but I felt very sad. So I remembered the dream and thought it was a love story of the world..... But when I saw the story again, I found that it couldn't be any more common, and why was it that I was so unhappy and annoyed?! I don't understand... After that, it took root in my heart like a seed. The longer it grew, the more I grew unhappy...... Then I found that I regret only exist in my actor dream, when I woke up I'll no longer be a hero, so this love story will become intense darkness without light in my eyes. Having understood all this, I began to hate myself for being so unhappy and hating myself as a keyboard player. Finally, I opened the software, made this little game to taunt myself, and wanted it to stay on the platform that the player knew all the time,That way I can think of all this humiliation and live a happier life. Main slot points: [small place] [press F5 to adjust the size of the game window] 1. you are a full level of the brave, please don't use their own skills to kill the brave [] Dutch act. 2., the main line is very free, you can finish the story first, then go to the task, there is a new dialogue, But I suggest you go or go to those towns stroll, bubble sister, buy a bottle of blood what. 3. novice tutorial maze, there are four or five treasure boxes, remember to take. 4. Elven village needs to be defeated after a BOSS and is eligible for entry, The hidden role of the two floor of the village head needs dialogue with the head of the village before repetition occurs. 5. pub just singing diva money pit, will give you a bonus BUFF. 6., even if you buy jewelry in the jewelry store, you can not equip, because you bring the protagonist aura. 7. likewise, all the shields you gain are not equipped, because you do not hold shields. 8. please do not try to flirt with the game, otherwise you will only keep GAME OVER. 9. [important] a world chosen to change. There are three choices for the four heavenly kings: 1. test selection is the world of testing The world is an unfinished test phase of the world, with only one ending. Except for BUG, All aspects are very pit father! The map has not been completed, the various plots have no follow-up, and the battle is very pit. 2., the selection of the devil becomes a formal world, please play this The two worlds, except maps, are all different settings. The devil's world has a more complete map, more characters and plots, and more props and treasure chests. You can also learn all kinds of magic and skills, and the heroine's plot is more, and there are not as many as fifteen characters. Among them, there are Raiders of cute boys and not dirty Story 0 The world's monsters are completely different from the world of testing, becoming a hit. And the world's various scenarios are free to choose, you can first complete the task, and then pick up the task, No matter how you play, each will have a new plot dialogue. Of course, the ending is more. And there are hidden allies who can help you defeat the final BOSS. 3. choosing a farm is a world of real endings, but you have to get two signals to get in. Testers, the world and the devil, choose the world to get through, will get a password. [without testing the world of the tester] [defeating the demon world, the last BOSS can also get two signals. ] The world will not [and] let your eyes bright, because the two world is the third. And there are many false endings in the world! So I hope you can make a real ending. In the end, there will be a reversal of the hidden content of the story.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/663430/header.jpg?t=1559867378",
    "Price": 0.99,
    "Developers": "zachs123456",
    "Publishers": "zachs123456",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_f1f839b4c9a26ab8b702dc847e0687d26f15ffd5.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_c169ce406c43fc6f502065e77aca85bb1156cec8.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_7ac5a6960247b7efd4e3ef500230cdfb2d216069.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_91922089132bdfdf9eafbab75f35789f4ef6e29f.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_cf685842cf7131e78ef6f948acd99c5e113d3e86.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_7ff55266d60ea73f3f78155ae0cc35575a40fddd.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_2fd0e91eaa5a36ab8a1861f03323a0ba6f03670c.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_1e5dd3feabaad4e1dc566b5a32a90e141cec12bb.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_9aae97465a80ce3912345534e9d7a9d4836d654a.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_2227b7611cc67b5698b868eafd09b1e3001fb2a7.1920x1080.jpg?t=1559867378,https://cdn.akamai.steamstatic.com/steam/apps/663430/ss_3413b9939f45fc1e621b5e19627afddb7ad87fda.1920x1080.jpg?t=1559867378",
    "Slug": "this-is-not-rpg",
    "Meta Title": "This is not RPG: Jun 29, 2017, zachs123456 and Full Overview",
    "Meta Description": "Looking for information on This is not RPG? Check out the release date (Jun 29, 2017), developer insights from zachs123456, and a complete game summary.",
    "Alt Text Image": "Official header image for This is not RPG game - Steam 663430",
    "Canonical URL": "https://gusku.site/game/this-is-not-rpg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"This is not RPG\", \"description\": \"Looking for information on This is not RPG? Check out the release date (Jun 29, 2017), developer insights from zachs123456, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"zachs123456\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"zachs123456\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/663430/header.jpg?t=1559867378\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}