{
    "AppID": 1612160,
    "Name": "Timo's Adventures",
    "Release date": "May 27, 2021",
    "About the game": "Timo's Adventures is a fast 2D arcade game. A musical Runner where you will need to let the beat drive you... But do not let the beat crush you. Since, for Timo, 'speed' is his middle name. You'll have to be quick in order to dodge the traps made by the Divinity. 3 lives, 3 lines, it seems simple : it is not. Dive in a musical Aztec universe all drawn by hand. We dance a lot, we die a lot... Come and score in music ! An increasing difficulty... That goes sky high ! To survive through the 10 levels in 'Timo's Adventures', you will need to learn, die and retry. To avoid the traps set on his path, Timo will have to go up and down to switch lines and make his way into the level. Some parts will be painted by one of three elements (fire, water, nature) and cannot be dodged. As a proud chameleon that he is, Timo will be able to change its own color and protect himself against the damage done by those elements. Finally, some penalties will occasionally affect the gameplay and make the run even harder. Death is a part of the experience. Every try teaches you a lesson to improve and finally burst with joy at the finish line. A taste of online competition ! Finishing a level is already a great achievement... But to finish it with a better highscore than your friends, now THAT is pleasure. Every level, every mode in Timo's Adventures has a Worldwide ranking. (yep, we said worldwide) Pick up a name and run to the top of the 'Leaderboard' to look down on your opponents from your ivory tower. Give me music ! Give me actors ! Timo's Adventures is indeed a runner. We are at the crossroad between the well known 'lost connection' Dinosaur and Guitar Hero. Music which is a central part of the game was recorded by two members of our team in a homemade music studio. Every character is voice acted in french (subtitled in english, spanish and also french). Arcade, yes, but with style, soul and a great dose of humor ! Features: - 5 normal levels (calling those levels “normals” is a bit far-fetched seeing how challenging they already are) - 5 hardcore levels (the naming is about right this time) - An endless mode (No one finished it yet) - A Time Attack mode (Be the quickest to finish 5 levels in a row) - Leaderbaords (For everything, everywhere) - An original music per level - Die, die, die and retry - Yes this game was developed in a basement",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1612160/header.jpg?t=1622130161",
    "Price": 0.0,
    "Developers": "Les Joueurs Français",
    "Publishers": "Les Joueurs Français",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1612160/ss_3ae346d359575b5ce2816d8aa83e4336ed7ac193.1920x1080.jpg?t=1622130161,https://cdn.akamai.steamstatic.com/steam/apps/1612160/ss_fe97d1a291760142b74a47276954925acf4d1005.1920x1080.jpg?t=1622130161,https://cdn.akamai.steamstatic.com/steam/apps/1612160/ss_cc1e8ebbe66857b189e9632d2bc8f097be603706.1920x1080.jpg?t=1622130161,https://cdn.akamai.steamstatic.com/steam/apps/1612160/ss_2069dd787f7672705ee74453bffa0571540f33f9.1920x1080.jpg?t=1622130161,https://cdn.akamai.steamstatic.com/steam/apps/1612160/ss_1d7f4229e16a101e4de5711b7bd21b0f54a53f1a.1920x1080.jpg?t=1622130161",
    "Slug": "timo-s-adventures",
    "Meta Title": "Timo's Adventures: May 27, 2021, Les Joueurs Français and...",
    "Meta Description": "Looking for information on Timo's Adventures? Check out the release date (May 27, 2021), developer insights from Les Joueurs Français, and a complete ga...",
    "Alt Text Image": "Official header image for Timo's Adventures game - Steam 1612160",
    "Canonical URL": "https://gusku.site/game/timo-s-adventures",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Timo's Adventures\", \"description\": \"Looking for information on Timo's Adventures? Check out the release date (May 27, 2021), developer insights from Les Joueurs Fran\\u00e7ais, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Les Joueurs Fran\\u00e7ais\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Les Joueurs Fran\\u00e7ais\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1612160/header.jpg?t=1622130161\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}