{
    "AppID": 21800,
    "Name": "Tom Clancy's EndWar™",
    "Release date": "Feb 25, 2009",
    "About the game": "Live the thrilling career of an army commander and lead your army to victory in a massive online World War III! Take control of the U.S.-led Joint Strike Force, the European Enforcers Corps, or the Russian Spetsnaz Guards Brigade in a persistent ongoing World War. Create your army to match your tactical style and create a strategy that will defeat your enemies. You Are In Control In addition to traditional RTS controls (mouse selection, hotkeys), EndWar goes beyond other Real Time Strategy games by letting you use your own voice to control your units, offering you true control at the speed of thought. Putting You in the Battle Instead of using the traditional top-down view, EndWar employs a unique third-person camera that puts you in the heart of the battle, making the use of terrain and cover even more critical to achieving victory. Zoom in and out at will and watch the devastation unfold as hundreds of units engage the enemy on fully destructible battlefields. Armed for the Future True to the Tom Clancy legacy, EndWar offers a wide range of vehicles, weapons and equipment based on real-world military research, giving you unprecedented access to the cutting-edge technology of tomorrows wars, such as drones and space-based weapons of mass destruction. Go to war online in a persistent multiplayer World War III with fully-customizable battalions and units Refined HUD and controls and new waypoint system, combined with EndWars proven revolutionary voice command system 30 stunningly realistic real-world battlefields set in Europe and the United States, including Washington D.C., Paris, and Moscow Deeply customizable armies featuring unit ranks and hundreds of upgrades add up to endless replay value. Includes all the downloadable content released on consoles – maps, additional upgrades and battalions. Watch the destruction unfold in spectacular detail in massive battles featuring hundreds of units and destructible environments. Please note that as of November 19th, 2018, the online features for this game are no longer supported. The Multiplayer mode / Co-op mode will no longer be accessible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/21800/header.jpg?t=1541778594",
    "Price": 9.99,
    "Developers": "Ubisoft  Shanghaï",
    "Publishers": "Ubisoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/21800/0000007185.1920x1080.jpg?t=1541778594,https://cdn.akamai.steamstatic.com/steam/apps/21800/0000007186.1920x1080.jpg?t=1541778594,https://cdn.akamai.steamstatic.com/steam/apps/21800/0000007187.1920x1080.jpg?t=1541778594,https://cdn.akamai.steamstatic.com/steam/apps/21800/0000007188.1920x1080.jpg?t=1541778594,https://cdn.akamai.steamstatic.com/steam/apps/21800/0000007189.1920x1080.jpg?t=1541778594,https://cdn.akamai.steamstatic.com/steam/apps/21800/0000007190.1920x1080.jpg?t=1541778594",
    "Slug": "tom-clancy-s-endwar",
    "Meta Title": "Tom Clancy's EndWar™: Feb 25, 2009, Ubisoft  Shanghaï and...",
    "Meta Description": "Looking for information on Tom Clancy's EndWar™? Check out the release date (Feb 25, 2009), developer insights from Ubisoft  Shanghaï, and a complete ga...",
    "Alt Text Image": "Official header image for Tom Clancy's EndWar™ game - Steam 21800",
    "Canonical URL": "https://gusku.site/game/tom-clancy-s-endwar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tom Clancy's EndWar\\u2122\", \"description\": \"Looking for information on Tom Clancy's EndWar\\u2122? Check out the release date (Feb 25, 2009), developer insights from Ubisoft  Shangha\\u00ef, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ubisoft  Shangha\\u00ef\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ubisoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/21800/header.jpg?t=1541778594\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}