{
    "AppID": 793460,
    "Name": "112 Operator",
    "Release date": "Apr 23, 2020",
    "About the game": "112 Operator allows you to manage emergency services in any city in the world! Dispatch units, take calls and face situations caused by weather, traffic or changing seasons. Help the city survive escalating events like riots, organized crime, terrorist attacks, cataclysms, natural disasters and many more! Danger has escalated Help on a scale bigger than ever before. The sequel of the award-winning 911 Operator lets you act on many, completely different levels - from taking care of a single neighborhood to coordinating several operators’ work in the world’s biggest metropolises. Full 3D visualization will give you the inside view of your units’ actions. Choose from over 100 000 areas, such as districts, municipalities, and tens of thousands of real cities from all over the world. To all units: a storm is coming… Face the dynamic weather, based on authentic, historical data. Watch the incidents change as day or night comes, traffic increases and seasons pass. Watch out for extreme conditions that may lead to cataclysms and natural disasters. Try to tame big wildfires spreading across the map. Weather isn’t your only problem though - be careful when dealing with terrorist attacks and gang wars. 112, what’s your emergency? Take calls from people in various situations, needing emergency services’ help. You never know who’s on the other side of the line - you might hear a frightening murder story, maybe you’ll have to instruct someone on performing CPR, or keep your nerves while encountering an annoying prankster. It’s my job, ma’am... Choose one of the European cities in completely new Career mode and find out if you’ll manage to climb up to the very top of an operator’s career ladder. Follow the commands of your supervisors and see your actions affecting people you’re in charge of or those who need your help. Sometimes your mistakes will only be followed by a reprimanding e-mail, sometimes they’ll influence your own life. You can also play special scenarios in any city in the world, or make your own rules in the Free Game mode. We need backup! Command the best specialists, using technologically advanced equipment and vehicles. Decide what to use - a SWAT team, Search and Rescue helicopter, or maybe riot gear? When your units arrive at the scene, command them in the tactical view that gives you the full image of the situation. NEW FEATURES IN 112 OPERATOR: 25 times bigger, expandable maps of REAL CITIES with 3D buildings entirely new set of emergency calls and large events completely redesigned campaign mode, with objectives system, emails, and a story day&amp;night, weather, seasons and traffic now influences the duty and the incidents happening new fire mechanic, that can consume entire areas and require dozens of units region specification - gameplay will vary depending on a country legislation and district characteristics (slums / business / residential /industrial / forest etc) new OnSite situation visualization that shows the action precisely and intuitively new team members - doctors, sergeants, dogs, robots, and others! additional dispatchers, that you can assign to districts for help! redesigned equipment, now packed up in entire gears CHECK OUT MORE FROM GAMES OPERATORS AND FRIENDS! / / /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/793460/header.jpg?t=1653153608",
    "Price": 24.99,
    "Developers": "Jutsu Games",
    "Publishers": "Games Operators",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_6544b792f3ad6160d9d18a20a7f1f1bcd20bb7e1.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_77b6d4f3f7f9f58b50882a04a0321dcb5566a10e.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_1319bb505baa3476ac977a3d1191e7b397c32f84.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_c9597f6563ed5b25defc806af9be21a0a3722391.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_96f9dc3bcd8a233bd5d3101a66df04a7b8538352.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_7fb7632cf86cc149dae46827d1ede70e7617d6c7.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_5b79ed148fc600c6eacdb9e7616ce6ad4ff91c38.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_c41003570fc2113fefe3c7b3009d8c6f34225c04.1920x1080.jpg?t=1653153608,https://cdn.akamai.steamstatic.com/steam/apps/793460/ss_920598365a1787b60c553c3e9fc748f65ac0054a.1920x1080.jpg?t=1653153608",
    "Slug": "112-operator",
    "Meta Title": "112 Operator: Apr 23, 2020, Jutsu Games and Full Overview",
    "Meta Description": "Looking for information on 112 Operator? Check out the release date (Apr 23, 2020), developer insights from Jutsu Games, and a complete game summary.",
    "Alt Text Image": "Official header image for 112 Operator game - Steam 793460",
    "Canonical URL": "https://gusku.site/game/112-operator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"112 Operator\", \"description\": \"Looking for information on 112 Operator? Check out the release date (Apr 23, 2020), developer insights from Jutsu Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 23, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jutsu Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Games Operators\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/793460/header.jpg?t=1653153608\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}