{
    "AppID": 871100,
    "Name": "Animyst",
    "Release date": "Jul 2, 2018",
    "About the game": "There is no right way to live an afterlife... The world fell to pieces ages ago and all history crumbled to dust. Magic has brought you back from the dead, but your mind has eroded and your purpose is unclear. Play as either a Friend- a skeleton warrior assembled of bones from a mass grave; or a Cursed One- the fleshy walking Corpse of an embalmed aristocrat. Travel, explore, and build alongside your faction members, or stalk the territory of your enemies in search for players to kill and bases to crumble. You wake with a voice whispering in your head, leading you ahead on a quest of knowledge and power. Venture outward and explore the ever expanding Realm of the Dead. You must settle the land and build a new home as you wander the desert in search of pages of an old book, The Lore, which may hold the key to salvation. Participate in First-Person open-world PvP and PvE combat, as well as recurring daily events. Craft spells and magic trinkets to gear up in a completely customizable loadout. Throw fireballs, create giant sandstorms, hurl meteors and glide from the highest peaks with your spellcasting powers. Build a base with free-placing gigantic stone monoliths. Make your own Stonehenge and live in it. Place a Throne and establish a community to gain benefits from being a good neighbor. Make new friends and skeleton dance together, or insult each other with animated emotes. Animyst has been in open, playable, development since 2018 and is made by a tiny team of two mortals. All player feedback is seriously considered. Many gameplay changes and updates have come directly from player suggestions. Come join the discussion on our open Discord channel (link can be found in game) and influence Animyst as it evolves into a full PVP MMORPG unlike any other. Experience the world as its built and populated with more and more creatures, spells, and features every month. RECENT UPDATES IN 2021 INCLUDE: -A quest of crafting and exploration has been added to assemble The Lore, and learn about the ancient history of The Droughts. -Full Flight has been added for those who have completed The Lore quest. -The sky is now covered with thick dark, volumetric clouds, that one can fly up inside of. -Fixes to building placement bugs and enemy attacks. -Added a new creature, The Gore Beast, to the Gore Rift event. -Addition of gardening and a new set of fine resources. -The Patriarch, a giant flying monster has been added to the clouds, to protect it's icy loot and attack any who fly too high. ROADMAP OF FUTURE GAME PLANS: -Learn about the world through a series of open-ended Quests that guide players through the desert, caverns, clouds, and hell itself. -The Crusaders. A new threat is coming to colonize the Droughts -Hell. A giant changing procedural labyrinth. -New magic classes including: Ice, Summoning, and Transformations.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/871100/header.jpg?t=1628664979",
    "Price": 0.0,
    "Developers": "Animyst Games",
    "Publishers": "Animyst Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_bccac4e392a5289fd45bb381302e9b8e52068853.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_e173b9f89a4018ba8ef94920c2649963a9e42b5b.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_c655503028ef5766d8f310fbddecf018559823a0.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_7653a32245385c71859877d0f11cd291d0a8e9b5.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_79863577403b9dae6aefcca6c77b83a6c7fca84e.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_dc0328348f9f9922c5747791d39a703861610c28.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_7cec85572bac2113f69d30c8e9fd303ada8ee4cd.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_95b3be4dfeae69cce9b1711debef678f8c968f57.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_9f21eab9a99c725077740c9c3e86f5958d7fe312.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_0804167c8bbb16387ed29d52994197be861ba5c6.1920x1080.jpg?t=1628664979,https://cdn.akamai.steamstatic.com/steam/apps/871100/ss_6bb94f429870ff64db6b0292509848fc70a9a981.1920x1080.jpg?t=1628664979",
    "Slug": "animyst",
    "Meta Title": "Animyst: Jul 2, 2018, Animyst Games and Full Overview",
    "Meta Description": "Looking for information on Animyst? Check out the release date (Jul 2, 2018), developer insights from Animyst Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Animyst game - Steam 871100",
    "Canonical URL": "https://gusku.site/game/animyst",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Animyst\", \"description\": \"Looking for information on Animyst? Check out the release date (Jul 2, 2018), developer insights from Animyst Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Animyst Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Animyst Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/871100/header.jpg?t=1628664979\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}