{
    "AppID": 1001980,
    "Name": "Archeo: Shinar",
    "Release date": "Sep 11, 2019",
    "About the game": "At this point, you may wonder what on Earth is this bloody project? Archeo: Shinar, because that's the full title, is a turn-based strategy video game focused on people &amp; resources management. It's not like other games about archeologists doing astonishing stuff in ancient tombs or something like that. No. In this game you will be the man behind the desk. Or a woman. We are talking about the lifestyle of the real archeologists, the true horror of dealing with traumas and phobias. Not yours! You won't risk your own health, we have employees to do that. The true horror of dealing with their traumas and phobias. Do you see where I'm going with it? Imagine the bills from doctors, the health compensations and the press. 'Press? Why the press?' you ask. Yes, the press. Because you know the press. They are just waiting there for the unsatisfied explorer who would like to tell them how the 'archeology' truly works. And we do not speak about how it truly works. They can't know the ugly truth. Never! That's a lot of stress, right? Don't worry, as we already know, there is no better medicine for that than a cup of tea. Or a glass of gin. Your call. Let's agree this is enough knowledge for now. More information could cause an Epistemophobia, and we don't want that, do we? Please, enjoy the view from your train's window and look forward to our next meeting. .-. -.. -... .--. -.. ... / -.... -... --. -... ...-- .. ..-. .---- -....- ..... -... / .-. -.. -... .--. -.. ... Signed Your Cuppy Archeo: Shinar is an economic turn-based strategy set in the world of archeology. It blends the preparation period (turn-based strategy) with expeditions (real-time strategy) in unique gameplay mixup with a lot of small stories and grotesque humor. Key features Prepare and explore - New, fresh gameplay based on mixup of two genres Turn-based strategy and Real-time strategy. Hire and care - Find your best team and keep them in good shape. Or not, you can always replace them. Money and reputation - Try to get both. Find a balance between them and be the true winner. Collect and invest - There's no better way to get rich than by buying land. What's better than having land? Building your own buildings on your land. It's a great investment. Read and decide - Now and then you will receive a small story to keep your experience interesting. Every time you will have to decide and every time it will have consequences! Opponents and Vanessa - Meet memorable opponents, you won't forget them for a long time. And there's Vanessa. Such a shame she has a wig. Solo or with friends - Play solo or with up to 4 friends (hot seat). But keep in mind that after the game they won't be your friends anymore. Challenge reality - Check the facts, learn more about the history and try to find a proof that the developers were wrong because the world we are going to show you may make you challenge everything. Difficult subjects - Mental illnesses, addictions, thievery, slavery, paradigms, tribal mentality, corruption, pride, and murder. Economy end bankruptcy - Last but not least, do not bankrupt. It's like permadeath. You can withhold salaries only for a certain time, after that they will come. They will come and collect.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1001980/header.jpg?t=1588773461",
    "Price": 12.99,
    "Developers": "Artists Entertainment",
    "Publishers": "Artists Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_5248cdf617314dc82006f5aff96bb2b8b6573906.1920x1080.jpg?t=1588773461,https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_1d8784944adbb67042ea6aebdb58e53dedb29446.1920x1080.jpg?t=1588773461,https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_7c97493ca90313986384e5aa24bcb0cc849306c1.1920x1080.jpg?t=1588773461,https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_d941f96204c2c368e4f9110e8401ad6d9f8ddee6.1920x1080.jpg?t=1588773461,https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_432affb0ec4725b22f47c29c6a2856b567ad4ec9.1920x1080.jpg?t=1588773461,https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_e87930f7ac7835aead870a85f0babdc67de2061f.1920x1080.jpg?t=1588773461,https://cdn.akamai.steamstatic.com/steam/apps/1001980/ss_6e8670f336b9aad53ef760f5e18fbf18064bcfab.1920x1080.jpg?t=1588773461",
    "Slug": "archeo-shinar",
    "Meta Title": "Archeo: Shinar: Sep 11, 2019, Artists Entertainment and F...",
    "Meta Description": "Looking for information on Archeo: Shinar? Check out the release date (Sep 11, 2019), developer insights from Artists Entertainment, and a complete game...",
    "Alt Text Image": "Official header image for Archeo: Shinar game - Steam 1001980",
    "Canonical URL": "https://gusku.site/game/archeo-shinar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Archeo: Shinar\", \"description\": \"Looking for information on Archeo: Shinar? Check out the release date (Sep 11, 2019), developer insights from Artists Entertainment, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artists Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Artists Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1001980/header.jpg?t=1588773461\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}