{
    "AppID": 1028520,
    "Name": "Brave Battle Saga - The Legend of The Magic Warrior",
    "Release date": "Mar 18, 2019",
    "About the game": "This world was once a civilization brought together by magic and technology. As civilization advanced, those who possessed the power of technology and magic segregated due to their differences in ideas and formed two separate societies of humans and demons. The human race continued to develop their civilization with technology, while the demons started to construct their own society with magic. This balance did not hold for very long, however, and technology was gradually replacing magic. Soon afterwards, an ultimate weapon from the technological civilization appeared, and in an ironic twist of fate, lost control and destroyed the whole world, along with all civilization therein. Nearly a thousand years have gone by without incident, until one day the ancient technology lying deep within the Earth was excavated. Mankind was once again on its way to committing the same mistakes of the past… Since long ago, the world has stood by four mysterious temples controlling the forces of nature, each protecting a kingdom. The Cruz Kingdom governs the water with the Moon Temple. It paints a beautiful picture of a land covered in water. The bold Galien Kingdom emerges as a tropical desert climate near the Sun Temple. It is a unified, intrepid kingdom. In the polar regions is the Zak Empire. Its technical research has flourished with the power of the Star Temple. The Lear Kingdom lies among a picturesque scenery protected by the Wind Temple. It is a matriarchal society. The world was at peace, when suddenly demons from legend appeared throughout the land. Humanity panicked and was at a loss. What have the demons come for? What secrets do the temples hold? Just who is behind all of this? Who will see through this shrouded mystery? Battle Saga - The Legend of the Magic Warrior is a Sega Genesis game that came out only in Taiwanese markets. It has been fully translated to English. The Game features great battle system, party system, spells, summons, and a turn based fighting engine. Enjoy over 40 hours of gameplay for only $4.99!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1028520/header.jpg?t=1643920985",
    "Price": 9.99,
    "Developers": "Chuanpu",
    "Publishers": "Piko Interactive LLC,Bleem!",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1028520/ss_162f102ad8f84682988d88995f55f8d497dc762a.1920x1080.jpg?t=1643920985,https://cdn.akamai.steamstatic.com/steam/apps/1028520/ss_e99069ed647e4eec1cb9878197cf5396e0c7ef3d.1920x1080.jpg?t=1643920985,https://cdn.akamai.steamstatic.com/steam/apps/1028520/ss_5d669f87cb86487139c36a72d0df00d9e1dedfdb.1920x1080.jpg?t=1643920985,https://cdn.akamai.steamstatic.com/steam/apps/1028520/ss_75b6277bd08b7df2c07a35510ad84754fe32f7f4.1920x1080.jpg?t=1643920985,https://cdn.akamai.steamstatic.com/steam/apps/1028520/ss_69dbb28e4fbc9cd9139af8f6a5053cd6a5bc676e.1920x1080.jpg?t=1643920985",
    "Slug": "brave-battle-saga-the-legend-of-the-magic-warrior",
    "Meta Title": "Brave Battle Saga - The Legend of The Magic Warrior: Mar ...",
    "Meta Description": "Looking for information on Brave Battle Saga - The Legend of The Magic Warrior? Check out the release date (Mar 18, 2019), developer insights from Chuan...",
    "Alt Text Image": "Official header image for Brave Battle Saga - The Legend of The Magic Warrior game - Steam 1028520",
    "Canonical URL": "https://gusku.site/game/brave-battle-saga-the-legend-of-the-magic-warrior",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Brave Battle Saga - The Legend of The Magic Warrior\", \"description\": \"Looking for information on Brave Battle Saga - The Legend of The Magic Warrior? Check out the release date (Mar 18, 2019), developer insights from Chuan...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chuanpu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Piko Interactive LLC,Bleem!\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1028520/header.jpg?t=1643920985\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}