{
    "AppID": 548760,
    "Name": "CameraBag Photo",
    "Release date": "Nov 1, 2016",
    "About the game": "CameraBag Photo: Filter-Focused Photo Editing for Mac and PC. What does 'filter-focused' photo editing mean? It means that CameraBag Photo has the advanced tools you need to make your images look just how you want, but in an interface that makes it incredibly easy to re-use the styles you develop as custom filters. Or to start with existing presets to emulate classic film stock, or to batch apply the same style to hundreds of photos. It means that CameraBag is built from top to bottom to help you develop a unique photographic style that is distinctly your own. We’ve designed CameraBag Photo to sit in the sweet spot of photo software: it’s much more versatile and powerful than cheesy “one-click” filter apps, but much lighter, quicker, and more intuitive than bloated traditional “pro” photo software. CameraBag's interface is focused on building up a series of image adjustments (or loading existing filters made up of a series of adjustments) and tweaking them as needed. You can easily see every adjustment you've applied to your image in the bottom tray, adjust their controls, reorder or delete them, or save what you've got as a new filter. Key Features - 150+ built-in high-quality adjustable filters - Full suite of 30+ photographic tools, including advanced curve editors - Build your own entirely new filters from scratch or from existing filters - Elegant, modern interface - Innovative tools not found anywhere else, such as CameraBag's curve-based color corrector - Fast image processing via the revolutionary Analog Engine - 32-bits-per-component color depth - Entirely non-destructive editing process - Easy layering of filters and adjustments - Quicklooks and previews for fast decision making - Watermarking and custom image-based borders - Batch processing - RAW format support CameraBag Photo is the newest version of CameraBag (the previous major release was called CameraBag 2, so this is technically version 3). We've added a whole bunch of cool stuff, here are some of the major things: - Masking - 4-Way color wheels - Multi-document tabs - Live pixel inspector - Animated hover previews - Dynamic preview chooser - Collapsible tool and filter sections - Updated look - Color management - Render queue - Speed improvements - Dozens of new filters You can start or finish with over 150 fully-editable included presets, to which you can add an infinite number of your own. From classic film stock emulation to color correction setups to versatile color and B+W styles, CameraBag Photo has you covered. Here are some of the filter groups included: - B+W Essentials - Classic Photography - Color Essentials - Color Correction - Film Grain - Film Stock - Filtered B+W - Mattes - Monocolor - Vintage - And More...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/548760/header.jpg?t=1558440860",
    "Price": 0.0,
    "Developers": "Nevercenter",
    "Publishers": "Nevercenter",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/548760/ss_eb702e3a59efdd885db72896f1a7e937eeefc03c.1920x1080.jpg?t=1558440860,https://cdn.akamai.steamstatic.com/steam/apps/548760/ss_dce8b1affd85f9413438091d7a28c41a3c82bdd8.1920x1080.jpg?t=1558440860,https://cdn.akamai.steamstatic.com/steam/apps/548760/ss_3fe959a7331ccf6335466e33dfe55cbb201396af.1920x1080.jpg?t=1558440860,https://cdn.akamai.steamstatic.com/steam/apps/548760/ss_2ba6bd71a67d2309b092be6dc492b29d396418a9.1920x1080.jpg?t=1558440860,https://cdn.akamai.steamstatic.com/steam/apps/548760/ss_b146bcf09a0b2584bdc1d54832a8d8472e492214.1920x1080.jpg?t=1558440860",
    "Slug": "camerabag-photo",
    "Meta Title": "CameraBag Photo: Nov 1, 2016, Nevercenter and Full Overview",
    "Meta Description": "Looking for information on CameraBag Photo? Check out the release date (Nov 1, 2016), developer insights from Nevercenter, and a complete game summary.",
    "Alt Text Image": "Official header image for CameraBag Photo game - Steam 548760",
    "Canonical URL": "https://gusku.site/game/camerabag-photo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CameraBag Photo\", \"description\": \"Looking for information on CameraBag Photo? Check out the release date (Nov 1, 2016), developer insights from Nevercenter, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nevercenter\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nevercenter\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/548760/header.jpg?t=1558440860\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}