{
    "AppID": 241410,
    "Name": "CastleStorm",
    "Release date": "Jul 29, 2013",
    "About the game": "Welcome to the world of CastleStorm, a super genre mashup of 2D physics destruction mashed with tower defense brawler! CastleStorm was born out of the fond childhood memory of building and destroying LEGO castles. The clouds bring rumors of war…It’s Knights vs. Vikings in CastleStorm, where medieval warfare meets 2D physics-based destruction! Controlling the battle in real time, players will harness the power of medieval artillery, manage a fearsome ground attack, and cast powerful spells! CastleStorm features a story-driven solo campaign, a custom castle editor, online multiplayer, co-op modes, and more. Building castles and knocking them down has never been so much fun! CastleStorm is a physics based tower destruction game, combining elements of real time strategy, resource management, and a beautiful blend of challenging gameplay scenarios. Multiplayer battles and Co-Op. CastleStorm features multiple modes of multiplayer action for both local and online play: • 1 vs. 1 split-screen mode, simply try and beat your opponent • Survival Co-op: Two players team up to fight off waves of enemies together! One player will control the ballista, the other controls ground forces • Last Stand Co-op: Both players control a hero and fight off endless waves of enemies together! Build your own castle! CastleStorm features a tower construction editor allowing players to construct their own custom castles that will be used in battle. Castles must be constructed wisely, as choices determine which types of troops and resources will be available during battle! Twelve incredibly beautiful environments and a comical story. Sir Gareth leads his troops into battle against the raging Vikings to recover the stolen gem and bring peace to the realm! Multiple paths to victory. You can choose how to defeat your enemy. Capture the flag, destroy their castle, or complete another predetermined level objective in order to claim victory. Each level features multiple objectives, each with their own rewards! An arsenal that would make any medieval warrior proud! Harness the power of medieval ballista weaponry, and launch an assortment of explosive weapons including Morningstars, Apple Grenades, Homing Eagles, and even flying sheep to defeat an onslaught of enemies trying to capture your flag and destroy your castle. Deploy a fearsome ground attack of swordsmen, knights, and donkey riders in order to protect your castle gates, and if all else fails, call upon powerful spells to help keep the enemy at bay. You’ve won the battle, now power up so you can win the war! As you power up in CastleStorm, new weapons and troop classes become available for use in battle. #StormingCastlesIsSoMuchFun",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/241410/header.jpg?t=1617104614",
    "Price": 9.99,
    "Developers": "Zen Studios",
    "Publishers": "Zen Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_9eb421c315bc1bc1779ac9bf8ce6923d78d16597.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_091d27dbf359e20360732c2342bfa851f1c1e7b4.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_cfe5b09a57ac0388922867fce37175f186cc5dd6.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_c7c13a3c45049f5c9fcbfdd7ed034aabf671fe32.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_08ad5628f3cf7035efe2c6653fb32c1cbc5ec46b.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_770358cf55adbc58e86d529b2b455c4c57d6a7dc.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_38666a52ad761490dfcd738ba8c3a43ae0147ca8.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_528f5ac77e660e16dfedf8e7b7390d8a00b4800f.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_b9a45d69cdd6cb5c4d22dbac1df86827c7cdcd64.1920x1080.jpg?t=1617104614,https://cdn.akamai.steamstatic.com/steam/apps/241410/ss_aba09e421e17a93be5b824e94fbf266c8e77b276.1920x1080.jpg?t=1617104614",
    "Slug": "castlestorm",
    "Meta Title": "CastleStorm: Jul 29, 2013, Zen Studios and Full Overview",
    "Meta Description": "Looking for information on CastleStorm? Check out the release date (Jul 29, 2013), developer insights from Zen Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for CastleStorm game - Steam 241410",
    "Canonical URL": "https://gusku.site/game/castlestorm",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CastleStorm\", \"description\": \"Looking for information on CastleStorm? Check out the release date (Jul 29, 2013), developer insights from Zen Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zen Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zen Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/241410/header.jpg?t=1617104614\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}