{
    "AppID": 1340300,
    "Name": "Crazy Kung Fu",
    "Release date": "Sep 25, 2020",
    "About the game": "Train to become the greatest Kung Fu Master the world has ever seen. You will begin as a tourist to Martial Arts, with no experience and slow reflexes. You will progressively move onto harder tiers of training, faster and more complex, until you no longer need to think but simply react. TRAIN MODE Train against a static dummy through variuous Tiers of increasing difficulty, speed and challenges as you improve both your refexes and your focus. FIGHT MODE Fight in the arena with a more active and reactive dummy that follows your every move. Move around it in full 360 to dodge incoming attacks and gain strategic positions for unleashing blows. FOCUS MODE Design your own level as to prepare for taking on a challenge. For example 1 dummy arm with only punches to train your punch power, choose 3 dummy arms with only blocks to work on those reflexes, or maybe 2 dummy arms with blades and punches to refine your reactive thinking. WING CHUN Play the Wing Chun Dummy Training game to practice Kung Fu shapes and forms. You will go through a variety of levels as you successfully learn the moves and gain more knowledge on your journey to becoming a Kung Fu Master. In Crazy Kung Fu you will fight against a wooden training dummy, using your hands as well as your body to punch, block and dodge the various spinning arms. Throughout your journey you will learn how to be a master at all of these, building muscle memory at first, to then rely on instinct and quick thinking. All your moves are tracked, you will have statistics on speed, accuracy, strength, all of which will help you assess your progress, target your weaknesses and push towards becoming a Kung Fu Master. There are also a variety of modifiers to challenge yourself futher and gain a score boost: Archery: Arrows being shot at you while you train. Faster: Increased dummy speed. Pads: Extra pads to hit in between movements. Infinite: Train until you can't.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1340300/header.jpg?t=1645797187",
    "Price": 4.99,
    "Developers": "Field Of Vision",
    "Publishers": "Field Of Vision",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1340300/ss_7e9674b6a1dd205fe2c129dfc7bc855f50127cff.1920x1080.jpg?t=1645797187,https://cdn.akamai.steamstatic.com/steam/apps/1340300/ss_99f7b7af8938695c81c44653a6d05fd3412848bd.1920x1080.jpg?t=1645797187,https://cdn.akamai.steamstatic.com/steam/apps/1340300/ss_e82f921759e60a75705e4613f15fde823426361d.1920x1080.jpg?t=1645797187,https://cdn.akamai.steamstatic.com/steam/apps/1340300/ss_65e0f9cc35b707f3a99583d1fb34fa7b8a902b97.1920x1080.jpg?t=1645797187,https://cdn.akamai.steamstatic.com/steam/apps/1340300/ss_6113cdae3753389963ebc923de79c84638050722.1920x1080.jpg?t=1645797187",
    "Slug": "crazy-kung-fu",
    "Meta Title": "Crazy Kung Fu: Sep 25, 2020, Field Of Vision and Full Ove...",
    "Meta Description": "Looking for information on Crazy Kung Fu? Check out the release date (Sep 25, 2020), developer insights from Field Of Vision, and a complete game summary.",
    "Alt Text Image": "Official header image for Crazy Kung Fu game - Steam 1340300",
    "Canonical URL": "https://gusku.site/game/crazy-kung-fu",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crazy Kung Fu\", \"description\": \"Looking for information on Crazy Kung Fu? Check out the release date (Sep 25, 2020), developer insights from Field Of Vision, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Field Of Vision\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Field Of Vision\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1340300/header.jpg?t=1645797187\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}