{
    "AppID": 745650,
    "Name": "Cross Pixels",
    "Release date": "Apr 17, 2018",
    "About the game": "Cross Pixels is a collection of over 350 handcrafted Picross Puzzles. It is a grid based puzzle game solvable through logic. Other names for this kind of puzzles are Nonogram, Paint by number or logic square. The concept is easy to learn and well explained in the optional tutorial. Use the numbers on every line of the grid and reveal the hidden picture. No unlocking required. All the level are sorted into different sizes. Start with whatever you feel is appropriate for your skill level. Solve levels with sizes of 5x5 up to 25x25 or even bigger ones in the workshop. Sizes up to 50x50 are possible. Make your own puzzles. The included Editor allows you to easily create your own puzzles and share them with the community. All levels are automatically checked if they are solvable and if the solution is unique. Community: Cross Pixels integrates the Steam Workshop. This allows you to both play all the community created levels and to share your own creations. Triangle Game Mode: In addition to normal rectangle puzzles Cross Pixels offers Triangle Puzzles with which even experienced Picross players can challenge themselves. Player Comfort: We tried our very best to ensure that you can enjoy your time with Cross Pixels. Features like 'undo' allow you to easily correct mistakes. Next to the cursour the current number of blocks placed in the line is displayed to avoid unnecessary counting. Several colours allow you to try out solutions if you are unsure, without the risk to forget where you had already placed blocks. Adjustable autocomplete and coloured numbers features allow you to configure the game behaviour to your liking and reduce unneccessary busy work. Hint: If you ever should get stuck our hint function may help you by pointing out possible steps and explaining the neccessary concepts to you. Hints are given in multiple stages. First you'll find out where to look and then learn how to deduce new cells. You don't have to use it but if you should ever need it, it will be there for you ;D Features: -Over 400 handcrafted levels -Triangle Puzzles -Hint functionality -Level Editor (Create your own levels with custom sizes in between 5x5 and 50x50) -Share your levels with the whole Steam Community (Workshop Integration) -Unique Solution and the information if the puzzle is solvable through line logic or if you need more advanced techniques. -Comfort Functions (undo, block counting, easy line drawing, autocomplete, coloured numbers...)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/745650/header.jpg?t=1523960625",
    "Price": 6.99,
    "Developers": "crowgames UG (haftungsbeschr채nkt)",
    "Publishers": "crowgames UG (haftungsbeschr채nkt)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/745650/ss_b98a81f9558aa168fc81185ae041f8b7ca1de44f.1920x1080.jpg?t=1523960625,https://cdn.akamai.steamstatic.com/steam/apps/745650/ss_63174c64394885b557a34e80a3a7722f484c4ad8.1920x1080.jpg?t=1523960625,https://cdn.akamai.steamstatic.com/steam/apps/745650/ss_f555340e47398dc2de1eb98673c31c018acb848e.1920x1080.jpg?t=1523960625,https://cdn.akamai.steamstatic.com/steam/apps/745650/ss_168ca30c1ba28420cfb70a8bf23e35a8122c6538.1920x1080.jpg?t=1523960625,https://cdn.akamai.steamstatic.com/steam/apps/745650/ss_a66cec7ca40c8eb9d737f5e8bb5ee9d7f4902638.1920x1080.jpg?t=1523960625,https://cdn.akamai.steamstatic.com/steam/apps/745650/ss_9e75fed7ad2a2e29a21b491d39e05fe10ae875df.1920x1080.jpg?t=1523960625",
    "Slug": "cross-pixels",
    "Meta Title": "Cross Pixels: Apr 17, 2018, crowgames UG (haftungsbeschr채...",
    "Meta Description": "Looking for information on Cross Pixels? Check out the release date (Apr 17, 2018), developer insights from crowgames UG (haftungsbeschr채nkt), and a com...",
    "Alt Text Image": "Official header image for Cross Pixels game - Steam 745650",
    "Canonical URL": "https://gusku.site/game/cross-pixels",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cross Pixels\", \"description\": \"Looking for information on Cross Pixels? Check out the release date (Apr 17, 2018), developer insights from crowgames UG (haftungsbeschr\\u00e4nkt), and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"crowgames UG (haftungsbeschr\\u00e4nkt)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"crowgames UG (haftungsbeschr\\u00e4nkt)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/745650/header.jpg?t=1523960625\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}