{
    "AppID": 1113090,
    "Name": "Crown of the Empire",
    "Release date": "Sep 7, 2020",
    "About the game": "The life of Elena, the first lady-in-waiting to Her Majesty, isn't so much about balls, corsets and fancy hats as it is court intrigue, secret service and life-threatening covert operations for the good of the Empire. For example, Elena's last mission was to safely recover stolen ancient relics. An unknown thief had ransacked the national museum and got away with the namesakes of the empire's oldest rulers. A team of detectives picked up a trail that led across the border, but then disappeared. The Queen summoned Elena. 'The items stolen are of paramount value to the empire and crown,' she said in a slightly wavering voice. 'We mustn't lose them.' 'I understand, your Majesty,' Elena answered. 'But announcing their disappearance would only complicate the matter, so you must carry out your duty in the strictest secrecy! You shall at once be sent abroad under the guise of an ambassador to carry out your investigation in secret. You must track down the perpetrator and force them to return what was stolen.' Elena soon found herself on a top-secret covert mission of vital interest to the Crown. Her first order of business upon arrival was notifying the local police of the missing valuables. 'Were the items stolen from your hotel or at the port?' Asked the chief of police, his moustache twitching like a walrus'. 'Neither,' Elena answered, 'they were stolen on the boat, but I know for certain the culprit is still here. 'Hm...very well,' the officer let out with an air of authority. 'We'll get on the case at once, don't you worry. There isn't a criminal out there who can slip away from me...' By evening, the list of suspects had been narrowed down to a few names. Elena asked the chief if she could accompany the detectives to identify the culprit, and he gave his permission. Elena was not only sharp as a tack, but was well-versed in the new deductive method, which had already helped her crack open five robbery cases, two murders and one case of destruction of hotel property. In the end, Elena and the detective team tracked down the artifact thief and were just waiting for the judge to sign the arrest warrant, when an urgent telegram came in from the Prime Minister with orders to meet that very night. She had no choice but to return home that very instant and put her operation on hold. What was it that happened in the palace that forced her to abandon her job and return immediately? Join Elena on an unforgettable adventure through an alternate Victorian world across the endless Emperor Desert Valley, the green banks of the Nile, a volcanic island and more! Will good conquer evil? Can Elena return the Crown of the Empire? Get ready for: - A unique alternate world full of wondrous machines and mysterious creations! - An intriguing plot full of mystical twists and covert secrets. - Vibrant graphics and fun animation. - Enjoy more than 40 exciting levels in 4 different locations. - 3 difficulty levels. - Helpful bonuses: work accelerators, production accelerators and movement accelerators. - Simple gameplay and easy-to-understand instructions. - More than 20 hours of exciting gameplay for any age. - Fun in-game music. The Crown of the Empire: help find the stolen crown!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1113090/header.jpg?t=1599494151",
    "Price": 4.99,
    "Developers": "Toyman",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1113090/ss_3478e6c3419f03fb1e601e0dbb32b99f2977b4c1.1920x1080.jpg?t=1599494151,https://cdn.akamai.steamstatic.com/steam/apps/1113090/ss_7c78cf33afcf603f309c38f6485318447329ee6e.1920x1080.jpg?t=1599494151,https://cdn.akamai.steamstatic.com/steam/apps/1113090/ss_4f308108b2dbddc2c17221cb3ce2f9b116b8a426.1920x1080.jpg?t=1599494151,https://cdn.akamai.steamstatic.com/steam/apps/1113090/ss_1498cd8832b150f81f7c53116305c5f4b00c1737.1920x1080.jpg?t=1599494151,https://cdn.akamai.steamstatic.com/steam/apps/1113090/ss_152ee337deaa9536a84b5c02949e02cf1512a6be.1920x1080.jpg?t=1599494151,https://cdn.akamai.steamstatic.com/steam/apps/1113090/ss_fbb44d829d70bbaa19a87cc2641ba120f6833416.1920x1080.jpg?t=1599494151",
    "Slug": "crown-of-the-empire",
    "Meta Title": "Crown of the Empire: Sep 7, 2020, Toyman and Full Overview",
    "Meta Description": "Looking for information on Crown of the Empire? Check out the release date (Sep 7, 2020), developer insights from Toyman, and a complete game summary.",
    "Alt Text Image": "Official header image for Crown of the Empire game - Steam 1113090",
    "Canonical URL": "https://gusku.site/game/crown-of-the-empire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crown of the Empire\", \"description\": \"Looking for information on Crown of the Empire? Check out the release date (Sep 7, 2020), developer insights from Toyman, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toyman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1113090/header.jpg?t=1599494151\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}