{
    "AppID": 979310,
    "Name": "Disjunction",
    "Release date": "Jan 28, 2021",
    "About the game": "2048. Following the arrest of a prominent community leader, New York stands in disarray. Suspicions and allegations run rife throughout the city, as an insidious drug known as ‘Shard’ spreads throughout the underworld. With the city’s future in doubt, three hardened citizens rise to discover the truth and uncover a conspiracy threatening to alter the city’s fate. Inspired by tech noir classics, Disjunction is an intensely atmospheric stealth-action RPG that follows a trinity of interwoven narratives, and features a reactive story where your actions have real, persistent consequences. Choose your playstyle and use an arsenal of futuristic tech, cybernetic upgrades and weapons to blast through levels in brutally fast combat, or take a silent approach by using stealth and non-lethal takedowns to leave without a trace. Nobody needs to die… unless you decide they must. KEY FEATURES: Challenging stealth-action gameplay that lets you play the way that suits your style, whether it’s sneaking through levels or attacking head-on. Three playable characters, each with individual abilities, cybernetic upgrades and talents to customise your playstyle. A reactive story where the player’s choices have real consequences. Stylized pixel art environments and characters. Atmospheric musical score by composer Dan Farley. Gameplay: Disjunction features unique stealth-action mechanics and abilities for each of its three playable characters, giving players the freedom and flexibility to choose the playstyle that suits them. Tackle encounters in lethal, high-octane combat, or use your wits to stick to the shadows, utilizing distraction techniques and non-lethal attacks to reach your objective. Augmentation: Unlock cybernetic upgrades to augment your abilities via upgrade trees, and build upon your playstyle to improve your stealth or increase the lethality of attacks through talent trees. Find upgrade kits to reach your true potential and become a feared killer or remain anonymous throughout New York's shady underground. Reactive Story: Experience a reactive story shaped by your actions. Your approach to situations can have serious consequences for the future of New York City, with the repercussions of choosing to spare or kill even one person rippling throughout the underworld. Crush entire factions or convince them to aid your cause. Your destiny is yours to write. The World: The year is 2048, and the world is plagued with economic downturn, environmental disaster, and societal destabilization. In the United States, natural resource scarcity and severe climate change have led to massive urbanization, with millions of Americans forced to seek new lives among the sprawling steel and concrete of America’s cities. These swelling urban populations, coupled with intense civil unrest, have culminated in greatly increased crime rates, with many cities becoming dense hives of vice and lawlessness. City governments and law enforcement do their best to stem the rising tide of crime, but are often ineffective due to severe corruption and the increasing sophistication of American criminals.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/979310/header.jpg?t=1650620592",
    "Price": 15.99,
    "Developers": "Ape Tribe Games",
    "Publishers": "Fireshine Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_e36c7354dc4d13dc3371673cf2418715ac544524.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_90eae621852aa5d4d032c8deefb7ed3b56f69fb0.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_e6e2822ad5e25d91ec4c323d48caf223f7501401.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_4b77321716f5d8eae56c58d7f30f2e4ff29d69db.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_44b543456e89432d9bd3f4b58cebc67052d30da8.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_57cb74d2aa6c55d310a8bc78a2572d27a7a5d035.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_bd5b651542a3de7321a55805b38d5ef806ece8f7.1920x1080.jpg?t=1650620592,https://cdn.akamai.steamstatic.com/steam/apps/979310/ss_e893162e4f35993e4accb269532919b004d5e783.1920x1080.jpg?t=1650620592",
    "Slug": "disjunction",
    "Meta Title": "Disjunction: Jan 28, 2021, Ape Tribe Games and Full Overview",
    "Meta Description": "Looking for information on Disjunction? Check out the release date (Jan 28, 2021), developer insights from Ape Tribe Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Disjunction game - Steam 979310",
    "Canonical URL": "https://gusku.site/game/disjunction",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Disjunction\", \"description\": \"Looking for information on Disjunction? Check out the release date (Jan 28, 2021), developer insights from Ape Tribe Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ape Tribe Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fireshine Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/979310/header.jpg?t=1650620592\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}