{
    "AppID": 1687100,
    "Name": "Era of Combat: Boxing",
    "Release date": "Feb 25, 2022",
    "About the game": "Era of Combat: Boxing is a multiplayer VR experience that strives to reward physical and martial prowess. Grab a friend, or a complete stranger, and face-off for a heart-pumping, head-thumping good time! Make 'em sweat! ************************************************************ READ BEFORE YOU PURCHASE EARLY ACCESS ************************************************************ PLEASE read through our materials in the discussions including 'What to Expect From Early Access'. You can also watch our casual walk-through on YouTube (and above) with the Dev and remember that this is an EARLY ACCESS game with almost NO SOLO PLAY content ATM, and VERY LITTLE polish. That will change as we move along, but we want to be up-front and very clear to tentative players. If you are interested in getting in early and helping with feedback about a multiplayer VR boxing game then this is for you! Join our discord and make sure you have some friends to play with because finding unscheduled pVp matches is still sporadic as our player base grows. Of course we'd love to have your expertise help us grow! BE AWARE BEFORE BUYING: - NOTHING IN THIS GAME IS BALANCED YET (that's why we are in Early Access) - THE SINGLE AI IS FOR TARGET PRACTICE ONLY (He is a TESTING opponent for our team to gather feedback on, nowhere near finished. During Early Access we are developing solo play AI, making them intelligent and adding 25+ punch combos, weaves, blocks, dodges as well as an additional 19 more AI opponents). But for the love of all that is good, please don't buy this game so early into Early Access if you just want to test yourself against the AI - you WILL be disappointed and you WILL leave a bad review ;-) - THE HIT REACTIONS ARE ROUGH ROUGH ROUGH (the arms and gloves don't feel very good to hit on the opponents yet) - this is our current focus for the next batch of updates and has always been on our roadmap (check out our detailed plans on discord if you're interested in seeing where we're taking this game in the very near future). - ANIMATIONS are all first drafts. - MULTIPLAYER WORKS WELL BUT IS STILL VERY ROUGH OVERALL - we're aiming for realism and have anti-spam hitting mechanics. But you aren't going to easily find opponents yet, so if you buy, plan to join discord to schedule your matches, OR buy with a friend who you can regularly play with. So again, if you are purchasing this because you expect the feel of a boxing game that has many YEARS in development then please PASS for now. We will get there! But this game is less than SIX MONTHS through development (with one dev) :-) and we ONLY launched this early to start letting people know about what we are building and to give folks an opportunity to jump in for some fun (unpolished) pVp. The game is rough! So if you're joining us now, expect ROUGH, but please don't hold that against us in your reviews at this point since we have gone to great lengths to warn you :-). Perhaps give us a chance to polish up the foundation before you judge us too harshly. We're building this game because we love boxing and PvP, and we are learning as we go. *NOTE THAT OCULUS SUPPORT IS PLANNED BUT NOT CURRENTLY SUPPORTED* Does it work? Usually (via cabled link). However, our recommendation is that you do NOT purchase Early Access at this time if you intend to play via Oculus. We will change our message here when we officially begin to support Oculus HMDs. ************************************************************ Use the solo training exercises, take on the AI, or jump right into what EOC Boxing was designed to do and challenge your friends to three different match types including exhibition, amateur or professional ranked fights where your reputation, stats, virtual cash, and boxer’s title is on the line. EOC is a physically demanding game that will push you to improve your cardio and your core. But you'll need some space to add this energetic workout to your routine. Make sure you have at least 1.5m by 2m of unobstructed space to swing and then tell your family members to stand back - WAY back. Or better yet, pick up another headset and challenge them to a no-impact, no-holds-barred grudge match to prove your unconditional supremacy! (separate VR rooms highly recommended) We want to stress once more that EOC is currently Early Access and we are looking for your feedback, so if you love boxing and don't mind giving us a glove (er hand), we're all ears about how we can make this game the best that it can possibly be. What’s coming up in the very near future? We’re glad you asked! Greater player customization, multiple avatars of gender and race, server moderated multiplayer cash, careers, and titles. A large expansion of the single player mode (we started with multiplayer in mind and need some AI polish during Early Access to give you the solo challenge you deserve). We'll be launching a number of AI opponents to make you sweat on your way to the top in upcoming free content upgrades as we move toward completing our Early Access roadmap. You’ll progress through different venues and earn your place in the hall of champions. EOC Boxing was designed from the ground up to support multiplayer VR and we want to ensure that EOC strives for realism while striking the balance in playability. We trust that Early Access already offers players a stable and challenging multiplayer experience that is above all else, entertaining.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1687100/header.jpg?t=1646251386",
    "Price": 19.99,
    "Developers": "Nodtech Creative Industries Ltd.,Era of Combat Boxing Ltd.",
    "Publishers": "Nodtech Creative Industries Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_d3c99c42ea66b0d43d4db380d7c41561aa0bae84.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_f126ddf41560b640e7d9d4cb4aa232009163df85.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_60fe974582a5a7cfefd8d9fb1c1980cfb03c4edd.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_1c55d5a414576c293e5c13cfcaddb94fa0ae2b43.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_2538e45e8ef6ea6afcace810bf0e36d62f7b8609.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_4bff93318aa870e44681127981fc5c4091a5fe63.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_d8f22c05604b9d5047582de18468f373349aba34.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_90c0a83e0d5f7f6f3dccd20e465e5d643b56c25c.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_3e0d1cf992c75249cf8c09c1ec6df04451e72417.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_ffdb145757b735fe3384a155df199d7e117aa3c9.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_6fcd84ecfd2c1c56fd4127cab36aa5b638a152c4.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_3d54aa4d278a08915eb62cd879e558b42ba57b72.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_1f061bfc953a713f9b40c4b9680706f270eadd66.1920x1080.jpg?t=1646251386,https://cdn.akamai.steamstatic.com/steam/apps/1687100/ss_4d79b467cc5c4476e8a7c271e8479098d8f22f2a.1920x1080.jpg?t=1646251386",
    "Slug": "era-of-combat-boxing",
    "Meta Title": "Era of Combat: Boxing: Feb 25, 2022, Nodtech Creative Ind...",
    "Meta Description": "Looking for information on Era of Combat: Boxing? Check out the release date (Feb 25, 2022), developer insights from Nodtech Creative Industries Ltd.,Er...",
    "Alt Text Image": "Official header image for Era of Combat: Boxing game - Steam 1687100",
    "Canonical URL": "https://gusku.site/game/era-of-combat-boxing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Era of Combat: Boxing\", \"description\": \"Looking for information on Era of Combat: Boxing? Check out the release date (Feb 25, 2022), developer insights from Nodtech Creative Industries Ltd.,Er...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nodtech Creative Industries Ltd.,Era of Combat Boxing Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nodtech Creative Industries Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1687100/header.jpg?t=1646251386\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}