{
    "AppID": 680930,
    "Name": "Fairy Lands: Rinka and the Fairy Gems",
    "Release date": "Aug 25, 2017",
    "About the game": "Weird gems are falling from the skies! Who will manage to do something about it? Maybe Rinka? Well, Wiseghaika surely hopes that somebody will do something. Some fairies managed to learn how to use them as a weapon, so fights will be less painful. But not all of them have mastered this art. To be exact - neither of our six heroes can use those mysterious stones in big barrages. This... might give you some problems. But c'mon, since when were heroes stronger that their foes? (Please, don't say it in front of Skootis.) Back to gems! Weird thing about them - when two of the same color collide, they go 'ding' and release some weird spheres. Those spheres can absorb other gems! Red spheres, for example, absorb all red gems, they meet, but will stop after absorbing any gem that isn't red. The same happens with others, mostly-maybe! ('^' ) If gems will touch left side of your screen, you'll get hurt! Does it makes sense? What are 'screens'? I heard abut them from Astro-fairies, but now they are extinct, so I can't ask them. Gray gems are different and weird! They won't hurt you and most likely will disappear after touching that weird shield in front of you. It is almost like they're devoid of energy. But you shouldn't take them too easy - You can't destroy them as there are no gray gems in your arsenal, so, only way is either to wait while they will be destroyed by the barrier, or make some sphere touch them. =about the Game Itself= This game is made in the vein of old puzzle-like games, without real twist. Just simple active puzzle.Or maybe there is some twist? For the first game made with this engine I think it is good job from my side, considering, that everything except music is made by sole silly me. Now, there is a couple known bugs that can occur, but won't destroy game too much, or maybe they are finally gone - couldn't get them last beta-testing session. Game just... likes to be important to you, so please remember to put it on a pause, if you suddenly need to do something else, while playing. ('^' ) Please, tell us about bugs, we'll be trying to fix them. Remember to save settings in OPTIONS, or else when you restart the game they'll go back to standard ones. Markiza Info-fairy - Young individual composed of only two things - information and desire to obtain new information. Sersh Tech-fairy - Lone wanderer, aimlessly pondering around Fairy Lands. Also he often loses his hand, so it is hidden in his pocket most of time. Roxanna Rag-fairy - Little silly girl with a big melodic dream. She is soft to the touch too. Volia Aqua-fairy - Self-confident boy made of magical clay who possesses ability to control water. He is water. He is sane. He loves to eat. Skootis Ash-fairy - She will be the strongest, you hear me? This is for sure is not her writings! But it is truth! Rinka Barbarian-fairy - This girl surely loves marzipan cakes. And to crush stuff when cake goes not into her belly. And hey, she is important! Story Art Odd Meat Odd meat Gameplay programming Translation help Odd Meat (with some idea assistance from testers) dsp 2003 Xitilon Music Testers Penguinum Firiat dsp2003 Okamisen Mr. RK Nekomata dsp2003 Elp2112 Xitilon Labtop 215 Okamisen",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/680930/header.jpg?t=1656093908",
    "Price": 2.3,
    "Developers": "OddMeat",
    "Publishers": "Phoenix Reborn Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/680930/ss_f1f3e0ac498113e65868852cdc8291556bf0d577.1920x1080.jpg?t=1656093908,https://cdn.akamai.steamstatic.com/steam/apps/680930/ss_eda5577270979e07692dc90057626ddf8d11bae2.1920x1080.jpg?t=1656093908,https://cdn.akamai.steamstatic.com/steam/apps/680930/ss_c3e31e9e730e03162b0240e69e036462bfac98f7.1920x1080.jpg?t=1656093908,https://cdn.akamai.steamstatic.com/steam/apps/680930/ss_5600991c9ecfb9b9255c5d6cd7d195ebdf4fe4b9.1920x1080.jpg?t=1656093908,https://cdn.akamai.steamstatic.com/steam/apps/680930/ss_8edfc550310107b388408f1d3b93cc5d55f4bbf3.1920x1080.jpg?t=1656093908,https://cdn.akamai.steamstatic.com/steam/apps/680930/ss_e4d91b95496a86d7fcac3ced935ede6700ea40bf.1920x1080.jpg?t=1656093908",
    "Slug": "fairy-lands-rinka-and-the-fairy-gems",
    "Meta Title": "Fairy Lands: Rinka and the Fairy Gems: Aug 25, 2017, OddM...",
    "Meta Description": "Looking for information on Fairy Lands: Rinka and the Fairy Gems? Check out the release date (Aug 25, 2017), developer insights from OddMeat, and a comp...",
    "Alt Text Image": "Official header image for Fairy Lands: Rinka and the Fairy Gems game - Steam 680930",
    "Canonical URL": "https://gusku.site/game/fairy-lands-rinka-and-the-fairy-gems",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fairy Lands: Rinka and the Fairy Gems\", \"description\": \"Looking for information on Fairy Lands: Rinka and the Fairy Gems? Check out the release date (Aug 25, 2017), developer insights from OddMeat, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"OddMeat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Phoenix Reborn Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/680930/header.jpg?t=1656093908\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.3, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}