{
    "AppID": 907190,
    "Name": "GRITS Racing",
    "Release date": "Mar 4, 2019",
    "About the game": "Strap on your dandy Tesla Shield and hop in your “Billy Bub” jalopy! GRITS Racing is a party game for up to 8 players that is part racecar simulator, part cartoon action. First, we built the most realistic 2D racer ever... and then we smashed it up into a bizarre party game out of a desire to play a “racing” game with more than just racing fans. We provide a physics playground with sim-like cars, minimal rules at the start, and you decide what to do with it by adding wacky rules between races. Good luck keeping your wheels on! ⚡ Includes the best 6-8 player couch minigame on the planet: Prison Dodgecar! Whaaaaat??? Old school gets a new-school makeover with more damageable physics objects than you can shake a two-dimensional polygon at. And, oh, the skids marks! Did we mention the oddly-satisfying skid marks that dirty up the track like never before? And the dirt doesn't end there. With debris everywhere from lost wheels, broken cars, oily tire tracks, various track objects, and up to 8 players on one screen generally making a mess of it all, just getting to the finish line can be a friend-testing brawl of gasoline-fueled tenacity. Welcome to the petrolpunk world of Globetrotter Racing where it's 1975, The Great War was the only world war, and microelectronics do not exist... probably because no one cared about going small after Nikola Tesla and his research institute learned to harness the power of lightning—to put it simply—and invented the Tesla Shield™ for use in automotive safety and generalized pedestrian protection (GPP). GRITS Racing is a family-friendly game for discharging some electricity in a safe environment. If somebody isn't laughing, giggling, snickering, or snorting most of the game... we aren't doing our job correctly. We get it, not all players will choose to race, so we've given them other ways to be part of the environment (for better or for worse). Features Realistic 2D car physics: Proprietary physics code These 2D cars actually steer via the wheels! Nearly all other games in this category just pivot their cars on center. We don't. You may not see a difference, but take a car for a spin and you will feel it. Quite possibly more realistic than a multiplayer couch game needs to be. Car body and wheels modeled as individual physics objects 4-wheel drive (AWD actually) 4-wheel steering (rear steering tapers off at speed) 4-speed transmission (plus reverse) modeled on a torque curve 430 ft-lbs (582 N-m) of engine torque Hand brake on the rear wheels Breakable wheel fasteners! What is it like to drive on 3 wheels and 1 stub? How about 1 wheel and 3 stubs? Smashing 2D barrier physics: Several barrier types with various friction coefficients and bounciness Some barriers are nailed down with breakable nails Some barriers are not nailed down at all Barriers take damage and show it Gripping 2D surface physics: Several surface types with various traction and drag coefficients Dry, wet, and oily variants Oil slicks Slicks appear organically when and where cars are broken apart during the race Slicks don't artificially wipe you out but only make whichever tires touch it slick If you can't handle a car with oil on some of the tires, that's your problem Oil slickness on tires tapers off over distance Skids and other tire marks vary in width by direction and vary in color by surface Mayhem Model 1-A: Pancake batter!* Pit stops to apply more pancake batter and replace missing wheels Drivers can fall out of cars in collisions Cars can be broken apart after all wheels are lost 4 cars per race (run to your trucks to launch your next car) Tesla Shields™ Force field that protects drivers from cars while on foot This can be very bad for naughty drivers Le Mans starts Seen any other games with this? Not all barriers are nailed down! (oh, yeah, we said that already) 8 players on one screen Bubba Prizes! Save and share game photos showing off the mess ya'll made of the track Mayhem Model 1-B: 5 oddball A.I. personalities for 4 A.I. cars (from speed racer to student driver; one car sets its personality based on number of players) Most A.I. features are now done but A.I. tuning will continue Mayhem Model 2: Wacky Wodifiers that ask “lucky losers” to periodically change the rules of the playground, like: • Greased car seats • Far-out fat tires • Tractor wheels • Dualies • Area 51 Tesla Shields • Reverse-polarity Tesla Shields • Disposable cars • Dragster chutes • Jousting lances • Speed limit for pros • Bring it on (Racing A.I.) • and more to come Leader Lamifiers that force “on-fire” players to add a rule to make things more difficult for the race leader, like: • Greasier car seat • Leader trikes • King of the hill • Finish-line showboating required • and more to come Tabletop mode 😲: Because games are more fun around a table (or on the floor) Prison Dodgecar minigame: Tesla Shields™​ installed on the car instead of the driver Like bumper cars meets billiards Hockey minigame ( Sansstíkdisco ​ in some countries): Tesla Magnets™ for run-n-gun puck control * The pancake batter story. Many years ago a racer was having trouble with the wheel lug nuts staying tight. So, in desperation, he was looking about his pit area for a new idea to fix it when he spied his leftover pancake batter from breakfast. He thought “It couldn't possibly be any worse, could it?” Well, actually, yes, it was worse. Much worse. But the crowd loved the results and the rest is lost in history. No one remembers for sure who this racer was but legend has it he was called Juan Tabo. Official records proving the existence of Jaun Tabo have yet to be found but this hasn't stopped governments from naming libraries and schools in his honor. The sport, then known as Wiggle Wheel Wacing, languished in the backwoods of the Southern United States for years before Gilded-Age billionaire, Billy Bub Worcestershire, bought the rights to it and turned it into the mid-budget international sport known as Globetrotter Racing. Mr. Worcestershire had previously made his fortune with the invention and popularization of deep-fried grits biscuits and, as he stated it, “I understand food batter and believe in the future of all its lucrative properties.” Deep-fried grits also became the sport's official snack food. When the Tesla Institute later developed the personal plasma energy shield (PPES), or Tesla Shield™, Mr. Worcestershire incorporated these shields into Globetrotter Racing and this variant, coincidently, became known as GRITS (Globetrotter Racing Incorporated, á la Tesla Shields). Apparently influenced by GRITS' stock-car cousin, Banger racing, the official snack food of GRITS became bangers and grits (deep fried and otherwise). Still reading? Then, join our Discord server and talk to us.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/907190/header.jpg?t=1658517462",
    "Price": 9.99,
    "Developers": "Muddy Desert",
    "Publishers": "Muddy Desert",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_c6e003382aba44581fdfa84586c340f9c703867a.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_2d5efd1c756e5ce61c50d1ec8847692c40f41c00.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_2105ada03f13ed7e0a78fe78c81a52572b89d139.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_3632975e27aa37594c1cbab01ba31bb268d91bd1.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_b984fd2550e0b221c332c91f3e55efc0cbf72982.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_a870f4e2c65d4133b535961a666309781b31a0dd.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_07c0b364c8bf7d0f3315f5318b8c46a3e1e46dc0.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_5e4321d35192620989ce0754768abf69d5ecbffc.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_1cd2ddf80bb3fbab50090672d427e148427ae40d.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_2bc1f3ac7069c160fea77f2c4b8c8588e2cd4b6d.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_6511a5ad4a29d40f2da2771b651b2d60f6cd2f2c.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_74b43e7cbbdd8bcc6c4a6a0008026ac9bc3939e6.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_68e698cc55c2f831d533ffb7436dbfd46b1411d8.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_7c9d1da537eaa86190340340772735d0616a0b53.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_5d3efcba05251f9caa09079990f787d6c530e35e.1920x1080.jpg?t=1658517462,https://cdn.akamai.steamstatic.com/steam/apps/907190/ss_1fd23850064749fe325b24a0a5114d6f40a9dbcf.1920x1080.jpg?t=1658517462",
    "Slug": "grits-racing",
    "Meta Title": "GRITS Racing: Mar 4, 2019, Muddy Desert and Full Overview",
    "Meta Description": "Looking for information on GRITS Racing? Check out the release date (Mar 4, 2019), developer insights from Muddy Desert, and a complete game summary.",
    "Alt Text Image": "Official header image for GRITS Racing game - Steam 907190",
    "Canonical URL": "https://gusku.site/game/grits-racing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GRITS Racing\", \"description\": \"Looking for information on GRITS Racing? Check out the release date (Mar 4, 2019), developer insights from Muddy Desert, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Muddy Desert\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Muddy Desert\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/907190/header.jpg?t=1658517462\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}