{
    "AppID": 1249510,
    "Name": "Hnefatafl",
    "Release date": "Apr 30, 2020",
    "About the game": "Hnefatafl is an ancient Scandinavian board game whose variants were played all over medieval Europe before chess was even invented. In those so called Tafl games two differently sized armies fight each other. The invading black army tries to capture the white king, while the defending white army tries to protect their king and help him escape. Often also called the Game of the Vikings Hnefatafl tells many stories, like the Moskowites' invasion of Sweden or the Viking hordes pillaging Britain. But no matter what the story is, one thing always stays the same: The hunt for the king . Even though the rules aren't complicated the game offers fascinating strategies and rewards tactical play. Try to surround the enemy pieces, plan ahead, lay traps and force your opponent into surrender. Will you capture the king for gold and glory? Can the loyal guards hold back the invading forces and secure the flight of their king? You can even create your own custom variants -- with over 200,000 different variants possible -- for online or offline play! Add jumping pieces, shieldwalls, undying guards, various setps and much more. This game includes many variants that are played all over the world, including: Historical Ard Ri Historical Brandubh Magpie Historical Tablut ('Saami') Foteviken Tablut Linnaeus' Tablut Copenhagen Hnefatafl Berserk Hnefatafl Historical Hnefatafl Fetlar Hnefatafl Old Hnefatafl Sea Battle Simple Tafl Tyr Coppergate Historical Alea Evengelii Custom variants for offline and online play All variants can be played online or offline against computer opponents or fellow humans. Even the custom variants. The legacy variants are those that were released within the last six years but are different from those used by the World Tafl Federation. Included features: Offline play for two humans Offline play against various computer opponents Offline play for two computer opponents Online play Ranked and unranked matches Tournaments Cross Platform Play between Android, iOS, Linux and Windows clients Play Online on your PC and continue on your phone, all with just one account Ingame Chat for Online play Achievements ELO Leaderboards Match Browser Share games with other players so that they can spectate Match Annotations - review any shared match and discuss strategies Match History - review any of your completed matches Tutorial/Rules included Partial Controller support for two players Quick or asynchronous online matches Search all played matches Online and Offline Statistics Join our Discord server to become a part of our fantastic community. Learn about the game, share tactics, look for opponents or partake in our channel conquering meta game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1249510/header.jpg?t=1625495718",
    "Price": 9.99,
    "Developers": "Philippe Schober",
    "Publishers": "Philippe Schober",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1249510/ss_302c862074a2d0d40f34a8495d87687d50e94004.1920x1080.jpg?t=1625495718,https://cdn.akamai.steamstatic.com/steam/apps/1249510/ss_5966da8918560aef988f33e482ce73380e410ce1.1920x1080.jpg?t=1625495718,https://cdn.akamai.steamstatic.com/steam/apps/1249510/ss_e059a85444ef1cccc53d5282084d9ea2f37369d8.1920x1080.jpg?t=1625495718,https://cdn.akamai.steamstatic.com/steam/apps/1249510/ss_9c6878a0a1b478491bf24f1007f596e81e0b692b.1920x1080.jpg?t=1625495718,https://cdn.akamai.steamstatic.com/steam/apps/1249510/ss_560e66b9de7b73870c4ad5b8503d639a0d8ad413.1920x1080.jpg?t=1625495718,https://cdn.akamai.steamstatic.com/steam/apps/1249510/ss_a3d9416e9225ef6159fabb232297531f8b4974c8.1920x1080.jpg?t=1625495718",
    "Slug": "hnefatafl",
    "Meta Title": "Hnefatafl: Apr 30, 2020, Philippe Schober and Full Overview",
    "Meta Description": "Looking for information on Hnefatafl? Check out the release date (Apr 30, 2020), developer insights from Philippe Schober, and a complete game summary.",
    "Alt Text Image": "Official header image for Hnefatafl game - Steam 1249510",
    "Canonical URL": "https://gusku.site/game/hnefatafl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hnefatafl\", \"description\": \"Looking for information on Hnefatafl? Check out the release date (Apr 30, 2020), developer insights from Philippe Schober, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Philippe Schober\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Philippe Schober\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1249510/header.jpg?t=1625495718\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}