{
    "AppID": 2004290,
    "Name": "Instant War",
    "Release date": "Jul 8, 2022",
    "About the game": "Join an alliance and defeat your opponents, using a large action panel available: army reinforcement, battle tactics, real-time strategy, assault forces, drone and even airstrike. In this 4X game, you can fight for strategic territories or resources points. Choose wisely how to manage your resources and massive army in order to defend your base from the other players. All your actions are in real-time strategy, so you can cooperate with your friend in order to defeat the toughest foes. As a multiplayer 4X game, the key to your victory will be your military strategy. Key features - Massive army: develop the military force that suit you the best! Choose between more that 50 different units (including tactical units). Each of them have their own specialties, strengths and weaknesses. It's your duty as a war commander to build the best army and military tactics for all situations. - Base building: Personalize and expand your Headquarter. Optimize your defense system, supervise military, medical, technical or A.I researches and create a farming empire that will allow you to take advantage of the other MMO strategy players. - Real-time Strategy: Team-up with your friends or with your alliance and lead night raids to your enemies' bases. Take part in a real 4X RTS warfare and destroy your opponents! - In-game events: Participate in daily events: PVE world boss, cross-server warfare, special events (Halloween, Christmas, etc.) - Alliances: Forge strategic alliances with other players and create the best RTS pro army. Find the best battle tactics, assemble your armies and lead your coalition to the top! - Dynamic battlefield: Use 3D terrain at your advantage to ambush your opponents in true real time strategy fashion. Storyline: Year 2040. States have collapsed and war rages on, unleashed technology has created a new generation of warfare. Discover secret weapons, grow your empire and become the one and only true Commander of this new order! From the ashes of the Old World, new nations have risen and become geopolitical superpowers. The arms race is back and fiercer than ever. Extensive budgets are poured to develop new tactical weapons powered by AI.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2004290/header.jpg?t=1657273676",
    "Price": 0.0,
    "Developers": "Playwing Ltd.",
    "Publishers": "Playwing Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2004290/ss_ea74043a7981a7d1da97f3b7e0523d0c4ca490f3.1920x1080.jpg?t=1657273676,https://cdn.akamai.steamstatic.com/steam/apps/2004290/ss_a0e13c8caf61802a5638b107e8dd3ba309818c56.1920x1080.jpg?t=1657273676,https://cdn.akamai.steamstatic.com/steam/apps/2004290/ss_c26e35337e32619e61fdeb380ad64184f8d75002.1920x1080.jpg?t=1657273676,https://cdn.akamai.steamstatic.com/steam/apps/2004290/ss_78e9a5d472fc7e5398035b021a8c1cc2085822a4.1920x1080.jpg?t=1657273676,https://cdn.akamai.steamstatic.com/steam/apps/2004290/ss_b4fe62817fe1f5305270449287107afd8c8c11e4.1920x1080.jpg?t=1657273676",
    "Slug": "instant-war",
    "Meta Title": "Instant War: Jul 8, 2022, Playwing Ltd. and Full Overview",
    "Meta Description": "Looking for information on Instant War? Check out the release date (Jul 8, 2022), developer insights from Playwing Ltd., and a complete game summary.",
    "Alt Text Image": "Official header image for Instant War game - Steam 2004290",
    "Canonical URL": "https://gusku.site/game/instant-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Instant War\", \"description\": \"Looking for information on Instant War? Check out the release date (Jul 8, 2022), developer insights from Playwing Ltd., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Playwing Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Playwing Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2004290/header.jpg?t=1657273676\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}