{
    "AppID": 581910,
    "Name": "Iron Armada",
    "Release date": "Dec 29, 2017",
    "About the game": "Iron Armada is a space-faring combat game built from the ground up with full multiplayer compatibility in mind. Play how you want with your friends—mine and harvest resources, salvage ship parts, build and crew a variety of ships with no restrictions and near-limitless potential. Iron Armada is incredibly easy to pick up and learn, and is very approachable whether you are a hardcore or casual fan! Construct new ships using the resources your team mines from asteroids, salvages from wrecks, or captures from planets. Your scrap can be used to construct fighters, frigates, destroyers, or even larger ships for your team. Easily build a wide variety of frigates, fighters, destroyers, stations, motherships, and more using a wide range of parts to choose from. Creativity is your only limitation—from single person recon ships, to fully crewed motherships, it is easy to build the ships that you want or need for every situation (as long as you have the resources of course!). Battle from ship-to-ship, or grab a rifle and perform a spacewalk to board an enemy vessel—if you can manage to eliminate the crew inside you can steal their ship and use it against them, or even salvage your opponent’s weapons and components for your own ships! You will be able to create a wide array of ship configurations to accomplish any combat scenario you are presented with, whether you need something light and speedy for offense, tanky for defense, equipt with a railgun to engage from far distances (or a flak emplacement for short), or more. As a multiplayer game, having different options for you to coordinate with your teammates is really crucial. Use VOIP and Text Chat to strategize with your Team or Wing (Squad) to get the upper hand and defeat your enemy. Iron Armada has an active and dedicated community—with over 1,500 Discord members and counting, there are always opportunities to meet new friends to play the game with. Join our Discord to get involved: . Iron Armada also benefits by being a part of the Drakeling Labs network: . Want to play alone? You can! Iron Armada also comes complete with a singleplayer mode against AI as well!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/581910/header.jpg?t=1638938268",
    "Price": 0.0,
    "Developers": "Bluedrake42 Limited Company",
    "Publishers": "Bluedrake42 Limited Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/581910/ss_3af432b07453bbea45c01864cd481615e9e69e49.1920x1080.jpg?t=1638938268,https://cdn.akamai.steamstatic.com/steam/apps/581910/ss_e2273e767bebb733d0144772d63b4a7e944b91e7.1920x1080.jpg?t=1638938268,https://cdn.akamai.steamstatic.com/steam/apps/581910/ss_6e27218477a5643bb9f79c35ce10e8fc2860f0a4.1920x1080.jpg?t=1638938268,https://cdn.akamai.steamstatic.com/steam/apps/581910/ss_c5719925cf700463b667ded5ad0a23b6d3acb067.1920x1080.jpg?t=1638938268,https://cdn.akamai.steamstatic.com/steam/apps/581910/ss_b5d9dd964bb3d193af98f6e5f28a5caf33bb4570.1920x1080.jpg?t=1638938268,https://cdn.akamai.steamstatic.com/steam/apps/581910/ss_e38615dd99db970583332e3ff58241405b57c303.1920x1080.jpg?t=1638938268",
    "Slug": "iron-armada",
    "Meta Title": "Iron Armada: Dec 29, 2017, Bluedrake42 Limited Company an...",
    "Meta Description": "Looking for information on Iron Armada? Check out the release date (Dec 29, 2017), developer insights from Bluedrake42 Limited Company, and a complete g...",
    "Alt Text Image": "Official header image for Iron Armada game - Steam 581910",
    "Canonical URL": "https://gusku.site/game/iron-armada",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Iron Armada\", \"description\": \"Looking for information on Iron Armada? Check out the release date (Dec 29, 2017), developer insights from Bluedrake42 Limited Company, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bluedrake42 Limited Company\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bluedrake42 Limited Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/581910/header.jpg?t=1638938268\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}