{
    "AppID": 1061090,
    "Name": "Jump King",
    "Release date": "May 3, 2019",
    "About the game": "'Tactical Leaping Adventure - Jump King: There is a Smoking Hot Babe at the Top!' is a platforming challenge about struggling upwards in search of the legendary Smoking Hot Babe! This lonely adventure to reach The Top will demand full mastery of the technique of jumping. Just try to remember, with each fall there is a lesson to be learned... Jump King includes two free expansions - ”New Babe+” and ”Ghost of the Babe”! Gameplay: -Prepare for true high-stakes platforming! The only way forward is up, and your only enemy is yourself! Tension rises with each jump when a single mistake means a long fall - and you have to get back up again yourself... -Hold to charge and release to leap away! The seemingly simple act of jumping will take much practice to master. -Use your mind before you jump! The obvious path is sometimes not the best, and once you are in the air there is no turning back... The higher you jump, the harder you fall All progress and each fall is auto-saved Tough but addictive gameplay Challenge your friends to master this test of resolve Hours of nail-biting suspense await Atmosphere: Learn to love and hate the curious characters that you meet on your journey through this mysterious vertical world. Classic graphics – snappy animations Painstakingly hand drawn backgrounds Incredible OST by Thörnlund &amp; Eklöf Sound High-definition ambiences The last hour led to this jump, everything is on the line! Will you get the Babe? Will you reach the Top? Do you think you have what it takes to defeat this game!? Expansions: New Babe+: ”How amusing, he approaches without shaking...” The world at the end of the Imp’s hidden path seems familiar, yet everything is different... Prove that you really deserve the title of Jump King in the intense second chapter! Ghost of the Babe: Investigate the mystery of the Ghost of the Babe in the twisted third chapter of the legendary struggle. The desolate land past Philosopher’s Forest is unlike anything seen before... With only a faint ghostly presence remaining, what is left to jump for? You didn't do it for her, did you? (It is recommended to finish the original game before attempting the expansions.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1061090/header_alt_assets_3.jpg?t=1617028032",
    "Price": 12.99,
    "Developers": "Nexile",
    "Publishers": "Nexile",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1061090/ss_57eb51f796849ef3338d4d884d6f7ed4b2d0fbd8.1920x1080.jpg?t=1617028032,https://cdn.akamai.steamstatic.com/steam/apps/1061090/ss_38f2d9bb39741bc5aecd5045ee5233fc8aa45d85.1920x1080.jpg?t=1617028032,https://cdn.akamai.steamstatic.com/steam/apps/1061090/ss_23f83db1bbabfecf8fbcc69a44c8b1b46c726c6f.1920x1080.jpg?t=1617028032,https://cdn.akamai.steamstatic.com/steam/apps/1061090/ss_c2c31148aaec7b3a6912bf0afcda8ab28d5ad970.1920x1080.jpg?t=1617028032,https://cdn.akamai.steamstatic.com/steam/apps/1061090/ss_565bc2cc3fa953b982de0779225dcf15c767c17f.1920x1080.jpg?t=1617028032",
    "Slug": "jump-king",
    "Meta Title": "Jump King: May 3, 2019, Nexile and Full Overview",
    "Meta Description": "Looking for information on Jump King? Check out the release date (May 3, 2019), developer insights from Nexile, and a complete game summary.",
    "Alt Text Image": "Official header image for Jump King game - Steam 1061090",
    "Canonical URL": "https://gusku.site/game/jump-king",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jump King\", \"description\": \"Looking for information on Jump King? Check out the release date (May 3, 2019), developer insights from Nexile, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nexile\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nexile\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1061090/header_alt_assets_3.jpg?t=1617028032\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}