{
    "AppID": 1271260,
    "Name": "Land of Screens",
    "Release date": "Feb 4, 2022",
    "About the game": "When a recent breakup lights Holland’s social media ablaze, she hopes to find some breathing room out in the real world—but as plugged-in as everyone is, it seems impossible that she'll ever get a break. In Land of Screens, guide Holland on her new mission to ditch the social media saturation and discover some real-world relationships by enlisting the help of a few new friends, some synthy chiptune jams, and the inimitable chemistry of small children and adorable animals. A Point-And-Click Adventure of Internet Escapism Put on your fanciest mingling cap to conquer harrowingly familiar challenges such as: Navigating an impromptu party where your only choices of company are strangers—or worse: friends you haven’t seen since high school. Meandering through a hotel lobby to force awkward introductions with fellow attendees of a professional conference. Making the best of last-minute concert plans where you’ve never heard of the band, been to the venue, or met any of the people you’re there with. Family. Reunions. Getting your friends excited about doing nature stuff so they can convince other people to start doing nature stuff so you can all spend the day doing nature stuff. Just Get Everyone to Stop Looking at their Phones… No Problem. No matter where Holland goes to try and get away, everyone is glued to their screens. She’ll need the help of old friends and new acquaintances—and they’ll need help from her—to dodge the online madness and finally unplug for a while. By diving (or stumbling) into fresh experiences, new relationships, and accidental adventures, Holland might just stand a fighting chance of escaping the ever-present creep of social media drama. Remember How Nice it is to Talk at People’s Actual Faces? In a world stuck on digital connections, the only way Holland is going to get through this breakup with her sanity intact is to go analog. Fortunately, she’ll soon learn just how many enticing adventures are out there, away from the continuous social media commentary. Sure, she could obsess over an online thread of opinions about her breakup like everyone normally would, but maybe there’s another way…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1271260/header.jpg?t=1643994105",
    "Price": 5.99,
    "Developers": "Serenity Forge",
    "Publishers": "Way Down Deep",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1271260/ss_a9663998b002e9bdaca269986a4f0e2274afd5e6.1920x1080.jpg?t=1643994105,https://cdn.akamai.steamstatic.com/steam/apps/1271260/ss_2e511782be929000fb6a79e668da9a85d1aa6b14.1920x1080.jpg?t=1643994105,https://cdn.akamai.steamstatic.com/steam/apps/1271260/ss_08236237907942ec00b7cfbe8e8003504d994376.1920x1080.jpg?t=1643994105,https://cdn.akamai.steamstatic.com/steam/apps/1271260/ss_f0c3cd998ec81feacdc0d90f15caad045fa856af.1920x1080.jpg?t=1643994105,https://cdn.akamai.steamstatic.com/steam/apps/1271260/ss_3a79962d25ad16903d222d6948edceb21c6b661b.1920x1080.jpg?t=1643994105,https://cdn.akamai.steamstatic.com/steam/apps/1271260/ss_1f53e7590a7b3b94089745fc59dd5e5cfdfbbdba.1920x1080.jpg?t=1643994105",
    "Slug": "land-of-screens",
    "Meta Title": "Land of Screens: Feb 4, 2022, Serenity Forge and Full Ove...",
    "Meta Description": "Looking for information on Land of Screens? Check out the release date (Feb 4, 2022), developer insights from Serenity Forge, and a complete game summary.",
    "Alt Text Image": "Official header image for Land of Screens game - Steam 1271260",
    "Canonical URL": "https://gusku.site/game/land-of-screens",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Land of Screens\", \"description\": \"Looking for information on Land of Screens? Check out the release date (Feb 4, 2022), developer insights from Serenity Forge, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Serenity Forge\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Way Down Deep\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1271260/header.jpg?t=1643994105\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}