{
    "AppID": 900010,
    "Name": "Meeple Station",
    "Release date": "Apr 10, 2020",
    "About the game": "So What Is Meeple Station? Meeple Station is an isometric pixel-art space station building and management sim that takes inspiration from games in the vein of Dwarf Fortress and Rimworld. Build a space station up from bare-bone essentials and a skeleton crew, into a bustling metropolis of activity filled with so many Meeple you'll probably forget about a few of them. You picked a great time to hop on board as we're just dropping our major Planets Update just now, which will have your Meeple expanding across the solar system. It's in an early state, but it's the foundation for a summer full of huge feature releases we've been working on and are very excited to share with you! The big recent changes we've added are also part of the bedrock of what is to come. Heee! Meeple need things to live! Ice can be melted and turned into Oxygen, which assuredly your Meeple will need to continue breathing. They also seem to like regular access to food! Make sure they have bathrooms near or you're going to end up with one stinky station. Use Meeple for jobs they are well suited to and house them in decent surroundings or the icy fingers of unhappiness will take hold. Just wait until you see the damage an unhappy officer can cause! Once you make your station a nice productive place to live, it's prestige will spread and draw new Meeple to the station and necessitate expansion. Expansion requires more resources, so get to mining! Meeple Station boasts a robust Z-layer system that is seemingly uncommon in many isometric and management games. The system allows up to 32 vertical floors- so stations can get quite gigantic if you so desire. Trade! At first, you can get things you need from traders, that you can't effectively manufacture on your own. Once you have a good operation going you can turn the tables and make quite a profit from supplying refined resources and manufactured goods to traders based on their needs. With the Planets Update, we've added the very beginnings of the Player-owned ships system, which we plan to expand on quite a bit in upcoming patches. Assign Pilots to ships and fly construction crews to build new stations. That's right! Multiple stations are new to the Planets patch as well! Now that you can travel around the solar system, you're going to be able to build multiple concurrent stations around different planets. Fight off lazy pirates! Pirates gonna pirate. Maybe they did bad in school and space is hard? Whatever the reason, they want your stuff. That's waaaay easier than doing work themselves. Make sure you have guard Meeple to fight them when they come. Station shields and turrets work wonders against bombers. We have so many big things in store for the near future that we hope will floor you with their scope. It's a very exciting time over here in the dev team. We work tirelessly to try to get them in your hands as soon as humanly possible, because we're over-excited children and this is our little passion project we can't wait to share with our community. Eventually, we plan on an inter-station ship-based trading, cargo, mining, and exploration network. It's ambitious, but we really can't wait to show you what we've been tossing into the stew for the future! Seriously, we sit up at night just playing with pixel planets and little tiny shippies. It's a problem. Speaking of community, drop into our Discord and say hello! We love to hear from you all!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/900010/header.jpg?t=1642676768",
    "Price": 19.99,
    "Developers": "Gameclaw Studio",
    "Publishers": "Modularity,WhisperGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_ff54d51edbdd54ccee16878d9470267f7643e219.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_276263c25e3245f4fc7b100ed9e1a21e1e00301f.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_928020539786c02915e58d7aae3fc701408d2d4c.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_7e0724e6162a6f35a07bee80a63bbb4f73e409e9.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_fcf2a2008c082dc0d5f6b8e6083a612d836fe2ee.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_0a6c240076d869157370a30a39d05c29036953ec.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_48e63dbdeb3e0b51415a692922bf6ca4d3fab961.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_36f9a2493b11ca4cd54483eb24668386e12fa260.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_ae717d96ff02ad57ea163f80845a800665d73efa.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_ad6fcc9d9e20060c5e83ed6a4baaf5fadad3552a.1920x1080.jpg?t=1642676768,https://cdn.akamai.steamstatic.com/steam/apps/900010/ss_7b67aaa74a40a4a053bda2bca4b350a919bed8ea.1920x1080.jpg?t=1642676768",
    "Slug": "meeple-station",
    "Meta Title": "Meeple Station: Apr 10, 2020, Gameclaw Studio and Full Ov...",
    "Meta Description": "Looking for information on Meeple Station? Check out the release date (Apr 10, 2020), developer insights from Gameclaw Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Meeple Station game - Steam 900010",
    "Canonical URL": "https://gusku.site/game/meeple-station",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Meeple Station\", \"description\": \"Looking for information on Meeple Station? Check out the release date (Apr 10, 2020), developer insights from Gameclaw Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 10, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gameclaw Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Modularity,WhisperGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/900010/header.jpg?t=1642676768\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}