{
    "AppID": 681730,
    "Name": "Nowhere Prophet",
    "Release date": "Jul 19, 2019",
    "About the game": "Build a loyal band of followers and survive the journey across a broken world. Barely. Take on the role of a powerful leader and mystic. Empowered with the gifts of technopathy, the ability to sense and affect electrical currents. You are the last hope to a band of outcastes and refugees. Lead them across the randomly generated wastelands. Pick fights with greedy slavers and crazy machines using the turn-based card combat. Can you survive long enough to reach the mysterious Crypt? These features make Nowhere Prophet stand out Card-based tactical combat system New procedurally generated maps each game Find loot and recruit followers to build your deck Unlock new content across multiple playthroughs More than 300 cards for you to discover Indian infused electronica soundtrack A roguelike deck-building game Nowhere Prophet is a single player card game with procedurally generated maps, a high difficulty and permadeath. At it's heart are two distinct parts of gameplay: Travel and combat. TRAVEL During travel you navigate across a procedurally generated map. Make sure your convoy has enough resources to travel as you pick your route. On your journey you will encounter strange places and even stranger people. You will be thrust into situations that put the fate of your followers in your hands. If you're lucky enough to gain some rewards, maybe for helping someone - or robbing them, then you can invest those to improve your decks. Recruit more followers to have more and different units to put into battle. Equip your prophet or level up and learn new skills to have access to stronger action cards in combat. COMBAT You will have to overcome some enemies to keep your convoy and resources together. And sometimes you may even want to pick a fight for righteousness or just for loot. Once in battle the game changes to the turn-based card game mode. Play convoy cards to put your followers onto the field and position them so you can overcome your enemy. Or play action cards to dramatically change the battlefield. But be careful: If you're wounded you will have to find a safe place to heal. And if one of your followers takes too many wounds, they are lost forever. A science-fiction post-apocalypse Nowhere Prophet is set on a far off planet called Soma. Your story begins many years after the Crash, a complete technological collapse. Civilization has broken down and the lack of resources made everyone turn either bandit or madman. In this world inspired by Indian culture you lead a convoy of outcastes. These desperate men and woman following your vision of a better future. Under your guidance they travel with you through the wastelands. Your goal is the Crypt, a mystical place that promises untainted technology and safety. If you can survive long enough to find it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/681730/header.jpg?t=1644935285",
    "Price": 24.99,
    "Developers": "Sharkbomb Studios",
    "Publishers": "No More Robots",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_04ea229f526ad9c345590b2f11ed903d28732c76.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_5ce88ff2db19dcda7d95441d5d8ccd28f301ba9f.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_bc1b47eabfc3a398c321b6d714d15bc85a0b1fa3.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_dc7cfa540644df3cb86e0532a07754d22e91d3f0.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_73f18bf6ef1a205c5e22500245eaa3fd8cca5b7e.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_b8b0f779854b72daf6426209a366ea89b4ade383.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_e925e068fbf44e1893b06feec9042d28c0cbb6cb.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_1075f536d4dfd965ea2f675ef8d8ee1e6854f0fd.1920x1080.jpg?t=1644935285,https://cdn.akamai.steamstatic.com/steam/apps/681730/ss_f0edfe00973cafa4e8d69223541274f7a4f6f420.1920x1080.jpg?t=1644935285",
    "Slug": "nowhere-prophet",
    "Meta Title": "Nowhere Prophet: Jul 19, 2019, Sharkbomb Studios and Full...",
    "Meta Description": "Looking for information on Nowhere Prophet? Check out the release date (Jul 19, 2019), developer insights from Sharkbomb Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Nowhere Prophet game - Steam 681730",
    "Canonical URL": "https://gusku.site/game/nowhere-prophet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nowhere Prophet\", \"description\": \"Looking for information on Nowhere Prophet? Check out the release date (Jul 19, 2019), developer insights from Sharkbomb Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sharkbomb Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"No More Robots\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/681730/header.jpg?t=1644935285\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}