{
    "AppID": 1306780,
    "Name": "Pledge: Extra credit",
    "Release date": "Sep 9, 2020",
    "About the game": "BACKGROUND College, the realm of superior knowledge and the gateway to a better future for all the young men and women that pass through the hallowed institution. At least, that's what the brochure said. The reality is closer to a non-stop partying, drinking, fucking and whatever else those hyper-hormonized barely adults can wrap their tiny attention spans around. Melissa was one said barely-adult college-goers. She was part of one of the biggest sororities on campus, which only meant one thing: she partied till the sun came up, drank like a fish, and had the wildest sex she could whenever she didin't black-out from near alcohol poisoning... which was most of the time. This continued for her entire four-year tenancy on campus and Melissa soaked in every moment of it. But with her parents picking up the tab and seeing her grades dip lower and lower and with her not having even picked a major, they felt like enough was enough and, with one phone call, they laid out the ultimatum. And there Melissa was: one semester left in her senior year on the the razor's edge of passing or failing and with no financial support of any kind from her folks. And something maybe even more crucial laid on the horizon: her duties as a Senior Sister from her sorority (not actually crucial... except that the sorority was her last lifeline after removing daddy deariest's wallet). “As much as Rebecca and I have been known to go at each other's throats, it's Emma Grey's that I would like to slit. She and Rebecca are from the same rival sorority house and, if you thought Rebecca's psycho bitch impression was believable, then Emma is the actual inspiration for the façade. Heartless, cold and a true bitch by nature - the imitation pales before the original...” WHAT CAN I DO HERE? Change Melissa's attitude and help her pass all her exams to graduate Focus on your sorority duties, win the bet and punish your rivals Start your career as a webcam girl and perform naughty shows for money Seduce your exotic roommate and teach her how to make love to a woman Parties, pranks, sex - live your life and become the slut you always wanted to be COMPLETE EDITION For the first time, play the game with both expansions already included to make your college experience feel genuinely complete! Teacher's Secrets Expansion new job at school that allows you to pose naked for an art class for the money. ask your history teacher, Miss Defolio, if you could perform a sexy photoshoot in exchange for a small increase in your grade. ask your Science teacher, Miss Heard, if you could be her little sex slave for a day if she would consider raising your rank in her class. discover your rival's little secret and torment the ring leader in hopes to exact revenge on them for years of humiliation. an additional cheat menu that allows you to bosst your stats at the start of a new playthrough. Extra Credit Expansion new job at school that allows you to be a dinner companion to an older gentleman or do a sexy striptease for frat party in exchange for money. new sorority missions for you and your fellow Alpha Beta's to perform. ask your Business Teacher, Mr. Felix, if he'd let you fool around with you in public in order to get a small boost in your grade. ask your Math Teacher, Mr. Patron, if you'd be his little living doll for him to admire in exchange for a better grade in his class. finally, get your revenge and some ultimate payback on Emma Grey in one of two humiliating ways! go on several dates with characters to places ranging from the beach to the bar. meet and befriend the new foreign exchange student from Italy, Tony Ricci. expanded scenes from the original game ABOUT GAMEPLAY PLEDGE is a relationship simulator where you manage your time in order to not only boost your personal stats but also interact with other characters. You got 30 days to achieve your goals and it's up to you which path you'll choose. For instance, you may focus on your sweet boyfriend and spend all your time with him, getting access to spicy interactions with him or... try to discover something different and hang out with your female roommate and test if you're into girls. But that's only a beginning. Enormous number of crucial choices, difficult decisions and several endings to achieve. Now with extra content never seen before.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1306780/header.jpg?t=1654762261",
    "Price": 10.99,
    "Developers": "Lesson of Passion",
    "Publishers": "Lesson of Passion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_3adb1e4ab774048d8a784a17a90d2713fdb68892.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_60614d3cea1e5a502500ab1190edc219937e2da0.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_52c4f0c0f061743d3aa4fe2e7c054bc7890da0a8.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_7c0e16522627c77aa586becb82c1dac621847b2e.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_51d531db021c19f8a42703761c293e23bedda028.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_9a5371c1ed7e4e23121062abc7c786cdbd11a88d.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_01cc074d1be01dca33446a8a91c80fee6de8d634.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_b97609a5e8bb1c6562ca5ccb401b48fbc1599c26.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_632bf7f1dea2fbbac91726d2c1c1898c77c86eea.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_340e7b5a25521af2cafeba49c2af4b2174d61b99.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_1370ef6b391cb47a333a0f60d12b7ec8bb398e92.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_ec3af2880ae0b1b563b435157b013e2fa6fb627f.1920x1080.jpg?t=1654762261,https://cdn.akamai.steamstatic.com/steam/apps/1306780/ss_0767d7a89c8fb7e88a70fb90ef05de30aa05dcd2.1920x1080.jpg?t=1654762261",
    "Slug": "pledge-extra-credit",
    "Meta Title": "Pledge: Extra credit: Sep 9, 2020, Lesson of Passion and ...",
    "Meta Description": "Looking for information on Pledge: Extra credit? Check out the release date (Sep 9, 2020), developer insights from Lesson of Passion, and a complete gam...",
    "Alt Text Image": "Official header image for Pledge: Extra credit game - Steam 1306780",
    "Canonical URL": "https://gusku.site/game/pledge-extra-credit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pledge: Extra credit\", \"description\": \"Looking for information on Pledge: Extra credit? Check out the release date (Sep 9, 2020), developer insights from Lesson of Passion, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lesson of Passion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lesson of Passion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1306780/header.jpg?t=1654762261\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}