{
    "AppID": 1241380,
    "Name": "Project Reborn",
    "Release date": "Feb 14, 2022",
    "About the game": "You're a vecon who by birthright has one ticket to a tournament in Project Reborn, where you can grab an Egg Cell in an android's womb and be reborn in the real world. But be careful there are many like you, they and various viruses will get in your way. Unique Mechanics In the world of Project Reborn things are not arranged as usual, here the more DNA you have, the less time you need to grab the Egg Cell, as DNA and ability capsules drop off from everything, this opens up a huge range of actions. Some will choose to collect matter spheres or complete tasks, some will hunt down other players trying to get their DNA and ability capsules to sell at auction, and some will choose to destroy viruses. Some will capture Megaspheres or search for drone boxes and in the end you will fight for the Egg Cell. Thousands of ability combinations You don't need to level up your character to unlock all of the ability capsules, from strengthening you and your resistance to powers such as invisibility and speed. All of them are of different ranks from ordinary to legendary. You just have to get them or buy them at Auction from other players like yourself. You can combine them and even strengthen them getting a unique class character that suits you! If you want to experiment and find the right combination you can simply change the capsules with abilities. PVP and PVE zones There are 3 different play zones Safe Zone - a small zone at the edges of the world where you are spawned and where you can't get hurt. Development Zone (PVE) - most viruses are here, in this zone you can not be destroyed by other players, together you can hunt tumors. Battle Zone - it is in the middle of the map, where players can fight against each other. Before going to this zone you should carefully select the right capsules with abilities, as the zone in the inventory will be available only the main 10 cells and access to the auction will be closed. Auction All players have the right to sell and buy any capsules and drones in the auction, with a variety of filters you can find the item you need. That would sell the auction simply move the cursor on your item and in the description of the item click on the button 'sell” and stating the price. Viruses There are several types of viruses in the game. Flu are the most common, they're just as likely to attach themselves to the suit and tear it to shreds. Luckily they don't pose much of a threat on their own. Tumors - These are the evils that constantly proliferate in the body. There are three kinds of them, toxic, electric and frozen. They are large slow but strong and each species produces 2 small tumors every minute, some small tumors can heal their creator giving their life in return. If you attack their mother they will sense this and rush to defend her even at the end of the world. So the sooner you team up and destroy the tumors the better, before they spread all over your body. Adenovirus is a rare virus that wanders through the organism at high speed, it's not dangerous if you don't attack it yourself. If it takes damage it will release deadly spikes. But if you can catch up to it and destroy it, you'll be well rewarded. HIV - Human Immunodeficiency Virus, the main and most dangerous virus, it is alone, but can harm and destroy the android body so it must be destroyed before the Egg is captured. It has a huge amount of life and can severely cripple you if touched, also beware of its projectiles they burn through the suit. As his life dwindles he goes crazy and begins to frantically rush from side to side sweeping away everything in his path, try to dodge it. After his death everyone who caused damage and stayed in the game until the end of the capture eggs share the reward commensurate with the damage caused. Optimal monetization Absolutely all in-game items and costumes can be purchased for in-game currency, you only need to accumulate the required amount of in-game premium money - Zions, which in most cases can be earned by capturing Egg Cells or completing assignments. Note that in the auction items are sold and bought for another non-premium and easier to obtain currency - Ions. Costumes There are a lot of costumes (skins) in the game you can transform your sperm cell in a suit that suits you best, whether it be an astronaut suit or a pirate costume. We are constantly adding new costumes. Drones Sometimes on the map there are boxes with drones, be careful and when you find one you will be able to open and get a drone comparable to the rank of your found box. Each of the 4 levels of box has its own time to capture, the higher the level the longer you need to hold the box. You can move during this time, run and fight, but all players will know that you picked up the drone box. Drones always stay with you, even if you're killed, they help you, for example the drone 'Scanotron 3000' scans your enemies determining what kind of capsules they have (unless of course the enemy has an “Antiscan” capsule of the proper level) or the drone 'Mechanic' which repairs the suit. We are constantly improving the game, adding all new capsules, viruses, drones, modes, and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1241380/header.jpg?t=1644877018",
    "Price": 0.0,
    "Developers": "Red Rock Revolution",
    "Publishers": "Red Rock Revolution",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_aec815894a0c918d0bd58440b7fb90f6f4505d08.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_6e1d02a9ecef7100cda7f27afbf8655034f8253e.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_8b83c704dba8bd4439a0509ae47586a866f610f2.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_5d6bc06fa1a0e8d44d5dd1714f27e4b32d8e8535.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_98f0a9954ab2e891e2d76088d5055f9a46f51587.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_85f6990e917752bc0aeb94b0c433a15f0a814e96.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_5c0c000bf0f964488e5bbcc75b3ecfd6cd296b4f.1920x1080.jpg?t=1644877018,https://cdn.akamai.steamstatic.com/steam/apps/1241380/ss_c773cc56c604d1d6d2f5db9c313d47d3c7f5ee49.1920x1080.jpg?t=1644877018",
    "Slug": "project-reborn",
    "Meta Title": "Project Reborn: Feb 14, 2022, Red Rock Revolution and Ful...",
    "Meta Description": "Looking for information on Project Reborn? Check out the release date (Feb 14, 2022), developer insights from Red Rock Revolution, and a complete game s...",
    "Alt Text Image": "Official header image for Project Reborn game - Steam 1241380",
    "Canonical URL": "https://gusku.site/game/project-reborn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Reborn\", \"description\": \"Looking for information on Project Reborn? Check out the release date (Feb 14, 2022), developer insights from Red Rock Revolution, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Red Rock Revolution\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Red Rock Revolution\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1241380/header.jpg?t=1644877018\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}