{
    "AppID": 1078320,
    "Name": "Public Defense Corp",
    "Release date": "Dec 4, 2020",
    "About the game": "Japan, in the year 20XX... The evil secret society Jakou is plaguing the country, causing several private defense firms to be founded. These companies protect Japan alongside the police and self-defense forces. With both Jakou and the protectors of peace using newly-developed mechs to fight, the battlefield has begun to change, with damage to cities and infrastructure reaching unimaginable levels! And yet, despite Jakou's power, the citizens of Japan are fighting back. Haruka, the hero of our story, witnessed the destruction of her hometown several years ago, and she's determined to take revenge! Thus, she joins the public defense corp Toyokumo, aiming to pilot their freshly-designed machines to take down Jakou for good! Pilot the cutting-edge Takefutsu to take down the agents of Jakou! Use the variety of weapons at your disposal to deal with threats as efficiently as possible while keeping damage to the city to a minimum. Of course, you may occasionally have to topple a few buildings to reach your objective, but all's fair in the name of justice! Although Takefutsu is a cutting-edge mech, it can still be upgraded. Gather parts from defeated enemies and use them between missions to increase Takefutsu's capabilities, granting it perks such as increased armor or new special attacks. Naturally, running a civil justice corporation and maintaining a huge mech doesn't come cheap. You'll also have to take part in publicity events around the city to gather support for the company and appease any citizens whose homes might have been damaged in the crossfire. Participate in television adverts and gather sponsors to raise funds! Futuristic Adventure Pilot a mech to defeat the evil agents of Jakou in urban warfare, even taking down buildings that are blocking your path if needed! Upgrade the Takefutsu Gather parts from defeated enemies to make your mech stronger and craft items that will help you in your mission to protect the peace! Take Part in PR Events Whether it be giving interviews, doing talk shows or advertising products, participate in different events to garner public support and extra funding! Keep Track of Social Media As you progress through the story, Haruka and her exploits will draw more and more attention. Check the Brouhaha app on your phone to see what everyone's saying!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1078320/header.jpg?t=1657293016",
    "Price": 14.99,
    "Developers": "Clymenia",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1078320/ss_a2f57aad115a8b6b0286822ed8b3700b8739beae.1920x1080.jpg?t=1657293016,https://cdn.akamai.steamstatic.com/steam/apps/1078320/ss_26a1f4a3221e66b3debcba16c09a8272733e0856.1920x1080.jpg?t=1657293016,https://cdn.akamai.steamstatic.com/steam/apps/1078320/ss_4f985c65c33561ed48e946a2ce5151277144e8cb.1920x1080.jpg?t=1657293016,https://cdn.akamai.steamstatic.com/steam/apps/1078320/ss_79f37c509bc6329ac4399ff73fa960c51a088ec5.1920x1080.jpg?t=1657293016,https://cdn.akamai.steamstatic.com/steam/apps/1078320/ss_d7c33294419d3c8243283456d3986df9d27510b8.1920x1080.jpg?t=1657293016",
    "Slug": "public-defense-corp",
    "Meta Title": "Public Defense Corp: Dec 4, 2020, Clymenia and Full Overview",
    "Meta Description": "Looking for information on Public Defense Corp? Check out the release date (Dec 4, 2020), developer insights from Clymenia, and a complete game summary.",
    "Alt Text Image": "Official header image for Public Defense Corp game - Steam 1078320",
    "Canonical URL": "https://gusku.site/game/public-defense-corp",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Public Defense Corp\", \"description\": \"Looking for information on Public Defense Corp? Check out the release date (Dec 4, 2020), developer insights from Clymenia, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Clymenia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1078320/header.jpg?t=1657293016\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}