{
    "AppID": 618850,
    "Name": "Pumpkin Days",
    "Release date": "Feb 1, 2021",
    "About the game": "GAMEPLAY FEATURES PLAYERS APPRECIATE ABOUT PUMPKIN DAYS Non-binary character creator! Nothing is gender locked or specific to the player. Use body sliders to create the shape of your characters. 4 different difficulty modes! You can choose to play a relaxing farming game, or crank up the difficulty if you want more of a challenge. 2 different multiplayer modes! Farm together with a friend by sharing resources and quests or farm side by side and have a friendly competition. A diverse cast of over 100 characters! With 4 different towns, there are plenty of characters to meet and potentially date in the game. Same-sex marriage. There is no gender restriction to marriage and dating in Pumpkin Days. Polyamorous relationships: You can marry multiple characters and even have up to three included in the wedding ceremony. OVERVIEW Pumpkin Days is a traditional farming dating rpg. Play the game at your own pace with a variety of activities to explore and do. Side with the townsfolk and help stop Jounce Corp. from building a factory on the island by filling out the museum. Or side with the factory and get rich fast, but with some consequence. FARMING When you arrive the mayor will put you straight to work farming on your new farm. There are over 90 crops and over 60 flowers that can be grown. PICK ONE OF THREE TOWNS TO LIVE Start your farming adventure by picking one of three towns to live in. Will you choose to live in a tropical paradise at Wahoo Beach, the simple river town Pumpkinvale, or high up in the snowy mountains of Diamond Falls? Both towns are populated with over 30 townsfolk to interact with. You can travel to all the towns and seek to buy property in them. FISHING With over 100 kinds of fish to catch there is much to discover. Catch different fish in the river, lake and ocean which change out with the seasons. COOKING There are over 600 recipes in the game to discover cook. If you love cooking in games then you're in for a treat. RAISE AND BREED ANIMALS Raise cows to produce delicious milk, sheep for wool, chicken for tasty eggs as well as some other animals. You can breed animals to get them to produce more products, or for a chance to get a rare animal. PETS Adding a dog or cat would also be a nice addition to the farm. The cats will bring home bugs and the dogs will bring home fossils. BUG CATCHING Explore the map and try to catch over 100 different kinds of bugs to help fill out the museum. MINING There are over 70 different times of gems and ores that can be used to upgrade tools, crafting furniture, or customizing your house. HOUSE CUSTOMIZATION Have fun painting your house using a wide variety of patterns. Paint the roof, window frames, all the walls, and the floor. If a section can be painted you can mix and match with whatever patterns you like without restriction. MULTIPLAYER MODES Pick between one of two modes for multiplayer. You can choose to farm together with a friend which includes sharing resources and helping complete quests. You can also farm separately with an optional competitive points system to score all the players. P SOCIALIZING AND COURTSHIP There are over 100 dateable characters in the game. You can also marry more than one character for a polyamorous relationship if you choose. You can also choose to simply have a roommate if you wish. RAISE A FAMILY When you get married you can choose to have a kid. Raise them from birth to a young child, if they love you enough maybe they'll help out on the farm. You can have a maximum of eight kids. CRAFTING Craft with hundreds of textures and pattern wallpapers that can be applied to a variety of furniture and be used to paint your house. You can also craft your own custom clothes with pattern wallpapers to create designs not available in the shops.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/618850/header.jpg?t=1612206039",
    "Price": 24.99,
    "Developers": "Pumpkin Interactive",
    "Publishers": "Pumpkin Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_f1832eee4e683fb2b88ed492bd362ff25f480acf.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_0af294de68dbfb0276bf934fc8dcd83a8c8286a9.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_45b4db7ececbbe1385fd8e1f75bdb915f67deebb.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_6e2811a2f18f584e5f8eef9d9c81aa8dfa753e79.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_9f5de996e74faacfcc3aefdb1118bd4c9b9f781c.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_7e5f33518ad0b52ccbbaf833469706bff08bf8d8.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_0baed126b8f07ba10fafeecb2e4e4f518af4ccba.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_a788e73050b3bddb7df8014e157dc3b038bb1ad7.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_7e24c77894344caf64d899bcc446a8c64a21f6fd.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_facfb641d3584f439aab60b4c863cdf41698e25e.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_3f09b083581e3fdbb1ed42a8752862016fa3be4b.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_926793c89e908b49cc2a827fee07100b4587ef4d.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_bfede95c4a820a1a0ef8129c6f140766a242fcc9.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_3e7af1c86dec545a25b4bb0542bacbb06656201a.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_97894240d9e2ef19add1d6c735cd1daeecbc9559.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_3ae1b43532d0ac88361d14f44f05d8d921056eb2.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_9576fbb060dfb60ea89f4b7efba22fa108e53c6e.1920x1080.jpg?t=1612206039,https://cdn.akamai.steamstatic.com/steam/apps/618850/ss_78dd205272814b0de9229fe1354df1bb126224b5.1920x1080.jpg?t=1612206039",
    "Slug": "pumpkin-days",
    "Meta Title": "Pumpkin Days: Feb 1, 2021, Pumpkin Interactive and Full O...",
    "Meta Description": "Looking for information on Pumpkin Days? Check out the release date (Feb 1, 2021), developer insights from Pumpkin Interactive, and a complete game summ...",
    "Alt Text Image": "Official header image for Pumpkin Days game - Steam 618850",
    "Canonical URL": "https://gusku.site/game/pumpkin-days",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pumpkin Days\", \"description\": \"Looking for information on Pumpkin Days? Check out the release date (Feb 1, 2021), developer insights from Pumpkin Interactive, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pumpkin Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pumpkin Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/618850/header.jpg?t=1612206039\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}