{
    "AppID": 462770,
    "Name": "Pyre",
    "Release date": "Jul 25, 2017",
    "About the game": "Pyre is a party-based RPG in which you lead a band of exiles to freedom through ancient competitions spread across a vast, mystical purgatory. Who shall return to glory, and who shall remain in exile to the end of their days? Key Features: A New World From the Creators of Bastion and Transistor Experience the biggest and most imaginative world yet from Supergiant ! Get to know an ensemble cast of characters struggling to earn back their freedom as you make your way across the forsaken land called the Downside. Action-Packed Three-on-Three Battle System Battle against a colorful cast of adversaries in pitched, high-stakes confrontations where each victory (or defeat!) brings your exiles closer to enlightenment. Choose three from your party for each Rite, and outfit them with mystic Talismans and powerful Masteries. A Branching Story with No Game-Over In Pyre , you will never be forced to lose progress. Whether you prevail or you fail, your journey continues. The interactive narrative is expressed through a story that no two players will experience in quite the same way. Challenge a Friend in Versus Mode On top of the single-player campaign, Pyre features a local two-player Versus Mode, where you can play against a friend (or CPU opponent) in one of the game's fast-paced ritual showdowns. Form your triumvirate from more than 20 unique characters. Rich, Atmospheric Presentation Pyre once again showcases the award-winning talents of the team that created Bastion and Transistor . From the vibrant hand-painted artwork to the evocative musical score, every aspect of Pyre 's presentation draws you into its fantasy world. Accessible, Customizable Controls and 4K Ultra HD Graphics! Play with gamepad or mouse-and-keyboard using fully customizable controls custom-tailored to PC. The game offers a highly scalable challenge both in the campaign and Versus Mode. Experience it all in stunning 4K resolution (compatible display required)! Unlock 'True Nightwing' Campaign Mode After Finishing the Story Complete the Campaign, then go at it once more, 'ironman'-style, with a unique set of rules, higher stakes, and greater challenge! Explore Pyre 's wide breadth of narrative outcomes as you re-play the story. A Message to Fans of Bastion &amp; Transistor Pyre is our third game as a small independent studio, and was made possible by the success of our first two games, thanks to players like you right here on Steam. This time around, we were excited to make something different from Bastion or Transistor , with a focus on a story-rich presentation, multi-character battles, and many possible narrative outcomes. We hope you'll be surprised and delighted by the result, and that the many characters you’ll meet and stories you experience during your journey stay with you for a long time to come. Safe travels through the Downside, and thank you for your support! --the Supergiants",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/462770/header.jpg?t=1601500944",
    "Price": 19.99,
    "Developers": "Supergiant Games",
    "Publishers": "Supergiant Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_2107ff862d576593c794b3bd53a2916b44ca03bb.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_07ec2b0ca26795d393f6e479b629f99e2f960cb1.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_135d50dc1f4ce620a92eb960a0649980a9c33990.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_e75dee64ea44780e246ad7a144b38f1df555fd1e.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_5f12a85b35b24dfa20a0ebfa132d480a8b6dc5fe.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_27510b7ddd9a5283345c042f06716191779f25fd.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_067b04e883dbb3a42a399e391b2c750adb095317.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_64776e928cacd7381e68adaa5776d3c943946821.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_7360bde3fe5e614abd80938b9c20193ba684c99f.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_80bfecf418f7e8a63f9e1efddb85f5f565ff4291.1920x1080.jpg?t=1601500944,https://cdn.akamai.steamstatic.com/steam/apps/462770/ss_639bd6710ee2ebe9d01ebd22494cb7e94c47e96d.1920x1080.jpg?t=1601500944",
    "Slug": "pyre",
    "Meta Title": "Pyre: Jul 25, 2017, Supergiant Games and Full Overview",
    "Meta Description": "Looking for information on Pyre? Check out the release date (Jul 25, 2017), developer insights from Supergiant Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Pyre game - Steam 462770",
    "Canonical URL": "https://gusku.site/game/pyre",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pyre\", \"description\": \"Looking for information on Pyre? Check out the release date (Jul 25, 2017), developer insights from Supergiant Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Supergiant Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Supergiant Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/462770/header.jpg?t=1601500944\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}