{
    "AppID": 782160,
    "Name": "Raptainment",
    "Release date": "Apr 18, 2018",
    "About the game": "Raptainment puts you in the hard-hitting rap world full of hard lyrics, screaming fans, luxury and the tour life. Plan for your rapper the next hit album, but always keep the skills in mind, don´t expect to much at the beginning, a flop would remain long in the memory of the fans. Raise the skills of your rapper to record more sophisticated and high quality albums in the future in which execution you want to release the product and keep an eye at the advertising. Do not forget to give interviews, keep the social media in mind, and have a good connection with the fans. After a successful release, the tour life is awaits you. Plan a small or big tour and present the newest works to the public. Master the narrow degree between the equipment of the tour and the possible revenue to make the business not to an loss. Take care that your artist travel and plan every single performance carefully to make every show as great as it can be. Features: - Detailed simulation around the rap business - Comprehensive skill system whose values rise and fall over time. - Complex recording system with many different selection options - Detailed calculations for a dynamic playing experience - Releases in different sale-designs with a detailed calculation system - Extensive promotion system via advertising, interviews and social media - Detailed tour system incl. planning of each performance - Game music from talented producers which have produced for some famous german rap stars. - And much more. Raptainment has been optimized for the screen resolution 1980x1020 Licencing: For Raptainment some well-known Rap Artists from Germany was licensed. Music was licencing 4 exclusive beats from the producer 3Nity beats. In addition, the game includes exclusive beats from newcomer producers. Buyers of Raptainment may use the beats exclusively for non-commercial projects.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/782160/header.jpg?t=1524156525",
    "Price": 12.99,
    "Developers": "IzmirRecht",
    "Publishers": "IzmirRecht",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/782160/ss_b1afc97a3b9d4a956bd4d0a11a6d4493fda69a9b.1920x1080.jpg?t=1524156525,https://cdn.akamai.steamstatic.com/steam/apps/782160/ss_bdddf434e266fc69a6938ac0a832c79f657ad375.1920x1080.jpg?t=1524156525,https://cdn.akamai.steamstatic.com/steam/apps/782160/ss_329d53505328665640aa5195fbccf42c22a927ee.1920x1080.jpg?t=1524156525,https://cdn.akamai.steamstatic.com/steam/apps/782160/ss_f741487e81768e0d7569e9c5a69ffc9c023a37cc.1920x1080.jpg?t=1524156525,https://cdn.akamai.steamstatic.com/steam/apps/782160/ss_f239b36be22720900fb812402046f4b13f8d58ea.1920x1080.jpg?t=1524156525",
    "Slug": "raptainment",
    "Meta Title": "Raptainment: Apr 18, 2018, IzmirRecht and Full Overview",
    "Meta Description": "Looking for information on Raptainment? Check out the release date (Apr 18, 2018), developer insights from IzmirRecht, and a complete game summary.",
    "Alt Text Image": "Official header image for Raptainment game - Steam 782160",
    "Canonical URL": "https://gusku.site/game/raptainment",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Raptainment\", \"description\": \"Looking for information on Raptainment? Check out the release date (Apr 18, 2018), developer insights from IzmirRecht, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"IzmirRecht\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IzmirRecht\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/782160/header.jpg?t=1524156525\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}