{
    "AppID": 365960,
    "Name": "rFactor 2",
    "Release date": "Nov 12, 2015",
    "About the game": "Summary rFactor 2 is a realistic, easily extendable racing simulation from Studio 397. It offers the latest in vehicle and race customization, great graphics, outstanding multiplayer and the height of racing realism. rFactor 2 features mixed class road racing with ultra realistic dynamics, an immersive sound environment and stunning graphics, perfect for top-level esports and a rich single-player experience. Race against a field of AI cars, or in multi-player mode against others. rFactor 2 supports a full day-night cycle as well as dynamically varying weather conditions such as rain which dynamically builds into puddles. Tracks feature 'real-road' technology that changes the grip as more cars drive on it. You can run full 24 hour endurance events and in multi-player mode, driver swaps are also supported. Everything can be customized by the community, including adding new tracks and cars, and a wealth of add-ons are available on-line.Working with several partners, rFactor 2 has been used in hundreds of esport championships all over the world – in particular McLaren’s World’s Fastest Gamer and Formula E. rFactor 2 is also an evolving product, which will be updated and added to for many years, so the list of features will expand! Features Physics Updated to use multi-core CPU technology Advanced physics engine Newly updated tyre model Driving surface construction, even painted line thickness, affects grip levels Engine boost and Turbo modeling Complex aerodynamics Head physics, cockpit vibrations, detailed bump modeling Dynamic Racing Experience Real-time day/night lighting transitions Realistic wet/dry weather transitions Dynamically laid rubber increases grip throughout racing session(s) Rubber chunks (“marbles”) roll off tyres and can affect grip Tyres sustain damage from poor driving (such as 'flatspotting' a tyre) or setups, affecting grip immediately and over time Dynamically drying racing line after rain Environments filled with animated events like planes, flag marshalls and more… Graphics/Sound Real-time day/night lighting transitions Projected headlights for night time driving Open VR support for multiple headsets Look to apex and head motion tracking support DX11 advanced graphics engine Real-time day/night transitions Adjust player and opponent volume ratio See the apex with the Look Ahead slider Adjust your seat and mirror while in the driver’s seat Updating real-time scoring towers Expanded and enhanced gauge and LCD features for vehicle cockpits Improved loading times Updated sound engine Changing engine sounds based on upgraded vehicle performance Gameplay New AI who will race for and defend positions Define AI opponent types, strength and aggression Races can be lap based, time based or both Vehicle upgrade system that affects both the appearance and performance of a vehicle Camera/Replays “Resume from Replay” allows you to resume a race from a saved replay Full screen monitor and ability to rewind Freely move camera from any position including the ever famous exclusive Swingman Spectator mode Multiplayer Opponent car skins automatically transmitted Completely new multiplayer engine Dedicated server Native voting system Add AI to multiplayer games Boot and ban player lists that can be passed around Security checks to combat potential cheating Open Architecture Support for modder created car,track and plugin content Fully adjustable Showroom, UI and HUD layouts More Plugin Interfaces Easy to use customizable multi-language support Rules to simulate different types of racing Completely customize your controller Drop in new vehicle liveries Cars and Tracks Over 35 free and paid licensed cars and tracks includiing Silverstone, Renault, Formula E, McLaren, Mercedes, Bentley - the list goes on Steam Workshop support for installing cars and tracks Steam Item Store for paid content here For a current list of cars and tracks shipped with the simulation visit this link to the workshop: -397/myworkshopfiles/?appid=365960",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/365960/header.jpg?t=1655998427",
    "Price": 7.99,
    "Developers": "Studio 397",
    "Publishers": "Studio 397",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_08014c715e90c851212e829d60dbbba7c5f0fc43.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_cedc2b2cffa00a38654eb1a0ce4c4ac631ed6fb3.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_f9ac27e7b40aeffcd98833512aebd9eb0484e1c2.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_a08d0128e0184211a8c71abfd7d674dd2d480b35.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_f3dccb64a908d9b5501ea98d2ad2cb3020f3a6ef.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_d362f537a11f78d07979252fd81b7d68bdf57c64.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_229cf31b83769bfd8cb74f46b1005fabf3191223.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_6d2cb4341d28b92979b794eee9b76705aa706998.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_81e5b81bc43ddf55f3be29b8822da77aff040ec9.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_f416a2e2b9e44f935c332f407800e88dfb7a1b37.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_df52993496cc3dce997766099a515437f5c6e1d4.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_77d458ee54155498c33d7300dcf94f332a1b7971.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_01804620d4c4f1046273567bba9aaaa37d115341.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_3a0177a6dc615ac31aeec88cc3d2692c7bddf8b8.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_1eafc3b8eebb3600c2a6cb452d33dacf2d765d91.1920x1080.jpg?t=1655998427,https://cdn.akamai.steamstatic.com/steam/apps/365960/ss_174bfdb38d10741983b182a57508077d69fdd3fa.1920x1080.jpg?t=1655998427",
    "Slug": "rfactor-2",
    "Meta Title": "rFactor 2: Nov 12, 2015, Studio 397 and Full Overview",
    "Meta Description": "Looking for information on rFactor 2? Check out the release date (Nov 12, 2015), developer insights from Studio 397, and a complete game summary.",
    "Alt Text Image": "Official header image for rFactor 2 game - Steam 365960",
    "Canonical URL": "https://gusku.site/game/rfactor-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"rFactor 2\", \"description\": \"Looking for information on rFactor 2? Check out the release date (Nov 12, 2015), developer insights from Studio 397, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio 397\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio 397\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/365960/header.jpg?t=1655998427\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}