{
    "AppID": 1905810,
    "Name": "SCP: Vacation",
    "Release date": "Mar 3, 2022",
    "About the game": "Four D-Class personnel awaken to find themselves in a mysterious dimension. Somehow, they know they must avoid the anomalous threats contained by the SCP Foundation and escape before it's too late... Important! This game is in VERY EARLY development! If it sounds like something you might enjoy, check back in a few months when it's been further developed. This build has been released with the intent of gathering feedback and allowing anyone who wants to participate in development to give their suggestions. Overview: 1-4 Players start on a board with various tiles that lead to an escape. Players take turn rolling a die to determine how far they can move along the board. Players must navigate the board while avoiding deadly anomalous threats. Certain SCPs will also be navigating the board, and must be considered when moving around. Tiles have unique effects that trigger: when arrived at, when left from, when landed on, and when died on. Some of these give Evidence Points (EP). Once a player escapes, their EP will be converted to Credits ($C), but if a player dies their EP is reset. All non-player slots will be filled with AI that compete as a real player would. The Board: The 'Board' refers to the map that players will navigate. There is 1 board in the current release and more planned. Boards vary in theme, meaning different boards will have different visual and audio queues. Boards will also have at least 1 mechanic that alters the gameplay as the game is played. The current board is called 'Meadows', and presents a bright, friendly environment which lulls visitors into a certain sense of security. The Tiles: As players navigate the board, they will land on 'Tiles'. Tiles have various effects, and are mainly used as a way to gain EP. Some tiles are owned by certain SCPs, such as the 106 tile in the Early Access version. This tile, for example, changes location at the start of every round, and if landed on will result in the players death. More of these are planned for full release. Enemies: Players navigate the board during their 'turn', but while it isn't their turn some SCPs will also navigate the board. 173, the board enemy in this release, will walk around the board at the start of the round, and will initiate a short minigame with any player who is on the same tile as it. Evidence Points: As players navigate the board they find 'evidence'. These pieces of evidence have points assigned which refer to their value. Upon escaping, the player will be compensated in $Credits depending on their EP. Credits: Credits are the main currency of the game. Total credits earned will determine who wins the game. They can also be spent on character customisation (not yet implemented)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1905810/header.jpg?t=1648800033",
    "Price": 0.0,
    "Developers": "PeaPro",
    "Publishers": "PeaPro",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1905810/ss_b8b7c17469a647e31b67ec64162f7f32094e816c.1920x1080.jpg?t=1648800033,https://cdn.akamai.steamstatic.com/steam/apps/1905810/ss_f9f64ebcee7c6a2c0b3f556684f7a052184e7b66.1920x1080.jpg?t=1648800033,https://cdn.akamai.steamstatic.com/steam/apps/1905810/ss_2e126c246215bbc7b810b38955dd03d22cd42f9c.1920x1080.jpg?t=1648800033,https://cdn.akamai.steamstatic.com/steam/apps/1905810/ss_5e23a37e55f6d7da4f2c85801de8fa7cdf82c21b.1920x1080.jpg?t=1648800033,https://cdn.akamai.steamstatic.com/steam/apps/1905810/ss_b62c82356751504aa20da4de68f942350ffc03aa.1920x1080.jpg?t=1648800033",
    "Slug": "scp-vacation",
    "Meta Title": "SCP: Vacation: Mar 3, 2022, PeaPro and Full Overview",
    "Meta Description": "Looking for information on SCP: Vacation? Check out the release date (Mar 3, 2022), developer insights from PeaPro, and a complete game summary.",
    "Alt Text Image": "Official header image for SCP: Vacation game - Steam 1905810",
    "Canonical URL": "https://gusku.site/game/scp-vacation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SCP: Vacation\", \"description\": \"Looking for information on SCP: Vacation? Check out the release date (Mar 3, 2022), developer insights from PeaPro, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"PeaPro\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PeaPro\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1905810/header.jpg?t=1648800033\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}