{
    "AppID": 922880,
    "Name": "Siberian Dawn",
    "Release date": "Sep 20, 2018",
    "About the game": "More Than Just Another Deckbuilder... Road To 5.0 We are currently on the road to Siberian Dawn 5.0, working on a number of significant additions to improve the presentation of the game, and the latest update 4.6 brings the latest additions made on this journey so far over the last few months with 3 new training missions added to the base game. So currently in the game you can play a set of 4 interactive Tutorials and 4 Training Missions, but there is still much more content to be added before 5.0 and listed below you will see the content still to come. Mission packs 1 and 2 also currently each give you 3 full missions of the Siberian Dawn story. - A set of Missions comparable to the Missions in the Mission Packs, set before the Siberian Dawn story - Skirmish mode with the new content of the Base game, DLC will then add extra content to this mode - Crisis mode with the new content of the Base game, DLC will then add extra content to this mode - Ark section that will contain various unlocks and uncover the secrets of Siberian Dawn This game is a strategic card based wargame with deckbuilding elements and the detailed tutorials will take you through how to play the game. As it was built to be a game that offered a lot of strategic options during a mission it is not a simple deckbuilder but is a game that requires thought and a bit of time to learn its mechanics. Overview Siberian Dawn is an original, solo, digital card game that combines the core soul of a deck builder with the tactical power of a war game and the strategic challenge of crisis management. You are an Overseer in the Union, one of the tactical controllers who has to deal with the increasing dangers facing the Union through Objective based Missions. Recruit and deploy Units, enlist the help of the Guilds, and build your Bond with those in the shadows, whilst trying to control the conflict unfolding before you. The base game contains a detailed series of interactive tutorials and 4 Training Mission that will teach you how to play the game, and the Mission Packs available as DLC each add 3 new Missions of the Siberian Dawn story. The World In Siberian Dawn you play the part of an Overseer in the Union, an industrial state covering what we know as Europe. Overseers are the tactical experts of the Union and responsible for quickly dealing with troubles as they arise using a limited resource pool, controlled squad level force, and possible support from the Guilds. Siberian Dawn has a heavy character driven setting, in a gritty near future military world that mixes in medieval and supernatural horror elements to the theme. The game starts as hostility has been growing in Industrial Habit IH-54 of the Eastern Zones for the last few weeks. Outcasts are rumoured to have been stirring up this dissent and it is believed they are connected to a cult called the Dawn, Overseers have been assigned to deal with this unrest and you are one of them. Each Mission will give the Overseer a series of Objectives to complete which have variety and offer the Overseer different challenges during the Mission. Missions will be playable individually but also form a narrative story as the Overseer uncovers the truth of the Dawn and how deep secrets go within the Union and Guilds. Mission Example An example Training mission in the base game is First Run, which is aimed to give you a taste of Siberian Dawn and the basics of a Mission. The Objectives in this Mission will take you through the steps towards the final Objective to kill the 4 VBots, the Missions in Mission Pack 1 and those to follow will contain multiple Objectives offering a longer more challenging game. First Run also contains 2 Units, the Grunt and the Scribe. The Grunt is your basic Union military Unit that will be used to attack the VBots, and the Scribe is a Guild support Unit who will help you gain Glory. Full Missions add 18 new Units to these 2 basic ones. Lore Engine Siberian Dawn is the first game to use the Lore Deck Building Engine, taking the core of a Deck Builder and adding the depth of a War Game to give the player a more strategic challenge. Dual Deck Development – Build a Resource deck and Tactics deck. Bond System – Adds 1 of 4 Guild specific contacts in a Mission (Available with Mission Pack 1) Hub System – Context relevant controls presented on a central set of pods. Fate Helix – Action resolution using a deck system allowing control over the risk of the results. Multiple Resource Management – Overseer has to balance a range of Resources to succeed. Tactical Range – Overseer has a range of distinct Units and Tactics to dominate the Missions. Mission Variety – Each Mission has a series of Objectives to give a variety of challenges.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/922880/header.jpg?t=1654776822",
    "Price": 4.99,
    "Developers": "Winterflood",
    "Publishers": "Winterflood",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/922880/ss_6b6c1bf26af386334d7027002f95ae70f5a42efd.1920x1080.jpg?t=1654776822,https://cdn.akamai.steamstatic.com/steam/apps/922880/ss_bca4ef4241888878c662e02c3dae801f5bebf4bf.1920x1080.jpg?t=1654776822,https://cdn.akamai.steamstatic.com/steam/apps/922880/ss_4f58d2409fb5d4ae97f457020b1526e398db0e4b.1920x1080.jpg?t=1654776822,https://cdn.akamai.steamstatic.com/steam/apps/922880/ss_fb041c62c428f4f1bb7872a740baf98feab24b8c.1920x1080.jpg?t=1654776822,https://cdn.akamai.steamstatic.com/steam/apps/922880/ss_960bdc3f7f34f109924c0fe7fd72d66dde24f91b.1920x1080.jpg?t=1654776822",
    "Slug": "siberian-dawn",
    "Meta Title": "Siberian Dawn: Sep 20, 2018, Winterflood and Full Overview",
    "Meta Description": "Looking for information on Siberian Dawn? Check out the release date (Sep 20, 2018), developer insights from Winterflood, and a complete game summary.",
    "Alt Text Image": "Official header image for Siberian Dawn game - Steam 922880",
    "Canonical URL": "https://gusku.site/game/siberian-dawn",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Siberian Dawn\", \"description\": \"Looking for information on Siberian Dawn? Check out the release date (Sep 20, 2018), developer insights from Winterflood, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winterflood\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winterflood\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/922880/header.jpg?t=1654776822\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}