{
    "AppID": 840370,
    "Name": "Someday You'll Return",
    "Release date": "May 5, 2020",
    "About the game": "STORY What would you do if your daughter never came home but you could track her down? It’s not the first time she ran away. But you’re uneasy … this time feels so different. Long ago, you swore never to return here. And now, she has dragged you back. Your search leads deep into ancient Moravian forests and reveals secrets that should have stayed buried. While your survival skills and quick wits might advance your search, malevolent forces rise up against you. There are nightmares you can’t fight and win. Some of them … could be yours. Your character is Daniel, Stela’s father, who is forced by events to return to a place, he swore never to return. In the forest, he will encounter peculiar people who will help him understand the true reason why Stela keeps running away. Someday You’ll Return deals with intimate concepts of fatherhood, fears, lies, and refusal to accept one’s past. While the story contains strong horror elements it’s not always the most obvious monsters which are the most frightening. The story itself spans over 13+ hours, depending on your playstyle. GAMEPLAY Someday You’ll Return brings new bold ideas to the horror genre Psychological horror - Uncover dark mysteries of the ancient Czech forest and face your deepest fears Unique Crafting system - Use your head and think when crafting some of the useful tools of survival Herbalism and alchemy system - Find rare herbs and brew your own potions that will help you survive the nightmarish world of Someday You’ll Return Exploration - Explore lush forests, deep caverns, and old castles to find your daughter’s lost journal pages, folk songs, and rare collectibles. With climbing and swimming, no secrets of the ancient forest are safe from you Karmic system - Reach one of five different endings based on your actions throughout the game Journal - Decypher your daughter’s journal and uncover the whole truth Real-life locations - Discover existing places recreated in the stunning graphics of the Unreal Engine 4 and scan QR codes to find their actual locations on a tourist map SETTING Someday You’ll Return takes place in the beautiful scenic areas of the Czech Republic. While they are not exact duplicates, we desired to capture the atmosphere of Bohemian nature. There are well-known landmarks placed within the world, which you can discover and which we've personally visited many times in our lives. You can even grab your backpack and hike there. The referenced locations and mythos in the game are ancient. Some of the tales mentioned in Someday You’ll Return date back to the 9th century.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/840370/header.jpg?t=1593600992",
    "Price": 19.99,
    "Developers": "CBE software",
    "Publishers": "CBE software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_12c66731947c66ea94830c7c5c1b13999b3eb477.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_9ad787f44aadd5c0dffdd4970a6ef42861d3d6d3.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_8c5dc960529d56685eb15401758c99bff28118dc.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_a08a989d14ff75bb6c0d7f97061c7b45a2235c19.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_61174c43635fcda888a6fce704d7d3e20e27158f.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_3b435cd526739190382719c39925f758ba3d587d.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_c241865ea3a8ad4cc97cc4eb84d5b0c86078c5fa.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_0270c0f627772a0185b55f72d620a2a423ead294.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_64cfe42a755d0e4f68200ed755c81518c693a964.1920x1080.jpg?t=1593600992,https://cdn.akamai.steamstatic.com/steam/apps/840370/ss_4ed29eb86253c923b757297eda0c16de03f34514.1920x1080.jpg?t=1593600992",
    "Slug": "someday-you-ll-return",
    "Meta Title": "Someday You'll Return: May 5, 2020, CBE software and Full...",
    "Meta Description": "Looking for information on Someday You'll Return? Check out the release date (May 5, 2020), developer insights from CBE software, and a complete game su...",
    "Alt Text Image": "Official header image for Someday You'll Return game - Steam 840370",
    "Canonical URL": "https://gusku.site/game/someday-you-ll-return",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Someday You'll Return\", \"description\": \"Looking for information on Someday You'll Return? Check out the release date (May 5, 2020), developer insights from CBE software, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"CBE software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CBE software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/840370/header.jpg?t=1593600992\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}