{
    "AppID": 332360,
    "Name": "Spriter Pro",
    "Release date": "Nov 14, 2014",
    "About the game": "Spriter makes it easy for anyone, regardless of experience , to create 2D game animations using a technique called Modular Animation . Unlike traditional animation which requires each frame to be hand-drawn, Spriter animations are made of individual sprite pieces ; these pieces can be rotated, transformed, and tweened along an animation timeline. This allows you to quickly create great looking animations in a fraction of the time while requiring significantly less art. Spriter also takes advantage of skeletal animation . Create a skeleton using the bone tool, attach images to each bone, and finally animate the bones with Spriter's vast array of user-friendly animation tools. The result: a fully animated sprite using your own graphics. Spriter is great for animating characters, user interfaces, power-ups, combat animations and more! Even if you've never animated before, Spriter provides you with an easy to understand, yet powerful toolset allowing you to jump right in! Spriter Pro includes the Essentials versions of all of our Animated Art Packs, free to use in any of your game projects. Once you install Spriter Pro It they will be located in the following location: /SteamApps/common/Spriter/Art Packs/Essentials Key Features: Using keyframes you can quickly lay out major frame changes. Frames in-between the keyframes are then automatically created. You can then edit individual frames as desired to make your animations really shine. Animations can be exported as spritesheets, animated GIF files, sequential images and more. Reuse your previous animations by incorporating them in new ones. Create perfect, smooth transitions and varieties that save time by working with animations you've already created. Adjust animation easing with several curve settings to help make your animations more lifelike. Create pixel perfect retro style animations with Pixel Art Mode. Spawn bullets, particle effects, or anything that requires precise locations and angles. Set up guide lines and load in background images to work on top of. Seperate characters into important collision areas. Inverse Kinematics. Change a bone's parent, add or remove bones, or even change sprite pieces mid-animation. Import sound effects and even use lip-syncing with built-in Papagayo support. Use Animation Data Directly In Your Game: Animations are recreated in real-time using the sprite piece images just like in Spriter. Animations are much smoother and require drastically less memory as compared to sprite-sheets. Manipulate animations via game events. Reuse your animation data for completely new characters or character customizations. Perfect for characters who gain new clothing, equipment etc. Spriter animations can be imported with full feature support in Unity and Construct 2. There are also free, open source, fully featured reference implementations for using Spriter files in C#, C++, JavaScript, and MonoGame. Spriter support on many more programming languages, frameworks, and game authoring tools coming soon!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/332360/header.jpg?t=1572344631",
    "Price": 59.99,
    "Developers": "BrashMonkey",
    "Publishers": "BrashMonkey",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/332360/ss_f2a58a24faad80d90b78e5e25f19d00492e32aae.1920x1080.jpg?t=1572344631,https://cdn.akamai.steamstatic.com/steam/apps/332360/ss_d603e14d5bd3b49ecf74f84e5e21950f679f985c.1920x1080.jpg?t=1572344631,https://cdn.akamai.steamstatic.com/steam/apps/332360/ss_211adea396adccac5fa582eddf436df642617758.1920x1080.jpg?t=1572344631,https://cdn.akamai.steamstatic.com/steam/apps/332360/ss_3c16dc6dca5ce60e315de45b1bc119f0d9192805.1920x1080.jpg?t=1572344631,https://cdn.akamai.steamstatic.com/steam/apps/332360/ss_241cae210c617c037f7312769291b1de0c92774a.1920x1080.jpg?t=1572344631,https://cdn.akamai.steamstatic.com/steam/apps/332360/ss_692fcbbdfd751196e908384d60a7ed5c53543346.1920x1080.jpg?t=1572344631",
    "Slug": "spriter-pro",
    "Meta Title": "Spriter Pro: Nov 14, 2014, BrashMonkey and Full Overview",
    "Meta Description": "Looking for information on Spriter Pro? Check out the release date (Nov 14, 2014), developer insights from BrashMonkey, and a complete game summary.",
    "Alt Text Image": "Official header image for Spriter Pro game - Steam 332360",
    "Canonical URL": "https://gusku.site/game/spriter-pro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spriter Pro\", \"description\": \"Looking for information on Spriter Pro? Check out the release date (Nov 14, 2014), developer insights from BrashMonkey, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"BrashMonkey\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BrashMonkey\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/332360/header.jpg?t=1572344631\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}