{
    "AppID": 1062000,
    "Name": "Starmancer",
    "Release date": "Aug 5, 2021",
    "About the game": "After a catastrophe on Earth, humanity launches the Starmancer Initiative in a desperate attempt to seek refuge among the stars. Millions of refugees upload their consciousness into your memory banks--entrusting their minds and the future of the human race to an Artificial Intelligence, a Starmancer. To you. Stranded in a strange solar system, your task as a Starmancer is to construct and manage a space station capable of sustaining life for the countless minds trapped in your corrupted memory banks, and return to the fleet--by any means necessary. Starmancer offers gameplay with consequences, a living sandbox environment, crafting, and managing the daily lives of colonists. Create a utopian society where everyone is well fed, happy, and safe. Or go rogue and figure out how many times a colonist can eat wheat before they go crazy. The choice is yours! Sustain Life - Colonists have needs, like hunger and thirst. Build farms and grow crops for food. Place heaters to prevent hypothermia. Construct med bays and assign doctors to treat wounds, cure diseases, and replace limbs. Express Yourself - Customize your station with unique walling, floors, furniture, and tons of weird and wonderful decorations and objects. Repaint objects to achieve your space station interior design dreams! Place cheerful paintings to remind the colonists how friendly and relatable you are, and motivational posters to let them know how much you value their productivity. Design fancy kitchens, luxurious bedrooms, casinos, and industrial docking bays. Power, Water, and Atmosphere - Provide power by connecting machines with wires. Prepare against blackouts by creating separate or redundant grids for your vital machines. Use pipes and water recyclers to convert dirty farm water into clean, drinkable water. Establish separate atmospheres with the help of vents and air ducts. Grow Colonists - Colonists are grown in Incubators, with personas assigned from the minds of Earth refugees stored in memory banks on your station. Create stations full of clones. If tragedy strikes, don’t worry, you can always regrow your favorite colonists! Jobs - Assign roles like farmer, doctor, miner, and security guard. Watch as your rookie chef acquires experience and becomes a seasoned pro, unlocking tastier and more exotic recipes. Unique Colonists - With randomized hair color and style, eye color, and skin color, there are over 8000 visual variations of colonists. These variations go beyond aesthetics, too. Some colonists prefer eating nutrition bricks on the toilet, while others like to drink and socialize in the bar. Every game is different--your station and colonists will be unique to you. Memories - Colonists remember the good (and bad) things that happen to them - until they inevitably require regrowth (accidents happen). Traumatic experiences, like seeing a dead body, will be remembered for a long time. If left unchecked, these memories will be shared, through gossip, until everyone learns about your Life Support malfunction... Leave no witnesses. Personal Relationships - Colonists get extra sad when something bad happens to a friend, but they love to watch an enemy suffer. If you jettison a popular colonist you might have a mutiny on your hands. Missions - Send your bravest colonists on dangerous missions across the galaxy to gather resources and discover precious loot! Be ready to face the consequences, should you fail in your duties as a Starmancer. Invasion - Your colony will be invaded by creatures from outer space. Build traps, arm your colonists, and keep your station secure at all costs. Insanity - A colonist can only witness so many friends being sucked out of air locks before they snap. No one knows what motivates a crazy colonist; they're simultaneously responsible for the greatest technological innovations and messiest homicidal rampages. This is why doors have locks. It's also why you can depressurize a single room--a great way to enforce bedtime. Mutiny - Unhappy colonists will stop working. You can cheer them up with motivational posters, tasty treats, and nicer rooms. Be careful, though, when morale gets too low, colonists will actively rebel and attempt to destroy your core. Make an example out of rebels and stamp out any hint of resistance. Key Features Build a thriving space station, with tons of customization. Manage the lives of colonists aboard your station. Interact with a dynamically generated solar system and its inhabitants. Take on missions and be rewarded with loot. Face the consequences of your actions. Modding support. Add Starmancer to your wishlist and be notified when it launches.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1062000/header.jpg?t=1628197847",
    "Price": 19.99,
    "Developers": "Ominux Games",
    "Publishers": "Chucklefish",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_395da6bb89e51d1e11c261a9718befa59b67a654.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_287c5c9a5d5b826655d18508b6ecaa67f45b9f48.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_3a577f3d8a483bd46d1ab41be4af618673d6202e.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_9e7c9f56c3ac9c99f567e2f9b8e2147bf83d2ff3.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_bd4b0759807bbd4021d27ec44219de2c7c32ade7.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_00c54921b36627077ba444884645ec4df318511a.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_896827e3fdadde110b5828e02fce722786433b3a.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_66c3279fb7852feb059c3509f92218ff0e5610b0.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_29f8248d52270fa45379c759f1b2ac264af6cd52.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_4f7f722b971aadb2d894758c62a0c691fbdce4fe.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_cb38cd17a2e5f8181520e52c58bf8fc8d5677983.1920x1080.jpg?t=1628197847,https://cdn.akamai.steamstatic.com/steam/apps/1062000/ss_42436f3be501e6f62e62e29ca28ea56e0f9c92dc.1920x1080.jpg?t=1628197847",
    "Slug": "starmancer",
    "Meta Title": "Starmancer: Aug 5, 2021, Ominux Games and Full Overview",
    "Meta Description": "Looking for information on Starmancer? Check out the release date (Aug 5, 2021), developer insights from Ominux Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Starmancer game - Steam 1062000",
    "Canonical URL": "https://gusku.site/game/starmancer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Starmancer\", \"description\": \"Looking for information on Starmancer? Check out the release date (Aug 5, 2021), developer insights from Ominux Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ominux Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chucklefish\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1062000/header.jpg?t=1628197847\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}