{
    "AppID": 1286830,
    "Name": "STAR WARS™: The Old Republic™",
    "Release date": "Jul 21, 2020",
    "About the game": "STAR WARS™: The Old Republic™ is the only massively multiplayer online game with a Free-to-Play option that puts you at the center of your own story-driven STAR WARS™ saga. Play as a Jedi, a Sith, a Bounty Hunter, or as one of many other iconic STAR WARS roles and explore the galaxy far, far away over three thousand years before the classic films. With 6 narrative expansions, become the hero of your own STAR WARS adventure as you choose your path down the Light or Dark side of the Force™. Create your legacy. Make meaningful choices throughout your journey and become the hero of your personal STAR WARS saga. The game includes an interactive storyline with cinematic dialogue and full voiceover for all in-game characters. A growing world awaits. For more than 10 years, players have been able to live out their own STAR WARS stories. With the most recent Onslaught expansion, STAR WARS: The Old Republic continues to deliver ongoing content through regular updates. 8 Unique Stories, 16 Combat Styles. Do you prefer the elegance of a lightsaber or the reliability of a good blaster by your side? Choose from one of 8 iconic, unique storylines, allowing you to create your own personal STAR WARS story. The Legacy of the Sith Expansion also introduces Combat Styles! Players can now separate their Class Story from gameplay style for an even greater customization experience. This frees up Advanced Class options as characters can choose any Advanced Class within the Tech or Force playstyle! Play as a Trooper wielding a Sniper Rifle, or a Sith Inquisitor with a lightsaber in each hand, or even secretly use Dark Side powers while posing as a member of the Jedi Order. Explore numerous planets. Hoth, Tatooine, Alderaan, and over 20 other unique and vibrant planets offer exciting exploration and thrilling adventures around every corner! Multiplayer gameplay. Gather your allies to face challenging encounters against enemy bosses in Flashpoints and Operations, or battle against other players in Player vs. Player Warzones, Arenas, or Galactic Starfighter missions! Galactic Strongholds Want to take a break from the inter-galactic traveling and adventure? Kick back and relax with our player housing system called Galactic Strongholds! Whether it’s overlooking the sandy dunes of Tatooine, the bright cityscape of Nar Shaddaa, or the tranquil mountains of Alderaan, there’s a Stronghold for everyone. These destinations and more are available for your galactic homestead! Cartel Market. Only the slickest items can make their way to the Cartel Market, the premium marketplace for the galaxy’s most sought-after commodities. Players wishing to buy things here will need to purchase in-game currency called Cartel Coins. Learn more about what Cartel Coins can unlock on our Cartel Coins Page. Subscriber Benefits. STAR WARS: The Old Republic offers an optional subscription that allows you to experience even more of the STAR WARS universe. Benefits include an increased level cap of 80 and access to the most recent expansions: Legacy of the Sith, Onslaught, Knights of the Eternal Throne, and Knights of the Fallen Empire. In addition, you will receive a monthly Cartel Coin Grant, increased XP, and more. Details on Subscriber Benefits can be found on our Subscriber Page.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1286830/header.jpg?t=1645090351",
    "Price": 0.0,
    "Developers": "BioWare",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_582b40b9dea8273368826afd425f541aa859bbe6.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_23613f91ee765a1e4e647a183261aeb2ecbc2c86.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_b9bf304772e010c91eac9cf8faa791c48749b076.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_9d45b0d2ab79c146dd7dd2751c21dae4e153d280.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_5c4a1d2c32449d7f59a91e7087d4b37db49148c3.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_40af51178b6f01c61267e151ff1949eb5b19807a.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_b6fafdde1787fe13de505c586399f4a6a8611e66.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_4c0af2dc7d9d63dee90cb5a8d1ebbe4d630ca70f.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_18f1059caf837ef615b805579028ed3dc4198e0a.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_27b663be667a4124acec815f4737b9781aa6cb17.1920x1080.jpg?t=1645090351,https://cdn.akamai.steamstatic.com/steam/apps/1286830/ss_7efd21f439211b2b44c4893172170a3316330bda.1920x1080.jpg?t=1645090351",
    "Slug": "star-wars-the-old-republic",
    "Meta Title": "STAR WARS™: The Old Republic™: Jul 21, 2020, BioWare and ...",
    "Meta Description": "Looking for information on STAR WARS™: The Old Republic™? Check out the release date (Jul 21, 2020), developer insights from BioWare, and a complete gam...",
    "Alt Text Image": "Official header image for STAR WARS™: The Old Republic™ game - Steam 1286830",
    "Canonical URL": "https://gusku.site/game/star-wars-the-old-republic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"STAR WARS\\u2122: The Old Republic\\u2122\", \"description\": \"Looking for information on STAR WARS\\u2122: The Old Republic\\u2122? Check out the release date (Jul 21, 2020), developer insights from BioWare, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"BioWare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1286830/header.jpg?t=1645090351\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}