{
    "AppID": 1207650,
    "Name": "Suzerain",
    "Release date": "Dec 4, 2020",
    "About the game": "As President Anton Rayne, lead Sordland during your first term of this text-based narrative RPG. Navigate a political drama, driven by conversations with your cabinet members and other significant figures in a country with its own complicated history. With looming border conflicts, entrenched corruption, economic crisis and people desperate for reform, as leader the difficult choices fall on your shoulders as you strive to uphold your election promises. In 1954, the country of Sordland is emerging from a 20-year dictatorship, following a bloody civil war. You play as a charismatic young man, Anton Rayne, who has surprised everyone by rising to the top of the party in power and getting elected as the new President of Sordland. The people are hungry for democratic reforms after decades under a traditionalist power. The economy is in shambles and the political landscape is shifting. Neighboring superpowers are watching closely, and there are military threats on the horizon. As President, you have the final say but every choice you make has an impact. Your colleagues, the opposition, corporations; everyone has a point of view. Think and act carefully: once enacted your choices can not be reversed. Good luck, Mr. President. The game opens with a prologue in which Anton lives through formative events that shape his history from childhood through to the moment he is elected. Take this further by customising your look and style. At the end of Anton’s term, visualize how his choices impacted the country and how he lands on the Sordish political spectrum. Work closely with the Cabinet and prominent figures to forge strong policies and practices. You will need to keep your allies on your side and carefully consider where you will compromise your values and who you will make an enemy of. Everyone has their own ambitions in play. Leading a country is demanding. Face constant conflict about which is more important, serving the country or supporting your family. Is it possible to be a good father and a good president at the same time? Weighty, dramatic conversations : Navigate intricate conversations in this 400K-word branching political drama. Every choice has consequences : Make difficult choices on security, economy, diplomacy and more. Even outside the office, your values and beliefs will be challenged. Make allies and enemies : Interact with a wide array of characters with different personalities and ideologies. The oath of office versus family and values: See the real impact of the choices made in office on your family and close relationships Pay attention to current events : Follow the situation in Sordland through reports and news. What will your legacy be? : You can take the country in many different directions, resulting in one of 9 different major endings. Every decision you make is final: there is an autosave feature that does not allow loading earlier saves. Make choices carefully.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1207650/header.jpg?t=1640820900",
    "Price": 14.99,
    "Developers": "Torpor Games",
    "Publishers": "Fellow Traveller",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_c45cb04b7d2bc18860de11baa1068e7289e09287.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_6d3489730260667d6bd70c7cf2ac5a2e21059df5.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_6709263b14d2d2250a0e3591e90ee36523b42025.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_78d56ecfe77af8c19f2c5fdfd74fd3d2a6169ded.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_fb95019ea828781187c1638bccb2f3807e086082.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_65e2895257e8a33405743e07c7732a4b6ab9f9c2.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_06dbafc07af268b0e528e955dcd8dea8b99011d2.1920x1080.jpg?t=1640820900,https://cdn.akamai.steamstatic.com/steam/apps/1207650/ss_dab552ec6c5a13f68a482d66654bc01f335ec0d3.1920x1080.jpg?t=1640820900",
    "Slug": "suzerain",
    "Meta Title": "Suzerain: Dec 4, 2020, Torpor Games and Full Overview",
    "Meta Description": "Looking for information on Suzerain? Check out the release date (Dec 4, 2020), developer insights from Torpor Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Suzerain game - Steam 1207650",
    "Canonical URL": "https://gusku.site/game/suzerain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Suzerain\", \"description\": \"Looking for information on Suzerain? Check out the release date (Dec 4, 2020), developer insights from Torpor Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Torpor Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fellow Traveller\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1207650/header.jpg?t=1640820900\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}