{
    "AppID": 1707650,
    "Name": "Swords and Sandals Immortals",
    "Release date": "May 26, 2022",
    "About the game": "It's Swords and Sandals as you've never seen it. Brutal turn-based combat where gladiators can lose limbs, wield guitars and yell so loudly their foe's heads will fall off. This is the most fun you'll ever have in the arena, and it all starts here. COMING SOON - Finally, for the first time in over a decade, multiplayer combat will return to the world of Swords and Sandals. Be matched with and test your skills against real humans as you strive to be the greatest gladiator in the whole world. Rise in the leaderboards and prove once and for all who the best player of all time is. Create a gladiator from one of dozens of races, make them a 7 foot undead giant with a battle axe or a tiny jelly blob with a laser cannon. Your gladiator will be unlike any other, with deep skill trees and hundreds of weapons to craft and equip you will not face the horrors of the arena unprepared! For a decade we wondered what happened to the Starbound Gladiator at the end of Swords and Sandals III ... now all answers are revealed as the robotic Automatons return to Brandor with new space-age technology! Embark upon a massive new single player campaign in the form of Swords and Sandals VI , where you shall journey across the vast continent in search of fabled Arena Champions to defeat. Do battle in the scorching heat of the T'Kash desert, in the lonely abyssal caverns of the Forbidden Depths and in the great palaces of Phaetor itself. Swords and Sandals Immortals Core Gameplay Features COMING SOON - Multiplayer mode! At last, battle player controlled gladiators from all over the world in online turn based combat! Swords and Sandals VI : Continue the story from where S&amp;S III left off as the Automatons return to Brandor with new challenges for our gladiators! A single player adventure across Brandor featuring over 40 all new Arena Champions ( and some returning fan favourites ) Limb severing and decapitations! Sever arms and legs and keep on fighting as your gladiator finds the strength to endure Create a gladiator your way. Customize everything from height and weight to facial features and hometown, the choice is yours. Will you be a powerful undead mandolin-wielding barbarian? A Sagan Blob archmage with the power to regenerate lost limbs? Many new classes to choose, skills and talents to learn. Rain molten death from the skies, play guitar solos that shake the ground! COMING SOON - Dungeon Crawl through fast paced mini-dungeons on your journey, fighting powerful Champions for great rewards COMING SOON - Craft and wield powerful weapons. Autocannons that shoot lightning, hand axes that drip poison or guitars that glow with fire! Defeat your enemy using all new combat skills. Throw your weapons, even throw discarded healing potions. Whatever it takes to win! An all new game engine for the first time in years! New special FX, particles, animations and music, created from the ground up with the Godot Engine. This is indeed the greatest Swords and Sandals adventure ever. Grab your sword, equip your sandals. It's time to take on the world and become an immortal.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1707650/header.jpg?t=1655164147",
    "Price": 17.99,
    "Developers": "Whiskeybarrel Studios",
    "Publishers": "eGames.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_76e44f31804a0eb789bffbc36f736dc01a15edc9.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_02f1a799dbb66b3276c4e98d85e2a34966b8c383.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_27a54b18192855e5312e36c205b88ad9597f6931.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_8b061ab4eb3b5011e62125db3cab7eba4ab58cb2.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_c3633244aa9f9aa9f08f3aeb0862d735ecd890d6.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_8a6aae8ac17c301c4da904176985ae9b70149d86.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_9303ada4c2dcdf81b5b61548fe4bc248e11037d8.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_a45b6a34af49765324e0b7a636a6461645f94a8d.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_e1c55f9e47ea4d7ad7f5397413977f8252ddf253.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_e349242baebb668943bf649f6014e82a7a115260.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_3b7d88301b52d947ada1f4262c8503d2a80ed8d0.1920x1080.jpg?t=1655164147,https://cdn.akamai.steamstatic.com/steam/apps/1707650/ss_218bca8c262cc578ab0d67c1cc9b8d80230720db.1920x1080.jpg?t=1655164147",
    "Slug": "swords-and-sandals-immortals",
    "Meta Title": "Swords and Sandals Immortals: May 26, 2022, Whiskeybarrel...",
    "Meta Description": "Looking for information on Swords and Sandals Immortals? Check out the release date (May 26, 2022), developer insights from Whiskeybarrel Studios, and a...",
    "Alt Text Image": "Official header image for Swords and Sandals Immortals game - Steam 1707650",
    "Canonical URL": "https://gusku.site/game/swords-and-sandals-immortals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Swords and Sandals Immortals\", \"description\": \"Looking for information on Swords and Sandals Immortals? Check out the release date (May 26, 2022), developer insights from Whiskeybarrel Studios, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Whiskeybarrel Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"eGames.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1707650/header.jpg?t=1655164147\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}