{
    "AppID": 276730,
    "Name": "Tango Fiesta – 80’s Action Film meets 2D Top Down Multiplayer Co-Op Roguelike Military Shooter",
    "Release date": "Sep 24, 2015",
    "About the game": "Tango Fiesta is an action packed top-down cooperative two stick shooter for 1 to 4 players. Set in a world where the events from every single 80’s action film ever made actually happened to one unlucky hero called John Strong, you and up to three friends get to blast, shoot, knife, and high score your way through endless procedurally generated levels in the ultimate true story behind all those amazing movies! What’s in Tango Fiesta right now? All of this... 6 CLASSIC ACTION HEROES TO CHOOSE FROM! JOHN STRONG! The world’s least-known most-dangerous man. MACMILLAN! John’s best friend and comrade in arms. BIONIC COP! He thinks he’s a Cop. He thinks he’s a robot. But is he either? Both? NEITHER? CONCHITA! Five feet three inches of pure dynamite, this wrongly-convicted felon is out to prove her innocence by killing everyone in her way. DR HENK! he’s a doctor of parapsychology don't you know? He loves bustin' too, and this hobby just became his only means of survival! MILLER! A slightly scary Australian man with a nice jacket and an even nicer sawn-off shotgun. 4 PLAYERLOCAL COOPERATIVE PLAY! Team up with your friends to deal out death and destruction to the endless hordes! ENDLESS PROCEDURAL CHALLENGE! Five worlds of procedurally generated mayhem means no two plays are ever the same across all 20 stages! 17 enemy types keep the action challenging and fresh! Take in the sun (and avoid the bullets) on the golden sandy beaches of Gordon’s Island! Dive for cover in the usefully-tough foliage that grows in the Central American Jungle! Prove your innocence by killing your way through the fiendish death mazes in the world’s most popular TV show, Who Wants To Be A Killionaire! Don't cross the streams! Busting ghouls and ghosts in the spooky, fog-laden Ghoul Squad! Define the future of law enforcement fighting through the rust belts riddled through future Detroit! SHOCKS, TWISTS AND TURNS IN STORY MODE! Although our main inspirations are better known for their snappy one liners over their well developed character arcs we’re taking the opportunity to set the world to rights. Help John Strong as he unveils the true story behind all of your favourite classic 1980’s action flicks. Go with him if you want to believe! SUPER EVIL BOSSES! Every Quaid needs his Richter. Every Ripley needs her Alien Queen. Every Matrix needs his Bennett. We’re going to cover you in so many iconic, hilarious, over the top and challenging bosses you’ll wish you’d never promised to save the world. MASSIVE ARSENAL! Will you choose the Oozy 9mm, Arius A1, Matrix 80, Sawn-off, Viper Combat Rifle, or one of the other 25 to crush your enemies with? Say hello to every little friend you could ever want - unlock them through play and then buy them for your hero! FULLY DESTRUCTIBLE SCENERY! Our heroes ain’t got time to bleed, but the rest of the world doesn’t get off so lightly. Getting overrun? Destroy those Spawn Huts to stem the tide of bad guys. Stuck between a rock and a hard place? Blast your way through any wall or structure - show those bricks who’s boss!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/276730/header.jpg?t=1621248322",
    "Price": 9.99,
    "Developers": "Spilt Milk Studios Ltd",
    "Publishers": "Spilt Milk Studios Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_27adddf6044cd4b51287927a96afac79433713d4.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_d19a291b6812b8a1006ff8fbbf49d4a0d90cedf9.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_c21fceaa593b3488cb1ebd014f774febf27b6239.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_8a9b3ce2a21ad29817bb1d7233016918ba53584d.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_f4f91b982a0be289b7c1708b05a7243e633a545a.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_b15b23524ecc83a077b510ca3de7c66d049fbe36.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_b1936bf397c808005e9f2b2384390df0c3e5e343.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_0469a8a6a56505a6881dd3c265f78333fb7cbecb.1920x1080.jpg?t=1621248322,https://cdn.akamai.steamstatic.com/steam/apps/276730/ss_507aa28ab16d6a6736328eb29a30935146fb59bf.1920x1080.jpg?t=1621248322",
    "Slug": "tango-fiesta-80s-action-film-meets-2d-top-down-multiplayer-co-op-roguelike-military-shooter",
    "Meta Title": "Tango Fiesta – 80’s Action Film meets 2D Top Down Multipl...",
    "Meta Description": "Looking for information on Tango Fiesta – 80’s Action Film meets 2D Top Down Multiplayer Co-Op Roguelike Military Shooter? Check out the release date (S...",
    "Alt Text Image": "Official header image for Tango Fiesta – 80’s Action Film meets 2D Top Down Multiplayer Co-Op Roguelike Military Shooter game - Steam 276730",
    "Canonical URL": "https://gusku.site/game/tango-fiesta-80s-action-film-meets-2d-top-down-multiplayer-co-op-roguelike-military-shooter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tango Fiesta \\u2013 80\\u2019s Action Film meets 2D Top Down Multiplayer Co-Op Roguelike Military Shooter\", \"description\": \"Looking for information on Tango Fiesta \\u2013 80\\u2019s Action Film meets 2D Top Down Multiplayer Co-Op Roguelike Military Shooter? Check out the release date (S...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 24, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spilt Milk Studios Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spilt Milk Studios Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/276730/header.jpg?t=1621248322\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}