{
    "AppID": 758250,
    "Name": "Taste of Power",
    "Release date": "Oct 10, 2019",
    "About the game": "Taste of Power is a real-time strategy game set in alternate medieval times, where you fight for one of 3 factions – Europe, China, or the Middle East. In our version of history, nations clash for global dominance. The continent is an epic battlefield, so you’ll have to build cities, recruit troops, study new technologies and wipe out your opponents. Your nation needs a proper commander! New Medieval warfare Tactics are essential in Taste of Power. The numbers of your enemies' troops don't mean much if you meet them with a proper artillery battery. Engineering power has no limits here, as you can build mobile defenses to protect strategic positions. Build underground tunnels to move your forces across the battle lines faster and surprise your opponent! Each nation has a unique set of units. Taste of Power offers a drastically different style of play for each faction. European troops European knights can form different defensive formations, like Phalanx or spear walls. Having troubles in battle? Summon the Crusaders and crush your enemies! Having issues with your army's discipline and morale? Command your monks to encourage your army with the Word of God. You can also use gunpowder and make a difference that way. It's up to you what call to make! Middle Eastern warriors Great warriors, Timurids, can use elephants to help their cause. Command one to crash those around, or get help from chariots with incendiary oils to burn your enemies down. Their engineers are masters of the earth digging techniques – a stealth attack through an underground tunnel will surely be lethal. Yet again, shot-calling is essential and key in the game. Chinese heroes Unlike the Europeans and Timurids, the Chinese have other ways of using gunpowder. Use smokescreens to protect your army from arrows, throw poison grenades and burst low-tech missiles – make the battlefield a living hell for your enemies! After that, you can call for your cavalrymen to end their suffering. You can also set traps for the enemy and medical tents for yourself. The economy of the game is similar to strategy masterpieces. You use workers to collect resources and create different goods. The building phase is simplified, so you could focus on the grand strategy. Learning technologies is important – don’t forget to keep track of your infrastructure! Furthermore, you may be trading with incoming caravans, or simply loot them for goods. The decision is up to you! Taste of Power is a game that challenges your strategy skills. Will you be able to make the right decisions in a limited time-frame? Prove yourself by defeating the brutal AI and feel the Taste of Power!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/758250/header.jpg?t=1594017223",
    "Price": 14.99,
    "Developers": "OneOcean LLC",
    "Publishers": "OneOcean LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_e51f4a481624cf7d9d45b4a9b90807d90566fccb.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_0b497b233e05972720401f1c2846a65cbb4408b0.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_f9104056cb03d28df6b822a25a3d22dd342a6565.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_13ca31ad46a843a0a6b090024f41965e2903ab69.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_a3e7127f290ecdeca9a1cec7d06d47e5962404f0.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_9fc9f3b5be34c0c9ce761cecb2bce0dc3509a445.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_595f23f11db4634c0108cc0fff01dac9fa0a93e5.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_02beacb0c2c1c85f68852573a5e6c330e0c0d7e4.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_a4f4637bdef8bcae838f844e9f0d4ad31ddfe682.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_5ab90930bac0da1cfe22ce04cac582fb66686b87.1920x1080.jpg?t=1594017223,https://cdn.akamai.steamstatic.com/steam/apps/758250/ss_aa50f8f50d7ef608a25a577d6126ac4ad45021fe.1920x1080.jpg?t=1594017223",
    "Slug": "taste-of-power",
    "Meta Title": "Taste of Power: Oct 10, 2019, OneOcean LLC and Full Overview",
    "Meta Description": "Looking for information on Taste of Power? Check out the release date (Oct 10, 2019), developer insights from OneOcean LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Taste of Power game - Steam 758250",
    "Canonical URL": "https://gusku.site/game/taste-of-power",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Taste of Power\", \"description\": \"Looking for information on Taste of Power? Check out the release date (Oct 10, 2019), developer insights from OneOcean LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"OneOcean LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OneOcean LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/758250/header.jpg?t=1594017223\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}