{
    "AppID": 394690,
    "Name": "Tower Unite",
    "Release date": "Apr 8, 2016",
    "About the game": "Tower Unite is a living, evolving world, fueled by the community. Play online games with your friends or make new friends from around the world! Tower Unite is a large online multiplayer game that spans several genres. Play fully featured minigames such as Minigolf, Accelerate, Ball Race, Virus, Zombie Massacre, and more! Hang out and enjoy various games at the virtual theme park filled with activities and games called the Plaza! Play over 30 unique Arcade games with multiplayer support! Build unique creations and share your creativity with your friends! Customize yourself with accessories and Workshop player models Party with friends! Create custom models and import them directly to the game with Steam Workshop Earn over 2,000 unique &amp; interactive items Watch synchronized media from YouTube and Soundcloud Rank up and earn achievements and items Suggest new features - we listen! No microtransactions, subscription fees, or paid DLC. Every content update is free DO MORE THAN OTHER VIRTUAL WORLD GAMES Tower Unite isn't just a walk-around-and-chat simulator. You can run, jump, crouch, use jetpacks, get drunk, dance, sit, throw-up, lounge in pool tubes, drive vehicles and much much more. Tower Unite has many games to play, with more to come, such as... Online multiplayer minigolf with up to 16 players 9 courses with 18 holes (162 holes total) and more in the works! Based on the original 2009 minigolf hit from GMod Tower that inspired many minigolf games Unique controls (100% skill, no timers) Hole-in-one fireworks! Wear tiny hats &amp; glasses on your golf ball Putt in snow, gardens, mines, sky, and even in space! Simultaneous putting (everyone putts at once!) Single player mode available Player hosted servers Online multiplayer Kart racer with up to 10 players 14 unique items to knock out the competition with Speed through 6 scenic tracks, with more in the works! Play as any character using Steam Workshop Single player mode available Player hosted servers Online multiplayer ball racing with up to 16 players 9 unique worlds and more in the works! Speed roll around in a giant ball Carefully maneuver around tricky obstacles Single player mode available Player hosted servers Up to 8 players online 6 unique levels and more in the works! Thrilling 1 vs All gameplay Become the Dragon and devour the knights Attempt turn off the rampaging Dragon as one of the knights Player hosted servers Online multiplayer top down shooter with up to 6 players 4 unique levels and more in the works! Co-operative shooting action Survive waves of zombies and monsters 6 unique character classes with their own powerful abilities 32 overpowered zombie massacring weapons Boss battles Single player mode available Player hosted servers Online multiplayer FPS iwth up to 12 players Survive the inevitable infection in 5 unique levels and more in the works! Fast paced old school first person shooting action Blast infected away with 10 high-tech sci-fi weapons Team tag elimination, with weapons Player hosted servers Hang out and enjoy various games at the Plaza! The Plaza is a massive place filled with activities and games that can all be enjoyed in one place. It's like a virtual theme park filled with multiplayer games. Everything in the Plaza is multiplayer so you can participate with all the activities with your friends or make new friends! The Plaza features many activities such as: Arcade - Play over 30 fully featured multiplayer Arcade games and win tickets and prizes (more games being added) Nightclub - Listen to music in a fully synchronized visualizer with Soundcloud and YouTube support. Enjoy billiards and bar drinks as well! Casino - Gamble at 3 different slot machines, video poker, video blackjack, spin to win, and poker Fishing - Fish up over 100 unique fish in a unique fishing minigame Bowling - Bowl with friends and enjoy media at the same time Laser Tag - Play fast-paced team laser tag Trivia - Answer various up-to-date questions submitted by our community Theater - Watch synchronized YouTube or SoundCloud Typing Derby - Type as quickly as you can and race to the finish Boardwalk Rides - Ride a rollercoaster or relax and catch the views on a ferris wheel with your friends Minigames &amp; Events - Participate in dozens of quick minigames such as Balloon Shoot, Plane Wars, and more Seasonal Events such as Summer, Halloween, Easter, and Winter Holidays - Collect limited time items and celebrate various holidays. Unlock items at in-game stores - Unlock thousands of new items at 18 different in-game stores Build unique creations and share your creativity with your friends! Easily display images from the internet and import custom models. Customize wallpapers, lights, time of day, and weather to set the perfect mood. Enjoy sync'd YouTube videos and music from SoundCloud. Interact with over 1500 unique items, such as playable pianos and basketball. Place and scale tons of different furniture and items in any arrangement you desire Display images from the internet directly in the game (synced with online players) Build unique and vast creations Customize wallpapers, lights, time of day, and weather Invite friends to party, chat, voice chat, drink, and eat virtual pizza! Watch synchronized media such as YouTube and SoundCloud Build and share Condos with your friends! Play instruments like a piano or drums Interact with over a thousand various weird and cool items Get a pet cat, dog, fish, or w a t e r m e l o n COMING SOON: Cook/craft food and new items Play multiplayer games of various genres online with friends Play online Minigolf with up to 16 players Play online kart racing with up to 10 players Create custom models and import them directly to the game with Steam Workshop Customize yourself with lots of accessories Dance at a Nightclub with billiard tables and synchronized visualizers Furnish and design the layout of your personal space (the Condo) with furniture and interactive toys Invite other players over to your Condo for parties and mini-games Watch synchronized YouTube videos or Soundcloud music in a virtual theater or your personal Condo Fly around in jetpacks Imbibe alcohol to an irresponsible extent Join official servers or host your own server Hang out with your friends or find new friends! Enjoy free DLC, no microtransactions, and developer support Collect tons of unique items with Steam Inventory support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/394690/header.jpg?t=1641885301",
    "Price": 19.99,
    "Developers": "PixelTail Games",
    "Publishers": "PixelTail Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_4667fd3f304eac6a4dfe4480d44fab7dc9ea4602.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_5ee106d44e302ebcd094730d577f6eff618ea4ac.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_b46a289585bf1cb8bd9841d4a632475adec9c807.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_97727a8b8caa3ee100cc7fa63248f051c21561db.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_e7582f43869e2b9627e90ccbb5dc35d758906976.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_60e09067933b386c26d475c1ba1d9e4e2f23b63b.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_c1cc3bd9e837e8c8dd77d9be5be5ecadef670d6f.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_deb1ab009039e2c72122855fe8054dc8cade0dd3.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_6496c3bb54bc2dab64d538763e740284b2e7d12b.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_356ba51ea8ed056a189830f8e5e87aa5207bd8d5.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_6d59d2c5d400aad8eeaa4162d6488ce7e3e0d95c.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_14740a67378008f66041575411a197127d9c5250.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_e1ca9c0c976e3fb7818e6203a1a4a86a3dd4e188.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_23667616507e8dbe30b917e5e0a220c67d4d5d0f.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_43cdada11c83c622a98c76a250c99e818cbda410.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_29d4bf2d79aa7e064df95fca165c33066a702278.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_0f09aecda9e09af1b7894dda3857e027bdb4c8be.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_ce31017896f9417a16b856e490a262356b76b4a6.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_4b911d730cbb7a5f9c001eebf7a2a64b556aed87.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_e93c036645b50acf15a40023e5d94aae5c39471e.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_9a28db7e5d27d89ad18307a16c74bcf25d10ad31.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_7e5537df7b0472cf82318995e0e89ab6790fe46d.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_6b8e3965607d0c27ab01399f639c32c4b170a858.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_4f2a2359f1393b0476492c2c80685e76568e9ec2.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_83d43a608a282edd1de2349c30cf9ac266b6473c.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_9036873800bd4bd3f8452ca640c36c5b96380dce.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_ce656926a2ebb734bb4060cbe645f375c6b16d55.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_510d38d706e7787c8bb92826ec8e0a5987fb47e5.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_d076c16c96673b3d9a1acaecb9166c4172e5f582.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_b091946623596debebc201e29e5bb197796300ee.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_8c4445b96f94ff66deb4d2ad5ed02d1eaea2d932.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_6fd8308cf5bed2411e18a5d8b4c32dac4a6b4337.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_cfff0d741d8c2444c55c1100f75b9ae2c98b80cb.1920x1080.jpg?t=1641885301,https://cdn.akamai.steamstatic.com/steam/apps/394690/ss_034b54a70b21fa53894cfcf9d18bea6447d02b4a.1920x1080.jpg?t=1641885301",
    "Slug": "tower-unite",
    "Meta Title": "Tower Unite: Apr 8, 2016, PixelTail Games and Full Overview",
    "Meta Description": "Looking for information on Tower Unite? Check out the release date (Apr 8, 2016), developer insights from PixelTail Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Tower Unite game - Steam 394690",
    "Canonical URL": "https://gusku.site/game/tower-unite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tower Unite\", \"description\": \"Looking for information on Tower Unite? Check out the release date (Apr 8, 2016), developer insights from PixelTail Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 8, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"PixelTail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PixelTail Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/394690/header.jpg?t=1641885301\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}