{
    "AppID": 1856850,
    "Name": "TukTuk",
    "Release date": "Apr 15, 2022",
    "About the game": "TukTuk is a 2D side-scroller which focuses on precise and unique platforming, and also on fighting. Having a steep learning curve, a fast-paced action-packed experience is established which gets more intense as your skill progresses. TukTuk is designed primarily for experienced players, but non experienced players are taken by the hand through the struggles of TukTuk 's search for her mother. ALL BECAUSE OF A ROCK... TukTuk and her mother travel through space in different spaceships. Suddenly, a meteor hits the spaceship of TukTuk 's mother, and she has to do an emergency landing. TukTuk makes it her mission to find her mother. Is mom okay? And what trouble will TukTuk get into on this unknown planet? That’s your job to find out... YOU ARE THE ARTIST The game is designed to be creative on the platforming sections and there are different tools to do platforming. Especially after the first playthrough, the challenges and how the player chooses to tackle them become more open and offer the possibility to fly through the levels as you like. Every area is unique (if it's not a filler) and created so that the experience is always fresh and entertaining. Also, the camera embraces a very unique playstyle which has to be experienced in order to understand it. DO AS YOU PLEASE Besides the platforming, you will face enemies throughout your quest. The upgrading system will let you choose whether you want to focus on fighting, platforming or both and will let you decide on how you want to play the game. When you feel stuck, there is always the possibility to go back to other levels and farm Lua, the in-game currency. THE SKY IS THE LIMIT We made sure there is a reason to come back to this game. When you are into difficult platforming, the late game will be just right for you. You can almost endlessly improve the stats of your character, but your skill is also always able to improve. This game is made for speedruns. It is a whole new experience when you try to go as fast as you can and the camera emphasizes this fast motion as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1856850/header.jpg?t=1650106005",
    "Price": 1.99,
    "Developers": "Bl4ck?",
    "Publishers": "Bl4ck?",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1856850/ss_3a402f01daada99ec4c9c3dc48a2dcf9b2744349.1920x1080.jpg?t=1650106005,https://cdn.akamai.steamstatic.com/steam/apps/1856850/ss_c5d383f45fe359a985bbb0a763c966b75951dd9e.1920x1080.jpg?t=1650106005,https://cdn.akamai.steamstatic.com/steam/apps/1856850/ss_63d1c995812b825e3218cd8840a43d9b79b64526.1920x1080.jpg?t=1650106005,https://cdn.akamai.steamstatic.com/steam/apps/1856850/ss_c6376d2f66e5ced68e4144140421864c42371541.1920x1080.jpg?t=1650106005,https://cdn.akamai.steamstatic.com/steam/apps/1856850/ss_220cdf264ea4726518659c896b38957f4599f532.1920x1080.jpg?t=1650106005",
    "Slug": "tuktuk",
    "Meta Title": "TukTuk: Apr 15, 2022, Bl4ck? and Full Overview",
    "Meta Description": "Looking for information on TukTuk? Check out the release date (Apr 15, 2022), developer insights from Bl4ck?, and a complete game summary.",
    "Alt Text Image": "Official header image for TukTuk game - Steam 1856850",
    "Canonical URL": "https://gusku.site/game/tuktuk",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TukTuk\", \"description\": \"Looking for information on TukTuk? Check out the release date (Apr 15, 2022), developer insights from Bl4ck?, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bl4ck?\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bl4ck?\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1856850/header.jpg?t=1650106005\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}