{
    "AppID": 795640,
    "Name": "VINDICTA Arcade",
    "Release date": "Oct 26, 2018",
    "About the game": "Behind the gates of their massive HN1 Facility, UB Industries reveals itself to be the evil corporation it really is, building a robot army in its evil plans to take over the world. But hope is all but lost in this world - as an elite infantry agent, Agent V, your mission is simple: infiltrate the fortified facility, seek and destroy evil robots and put an end to UB Industries operations once and for all! VINDICTA, a shooting game with a strong stealth component, will you make you feel as immersed as ever as you find your way around UB Industries, shooting robots, ducking to avoid their incoming bullets and hiding to escape enemy fire! Discover a whole new level of VR action gaming and feel your heart racing as you pick up deadly weapons of all grades to fight off evil robots out to take you down! Vindicta Features: Active VR Gameplay: Feel the adrenaline rush as you physically walk through UB Industries' facility, ducking to dodge laser beams, taking cover during shootouts with evil robots and launching cluster grenades at incoming attackers! Locomotion System : VINDICTA has two main locomotion system to choose from: the main arm-swinging locomotion which feels very natural inside a VR environment and a very smooth and responsive trackpad movement option. The choice is yours! Precision Shooting : Shooting mechanic is on point! VINDICTA takes realism to a whole new level with a focus on stealth, tactical movement, and precision shooting. Deadly Weapons : Handguns, rifles and cluster grenades are just some of the massive weapons you'll be using to take down your enemies. A Variety of Enemies: Shoot and destroy enemies that will come at you from different directions, in all shapes and sizes - including drones, mechanical spiders among others so watch out! Scoring System : Different shots mean different scores! The scoring system is just the thing to add to the game its competitive edge! Only one can take the top spot on the VINDICTA leaderboard and be the ultimate Agent V! You’ve got to ask yourself one question… do you have what it takes?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/795640/header.jpg?t=1540560150",
    "Price": 0.0,
    "Developers": "Game Cooks",
    "Publishers": "Game Cooks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/795640/ss_6aa88a1aa2c727f66cde366e7c86b513ed59d8c6.1920x1080.jpg?t=1540560150,https://cdn.akamai.steamstatic.com/steam/apps/795640/ss_b865b52843a13c91b438a0e63bf1dca9e503e068.1920x1080.jpg?t=1540560150,https://cdn.akamai.steamstatic.com/steam/apps/795640/ss_78c6f2ec4322b1ebbd49b4ea4f1f38c4990eb3f2.1920x1080.jpg?t=1540560150,https://cdn.akamai.steamstatic.com/steam/apps/795640/ss_5a824618170a81a66aae5b08715fe2522a20f9c4.1920x1080.jpg?t=1540560150,https://cdn.akamai.steamstatic.com/steam/apps/795640/ss_d3504fc1fe0421ad948ecb5c2aa4b24d3a5af82b.1920x1080.jpg?t=1540560150,https://cdn.akamai.steamstatic.com/steam/apps/795640/ss_5e8d67bd6b07eaa90afd9005f4f71424e42b8282.1920x1080.jpg?t=1540560150",
    "Slug": "vindicta-arcade",
    "Meta Title": "VINDICTA Arcade: Oct 26, 2018, Game Cooks and Full Overview",
    "Meta Description": "Looking for information on VINDICTA Arcade? Check out the release date (Oct 26, 2018), developer insights from Game Cooks, and a complete game summary.",
    "Alt Text Image": "Official header image for VINDICTA Arcade game - Steam 795640",
    "Canonical URL": "https://gusku.site/game/vindicta-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VINDICTA Arcade\", \"description\": \"Looking for information on VINDICTA Arcade? Check out the release date (Oct 26, 2018), developer insights from Game Cooks, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 26, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game Cooks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game Cooks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/795640/header.jpg?t=1540560150\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}