{
    "AppID": 1282930,
    "Name": "Volta-X",
    "Release date": "Aug 12, 2020",
    "About the game": "Command the Pilots of a Gigantic Mech! Volta-X is a fast-paced real-time robot battling strategy game where you control the crew members who pilot a giant mech called a Volta in high-stakes 1 on 1 competition. Juggle targeting attacks at specific parts of your opponent’s Volta, dodging, powering up attacks, and repairing your Volta – all in the heat of combat! Teams that can both plan a successful loadout and then execute their attacks and defenses in the heat of battle will come out victorious! Deep Strategy In and Out of Battle As you fight through the Online Story mode, PVP battles and Offline Roguelike Metaverse mode, you will gain access to a total of 8 Voltas, over 10 pilots, and over 40 weapons. With thousands of potential loadouts at your disposal, you’ll be able to find your own unique paths to victory. Your Crew Take the Lead Managing your crew to make them move within the Volta to send out attacks, dodge, heal, repair damage, and put out fires is an essential part of every Volta battle. Each crew member will also gain access to special abilities and enhanced stats though unlocking new sections of their ability tree. Key Features: Full single-player story mode campaign: Discover your history and save the world from intergalactic threats as you recruit new pilots, unlock access to new weapons, fight exciting enemies, and build friendships with your teammates and rivals. Offline rogue-like mode: Try your luck against the evolving Metaverse mode, where you must defeat the ultimate evil... or at least unlock new weapons and power-ups to give you options for your next run. Manage your team’s base: Build a special headquarters for your crew where they can build and upgrade your gear, sleep, eat, relax, and hang out. Crew Side Stories: Each crew member has their own backstory to explore. Learn more about the Volta pilots on your team! Clans &amp; PVP: Join a clan together with your friends to share strategies and components for upgrading weapons. Challenge your clanmates to a battle – or try out playing against players from around the world! Show Your Personality: Send out emotes in battle to celebrate your victories and taunt your enemies, earn new costumes for your crew members, and add hard-fought-for emblems next to your name! Special Events: Keep an eye out for special events! They have specific loadout restrictions to provide a new strategic challenge and exciting rewards such as new crew skins. Battle Replays: Rewatch your battles from yours and your opponents’ perspectives to assess what happened in your last match and learn new strategies and techniques for the battles to come!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1282930/header.jpg?t=1651010234",
    "Price": 19.99,
    "Developers": "GungHo Online Entertainment America, Inc.",
    "Publishers": "GungHo Online Entertainment America, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1282930/ss_e7219d70dd58b344ed3e0ec234a9b0cc6897ce6d.1920x1080.jpg?t=1651010234,https://cdn.akamai.steamstatic.com/steam/apps/1282930/ss_1d79392e2fb01daf97d0102252391804a5efc031.1920x1080.jpg?t=1651010234,https://cdn.akamai.steamstatic.com/steam/apps/1282930/ss_6e41cf5217b6aeca7e91a40c468fe969849be65f.1920x1080.jpg?t=1651010234,https://cdn.akamai.steamstatic.com/steam/apps/1282930/ss_8c4f3e2444fdd1024f6732f27b049574cfcebdf0.1920x1080.jpg?t=1651010234,https://cdn.akamai.steamstatic.com/steam/apps/1282930/ss_3b5a8864121620204d0d3aafb680a704dccd4cd1.1920x1080.jpg?t=1651010234,https://cdn.akamai.steamstatic.com/steam/apps/1282930/ss_998b4de71baf0be85f365ff95a3e20c8534bc3de.1920x1080.jpg?t=1651010234",
    "Slug": "volta-x",
    "Meta Title": "Volta-X: Aug 12, 2020, GungHo Online Entertainment Americ...",
    "Meta Description": "Looking for information on Volta-X? Check out the release date (Aug 12, 2020), developer insights from GungHo Online Entertainment America, Inc., and a ...",
    "Alt Text Image": "Official header image for Volta-X game - Steam 1282930",
    "Canonical URL": "https://gusku.site/game/volta-x",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Volta-X\", \"description\": \"Looking for information on Volta-X? Check out the release date (Aug 12, 2020), developer insights from GungHo Online Entertainment America, Inc., and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"GungHo Online Entertainment America, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GungHo Online Entertainment America, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1282930/header.jpg?t=1651010234\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}