{
    "AppID": 763890,
    "Name": "Wildermyth",
    "Release date": "Jun 15, 2021",
    "About the game": "Wildermyth is a character-driven, procedurally-generated tactical RPG. Like the best tabletop roleplaying experiences, Wildermyth gives you choices and answers your every decision with consequences that drive your characters forward. Lead a band of heroes as they grow from reluctant farmers into unique, legendary fighters. Combat unexpected threats and strange monsters across interactive battlefields. Unravel mysteries and share pensive moments in an ever-new fantasy setting that blends hard truths and sacrifice with humor and personal storytelling. Where does your myth lead? Come help us uncover it! Reminiscent of tabletop roleplaying, unique heroes are born in unique settings every game. They age, transform, fall in love, disagree, and make harrowing sacrifices. Each hero brings their own organic history and personality with them, but your choices and combat skills are what decide their paths and outcomes. All heroes die someday… but you get to hold on to your favorites. Reintroduce them in the next adventure, and over many lifetimes the myths you make will form your own legendary pantheon. An Imaginative Papercraft World The Yondering Lands, where the game is set, is a richly layered world populated with hand-painted 2D characters and scenery. We’ve paid loving attention to breaking molds and exploring new ideas: no orcs, elves, or goblins here—but watch out for the telepathic insect-dragons and the clockwork undead. Extreme Character Depth Each of your heroes has their own unique generated history, personality, and appearance, and will form relationships with your other heroes. All of these elements change and develop over the course of a playthrough, as characters age, encounter mysteries, and overcome challenges. Choices That Matter Your hero may choose to trust the enigmatic wolf god, leading to a hair-raising change in their appearance and combat abilities. Or they may pursue a romance with a fellow hero, giving each of them a shared buff and more story opportunities. Encounters and events have permanent, character-defining effects, letting you craft the arc of each character. A New Approach to Death Did your favorite character get one-shotted by a tentacled horror-bear? Choose to let a hero 'fall back' with a maiming that will lead to some transformative new paths in their legend, or let them go out in a blaze of glory to be remembered for generations to come. Deep and Creative Tactical Combat Combat in Wildermyth emphasizes teamwork and careful positioning, as well as imaginative use of your evolving capabilities and surroundings. Walling and Flanking mechanics provide clear but conflicting incentives, while mystical interfusion lets you remake the battlefield with explosive magic. Multiple difficulty levels mean you can get as intense as you want to. Cooperative Multiplayer In a multiplayer game, you and your friends can each customize and control your own heroes as you play through a campaign. Recommended for up to five players—though in a typical campaign, you start with three heroes and pick up the fourth and fifth along the way. We also support Steam Remote Play. Endless Replayability Pick and choose from a huge bank of combat abilities as your heroes level up in each playthrough, and decide whether you prefer offensive or defensive tactics, brute strength, stealth, or magically flinging fire from a nearby lamp into your enemies' faces. Procedural generation gives you new heroes, new enemies, new story events, and new maps every time you play. A Custom Pantheon of Legends You’ll have the freedom to customize hero appearances, names, histories, and more. As time passes, heroes grow old and may retire, or else might fall in combat—and yes, some will survive all the way to the end. You can add your favorite heroes to a roster of legends and call on them again in later playthroughs. Build your own mythologies and share the awe-inspiring might of your heroes with others.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/763890/header.jpg?t=1649344695",
    "Price": 24.99,
    "Developers": "Worldwalker Games LLC",
    "Publishers": "Worldwalker Games LLC,WhisperGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_3a550445bd69fcd8df3b57227ddac57502407fad.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_f5a6c358f0ce9366cd5372c2049fda4370085ede.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_13cb73afe38d7d0961360cc7ffe646fec2ab176b.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_b717225f5e9a43e98b885c12b448f0c94f7e6374.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_d61392e1b74ec8c7a2d0d7515c2dc3f236961808.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_42cd194e73bcf9653af5c78aa4f5577c013dc8e0.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_53f4116a77a7bd57778769897c535b1747b9e6a6.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_e81e1512acd50b1e912b44698646b82269982968.1920x1080.jpg?t=1649344695,https://cdn.akamai.steamstatic.com/steam/apps/763890/ss_45986d9ef604ea2977d0f2d11d25e7f0d391a4b1.1920x1080.jpg?t=1649344695",
    "Slug": "wildermyth",
    "Meta Title": "Wildermyth: Jun 15, 2021, Worldwalker Games LLC and Full ...",
    "Meta Description": "Looking for information on Wildermyth? Check out the release date (Jun 15, 2021), developer insights from Worldwalker Games LLC, and a complete game sum...",
    "Alt Text Image": "Official header image for Wildermyth game - Steam 763890",
    "Canonical URL": "https://gusku.site/game/wildermyth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wildermyth\", \"description\": \"Looking for information on Wildermyth? Check out the release date (Jun 15, 2021), developer insights from Worldwalker Games LLC, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Worldwalker Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Worldwalker Games LLC,WhisperGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/763890/header.jpg?t=1649344695\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}