{
    "AppID": 312560,
    "Name": "Xanadu Next",
    "Release date": "Nov 3, 2016",
    "About the game": "Whenever mist hangs over the waters of Lake Orwell on Harlech Island, sailors catch sight of a phantom castle just out of reach. As they draw near, it fades into the fog like a mirage, leaving only questions for all who have borne witness to this “Castle Strangerock.” An up-and-coming scholar named Charlotte L. Wells has had her interest piqued by this local legend and desperately wishes to study it in person—but of course, Harlech Island is no place for an unescorted young lady. To aid her in her investigation, therefore, she enlists the help of an old childhood friend and fallen knight who agrees to accompany her on this adventure. Arriving in Harlech and catching sight of Castle Strangerock almost immediately, Char dives into researching the mystery head-on, leaving her companion to explore the surrounding environs on his own in search of any artifacts that might help trace the origins of this ephemeral stronghold. Sadly, this almost immediately leads to his death at the hands of a mysterious swordsman seemingly displaced in time...but death is to be only the beginning of his adventure. Xanadu Next is an exploration-centric action RPG from Nihon Falcom, the acclaimed creators of the Ys and The Legend of Heroes RPG franchises. A late entry in their immensely popular Dragon Slayer series and a spiritual follow-up to the late ‘80s cult classic Faxanadu , Xanadu Next puts players in the shoes of a gravely injured knight given a new lease on life through ancient magic who must now seek a legendary sword called “Dragon Slayer” to ensure his survival. Players will fight hordes of monsters in real time while exploring the lush, mysterious and perilous environments of Harlech Island, along with the ruins of an ancient paradise known as Xanadu that was partially inspired by tales of the Mongolian emperor Kublai Khan. Along the way, players will uncover bits and pieces of Xanadu’s past in the form of ancient stone tablets and memorandums, piecing together a complex tale of magic, war, an ancient dragon, and a mysterious figure known only as the “Black Bride.” Features An Interconnected World Full of Secrets Icy peaks connect with fiery caverns, old waterways, mystical forests and magical ruins, creating one single giant map to explore with countless secret passageways, alternate routes, shortcuts, hidden items, deadly bosses and new techniques to uncover. Real-Time Combat with Dozens of Unique Abilities Fight ruthless enemies in real time, using a wide variety of skills to aid you. As in Ys SEVEN , skills are attached to weapons and can be learned through repeated use of those weapons, adding an element of excitement and promise to every new armament found. Exploration Rewarded with Rich Backstory Stone tablets and old letters are scattered throughout the ruins on Harlech Island, each written in an ancient tongue. Fortunately, your companion is an accomplished scholar who can translate them for you in real time, providing valuable insight into important events and mythologies from the age of Xanadu. Unique Gameplay Systems that Keep the Experience Fresh Players can choose to level-down in order to tweak their stats, fuse themselves with “Guardians” to gain new passive abilities, learn spells, and even carve keys from monster bones to lessen demand for pre-made keys and keep their prices low. Atmospheric Visuals and Music in Classic Falcom Tradition Inspired by hardcore dungeon RPGs of the '80s and created to celebrate the 20th anniversary of Xanadu , one of Japan's action RPG forefathers, Xanadu Next mimics the gritty, medieval look of its ancestor, but in full 3D and with ample amounts of subtle detailing, as well as a foreboding and wholly unique soundtrack composed by Falcom's venerable Sound Team jdk.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/312560/header.jpg?t=1624575934",
    "Price": 14.99,
    "Developers": "Nihon Falcom",
    "Publishers": "XSEED Games,Marvelous USA, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_e4c1aca8e8d029f1c1ab1694c0e1fae435fb7c55.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_91f6f84a3740b89753cd57f05d1a366fe90d517f.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_f02b02ce142132e0cef4bad64c0426ca97c343cb.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_85c957a855e4e1658fcbb6f525dc86aaaebf3de9.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_7acad5fdd7679bc51b55a6ce9e6e557a4cdf6fbd.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_c811368864819c37f1961795781904ffcf167fd3.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_580dd800ca7bccc3bd27dc9a9c9c2ae09bac3a64.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_09253d727bc0b1d04157d3786f75e517c3fe9c99.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_3719bd062eb86888d7e31c4dc7074e054dc0e38e.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_1a8cfeddee7729c04874909809f2456793351d7d.1920x1080.jpg?t=1624575934,https://cdn.akamai.steamstatic.com/steam/apps/312560/ss_26376bec8691055031d7cc093746652ed7771be4.1920x1080.jpg?t=1624575934",
    "Slug": "xanadu-next",
    "Meta Title": "Xanadu Next: Nov 3, 2016, Nihon Falcom and Full Overview",
    "Meta Description": "Looking for information on Xanadu Next? Check out the release date (Nov 3, 2016), developer insights from Nihon Falcom, and a complete game summary.",
    "Alt Text Image": "Official header image for Xanadu Next game - Steam 312560",
    "Canonical URL": "https://gusku.site/game/xanadu-next",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Xanadu Next\", \"description\": \"Looking for information on Xanadu Next? Check out the release date (Nov 3, 2016), developer insights from Nihon Falcom, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 3, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nihon Falcom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XSEED Games,Marvelous USA, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/312560/header.jpg?t=1624575934\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}