{
    "AppID": 639650,
    "Name": "1982",
    "Release date": "Jun 28, 2017",
    "About the game": "1982 is a FREE retro inspired blasta-thon that will test your gaming skills to the max. The game was created using AppGameKit an easy, quick and powerful game development tool. / 1982 GAME MODES Arcade - battle through 50 progressively difficult levels against some familiar early 80's home computer and arcade enemies. Survivor - how many points can you score with only one life? Time Attack - score as many points as you can in 3 mins. Unlimited energy, but each hit reduces your score multiplier POWER-UPS - Kill, Catch or Collect Each power-up has 2 uses, one when collected by the players ship and the other when shot and destroyed. If you catch a power-up before it hits the ground then it's effect is increased. (ie. More energy is regained or lasers, rockets or shield last longer.) A successful catch is indicated by a heart. Kill, Catch or Collect? The 4 types and uses are as follows: 1. Energy Power-ups (green) Kill - creates a large explosion Catch or Collect - restore player energy 2. Laser Power-ups (red) Kill - deploys a temporary horizontally firing laser turret Catch or Collect - grants the player a temporary weapon increase 3. Rockets Power-ups (purple) Kill - deploys a temporary rotating rocket launching turret Catch or Collect - grants player a temporary rocket power-up 4. Shield Power-ups (cyan) Kill - creates a temporary portal that destroys all enemy bullets Catch or Collect - grants the player a temporary shield protecting against all impacts SCORING General Each enemy kill is worth 1 pt x score multiplier. The Score Multiplier is increased by filling the kill gauge on the left of the screen. To do this string a lot of kills together quickly. Failing to kill anything causes the gauge to drop. Abductions...of Man &amp; Multipliers When a certain number of enemies reach the ground a Man will be abducted by a yellow saucer. As well as abducting Man the saucer takes x3 from your multiplier. Kill the saucer and allow Man to fall safely to the ground and your x3 multiplier is returned. The number of enemies reaching the ground needed to trigger an abduction reduces as your multiplier increases. High multipliers are hard to defend. Coins Many in game actions such as killing certain enemies trigger a coin drop. Pick up the coins for extra points (5pts x multi), catch them for a further bonus (10pts x multi). Caught coins are indicated by a heart. Bonuses Complete any of these in game actions to trigger a bonus coin drop... Arcadia - Survive a level Astro Blaster - get a new high multiplier for your current game Major Havoc - trigger 2 Astro Blasters within 5 secs Missile Command - have 2 remote missile launchers active at the same time Laser Zone - have 2 remote lasers active at the same time Bomberman - kill lots of enemies in an energy power-up explosion Defender - stop any enemy reaching the ground for 30 secs Repulsar - Ram an enemy with your shields 2084 - rescue Man from the saucers 3 times in a row If you like 1982 then checkout this other game made by Binary Zoo: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/639650/header.jpg?t=1560444918",
    "Price": 0.0,
    "Developers": "Binary Zoo",
    "Publishers": NaN,
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_b7cabfeb84c02d27e655cf320499f4b6ba5d6dd1.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_da0f2a34e774c08053f28fb46caaa685da696765.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_f5185780d1b51459560a5a6b44e8df0f87bd2d65.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_abfc129de46821d8c7abecd7b87e22f4706c999e.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_6ef2146ac1f723404f2f1116c3e8cbecc4af8836.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_2f7dfef7f0878aa6d2c85754576c8553caa91bbf.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_ac1258a98b27f24b35094cab4a5bcc034f6696f3.1920x1080.jpg?t=1560444918,https://cdn.akamai.steamstatic.com/steam/apps/639650/ss_7ccaf85e1a7be12fec44ceb9a4992fad654abef3.1920x1080.jpg?t=1560444918",
    "Slug": "1982",
    "Meta Title": "1982: Jun 28, 2017, Binary Zoo and Full Overview",
    "Meta Description": "Looking for information on 1982? Check out the release date (Jun 28, 2017), developer insights from Binary Zoo, and a complete game summary.",
    "Alt Text Image": "Official header image for 1982 game - Steam 639650",
    "Canonical URL": "https://gusku.site/game/1982",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"1982\", \"description\": \"Looking for information on 1982? Check out the release date (Jun 28, 2017), developer insights from Binary Zoo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Binary Zoo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": NaN}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/639650/header.jpg?t=1560444918\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}