{
    "AppID": 715490,
    "Name": "Above: The Fallen",
    "Release date": "Sep 18, 2017",
    "About the game": "Above: The Fallen is a 2D side-scrolling, puzzle - platformer game that is centered around travelling upwards instead of to the left or right. The goal is to climb the trees of an ancient and mystical forest in order to break through the canopy. You must manipulate two main characters at the same time throughout the game, solve puzzles, and avoid the hazards of this dark forest. Mankind has been driven from their homes among the trees by the Night King, a nightmarish beast whose origin has been lost to time. Now, man lives in the dirt, fearing the moments the Night King leaves his roost to prey upon their vulnerable forms. Every generation the elders send a young couple out into the world to find a new home for their people where they need not fear the relentless hunger of the Night King. Every generation these journeys have failed. This time however, the young couple has decided to ascend into the trees and reclaim their ancestral home instead of fleeing into the darkness. Can they rise above? Controlling 2 Characters with 1 GamePad In Above: The Fallen, you play as both the male and female characters at the same time (Single Player Mode Only). They often find themselves in situations that require them to work together to solve puzzles and progress up to the canopy. Each character is controlled with one half of the Gamepad. This offers an additional challenge and requires you to think about each character's positioning before moving. If you don't get the hang of it right away, don't worry, it won't be long before you're climbing through the jungle like Tarzan. Single Player or Co-op mode! Bring a friend along with you as you adventure through the world, solve puzzles and work together to defeat the Night King. Swap back and forth easily from single player to co-op with a push of a button. Vertical Scrolling / Climbing Climbing is essential to the goal of reaching the forest's canopy. This differs from traditional side-scrollers where you generally move in a straight line throughout the world. Puzzles There are many interesting puzzles that you'll come across as you play. Some puzzles are solvable in multiple ways which allows for some freedom to explore. Each successfully completed puzzle brings you closer to facing the Night King! Skills As you progress through the world you'll come across shrines that when activated, interact with your amulet, and unlock ancient magic hidden away from humanity. The character's will then receive a new skill which will be needed to complete upcoming puzzles. Enemies There are many animals to watch out for while exploring the forest. Use caution while approaching them though, they don't like being disturbed.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/715490/header.jpg?t=1577205738",
    "Price": 0.0,
    "Developers": "Team Above",
    "Publishers": "Light Loop Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_8b84ca134eb7b1b9fd14d9e15add68be4261e67b.1920x1080.jpg?t=1577205738,https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_387b56ee33645cbe753a7d8dddac9924a2ac6718.1920x1080.jpg?t=1577205738,https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_867dbaed8560ff3ae7816ceeee5cd69f65ea13c2.1920x1080.jpg?t=1577205738,https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_67bed02d6ea3a6ffc760b38ab76fb88bd207f92e.1920x1080.jpg?t=1577205738,https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_d7363e5330fa0a3d3ea1898a33f1a541dcfe52bf.1920x1080.jpg?t=1577205738,https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_43686afa783436319b3357600138936a11234f27.1920x1080.jpg?t=1577205738,https://cdn.akamai.steamstatic.com/steam/apps/715490/ss_6a9d167e526efbe996aeed9a2656dbb94c938545.1920x1080.jpg?t=1577205738",
    "Slug": "above-the-fallen",
    "Meta Title": "Above: The Fallen: Sep 18, 2017, Team Above and Full Over...",
    "Meta Description": "Looking for information on Above: The Fallen? Check out the release date (Sep 18, 2017), developer insights from Team Above, and a complete game summary.",
    "Alt Text Image": "Official header image for Above: The Fallen game - Steam 715490",
    "Canonical URL": "https://gusku.site/game/above-the-fallen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Above: The Fallen\", \"description\": \"Looking for information on Above: The Fallen? Check out the release date (Sep 18, 2017), developer insights from Team Above, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Above\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Light Loop Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/715490/header.jpg?t=1577205738\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}