{
    "AppID": 1523170,
    "Name": "Aladdin : Save The Princess",
    "Release date": "Feb 22, 2022",
    "About the game": "Come and save the princess in this game with exciting new levels! Following are the challenges you will face in the game. 01. Flying Carpet The Carpet is stolen by Haroud and he gets away by making his ship fly using Carpet. He intends to take over the Palace using the carpet. Aladdin must set out to get Carpet back, but he must face the traps planted by Haroud on his way. 02. Abu - The Monkey After being caught while trying to steal gold dust from the treasure room, Abu is captured in a cage and left in palace, full of security. It is upto Aladdin to save the monkey's life by facing all the challenges. 03. Magic Ball Amin Damoola has turned the Sultan into a small gold statue and hid it somewhere in the Castle. Aladdin must now find the Magic Ball, which can be used to walk through walls, to save the Sultan. 04. Find the Lamp The magic mirror, has turned Abu into a rat and Iago into a lizard. Now Aladdin must find the lamp, so they can get Genie to reverse the curse. But its not an easy task for Aladdin. 05. Treasure Chest Iago finds a treasure chest. In it, there are four gemstones, that could make or break the future of Agrabah. Aladdin must make strenuous efforts to grasp the treasure and save it from going into wrong hands. 06. Miracle Ring A large section of Agrabah collapses into the caverns below, and the residents believe the legendary Unkhbut, a giant spider-like creature, to be responsible. It's up to Aladdin to take charge and get the Miracle Ring to capture the creature. 07. The Cure After finding that a treasure called golden silk is being protected by a giant worm, Nefir poisons Abu and tricks Aladdin into helping him, with the promise that a small a mount of the golden silk can cure Abu. Aladdin must hurry! 08. Liberate Genie Genie is imprisoned in the Crystal of Ix, which drains Genie's powers. All except Aladdin are defeated in breaking the curse, Aladdin must naturally go on arduous journey to liberate Genie. 09. Iago - The Parrot Iago served as Jafar's henchman during his attempt to rule Agrabah. Iago's primary obsessions are riches and fame, and his villainous deeds ended up him being caged by Jafar. Now, Aladdin must free the Parrot, and in return he'll open up all of Jafar's Secrets. 10. Friends at Stake Jafar has captured Genie, Abu and the Sultan, and locked them all in the dungeon. Aladdin must fight all the challenges ahead to save them. Now, the fate lies in Aladdin's hands. 11. Jafar - The Evil Agrabah is now under Jafar's control, he wants to transport all the men to Netherworld, and plan to make them permanent residents. It is necessary for Aladdin to stop Jafar by destroying his Magic Wand, which is the only way to kill him. 12. Princess Jasmine Aladdin's love for Jasmine is upto the ultimate test. Jasmine is trapped and she's under a spell, Aladdin must stop at nothing to save Jasmine and be with her forever. Control the game with mouse click to move the character and leave the click to stop.Avoid obstacles and complete the levels. Luckily Princess's friend has found you for this job. Good Luck! Let God be with you! Features: Beautiful graphics Smooth Control Voice instructions Meaningful Levels",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1523170/header.jpg?t=1645691651",
    "Price": 0.99,
    "Developers": "Enaayah Software Development and Services Private Limited",
    "Publishers": "Enaayah Software Development and Services Private Limited",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1523170/ss_64eed9ec8d1c3810886471f2cfc4682d9c010d3d.1920x1080.jpg?t=1645691651,https://cdn.akamai.steamstatic.com/steam/apps/1523170/ss_09dbfa8683ed99d2016b0c5188c2dcea989fd997.1920x1080.jpg?t=1645691651,https://cdn.akamai.steamstatic.com/steam/apps/1523170/ss_4ceab20cf6479de749f77f37b605613d7447ec51.1920x1080.jpg?t=1645691651,https://cdn.akamai.steamstatic.com/steam/apps/1523170/ss_ada01016d6f673517abdfe420c13fbe1d840b96d.1920x1080.jpg?t=1645691651,https://cdn.akamai.steamstatic.com/steam/apps/1523170/ss_f823d2526630500de8cbba876e6615b11747c519.1920x1080.jpg?t=1645691651",
    "Slug": "aladdin-save-the-princess",
    "Meta Title": "Aladdin : Save The Princess: Feb 22, 2022, Enaayah Softwa...",
    "Meta Description": "Looking for information on Aladdin : Save The Princess? Check out the release date (Feb 22, 2022), developer insights from Enaayah Software Development ...",
    "Alt Text Image": "Official header image for Aladdin : Save The Princess game - Steam 1523170",
    "Canonical URL": "https://gusku.site/game/aladdin-save-the-princess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aladdin : Save The Princess\", \"description\": \"Looking for information on Aladdin : Save The Princess? Check out the release date (Feb 22, 2022), developer insights from Enaayah Software Development ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Enaayah Software Development and Services Private Limited\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Enaayah Software Development and Services Private Limited\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1523170/header.jpg?t=1645691651\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}