{
    "AppID": 1410370,
    "Name": "非常魔王(Beelzebub)",
    "Release date": "Sep 18, 2020",
    "About the game": "Do you remember the memories that Bahamut RPG brings to you? A free game made using RPG Make 2003, a new wave of RPG production started 18 years ago, and it also brought players unexpected game recognition. Unexpectedly, personally made games can be enjoyable. After entering the adventure world of Cleary that year, choosing occupations, adopting pets, upgrading the skill series, and pursuing Bahamut, the experience in these games will definitely bring you rich gaming fun! The author of Bahamut RPG 'Wang Wei' has launched a new game called 'Very Demon King'. This is a reverse operation game. You are no longer playing the human hero to defeat the devil, but playing the devil to find a way. Conquer the world. On the way to conquer the world, you will naturally encounter human adventurers and brave men to block your ambitions. How to defeat them and complete the conquest of the world is a test of your game ability. In addition to conquering the world, the Demon King must also resist the adventurers who come to defeat the Demon King. In addition to solving the adventurers yourself, you can also build and expand the Demon King City to resist the invasion of adventurers. If you are unfortunately defeated successfully, Then the world will return to peace (GameOver). This game has injected a lot of effort into the system functions, and hope to bring you a different game experience. Brief description of game features: 1. Devil’s city defense system: Demon’s city can be expanded. When you have a certain reputation, it will attract humans to crusade you, the demon king. At this time, you need to rely on the demon city’s defense area to resist invaders. When the invaders break through to the final throne, you can only go out and fight the invaders to the death. 2. Abundant skill system: most skills have different attack ranges, for example: flame magic attacks a certain range of enemies around the specified target, wind attacks a horizontal range of enemies, combos can attack a single enemy continuously Many times...and more than 50 skills, allowing you to learn different skills according to your interests and abilities. 3. Built-in system: There are more than 50 achievements built in the game, and relevant rewards can be received after each achievement is completed. 4. Time system: The days of conquering are long. With your behavior, the number of days will gradually advance. How to complete the conquest of the world in the shortest number of days is a test of your game ability. 5. Lottery system: There is a lack of resources in the game. The Demon World specially provides a daily lottery function, allowing you to draw a lottery once a day to get random resource rewards. 6. Monster summoning system: To conquer the world and lead a rich army of monsters to fight together, will you be more comfortable. There are as many as 50 monsters in the game for you to drive. 7. Difficulty selection function: At the beginning of the game, you can choose easy, normal, difficult and other difficulty levels. If you are a game master, welcome to challenge the difficulties! 8. Diverse siege methods: When conquering every human village and town, you will encounter different resistances, disintegrate human defenses, step over the corpses of resisters, and complete your mission of conquering the world! Other hidden features and fun are left for you to discover for yourself!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1410370/header.jpg?t=1638953165",
    "Price": 4.99,
    "Developers": "王韋",
    "Publishers": "RMAsia",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_14d8e3c18be05b52b351e403ea7054b084f11e8b.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_9deea0066b7e72dacfe26d0bc467e69e79c9bbfc.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_35ff936e8bacce1f69fe9635348344e26f2e7259.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_a4c44fd5287e78cd4a8ed9e98daaef0654a33d01.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_ea5d25620fab87d74db4aac196702b1c487dda82.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_16078fc111ab472875e88379e8ed9ddcac878db4.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_67fad148090317653118799038a4d7f29d22a579.1920x1080.jpg?t=1638953165,https://cdn.akamai.steamstatic.com/steam/apps/1410370/ss_8ca6518dec2d8fc3ffbf6b8daeb05b9166a7e665.1920x1080.jpg?t=1638953165",
    "Slug": "beelzebub",
    "Meta Title": "非常魔王(Beelzebub): Sep 18, 2020, 王韋 and Full Overview",
    "Meta Description": "Looking for information on 非常魔王(Beelzebub)? Check out the release date (Sep 18, 2020), developer insights from 王韋, and a complete game summary.",
    "Alt Text Image": "Official header image for 非常魔王(Beelzebub) game - Steam 1410370",
    "Canonical URL": "https://gusku.site/game/beelzebub",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u975e\\u5e38\\u9b54\\u738b(Beelzebub)\", \"description\": \"Looking for information on \\u975e\\u5e38\\u9b54\\u738b(Beelzebub)? Check out the release date (Sep 18, 2020), developer insights from \\u738b\\u97cb, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u738b\\u97cb\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RMAsia\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1410370/header.jpg?t=1638953165\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}