{
    "AppID": 1126600,
    "Name": "Before I Forget",
    "Release date": "Jul 16, 2020",
    "About the game": "A woman alone in a house. A mystery and a love story. Explore the present to uncover the past, in a short story of love and loss and a life well-lived. A narrative exploration that examines a world where memories are constantly fading and jumbled. A game about dementia and what happens when you can't hold onto the things you've done or the people you've loved. “Is this the right place?...What did I come out here for?” A plaintive theme on the piano. A tattered 2-year-old calendar. The taste of stale air. A woman is in her house, alone, and her mind holds a mystery... You are Sunita - a woman living with early onset dementia. As you wander from room to room, you discover mysterious objects, each holding a fleeting, fragmented memory. Examine faded postcards, scribbled notes, photographs, and more to uncover Sunita’s past, piece together her life-story, and understand her present. Before I Forget is a story-rich, first-person exploration game from 3-Fold Games. Delicate, moving, and atmospheric, it examines the emotional impact of dementia. Short &amp; Sweet: Before I Forget is a short narrative gem from 3-Fold Games. With an average playtime of 1 hour, it’s designed to be experienced in one sitting. Story Rich: Sunita’s house is a treasure-trove of faded memories. The game-world of Before I Forget is expressive, detailed, and rich with backstory, taking you on a profound emotional journey. Vocal Talent: Featuring a vivid cast of voice actors, breathing life into Sunita and her memories. (Including Anjali Kunapaneni &amp; Bushra Laskar) Original Soundtrack: Elegant piano melodies guide you through Sunita's internal and external worlds, with an all-original score from composer, Dave Tucker. Musical refrains that search and wind like an old memory. “We wanted to have some aspects that indicated Sunita’s Indian heritage apart from her name, and I actually did this piece of art in a little bit of software that came on my Galaxy phone, [...] so this is my homage, my paltry homage - to a really fantastic Indian - female Indian - painter [...] called Amrita Sher-Gil.” Before I Forget comes with a free Developers’ Commentary, which you can activate from the game’s loading screen. As you explore Sunita’s house, listen to thought-provoking interviews with the game devs as they analyse their creative processes, reveal secrets, and much more. 3-Fold Games are a small but mighty micro-studio from game developers Claire Morwood &amp; Chella Ramanan. Dedicated to telling diverse stories from underrepresented perspectives, the creative duo make it their mission to create games which give voice to individuals/groups who are often excluded from game narratives.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1126600/header.jpg?t=1595943497",
    "Price": 7.99,
    "Developers": "3-Fold Games",
    "Publishers": "3-Fold Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_44fe88b27503b688a876c23bcce01f649a7cb9fb.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_7d8d642b9e3dbadc7862cedeba15d1a011a8b68b.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_49b846333c37c5ebc5cce9ad052172602dbadf5e.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_51b8cdb9a07e8d2f373fae30651bf5868eb7ada4.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_f5d3d3a6416592b7824060be273a3bb543f77254.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_1542fe4d2b0d4a32f3c3cdb95e6e8a24c4b736e2.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_5628d5ef14ab31e87c4ea9910725ac9756eaebcc.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_38fdb7f22950176da5e53439b49467bd5afe13f3.1920x1080.jpg?t=1595943497,https://cdn.akamai.steamstatic.com/steam/apps/1126600/ss_a6bdd514377d4d98c537867b473064780b98f7cc.1920x1080.jpg?t=1595943497",
    "Slug": "before-i-forget",
    "Meta Title": "Before I Forget: Jul 16, 2020, 3-Fold Games and Full Over...",
    "Meta Description": "Looking for information on Before I Forget? Check out the release date (Jul 16, 2020), developer insights from 3-Fold Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Before I Forget game - Steam 1126600",
    "Canonical URL": "https://gusku.site/game/before-i-forget",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Before I Forget\", \"description\": \"Looking for information on Before I Forget? Check out the release date (Jul 16, 2020), developer insights from 3-Fold Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"3-Fold Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3-Fold Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1126600/header.jpg?t=1595943497\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}