{
    "AppID": 1746970,
    "Name": "Cat Clicker",
    "Release date": "Nov 24, 2021",
    "About the game": "The Time for Clicking Cats is Nigh! One Cursor. Six Levels. Multiple Cats. 'Cat Clicker really makes you feel like someone who clicks on pixelated stock images of cats' - someone Cat Clicker is an Arcade-ey, On-Rails-Shooter-ey, Stock image-ey game about clicking on cats. Click on the cats before they disappear in order to earn points! but watch out, because if you miss a cat then you'll lose points instead! An Original Soundtrack Cat Clicker features a soundtrack of three unique tracks to help deliver the ultimate cat clicking experience. Slowly lose your mind as you spend 15 minutes on the title screen in order to hear everything the soundtrack has to offer! Six Amazing Levels As you play, spend points on six amazing levels full of interesting background details made out of stock images! With such classic locations as: Grandma's House Cat Cafe Cat Island Purrgatory And More! The Story (it can only be read here) The floating cat head deity that holds command over purrgatory is unfair. it has judged all cats' souls to be neither good nor evil, sentencing them all into purrgatory. Now the realm of purrgatory is full, and the spirits of the cats spill out into our world. You possess the power to judge these souls as good, allowing them to go into cat heaven. Click on as many as you can, and then confront the deity in purrgatory for a final battle. Why does this game even exist? Cat Clicker is a game I blatantly threw together out of stock images and poorly written gamemaker code. I made this game initially in order to see how well a game put on steam for one dollar would sell, and eventually fell in love with the terrible-ness of it at some point in development. I personally think it's fully worth the money, especially if you like weird, terrible, or trashy games. The game can probably be beaten in 15 minutes, so it isn't likely to overstay its welcome or get annoying.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1746970/header.jpg?t=1637778384",
    "Price": 0.99,
    "Developers": "Violet Moon",
    "Publishers": "Violet Moon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1746970/ss_2fb102002f93be19290a5a2d5fb8348d9d571629.1920x1080.jpg?t=1637778384,https://cdn.akamai.steamstatic.com/steam/apps/1746970/ss_4481b79ef63efa4380a095314a4571053a9220fe.1920x1080.jpg?t=1637778384,https://cdn.akamai.steamstatic.com/steam/apps/1746970/ss_fc3b64aa2182ffed57e4400e4e9e25f861654284.1920x1080.jpg?t=1637778384,https://cdn.akamai.steamstatic.com/steam/apps/1746970/ss_3688fdf96cc7853d26a0e8e744ea76c859280622.1920x1080.jpg?t=1637778384,https://cdn.akamai.steamstatic.com/steam/apps/1746970/ss_0f13acbd54658daf1449dd1bf5eca5b25da5a6f0.1920x1080.jpg?t=1637778384",
    "Slug": "cat-clicker",
    "Meta Title": "Cat Clicker: Nov 24, 2021, Violet Moon and Full Overview",
    "Meta Description": "Looking for information on Cat Clicker? Check out the release date (Nov 24, 2021), developer insights from Violet Moon, and a complete game summary.",
    "Alt Text Image": "Official header image for Cat Clicker game - Steam 1746970",
    "Canonical URL": "https://gusku.site/game/cat-clicker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cat Clicker\", \"description\": \"Looking for information on Cat Clicker? Check out the release date (Nov 24, 2021), developer insights from Violet Moon, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Violet Moon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Violet Moon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1746970/header.jpg?t=1637778384\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}