{
    "AppID": 576370,
    "Name": "Cubians VR",
    "Release date": "Feb 16, 2017",
    "About the game": "'CUBIANS VR' is a table defense game with a concept of intense battle of block toys spreading on the table. You can experience a unique world with cute characters and beautiful scenery made with Voxel. Collect unique Cubians, and enjoy the true fun of defense game. The world of CUBIAN is divided into four powers: Empire, Nature, Undead, and Goblin. 1. Empire is made up of well-trained and powerful soldiers. It becomes more powerful when soldiers get in formation. 2. Nature has strong attack skills though, it has weak physical strength, especially vulnerable to fire. 3. Undead does not know fear, and fights with a big number. That individual abilities are excellent. 4. Goblins are small and weak species, but they are strong and powerful when using machines. There are more than 40 different kinds of Cubians. If you win the battle, you can get normal Cubians as well as the powerful boss Cubians, and more! You might have great fun by setting the battle strategies and tactics. How to play : Simple but, profound Player uses only few buttons for an optimized play experience with VR controls. 1. Trigger button - allows you to pick things up and take all the necessary actions. 2. Menu button - to start and stop combat. ※ The Menu Button is located at the top of the Trackpad of the controller Battle preparation My Room - you can prepare for the battle, dispose the Cubians on the battle field and install magic power. 1. Pick up Cubians from the Cubians Showcase on the left and place them on the slot below. Since it may be equipped with up to eight Cubians, let's configure various troops. (Don’t you know where to put Cubians? Do not worry! You may see the sign, once you hold Cubian.) 2. There is a card showcase on the front desk. Pick up the card and place it on the magic book below. 3. Each marble shows stages. After you finish arranging Cubians and magic power, pick up the marble you want and take a closer look at what's inside. If you pull it closer to your eyes, you will be sucked into the world of marble! Battle 1. There are Cubians down below. Pick them up and put them on the table. 2. The miner on the left is working hard to collect red ore. You can pick up Cubians as many ore as indicated below. 3. Turn the controller upside down. Once, your palm facing up! Wow! A real magic book appears! With the other hand, pick up the magic card and place it above the book. After that once you face the table, you will see the area where you may use the magic, and if you release the card, you can cast a powerful magic! (Never throw cards to the table!) Are you ready? Your Cubians are ready for the fight!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/576370/header.jpg?t=1487344275",
    "Price": 9.99,
    "Developers": "IKINA GAMES",
    "Publishers": "IKINA GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_ec00d477725512ba2ea0e1d0c977ae9c74ed66cd.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_06c3b27ef24dcbc2dec7b9bb0b16af1a2c3b2edc.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_0ffe706b50c820f0bd872fb9753b97806fe72632.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_da565543cefae98487077dafbfc7e25c3e78f29f.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_1d59419e3ecdcd5cbe449d390d469e2fe2d7f9b6.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_d63bc62f2a9bfb5bc06fc3406b05f1610bc55886.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_6376bb579f3262d505ba2c2b4d9bb6d9e2563502.1920x1080.jpg?t=1487344275,https://cdn.akamai.steamstatic.com/steam/apps/576370/ss_7af2e7586f62714fdcc8d022a8013967744bdf0f.1920x1080.jpg?t=1487344275",
    "Slug": "cubians-vr",
    "Meta Title": "Cubians VR: Feb 16, 2017, IKINA GAMES and Full Overview",
    "Meta Description": "Looking for information on Cubians VR? Check out the release date (Feb 16, 2017), developer insights from IKINA GAMES, and a complete game summary.",
    "Alt Text Image": "Official header image for Cubians VR game - Steam 576370",
    "Canonical URL": "https://gusku.site/game/cubians-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cubians VR\", \"description\": \"Looking for information on Cubians VR? Check out the release date (Feb 16, 2017), developer insights from IKINA GAMES, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 16, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"IKINA GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"IKINA GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/576370/header.jpg?t=1487344275\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}