{
    "AppID": 679590,
    "Name": "CyberLink ColorDirector 6 Ultra",
    "Release date": "Oct 31, 2017",
    "About the game": "Quickly Fix Color &amp; Light Problems One-click Tone Adjustment NEW If your video goes through several different scenes, or includes shots from multiple angles then ensuring a consistent tone throughout your footage can be an editing nightmare. ColorDirector makes it all ridiculously easy with intelligent one-click tonal adjustment that identifies keyframes in your footage and adjusts video tone accordingly, so that you can get on with more important things. Automatic Noise Reduction NEW Noise Reduction reduces extraneous visible artifacts including luminance (grain) and color noise, that degrade video quality. Effortless Dehazing NEW Create remarkably clear videos by effortlessly removing fog or haze from your shots with the intuitive Dehaze slider. Easily stylize your video Color grading is an essential tool for making impressions, telling stories, and evoking responses from your video viewers. ColorDirector offers creative video-makers of all skill levels, the means to dramatically improve their projects through use of tools to control color and lighting. HDR Video Apply HDR to your videos to add more dynamic range to your scenes, bring out the detail and highlight the best parts of your footage. Split Toning Split toning is an old photography technique that is now a more recent (and very effective) addition to the video editor’s toolkit. Built-in Movie Presets ColorDirector comes with a range of built-in, professionally designed presets that emulate the styles of well-known films. You can also save any manual adjustments you make to a video as a preset and use it again on future projects. Motion Tracking &amp; Selection Masks IMPROVED Intelligent motion tracking algorithm makes frame-by-frame object tracking a breeze. Precision selection tools, now including Bezier Curve, let you select, isolate and track multiple objects through your footage. Color Splash Quickly add drama and focus to your videos by turning them to black and white while retaining selected parts of the clip in color. A great way to draw the viewers eye and create memorable videos. Color Shift Completely change the look of objects in your video with Color Shift. Sliding the Color Wheel lets you remap the colors in your video to give it an entirely different feel. 360º Video Color Grading 360º Video Support IMPROVED With ColorDirector you can import, preview, edit and export 360-degree video footage. Cutting edge technology accurately works with 360º video so that your edits are maintained throughout the entirety of your footage. Round-trip Editing with PowerDirector To cut down on your 360º video editing time. Use PowerDirector to edit your raw video footage, launch ColorDirector directly from PowerDirector’s interface for color grading, then send the footage back to PowerDirector for video rendering and production. Pro-level Performance High Frame Rate Video Support It's now easier to perform professional color grading on your action camera videos with support to import 120/240fps slow motion footage from your iPhone, GoPro or other popular action sports cameras. 64-bit TrueVelocity ColorDirector offers native 64-bit support and the award-winning TrueVelocity editing engine for improved system efficiency and faster loading of HD video footage. Pre-rendering for Better Previews Intelligent pre-rendering technology means that when you preview your work in ColorDirector you won't have to deal with stuttery playback and dropped frames.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/679590/header.jpg?t=1568766562",
    "Price": 0.0,
    "Developers": "CyberLink",
    "Publishers": "Koch Media,CyberLink",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/679590/ss_4c24df9e1cb032d4d6b1fa90f08320a0fcde8193.1920x1080.jpg?t=1568766562,https://cdn.akamai.steamstatic.com/steam/apps/679590/ss_7bb5a9f9587c3e42b6ef53bcb6f83f26111f4075.1920x1080.jpg?t=1568766562,https://cdn.akamai.steamstatic.com/steam/apps/679590/ss_3c3e09be7e2472527029a5c7ab231f23ec4aa68a.1920x1080.jpg?t=1568766562,https://cdn.akamai.steamstatic.com/steam/apps/679590/ss_3aaef59c0053595ebfee7c401968ee3fadc9cbb6.1920x1080.jpg?t=1568766562,https://cdn.akamai.steamstatic.com/steam/apps/679590/ss_8f99dcef9fb872e38524b14c54ce9a67dd8ae3c4.1920x1080.jpg?t=1568766562",
    "Slug": "cyberlink-colordirector-6-ultra",
    "Meta Title": "CyberLink ColorDirector 6 Ultra: Oct 31, 2017, CyberLink ...",
    "Meta Description": "Looking for information on CyberLink ColorDirector 6 Ultra? Check out the release date (Oct 31, 2017), developer insights from CyberLink, and a complete...",
    "Alt Text Image": "Official header image for CyberLink ColorDirector 6 Ultra game - Steam 679590",
    "Canonical URL": "https://gusku.site/game/cyberlink-colordirector-6-ultra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink ColorDirector 6 Ultra\", \"description\": \"Looking for information on CyberLink ColorDirector 6 Ultra? Check out the release date (Oct 31, 2017), developer insights from CyberLink, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Koch Media,CyberLink\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/679590/header.jpg?t=1568766562\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}