{
    "AppID": 654390,
    "Name": "Dialogue: A Writer's Story",
    "Release date": "Sep 20, 2017",
    "About the game": "Dialogue: A Writer's Story is a game about conversations, writing and science. In Dialogue, you play as the writer Lucille Hawthorne, exploring characters and events through a year in her life via mostly ordinary, and occasionally fantastical, conversations. The game consists of various types of conversations with different mechanics. Active conversations occur in real-time, and the effect of Lucille's statements can be modified through her equipped Focus. Exploratory conversations map different subjects spatially, allowing for backtracking and finding new paths, while emails can be arranged and edited. Be inspired alongside Lucille as you help her write her science fantasy novel, learning more about her neighbour Adrian's biochemical research to see her book through to its conclusion! A relaxing and mature narrative game divided into three acts (all released as one game) Different mechanics for different types of conversation: Exploratory, Active and Written Voice Acted, with a relaxing original soundtrack Easy to play: very low barriers to entry and no fail states Difficult to master: Replay and master individual scenes to unlock extra content and new ways to play the game 4-6 hours for a single playthrough, with much more to explore and discover upon replaying. Each equipped Focus is a way to learn more about a character’s preferences, or a new way to approach the conversation Story which focuses on the writing process and the realities of research Unique art style inspired by European cartoons The story in Dialogue is grounded in real life challenges and tensions, telling the story of relatable but interesting characters. Two major themes weave throughout the game. The first is the creative process, both in Lucille's writing of her novel, and other people's reactions to it. The player gains insight into Lucille's struggles and triumphs as she changes characters, creates twists in the story and struggles to find a satisfying conclusion. The second is how real scientific research is carried out and how it is seen by people outside of the research community. Adrian's year is focused on working with his unruly cells, and the player gets to experience the genuine worries and joys of being a researcher.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/654390/header.jpg?t=1561119230",
    "Price": 15.99,
    "Developers": "Tea-Powered Games",
    "Publishers": "Tea-Powered Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/654390/ss_17131ba848c5beb27fde728d1b36fdd0b6f98da0.1920x1080.jpg?t=1561119230,https://cdn.akamai.steamstatic.com/steam/apps/654390/ss_2b71220e8092bc067d8463e1eaf83cd131821d53.1920x1080.jpg?t=1561119230,https://cdn.akamai.steamstatic.com/steam/apps/654390/ss_bd2bf6281f5e35c471c9931279de978c0ef37cfe.1920x1080.jpg?t=1561119230,https://cdn.akamai.steamstatic.com/steam/apps/654390/ss_d260e16297f375743a57266610dab6dda45771ad.1920x1080.jpg?t=1561119230,https://cdn.akamai.steamstatic.com/steam/apps/654390/ss_1f92580008fdf23463c5f006beb661eddee20560.1920x1080.jpg?t=1561119230,https://cdn.akamai.steamstatic.com/steam/apps/654390/ss_4fbf2855429ddd7306c13ae859827383f47d6c7e.1920x1080.jpg?t=1561119230",
    "Slug": "dialogue-a-writer-s-story",
    "Meta Title": "Dialogue: A Writer's Story: Sep 20, 2017, Tea-Powered Gam...",
    "Meta Description": "Looking for information on Dialogue: A Writer's Story? Check out the release date (Sep 20, 2017), developer insights from Tea-Powered Games, and a compl...",
    "Alt Text Image": "Official header image for Dialogue: A Writer's Story game - Steam 654390",
    "Canonical URL": "https://gusku.site/game/dialogue-a-writer-s-story",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dialogue: A Writer's Story\", \"description\": \"Looking for information on Dialogue: A Writer's Story? Check out the release date (Sep 20, 2017), developer insights from Tea-Powered Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tea-Powered Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tea-Powered Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/654390/header.jpg?t=1561119230\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}