{
    "AppID": 1238040,
    "Name": "Dragon Age II: Ultimate Edition",
    "Release date": "Jun 4, 2020",
    "About the game": "You’re Hawke, a refugee seeking to escape the darkspawn-plagued land of Ferelden and become Champion of Kirkwall. Rise to power and fight epic battles while making decisions that determine the course of civilization. Your pursuit of power begins now. How will you seal your place in history? KEY FEATURES Cinematic storytelling — Experience a decade's worth of battles and intrigue thanks to a nonlinear narrative that keeps the action coming. A redesigned dialogue system gives more context to your decisions and helps players create a fully realized, multi-dimensional character. Customize your fight — Dozens of spells and 3 battle companions give players endless options. Stay in the moment with fast-paced combat, or pause the battle and make every move count by issuing individual orders. Make bigger moves — Your actions carry greater weight than ever, and you'll need to think long-term because you have an entire decade to reach your goal. Every dialogue and battle decision affects your standing with party members. Maximizing your friendship opens up even more options. The Ultimate Edition includes: The base game 3 expansions: The Exiled Prince, Legacy and Mark of the Assassin The Black Emporium item shop Blood Dragon Armor set Ser Isaac’s Armor set Dragon Age II Bioware Signature Edition content: Contains premium weapons and armor, including the Adder of Antiva, Seeker’s Bulwark and more Dragon Age II armory bundle: Includes over 20 unique weapons, armor and items All-Class Item Pack: Contains Mage Item Pack, Rogue Item Pack and Warrior Item Pack. All-Class Item Pack II: Contains Mage Item Pack II, Rogue Item Pack II and Warrior Item Pack II High Resolution Texture Pack: Enables higher detail replacements for most textures in the game. Dragon Age II soundtrack The Exiled Prince — Torn by family tragedy, the noble archer Sebastian Vael is thrust back into the religious life he left behind Legacy — Uncover the harsh truth about the Hawke Lineage Mark of the Assassin — Recruit new party member Tallis, a deadly elf assassin with her own unique combat style.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1238040/header.jpg?t=1655211267",
    "Price": 29.99,
    "Developers": "BioWare",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1238040/ss_08f5feb266436f0b100c47d23c6305c9e3d3fa38.1920x1080.jpg?t=1655211267,https://cdn.akamai.steamstatic.com/steam/apps/1238040/ss_2c52bee825d75df0ab211bb47176375aa31ce800.1920x1080.jpg?t=1655211267,https://cdn.akamai.steamstatic.com/steam/apps/1238040/ss_41c7e848fd776244f567d9dc11080a6d05d0b43d.1920x1080.jpg?t=1655211267,https://cdn.akamai.steamstatic.com/steam/apps/1238040/ss_07de634732f41f4e2de7f282afe27d80d326b080.1920x1080.jpg?t=1655211267,https://cdn.akamai.steamstatic.com/steam/apps/1238040/ss_c6a15a19c5df41b2f75469be6bbfb5814b7eec4d.1920x1080.jpg?t=1655211267,https://cdn.akamai.steamstatic.com/steam/apps/1238040/ss_0d93fa192d2901a0e79bdd937ef10bd157bacd72.1920x1080.jpg?t=1655211267",
    "Slug": "dragon-age-ii-ultimate-edition",
    "Meta Title": "Dragon Age II: Ultimate Edition: Jun 4, 2020, BioWare and...",
    "Meta Description": "Looking for information on Dragon Age II: Ultimate Edition? Check out the release date (Jun 4, 2020), developer insights from BioWare, and a complete ga...",
    "Alt Text Image": "Official header image for Dragon Age II: Ultimate Edition game - Steam 1238040",
    "Canonical URL": "https://gusku.site/game/dragon-age-ii-ultimate-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dragon Age II: Ultimate Edition\", \"description\": \"Looking for information on Dragon Age II: Ultimate Edition? Check out the release date (Jun 4, 2020), developer insights from BioWare, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"BioWare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1238040/header.jpg?t=1655211267\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}