{
    "AppID": 1063830,
    "Name": "Dreadborne Drifters",
    "Release date": "Oct 27, 2019",
    "About the game": "You are the drifter, a wandering agent of the inquisition taking rides through void portals wherever threat to the humanity emerges, spreading holy light and wisdom through superior firepower. It won't be easy at first, but you will grow in power, faith and equipment to take on bigger threats to spread influence of the Dreadborne Citadel to protect the remains of humanity. Gameplay Dreadborne Drifters is fast 2d platformer ARPG full of loot, tons of enemies and plenty of opportunities to make your character more powerful. The more you progress in the game, the more lootcentric it becomes as rare items come with unique perks that can create thousands of combinations and possible builds when combined with character talents you gain as you level up your character. Classes You can choose between Enforcer, Dronemancer or Stalker. Enforcer is a tough badass who can groundslam while creating massive impact explosion or can hover midair while launching a devastating rocket barrage. In addition enforcer is the only class who can gain energy shield for enhanced survivability. Dronemancer can control and command multiple drones, throw grenades, and unleash massive death beam. Stalker is cyber ninja-like character. Can detonate enemy corpses, use time hacks and drain souls of his enemies. Environments Every map is randomly generated during short loading. Filled with basic structures and enemies, mini underground dungeons and various environment specific terrain decorations, sometimes tied to minievents to enrich your journey and gain additional rewards. Dont expect anything too complex or complicated as Dreadborne Drifters is designed as run and gun game. Thats why you wont encounter anything that will disrupt your momentum for longer than necessary. Weapon customization Instead of using proceduraly generated weapons(whitch was original intention), i have decided to implement full weapon customization like you might know from bigger games and let players creat the guns they want, instead of having player waiting for very rare item drop. Various accessories can be attached to some of the guns(well, to any gun if you have right reputations and certain ammount of currency) and apply atributes that you lack, or need to run your build with ease.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1063830/header.jpg?t=1572285988",
    "Price": 4.49,
    "Developers": "Tryzna",
    "Publishers": "Tryzna83",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1063830/ss_ce397c514cf51efa272de338e0450bfd83ab6ed0.1920x1080.jpg?t=1572285988,https://cdn.akamai.steamstatic.com/steam/apps/1063830/ss_a0262af824ad1556ed60a66c5b2b84c4147ebea2.1920x1080.jpg?t=1572285988,https://cdn.akamai.steamstatic.com/steam/apps/1063830/ss_cd7fddf2968da25381369d1e6844e7a7491749a0.1920x1080.jpg?t=1572285988,https://cdn.akamai.steamstatic.com/steam/apps/1063830/ss_679e2f473cca2e15f469f933de0ff5f25782c936.1920x1080.jpg?t=1572285988,https://cdn.akamai.steamstatic.com/steam/apps/1063830/ss_54015e75e56f0d2bf9944ecdd7af21a3e4eef961.1920x1080.jpg?t=1572285988,https://cdn.akamai.steamstatic.com/steam/apps/1063830/ss_612c7190217baf19e6ab2a5d98b24f562363f8fd.1920x1080.jpg?t=1572285988",
    "Slug": "dreadborne-drifters",
    "Meta Title": "Dreadborne Drifters: Oct 27, 2019, Tryzna and Full Overview",
    "Meta Description": "Looking for information on Dreadborne Drifters? Check out the release date (Oct 27, 2019), developer insights from Tryzna, and a complete game summary.",
    "Alt Text Image": "Official header image for Dreadborne Drifters game - Steam 1063830",
    "Canonical URL": "https://gusku.site/game/dreadborne-drifters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dreadborne Drifters\", \"description\": \"Looking for information on Dreadborne Drifters? Check out the release date (Oct 27, 2019), developer insights from Tryzna, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tryzna\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tryzna83\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1063830/header.jpg?t=1572285988\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}