{
    "AppID": 98800,
    "Name": "Dungeons of Dredmor",
    "Release date": "Jul 13, 2011",
    "About the game": "Long ago, the Dark Lord Dredmor was bound in the darkest dungeons beneath the earth by great and mighty heroes. Centuries later, the magical bonds that hold him in place are loosening and his power grows ever stronger. The land cries out for a new hero, a powerful warrior or a mystic wizard like those spoken of in the prophecies of yore. What they have, unfortunately, is you... Step into the Dungeons of Dredmor! Embrace your destiny! Face evil of the likes the world has never known - the terrifying Swarmies, the undulating Thrusties, and the adoreable nest-building Diggles. Worship Inconsequentia, the Goddess of Pointless Sidequests, or try your luck as a devotee of the nameless Lutefisk God. Cast powerful magic learned from the dark business warlocks of the school of Necronomiconomics, or summon the Viking Runes of your ancestors to blast your foes with thunder and lightning! Discover the power that can be had by wielding a bizarre armament of devastating weaponry such as the Interdimensional Axe, the Plastic Ring, and the Invisible Shield (if you can remember where you left it). Wield shoes decorated by the Dwarven Glittersmiths, all of whom have now committed suicide because of their shame, and embrace the joys of destroying giant moustache-wielding brick demons with a mace decorated with tawdry, delicious bacon. While you’re at it, be prepared to die. A lot. In hideous, screaming pain that makes you throw your keyboard out the window. The Dungeons of Dredmor await. Are you ready for them? Key features: Classic Roguelike gameplay with the sweet, refreshing taste of point-and-click interfaces. No longer must you press CTRL-ALT-SHIFT-x to drink a potion. Randomly generated dungeons entice you with the sweet, sweet promises of treasure and … things. Old-school pixel goodness. Face lovingly hand-animated monsters and enjoy the great taste of beautiful, individually rendered items on top of a sea of gorgeous, potent tile-work. Wield the awesome power of the Anvil of Krong, lest it wield you! Incredibly complicated crafting system! Wield relics of the Great Elven/Dwarven conflict; grind down ingots to make powdered aluminum and shove it directly up your nostrils! Hordes of monsters never-before-seen in a video game! Deploy cunning traps to defeat your foes! Infinite replay value: choose from a selection of mind-boggling skills to create your character. A new gameplay experience awaits every time! Did we mention there’s lutefisk?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/98800/header.jpg?t=1560612990",
    "Price": 4.99,
    "Developers": "Gaslamp Games, Inc.",
    "Publishers": "Gaslamp Games, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_12f7a54ca9b8c749262ff9edeedc8e0e3c7cbd84.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_ac9e3ef1374408e544686e05e3f95b65450cc75e.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_28746fef6b0a112306edfb455fc171e449c18a24.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_d9be6b09534450fc0e80e0a63dc8cc507ff88588.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_a6b9763246de159e6d920b93014a9222c1a8c871.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_cf1956ce8543edb908afd987c26583f2e7e462da.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_e8d7aff35d8bed05f1de66f88f39cf9fe09805a6.1920x1080.jpg?t=1560612990,https://cdn.akamai.steamstatic.com/steam/apps/98800/ss_902a3afd8a088dd19755665acbc28fa9001d28d7.1920x1080.jpg?t=1560612990",
    "Slug": "dungeons-of-dredmor",
    "Meta Title": "Dungeons of Dredmor: Jul 13, 2011, Gaslamp Games, Inc. an...",
    "Meta Description": "Looking for information on Dungeons of Dredmor? Check out the release date (Jul 13, 2011), developer insights from Gaslamp Games, Inc., and a complete g...",
    "Alt Text Image": "Official header image for Dungeons of Dredmor game - Steam 98800",
    "Canonical URL": "https://gusku.site/game/dungeons-of-dredmor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dungeons of Dredmor\", \"description\": \"Looking for information on Dungeons of Dredmor? Check out the release date (Jul 13, 2011), developer insights from Gaslamp Games, Inc., and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2011\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaslamp Games, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaslamp Games, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/98800/header.jpg?t=1560612990\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}