{
    "AppID": 551770,
    "Name": "ECHO",
    "Release date": "Sep 19, 2017",
    "About the game": "ECHO is a Third-Person Science Fiction Adventure. After a century in stasis the girl En arrives at her destination: A Palace out of legend, a marvel of the old civilization eons gone, still awaiting its first human occupants. Out here, using forgotten technologies, she hopes to bring back a life that shouldn’t have been lost. But nothing could prepare her for what she’ll face in the ancient halls below. The experience starts as a character driven journey of discovery, but as it unfolds it evolves into something altogether more punishing. The Palace studies everything you do, everything you are, to use it against you. Gameplay revolves around stealth, action and manipulation, as you face off against the ultimate enemy: Yourself. THE WAY YOU PLAY SHAPES THE GAME In ECHO everything has consequence: As you try to wield its magical technologies it becomes apparent that the Palace has a will of its own… It creates “Echoes” – exact copies of you in every way – that behave like you and only do the things you do. So the way you play the game shapes your enemy. If you sprint, soon the Echoes will get faster. If you sneak, they will get stealthier. If you shoot, they will learn to shoot back. The game constantly reacts to your every choice and input. LEARNING MECHANICS The Palace 'reboots' every so often, resulting in a blackout. This blackout-cycle is the rhythm at which the Echoes get updated with your latest behavior, learning and unlearning from your actions. During the blackout the palace is blind, giving you the freedom to act without consequence. This is the time to run and gun and do all the things you don’t want the Echoes to learn. The experience is one of being up against your own choices from the last blackout-cycle, giving you a way of shaping the game from cycle to cycle. So no matter if you prefer to go stealth or action one thing is certain, you need to keep your wits about you if you want to survive the Palace. RICH STORY AND ATMOSPHERE At the heart of ECHO is the story. The game starts as a narrative experience, focused on En and her journey into the Palace and her past. Who is she and what is her connection to the Palace? Who is this man that she needs to revive, and what was the circumstances surrounding his death? Slowly these things are uncovered as she descends into the dark halls below.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/551770/header.jpg?t=1572895008",
    "Price": 24.99,
    "Developers": "ULTRA ULTRA",
    "Publishers": "ULTRA ULTRA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_de3d7446a0aad4b265adb56d612e04044fc4621c.1920x1080.jpg?t=1572895008,https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_b6a5698100a0af1397456e84d0b571c00d7c1cf9.1920x1080.jpg?t=1572895008,https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_e2837fe246dcff5d23a2e1779ddcc94fe5147275.1920x1080.jpg?t=1572895008,https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_ab417710395708137c81607f995f4c4eb27e7c6c.1920x1080.jpg?t=1572895008,https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_a0713d351f712c79e9bbae62bcfa3b23292904ce.1920x1080.jpg?t=1572895008,https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_5890f26cc17c04efa3b02d00216e74b88ec8dae7.1920x1080.jpg?t=1572895008,https://cdn.akamai.steamstatic.com/steam/apps/551770/ss_9a5b1e891254b72e9e9d80140de5a99d8ca1c0ce.1920x1080.jpg?t=1572895008",
    "Slug": "echo",
    "Meta Title": "ECHO: Sep 19, 2017, ULTRA ULTRA and Full Overview",
    "Meta Description": "Looking for information on ECHO? Check out the release date (Sep 19, 2017), developer insights from ULTRA ULTRA, and a complete game summary.",
    "Alt Text Image": "Official header image for ECHO game - Steam 551770",
    "Canonical URL": "https://gusku.site/game/echo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ECHO\", \"description\": \"Looking for information on ECHO? Check out the release date (Sep 19, 2017), developer insights from ULTRA ULTRA, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ULTRA ULTRA\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ULTRA ULTRA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/551770/header.jpg?t=1572895008\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}