{
    "AppID": 1881390,
    "Name": "Exodus Vigil",
    "Release date": "Jul 14, 2022",
    "About the game": "SPECIAL NOTE: Early Access players outside North America are experiencing game-breaking issues so we do not recommend purchasing this Early Access game at this time (if you are located outside of the USA). We are also working on a Game Controller support issue so we are not recommending a game controller to be used at this time. Please test with Mouse &amp; Keyboard controls. Please continue checking this page for updates regarding these known Early Access issues. Explore the Dark and Dangerous Temples and Tombs of Ancient Egypt in Exodus Vigil. Follow the familiar story of the Israelite Exodus from the Egyptian perspective. Features and Content: All content can be played with up to 4 people via split-screen Supports Playstation and XBox style controllers 10 missions with a variety of puzzles, exploration, and navigating/climbing through both indoor and outdoor locales Cinematics and in-game voice-over storytelling based on the book 'Exodus: God of the Slaves' Missions have 4 unique characters you can swap between and follow you Total 14 different characters, both male and female, to play as 10+ Minigames that follow the Plagues of Egypt Minigame tournament to compete with your friends EXPERIENCE THE ISRAELITE EXODUS FROM AN EGYPTIAN PERSPECTIVE Based on the book, 'Exodus: God of the Slaves' by Kris Murray, a new God comes to Egypt and sends His emissary. Four young Egyptians witness the wonder as disasters befall their homeland. Feel their emotions as war rages across their pantheon. Relive the familiar Exodus story set in the exotic land of ancient Egypt from a fresh new perspective. SOLVE FUN AND CHALLENGING PUZZLES Use your wits and reflexes to discover exciting places, navigate treacherous passages, and escape from temple zealots. Climb to new heights, muscle your way through, sneak passed enemies, blend into the crowd, or draw your blade as a last resort. EXPLORE TEMPLES AND TOMBS The slaves of the pharaohs worked tirelessly to build elaborate pyramids, burial chambers, and grand temples. Find out what lurks behind the next corner of these dark corridors. Can you successfully figure out the secrets to solve the challenges that await? COMPETE WITH OTHERS TO SURVIVE THE PLAGUES OF EGYPT Have fun playing locally with friends and family using split-screen on one system. Attach up to 4 controllers or 3 controllers with a mouse and keyboard to play either cooperatively in the story line missions or competitively in the mini-games. Find out who is best able to survive the disasters that plagued Egypt causing calamity.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1881390/header.jpg?t=1658817743",
    "Price": 19.99,
    "Developers": "BibleByte Games",
    "Publishers": "Kidware Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1881390/ss_2e720273ee70d9efb76af280efd9ded6ab10b382.1920x1080.jpg?t=1658817743,https://cdn.akamai.steamstatic.com/steam/apps/1881390/ss_ee48026be8e535d7e19385806a577aee6701e718.1920x1080.jpg?t=1658817743,https://cdn.akamai.steamstatic.com/steam/apps/1881390/ss_289492266521e3751ec4412a3dd88113b274cd3b.1920x1080.jpg?t=1658817743,https://cdn.akamai.steamstatic.com/steam/apps/1881390/ss_4c9ed58b7709a7c362d55f370e7aa4422626c085.1920x1080.jpg?t=1658817743,https://cdn.akamai.steamstatic.com/steam/apps/1881390/ss_780f29dbe80b64c94daf869d8182b546535def1b.1920x1080.jpg?t=1658817743,https://cdn.akamai.steamstatic.com/steam/apps/1881390/ss_7f0d316a75a4fb61f337637b5f2b96930a9731a3.1920x1080.jpg?t=1658817743",
    "Slug": "exodus-vigil",
    "Meta Title": "Exodus Vigil: Jul 14, 2022, BibleByte Games and Full Over...",
    "Meta Description": "Looking for information on Exodus Vigil? Check out the release date (Jul 14, 2022), developer insights from BibleByte Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Exodus Vigil game - Steam 1881390",
    "Canonical URL": "https://gusku.site/game/exodus-vigil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Exodus Vigil\", \"description\": \"Looking for information on Exodus Vigil? Check out the release date (Jul 14, 2022), developer insights from BibleByte Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"BibleByte Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kidware Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1881390/header.jpg?t=1658817743\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}