{
    "AppID": 674520,
    "Name": "Fight'N Rage",
    "Release date": "Sep 19, 2017",
    "About the game": "Description Fight’N Rage is a brand new old-school side-scroller beat’em up. Inspired by the classics from the “golden age”, and with an art style that mimics the aesthetic from the 90's arcade gems, this game pays homage to all classic gameplay features that makes this genre one of the best from its time! Details Genre: Classic 2D side-scroller beat’em up / brawler. Number of players: From one up to three players local co-op. Available languages: English and Spanish. Features A lot of Combinations: Alternative paths, cutscenes and endings that can change based on the selected characters and your own decisions! Fast and intense single-session gameplay: Each possible route in the arcade mode can be finished in less than one hour! (at least if you have mastered it.) Explosive Combo System: Characters are capable of performing several skillful juggle-based combos that can make your enemies blow up into pieces! Simplified Controls: Using only three buttons (attack, jump and special attack), you will be able to combine lots of movements in order to perform amazing combos! Easy to Play, Hard to Master: Difficulty is not about bad controls or unfair rules… it is about mastering your character’s moves and dealing with tough enemies! Local co-op mode: Up to 3 players with optional friendly fire (which is even more challenging!). Custom Display Modes: Display settings includes optional CRT feels, scanlines and various color styles and more! Lots of Unlockables: Earn in-game coins with your scores and get extra content like character’s costumes, extra difficulty settings, more gameplay speeds, new game modes, new characters to use on these modes and much more! Play as Enemies: More than 20 unlockable characters to play in the extra modes! Training Mode: You can practice a lot of techniques and combos while earning new belts! Are you good enough to get the Black Belt? Different Weapons: Each protagonist handles them in their own way. Speedrun Timer: An exclusive in-game gadget compares current stage times against your best ones! (Of course, the cutscene time does not count, in order to let your fingers take a break… believe me, you will need that.) Fully Skippable Cutscenes: All cutscenes can be skipped or fast-forwarded in order to provide an (even more) intense gameplay. Fair Score Rules: There’s no easy way to increment your score while playing… the score is directly related to your skills. VS Mode: Perfect to play one vs one battles against another player or the CPU, or simply watch CPU vs CPU battles. Parry System: A parry system lets you take the advantage even in the most dangerous situations! Real challenges: It is all about how good you are at the game, not about an “exp” system or other RPG elements that reward your patience. The full moveset of every character is available from the start, so, you do not have to worry about leveling-up anything except your own skills as player! Additional Insane Difficulties: Near impossible extra challenges for pro-gamers (which are not mandatory to unlock all game content). Extremely Polished Gameplay: The playability is focused on fully responsive controls and intuitive commands. The characters can cancel normal attacks into special attacks, release themselves from enemy grabs and perform several chain movements. You will feel the power of controlling a character that perfectly responds to your actions! Story In a far future, Earth was devastated by mutants who took control after a worldwide catastrophic event known as “the big pulse”, a global scale electromagnetic pulse that put an end to all electronic technology on the planet. Humans are now enslaved by mutants led by “The Boss” in a world ruled by “the law of the jungle”. However, not everything is lost… two humans and a mutant rebel are willing to fight in order to stop this madness. Will they be strong enough? Well... that's up to you! Main Characters Gal: A girl who escaped from traders of humans. She’s an expert in her own kick-boxing-derived martial art. While her attacks don’t have a long reach, her speed and agility have no equal and her technique and endurance are pretty good too. She is capable of avoiding almost every attack, an ability that comes in handy when facing multiple foes. Ricardo: A minotaur human-rights activist and a powerful wrestler. He’s not very fast and his technique isn’t as good as his comrades’, but he has a pretty long reach, and his power and endurance are amazing. He’s capable of destroying any enemy in record time! F. Norris: A runaway ninja whose past is a mystery. He’s the one who mastered the ninjutsu style known as “the forbidden technique”. While he might be pretty fragile compared to Gal or Ricardo, he has a great combination of reach, power and speed, plus an amazing technique that (when mastered) can take control of any situation. Credits All the game (graphics, design and programing) was created by Sebastián García, while the full OST (composed of more than 40 great tracks!) was created by Gonzalo Varela.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/674520/header.jpg?t=1600837073",
    "Price": 19.99,
    "Developers": "sebagamesdev",
    "Publishers": "sebagamesdev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_b40a467a0848ba217a3331cbf8ae83da2ce5441d.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_132dbb1f7ee092affd9672dbc375f5011ea3f2c9.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_f68d238e33568c5c8849a2a8406ab64365ea165b.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_bdc13b07f3d1535f2c03f5cc728f83730bbf514c.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_ba9e0f107735dd8c9bff6f63d3969de78d69025b.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_f20b9c48b62bbc3cb4604161a2f8816ffb98c251.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_5c1bca2b4a1fea97692c37fa7a2fb6811cd6fce4.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_638dee1ce2351f3bba37c9e9c22d61142d465e0d.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_39e6dd37eb576beb6fb6afb7498607a0d00cd608.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_69550122a09c68391298c814b9b8f98734228cf7.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_195797f15811b3e5ae4e494244ee20cbf4149430.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_6cb2f77008e10ff955d1ae1ca7135aa3665f2197.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_149863303cc115acab2784791479db75dbef168c.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_4c46a01cb6592b5d10fa062a481e445a205f1c0b.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_4bca0685e149c672c247d1fd2183045c401f01bb.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_d1d1b390e75a78ceeaa0e49580ea53a5677902ed.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_54bbe604b7f774aa080e1cf7a47e3feabbaeadf0.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_2095d020391bf02640c4477e79d0a65fbcf12b3d.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_6ce0c3983e3e63116b44ae21c0bfc2837b7945db.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_5450f097875ce510186b468567002359485ba0cd.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_efcc1f738761cf26229b2c303a2dfdea5121b185.1920x1080.jpg?t=1600837073,https://cdn.akamai.steamstatic.com/steam/apps/674520/ss_ef9b8c2a582d12da8bcb352e8a44bb16ba4461a1.1920x1080.jpg?t=1600837073",
    "Slug": "fight-n-rage",
    "Meta Title": "Fight'N Rage: Sep 19, 2017, sebagamesdev and Full Overview",
    "Meta Description": "Looking for information on Fight'N Rage? Check out the release date (Sep 19, 2017), developer insights from sebagamesdev, and a complete game summary.",
    "Alt Text Image": "Official header image for Fight'N Rage game - Steam 674520",
    "Canonical URL": "https://gusku.site/game/fight-n-rage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fight'N Rage\", \"description\": \"Looking for information on Fight'N Rage? Check out the release date (Sep 19, 2017), developer insights from sebagamesdev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"sebagamesdev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"sebagamesdev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/674520/header.jpg?t=1600837073\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}