{
    "AppID": 1820320,
    "Name": "神徒",
    "Release date": "Jan 21, 2022",
    "About the game": "---------------------------------------------------------------------------------------------------- in the magical Potala world, every yuan spirit can become a God. What kind of God you want to become will be up to you! ---------------------------------------------------------------------------------------------------- In the distant and mysterious oriental civilization, there is a place outside the world. It is at the top of the world and in the snowy plateau. It is Potala. The Potala world is open to everyone and accepts all sentient beings. At the same time, the emissary from the divine world, the esoteric God monk, is also here to select the 'Yuan spirit'! What is the yuan spirit? All sentient beings can be spirit if they are destined to God! If you accept to be a Yuanling, you can reincarnate into the Potala world. Yuanling's life exceeds natural reincarnation and can be reborn. Under the guidance of divine monks, you can complete the mission, fight against the evil emperor and protect Potala. Yuanling's ultimate mission is to grow from a new God in Potala to a new God in Potala, seal the evil emperor and save the world together with many new gods! To be what kind of God is not only a test, but also freedom! Yuan Ling can freely determine the growth of attributes at each level. Many combinations of five elements, four elements and human escape allow you to DIY your own unique skills. Various materials, drives and extensions allow you to freely assemble personalized equipment. You need to do the strongest output or the most meat shield. You can do whatever you want, plus the yuan Ling's unique skills of six yuan realm, Let you really have 72 changes! Some people like PVE, others like PVP. Everyone can adjust. In the Potala world, God is not absolutely invincible. Various controls, seals, States, etc. are combined with dozens of attributes. You can see moves and open moves, match with other players anytime, anywhere in the game, change different equipment and skills, and match at any time. The battle in the arena is a battle between gods, The reward mode accumulated in the prize pool makes you earn a lot in the fun of PVP. It's not a dream to get rich by hard power! At the same time, competitive ladder points, the same row in the world, stand out from the crowd at the top! You can also improve Yuanling proficiency in the process of competition, unlock GV exclusive dance and super Yuanling feature bonus! There is no threshold for the boss of the hunting world. Any yuan spirit can participate in the war. All items such as top mounts, materials and equipment in the Potala world can also be dropped. They can compete fairly and share the benefits of the war. The six yuan realm can stimulate the infinite potential of the yuan spirit, kill and survive, make a powerful blow to turn the tide, and turn the plate in a moment. The terrible realm stunt makes both gods and Demons clean! there are many interesting systems, such as food synthesis, mission, achievement, business, reinforcement, auction, jumping music, etc., to meet the needs of all kinds of life parties and leisure parties. You can be rich in the world, or you can be free and carefree! The above is the first content of Shentu 1.0. Players who buy any version do not need to pay again for the later updated version, and permanently get the right to update the latest content. Your support is the source power of developers! Thanks for playing!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1820320/header.jpg?t=1656723466",
    "Price": 3.99,
    "Developers": "陈世杰",
    "Publishers": "陈世杰",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_78caf66b8dfe1e14df18e4141bfd7ba4dce49518.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_a1fac04ec7eff9d941b2d243a4862f433f22d9c8.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_8dd847fec8f73165f68994978195ef868862060f.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_62f99f26b9ba323e665fb26cd13c54f711dcdbae.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_c53fa9c6e02af847636b2abce251f92444dff78b.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_1629732ff18cf6d05732916133c6fb1687f6db96.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_a4d2c4fd658bc20e24baacb16d7ec00097faeed3.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_087b100540e266a719778f11dc4d47f09ddd16c8.1920x1080.jpg?t=1656723466,https://cdn.akamai.steamstatic.com/steam/apps/1820320/ss_ef44f919ee808368443e367fa2926d4d3c4f7c7b.1920x1080.jpg?t=1656723466",
    "Slug": "",
    "Meta Title": "神徒: Jan 21, 2022, 陈世杰 and Full Overview",
    "Meta Description": "Looking for information on 神徒? Check out the release date (Jan 21, 2022), developer insights from 陈世杰, and a complete game summary.",
    "Alt Text Image": "Official header image for 神徒 game - Steam 1820320",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u795e\\u5f92\", \"description\": \"Looking for information on \\u795e\\u5f92? Check out the release date (Jan 21, 2022), developer insights from \\u9648\\u4e16\\u6770, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u9648\\u4e16\\u6770\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u9648\\u4e16\\u6770\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1820320/header.jpg?t=1656723466\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}