{
    "AppID": 1502180,
    "Name": "Gnomes Garden: Return Of The Queen",
    "Release date": "Apr 20, 2021",
    "About the game": "What could gnomes and harpies have in common? It might seem that there's nothing, but that couldn't be further from the truth. The Harpy Queen and Gnome Queen are old friends. They first met on the Sloping Shores when a gnome ship was wrecked. The Harpy Queen helped the Gnome Queen and the whole crew reach their land and they've been the best of friends since then. They don't see each other often, but regularly write to each other. These are usually friendly letters about fun celebrations in their kingdoms, the first snow, a nephew's birthday or the building of a new city. However, this letter was completely different to the ones before. The messenger that delivered it was scruffy and out of breath and this was something the Gnome Queen found strange. ''What happened?'' the Queen asked. ''Your cloak is torn and your face is scratched up as if you ran through thick thorn bushes.'' ''That's exactly what happened, Your Majesty,'' the messenger replied. ''What for?'' the Queen asked in surprise. ''Caravans and messengers haven't used that road for ages. No one actually uses that road. We have an excellent road going around it.'' ''It would take a lot more time to go around.'' ''What's the hurry?'' ''Well, this isn't just a letter, Your Majesty. I had to deliver it as quickly as possible. There's an important message from the Harpy Queen there.'' The Queen thanked the messenger and sent him to get some rest after his long road and started to read the letter from the Harpy Queen. Here is what she wrote. ''My dear friend! I am asking you for help because I have no one else to rely on. A terrible thing happened in my kingdom. Someone sent a huge tornado against us. I suspect that it was the Sea Overlord, who has been an enemy for a long time. The tornado has already destroyed the houses of the fishermen on the shore and is now quickly blowing towards the city. I know that gnomes have technologies known to no one else. I would be really grateful if you and your subjects help me avert disaster. You're my only hope! Your loyal friend, The Harpy Queen The Gnome Queen immediately ordered for a ship to be prepared to sail to the lands of the Harpies. There's a long and dangerous adventure ahead, but what wouldn't you do for your friend? Accompany the Gnome Queen on a fascinating adventure through an alternative medieval world. The depths of the sea, sandy shores, gloomy troll caves and lots of other exciting things await! Can good triumph? Will the Gnome Queen manage to help the Harpy Queen and come back home? Game features: An unusual magical world where magic uses ancient gardens as its source. - An upbeat plot, colorful comics and memorable characters! - A multitude of varied quests that the princess has never encountered before. - Over 40 unique levels. - Unusual enemies: fierce sharks, giant raccoons, ifrits and... a kraken. - 4 unique locations: the Undersea Kingdom, Magic Monastery, Harpy Kingdom and the Troll Caves. - Useful bonuses: speed up work, stop time, run fast. - Simple controls and clear tutorial. - Over 20 hours of exciting gameplay for any age. - Pleasant themed music.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1502180/header.jpg?t=1618911658",
    "Price": 0.49,
    "Developers": "Toyman",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1502180/ss_853b3ad0de994d76d254bc212edbbe78bafcca99.1920x1080.jpg?t=1618911658,https://cdn.akamai.steamstatic.com/steam/apps/1502180/ss_0906400293c2199df4fdb98cf4736de2eca6800c.1920x1080.jpg?t=1618911658,https://cdn.akamai.steamstatic.com/steam/apps/1502180/ss_8a2759e8d598125b9e1c36a92db2371022f9c83a.1920x1080.jpg?t=1618911658,https://cdn.akamai.steamstatic.com/steam/apps/1502180/ss_536a32a97cb461c1a4056adc98265e825294ca5a.1920x1080.jpg?t=1618911658,https://cdn.akamai.steamstatic.com/steam/apps/1502180/ss_648dd729a776bfd1ad65c95a54a8bb1cd70d1fdf.1920x1080.jpg?t=1618911658",
    "Slug": "gnomes-garden-return-of-the-queen",
    "Meta Title": "Gnomes Garden: Return Of The Queen: Apr 20, 2021, Toyman ...",
    "Meta Description": "Looking for information on Gnomes Garden: Return Of The Queen? Check out the release date (Apr 20, 2021), developer insights from Toyman, and a complete...",
    "Alt Text Image": "Official header image for Gnomes Garden: Return Of The Queen game - Steam 1502180",
    "Canonical URL": "https://gusku.site/game/gnomes-garden-return-of-the-queen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gnomes Garden: Return Of The Queen\", \"description\": \"Looking for information on Gnomes Garden: Return Of The Queen? Check out the release date (Apr 20, 2021), developer insights from Toyman, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toyman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1502180/header.jpg?t=1618911658\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}