{
    "AppID": 1368240,
    "Name": "Isle of the Crown",
    "Release date": "Feb 10, 2021",
    "About the game": "From a simple home to a mighty kingdom; explore, expand, exploit, and exterminate your opponent in this strategic pixel-art chess-like hex game using cards as your pieces and their abilities as your tools. As the saying goes; easy to learn, hard to master.                                                                                                Join Steam Discussions!                                                     - Talk with the Dev!                          - Talk with the community!                          - Share strategies, ideas, and thoughts!                          - Help shape this game's future with input! What to Expect: (EA) - Planned through Early Access Map Variety - Multiple Island maps made to test different strategies and mechanics. - More being added over time to challenge strategies and players' abilities to adapt. (EA) - A map editor! (EA) Card Variety - A large assortment of cards that are used together to form even stronger cards. - More being added over time to fulfill newer strategies and newer mechanics. (EA) Different Modes - Basic: The basic form of the game, where players take turns. - Timed: Similar to the basic mode, but players only have a set amount of time to complete their moves. (EA) - Expert: A mode that brings the game closer to the RTS genre; where cards have cooldowns before use. (EA) - Possibly more modes, or changes to the currently planned modes! (EA) Endless Replayability. - Where the difficulty is based on your opponents' strategies. Up to 4 Players [Local or Remote Play Together] - 4 for All - 1 vs 1 - 2 vs 2 - 'This was a 3 for All, but I just made an alliance, so now it's a 2 v 1'. Monetization Method [EARLY ACCESS] As the game progresses in development, the price will rise; online being the major update that will more than likely double the game's price. But until then, the game will be at its lower price-point, with possibly a middle ground between online and the first build; the price only changing when a significant amount of new features and cards have been added, or if sales take off. If I start selling more though, I'll certainly add far more and do far more than I had initially planned for the beginning- particularly because if that happens, then I can focus completely on game development. And since this is an industry I love, I would happily focus on it. But of course, these price changes and updates will all be announced and broadcasted for everyone to plan ahead to share with friends and whatnot. Steam Remote Play Together                         What is Steam's 'Remote Play Together'?                       Instantly share your Steam local multi-player games with friends over the internet, for free. Using Remote Play Together, one player owns and runs the game, then up to four players — or even more with fast connections — can quickly join in the fun. Credits Music Credits: [All found on OpenGameArt[dot]Org] First Song in Teaser and Battle Song by Matthew Pablo Ireland's Coast (Travelog Edition - LIVE PLAYERS) matthewpablo[dot]com End Song in Teaser, Menu Song, and Victory Song by Random Mind Lament for a Warrior's Soul Medieval: Battle Sound Credits: [Various Sources] Various Sounds from Epic Stock Media epicstockmedia[dot]com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1368240/header.jpg?t=1613336490",
    "Price": 2.99,
    "Developers": "Devious Oatmeal",
    "Publishers": "Devious Oatmeal",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1368240/ss_162210ada6a22339d8ffc7df36f998e33453ac70.1920x1080.jpg?t=1613336490,https://cdn.akamai.steamstatic.com/steam/apps/1368240/ss_91fa7ab464c3ef30ae1e565f3d1da1b72502cf44.1920x1080.jpg?t=1613336490,https://cdn.akamai.steamstatic.com/steam/apps/1368240/ss_99b791cb2b9f16493416f0698f6a1cf1ac8936e5.1920x1080.jpg?t=1613336490,https://cdn.akamai.steamstatic.com/steam/apps/1368240/ss_9fef8ed52aa289b219f79fdd8e7641b4ea1ad7a4.1920x1080.jpg?t=1613336490,https://cdn.akamai.steamstatic.com/steam/apps/1368240/ss_648721f5f5a2d0ac8e402a192ac7ab4ff8f4ce89.1920x1080.jpg?t=1613336490",
    "Slug": "isle-of-the-crown",
    "Meta Title": "Isle of the Crown: Feb 10, 2021, Devious Oatmeal and Full...",
    "Meta Description": "Looking for information on Isle of the Crown? Check out the release date (Feb 10, 2021), developer insights from Devious Oatmeal, and a complete game su...",
    "Alt Text Image": "Official header image for Isle of the Crown game - Steam 1368240",
    "Canonical URL": "https://gusku.site/game/isle-of-the-crown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Isle of the Crown\", \"description\": \"Looking for information on Isle of the Crown? Check out the release date (Feb 10, 2021), developer insights from Devious Oatmeal, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Devious Oatmeal\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Devious Oatmeal\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1368240/header.jpg?t=1613336490\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}