{
    "AppID": 965810,
    "Name": "Kara no Shojo",
    "Release date": "Oct 22, 2018",
    "About the game": "Features - The outcome of the story lies in your hands! In this game, the player him/herself becomes the detective and performs investigation and deduction. The player's choices mark significant changes to the outcome of this story. What did you do, when, and where. The truth is uncovered little by little from the notes of a diary as progress is made - and sometimes, revealing an unwanted secret... - A great variety of characters that draws out the story There are easily over 30 characters with visuals in this work. Each character represents a different idea, and carries their own thoughts and beliefs, crafting a complicated human drama. The stunning plot ties each incident together, one after another, leading to an exhilarating story. Story March, 1956. Tokyo: A metropolis finally starting to recover after Japan's defeat in the War. Private eye Tokisaka Reiji accepts a strange request from a girl in Inokashira Park. 'I want you to look for something. Me. My true self.' Meanwhile, a series of bizarre murders are plaguing the area. Young women are disappearing, only to turn up dead and maimed with their wombs torn out. Seeking assistance on the case, Detective Uozumi Kyoko called up his old friend and former co-worker, Reiji. Ouba Girls Academy: A school on the outskirts of Hoya City. Reiji's little sister attends this school, where two young women have mysteriously vanished. Saeki Tokio, the vice principal, calls in Reiji to investigate their disappearance, giving him his third case. Reiji infiltrates the academy as a substitute teacher to learn information from the students--but that's when he meets her once again. Kuchiki Toko--his first client, the girl who asked him to search for her true self. Her manner is distinctly boyish as she remarks: 'Heya - so we meet again, Mr. Detective.' The body count continues to rise. What should be a simple search for some lost students is starting to grow out of control. For some reason, the number of missing people and unidentified bodies don't match up. Who will be chosen as the next victim? As this endless cycle of tragedy continues, what mysteries lie behind these new cases? ---Behind a similar series of murders from six years ago? Gameplay Innocent Grey presents an original, psychologically thrilling murder mystery. Here, your investigative work and deductions directly influence the course of the story. Will you be able to use the clues contained in your notebook to piece together the truth in this pulse-pounding mystery thriller? With a cast of more than thirty characters, there's no shortage of complicated relationships, drama, and riddles. You may let out a muffle scream. You may get within inches of finding this murderer only to let them escape. But what every you do, don't let this amazing work slip under your radar! Perhaps one girl's smile might await beneath the shell of this tragedy...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/965810/header.jpg?t=1645766778",
    "Price": 17.49,
    "Developers": "Innocent Grey",
    "Publishers": "MangaGamer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_3b806845eafbc34fd1f428f977a3bdfd452970df.1920x1080.jpg?t=1645766778,https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_6d2bc10449f96e31833a9ea784e26b83dbe0eb3c.1920x1080.jpg?t=1645766778,https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_b0c1dcad05c13d2e87f264a1b007aa8432c41b94.1920x1080.jpg?t=1645766778,https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_1635c5b0b73464f60cf5b39d2adbbeb87ad3eb28.1920x1080.jpg?t=1645766778,https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_4e77140160fd4ef2f6ae159e1ecfd729ffff183e.1920x1080.jpg?t=1645766778,https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_76193afd986da9846c0ddbb02107aa943957462a.1920x1080.jpg?t=1645766778,https://cdn.akamai.steamstatic.com/steam/apps/965810/ss_e2992c58bfa31288a9410e8e08840fc1fa3c2060.1920x1080.jpg?t=1645766778",
    "Slug": "kara-no-shojo",
    "Meta Title": "Kara no Shojo: Oct 22, 2018, Innocent Grey and Full Overview",
    "Meta Description": "Looking for information on Kara no Shojo? Check out the release date (Oct 22, 2018), developer insights from Innocent Grey, and a complete game summary.",
    "Alt Text Image": "Official header image for Kara no Shojo game - Steam 965810",
    "Canonical URL": "https://gusku.site/game/kara-no-shojo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kara no Shojo\", \"description\": \"Looking for information on Kara no Shojo? Check out the release date (Oct 22, 2018), developer insights from Innocent Grey, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Innocent Grey\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MangaGamer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/965810/header.jpg?t=1645766778\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}