{
    "AppID": 1727420,
    "Name": "Midinous",
    "Release date": "Sep 28, 2021",
    "About the game": "This looks fun, what is it? Midinous is a non-linear MIDI sequencer (directly viewable as a MIDI input in your DAW) allowing users to create expansive looping complex sequences which don’t subscribe to a definite timeline. Rhythm is determined only by a user’s imagination. Midinous can, however, still send MIDI clock messages to sync up devices and software. It's not a DAW, nor can it make more than simple sounds with its 'Internal Synth' option, but it generates MIDI data meant to be sent to other applications. If you are unsure if Midinous is right for you, try the free demo! That sounds confusing. How does it work, really? Seamlessly! Open Midinous, find it as a MIDI input device in your DAW and start creating. Midinous emulates a hardware MIDI controller by creating its own MIDI Input/Output port on a computer, throwing away the need for any 3rd party software. Launch Midinous, and it can start sending MIDI data within seconds! Still lost. MIDI? Musical Instrument Digital Interface (MIDI) is the technical standard Midinous adopts to send data to other applications (usually, but not limited to, Digital Audio Workstations (DAWs)). Although Midinous can make simple sounds on its own, it is best used with a DAW. Grid Based Editing Midinous works on a grid system where the distance between each tile is a quarter note. Arrange objects called ‘Points’ and connect them together with ‘Paths’ to quickly create complex looping or branching sequences of MIDI data. Branch to points randomly or instantly, split signals, or have signals travel in order of Path creation. Turn snapping mode off for complex rhythms and odd timing! Customization and Accessibility Most keyboard controls have been made accessible by way of remapping, and the interface can be recolored as desired. Make Midinous as friendly as it needs to be. “Infinite” Canvas Midinous provides a virtually infinite scrollable canvas for creations. Though technically not limitless, Midinous can support the wildest of creations with full support for scrolling, panning, and zoom. Scale Snapping With Midinous’ scale snapping functionality, set a group of Points to a certain scale, or ensure the entire project aligns with a desired mode. Choose a key and a scale to quickly change the way a sequence sounds. Relative Signals Carry MIDI data across multiple pathways with relative assignments for every attribute a Point object may have, such as MIDI Note, Channel, Velocity, Duration, and more. Good for ascending sequences and arpeggios. Support For Other Operating Systems Midinous is being developed in a cross-platform framework that will allow it to run on either Linux or Mac operating systems as well as Windows. However, currently, Midinous is only available on Windows and Mac. More operating systems will be supported in the future. Please note! If you don't hear anything in the program, that is normal. Midinous can generate simple tones using the program's 'Internal Synth' option, but its main function is outputting MIDI data for use in other programs like Digital Audio Workstations (DAWs).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1727420/header.jpg?t=1639978569",
    "Price": 24.99,
    "Developers": "Nornec",
    "Publishers": "Nornec",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1727420/ss_6b9ff470c22b0fd68b8437aa35fe5f917e218aec.1920x1080.jpg?t=1639978569,https://cdn.akamai.steamstatic.com/steam/apps/1727420/ss_3b7015ae4a77376bb7d56701ced53d3f219b59c8.1920x1080.jpg?t=1639978569,https://cdn.akamai.steamstatic.com/steam/apps/1727420/ss_bf57622ca7041c06488efcbb159a9bef4b651dae.1920x1080.jpg?t=1639978569,https://cdn.akamai.steamstatic.com/steam/apps/1727420/ss_7eaa1d292c76a90fcbab6a39c641735ba0ccdbc1.1920x1080.jpg?t=1639978569,https://cdn.akamai.steamstatic.com/steam/apps/1727420/ss_45181a04dcd4ea84674c01a1c77e785065e7a215.1920x1080.jpg?t=1639978569",
    "Slug": "midinous",
    "Meta Title": "Midinous: Sep 28, 2021, Nornec and Full Overview",
    "Meta Description": "Looking for information on Midinous? Check out the release date (Sep 28, 2021), developer insights from Nornec, and a complete game summary.",
    "Alt Text Image": "Official header image for Midinous game - Steam 1727420",
    "Canonical URL": "https://gusku.site/game/midinous",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Midinous\", \"description\": \"Looking for information on Midinous? Check out the release date (Sep 28, 2021), developer insights from Nornec, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nornec\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nornec\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1727420/header.jpg?t=1639978569\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}