{
    "AppID": 1516560,
    "Name": "Ministry of Pandemic",
    "Release date": "Jan 1, 2022",
    "About the game": "Ministry of Pandemic is a strategy and simulation game that forces social and economic balance during the pandemic. Formulate your strategy for survival while keeping all aspects of society steady. Suppress the plague by developing a vaccine, isolating the population, or developing any real-world solution. You will also encounter fake news, greedy companies, and civil unrest. Good luck !! Key Features Control the progress of the disease While developing the vaccine, use suppression and herd immunity tactics to control the disease. Create balance between society and economics. While lockdowns suppress the disease, it will drive the economy into recession. Try to maintain the balance between society, economy, and epidemic control. Establish social order. Continuous social discontent will result in civil unrest and protests. While some demonstrations just show society’s current issues, others will not disappear unless the player takes action and fix the problems. Choose Welfare state vs free market Players can choose either the free market with no interruption or the relatively free market while maintaining a strong social security system. Social support packages include free health care, unemployment insurance, and basic income. Real fake news! Take action against fake news or ignore them. Ignoring can cost an increase in infection or increased disinformation. Fake news is collected worldwide through the covid epidemic, ranked according to the level of danger and possible consequences. Democracy vs autocracy Every action of the player will place the government on a democratic or authoritarian side. Each city will need a different approach. Control over travel and trade. Control over foreign travel and trade will affect production capacity while helping to combat the epidemic. Import dependency of city`s production will make the output more dramatic. Upgrade healthcare systems Upgrade and redesign healthcare infrastructure to adapt to the disease. Players can upgrade Icu capacity, bed capacity, and doctors' protection against disease until certain levels. Develop the vaccine Develop and test candidate vaccines. From the discovery phase of the vaccine to the final stages of development, players will have more information such as effectiveness and side effects. While it's possible to get a vaccine approved early, it may come with surprises! Apply partial or full lockdowns Isolation of certain demographic groups and specific time periods will affect the suppression of disease and production levels. Keep population calm Only a certain level of fear may make people more cautious about the disease after that; it will create increased social disorder, low production levels, and even mass hysteria. Suppress disease transfer rates Establish policies to implement preventive actions such as the use of masks, distributing masks and sanitation, regular disinfection of the city, and more Track and trace patients Widespread and Frequent Testing is Essential to Controlling disease. With the help of tests and databases, it will be easier to isolate infected cases from society and trace contacted individuals. More Features, Choose a counselor during pandemic control; seven different consultants represent different aspects of pandemic control. Each of them comes with bonuses in their specialty. Even the same scenario with another advisor will be a different game experience. Real-life diseases are referenced as the main mechanic. Each disease has unique characteristics such as reproduction number, incubation period, recovery time, and mortality rate. Etc. Economic level, production, confidence in science, level of human cooperation with authoritarian or democratic regimes... Each city requires a different strategy to deal with the epidemic. Allow or ban regular events, concerts and festivals. Every activity allowed will support people's economy and psychology while risking new fluctuations in infection. Interconnected technology tree and dependencies for all actions. Most activities can be activated and deactivated according to the needs of the community and disease control. Handcrafted and procedural scenario events.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1516560/header.jpg?t=1641052732",
    "Price": 2.49,
    "Developers": "Ceyhan Kapusuz,Ecem Baysal Kapusuz",
    "Publishers": "Cookie Mechanics",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_5428b253b4989e144695dfa0ae09c4c70cc974f2.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_02505f3ac50ccc2d0a4a6a7160bc9e1ef5c365ee.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_b5af7512e3877d29732bf130b45e5b648e11d5f7.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_6235a0ff76bb825402dc5a46d5aaf24d80d0d708.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_23b397d1419e0d48cfc5cd23b407df171c7b9d9c.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_a12bcd06ff9b1d3cebf9c803393f90dee58159ce.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_8048602dbb220a6a4f11e539b5add455ff20c615.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_6195a822d5d953c741d9912725b0ba0773ec4a13.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_a3856ef91a02863e778edb645385022f86543eec.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_9475d757199beb044239d5758fffc8f676ae6c8a.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_c2faccbd99be68ba808ce604bf63b167dc40bbc7.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_8c13e6a455fb9a681fe100c4f1972abd036e442a.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_6ed8491935e30dbc439e0e11304ef3d74b46083d.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_cd82aeec69cf2efc3d8c84fea6ff973376312f59.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_230c4bd5327115b6a8b4c4cdcbc326f9110bcd76.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_1a25e74bcf240318832898134ae7e70a9b35050a.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_606620c3bc8eeaa6174d842d0a42c3f1e734361e.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_bd2780518da3fa6ae8d667ee8608e026fde1647a.1920x1080.jpg?t=1641052732,https://cdn.akamai.steamstatic.com/steam/apps/1516560/ss_099204840365eb0fdbed8e08c3fb77a3229a7d73.1920x1080.jpg?t=1641052732",
    "Slug": "ministry-of-pandemic",
    "Meta Title": "Ministry of Pandemic: Jan 1, 2022, Ceyhan Kapusuz,Ecem Ba...",
    "Meta Description": "Looking for information on Ministry of Pandemic? Check out the release date (Jan 1, 2022), developer insights from Ceyhan Kapusuz,Ecem Baysal Kapusuz, a...",
    "Alt Text Image": "Official header image for Ministry of Pandemic game - Steam 1516560",
    "Canonical URL": "https://gusku.site/game/ministry-of-pandemic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ministry of Pandemic\", \"description\": \"Looking for information on Ministry of Pandemic? Check out the release date (Jan 1, 2022), developer insights from Ceyhan Kapusuz,Ecem Baysal Kapusuz, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ceyhan Kapusuz,Ecem Baysal Kapusuz\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cookie Mechanics\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1516560/header.jpg?t=1641052732\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}