{
    "AppID": 1563760,
    "Name": "Monster Girl Dungeon",
    "Release date": "Mar 31, 2021",
    "About the game": "Story For many centuries, Monster Girls were ostracized and rejected from much of society. They were thought of as strange demonic beings that didn't have any sort of place in normal human life, but as time passed, so did this rigid stereotype slowly dissolve with it. Fast forward to the present time, Monster Girls have become an integral and irreplaceable part of human life, and can be found in many difference facets of society. One particular aspect that has drawn much attention (and criticism), is that of the domestication of Monster Girls as pets. In this game, the player will be able to experience what it would be like to have a monster girl as a pet for themselves. ***ALL INFORMATION BELOW HERE IS CURRENTLY OUTDATED AND WILL BE UPDATED SOON*** Characters There's the standard slime girl, nekomata, mouse girl, sheep girl – but there are also the more exotic and rarer ones as well: a caterpillar girl, a mandragora, a spriggan, with many more to come in the future. Gameplay / Features The core gameplay loop revolves around having conversations with the monster girls, seeing them in various situations (embarrassing, funny, lewd, etc), and interacting with them by way of a minigame. 3D monster girls that you can talk to and interact with open world to explore In-depth dialogues, with the option to skip them Headpatting minigame, as well as many others Encounter many cute and adorable scenarios with the girls Information I currently have the game organized by episodes, starting with number 0000. Initially, I was using that system arbitrarily just to keep track of different pieces of code that belonged to an earlier or later part of the game, but now I intend to structure the entire game's design and story by individual episode numbers – with each episode being one interaction (something like a story beat in screenwriting) that takes place with one or more monster girls.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1563760/header.jpg?t=1635563832",
    "Price": 0.0,
    "Developers": "Sclavus",
    "Publishers": "Sclavus",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1563760/ss_5c2a972a2d7373efd2cabe7260d92f2abda980b6.1920x1080.jpg?t=1635563832,https://cdn.akamai.steamstatic.com/steam/apps/1563760/ss_4e3e4df427a91d15e9740273aec84601e3a2f118.1920x1080.jpg?t=1635563832,https://cdn.akamai.steamstatic.com/steam/apps/1563760/ss_f145ec900b9128491c5c92c6c0c5ed0bdd591798.1920x1080.jpg?t=1635563832,https://cdn.akamai.steamstatic.com/steam/apps/1563760/ss_524ae7c1577a4c72d067ca6ff3917b6f7d79c956.1920x1080.jpg?t=1635563832,https://cdn.akamai.steamstatic.com/steam/apps/1563760/ss_9450f7f93d3d0533f8fd748c7b5003f246c2b9e8.1920x1080.jpg?t=1635563832",
    "Slug": "monster-girl-dungeon",
    "Meta Title": "Monster Girl Dungeon: Mar 31, 2021, Sclavus and Full Over...",
    "Meta Description": "Looking for information on Monster Girl Dungeon? Check out the release date (Mar 31, 2021), developer insights from Sclavus, and a complete game summary.",
    "Alt Text Image": "Official header image for Monster Girl Dungeon game - Steam 1563760",
    "Canonical URL": "https://gusku.site/game/monster-girl-dungeon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monster Girl Dungeon\", \"description\": \"Looking for information on Monster Girl Dungeon? Check out the release date (Mar 31, 2021), developer insights from Sclavus, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sclavus\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sclavus\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1563760/header.jpg?t=1635563832\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}