{
    "AppID": 905450,
    "Name": "NASCAR Heat 3",
    "Release date": "Sep 7, 2018",
    "About the game": "There are more ways to race than ever before in NASCAR Heat 3! Jump into the enhanced Career Mode, where you can build your own race team and compete in the all-new Xtreme Dirt Tour. Prove that you are the best racer in the world in the all new Online Tournaments feature. At-track stories now mean that anything can happen on race day, just like in real-life! Plus, all your favorites are back and better than ever, including Split Screen, Challenge, Championship, 40-player online, and more. Buckle up! NASCAR HEAT 3 is the racing game you’ve been waiting for! • Xtreme Dirt Tour - In addition to the 3 NASCAR National Series (NASCAR Camping World Truck Series, NASCAR XFINITY Series, and Monster Energy NASCAR Cup Series), players can sling some mud in this all-new dirt fantasy series. • Online Tournaments - Compete against others from across the globe in daily and weekly tournaments. Lay down a great race time and qualify for the Finals in your skill bracket. Win your bracket for ultimate bragging rights. • 8 New Tracks - 8 all-new dirt tracks, including dirt racing at Bristol Motor Speedway and NASCAR Heat’s first ever dirt road course. The final Charlotte Roval layout and the overhauled ISM (formerly Phoenix) Raceway have also been added. • Deeper Career Mode – Make a name for yourself in the all-new Xtreme Dirt Tour and advance to NASCAR’s 3 National Series. Sign contracts with some of the biggest teams in NASCAR or start your own team, build your own staff, and see if you can bring home the Monster Energy NASCAR Cup Series Championship. • Stories – Before the green flag waves, get live-updates on your race. Watch as a driver gets sent to the back for a technical violation. Get updates on who’s having a good weekend, and who’s struggling. • Racing Line – Practice now includes a racing line that gives real-time feedback on the optimal line and speed to run at your current track. • AI Enhancements – AI pit behavior has been revamped. AI difficulty has also been tuned to provide a challenge to players off all skill levels. • Pre-Made Car Setups – For those who want a faster car, but don’t like tuning in the garage, NASCAR Heat now offers 9 pre-defined car setups, including 3 loose and 3 tight setups. • Plus, so much more… *As of April 30, 2021, the Online Multiplayer servers will no longer be available. All Offline features will continue to be accessible, including Local Split Screen Multiplayer for head-to-head racing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/905450/header.jpg?t=1646430483",
    "Price": 12.99,
    "Developers": "Monster Games",
    "Publishers": "704 Games Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/905450/ss_9a049a823b4724bd9742f707f7c8fd7fb35e88d8.1920x1080.jpg?t=1646430483,https://cdn.akamai.steamstatic.com/steam/apps/905450/ss_42a571ef0be06b1b4e6c356df107fdd58d832b5e.1920x1080.jpg?t=1646430483,https://cdn.akamai.steamstatic.com/steam/apps/905450/ss_3a794145096a7bd46d4cac5b6eb40a075932f56b.1920x1080.jpg?t=1646430483,https://cdn.akamai.steamstatic.com/steam/apps/905450/ss_5f9c9cb75497ad0e0f2c9ab2f4a8e2e32bc36b48.1920x1080.jpg?t=1646430483,https://cdn.akamai.steamstatic.com/steam/apps/905450/ss_1aca73c0b019bd4c4ab9d134579be1ea43230886.1920x1080.jpg?t=1646430483",
    "Slug": "nascar-heat-3",
    "Meta Title": "NASCAR Heat 3: Sep 7, 2018, Monster Games and Full Overview",
    "Meta Description": "Looking for information on NASCAR Heat 3? Check out the release date (Sep 7, 2018), developer insights from Monster Games, and a complete game summary.",
    "Alt Text Image": "Official header image for NASCAR Heat 3 game - Steam 905450",
    "Canonical URL": "https://gusku.site/game/nascar-heat-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NASCAR Heat 3\", \"description\": \"Looking for information on NASCAR Heat 3? Check out the release date (Sep 7, 2018), developer insights from Monster Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Monster Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"704 Games Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/905450/header.jpg?t=1646430483\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}