{
    "AppID": 1724010,
    "Name": "Need More Troops",
    "Release date": "Oct 2, 2021",
    "About the game": "Inspired by traditional turn-based fantasy strategies and modern auto battlers, we created the fast-paced rogue-lite game about growing a massive army against ever-increasing hordes of enemies. You should act wisely, though: the formation and battle plan are just as important as the army's size! Randomly generated adventure map The game goal is to go all the way from the player capital to the North through the five zones of the island and defeat the main boss. There will be enemies on your way, and defeating most of them means increased growth for your army. And you'll need more troops: depending on chosen difficulty level, the number of enemies increased dramatically. The rewards will also boost, though - you'll get more additional growth for your creatures in more difficult zones. You can gain gold just by exploring a randomly generated adventure map or from gold mines. Spend gold to increase your troops' growth or improve attack for any troops you have now - or hope to have later. You can gain mana just wandering or from mana pools. Mana increases the level of your leader and his unique trait. Choose your leader Play for a Keeper who increases the health of your troops, an Assassin who makes enemies weaker, or a Necromancer who gains additional dark knights every time after defeating the enemy. Battle System The player does not participate in battles but solves important tasks of placing troops and choosing their behavior before starting them. As a player, you can decide: - Which troops will participate in the next battle, and which ones will remain in reserve. - How to split your troops. - Where to deploy them. - You can choose from two different behaviors for each division. For example, a fire mage can attack all the enemies or the random one with a higher power. Archer can attack the closest or the furthest enemy, etc. It's beneficial to research the enemy and deploy your army accordingly - it's crucial on higher difficulty levels. If you observe your battle, you can usually make improvements for the next one. Portal threat As it is a rogue-lite game, your adventure will be more difficult with each successive turn. Every 30 turns, you will be attacked by an enemy regardless of where you are on the map. You can see in advance which army will attack you to prepare, though. And don't waste too many turns - these armies will become stronger and stronger! Overall There are five difficulty levels to play, and you can play this game as an easy walk or as a game of tough decisions - depending on your mood and what type of player you are. Good luck with growing your army!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1724010/header.jpg?t=1636222245",
    "Price": 4.99,
    "Developers": "Challenging Games",
    "Publishers": "Challenging Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_baefd992969322cc1d6b3bfde399f8ef7ebeede0.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_469dadab80e6d2fa960065cc84d867214da9bdd5.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_10ac4d1ca9b613610928a143116b7d99e03a2832.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_20076dffa89e275e8102561b29956ac8079a6116.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_81a075bf7be7f2f470c6bb299d53167a9c2c7aef.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_19021c0229a084ad04290fb5c427291b14721784.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_ac24ef3d87e929d6da21f6e626b96560c61a1f04.1920x1080.jpg?t=1636222245,https://cdn.akamai.steamstatic.com/steam/apps/1724010/ss_3ae1efc3ad28e63a95885e2568104a03a5d805cc.1920x1080.jpg?t=1636222245",
    "Slug": "need-more-troops",
    "Meta Title": "Need More Troops: Oct 2, 2021, Challenging Games and Full...",
    "Meta Description": "Looking for information on Need More Troops? Check out the release date (Oct 2, 2021), developer insights from Challenging Games, and a complete game su...",
    "Alt Text Image": "Official header image for Need More Troops game - Steam 1724010",
    "Canonical URL": "https://gusku.site/game/need-more-troops",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Need More Troops\", \"description\": \"Looking for information on Need More Troops? Check out the release date (Oct 2, 2021), developer insights from Challenging Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Challenging Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Challenging Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1724010/header.jpg?t=1636222245\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}