{
    "AppID": 1772160,
    "Name": "Nonlinear System Tools",
    "Release date": "Dec 3, 2021",
    "About the game": "NST: Nonlinear System Tools NST is a tool for writing novels, short stories, poems, and other forms of text in a way that makes the reader's decisions count. Everything that happens can have inter-dependencies such as: A can only happen if B has already happened. A can only happen if B can happen. A can only happen if B could ever have happened. A can only happen if B is happening at the moment. A can only happen if X is more than 1 And much much more! NST has an Editor and a Reader. The NST Editor is a standalone program that enables you to write branching stories from scratch. The NST Reader is a tool that visually renders these stories using HTML/JavaScript/CSS with all their power. The Reader is available for free and also comes bundled with the editor. How it works It's really simple! All stories have only two main components: states and properties . A state is a moment in time, a description of a situation. It contains a logical link with everything that might lead to that situation. A property is essentially a numeric value, which can hold information on the amount of health you have, or your armor strength, or your relationship with other characters in the story, or anything else you might imagine. The states and properties are interconnected to form a story , which one can read in a branching fashion based on own's decisions. Who's behind it NST is a single-person operation, the brainchild of Martin Petkovski. Development started in early 2021 and will continue into the foreseeable future. All inquiries and requests are encouraged, I'm trying to respond to all messages as soon as possible. What can be achieved with it NST is tailored towards creating hypertext fiction that follows a branching or nonlinear narrative. Examples of literature that can be written and played in their entirety in NST include: James Joyce's Ulysses, Enrique Jardiel Poncela's La Tournée de Dios, Jorge Luis Borges' The Garden of Forking Paths, Italo Calvino's The Castle of Crossed Destinies, various Choose Your Adventure magazines, and so on. The NST Reader is capable of everything that Chromium is able to do, including playing video and audio, so in theory, it is even able to run movies and TV shows such as Black Mirror: Bandersnatch, if they are to be written in the NST format.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1772160/header.jpg?t=1639338854",
    "Price": 19.99,
    "Developers": "Martin Petkovski",
    "Publishers": "Return Zero",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1772160/ss_6e06f5c3ad1ed12999f03396dbec311720ecb2d6.1920x1080.jpg?t=1639338854,https://cdn.akamai.steamstatic.com/steam/apps/1772160/ss_04c05e9f9c9706bbd8d99e29069026176331a4d5.1920x1080.jpg?t=1639338854,https://cdn.akamai.steamstatic.com/steam/apps/1772160/ss_072ef839845d8b2fa51732303edfaae2531008d1.1920x1080.jpg?t=1639338854,https://cdn.akamai.steamstatic.com/steam/apps/1772160/ss_36037d573ed000b62233b51a53a65ce4a0d9ca57.1920x1080.jpg?t=1639338854,https://cdn.akamai.steamstatic.com/steam/apps/1772160/ss_fc12b2a5810215a6334f0eefea8584e9056fa9bd.1920x1080.jpg?t=1639338854",
    "Slug": "nonlinear-system-tools",
    "Meta Title": "Nonlinear System Tools: Dec 3, 2021, Martin Petkovski and...",
    "Meta Description": "Looking for information on Nonlinear System Tools? Check out the release date (Dec 3, 2021), developer insights from Martin Petkovski, and a complete ga...",
    "Alt Text Image": "Official header image for Nonlinear System Tools game - Steam 1772160",
    "Canonical URL": "https://gusku.site/game/nonlinear-system-tools",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nonlinear System Tools\", \"description\": \"Looking for information on Nonlinear System Tools? Check out the release date (Dec 3, 2021), developer insights from Martin Petkovski, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Martin Petkovski\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Return Zero\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1772160/header.jpg?t=1639338854\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}