{
    "AppID": 680310,
    "Name": "Poker World - Single Player",
    "Release date": "Aug 27, 2017",
    "About the game": "Become the World Poker Champion - play poker around the world in the most famous poker cities. Poker World is brought to you by the makers of Governor of Poker. In this great offline poker game, you're battling and bluffing your way through several continents and famous poker cities. Ever played poker in Macau? Or visited the majestic Monaco casino? Or went all in in the Bellagio in Las Vegas? This is your chance. And you'll play poker with only one goal: to become the best poker player in the world. In Poker World, you start your first poker tournament in the United States. By winning tournaments you progress and build up your reputation as a poker player. You will be able to join bigger and more exciting poker tournaments, get better poker sponsor deals and buy cool items to show off your poker status. And don’t be surprised if you get challenged by the best players in the world. You'll play heads-up poker against these World Top players and climb your way to the top. TRY POKER WORLD - SINGLE PLAYER POKER FOR FREE, SHOW OFF YOUR SKILLS AND BECOME THE WORLD’S BEST TEXAS HOLD'EM POKER PLAYER IN THIS GREAT OFFLINE POKER ADVENTURE! Great game features: - MORE THAN 30 HOURS of Texas Hold'em Poker play; OVER 60 POKER CITIES in the world where you can participate in challenging poker tournaments. Every tournament varies in buy-in, number of players and poker winnings; - COLLECT STATUS SYMBOLS to build up your reputation in the poker scene and get access to certain tournaments; - SIGN SPONSORSHIPS to earn more chips and tickets for special tournaments; - WORLD TOP 10: beat all World Top players and win tickets for special tournaments; - PLAY ANYTIME, ANYWHERE: Poker offline, no internet connection required: There is no internet connection required to play this great game. And one other big advantage: you don't have to wait for real world players like you do in live multiplayer poker. Slick, fast gameplay! - THE BEST AND MOST FUN POKER AI IN THE WORLD This poker engine is created to give you the best poker experience and the feeling you are playing against real players. We made the AI to ensure the game is great for both beginning poker players who are learning poker and experienced players. Refine your card tactics to match the style of your opponents! The offline players will play better in each new city and poker tournament! - BIG FREE WELCOME PACKAGE: 20,000 free poker chips; - MORE FREE CHIPS: Collect FREE chips every day with your daily bonus; - EARN MORE CHIPS: Watch videos and earn free bonus poker chips in this poker paradise; - GREAT HD GRAPHICS: The poker game is beautifully designed and includes HD poker graphics for a great poker experience. Millions of poker players have already enjoyed our Governor of Poker games. Play this very exciting Texas Hold'em poker game and prove you are the best poker player in the world. Press Install and download Poker World NOW.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/680310/header.jpg?t=1603727931",
    "Price": 0.0,
    "Developers": "Azerion,Youda Games Holding B.V.",
    "Publishers": "Azerion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/680310/ss_97856b76f5034da5574419af2db79ea99a47f050.1920x1080.jpg?t=1603727931,https://cdn.akamai.steamstatic.com/steam/apps/680310/ss_b11a15719b518fb02aafa3763bc247a3cd421bf5.1920x1080.jpg?t=1603727931,https://cdn.akamai.steamstatic.com/steam/apps/680310/ss_27f8c1d7baa74986d7842b01cd6801d98326d2ad.1920x1080.jpg?t=1603727931,https://cdn.akamai.steamstatic.com/steam/apps/680310/ss_0f9316a42e21d942b250122ddbaac3a77299c802.1920x1080.jpg?t=1603727931,https://cdn.akamai.steamstatic.com/steam/apps/680310/ss_6c2ebbfd87b20a75f60b85eb191779e11ab864e3.1920x1080.jpg?t=1603727931",
    "Slug": "poker-world-single-player",
    "Meta Title": "Poker World - Single Player: Aug 27, 2017, Azerion,Youda ...",
    "Meta Description": "Looking for information on Poker World - Single Player? Check out the release date (Aug 27, 2017), developer insights from Azerion,Youda Games Holding B...",
    "Alt Text Image": "Official header image for Poker World - Single Player game - Steam 680310",
    "Canonical URL": "https://gusku.site/game/poker-world-single-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Poker World - Single Player\", \"description\": \"Looking for information on Poker World - Single Player? Check out the release date (Aug 27, 2017), developer insights from Azerion,Youda Games Holding B...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Azerion,Youda Games Holding B.V.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Azerion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/680310/header.jpg?t=1603727931\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}