{
    "AppID": 1303630,
    "Name": "Rachael Savage",
    "Release date": "Aug 17, 2020",
    "About the game": "Rachael Savage is a game about hunting down various killers in search of mystical medallions. These medallions help open up a gate to find the Infinkey, which gives a user whatever they desire. But it won't be easy, as there's always bad guys on the loose! You're also searching for Sadrix, who has the final medallion and is after the Infinikey. What will he wish for if he gets to it first? This game is an action platformer where you play as a bounty hunter named Rachael. She can turn invisible and sneak past enemies, or even use it to her advantage to take them out without them even knowing. She wields a sword to slash through the bad guys and also finds other items along the way. She's free to explore the town and talk to the people there, taking bounties along the way in the form of sidequests. Many characters like to relax in the Bee Keep, a local tavern for travelers and bounty hunters alike! Features Sword slashing action Invisibility mechanic to keep enemies confused Secrets to find hidden away Collectables to boost your abilities New items and armor An epic Tales of Alethrion crossover from their Youtube series An Untitled Goose cameo A game I hope people enjoy, made by one person excluding music And a cool villain to take down! Inlcudes Rachael's Bounty: The primary campaign that is playable from the start. Utilize stealth and speed to slash through enemies, all on her journey for revenge to defeat Sadrix. Some foes can only be faced when playing as Rachael, since she is the toughest bounty hunter around. Cortana's Glory: The secondary prequel campaign that is unlocked after you beat the main game. See how Cortana plays into the story and what he's willing to do to fight for those who can't. He is able to double jump and has all new items with his quest. Nightmare Mode: Play as either hero in this mode after you have beaten both campaigns. Beating this will make you stand above the rest. Taking double damage, you'll see just how hard their adventures can be!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1303630/header.jpg?t=1597675712",
    "Price": 4.99,
    "Developers": "Nick Marinello",
    "Publishers": "Nick Marinello",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1303630/ss_efac0df5e5ec830bb8f479d7e8d87d9520b4f4d2.1920x1080.jpg?t=1597675712,https://cdn.akamai.steamstatic.com/steam/apps/1303630/ss_a10045bda0af6348ab5623bf48dfa9fb2873fd03.1920x1080.jpg?t=1597675712,https://cdn.akamai.steamstatic.com/steam/apps/1303630/ss_cb706e271cd2bc63c9e508705575bb22fd5aa68f.1920x1080.jpg?t=1597675712,https://cdn.akamai.steamstatic.com/steam/apps/1303630/ss_fef9258888e14900231449d54f7e2415817ab8d8.1920x1080.jpg?t=1597675712,https://cdn.akamai.steamstatic.com/steam/apps/1303630/ss_f3a9c330b59a500eb3f9546d2a7abfc34936e899.1920x1080.jpg?t=1597675712",
    "Slug": "rachael-savage",
    "Meta Title": "Rachael Savage: Aug 17, 2020, Nick Marinello and Full Ove...",
    "Meta Description": "Looking for information on Rachael Savage? Check out the release date (Aug 17, 2020), developer insights from Nick Marinello, and a complete game summary.",
    "Alt Text Image": "Official header image for Rachael Savage game - Steam 1303630",
    "Canonical URL": "https://gusku.site/game/rachael-savage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rachael Savage\", \"description\": \"Looking for information on Rachael Savage? Check out the release date (Aug 17, 2020), developer insights from Nick Marinello, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nick Marinello\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nick Marinello\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1303630/header.jpg?t=1597675712\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}