{
    "AppID": 1824260,
    "Name": "Scholar",
    "Release date": "May 13, 2022",
    "About the game": "Scholar is a spelling game with RPG elements. Level up your hero as you spell words and unlock new skills. Fight powerful bosses at the end of each level and get that loot. Flow In Scholar, Flow is your both energy and health. Casting a word, as well as taking damage reduces your flow. Use your skills, equipment and upgrades to reduce flow costs or completely neglect them. In some cases even regenerate and fill your entire flow with one special word. Three Skill Trees to Explore Choose your way between path of Flow, Experience and Guardian. Will you focus solely on your exp gains or will you maximize your damage output? Mix them to your liking to enjoy your journey. Reset them any time and try out new strategies. Loot After you complete every run enjoy your new loot. Try harder difficulty runs to obtain better quality ones. Common, rare,legendary and set items all await you! Use multiple items of the same set to unlock special abilities. Finishing higher difficulty runs will also give you better rolled items. Look out for glitched items which roll with extra stats. Even a common item can be an exciting addition to your armory if you can find a glitched one! Augments As you spell words you'll start to run into augmented letters. These letters can give you various bonuses such as; XP, Flow, Damage or free shuffling. Sometimes they might carry harmful effects, yet even those can come in handy with the right skills. Runes Spelling words, using augmented letters, defeating guardians will all earn you different kinds of runes. Use these runes to upgrade your board size, XP and gain advantages against the guardians. In addition to your skills and equipment, upgrades will also aid you in your journey. Difficulty curated to your enjoyment It's up-to you to decide whether you want a purely relaxing experience or a hardcore spelling journey, When you are in the mood crank the difficulty to gain extra XP and loot. Apart from the general difficulty setting, your runs also scale from 1 to level 200. You can decide to farm lower levels in a fast manner or go higher for the better rewards. Skills and Items on full display. Any item that provides you a unique ability, or a skill that boosts your XP , Damage or Flow will always be shown in the corresponding section of your info box. Simply mouse over them to remind yourself of their names. Anytime a legendary or a set item triggers it's effect a short animation will be shown, allowing you to decide if they are useful enough for you or perhaps it's time to change up your gear.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1824260/header.jpg?t=1652441364",
    "Price": 6.99,
    "Developers": "cosmic_dust",
    "Publishers": "cosmic_dust",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1824260/ss_0f0d47f6be25e78030459d331cdda22dd5f8f90d.1920x1080.jpg?t=1652441364,https://cdn.akamai.steamstatic.com/steam/apps/1824260/ss_979301f16bc9f826cfaa9da5c1d0658a9029088c.1920x1080.jpg?t=1652441364,https://cdn.akamai.steamstatic.com/steam/apps/1824260/ss_0506b3047ed42e7f241bcb9f14e8d9da7e26cb3f.1920x1080.jpg?t=1652441364,https://cdn.akamai.steamstatic.com/steam/apps/1824260/ss_cae00aa8d3f8a881853d3b45605a874fe09bf3b4.1920x1080.jpg?t=1652441364,https://cdn.akamai.steamstatic.com/steam/apps/1824260/ss_e8562490cb6f61365e26d2e3896f4f6f1ee8939f.1920x1080.jpg?t=1652441364,https://cdn.akamai.steamstatic.com/steam/apps/1824260/ss_4552f0e34000b1e1bc5b4bb8a3b44092efc41a1f.1920x1080.jpg?t=1652441364",
    "Slug": "scholar",
    "Meta Title": "Scholar: May 13, 2022, cosmic_dust and Full Overview",
    "Meta Description": "Looking for information on Scholar? Check out the release date (May 13, 2022), developer insights from cosmic_dust, and a complete game summary.",
    "Alt Text Image": "Official header image for Scholar game - Steam 1824260",
    "Canonical URL": "https://gusku.site/game/scholar",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Scholar\", \"description\": \"Looking for information on Scholar? Check out the release date (May 13, 2022), developer insights from cosmic_dust, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"cosmic_dust\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"cosmic_dust\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1824260/header.jpg?t=1652441364\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}