{
    "AppID": 34870,
    "Name": "Sniper: Ghost Warrior 2",
    "Release date": "Mar 11, 2013",
    "About the game": "Sniper: Ghost Warrior 2 is the only multi-platform, first-person, modern shooter exclusively designed around the sniper experience. It takes the bulls-eye precision of its predecessor to new and exciting heights, offering more diverse sniper challenges; a rebuilt AI system and the thrilling “one shot, one kill” precision that made the original a huge hit, selling 3 million copies worldwide. Taking advantage of the advanced capabilities of the CryENGINE3, Sniper: Ghost Warrior 2 also delivers striking graphic environments. Key Features Motion Sense Trigger System: an innovative first in which the way the player touches the controller influences the on-screen shot. Like in real-world sniping, in-game shooting requires a steady squeeze of the pad’s trigger so that when the round is fired, the rifle is more accurate. Jerk the trigger and the round is thrown off, thus missing the target and alerting a highly motivated enemy to your presence. Realistic Ballistics: the hallmark of the Sniper franchise is the realism of its shooting dynamics. Wind speed, distance, gravity and bullet-drop all play critical roles in the performance of your shot. Refined Shooting Mechanics: a proper breathing technique to steady your heart rate is as important as calculating the time on target of your round, and the best snipers control both their heart and their head. From acquisition of target until the slow steady trigger pull, a sniper must pull together everything to achieve the ideal “one shot; one kill.” Improved Enemy AI: the Artificial Intelligence (AI) system was completely re-tooled and designed from scratch. Much of the improvements were made possible from the switch to the CryEngine 3. Expect everything from flanking movements to frontal assaults as the enemy tries to engage you in close quarters where your rifle is less effective. New Target-Rich Environments: Sniper Ghost Warrior 2 adds new urban environments like Sarajevo and treacherous mountain terrain to go along with jungles that are as lush and deadly as ever. Various Difficulty Levels: To diversify gameplay and make it accessible to the widest group of gamers, CI Games is introducing three difficulty levels that totally change the nature of the game. You decide how to play – either relax and be the ultimate predator or test your skill and experience the game on Expert Mode. Bullet-Cam: everyone’s favorite feature returns to reward expert shots and show the battlefield from a totally new viewpoint. See what the transfer of kinetic energy – a bullet’s true stopping power – can do to the enemy from 1000 meters or more! Bullet Penetration: concealment doesn’t necessarily mean cover. In Sniper: Ghost Warrior 2, bullets behave as they would in real life and are able to dispatch enemies hiding behind various types of covers. You can also try to line up your enemies and let a single round take out an entire squad. Wait ‘til you see that on Bullet Cam! Expanded List of Sniper Rifles: Try out the world’s most advanced sniper rifles, each of them meticulously recreated so that they accurately simulate the modern weaponry found on today’s battlefields. New Gear: own the night with the introduction of thermal and night vision optics, plus a pair of powerful binoculars critical for locating the enemy before they spot you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/34870/header.jpg?t=1604916772",
    "Price": 9.99,
    "Developers": "City Interactive",
    "Publishers": "CI Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_9394c7938ba424434bfcd75a7511ca099ee21c3c.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_82beb36782dd6d186ca73d7abac17ed4bd466b8e.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_4a8625640f0c2b7faf45b305d2b71531de2dbf93.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_fe71b511f16393b69ff7ab74940e86ca3988ed9a.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_6ed9928abd29c4c02a068a60662d4a80cbc169ba.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_c59f81f20bd68d0befa31241730ac305b5e75eeb.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_4cf15f7feec0efa89d36433be85cd4e4a6e79d72.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_233153fb221069ed35fb0f05bd366d53789dae02.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_4a6d9c4f8bb7fedacca64ba5c66f400ca801e7ad.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_6c89643527ef8d0412b0025cdf1ec36f77b9db8b.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_eaeefb6e8ed0ddf88eca9cdb98ca4aaab199470a.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_49ec1c3fb64ab8802c66d913f5f15ee0b961ce27.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_64a758aea68dfaf865295542fd7a7ea462ee002a.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_b2726521ab399fc3b071ed59fea471184a11232e.1920x1080.jpg?t=1604916772,https://cdn.akamai.steamstatic.com/steam/apps/34870/ss_e18e3131f18f1e3af413b88e3d257702ffdd33a8.1920x1080.jpg?t=1604916772",
    "Slug": "sniper-ghost-warrior-2",
    "Meta Title": "Sniper: Ghost Warrior 2: Mar 11, 2013, City Interactive a...",
    "Meta Description": "Looking for information on Sniper: Ghost Warrior 2? Check out the release date (Mar 11, 2013), developer insights from City Interactive, and a complete ...",
    "Alt Text Image": "Official header image for Sniper: Ghost Warrior 2 game - Steam 34870",
    "Canonical URL": "https://gusku.site/game/sniper-ghost-warrior-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sniper: Ghost Warrior 2\", \"description\": \"Looking for information on Sniper: Ghost Warrior 2? Check out the release date (Mar 11, 2013), developer insights from City Interactive, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 11, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"City Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CI Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/34870/header.jpg?t=1604916772\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}