{
    "AppID": 596970,
    "Name": "Sunless Skies: Sovereign Edition",
    "Release date": "Jan 31, 2019",
    "About the game": "Captain a spacefaring steam locomotive as a new Victorian empire takes to the stars! Lead your hapless crew into trouble – and out of their minds. Smuggle souls. Barter for barrels of time. Stop for cricket (and a nice cup of tea). Sunless Skies: Sovereign Edition is the complete and definitive version of Sunless Skies. It incorporates the many additions made since launch – including new officers, enemies, engines, stories, and mascots, as well as a completely reworked region, a full steam mode for long journeys and desperate escapes, and the much-requested horn – as well as dozens of quality of life improvements. Create your past Choose who you were before you became a skyfarer. An urchin? A priest? A revolutionary? What brought you here, and what are you hiding? Each time your character advances, choose another facet of their history. Were they the Black Sheep of the family? Do they have a Lost Love? The skies are cruel. Most of your captains will die. But each will leave their mark on the world, and an inheritance for those who follow – for better or worse. Explore a beautiful, hostile universe Discover more of the deep, dark, marvellous Fallen London Universe, as seen in our previous game, Sunless Sea. (But you don’t have to play that first! This is a totally new story, not a sequel.) Improve your locomotive Your locomotive is all that stands between you and the many dangers of the Heavens. Maintain and upgrade it with exotic weaponry and equipment, like a Pneumatic Mining Array, or the rapid-fire Brassraven. Learn how to craft exotic weapons like the Wrath of Heaven from your defeated enemies. And when you have enough funds, buy an entirely new one! Perhaps you would enjoy the capacity of the Pellinore-class Trader? Or the sleek malevolence of a Medea-class Destroyer? Fight marauders, Her Majesty’s agents, and abominations of the skies Face rival locomotives – anything from scrappy pirates to experimental warships of the imperial navy. Battle monsters like the nightmarish Undeparted, or swarms of irate Chorister-bees. Play different factions against each other, and learn the unique behaviours of each foe. Use Full Steam mode to evade trouble or chase down your quarry. Survive starvation, madness and terror Manage your crew’s morale and your captain’s own nightmares. Balance your fuel and supplies against your desire to explore new horizons, or pursue knowledge, or seize riches. Beware: we are all changed by the dark. Recruit variously helpful officers Populate your ship with upgradeable officers, each with their own quest to fulfill: a repentant devil, an incognito princess, an entire brigade of rats, and – dear god! – your own Aunt?! How did she get out here? The World Unfettered by gravity, the Victorian Empire begins to reach across the skies. It has built a new sun. The Empress reigns from the Throne of Hours, which gives her control over time. Its ambition is vast; its mercy slim. The High Wilderness is a wondrous, horrifying vision of space where the rules are not as we imagined. Winds howl through shattered celestial ruins. Fogs coil amidst stellar jungles. Industrial sprawl chokes the heavens with smog. The stars are alive. They are the Judgements: vast intelligences that govern all things. But they are dying. One by one, something is snuffing them out, leaving their thrones empty. Your captain must make their way in this impossible world as they trade, explore, fight and survive. Pick your side carefully, for you might be the thing that tips the balance of power – will you support Her Majesty's new empire, or the rebels who mean to throw off London's rule? Or perhaps you spurn such concerns, and intend to chart the narrow course between the two? Will you retire triumphant, or be lost to the dark? Features 800,000+ words of intertwining stories with a depth and richness unlike anything else in games, inspired by CS Lewis, Jules Verne, HP Lovecraft and HG Wells Lush, hand-drawn 2d art Four regions to explore: celestial wilderness, impossible industrial empire, pagan midnight expanse, and the domain of the dead Real time combat against horrifying celestial foes and merciless pirates Upgrade your engine with bizarre equipment and powerful weaponry Battle starvation, mutiny, terror and nightmares – or give in to them A choice of play styles: build a lineage of captains as each dies, or reload your most recent captain and continue Narrative levelling: discover your captain’s past as you traverse the skies Earn your fortune in a unique, story-rich trading system, or risk it all to become a smuggler Collect pets: the Inadvisably Big Dog, Useless Cat, Perfect Pangolin and more Key remapping for keyboard and mouse, and full controller support Who are Failbetter Games? We’re a small British games studio based in London. We’ve been making indie games since 2009. Come with us into the dark.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/596970/header.jpg?t=1632826469",
    "Price": 24.99,
    "Developers": "Failbetter Games",
    "Publishers": "Failbetter Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_36f60f85c29cbd5c29a74a7a871d2b134077333d.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_c916281f613e0afb31138cb51d022b0e07f94da4.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_58b9f15ce416286c645fe511b47ed99bfa33c3a9.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_50881b6bfd836b92bf069d63dd6f99f815987064.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_a212baa955119ebcd55232eb77841d9befd9ac3d.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_9f61369867acccb15081ec47c77c39872f8fca8f.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_cc035c7f74ddb8966369e2f7fd33aedb1b68a7da.1920x1080.jpg?t=1632826469,https://cdn.akamai.steamstatic.com/steam/apps/596970/ss_db41b2f0d3b82d1a8a657a9b3dd6e96f20adaab7.1920x1080.jpg?t=1632826469",
    "Slug": "sunless-skies-sovereign-edition",
    "Meta Title": "Sunless Skies: Sovereign Edition: Jan 31, 2019, Failbette...",
    "Meta Description": "Looking for information on Sunless Skies: Sovereign Edition? Check out the release date (Jan 31, 2019), developer insights from Failbetter Games, and a ...",
    "Alt Text Image": "Official header image for Sunless Skies: Sovereign Edition game - Steam 596970",
    "Canonical URL": "https://gusku.site/game/sunless-skies-sovereign-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sunless Skies: Sovereign Edition\", \"description\": \"Looking for information on Sunless Skies: Sovereign Edition? Check out the release date (Jan 31, 2019), developer insights from Failbetter Games, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Failbetter Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Failbetter Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/596970/header.jpg?t=1632826469\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}