{
    "AppID": 1451480,
    "Name": "The Greatest Penguin Heist of All Time",
    "Release date": "Jul 2, 2021",
    "About the game": "The Greatest Penguin Heist of All Time is the one and only 1-8 player CO-OP physics-based heist game featuring a bunch of kleptomanic penguins. You'll experience a blend of physics-based platforming with stealth, strategy, and action. You have full freedom to achieve the missions in your own way. About Being inspired by old school stealth and heist games along with modern physics platformers, Penguin Heist aims to breathe new life into the genre with a modern physics engine along with multiplayer. You pick your mission, your loadout, and you set out to find and steal whatever needs to be stolen. Use your tools, weapons, and wit to infiltrate, steal, and exfiltrate as well as you can. Unlock new items by completing challenges and race against the clock to become the best penguin heist team ever. No matter what level of expertise you are on, Penguin Heist will offer a challenge for everyone. If not, you can have fun slapping your friends with bananas and baguettes. Features Online CO-OP with up to 8 people playing together 11 very different maps/heists 100+ weapons and items 90+ clothes and skins 19 unique skins Heist planner with custom loadouts Daily challenges Realistic penguin nooting The Heists Penguin Heist features a variety of heist locations that all have their unique flair. One heist will have you stealing boats full of fish, another might have you stealing valuable works of art, and yet another may require you to kidnap an prized chef. However, it is the job of a penguin to figure out the way that they want to execute their heist. Loud or silent , lethal or non-lethal - there is no right answer... there is only the way you play! Weapon Store As you progress through the game, you will unlock new weapons, tools, and items. These range from normal guns to drones to explosives to food. Each item has a special feature that can be used to complete a heist. See a pair of penguins guarding a door? You can blast them into oblivion with dynamite and a minigun, you can poising them with stinky fish, you can lure them away and sneak in, you can distort gravity and run past... there are more than plenty of ways to play the game, and it's up to you. Get your gear from the Weapon Store. While it has the regular stock guns, you might want to check out the more unconventional weapons and items available . Clothing Store While a penguin can be proficient with every weapon and know heisting in and out, what is a penguin without style? Customize your penguin's skin, headwear, facewear, and clothes. You don't need fancy loot when you've got style... well, you need the loot to buy clothes, but you get it. Please note that this is a physics game. The penguins have simulated joints and the controls are therefore not as responsive as your average game. You may find the controls 'janky', which is completely the result of the physics simulation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1451480/header.jpg?t=1656576213",
    "Price": 14.99,
    "Developers": "That Fish,That Other Fish",
    "Publishers": "That Fish, That Other Fish",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_e0eb16b5045aef75525a3d3007658a2494fac824.1920x1080.jpg?t=1656576213,https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_0fd250216f3afa57f5833769f6b25a7ca0033299.1920x1080.jpg?t=1656576213,https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_56f8d873f5163feee3241db5fadf54170d83efb4.1920x1080.jpg?t=1656576213,https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_8ef01e8d5ada751f6346633baaffe81414d1e2f1.1920x1080.jpg?t=1656576213,https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_458de7a680b0e690df0dd5efb759ba3f2a6bea57.1920x1080.jpg?t=1656576213,https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_790c8fbc41228a0a94d7f27092d8539678f471d4.1920x1080.jpg?t=1656576213,https://cdn.akamai.steamstatic.com/steam/apps/1451480/ss_df2acbb0b3580560191c6226528f225db2c47f5f.1920x1080.jpg?t=1656576213",
    "Slug": "the-greatest-penguin-heist-of-all-time",
    "Meta Title": "The Greatest Penguin Heist of All Time: Jul 2, 2021, That...",
    "Meta Description": "Looking for information on The Greatest Penguin Heist of All Time? Check out the release date (Jul 2, 2021), developer insights from That Fish,That Othe...",
    "Alt Text Image": "Official header image for The Greatest Penguin Heist of All Time game - Steam 1451480",
    "Canonical URL": "https://gusku.site/game/the-greatest-penguin-heist-of-all-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Greatest Penguin Heist of All Time\", \"description\": \"Looking for information on The Greatest Penguin Heist of All Time? Check out the release date (Jul 2, 2021), developer insights from That Fish,That Othe...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"That Fish,That Other Fish\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"That Fish, That Other Fish\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1451480/header.jpg?t=1656576213\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}