{
    "AppID": 1648900,
    "Name": "The Colossus Is Coming: The Interactive Experience",
    "Release date": "Nov 4, 2021",
    "About the game": "It's coming... find the tapes... All seems calm. The multitude of towering trees sway in the breeze. The birds sing for you as if to create perfect harmony. The sun breaks through the leaves above to shine down on you... But something feels wrong. Something is watching you, something omniscient. The feeling that you may not be alone grows ever-stronger. The gentle breeze has become a harsh wind. You can't tell the trees apart from a figure in the distance. What are those sounds? Wait, that gramophone wasn't there before... Oh God... It's coming... From FYRE Games, the developers of the hit narrative game Summerland, comes The Colossus Is Coming: an experimental and abstract narrative experience to go in tandem with the album of the same name by Auric Echoes. You take control of an unnamed protagonist as you uncover the story of a mysterious colossus through a series of cassette tapes. This 15 - 20 minute experience is sure to fill you with a sense of unease and dread. Features: - Beautiful and atmospheric visuals, making full use of the Unity HDRP - An eerie and mysterious story - Haunting sound design, including pieces of music and samples from the Auric Echoes album The Album is also available now to stream on all major platforms! Message from the developer: Hello! My name is Conner Rush, and I'm the creator of FYRE Games, as well as the musician behind Auric Echoes. I'd first just like to take the time to thank all of you for being here and supporting this multi-media passion project of mine. Getting this done through my first year of university has been a challenge to say the least, and I couldn't have done it without you. With that said, if you would like to support me so that I can continue to deliver quality works of art to the public, I've included the full album to purchase as a soundtrack! This would be an incredible help to me as I continue to make music, make games, and continue my education. I truly hope I can continue to make project to make you all proud! Thank you, and enjoy! - Conner Rush",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1648900/header.jpg?t=1636084834",
    "Price": 0.0,
    "Developers": "FYRE Games",
    "Publishers": "FYRE Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1648900/ss_c278af5c5d74301079cff63ea7f27ed1cb2c23f0.1920x1080.jpg?t=1636084834,https://cdn.akamai.steamstatic.com/steam/apps/1648900/ss_76bc84c361a4936149db0b19a2e0a02d5d15215d.1920x1080.jpg?t=1636084834,https://cdn.akamai.steamstatic.com/steam/apps/1648900/ss_6c02947999d31bd3d25cc4b7268dfdcf35cf87c5.1920x1080.jpg?t=1636084834,https://cdn.akamai.steamstatic.com/steam/apps/1648900/ss_870c553246718f137e974a573ad4e4a3a43d8403.1920x1080.jpg?t=1636084834,https://cdn.akamai.steamstatic.com/steam/apps/1648900/ss_e5890b7d90f42c9f5d11822727b41ac345b5a995.1920x1080.jpg?t=1636084834",
    "Slug": "the-colossus-is-coming-the-interactive-experience",
    "Meta Title": "The Colossus Is Coming: The Interactive Experience: Nov 4...",
    "Meta Description": "Looking for information on The Colossus Is Coming: The Interactive Experience? Check out the release date (Nov 4, 2021), developer insights from FYRE Ga...",
    "Alt Text Image": "Official header image for The Colossus Is Coming: The Interactive Experience game - Steam 1648900",
    "Canonical URL": "https://gusku.site/game/the-colossus-is-coming-the-interactive-experience",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Colossus Is Coming: The Interactive Experience\", \"description\": \"Looking for information on The Colossus Is Coming: The Interactive Experience? Check out the release date (Nov 4, 2021), developer insights from FYRE Ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"FYRE Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FYRE Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1648900/header.jpg?t=1636084834\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}