{
    "AppID": 335240,
    "Name": "Transformice",
    "Release date": "Jan 30, 2015",
    "About the game": "Transformice is an MMO Mouse Simulator platformer about dozens of mice running to bring back the cheese, trying to avoid pitfalls, leading to unexpected and hilarious situations! You have less than two minutes to be the first mouse to bring back the cheese by all means, with the Shaman's help or curse within the multiple game modes and millions levels available: no two games are ever the same! In this stupidly fun 'free to win' game with hats, will you survive the cheese quest? Will the Shaman help or ruin everything? Join the 55 million people who already tried! The Mouse Simulator You've Been Waiting For You are a little mouse looking to bring back the cheese; each successfully taken back unlocks more content and levels up your Shaman skills... But will you be able to make it? Things often go disastrously wrong with ridiculous chain reactions full of evil physics. There’s always a trick in these uncaring set-ups! Shaman mouse, Pro Gamer or loser? Good or evil? You're in charge! Every round, one of the player is the almighty Shaman who can use his skills to help his fellow mice get safely to the cheese... or ruin everything? The more mice you save, the faster you will level up in the Shaman's skill trees to build amazing contraptions! Create whatever your imagination can come up with, the fate of the game is at your fingertips. No Two Games Are Alike Will a horde of mice rush in and get everybody killed? Will the Shaman successfully get you to the cheese? Or ruin it all? Will the cannon balls let you? With seven official game modes, 200 official maps, dozens of extra player-made gamemodes and more than 5 million player-made maps, almost endless possibilities await you. Not even counting what you will make thanks to the level editor and LUA modules. Join For the Fun, Stay For the Friends Gather with your friends to play, chat, troll and laugh together. Participate in the upcoming events, create your own tribe and share on the forums. Challenge your friends to get the top titles and then challenge the world by farming your “firsts”! You'll be challenged by dozens if not hundreds of other mice to be the best. The Ethical Free to Play Business Model Transformice is -literally- free to play. HATS! All the items you can buy are and will always be cosmetic: you will never see a gameplay item! Also, 100% of the buyable items are unlockable ingame: that's right, only with your skill you can have them all! Good luck though, some 'master achievements' items are very difficult to get. Every cheese you bring back is added to your wallet: the more cheese you have, the more content you will unlock.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/335240/header.jpg?t=1648153027",
    "Price": 0.0,
    "Developers": "Atelier 801",
    "Publishers": "Atelier 801",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/335240/ss_59c6e2d7220d4ca2af4c1ee12934a8ac641794a9.1920x1080.jpg?t=1648153027,https://cdn.akamai.steamstatic.com/steam/apps/335240/ss_23f0beeaf8590af346d698948f95ca694f01f0c2.1920x1080.jpg?t=1648153027,https://cdn.akamai.steamstatic.com/steam/apps/335240/ss_9ed09db67a3a13a4df3e7e1e94f47b67c152f69a.1920x1080.jpg?t=1648153027,https://cdn.akamai.steamstatic.com/steam/apps/335240/ss_ce92bea130f23a6a6940bf4a26ba81be4b7225a4.1920x1080.jpg?t=1648153027,https://cdn.akamai.steamstatic.com/steam/apps/335240/ss_4d1acae3961d6dd2a7f7c372614b4dd183753dd7.1920x1080.jpg?t=1648153027,https://cdn.akamai.steamstatic.com/steam/apps/335240/ss_dd7519fbd9b248042a46247b99d82ad8df0a90d5.1920x1080.jpg?t=1648153027",
    "Slug": "transformice",
    "Meta Title": "Transformice: Jan 30, 2015, Atelier 801 and Full Overview",
    "Meta Description": "Looking for information on Transformice? Check out the release date (Jan 30, 2015), developer insights from Atelier 801, and a complete game summary.",
    "Alt Text Image": "Official header image for Transformice game - Steam 335240",
    "Canonical URL": "https://gusku.site/game/transformice",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Transformice\", \"description\": \"Looking for information on Transformice? Check out the release date (Jan 30, 2015), developer insights from Atelier 801, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Atelier 801\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atelier 801\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/335240/header.jpg?t=1648153027\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}