{
    "AppID": 1759640,
    "Name": "Underground Life",
    "Release date": "Apr 19, 2022",
    "About the game": "Underground Life is an open world game where the main objective is to survive in a post-apocalyptic world by gathering resources, crafting weapons and armour and interacting with all kinds of characters. Plot: The year is 2045, the world has been destroyed by meteors and nuclear warfare. 80% of the planet is filled with radiation and contamination. There are few survivors, one of which is you. You managed to survive in a bunker which has since been destroyed by recent events. Life on the outside is almost impossible. Most of the animals have died and the survivors have migrated underground. Now your job is to find resources while living underground. Are there survivors left? Will humanity go extinct? or will they survive at all costs? MANAGE YOUR OWN SHELTER: Craft weapons, armor, expand your shelter, improve your skills and manage your resources to survive as long as possible. You'll need an electrical generator, a water purifier, a refrigerator to prevent food from spoiling, and plenty of chests to store your items. You can decorate your shelter as you like by placing pictures, floor tiles and plants of all kinds. FIGHT AGAINST DIFFERENT CREATURES AND LEVEL UP: Enjoy the large number of biomes and places at Zero Area, a gigantic continent divided by several towns where you will face many creatures and bosses. Explore caves, dungeons, swamps, grasslands, woods, deserts, radioactive zones and much more. You can find secrets, treasures and many collectibles. GROW YOUR OWN FOOD: You can manage your own farm by raising animals such as cows, rabbits, sheep or chickens. If you want to grow your own food to satisfy your hunger, go to Brad, the farmer and buy lots of seeds. Don't wait for winter to come! MEET THE TOWN CHARACTERS AND VISIT THEIR SHOPS: There are plenty of merchants and villagers in Desolate Village who are willing to reward you if you do some quests. Improve your relationship with them to get discounts and great rewards in their stores. You can steal items from some of them. Be careful!, you can go to jail. Get into this new adventure. Explore many places as you level up, craft weapons and armor, gain resources from the environment, and upgrade your shelter to survive as long as possible. Are you prepared for the dangers that await you?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1759640/header.jpg?t=1651072917",
    "Price": 7.99,
    "Developers": "Remainder Studios",
    "Publishers": "Remainder Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1759640/ss_974b8a0f5dd2daf4fa363a7eec59a729613e532f.1920x1080.jpg?t=1651072917,https://cdn.akamai.steamstatic.com/steam/apps/1759640/ss_e3d0eb6649e1887f6725a4f6a86ea10101655c5d.1920x1080.jpg?t=1651072917,https://cdn.akamai.steamstatic.com/steam/apps/1759640/ss_6a90aadbe66588b6c865c92703f3844cc874bb9c.1920x1080.jpg?t=1651072917,https://cdn.akamai.steamstatic.com/steam/apps/1759640/ss_e47338a1965aef23dca1737b6b888d3a58f0402b.1920x1080.jpg?t=1651072917,https://cdn.akamai.steamstatic.com/steam/apps/1759640/ss_9a81a969116411987ccf2c7c40ecfce28141fe88.1920x1080.jpg?t=1651072917,https://cdn.akamai.steamstatic.com/steam/apps/1759640/ss_8b4056a1c79cd0cf62b0a47082c20a65702c85fd.1920x1080.jpg?t=1651072917",
    "Slug": "underground-life",
    "Meta Title": "Underground Life: Apr 19, 2022, Remainder Studios and Ful...",
    "Meta Description": "Looking for information on Underground Life? Check out the release date (Apr 19, 2022), developer insights from Remainder Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Underground Life game - Steam 1759640",
    "Canonical URL": "https://gusku.site/game/underground-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Underground Life\", \"description\": \"Looking for information on Underground Life? Check out the release date (Apr 19, 2022), developer insights from Remainder Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Remainder Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Remainder Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1759640/header.jpg?t=1651072917\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}