{
    "AppID": 375210,
    "Name": "Unveil",
    "Release date": "Apr 19, 2016",
    "About the game": "NOTICE: The game may not work on some system configurations. The problem is rare, but we have some reports. This is an engine issue (RPG Maker and MKXP) and it's out of our reach, since we only made the game, not the engine underneath. Feel free to purchase the game and if you happen to be one of those cases, go ahead and refund it right away. We apologize for any inconveniences. Authentic Survival in Nature Survival in it's purest form, in a deeply simulated world, modeled after nature itself. Energy preservation Every step you take and every action you peform costs Energy, you can only replenish by ingesting food. If you run out of Energy, you run out of luck. Setup traps to catch wild animals, fish fresh fish, or harvest and replant plants.  Cook fat or eat worms if you have to. Rehydration Your body spends water to function, and also to sweat, the only mechanism to cool the body off. Water is life. They say it for a reason. Find fresh water, refill water containers, collect rain water, or produce it from air humidity or salt water. Body temperature High temperatures and dry air increase water loss, while low temperatures can cause sickness or even the body to shut down. Adapt or be left behind. Shelter from cold or intense sun. Wear clothes to protect from rain, sun or to warm up. Relocate if suited by season. Simulation: A true model of nature Planet rotation Earth tilt, spin and rotation simulation defines sun altitude, allowing for a great diversity of survival locations by latitude. Survive near Equator for a permanent summer, or close to the Pole to survive nights that last an entire season. Weather cycle From water evaporation to cloud formation, thunderstorms, hail, atmospheric pressure differences, dried rivers or snow. The robust Weather cycle simulator recreates true, ever changing climatic conditions to put yur instincts to test. Fauna Fishes and small land animals grow and reproduce. Animals can get pregnant, overpopulate or get extint. Sustainable survival is key for yourself, the environment, and yourself again. Flora Photosynthesis, water absorption, fertilization, hibernation. Plants react to sun and soil humidity as you would expect. Plant, care and harvest fruits for a slower paced, safer, long term survival. Fire Fire burns fuel, based on fuel quantity, wind speed and humidity. Fire increases ambient temperature of small caves. Fire and heat behaves realistically to make concious choices based on real life behaviors. Body temperature Temperature asimilation and air dissipation rate based on air humidity, wind speed and temperature. The body will Shiver or Sweat to regulate it's temperature, and keep the skin moist if hot dry air rips it away. On going development The game is out there and finished. Yet, it isn't 'finished'. Now more than ever we want your feedback on balance, new features and content. We want to make the game of your dreams. Learn more at unveilgame.com - Features overview - Full list of features in Unveil",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/375210/header.jpg?t=1560479695",
    "Price": 14.99,
    "Developers": "Particle Studios",
    "Publishers": "Particle Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_ca347e8c5df4cc90f984f5c6e1406191e664da8f.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_014c585f3b49c62be479edc3f3d4ae27ec45502e.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_b785a93c3bdadbb1d8ec9802804649162aa24e18.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_de73d1cba884c753dff56a916262a50b0b06cc65.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_4ed02eb053ebc054ae104535059783e48fe3f95a.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_6da2ddd42eaa3d8456ac0a456a6ddfcee735cf85.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_94767cf87f6e0275648bd3d0f13379c5444768fc.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_7504de0d18883ed1b565998ef21fae035b671a8a.1920x1080.jpg?t=1560479695,https://cdn.akamai.steamstatic.com/steam/apps/375210/ss_30b46cdec38675a86c7ec17517b758b05a0ed80f.1920x1080.jpg?t=1560479695",
    "Slug": "unveil",
    "Meta Title": "Unveil: Apr 19, 2016, Particle Studios and Full Overview",
    "Meta Description": "Looking for information on Unveil? Check out the release date (Apr 19, 2016), developer insights from Particle Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Unveil game - Steam 375210",
    "Canonical URL": "https://gusku.site/game/unveil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unveil\", \"description\": \"Looking for information on Unveil? Check out the release date (Apr 19, 2016), developer insights from Particle Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 19, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Particle Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Particle Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/375210/header.jpg?t=1560479695\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}