{
    "AppID": 529020,
    "Name": "Virtual-O",
    "Release date": "Dec 7, 2016",
    "About the game": "Virtual-O is a new game that brings you the adventures of Orienteering without the need of going to faraway places. Nature will be your only enemy as you will try to navigate the Unknown using map and compass. And as you will come to realize, environment itself can be a really formidable opponent on its own. What is orienteering Orienteering is a sport in which the athletes use a map and a compass to navigate between checkpoints - called controls - in diverse and unfamiliar terrain. The history of orienteering began in the late 19th century in Sweden, where it originated from military training. The actual term 'orienteering' was first used in 1886 at the Swedish Military Academy Karlberg and referred to the crossing of unknown land with the aid of a map and a compass. As an athlete you must navigate through the entire course from start to finish, visiting all the controls in order. To win, you must successfully decide on the fastest routes between controls, and do so quickly. Choosing an inefficient route can cost you valuable seconds, or even minutes. And you must execute your plan, running through the terrain while using your map reading skills to keep your bearings.. Orienteering can be a lifesaving skill Getting lost in the wilderness can put you in a life threatening situation. Knowing how to navigate with a map and a compass is not only cool; such skills can and often do save lives. Realistic simulation The main objective for Virtual-O is to create a full featured orienteering/navigation simulator that will be accessible for all people – from novice to top level – to improve their navigational skills. It should be sufficiently realistic to provide useful practice even for elite orienteers. Key points include: Realistic running speed model. All features of the terrain affect your running speed in a realistic manner, making the route choice an important decision Full day and night cycle Living and breathing environment Realistic simulation of compass and map Virtual terrains made from laser scans and orienteering maps of real world terrains State of the art real world terrains Worlds in Virtual-O are generated from real orienteering maps. They are among the most detailed of any type of map. Here are some features of the rocky map seen in the trailer: Terrain is created from laser scanned data of the area (LIDAR) All objects in the terrain (trees, bushes, rocks, paths etc.) are generated based on the input orienteering map. Contains over 45 000 trees and bushes All of this results in an astounding amount of detail that corresponds very well to the real world terrain. New challenges As your navigation skill improves, you can try new challenges: Night orienteering Create your own courses Train without a compass Special training with limited map (for instance using only contours for navigation) Easy to learn? Orienteering is a wonderful sport. But mastering the required skills is not easy. Virtual-O is prepared to help you. You can start with a tutorial or use the provided system of map assistants that will help you handle the map and keep your bearings while taking your first steps into the world of orienteering. It's a system similar to driving assistants in formula/car simulations. You can disable these when you feel you are ready. Virtual-O supports three different game speed modes to satisfy all levels of players Press or read something that was written about Virtual-O -o-your-only-weapons-are-a-map-and-a-compass/ References 1. History of orienteering wiki",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/529020/header.jpg?t=1517493145",
    "Price": 39.99,
    "Developers": "Contours",
    "Publishers": "Contours",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_07c5bbc5d8cb3f3feb5890d85a3676ac33d05067.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_95d9aeb1631d752f7ef1f06c78a6b8556fb4a430.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_e149282042f0bc584bc3a1cc6268ae757eb1dd94.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_7fba58197893c3b5a06321de8faf938f9b6585bd.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_c65cfe714f1334da82d16dc520c378d4f87599db.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_d34da1dfe294737a54baaa78800e5ad50db9e36c.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_3981fc2c4648de218013214ab7841ca3347bfa8c.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_6d93c308d91d9e5f86f302ae6486814ba287369f.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_28f09354c9adfdb13bcb154f706d4e1343843a23.1920x1080.jpg?t=1517493145,https://cdn.akamai.steamstatic.com/steam/apps/529020/ss_0fc7c7af474edb1f63b81a9853a4fbed8f133034.1920x1080.jpg?t=1517493145",
    "Slug": "virtual-o",
    "Meta Title": "Virtual-O: Dec 7, 2016, Contours and Full Overview",
    "Meta Description": "Looking for information on Virtual-O? Check out the release date (Dec 7, 2016), developer insights from Contours, and a complete game summary.",
    "Alt Text Image": "Official header image for Virtual-O game - Steam 529020",
    "Canonical URL": "https://gusku.site/game/virtual-o",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Virtual-O\", \"description\": \"Looking for information on Virtual-O? Check out the release date (Dec 7, 2016), developer insights from Contours, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 7, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Contours\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Contours\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/529020/header.jpg?t=1517493145\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}