{
    "AppID": 347730,
    "Name": "Wait - Extended",
    "Release date": "Oct 29, 2015",
    "About the game": "'Wait' is a mystery horror game, inspired by the works of H.P Lovecraft and the Silent Hill series. The gameplay is put together by elements of exploration and riddle solving. We want to offer a different kind of horror. A horror without jump scares or fighting monsters, but with the fear of the unknown and unimaginable. What is 'Wait'? The game is all about atmosphere and we wanted to support that by giving the player the opportunity to interact with almost every object at different times during the game. It's about exploration and discovering what is happening around you. Everything in 'Wait' is experienced by a young man, the player knows nothing about. And it's intended to be that way. You are literally thrown into another mans life and you can find out more about who that man is, by exploring. His behaviour, his characteristics are slowly revealed through interacting with objects or continuing with the story. 'Wait' may be inspired by the Cthulhu mythos created by Howard Phillips Lovecraft, but doesn't actually take place in it. There are some references here and there, but what was most important to us was the feeling and the atmosphere Lovecraft created in his stories - the fear of the unimaginable. About the project We originally created 'Wait' for the 2014 Indie Game Maker Contest. It was a contest in which you had 4 weeks to create a game, using any official engine. Since the contest was hosted by the RPG Maker Team we decided to go with their engine. Although the engine was made for roleplaying games, we saw potential for an adventurous horror game. During development we grew fond of our little project and once the contest was over we didn't want to let go. There was still so much we wanted to implement, but due to the time limit of 4 weeks we could only do about half of it. That's when we decided to do an extended version to 'really' finish the game, add more details, enhance some visuals, erase plot holes and add some more story content. But that's all just supplementary. 'Wait - Extended' has the following features: Features: Atmospheric exploration gameplay Alternative endings Dynamic replayability (Successive playthroughs will not be same) Achievement system Hidden storylines We hope you will have as much fun with 'Wait', as we have working on it. Every feedback is much appreciated. Our website: /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/347730/header.jpg?t=1572804743",
    "Price": 7.99,
    "Developers": "rest.less Games",
    "Publishers": "rest.less Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/347730/ss_47c0b9bd2830feb9b69ebe2449ce2807be1edaef.1920x1080.jpg?t=1572804743,https://cdn.akamai.steamstatic.com/steam/apps/347730/ss_4b9a258bb82489c2ed8c8792d9009d17f6c5d404.1920x1080.jpg?t=1572804743,https://cdn.akamai.steamstatic.com/steam/apps/347730/ss_4717f5fe2e832b5abbdc0893d180a1dc942f80e6.1920x1080.jpg?t=1572804743,https://cdn.akamai.steamstatic.com/steam/apps/347730/ss_3c14cbfabd0ccec8dee5088d547f3d2593b7cef3.1920x1080.jpg?t=1572804743,https://cdn.akamai.steamstatic.com/steam/apps/347730/ss_ad11b3f8a0828ac1b5796b7ea3ad209ac59e13cf.1920x1080.jpg?t=1572804743,https://cdn.akamai.steamstatic.com/steam/apps/347730/ss_c8d81951ceed0ccc4b966af8f9bc6b016e825a5d.1920x1080.jpg?t=1572804743",
    "Slug": "wait-extended",
    "Meta Title": "Wait - Extended: Oct 29, 2015, rest.less Games and Full O...",
    "Meta Description": "Looking for information on Wait - Extended? Check out the release date (Oct 29, 2015), developer insights from rest.less Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Wait - Extended game - Steam 347730",
    "Canonical URL": "https://gusku.site/game/wait-extended",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wait - Extended\", \"description\": \"Looking for information on Wait - Extended? Check out the release date (Oct 29, 2015), developer insights from rest.less Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"rest.less Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"rest.less Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/347730/header.jpg?t=1572804743\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}