{
    "AppID": 466130,
    "Name": "White Day: A Labyrinth Named School",
    "Release date": "Aug 22, 2017",
    "About the game": "Steel your nerves for a Korean horror without equal! Step into the shoes of student Hee-Min Lee and brave the terrors of Yeondu High School in a terrifying survival horror game filled with puzzles, secrets and - of course - deadly ghosts. SYNOPSIS Prepare yourself for one of the most chilling games ever created! On the eve of gift-giving holiday White Day, new Yeondu High School student Hee-Min Lee slips into school to hide a box of candies for the girl of his dreams. But when the school shutters slam shut, he finds himself trapped in the building overnight, hunted by a killer janitor and haunted by the troubled souls of the dead. Playing as Hee-Min Lee, can you remain hidden, solve the clues and uncover the dark secrets of the building's past to survive the deadly threats? Or will the after-class horrors claim your life before you can escape? With no weapons to defend yourself there’s zero room for error in this tense, stealth-based scarefest brimming with secrets and multiple endings. FEATURES A Classic Horror For A New Generation: The notorious 2001 first-person Korean survival horror considered by original fans to be one of the scariest games ever made returns by popular demand. Completely rebuilt for modern gamers, and finally localized for a western audience, White Day: A Labyrinth Named School is a true videogame nasty Spine-Tingling Story: Trapped inside your school at night, you and your fellow classmates must carefully explore the twisting corridors by torchlight, hiding from possessed stalkers and running from evil spirits as you try to escape. With branching dialogue, collectable ghost stories hidden scares, White Day: A Labyrinth Named School demands to be played with headphones on and the lights off Multiple Endings: Your actions determine where the story goes! Shape your relationship with the other students trapped inside the school to save or sacrifice your friends on the way to unlocking the nine different endings Mind-Bending Puzzles: Thanks to an environment filled with classically-styled survival horror puzzles, White Day tests your brain as much as your run button. Collect items, solve riddles and race against the clock to save your friends from certain doom and unpick the secrets of the school Cheaters Never Prosper: This school’s wise to those who want to take shortcuts! Puzzle solutions change every time, so pack away all thoughts of skipping the scary bits with a guide Innovative Dynamic Scare System: Want to just absorb the story? Play on Very Easy to enjoy the adventure without the challenge. Eager to prove your bravery? Increase the difficulty setting to ramp up the scares and ghost activities, with hauntings ready to spring when you least expect it Traditional Survival Horror Mechanics: Resource-based save points and limited healing items guarantee an edge-of-your-seat thrill ride that takes no prisoners New Features: As well as all-new visuals and audio effects, discover a brand-new character, scenario, reimagined ghosts and special endings created specifically for this remake",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/466130/header.jpg?t=1644403606",
    "Price": 29.99,
    "Developers": "SONNORI Corp",
    "Publishers": "PQube,SONNORI Corp",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_f4b48bfa2dae5bb963cfcb24b188f569ef462111.1920x1080.jpg?t=1644403606,https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_83e9c6b858869f05e2924661a28728eb7d7b764a.1920x1080.jpg?t=1644403606,https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_b3a8e83277ce66d127e7953e2ee051f846b3c72c.1920x1080.jpg?t=1644403606,https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_47201c2368cb7458931e994ab1585cf02edaad96.1920x1080.jpg?t=1644403606,https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_b58c448b7aa45eb64428d7177b849232249f54a7.1920x1080.jpg?t=1644403606,https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_2b8aa5223fe8d7a100aae2eb4923e6247762ddbf.1920x1080.jpg?t=1644403606,https://cdn.akamai.steamstatic.com/steam/apps/466130/ss_f4ddbae7e5bfbef727591c03ef63606b47f50546.1920x1080.jpg?t=1644403606",
    "Slug": "white-day-a-labyrinth-named-school",
    "Meta Title": "White Day: A Labyrinth Named School: Aug 22, 2017, SONNOR...",
    "Meta Description": "Looking for information on White Day: A Labyrinth Named School? Check out the release date (Aug 22, 2017), developer insights from SONNORI Corp, and a c...",
    "Alt Text Image": "Official header image for White Day: A Labyrinth Named School game - Steam 466130",
    "Canonical URL": "https://gusku.site/game/white-day-a-labyrinth-named-school",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"White Day: A Labyrinth Named School\", \"description\": \"Looking for information on White Day: A Labyrinth Named School? Check out the release date (Aug 22, 2017), developer insights from SONNORI Corp, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"SONNORI Corp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PQube,SONNORI Corp\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/466130/header.jpg?t=1644403606\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}