{
    "AppID": 1404010,
    "Name": "A Knight Never Yields",
    "Release date": "Feb 25, 2021",
    "About the game": "A Knight Never Yields is a 3D fantasy platformer where blindness takes the center stage. First you pass each level with your vision intact - learn placement of the traps and what you have to do to beat them. Then the real task begin - finish the same level with same traps completely blinded. Use your memory and your hearing - every level has it's own distinct music and rhythm that will guide you and warn you about upcoming dangers. Listen, focus and be prepared to fail. Many, many times. Afterall, you are going into this game without a sense you rely on the most in your life. Unique gameplay that takes your vision away - finish each level blinded Use your hearing, sense of rthythm and memory to progress in the game Acquire new skills to overcome deadly traps Push through 17 handcrafted levels Follow a personal story in a world that is not what it seems Gain mastery and unlock achievements that reward precise playstyle Realised vision of a single creator responsible for the whole game The castle is an old ruin, older than anyone remembers. It had many owners in the past, now it houses Order of a Blind Knights, mysterious group tasked with fighting Eternal Darkness. The many still functioning traps and contraptions are perfect for training new apprentices. Beacuse of that, each level poses danger that is difficult to overcome by itself - double so when you have to do it blinded. Luckily, you can count on several things to help you. Using your memory you can learn and remember placement of all traps. Listening to the music and sounds of the castle warns you about incoming danger. Pulsing metronome helps you with rhythm of every level. Yes - every level has it's rhythm and it is the key to finishing the level. You are put into shoes (and armor) of a young apprentice simply called The Kid. He is the one going through all the dangers, trapping and trials of an old and crumbling castle. The think is, he doesn't remember how he got there. He didn't lose his memories, he just... doesn't know where he came from and how he ended up in this strange place. He meets an unlikely patron - a mysterious shrouded man takes him under his protection and guides him on his path. He talks about Eternal Darkness, Order of Blind Knights and inescapable destiny calling. The Kid is unsure and confused - in fact, he is sure he doesn't want any of this. But it dawns on him there might be no other choice... A Knight Never Yields follows a story of bravery, discovery and acceptance in a world that might be not what it seems at a first glance. It's up to you to discover it's secret.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1404010/header.jpg?t=1614243378",
    "Price": 6.99,
    "Developers": "Bread Over Games",
    "Publishers": "Bread Over Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1404010/ss_a7afb944ada78e78d87cb84fc4243afa25cae2ba.1920x1080.jpg?t=1614243378,https://cdn.akamai.steamstatic.com/steam/apps/1404010/ss_0b1e3282182254d0ac2d8437c94f39eeb124ae4d.1920x1080.jpg?t=1614243378,https://cdn.akamai.steamstatic.com/steam/apps/1404010/ss_a0f0b66b5ff8d94fc26fc6e2107a1dafd05a35b1.1920x1080.jpg?t=1614243378,https://cdn.akamai.steamstatic.com/steam/apps/1404010/ss_9c189157f031a6aabbb6cc72ad4b4edecb4813ed.1920x1080.jpg?t=1614243378,https://cdn.akamai.steamstatic.com/steam/apps/1404010/ss_b69875c595d5aaee66235e6af9a515e330149644.1920x1080.jpg?t=1614243378",
    "Slug": "a-knight-never-yields",
    "Meta Title": "A Knight Never Yields: Feb 25, 2021, Bread Over Games and...",
    "Meta Description": "Looking for information on A Knight Never Yields? Check out the release date (Feb 25, 2021), developer insights from Bread Over Games, and a complete ga...",
    "Alt Text Image": "Official header image for A Knight Never Yields game - Steam 1404010",
    "Canonical URL": "https://gusku.site/game/a-knight-never-yields",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Knight Never Yields\", \"description\": \"Looking for information on A Knight Never Yields? Check out the release date (Feb 25, 2021), developer insights from Bread Over Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bread Over Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bread Over Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1404010/header.jpg?t=1614243378\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}