{
    "AppID": 410290,
    "Name": "Acorn Assault: Rodent Revolution",
    "Release date": "Mar 2, 2016",
    "About the game": "Acorn Assault is a quirky, tail-bobbing turn-based strategy game. Raise an army, overthrow a tyrant King and save the oppressed squirrels! Do you have what it takes to start a Rodent Revolution? The squirrels of the forest grew poorer and more starved each day that passed thanks to the tyrant King Lois the Umpteenth. It is up to you to raise an army to overthrow the king and set the world right again. Embark on an nutty journey filled with a strange cast of characters through a historically inaccurate retelling of the French Revolution with squirrels. If you are a fan of turn based strategy games and want something different from the status quo, this game is for you. The deceptively simple to learn rules of the game lead to a varied set of strategies that you can employ to defeat your enemy and march on. Features Battle through an epic journey against five unique bosses each with their own abilities and environments. Enjoy quirky, hand-made immersive artwork and animations! Test your strategies and do battle in 25 epic levels. Take control of your enemies: play as defeated single-player enemies in online multiplayer mode! Bring the fight online and battle people from around the world on PC and Mac. Story King Lois the Umpteenth and his queen Marie Antoinutte reigned over the poor and starved squirrels of the forest. The king's greed knew no bounds and set out to bankrupt his people by taxing their hard earned acorns. With no acorns to any of the peasant's names they grew angrier and angrier as each day passed. On one cold dark evening, the King had sent his loyal tax man to collect the acorns from Charles DeMontequirrel who had refused to pay the unjust nut tax. As the tax man knocked on Charles' wooden door it swung wide open. Charles stood before the tax collector visibly upset as he was scolded for not following the king's unfair decrees. Charles could no longer simply refuse to pay up and wanted only to set things right. He snatched the legal document the collector shoved in his face and tore it to pieces. A call to arms was made and a skirmish set outside of Charles' house as he began his battle with the tax man and set forth on his rodent revolution upon the king and his men. Do you have what it takes to start a revolution?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/410290/header.jpg?t=1614781779",
    "Price": 9.99,
    "Developers": "High Tale Studios",
    "Publishers": "Plug In Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_6692ae0d34312e0baa265d32b1a938a17540c9ca.1920x1080.jpg?t=1614781779,https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_27ec8515e24023641a30be9ffb58d5102a487e88.1920x1080.jpg?t=1614781779,https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_dd038fbfdee13d8e1448bc12358283aa18c2ef2e.1920x1080.jpg?t=1614781779,https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_0e6e52d8f15742cf3781c7c208ec4c65e855490f.1920x1080.jpg?t=1614781779,https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_9489be035ee078348741bb48841cff3e5a044199.1920x1080.jpg?t=1614781779,https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_48507836dadca0d56fe0b54e07082b0d86247233.1920x1080.jpg?t=1614781779,https://cdn.akamai.steamstatic.com/steam/apps/410290/ss_2d0226b132ba91dbc6ed49a0b275a29574872aeb.1920x1080.jpg?t=1614781779",
    "Slug": "acorn-assault-rodent-revolution",
    "Meta Title": "Acorn Assault: Rodent Revolution: Mar 2, 2016, High Tale ...",
    "Meta Description": "Looking for information on Acorn Assault: Rodent Revolution? Check out the release date (Mar 2, 2016), developer insights from High Tale Studios, and a ...",
    "Alt Text Image": "Official header image for Acorn Assault: Rodent Revolution game - Steam 410290",
    "Canonical URL": "https://gusku.site/game/acorn-assault-rodent-revolution",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Acorn Assault: Rodent Revolution\", \"description\": \"Looking for information on Acorn Assault: Rodent Revolution? Check out the release date (Mar 2, 2016), developer insights from High Tale Studios, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"High Tale Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Plug In Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/410290/header.jpg?t=1614781779\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}