{
    "AppID": 763320,
    "Name": "Advanced Mechanized Spacecraft",
    "Release date": "Jan 1, 2018",
    "About the game": "Advanced Mechanized Spacecraft is physics based action rogue-like/RPG with 3D graphics. In this game you build your own ship, explore huge procedural maps, and battle computer controlled enemy ships entirely made out of components that you can salvage and put on your ship. At this time the 1st of 3 planned episodes, 'The Golden Pyramid Portals' is released. Ship Building Fully integrated and seamless ship construction, as soon as components are detached from an enemy ship they can be equipped onto yours. Over 80 types of components that can be welded to your ship, including; Shields, Railguns, EMP Launchers, Missile Launchers, Lasers. Multiple configurations for most weapons. Melee weapons, including; Spikes, Pikes, Razor Armour, and Spinning Saws. Articulating pieces like Powered Hinges, Hydraulic Extenders, Sliders, and Chain Links. Modular damage and power system. Sensors that when tripped can activate your weapon &amp; defense systems, cause a set of jaws to close shut, immediately use a special ability, etc. Interactive tutorial to get you started. Game Modes Roguelike mode: Permadeth, no levelling/XP system, specials are randomly dropped by defeating enemies. All enemies are roughly the same level, bosses are a little stronger. Good ship design in this mode is key. RPG mode: Experience system, specials unlocked by levelling up and defeating bosses. Enemy levels and boss levels increase as you make your way through the game. Ship building mode: Freely build and test ships without any restrictions, outside of your active games. 8 enemies of varying sizes and types are also available to test against in this mode, these enemies can also be found in the wild during a normal game. Secondary Missions &amp; Space Stations As well as the primary missions (bosses), there are now secondary missions which can help you level up faster and get higher level and harder to get components as rewards. There are missions available from every space station, and roughly 25 space stations (one in each area) in each game. Missions get replenished as you go through them, and are randomly generated and scaled based on the difficulty of the area you are in. You can either take a set amount of gold for completing a mission, or gamble for a better prize. Cargo missions: Attach cargo containers to your ship, fly them safely to the destination space station to get a reward. Hunt missions: Destroy a certain number of a type of drone ship in the target area to get a reward. Trophy missions: Take a specific type of ship component from an enemy ship in the target area, and return with them to exchange them for a reward. Freight ships: Over 200 freight ships flying around all at once in the map. You can trade with them, and they can be useful in finding space stations you haven't discovered yet. You can also use gold to buy items from Freight ships if you don't have what they're looking for in trade. Enemies/AI Over 50 AI controlled drone ships to battle and salvage from. Each one is made entirely out of components that can be placed on your ships, and many have special abilities that you can unlock. Enemy ships now have pack dynamics, and each one has a different personality. Sometimes they will fight themselves if one accidentally attacks the other. 7 bosses Shield Generation Stations to destroy to get get access to bosses Blueprints/Steam Workshop Create and test blueprints outside of a save game, and save them to your library. Download blueprints from the Steam Workshop into your library, and publish your blueprints to the Steam Workshop Import/export blueprints from/to your library and your save game libraries, instantly build blueprints in-game if you have the right materials. More 18 special abilities to give you an edge, including Torpedo, EMP missile, Shockwave, Singularity. Huge procedural generated maps to explore. 4 page inventory to store extra components and crafting materials. Crafting system, where elements are stored in stacks in your inventory and blueprints are unlocked by melting down components. Space life forms that spawn between battles and like to examine salvage (and you, if you get too close to them). Music Credits Zamaster - 'BSW:R Theme', 'Dreamatron', 'SpaceBlox' DotStarMoney - 7 tracks",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/763320/header.jpg?t=1572311136",
    "Price": 12.99,
    "Developers": "Chadams Studios",
    "Publishers": "Chadams Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_7909ad18ea13227677c156b344c42d9cbd71ab83.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_096c3f0d24fe92302844f3b102d46729a66684c5.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_2be2f9411c0116ed31464dc5ef14980637e67879.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_5894724946d9df3a25a3c51ac73b455f8bf4ea01.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_06b0f793ebca2823358aa940c1922006699439fa.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_d11d22b796ddce14f18625f0e1ec62398b815650.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_c6c5f96e83da8680bb2b35b4d246c684ff9c0121.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_6940c23dc87515daaa17df670073e705898dface.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_bcfba1399384aefaf63b5b24e089f728228f5bdb.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_c21dd4120de6958a066354286f6c18915ba499fb.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_8fde8b5dd6c98980f849b209c199535abf55efdf.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_fcb7e2db78a11d2affeb31852e129fbc1af1343d.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_9c004069032fdb77d25d866d1aacdd1a11053b7d.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_ce55bbc5503a9f5ebe017ce1a681f24ae23d0c40.1920x1080.jpg?t=1572311136,https://cdn.akamai.steamstatic.com/steam/apps/763320/ss_d1d9db2a6ec08efa1bc4d3764766212fbd72f6c8.1920x1080.jpg?t=1572311136",
    "Slug": "advanced-mechanized-spacecraft",
    "Meta Title": "Advanced Mechanized Spacecraft: Jan 1, 2018, Chadams Stud...",
    "Meta Description": "Looking for information on Advanced Mechanized Spacecraft? Check out the release date (Jan 1, 2018), developer insights from Chadams Studios, and a comp...",
    "Alt Text Image": "Official header image for Advanced Mechanized Spacecraft game - Steam 763320",
    "Canonical URL": "https://gusku.site/game/advanced-mechanized-spacecraft",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Advanced Mechanized Spacecraft\", \"description\": \"Looking for information on Advanced Mechanized Spacecraft? Check out the release date (Jan 1, 2018), developer insights from Chadams Studios, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chadams Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chadams Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/763320/header.jpg?t=1572311136\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}