{
    "AppID": 828800,
    "Name": "Artipic",
    "Release date": "May 7, 2018",
    "About the game": "Excellent tools to perfect your great shots! Artipic is a multi-platform image editing system that allows you to quickly and easily edit, retouch, compose and distribute your pictures and photos. - Are you an amateur or professional photographer? - Do you take a lot of great photos when traveling? - Do you want to edit those using professional tools and publish online? - Are you tired of paying a fortune for graphics packages where you never use 80% of the functionality? Then Artipic is the way to go! With Artipic you can work up your pictures like a pro: - Enhance and retouch your pictures using a professional tool set. - Compose your best photos and designs. - Distribute your art to surprise your network with your sense of style and creativity. Artipic features: 1. Rich set of tools for painting and transformations. Artipic features quite an extensive array of editing functions and components, ranging from the more common (select, crop, rotate, stamp, color picker, apply text, or red-eye reduction), to the more professional-oriented ones for retouching and compositions such as fully customizable brushes, special tools (blur/healing brush), layers and masks, gradients, shapes and paths. 2. Filters and adjustments to enhance your great shots. Artipic allows you to adjust your photos for a greater look by applying a wide set of adjustments (‘Brightness &amp; Contrast’, ‘Hue &amp; Saturation’, ‘Curves‘, ‘Color Balance‘, ‘Gamma Correction‘, ‘Color Temperature‘, ‘Tint‘, ‘Color Enhancer‘, etc.) and filters (‘Smoothen’, ‘Sharpen’, ‘Vignette’, ‘High Pass’, ‘Diffuse Glow’, ‘Shadow’, ‘Gaussian Blur’, etc.). 3. Reversible Stylization. Style Module allows managing presets of effects (all the image adjustments, filters and effects mentioned above) and applying them to images without affecting the source. The effects are ‘real-time’, so you can continue editing picture (painting, etc.) with the effects constantly applied. 4. Batch Processing. Batch Module empowers to format large numbers of images by applying predefined action sets. Automatically adjust and upload your images for further distribution (be it Instagram or an e-commerce CMS platform) with a single click. 5. Well-structured look. The main window of Artipic comprises the working area, where you can open and manipulate with your photo while the ribbons and panels keep various other functions handy. Both ribbons and panels can be integrated or separated from the main screen, as well as closed if no use for them. 6. Easy to learn and use. Using Artipic is easy. If you have worked with similar tools in the past, you will find Artipic familiar, as it keeps in tune with the pattern set by graphic editors in general. 7. Well-rounded photo editor to try. To summarize, Artipic is a high-level photo editor that can equally serve both novices and experienced photo lovers in enhancing their pictures. Artipic offers powerful functions and tools, but spares you from complex aspects.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/828800/header.jpg?t=1575577184",
    "Price": 29.9,
    "Developers": "Artipic AB",
    "Publishers": "Artipic AB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/828800/ss_679755be1ab2b940aec4657da0f2fc309ec36566.1920x1080.jpg?t=1575577184,https://cdn.akamai.steamstatic.com/steam/apps/828800/ss_88e13cf267171cc1ffed6343c095de30fe6afe83.1920x1080.jpg?t=1575577184,https://cdn.akamai.steamstatic.com/steam/apps/828800/ss_9c0a9617c3288a69114dcbd682bfe9953cb892a8.1920x1080.jpg?t=1575577184,https://cdn.akamai.steamstatic.com/steam/apps/828800/ss_c0f4e8c571ad453f9f01b504036edca6a59d83ae.1920x1080.jpg?t=1575577184,https://cdn.akamai.steamstatic.com/steam/apps/828800/ss_7ebaa940f8452ecf64fd3e79203de9287527332c.1920x1080.jpg?t=1575577184",
    "Slug": "artipic",
    "Meta Title": "Artipic: May 7, 2018, Artipic AB and Full Overview",
    "Meta Description": "Looking for information on Artipic? Check out the release date (May 7, 2018), developer insights from Artipic AB, and a complete game summary.",
    "Alt Text Image": "Official header image for Artipic game - Steam 828800",
    "Canonical URL": "https://gusku.site/game/artipic",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Artipic\", \"description\": \"Looking for information on Artipic? Check out the release date (May 7, 2018), developer insights from Artipic AB, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Artipic AB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Artipic AB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/828800/header.jpg?t=1575577184\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.9, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}