{
    "AppID": 1885250,
    "Name": "Axiom of Maria",
    "Release date": "Mar 3, 2022",
    "About the game": "Axiom of Maria is an action-adventure game with a rich story. The player becomes Kay, who has a supernatural power that is referred to as an 'irregular' and who fights the 15th AISOC (AI Special Operations Command), which is a government agency that is trying to control such powers. Sword Action Axiom of Maria pursues fast, intense, and easy action. Most of the enemies are bots, and they mainly use machine guns. Kay, who is not affected by any physical shock if she can endure the pain, deals with the enemy using a sword of unique material. Bike Action When Kay is on her motorcycle, the motorcycle runs on its own through autonomous driving. Players can approach enemies, attack them, and jump over highways. The Story In 2074, the Korean population has fallen below 1 million due to population cliffs and infectious diseases. (51.78 million as of 2020) Government agencies and cities have begun to be managed by AI. The percentage of government agencies AI is currently in charge of is unknown. A person with supernatural power referred to as an irregular, considered associated with the epidemic of 2043, first appeared around 2070. The government finds Irregulars dangerous and manages them. Kay, an instructor for the 707th SMG (Special Missions Group), loses consciousness after being hit with a stray bullet during training but is otherwise physically alright. When Kay woke up, Kay and her daughter had already been taken and locked up by the 15th AISOC (AI Special Operations Command): AISOC, which manages irregulars. Also, Kay's husband has disappeared without a trace. An institute that protects irregulars – In Korea, it is called the 'School'- helps Kay and her daughter escape from the hostiles, and they take refuge in the 'School' at Sankt Gallen, Switzerland. Kay and the 'School' search for Kay's husband, but they cannot find traces of him anywhere. While on the surface, the story begins with the battle between the 'School' and hostiles and Kay's efforts to reclaim her family; behind that is the story of fighting among government agencies and the story of AI, which experiences the fear felt by humans as it gains consciousness.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1885250/header.jpg?t=1647064086",
    "Price": 12.99,
    "Developers": "Studio Ganzheit",
    "Publishers": "Studio Ganzheit",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1885250/ss_a901978a4d310b3199e5198c4655644e09d2800c.1920x1080.jpg?t=1647064086,https://cdn.akamai.steamstatic.com/steam/apps/1885250/ss_59c85418425fa9b4295325132388b801fa5f8879.1920x1080.jpg?t=1647064086,https://cdn.akamai.steamstatic.com/steam/apps/1885250/ss_1c014749b6245f097bd2076b07195474189ee275.1920x1080.jpg?t=1647064086,https://cdn.akamai.steamstatic.com/steam/apps/1885250/ss_099f095e74699dd24d4ee9602b66bd11b456f2cd.1920x1080.jpg?t=1647064086,https://cdn.akamai.steamstatic.com/steam/apps/1885250/ss_f996896d030077abc45f5ad6b89fce76cdacb119.1920x1080.jpg?t=1647064086",
    "Slug": "axiom-of-maria",
    "Meta Title": "Axiom of Maria: Mar 3, 2022, Studio Ganzheit and Full Ove...",
    "Meta Description": "Looking for information on Axiom of Maria? Check out the release date (Mar 3, 2022), developer insights from Studio Ganzheit, and a complete game summary.",
    "Alt Text Image": "Official header image for Axiom of Maria game - Steam 1885250",
    "Canonical URL": "https://gusku.site/game/axiom-of-maria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Axiom of Maria\", \"description\": \"Looking for information on Axiom of Maria? Check out the release date (Mar 3, 2022), developer insights from Studio Ganzheit, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 3, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Ganzheit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Ganzheit\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1885250/header.jpg?t=1647064086\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}