{
    "AppID": 1487680,
    "Name": "Broken Universe - Tower Defense",
    "Release date": "May 24, 2021",
    "About the game": "Strategic Tower Defense Create your own unique strategies in this tower defense with a twist. Play any way you want and any way you can think of. You even decide how each game starts by choosing where to land! Unique Gameplay Try lots of different strategies, from blocking all paths and hiding safely behind your walls, to guiding monsters down a long line of fire. Use the unique towers and barriers to come up with your own original style of play. Try blasting monsters so hard they can't approach, mixing monsters up until they can't function properly, or focusing on defense and recovery to build an impenetrable fortress. You can even try backing a bunch of monsters into a corner and wiping them all out at once, or lining them up and taking them out one-by-one. The following content will be available in the full release. For information about early access, please see the Early Access Game panel above. A variety of colorful planets divided into 9 main chapters and 3 sub-chapters. Never get bored with over 140 stages with 10 types of characteristics Stages that allow you to completely stop up paths or destroy the terrain to create new ones Over 30 different types of towers and barriers, and over 20 types of powerful combo towers Over 15 types of skills A tech tree with over 80 specs to research, plus various upgrades and fortifications Over 80 types of modules and over 40 kinds of items to step things up a notch 3 levels of difficulty: Normal, Hard and Wild Mode Bonus content such as Landing Mission, Challenge Mode, Endless Mode, Exploration, and more! Colorful Planets Travel around space helping the hero search for his lost girlfriend while battling monsters on various planets. Not only does each stage look different, but you also have to pay close attention to the items and environmental factors of each planet in order to craft your winning strategy. If you do it right, it'll be a huge help to your strategic gameplay. Upgrades and Technology You'll need upgrades and technology in order to face off against strong monsters. Use upgrades to make your buildings and landing pod even stronger. Freely explore the four categories of the tech tree and adjust things to your taste to aid your strategy. Various modules and fusion towers For a truly unique game experience, upgrades and a tech tree alone aren't enough. Equip various modules to make your buildings one story stronger. You can also combine buildings to make completely new, stronger towers. Powerful skills and items In moments of danger, overcome the problem with skills. With items, you can begin devising your strategic gameplay before diving into a stage. Depth of Gameplay Passing a stage is only the beginning. Challenge yourself with 3 difficulty levels (Normal, Hard, and Wild Mode), as well as Landing Machine, Challenge Mode, Endless Mode, and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1487680/header.jpg?t=1651668930",
    "Price": 9.99,
    "Developers": "Jinthree Studio",
    "Publishers": "Jinthree Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_d36df81a60429e41d12d9a9677c339311e2e07b9.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_76acf966557681bee25f51957e897be2db5ab0d0.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_bef7b382acafede2673ed6eeb94216964f4368f0.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_04c05ba0ac3c13008c38b997e9a571a7426c7a71.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_b74c9eece7b261090545e6dcc78993f369208b9d.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_6033939dbe3efd8991f941b691fee45d15e47507.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_c512145ca558a1ef661e71298f9e5719c1a2cd91.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_e43db7601eb3601f007abc0ca707370144e9570d.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_612c23ebf0705ce30af12b30a234c8e73462eaf3.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_0f35b871fa419dbf584b71e380742cc08512058b.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_dc5a2e9b31ce496cd8ad4cc2a9381437c0b9e48a.1920x1080.jpg?t=1651668930,https://cdn.akamai.steamstatic.com/steam/apps/1487680/ss_8f1a85d2a388caf2657462ba7836c51584047dfe.1920x1080.jpg?t=1651668930",
    "Slug": "broken-universe-tower-defense",
    "Meta Title": "Broken Universe - Tower Defense: May 24, 2021, Jinthree S...",
    "Meta Description": "Looking for information on Broken Universe - Tower Defense? Check out the release date (May 24, 2021), developer insights from Jinthree Studio, and a co...",
    "Alt Text Image": "Official header image for Broken Universe - Tower Defense game - Steam 1487680",
    "Canonical URL": "https://gusku.site/game/broken-universe-tower-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Broken Universe - Tower Defense\", \"description\": \"Looking for information on Broken Universe - Tower Defense? Check out the release date (May 24, 2021), developer insights from Jinthree Studio, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jinthree Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jinthree Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1487680/header.jpg?t=1651668930\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}