{
    "AppID": 1530040,
    "Name": "Creas",
    "Release date": "Aug 20, 2021",
    "About the game": "Synopsis On a rainy night, Max finds himself in front of his desk immersed in his drawings as usual, he has difficulty stopping, bewitched by this obsession to recreate the creatures that haunts his mind. He eventually gave in to exhaustion and found his bed. The next day, he glimpses a stranger through his window who seems to be spying on him and decides to pursue him through the forest behind his home. Unaware, he is about to find himself in a conflict that endangers the survival of mankind, and even worse, he is the only person with the power to re-establish balance in the universe. Universe A young man discovers that the creatures of his imagination actually exist. They are called Creas and live on a planet called Ostral. The problem is, the Creas mysteriously teleport to Earth. He will then discover the secrets of an ancient civilization which would be the creators of humans as well as the Creas. They are called the Husters, named Creators by the Creas. Max is part of this lineage, he will have to uncover the reason why these creations suddenly appear on Earth and that the preservation of the balance between these 2 races relies on him. Gameplay Menu The menu has been revised to look like a digital music player (Ipod), we find all the basic functions, except the equipment which is managed automatically, but also the objectives (Quests), Karma (Impact of moral choices) and even successes (Successes). Combat The combat system is turn-based. A rune system is included, it will be used to heal or revive the heroes during combat as well as to use bonuses that will improve the heroes stats. It is by attacking that the hero will fulfill the power of the rune that corresponds to his element. By defending himself, he will be able to refill his energy which fuels the skills. Variety Creas also includes several other gameplay elements (Mini-games) which will change depending on the situations Max encounters. A racing system has been added Choice During the game, the player will have to make moral choices (Karma) which will sometimes affect the story as well as Max's strengths and weaknesses. Author's comment The current advancement represents the 1st act of Creas's game, called ‘The arrival’.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1530040/header.jpg?t=1653070229",
    "Price": 4.99,
    "Developers": "Ti-Max & Mat",
    "Publishers": "Ti-Max",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1530040/ss_49955b61cd599bea8300dc14d75ef0ca857d20c8.1920x1080.jpg?t=1653070229,https://cdn.akamai.steamstatic.com/steam/apps/1530040/ss_cc1ac906de58ea8bf6cbceea2d5ec20d4c0e2bbb.1920x1080.jpg?t=1653070229,https://cdn.akamai.steamstatic.com/steam/apps/1530040/ss_944ebc0c4e4de788d5b9b1168fbae9c92d9c3f29.1920x1080.jpg?t=1653070229,https://cdn.akamai.steamstatic.com/steam/apps/1530040/ss_ce1f15f84e047cb9ebf73e7e92d7f65d135f5336.1920x1080.jpg?t=1653070229,https://cdn.akamai.steamstatic.com/steam/apps/1530040/ss_893be4ccaf523678d481d25fe70bf652a51d08ca.1920x1080.jpg?t=1653070229",
    "Slug": "creas",
    "Meta Title": "Creas: Aug 20, 2021, Ti-Max & Mat and Full Overview",
    "Meta Description": "Looking for information on Creas? Check out the release date (Aug 20, 2021), developer insights from Ti-Max & Mat, and a complete game summary.",
    "Alt Text Image": "Official header image for Creas game - Steam 1530040",
    "Canonical URL": "https://gusku.site/game/creas",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Creas\", \"description\": \"Looking for information on Creas? Check out the release date (Aug 20, 2021), developer insights from Ti-Max & Mat, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ti-Max & Mat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ti-Max\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1530040/header.jpg?t=1653070229\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}