{
    "AppID": 970450,
    "Name": "Descent of Man",
    "Release date": "Oct 22, 2020",
    "About the game": "Story You play as Jarrett Reed, a member of a small post-apocalyptic community in a world devastated by disease. Alone and unafraid, Reed is a first class scavenger. Reed breaks off the normal scavenging paths used by his community for decades in search of a rumored utopia - a city with running power and a thriving populace. Finding the city, Reed enters seeking to find everything his community needs and more to survive. What he doesn't expect, is the darkness lurking within. Reed will encounter a variety of enemy types each with their own strengths and weaknesses that you must help him overcome. As you manipulate the environment and use gadgets against the enemies, you will need to search for supplies and equipment to escape. Along the way you will be thrown into life and death encounters with dangerous enemies while having to solve puzzles to reveal the path to freedom. Gameplay Overview Use stealth and gadgets to evade intelligent and nightmarish enemies as you scavenge for supplies and escape the insanity of a mad scientist Intelligent AI that can see and hear everything in the environment - use this to your advantage to deceive the enemies and lure them away from your position Trick enemies into combating one another - leaving you to deal with whoever survives Use limited melee weapons to take down enemies Solve survival horror puzzles inspired by games like Resident Evil and Silent Hill A narrative fully realized with a highly detailed world to include: radio and television broadcasts, voice acting, and detailed environments Boss fights In summary, the main features of the game are satisfying stealth maneuvers to evade enemies, numerous gadgets and weapons to neutralize and deceive enemies as you scavenge for supplies, a variety of enemy types and encounters, a world rich in nightmarish lore that is historically inspired by the American Eugenics movement in the 1900s. Sneak to Survive As you make your escape you will need to deceive, evade, or take-down intelligent and nightmarish enemies. You have limited melee options so plan your attacks carefully. Escape or live to regret it. Deceive Enemies Use the environment to mislead the enemies lurking in the darkness. Use noisemakers, turn on radios, leave doors and windows open to lure enemies away from your path of travel. While they are busy searching suspicious sounds or changes in the environment you can sneak past them. Solve Eerie Puzzles To escape you will use your wit to uncover clues, gather items, and solve puzzles that will propel you into enemy encounters and guide you through the madness. Inspired By: Resident Evil Outlast Thief",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/970450/header.jpg?t=1603369913",
    "Price": 0.0,
    "Developers": "Fuzion Labs LLC",
    "Publishers": "Fuzion Labs LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/970450/ss_81fe1e88244fb0efc79294b9f38f8ab2d500eefc.1920x1080.jpg?t=1603369913,https://cdn.akamai.steamstatic.com/steam/apps/970450/ss_e2290a1b360ec782f804c8d2a5476d8fb5326752.1920x1080.jpg?t=1603369913,https://cdn.akamai.steamstatic.com/steam/apps/970450/ss_6b1ac71dec041faee1e31235c596d422ad5d8c45.1920x1080.jpg?t=1603369913,https://cdn.akamai.steamstatic.com/steam/apps/970450/ss_25722d01c92056cd136947695c37242b59ee28df.1920x1080.jpg?t=1603369913,https://cdn.akamai.steamstatic.com/steam/apps/970450/ss_da6da548d8025da785dc6d8ca12de1ff817d260d.1920x1080.jpg?t=1603369913,https://cdn.akamai.steamstatic.com/steam/apps/970450/ss_9b6730f1c92eb0978a8e6acc54ec62bf2aec3a81.1920x1080.jpg?t=1603369913",
    "Slug": "descent-of-man",
    "Meta Title": "Descent of Man: Oct 22, 2020, Fuzion Labs LLC and Full Ov...",
    "Meta Description": "Looking for information on Descent of Man? Check out the release date (Oct 22, 2020), developer insights from Fuzion Labs LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Descent of Man game - Steam 970450",
    "Canonical URL": "https://gusku.site/game/descent-of-man",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Descent of Man\", \"description\": \"Looking for information on Descent of Man? Check out the release date (Oct 22, 2020), developer insights from Fuzion Labs LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fuzion Labs LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fuzion Labs LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/970450/header.jpg?t=1603369913\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}