{
    "AppID": 651120,
    "Name": "Diesel Express VR",
    "Release date": "Jan 23, 2019",
    "About the game": "Apocalypse brought us freedom 'Apocalypse brought us freedom' said a stranger man named Marius. Nobody knew him before, but he showed another path beside the one which is going behind the walls that built by who is responsible of this breakdown. In a few months he was controlling thousands of men. Then he has ordered men to fill the diesel to the engines... The great war ended by a ceasefire after desolation of the earth. Only a very small population of people were living safely behind the walls of self governed cities which appeared after the breakdown of the countries. While cities were guarded by the walls, outland was under control of a doomsday cult which was led by a stranger man named Marius. As an individualist, Marius convinced groups to act against the cities. His idea spreaded quickly due to the post war conjunctures. The only transportation way is being used between the cities was railroad. All the resource trade is made with highly armored diesel trains called 'The Dreadnought's. Our character takes his place in a dreadnought by joining the 'regiment'. Features Virtual Reality Game First Person Shooter Realistic shooting experience Realistic Pistol Aiming/Firing Pure Action Realistic enemy death Innovative User Experience Survival Hide&amp;Shoot 50 squats per game Gameplay The main theme of the game is to protect the train from the enemy bandits. The player is located in a train car. The enemies follow the train and try to shoot the player. Player should use obstacles to hide from enemy fire while trying to kill the enemies in the cars. Pub In the city pub, player chooses missions. The player gets prepared for the mission in the pub. The guns are selected here. Shooting Range In the shooting range, the player can try different guns. Watch out for the enemy rifle in the range! Missions Different missions take place in different maps. In early access there will be 6 missions in 3 different maps. Bandits The enemies drive diesel cars. Both the enemy shooter and driver can be shot. Weapons The player has access to different weapons which can be chosen in the pub. Currently, there are 4 different guns.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/651120/header.jpg?t=1548278008",
    "Price": 9.99,
    "Developers": "Lazylab Games",
    "Publishers": "Lazylab Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/651120/ss_3960a797ed8faadab27a71a84e9c281377633d27.1920x1080.jpg?t=1548278008,https://cdn.akamai.steamstatic.com/steam/apps/651120/ss_5c2f173e30007563271283a337927c43927cccee.1920x1080.jpg?t=1548278008,https://cdn.akamai.steamstatic.com/steam/apps/651120/ss_60c049812641c72705e1387171fc5e6445494305.1920x1080.jpg?t=1548278008,https://cdn.akamai.steamstatic.com/steam/apps/651120/ss_47a92c5dd1b956425693dd0a5582107c898bdf0b.1920x1080.jpg?t=1548278008,https://cdn.akamai.steamstatic.com/steam/apps/651120/ss_89b0288b1ad5ddcc5417ec63f102f90a16844939.1920x1080.jpg?t=1548278008",
    "Slug": "diesel-express-vr",
    "Meta Title": "Diesel Express VR: Jan 23, 2019, Lazylab Games and Full O...",
    "Meta Description": "Looking for information on Diesel Express VR? Check out the release date (Jan 23, 2019), developer insights from Lazylab Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Diesel Express VR game - Steam 651120",
    "Canonical URL": "https://gusku.site/game/diesel-express-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Diesel Express VR\", \"description\": \"Looking for information on Diesel Express VR? Check out the release date (Jan 23, 2019), developer insights from Lazylab Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lazylab Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lazylab Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/651120/header.jpg?t=1548278008\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}