{
    "AppID": 842350,
    "Name": "Escape Code - Coding Adventure",
    "Release date": "May 3, 2018",
    "About the game": "Help a small boy escape a tech factory on Christmas! MAMMOTH INTERACTIVE IS BACK PUZZLE ADVENTURE Do you like Criminal Case, Can You Escape and Walking Dead? You'll love Escape Code. USE YOUR BRAIN Help! Something locks Max in the #1 tech factory in the world over holiday break. Max must stop an evil Artificial Intelligence from destroying the world! Meet a good AI that needs Max's help. Solve puzzles and coding problems to save us all and escape! ONE OF A KIND Escape Code puts coding, technology and artificial intelligence into a fun but challenging environment. If you like escape rooms, this is the game for you. No coding experience required. We won't force you to learn to code. You will learn intuitively from code on screen. MAMMOTH FEATURES - Interwoven puzzles - Plot twists - Made entirely in Apple's SpriteKit - Learn coding - Easter eggs hidden in binary - Masterful art and design - Easy, touch-friendly controls - Perfect for beginners - Made exclusively on Macs - Learn Apple's Swift programming language - No typing required - Optimized for iOS and MacOS - Challenges and exploration SOLVE CODING CHALLENGES Escape Code is not strictly educational. Rather, you uncover the plot by solving puzzles, riddles and questions. NO EXPERIENCE? NO PROBLEM Escape Code requires no coding experience to play. Players of all levels and ages are welcome. Our courses likewise target beginners so that anyone can learn. Escape Code will keep you interested and get those neurons firing. COOL MECHANIC Play with code in a fun environment. Play a smart game first of its kind. Engage with puzzles and coding challenges! Play a game that puts coding into a clever plot. Escape Code is a fun adventure game for all. OPTIMAL LENGTH Get hours of engaging fun. Escape Code is compact and will keep you entertained without droning on for a long time. Stay engaged for the Goldilocks span of time. Simply perfect. ALL AGES You can be ANY AGE to find something in this game for you. Find binary Easter eggs! Watch out for plot twists. WE LOVE APPLE Play one of the biggest games made with SpriteKit yet. Play a game made exclusively on Macs. Puzzles are built for mobile, so there will be no tedious typing of code. A WORLDWIDE TEAM Stunning art and music through a global collaboration. Our international team worked masterfully to make Escape Code's pleasing art and music. There's something to notice at every step of the way through the Terra factory. MADE FOR APPLE ENTHUSIASTS We took a year to perfect our game in Apple's exciting game engine SpriteKit. Game coding challenges written in Apple’s official programming language Swift. We are one of few developers to make games in SpriteKit. CLEAN AESTHETIC Built, designed and optimized for a clean adventure quest experience. You will not have to tediously type ANY code. Play one of the biggest games made with SpriteKit yet. Play a game exclusively made on Macs. Escape Code will look stunning on your device. DO YOU LOVE TECHNOLOGY? You can be ANY AGE to find something in Escape Code for you. If you have coding experience, you'll have double the fun. Find our computing Easter eggs! And watch out for plot twists along the way. How will Max's story end? You can only find out by playing! Accept brain challenges the factory throws at you. This is a game unlike any you've played before. Escape Code is a challenging adventure game with a coding mechanic tied into plot. We won't force you to learn to code. Max will learn a thing or two about coding along the way. Our coding feature is unique. There is no other SpriteKit adventure game with such innovate mechanics. Get it here if you love technology and games. We'll see you in the game :) -Mammoth Interactive",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/842350/header.jpg?t=1525351684",
    "Price": 9.99,
    "Developers": "Mammoth Interactive INC",
    "Publishers": "Mammoth Interactive INC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_01bde3b7b43cd47016be459ae29450d96eb126f8.1920x1080.jpg?t=1525351684,https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_2e705a57e24c1af3655c8fda5c7dbc59f4e85798.1920x1080.jpg?t=1525351684,https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_f7dcb41d4df9c77b148559f946f7a89f9b14a0ba.1920x1080.jpg?t=1525351684,https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_e6015f9fc63bdd1dbb7062f6ae008cf049633be2.1920x1080.jpg?t=1525351684,https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_cc4b3b661ba01ac71086b8776587f97eee20f49f.1920x1080.jpg?t=1525351684,https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_4fff5672022f8e8e9c2bc4a5844a6843e5a397f7.1920x1080.jpg?t=1525351684,https://cdn.akamai.steamstatic.com/steam/apps/842350/ss_ea6e0f13b1d7736dc0d78eadb2e0c86f5edba2d5.1920x1080.jpg?t=1525351684",
    "Slug": "escape-code-coding-adventure",
    "Meta Title": "Escape Code - Coding Adventure: May 3, 2018, Mammoth Inte...",
    "Meta Description": "Looking for information on Escape Code - Coding Adventure? Check out the release date (May 3, 2018), developer insights from Mammoth Interactive INC, an...",
    "Alt Text Image": "Official header image for Escape Code - Coding Adventure game - Steam 842350",
    "Canonical URL": "https://gusku.site/game/escape-code-coding-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Escape Code - Coding Adventure\", \"description\": \"Looking for information on Escape Code - Coding Adventure? Check out the release date (May 3, 2018), developer insights from Mammoth Interactive INC, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mammoth Interactive INC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mammoth Interactive INC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/842350/header.jpg?t=1525351684\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}