{
    "AppID": 1198110,
    "Name": "Fantasy Realm TD",
    "Release date": "Dec 11, 2019",
    "About the game": "Help to defend the Kingdom against hundreds of critters attacking the castle! Great graphics and style in the Fantasy genre! Test yourself in tower defense offline as a commander, give a worthy rebuff to the enemy! This is the third of TD games from our small group of developers. We tried to fix mistakes of previous tower defense games and made it in fantasy style. Features of Fantasy Realm TD: - 54 levels with different starting conditions and relative difficulty - 11 types of enemies with unique abilities - Flying and ground units - 5 tower upgrade branches - 54 types of towers with individual progress of each - 6 castle upgrade types - Challenging balance - Tower target priority selection system Those of users who follow our development progress know that we have come a long way of experimenting with tower defense strategy games and defence genre. We wanted to get the best out of TD possible coming up with different epic combinations and new ideas. Testing new concepts of tower defense games we tried different approaches to make experience as exciting as possible. With this tower defense offline game I believe we outdone ourselves. The main feature of this defense strategy game is its replay value. You will find that playing the same level of this TD game after 100 takes is as fascinating as it was the first time. It is TD game that you can only win with your mind. Organizing defense, setting up your towers and choosing proper strategy is key to winning. And your choice determines whether you will succeed or not. This tower defense challenges you in unique way. You won’t get past many levels unless you’re the smartest and your mind is the sharpest. This tower defense has unique and deep upgrading system. When you are done shooting of epic enemies, setting up fantasy strategy and handling your defense game has a lot to offer. Choose different path, evolve your towers to give you more advantage in your endless fight with monsters trying to break your defense. 54(!) upgrade types is a lot. Choose the right one that suits your TD game style. Defense games is not only about shooting it is about planning. In this defense game your ability to plan ahead decides whether you will prevail and achieve long-wanted TD game victory or fail greatly. Towers themselves have a lot of Unique effects and interactions. You can disintegrate, turn to ice, slow burn and pierce your enemies. Defense needs many tools. In this tower defense game you will get plenty. Your enemies will tremble and monsters will be shocked when you will unleash all your defence combinations and unique tower modifiers. It is only up to you to find the towers and towers modifiers combinations that work the best in this TD. Try it know! You have nothing to lose! This TD is something that we prepared for a long time. Studying and studying different tower defense features and TD mechanics. We wanted to provide tower defence experience that would be special for our user. When we created this tower defence we invested all of our experience soul and heart to make the best tower defence possible. This tower defense offline game is something that we are very proud of and would be happy if you tried it out! Tower defense games is an old and epic defence genre. TD has come a long way as well as defense game. This tower defense game is one that I with my friends enjoy and want to share with you. Play this td game now - will not regret it I promise.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1198110/header.jpg?t=1576486561",
    "Price": 9.99,
    "Developers": "Gyro-Games Inc.",
    "Publishers": "Gyro-Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1198110/ss_c5c5df0932a3811796d1ec818a736cd4c406e70b.1920x1080.jpg?t=1576486561,https://cdn.akamai.steamstatic.com/steam/apps/1198110/ss_5509641a34fb7dadbb871e95879fb5da26494aef.1920x1080.jpg?t=1576486561,https://cdn.akamai.steamstatic.com/steam/apps/1198110/ss_b3ae88388e0657c7943c423c8df0fb6f8b6ea7d0.1920x1080.jpg?t=1576486561,https://cdn.akamai.steamstatic.com/steam/apps/1198110/ss_7b01e79c81048c9518844e1df1feac7cf22bb0b9.1920x1080.jpg?t=1576486561,https://cdn.akamai.steamstatic.com/steam/apps/1198110/ss_231f38d833170608ea5bdf8fc832f8549301320f.1920x1080.jpg?t=1576486561",
    "Slug": "fantasy-realm-td",
    "Meta Title": "Fantasy Realm TD: Dec 11, 2019, Gyro-Games Inc. and Full ...",
    "Meta Description": "Looking for information on Fantasy Realm TD? Check out the release date (Dec 11, 2019), developer insights from Gyro-Games Inc., and a complete game sum...",
    "Alt Text Image": "Official header image for Fantasy Realm TD game - Steam 1198110",
    "Canonical URL": "https://gusku.site/game/fantasy-realm-td",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fantasy Realm TD\", \"description\": \"Looking for information on Fantasy Realm TD? Check out the release date (Dec 11, 2019), developer insights from Gyro-Games Inc., and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gyro-Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gyro-Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1198110/header.jpg?t=1576486561\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}