{
    "AppID": 688740,
    "Name": "Fractured Minds",
    "Release date": "Nov 14, 2019",
    "About the game": "Fractured Minds is an immersive artistic short game, exploring anxiety and mental health issues. Winner of the BAFTA Young Game Designers Award, Fractured Minds is a game created by Emily Mitchell, then 17-years-old, with the hope of aiding understanding and awareness of mental illness. Embark on a journey through the human psyche and experience six atmospheric and thought-provoking chapters, each symbolising a different aspect or challenge associated with mental health issues; from isolation to anxiety, with everyday situations being distorted beyond recognition. Raw, emotive and earnest, Fractured Minds demonstrates that video games are capable of communicating vital messages in imaginative ways. It is a game that seeks to encourage empathy and champion support for the millions living with mental health issues. Wired Productions is proud to support Safe In Our World, a gaming industry charity striving for mental health awareness. 80% of the proceeds will help fund Emily’s career as well as future initiatives from Safe In Our World. Take a personal and honest journey through the human psyche. Interact with your environment to overcome challenges and puzzles across 6 levels, each inspired by real life obstacles. Explore the emotions surround emptiness, anxiety, depression and paranoia. Enjoy a rich and immersive soundtrack including “Silence” provided kindly by Kai Engel. A thought-provoking experience about what it means to live with mental health. 'Fractured Minds is an immersive puzzle game that uncovers the daily struggles of people living with anxiety and mental health issues. It is designed to give the player a genuine insight into the experiences of those quietly living with mental illness – the feelings of isolation, of being trapped, of everyday situations being distorted beyond recognition. My own anxiety has been very debilitating and I wanted to create a game that shares my experiences and provokes real discussion about this topic that is often misunderstood and rarely spoken about. It recently won the Young Game Designers BAFTA award (15 – 18 category) and now I’d love for you to play. I realise the game is provocative and at times uncomfortable – but I felt that it was so important to be honest and true-to-life – confronting mental illness is extremely challenging and uncomfortable. Thank you to everyone who has supported Fractured Minds. Your energy has helped to elevate support and awareness for mental health.' -- Emily Mitchell",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/688740/header.jpg?t=1632498822",
    "Price": 1.99,
    "Developers": "EmilyMGames",
    "Publishers": "Wired Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/688740/ss_b183bf5668185a74f7c6125681c30ea4b2cec933.1920x1080.jpg?t=1632498822,https://cdn.akamai.steamstatic.com/steam/apps/688740/ss_3c0834e2e7f6e17ce4768859739c835030a8fb02.1920x1080.jpg?t=1632498822,https://cdn.akamai.steamstatic.com/steam/apps/688740/ss_7202af064c87dea29bd484730cc29bda9ab270d5.1920x1080.jpg?t=1632498822,https://cdn.akamai.steamstatic.com/steam/apps/688740/ss_e38158c18d100ce2bb490c124a3109afe0425b6a.1920x1080.jpg?t=1632498822,https://cdn.akamai.steamstatic.com/steam/apps/688740/ss_0b91dcf6fcca82fb40ec7badb5f97ea2450d6a3c.1920x1080.jpg?t=1632498822",
    "Slug": "fractured-minds",
    "Meta Title": "Fractured Minds: Nov 14, 2019, EmilyMGames and Full Overview",
    "Meta Description": "Looking for information on Fractured Minds? Check out the release date (Nov 14, 2019), developer insights from EmilyMGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Fractured Minds game - Steam 688740",
    "Canonical URL": "https://gusku.site/game/fractured-minds",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fractured Minds\", \"description\": \"Looking for information on Fractured Minds? Check out the release date (Nov 14, 2019), developer insights from EmilyMGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"EmilyMGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wired Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/688740/header.jpg?t=1632498822\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}