{
    "AppID": 1784580,
    "Name": "时间之神的猫",
    "Release date": "Nov 19, 2021",
    "About the game": "A holy cat came to the mortal world to eat fish. It has no frontal combat capability, nor can it sneak in stealth. But it has its own unique skill-time travel. When the mortal guards followed the timeline to track the cat's figure, they had fallen into a trap. By rationally planning when to appear, the cat will play around with the guard. After eating countless fish, the cat discovered that the most powerful force is not time travel, but wisdom. Cat just want to eat fish There is no complicated love and hatred, this cat just come to eat fish. Escapes the guards, comes to the location of the fish, and eat it. Then returns to the place where you started at the prescribed time. The cat's purpose is that simple. The power of time travel There is no need to follow a fixed round order, the cat can choose to appear in any round. However, this ability is not invincible, the cat can only appear in plots adjacent to the current location. And once it appears in one round, you can no longer choose this round to appear elsewhere. How to pass the level depends on whether you can properly use the power. The guard of the mortal world Unlike the cat that can jump through time and space, the stone guards of the temple only move one step at a time in turn order. But they win in their dedication and tirelessness. As long as you appear in their vision, it will chase you, even if you suddenly disappear, they will always wait where you disappeared, no matter how long. But they won't know. The last round in their eyes is just a normal round you can choose on the timeline. Various challenges From the low-level guards who can only look forward in the early stage, to the ultimate guards who can stare at four directions at the same time in the later stage, the challenges are varied. Every level is in a small space, and there are not too many rounds available. How to plan rationally, is all up to you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1784580/header.jpg?t=1653286977",
    "Price": 1.99,
    "Developers": "MingCang Studio",
    "Publishers": "MingCang Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1784580/ss_85d3f65f465bfa31124db0fae8732ae0fde4689a.1920x1080.jpg?t=1653286977,https://cdn.akamai.steamstatic.com/steam/apps/1784580/ss_7d46bc8624f34c558b7da79038a9ea8ebe2c8546.1920x1080.jpg?t=1653286977,https://cdn.akamai.steamstatic.com/steam/apps/1784580/ss_20322d48a14b60b32e9116c9bd981f62a8dbc979.1920x1080.jpg?t=1653286977,https://cdn.akamai.steamstatic.com/steam/apps/1784580/ss_e601a7908c9a9aa3f2afc2bcabf01da763ed3a24.1920x1080.jpg?t=1653286977,https://cdn.akamai.steamstatic.com/steam/apps/1784580/ss_d88c644f16a0e3193196d5c31fbd06a79b838298.1920x1080.jpg?t=1653286977",
    "Slug": "",
    "Meta Title": "时间之神的猫: Nov 19, 2021, MingCang Studio and Full Overview",
    "Meta Description": "Looking for information on 时间之神的猫? Check out the release date (Nov 19, 2021), developer insights from MingCang Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for 时间之神的猫 game - Steam 1784580",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u65f6\\u95f4\\u4e4b\\u795e\\u7684\\u732b\", \"description\": \"Looking for information on \\u65f6\\u95f4\\u4e4b\\u795e\\u7684\\u732b? Check out the release date (Nov 19, 2021), developer insights from MingCang Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MingCang Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MingCang Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1784580/header.jpg?t=1653286977\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}