{
    "AppID": 1775550,
    "Name": "Gary Grigsby's War in the East 2",
    "Release date": "Dec 10, 2021",
    "About the game": "SETTING The Eastern Front, the most decisive theatre of World War II and the largest land battlefield. A fight to the end, Total War between the Third Reich and the Soviet Union, each commanding millions. The legendary wargame team at 2by3 Games has spent years revisiting this titanic conflict to once again establish a new state of the art. Gary Grigsby’s War in the East 2 is a complete overhaul and improvement of the original War in the East, with no stone left unturned to provide a more realistic, more historically rich, and more challenging strategy experience. War in the East 2 comes with a wide array of scenarios ranging from the short tutorial on the Battle for Velikie Luki, to the four month Destruction of Southwest Front, up to the immense full 1941 – 1945 Grand Campaign of the entire Eastern front from Operation Barbarossa to the fall of Berlin. A total of seven Operational Scenarios and three Full Map Campaigns await you with hundreds, if not thousands, of hours of historical gameplay. Years of new development have resulted in the best AI opponent ever made by 2by3 for any of their game. Also included are a much more accurate map including a full single and double rail network as well as the historical road network, a detailed and expanded Order of Battle, new realistic movement and combat models, an advanced Logistics system, a vastly improved and easy to manage Air system and many other improvements in the interface and game management, as well as a built-in encyclopedia of the weapons and units of the Eastern Front. This is just scratching the surface of the many new features and improvements, all of which are explained in a fully comprehensive manual, also available as a physical copy. FEATURES 3 Full Map Campaigns - 1941-45 Campaign (June 22 1941 – 1 August 1945) - Stalingrad to Berlin (November 19 1942 – 4 July 1945) - Vistula to Berlin (13 January 1945 – 1 June 1945) 7 Smaller Operational Scenarios - Velikie Luki ’42 (17 November 1942 – 25 January 1943) – The Soviet counterattack to recapture this important rail junction. - Road to Minsk (22 June 1941 – July 2 1941) – The rush to the Dnepr by Army Group Center. - Road to Leningrad (22 June 41 – 8 Oct 41) – Army Group North moves on Leningrad. - The Destruction of Southwest Front (22 June 41 – 15 October 41) – Army Group South and Guderian cause the largest Soviet surrender in the war. - Operation Typhoon 41 (30 September 1941 – 5 January 1942) – The final offensive to take Moscow. - Red Army Resurgent (19 November 1942 – 17 March 1943) – The destruction of the German 6th Army at Stalingrad. - Red God of War (24 November 1942 – 8 February 1943) – The failed Soviet northern offensive. Improved AI Opponent - Newly re-designed and re-built by Gary Grigsby for War in the East 2 - Greatly enhanced Defensive AI performance as well as improved Offensive AI performance More Accurate Map and Movement rules: - Map based on better projection yields a larger number of hexes in the main combat area (106 hex frontage from Rostov to Leningrad versus 87 in WitE). - Advanced Terrain/Road rules – Road quality in every hex combines with terrain to generate much more realistic impacts of terrain on movement, combat and supplies. - Administrative Movement – Accounts for ability to move rapidly in friendly territory, especially where there are better roads. - Ability to stack additional units into urban and port hexes Off-Map Theater Boxes and Theater Events: - Theater boxes representing other theaters of the war (North Africa, Italy, etc.), and a full set of events including garrison requirements in the TBs along with other events like partisan operations. - Partisan war now handled with a Soviet Union garrison box, events, and partisan interdiction placed on map. - Enhanced Player Theater Box Control game option that allows players to choose more flexible movement of units between theaters, but at a cost for failing to meet garrison requirements versus benefits for exceeding them. - More accurate historical line up of units, HQs and support units and their historical movement between theaters. - Additional historical campaign events. Improved Air System incorporating both a more Advanced Air Mode and a Streamlined Air Operational Group Mode - On Map Airbases - Much more realistic Air Combat and Support Resolution compared to War in the East and War in the West. - A separate Air Phase is now used for many air actions, with ground support and transport done in the movement phase. - Advanced Air Mode allows full detailed control of the entire Air War, equivalent to a game within a game. - New “Air Operational Group” Mode which allows you to move Air Groups on the map and provides an easy and streamlined way to manage the air game while focusing on the ground game. This makes the air game easier to manage even for those players that want full control. - Full AI Air Assist that can run most of the air operations based on just a few orders given by the player to the Air Operational Groups. More accurate and detailed historical weather model incorporating per-hex Weather changes based on the system developed for War in the West. Changes in Ground Combat to reflect Historical operations: - New Combat Preparation Points for units allow for build ups for better offensive operations and punish units that are in combat every turn without a rest. - Combat Delay Points account for the time spent fighting in a hex and will slow units that move through a hex where significant combat took place that turn. - Attacks can now deprive defending units of future MPs. - Multi-hex retreats. Many interface improvements, including new art, reorganized screens, a new Turn Summary and more important information regarding your units and situation brought to the top level for easier discovery and quicker access. Automated Soviet factory evacuation. Improved Commander’s Report screens with more flexibility and CSV export capability for out of game analysis. Special designation of Assault HQs allowing Command benefits for offensive armies at the cost of some defensive abilities. Increased Command cost of integrating multiple nationalities under the same command. Greater direct attachment of support units to certain Soviet and Axis Allied divisions, along with multi-role units that can be on map or used as support. New In-Game WitEpedia – Includes Detailed Information and Links concerning units and weapons of the Eastern Front. Detailed TO&amp;E and Order of Battle Charts with information about many of the units on the Eastern Front. 520 Page full color manual, including appendices and designer's notes fully documenting every aspect of the game. The additional Physical version (only) comes with a hardbound full color printed manual.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1775550/header.jpg?t=1639169990",
    "Price": 79.99,
    "Developers": "2by3 Games",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1775550/ss_cf171f8166ac70dcd4abaef82a5dc91edff42885.1920x1080.jpg?t=1639169990,https://cdn.akamai.steamstatic.com/steam/apps/1775550/ss_7d1d5ca7c7f90235624bc4af3c7ac35795d7533c.1920x1080.jpg?t=1639169990,https://cdn.akamai.steamstatic.com/steam/apps/1775550/ss_10364144f72844c11dbdc8d13a85bbea6ff21bb8.1920x1080.jpg?t=1639169990,https://cdn.akamai.steamstatic.com/steam/apps/1775550/ss_1293349e81a41480780c4bd0f3b57ddb0b00a50d.1920x1080.jpg?t=1639169990,https://cdn.akamai.steamstatic.com/steam/apps/1775550/ss_1f7aad48169559206cc04ffa36825669f83f14dc.1920x1080.jpg?t=1639169990,https://cdn.akamai.steamstatic.com/steam/apps/1775550/ss_06b68dea1f97b7a26ac4cdf5a8ac05a8eb56832b.1920x1080.jpg?t=1639169990",
    "Slug": "gary-grigsby-s-war-in-the-east-2",
    "Meta Title": "Gary Grigsby's War in the East 2: Dec 10, 2021, 2by3 Game...",
    "Meta Description": "Looking for information on Gary Grigsby's War in the East 2? Check out the release date (Dec 10, 2021), developer insights from 2by3 Games, and a comple...",
    "Alt Text Image": "Official header image for Gary Grigsby's War in the East 2 game - Steam 1775550",
    "Canonical URL": "https://gusku.site/game/gary-grigsby-s-war-in-the-east-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gary Grigsby's War in the East 2\", \"description\": \"Looking for information on Gary Grigsby's War in the East 2? Check out the release date (Dec 10, 2021), developer insights from 2by3 Games, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"2by3 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1775550/header.jpg?t=1639169990\", \"offers\": {\"@type\": \"Offer\", \"price\": 79.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}