{
    "AppID": 1269590,
    "Name": "Get-A-Grip Chip",
    "Release date": "Oct 16, 2020",
    "About the game": "Gear up for grappling action with Get-A-Grip Chip Help Chip save the lost Battery Bots on a perilous journey through the treacherous depths of a robot assembly factory. The catch? The Hooks! When piloting Chip, you can't jump, but you can soar over the pits of molten metal, giant crushers, pools of toxic waste, shifting saws and high-powered lasers using your trusty head-mounted grapple! With 30 meticulously crafted levels across 5 diverse worlds, Get-a-Grip Chip is sure to get you (grappling) Hooked! Dodge deadly obstacles, rescue the Battery Bots, and race your friends (or rivals) for the top spot on the leaderboards. Get-A-Grip Chip is available now on Steam for PC, Mac and Linux. Fun to Learn - Even More Fun to Master Chip can move side-to-side, grapple to anchor points, and then launch off of them – so anyone can learn to play. But to survive the escalating complexity of the arcade-style levels, you'll build a truly masterful degree of skill and dexterity. Suss Out Secret Spaces Survive the onslaught of obstacles and you’ll be rewarded with your lost Battery Bot friends. The more Battery Bots you seek, the sooner they'll unlock new levels, bringing Chip closer to the ultimate goal: repairing their malfunctioning friend Scan-It Janet and escaping the factory! Trim Your Time to Take the top Spot Compete with your friends and players around the globe for the fastest runs! Hook, launch, and dodge your way through all five floors of the factory and see where you stack up on each level’s leaderboard. Unlock Achievements and Custom Equipment In addition to the primary gameplay, discover and unlock achievements and custom equipment that changes Chip's appearance - custom equipment is themed to each floor, and can be acquired by finding each floor's Battery Bots or completing a variety of additional challenges. Savor the Soundtrack Flavor Hot tracks accompany the fresh platforming challenges throughout - the original soundtrack is not only chock full of slappers by Stimmerman, it’s available as bundled DLC! The final level of each world is timed to the beat of its track, so getting into the music will also get you into a perfect gameplay flow. Key Features: Escape a gauntlet of high-flying and fast-moving obstacles Soar through 5 worlds and 30 levels of grappling mayhem Explore hidden areas and complete challenges to rescue all your robot friends Race to the top spot on worldwide per-level leaderboards Launch to the beat and sail through riffs to escape each world’s rockin’ final level Play your own way with a controller or with keyboard &amp; mouse",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1269590/header.jpg?t=1647363765",
    "Price": 9.99,
    "Developers": "Redstart Interactive",
    "Publishers": "Redstart Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_15dece02f00d9d336dcc3e34380cfce653ce71e0.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_3eb69277ebc9d00adb7ba9f61474a0fd6ad62da2.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_b0420d8ad0f13b47bedacd40f76aacbc2897c8ed.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_3ac04b5f5bc8b3ab5d9a532a66325cec3fbafde9.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_c2b267dc8f413b2f4b36151039f21bb90871a55d.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_063bb8523e3f1e455e737722956b49d8c635a1e3.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_8c30a2dd174986347e62107387d3e4d11c0ef75d.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_c5cfeffe6efe8d8b75d27610ad2c1594b51734d5.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_7120d6ac0a043fd6cb9bd7d8d7f16ce8709c7cb2.1920x1080.jpg?t=1647363765,https://cdn.akamai.steamstatic.com/steam/apps/1269590/ss_8dd907cd73a4082d0a0b4296bab2fc9b1fd889ef.1920x1080.jpg?t=1647363765",
    "Slug": "get-a-grip-chip",
    "Meta Title": "Get-A-Grip Chip: Oct 16, 2020, Redstart Interactive and F...",
    "Meta Description": "Looking for information on Get-A-Grip Chip? Check out the release date (Oct 16, 2020), developer insights from Redstart Interactive, and a complete game...",
    "Alt Text Image": "Official header image for Get-A-Grip Chip game - Steam 1269590",
    "Canonical URL": "https://gusku.site/game/get-a-grip-chip",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Get-A-Grip Chip\", \"description\": \"Looking for information on Get-A-Grip Chip? Check out the release date (Oct 16, 2020), developer insights from Redstart Interactive, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Redstart Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Redstart Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1269590/header.jpg?t=1647363765\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}