{
    "AppID": 428180,
    "Name": "Islet Online",
    "Release date": "Feb 11, 2019",
    "About the game": "Welcome to Islet Online. Islet Online is a sandbox-style MMORPG. It is all about digging and placing bricks to build your own land. And with various materials from wildlife, bricks can be combined to make useful items, too. Whenever you act, your character gets experience. When your character gets experience, your character’s mastery skill level goes up. With enough skill level, you will be able to accomplish extraordinary results. Don’t feel for playing together? No worries, we also support single-player play, along with multiplayer option, with support of dedicated server! As a player of Islet, the whole world is up to you. Do whatever you want. But, be careful. There may be some consequences you did not expect before. Game System The Ecosystem In Islet Online, there is an ecosystem. Animals and plants interact with others. For example, wolves hunt rabbits for their life, rabbits eat grass to reproduce. Ecosystem of Islet can be affected by your character’s acts. If you hunt too many rabbits and pigs, wolves may starve to death, due to lack of food. Then you decide to kill every wolf on your sight, an army of herbivore will lay your world waste in ruin, left nothing but a wasteland. Basically, you will reap what you sow. Your small action may cause horrific climate change, sudden blight break out from nowhere. Who couldn’t adapt to the rapidly changing world, will die Also, there’s a way to restore Islet’s ecosystem. The answer lies in the world. Look through carefully. Animals, plants, NPC will hint you. Animals &amp; NPCs Animals and NPCs, even plants, dwellers in Islet have their own basic desires. They have a desire to sleep, eat, and have a family. When they feel threatened, they will flee. When they feel hunger, they will eat what they want. If desires can’t be solved, a grim fate awaits them – insufficient sleep causes sickness, hunger causes agony of starvation. NPCs have their own lifetime. When they grow up, they will find their partner to make a family, give birth to a baby. They may perish as the time goes. Sometimes, their kid resembles his/her parents. You can find seeds to grow plants, tame wild animals to make a farm. With enough time and love, you can even give a name to your special animal. There is a chance some strangers come and live to the place where you put furniture. You may help them in and out. Then, more people will come to your residence. With enough population, you can be a mayor of the town. Remember, they will not be nice if you not want to do so. Crafting You can craft various items via all kinds of materials gathered from the world. There are some basic recipes given, but always be creative! Through disassemble and experiment, you can find undiscovered secret recipes. Level Up In Islet Online, there are a hundred of skills, which can be categorized in ten groups. Whenever you act, your character gets experience to raise your mastery skill. Let’s say if you mining bricks, your mining skill will level up. Eventually, your character will be a professional miner. If you jump often, then your jumping skill goes up, then he/she will be able to jump 4 times in the air! Do whatever you want. Your wish may come true. Thank you. We support multi-language chat, but we do not yet support other languages in the UI. Homepage : / EMail : contact@morenori.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/428180/header.jpg?t=1658220074",
    "Price": 16.99,
    "Developers": "Morenori Soft",
    "Publishers": "Morenori Soft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_55b9931a00413483eb5a3ac9ea7c56276fe088df.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_bdb2c92b6fe3aac397def91f9fd96942b897c46e.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_92024f428cf0aba815f4afefe1e8d1f6e8699e0d.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_5b8a9af87a2a9f8385d23bba9218f0d7ec0ebc39.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_fcc6c34524c0261b13497247dd74c2a7f04ffa83.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_5a385cc9b35922114c425b85cd1d21ca5021a774.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_af010cd6544cca6344c57d49950306474ea44b2f.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_0db0128375e3843fd0b8f722d57af385f93cdc07.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_8ed6c2f5a7aa21c82f719efe086820d060ef6e7d.1920x1080.jpg?t=1658220074,https://cdn.akamai.steamstatic.com/steam/apps/428180/ss_06f781c6874cad68d593e4d7ede7a9200004266e.1920x1080.jpg?t=1658220074",
    "Slug": "islet-online",
    "Meta Title": "Islet Online: Feb 11, 2019, Morenori Soft and Full Overview",
    "Meta Description": "Looking for information on Islet Online? Check out the release date (Feb 11, 2019), developer insights from Morenori Soft, and a complete game summary.",
    "Alt Text Image": "Official header image for Islet Online game - Steam 428180",
    "Canonical URL": "https://gusku.site/game/islet-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Islet Online\", \"description\": \"Looking for information on Islet Online? Check out the release date (Feb 11, 2019), developer insights from Morenori Soft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Morenori Soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Morenori Soft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/428180/header.jpg?t=1658220074\", \"offers\": {\"@type\": \"Offer\", \"price\": 16.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}