{
    "AppID": 1427290,
    "Name": "Jiguland",
    "Release date": "Oct 20, 2020",
    "About the game": "About This Game You are just a peasant living day to day eating slimes in Jiguland . One day, the president puts up a bounty on the local evil lord. This is your chance to flip your life around. Jiguland is an open world roguelike rpg in a twisted mix of medieval modern life. The crazy insurance and food costs as well as the lack of real jobs in Jiguland will constantly get in your way as you struggle to level up to kill the evil lord. Do whatever it costs to survive and prosper - Befriend the insurance agent, possess and live as a dog, clone the pawnbroker, turn the golem into a slime... You will find that honest work will not get you far in Jiguland . Combat Tactically place yourself according to landscape and enemy disposition to ensure survival in combat. Use the lighting to your advantage - darkness hinders the vision range of you and your enemies. Pay attention to the direction that your enemies are facing - if they are turned away from you, the only way for them to notice you is your footstep sound. As the game progresses, you must also learn different skills that change combat dramatically. Even with the perfect tactical skills, you will be subject to repercussions of bad strategy. Controls Use WASD keys to move. Use SPACE key to attack. Use Q to drop or pick up items. Use TAB to access menu and close the dialog. You can enter tutorial in game. You may modify keymap.txt in the game directory to change keys. Further controls and mechanisms may be revealed as you play. Game Contents Depending on your skill level, your first victory may take more than 100 hours. Once you know what you are doing, a single victory run takes about 4 hours. There are 5 attributes to level up - Vitality, Strength, Stealth, Intelligence, and Charisma. Playthroughs will differ dramatically depending on your build. There are 100+ enemies, 100+ various items, 30+ weapons, 50+ equipment, 30+ game changing skills, 30+ unique spells, and 25 wandering unique mobs. Currently the game map consists of about 100000 tiles. There are 6 procedurally generated dungeons. While the map is static, the biomes are random, so objects spawning on the map will be different each playthrough.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1427290/header.jpg?t=1603202503",
    "Price": 5.99,
    "Developers": "Jiguman",
    "Publishers": "Jiguman",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1427290/ss_5b6b1cafc7318caf0dc3b87b32d8d621b63a035d.1920x1080.jpg?t=1603202503,https://cdn.akamai.steamstatic.com/steam/apps/1427290/ss_f676cfd79c48f7efe81ddda6e21b6836cd34c6da.1920x1080.jpg?t=1603202503,https://cdn.akamai.steamstatic.com/steam/apps/1427290/ss_eb18e482a1e89fa65766ddf8e95cd1036c29c709.1920x1080.jpg?t=1603202503,https://cdn.akamai.steamstatic.com/steam/apps/1427290/ss_ee01c11c417ce50cf209625a2cbd0455b2d79f50.1920x1080.jpg?t=1603202503,https://cdn.akamai.steamstatic.com/steam/apps/1427290/ss_d1f66df23480f730f059eb6617685505becd9001.1920x1080.jpg?t=1603202503",
    "Slug": "jiguland",
    "Meta Title": "Jiguland: Oct 20, 2020, Jiguman and Full Overview",
    "Meta Description": "Looking for information on Jiguland? Check out the release date (Oct 20, 2020), developer insights from Jiguman, and a complete game summary.",
    "Alt Text Image": "Official header image for Jiguland game - Steam 1427290",
    "Canonical URL": "https://gusku.site/game/jiguland",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jiguland\", \"description\": \"Looking for information on Jiguland? Check out the release date (Oct 20, 2020), developer insights from Jiguman, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jiguman\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jiguman\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1427290/header.jpg?t=1603202503\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}