{
    "AppID": 1639930,
    "Name": "Last Days",
    "Release date": "Oct 2, 2021",
    "About the game": "About The gods have blessed New Canaan for four hundred years since its founding, and everyone - including Sister Ginsetsu - thought it would go on forever, until the day Ginsetsu met the gods of New Canaan. Since then, the story between the maiden who calls herself a god, and the maiden who will become a god has begun. Story In New Canaan, gods are real. From the daily weather, to this year's harvest, to the life and death of people, she is in control of almost everything in New Canaan. She has also blessed New Canaan with no disasters and good weather for nearly four hundred years. But this is the God who one day suddenly tells you. 'I am neither all-good nor all-powerful.' And invites you to step into the realm of God, what will you do at this time? But no matter how to do, at the moment you meet her, the script has long been written by her. And the ending is the destruction of the old world, and the birth of a new god. 'God will always protect New Canaan' Through the eyes of Sister Silver Snow, observe the life and customs of the people in the land given by God, and learn from the details of the three previous great collapses to bring the impact of this land, and as the story progresses, gradually understand why this land has become so, and what efforts have been made by humans to survive New Canaan. The Oracle and the Third Great Collapse God had promised that the oracle would keep New Canaan safe from the Third Great Collapse, but if that was true, then why didn't the oracle work in the previous three collapses? And why did God come to New Canaan only after the third great collapse? Divinity and humanity, will eventually be difficult to separate When Silver Snow, a nun, and the divine Mary will have a fated encounter in New Canaan, and in the process of getting along afterwards, Mary will slowly be stripped of the aura of divinity and return to the child who loves her family, while Silver Snow will slowly gain divinity and become the remaining human god. But in fact, humanity and divinity are not so clear-cut things, like starlight dissolving in moonlight, like affection dissolving in love, between God and man they will eventually be difficult to separate. 'The gods wear sailor suits' This is the story between the maiden who calls herself a god, and the maiden who will become a god - in New Canaan. Feature An evocative soft sci-fi story Lovely characters and professional CVs Carefully prepared CG and beautifully drawn BG And more than ten beautiful BGM Production team official group: 953202123 Last but not least, we would like to thank our little angel, Yuhan, for providing the Japanese translation. Thank you very much.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1639930/header.jpg?t=1654086411",
    "Price": 2.99,
    "Developers": "琉璃花糖制作组,Garakowa Marshmallow",
    "Publishers": "琉璃花糖制作组,Garakowa Marshmallow",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1639930/ss_9e54a38fccb82bfcdb0abf14f2ea38265650742c.1920x1080.jpg?t=1654086411,https://cdn.akamai.steamstatic.com/steam/apps/1639930/ss_a71e1d74f833c881b8e0075494e88e4c1e4d3272.1920x1080.jpg?t=1654086411,https://cdn.akamai.steamstatic.com/steam/apps/1639930/ss_24dc4a15842273ebbb5de866b4fdb7e5c0945dd0.1920x1080.jpg?t=1654086411,https://cdn.akamai.steamstatic.com/steam/apps/1639930/ss_69379aaed504cd310c39028778827746cc808d52.1920x1080.jpg?t=1654086411,https://cdn.akamai.steamstatic.com/steam/apps/1639930/ss_5dea7c96b178f03ff5459bcabb4b8b59050111be.1920x1080.jpg?t=1654086411,https://cdn.akamai.steamstatic.com/steam/apps/1639930/ss_1fa4fb20ad62795877b89ceefd4bebda2251ae9a.1920x1080.jpg?t=1654086411",
    "Slug": "last-days",
    "Meta Title": "Last Days: Oct 2, 2021, 琉璃花糖制作组,Garakowa Marshmallow and ...",
    "Meta Description": "Looking for information on Last Days? Check out the release date (Oct 2, 2021), developer insights from 琉璃花糖制作组,Garakowa Marshmallow, and a complete gam...",
    "Alt Text Image": "Official header image for Last Days game - Steam 1639930",
    "Canonical URL": "https://gusku.site/game/last-days",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Last Days\", \"description\": \"Looking for information on Last Days? Check out the release date (Oct 2, 2021), developer insights from \\u7409\\u7483\\u82b1\\u7cd6\\u5236\\u4f5c\\u7ec4,Garakowa Marshmallow, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7409\\u7483\\u82b1\\u7cd6\\u5236\\u4f5c\\u7ec4,Garakowa Marshmallow\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7409\\u7483\\u82b1\\u7cd6\\u5236\\u4f5c\\u7ec4,Garakowa Marshmallow\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1639930/header.jpg?t=1654086411\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}