{
    "AppID": 1184810,
    "Name": "Mainframe Defenders",
    "Release date": "Feb 25, 2020",
    "About the game": "MAINFRAME DEFENDERS - tactical retrofuturistic strategy game. A computer virus has infiltrated the 'Stargazer' research complex. Most of the robotic units are controlled by the virus. Lead a squad of 4 prototypes on a mission to defend complex mainframe. You'll have to repel assaults, destroy unit fabricators, download valuable data, clear infected nodes, and do more on your way to the deepest parts of the complex. Work with item limitations and drawbacks to build powerful combinations. Destroy your enemies with diverse tactics: overheat them, melt with corrosion, absorb damage, and return fire. But don't rely on a single strategy too much - enemies might have a way to counter it. But above everything else: defend the Mainframe! * RETRO STYLE: Graphics, inspired by 80s terminal PC with hybrid synthwave soundtrack. * DIVERSE TACTICS: Cook enemy robots to death, bury them under your bullets, eliminate with a single powerful shot, or render your opponents useless with debuffs - this game is designed with a lot of viable strategies in mind. * BUILD YOUR SQUAD: Similar to how in card games you have to build your deck, in Mainframe Defenders you have to combine different items with unique abilities, to create an unstoppable squad. Work with item drawbacks or double down on them, creating flawed, yet powerful build! * UNIQUE ENEMIES: Enemy squad won't sit idle, though. Each unit has its own role in the squad and designed to counter certain strategies. Pick your targets wisely, or you will lose. * PROCEDURAL LEVELS: Hand-made rooms are combined with procedural generation to create random levels. Missions have differing objectives, combined with unique mission conditions. Will you accept the challenge or avoid the unknown and risk falling behind? * PROGRESSION SYSTEM: Victory or defeat, the game is not over yet! Unlock new units, each with a unique set of upgrades and load-outs. Unlock new items to bolster your new strategies. Synthetic Domain is a small team of hobbyists with a passion for making games. We are working with limited resources to deliver quality games focusing on polish and execution. We look at indie games, games from the 90s and 00s for our inspiration, hoping to bring some of the spirit of this era to the modern age. Do not hesitate to contact us if you have any problems, you want to leave a review or a suggestion: Synthetic Domain",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1184810/header.jpg?t=1657385167",
    "Price": 3.99,
    "Developers": "Synthetic Domain",
    "Publishers": "Synthetic Domain",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_f0090674133726c198bf0ac8082a5d588fcc23fa.1920x1080.jpg?t=1657385167,https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_d1286a370bd8471bbc2fb52e15cc7796305f7bd1.1920x1080.jpg?t=1657385167,https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_b0b10e4a97d31f2e1659ba487bed92267097eec7.1920x1080.jpg?t=1657385167,https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_8c04f4100ca59b8ed35ca80c00069005e320a7f6.1920x1080.jpg?t=1657385167,https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_4848d1c6320bdd59484075e7a616f2db4b7ddb79.1920x1080.jpg?t=1657385167,https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_f437dc577ddd23be1e84cadaa889a9437452e30c.1920x1080.jpg?t=1657385167,https://cdn.akamai.steamstatic.com/steam/apps/1184810/ss_d9ffb0d929397d1be774586d4b67ce489a392ac1.1920x1080.jpg?t=1657385167",
    "Slug": "mainframe-defenders",
    "Meta Title": "Mainframe Defenders: Feb 25, 2020, Synthetic Domain and F...",
    "Meta Description": "Looking for information on Mainframe Defenders? Check out the release date (Feb 25, 2020), developer insights from Synthetic Domain, and a complete game...",
    "Alt Text Image": "Official header image for Mainframe Defenders game - Steam 1184810",
    "Canonical URL": "https://gusku.site/game/mainframe-defenders",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mainframe Defenders\", \"description\": \"Looking for information on Mainframe Defenders? Check out the release date (Feb 25, 2020), developer insights from Synthetic Domain, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Synthetic Domain\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Synthetic Domain\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1184810/header.jpg?t=1657385167\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}