{
    "AppID": 942030,
    "Name": "Marvelous Designer 8 for Steam",
    "Release date": "Nov 6, 2018",
    "About the game": "M A R V E L O U S   D E S I G N E R 8   F O R   S T E A M Bringing the efficiency of fashion design to computer graphics. Marvelous Designer allows you to create beautiful 3D virtual clothing with our cutting-edge design software. Finally breathe life into your designs with tools that enhance quality while saving you time. From basic shirts to intricately pleated dresses and rugged uniforms, Marvelous Designer can virtually replicate fabric textures and physical properties to the last button, fold, and accessory. With our versatile compatibility with other 3D software and interactive design interface, you can instantaneously edit and drape garments onto 3D forms with high-fidelity simulation. N E W F E A T U R E S - 3D Sewing - Sculpt - Trace Patterns with UV Map - Auto Arrangement Point/ Bounding Volume - Remeshing (beta) S O F T W A R E   U P D A T E S *Please note Upgrade to next version is not available for Marvelous Designer 7 for Steam unlike our web version Marvelous Designer. However, Patches and minor updates are provided free of charge with a Steam Perpetual license. K E Y   F E A T U R E S Accurate with Highest Quality Rather than spend countless days on manual sculpting, artists can now focus on the creative expressions. Natural wrinkles formed automatically by Marvelous Designer Effective &amp; Efficient - Create one clothing to fit various body types. - Standardized highest quality result for every artist - Diverse transformation from one clothing asset - Easy simulation to create normal map Fast &amp; Easy Create natural wrinkles with simple pattern creation bringing faster workflow process. And it is easy to use even for beginners. Pattern Creation and Editing Users can create and edit rectangular, circular, or any other polygon shaped patterns. Segment and Free Sewing Users can create and edit seam lines with in sewing directions and range. Arrangement Points and Bounding Volume Arrangement Points and Arrangement Bounding Volume are used for proper placement of patterns around the avatar. All pieces of pattern should be arranged in proper position around the avatar for the stable simulation. Fabric Physical Properties Enable precise simulation from the original fabric material. Physical Property section contains information about fabric behavior with several values that define material characteristics. Users can manually change physical property or simply select preset physical property which is already defined. Pin Manipulation Users can manipulate multiple vertices/pins with Point/Box/Lasso tools. Compatibility Across modeling and animation, data between software including Maya, 3DS Max, Softimage, Modo and ZBrush can be imported/exported. Fast &amp; Accurate clothing simulation with Animation Editor Users can load, edit and save 3D clothes file used in the animation record. The recorded animation can be imported/exported to 3DS Max or Maya as Maya Cache, Point Cache2, MDD Point Cache.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/942030/header.jpg?t=1568045043",
    "Price": 0.0,
    "Developers": "CLO Virtual Fashion",
    "Publishers": "CLO Virtual Fashion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/942030/ss_83cf685765e93a6d4ea6eb33324708d541df5842.1920x1080.jpg?t=1568045043,https://cdn.akamai.steamstatic.com/steam/apps/942030/ss_1510430cd31402bc4c3a8fa10c72dfd58923e25c.1920x1080.jpg?t=1568045043,https://cdn.akamai.steamstatic.com/steam/apps/942030/ss_b451fc446db9636cb7db7bc680161b925ee6ecbb.1920x1080.jpg?t=1568045043,https://cdn.akamai.steamstatic.com/steam/apps/942030/ss_7993b3b90aabdba4046fb9207ac641f8b6397414.1920x1080.jpg?t=1568045043,https://cdn.akamai.steamstatic.com/steam/apps/942030/ss_2ea782cfc8fbb95b6e8d79548e6802101836f176.1920x1080.jpg?t=1568045043,https://cdn.akamai.steamstatic.com/steam/apps/942030/ss_e1c1f7ea554a04181edafc5f66f73d01783b0267.1920x1080.jpg?t=1568045043",
    "Slug": "marvelous-designer-8-for-steam",
    "Meta Title": "Marvelous Designer 8 for Steam: Nov 6, 2018, CLO Virtual ...",
    "Meta Description": "Looking for information on Marvelous Designer 8 for Steam? Check out the release date (Nov 6, 2018), developer insights from CLO Virtual Fashion, and a ...",
    "Alt Text Image": "Official header image for Marvelous Designer 8 for Steam game - Steam 942030",
    "Canonical URL": "https://gusku.site/game/marvelous-designer-8-for-steam",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Marvelous Designer 8 for Steam\", \"description\": \"Looking for information on Marvelous Designer 8 for Steam? Check out the release date (Nov 6, 2018), developer insights from CLO Virtual Fashion, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CLO Virtual Fashion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CLO Virtual Fashion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/942030/header.jpg?t=1568045043\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}