{
    "AppID": 754010,
    "Name": "MEDICALHOLODECK. The DICOM Viewer and Human Anatomy Lab in Virtual Reality. For Surgery Preparation and Medical Education in Teams.",
    "Release date": "Dec 2, 2017",
    "About the game": "After starting, activate your free full trial in the settings menu under the cogwheel icon. Medicalholodeck is The Virtual Reality Platform for Medical Teamwork and Education Medicalholodeck's virtual reality applications are used by medical students to prepare their exams, by professionals for surgery planning in teams, and in medical education for teaching in virtual classrooms. There are 3 apps available on the Medicalholodeck: Medical Imaging XR, Dissection Master XR, and Anatomy Master XR. They can be used simultaneously, and in teams. Medical Imaging XR Medical Imaging XR is the DICOM Viewer for professional teamwork in virtual reality. The software enables import and editing of medical images in DICOM and 3D formats. The following data can be imported: 3D DICOM from CT, MRI, and CBCT 2D DICOM from ultrasound and angiography 3D data in OBJ and STL formats The app provides functions for editing medical images in VR, such as tools for segmenting, measuring, filtering or cutting. It is also ready for collaborative teamwork in virtual reality. Connect to other users over the internet or create live web streams to a broad audience. Medical Imaging XR runs on any tethered virtual reality hardware. Dissection Master XR Dissection Master XR is the human anatomy and simulation lab in virtual reality. The app offers super hi res 3D data of human cadavers in a VR classroom environment. The professionally dissected bodies can be studied layer by layer from the outer muscles to the inner organs. The following datasets are included: 8 layers of head and thorax 5 layers of abdomen and pelvic 10 layers of arms More datasets will be added The anatomy datasets are fully annotated and linked to Wikipedia for further information. The app is ready for teaching in virtual reality and for live web streaming to mobile devices. Dissection Master XR can be used on any tethered and standalone virtual reality device. Anatomy Master XR Study the precise 3D male and female human anatomy models of Zygote in virtual reality. The high-resolution and carefully textured 3D models can be taken apart and studied as an interactive 3D object from any side. The beautifully textured anatomies data can be cut, filtered, and enlarged. Anatomy Master XR can be used simultaneously with Dissection Master XR and Medical Imaging XR. This enables the comparison of accurate human anatomy models, high-resolution anatomical dissections, and medical images in DICOM format and provides a comprehensive solution for medical education. The app is also ready for teamwork in VR and for live web streaming. Medical Teamwork in VR TeamXR, the app for medical virtual collaboration, is deeply integrated in Medicalholodeck and connects you to other users over the internet. Live Web Streaming Use live web streaming to teach a broader audience. Anatomy professors around the world are using Medicalholodeck’s applications to stream their lessons directly to the mobile devices of the students. Use all apps simultaneously Use all Medicalholodeck applications simultaneously and compare 3D anatomy models, realistic human dissections, and medical images from CT, MRI, CBCT, ultrasound and angiography. The Medicalholodeck bundle provides the comprehensive medical software for personal medical studies and professional education. Available on any VR hardware All three apps can be used on Virtual Reality hardware from any manufacturer, tethered and untethered. The download here on steam is the windows version to be used on tethered VR hardware. If you are looking for versions for untethered use (such as Oculus Quest 2 and others), please visit www.medicalholodeck.com Activate your Free Full Trial This download comes with a free full trial of all 3 Medicalholodeck apps including TeamXR. Once started, go to the settings page under the cogwheel icon and activate your trials. Get a license After the trial you can purchase a student’s, EDU or Pro license here: info@medicalholodeck.com Tutorials Find tutorials here: / Support For support contact info@medicalholodeck.com",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/754010/header.jpg?t=1638276289",
    "Price": 0.0,
    "Developers": "Medicalholodeck.com",
    "Publishers": "Medicalholodeck.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_6e4d7dd428a809babd33531d760e9c05d860fbc5.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_02124435076c7220692f5923d897575ce83e04f5.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_946767684a679e7b5b4d3be9106d0204109dc100.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_cc3e4a82e410e18cde7ff6a158809d0409079eee.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_87e6e25198a94ad6b64b3b64925542308d196c3b.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_9767a1251ff19f567f2fab5fbd1613835b27f38d.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_fe73f55ecae919d548f5d23188abcae61f54e903.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_732088213f4336a3f801d3ee9620c786e31b2346.1920x1080.jpg?t=1638276289,https://cdn.akamai.steamstatic.com/steam/apps/754010/ss_5d798ec0ea6771ae3cb6d2dae19caccc0580a8bb.1920x1080.jpg?t=1638276289",
    "Slug": "medicalholodeck-the-dicom-viewer-and-human-anatomy-lab-in-virtual-reality-for-surgery-preparation-and-medical-education-in-teams",
    "Meta Title": "MEDICALHOLODECK. The DICOM Viewer and Human Anatomy Lab i...",
    "Meta Description": "Looking for information on MEDICALHOLODECK. The DICOM Viewer and Human Anatomy Lab in Virtual Reality. For Surgery Preparation and Medical Education in ...",
    "Alt Text Image": "Official header image for MEDICALHOLODECK. The DICOM Viewer and Human Anatomy Lab in Virtual Reality. For Surgery Preparation and Medical Education in Teams. game - Steam 754010",
    "Canonical URL": "https://gusku.site/game/medicalholodeck-the-dicom-viewer-and-human-anatomy-lab-in-virtual-reality-for-surgery-preparation-and-medical-education-in-teams",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MEDICALHOLODECK. The DICOM Viewer and Human Anatomy Lab in Virtual Reality. For Surgery Preparation and Medical Education in Teams.\", \"description\": \"Looking for information on MEDICALHOLODECK. The DICOM Viewer and Human Anatomy Lab in Virtual Reality. For Surgery Preparation and Medical Education in ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Medicalholodeck.com\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Medicalholodeck.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/754010/header.jpg?t=1638276289\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}