{
    "AppID": 1719690,
    "Name": "MerFight",
    "Release date": "Mar 30, 2022",
    "About the game": "MerFight is a 2.5D fighting game involving 12 fishy fighters influenced by a variety of flashy sea life such as angler fish, sharks, and the Yellowtail Fang Blenny. With an emphasis on flexibility and leniency, MerFight is a fast-paced, engaging, and approachable fighter for veterans and newcomers of the genre alike. MODES Local Versus Fight competitively in fierce 1-on-1 battles! Online Create 8-person lobbies or participate in ranked or casual quick matches online with rollback netcode. Tutorial Mode Learn about MerFight's mechanics with interactive tutorials that go over the basics, advanced techniques, and character-specific features. Training Mode Practice in training mode with input and hitsphere display, setup recording, and more features to come! Arcade Mode (In progress) Fight a series of AI-controlled opponents. AI will be continually improved throughout Early Access. Combo Challenge (In progress) Attempt to complete a series of combos for each of MerFight's 12 fighters. Block &amp; Punish Challenge (In Progress) In this mode, learn to block and punish various attack sequences. Story Mode (Coming Soon) Play through MerFight's branching story mode as the battle to dethrone Rho, the Arctic King, heats up. Replay Mode Rewatch your last ten matches in Replay Mode! More features coming soon; currently records online and non-AI local versus matches only. MECHANICS Input Leniency Most fighting games require inputs such as quarter-circles to perform special and super attacks; however, MerFight allows simpler inputs such as forward + attack to work. Performing the more traditional input properly will reward players with a slight meter boost. The goal is to allow players who may struggle with these types of input to still have a level of success when playing MerFight and help them get into the game more quickly! Pop Cancels With this explosive mechanic, players can double-tap in any direction during most actions such as jumping, normal attacks, and special attacks, to cancel them, allowing them to extend combos or avoid getting punished after a traditionally unsafe attack. Pop Push and Pop Roll While blocking, players can press HP+HK to Pop Roll, allowing them to roll forward of the way and potentially punish their opponent’s offense. They can also press LP+LK to Pop Push, in which they can push opponents back, creating space between them and their opponent. Unique Meter Management In MerFight there are two types of energy that can be spent. The main energy meter allows players to perform super moves. When one bar of that meter is filled, that player earns a Pop. If the player has filled all 3 energy meters, they cannot earn anymore Pops, so they will need to spend their meter if they want to earn more Pops. STORY A Tail of Fish Out of Water, Terrestrially Retold In the earliest of days, the three ancients oversaw all life. The ancients, The Aquatic, The Terrestrial, and The Empyrean were each a transfiguration of 3 separate elements, holding the world in balance. One day, an ancient shark warrior manifested the Celestial Tide, an atmospheric pool of water, causing all those in the land and sky to perish. This action caused The Terrestrial and Empyrean to disappear as well, leaving The Aquatic as the sole life force. As The Aquatic was forced to become all 9 elements, it punished all life in the ocean by forcing them onto the land. Harmony between the 9 elements hangs by a fine string - this is the story of trying to recapture a balance that is almost undone. FEATURES AVAILABLE NOW 12 Playable Characters Online Lobbies (Rollback Netcode!) Combo Challenges Block &amp; Punish Challenges 9/13 Stages (some of which will still be updated) COMING SOON Improved Arcade Mode Story Mode More Combo Challenges Other Unlockables",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1719690/header.jpg?t=1658283019",
    "Price": 11.99,
    "Developers": "Mattrified Games, LLC",
    "Publishers": "Mattrified Games, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_dd01d478c6a82d205594e430e6279b64ba82221f.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_20ce1b53e675f77f57293df48416add5775b0210.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_d9f922f9b74374917cf25886b91fbaa5505f04da.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_36a69fd3799f96f36134accbf8fa235de1d5d95a.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_4679a183d6d5f791f928db1eee31c543ef7be623.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_a02bbfa9c8d9b1de8c35449edb6a99c5a1d0f5da.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_992930eaf4f3ec97241f9d8c10b801db9ccee30c.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_67aa08bbaaafd66277056001539f38a9eac1e79a.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_fb1e8fa89a6092df25d34989a2c70d38890928ab.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_c662623fc2c9c07ff47f7fc078f73d24fb34bd00.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_db515f061d68614628f877157c9f27ddb57f716f.1920x1080.jpg?t=1658283019,https://cdn.akamai.steamstatic.com/steam/apps/1719690/ss_22b17d7d93fc69f9c96f5b58b0287afb0eaac272.1920x1080.jpg?t=1658283019",
    "Slug": "merfight",
    "Meta Title": "MerFight: Mar 30, 2022, Mattrified Games, LLC and Full Ov...",
    "Meta Description": "Looking for information on MerFight? Check out the release date (Mar 30, 2022), developer insights from Mattrified Games, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for MerFight game - Steam 1719690",
    "Canonical URL": "https://gusku.site/game/merfight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MerFight\", \"description\": \"Looking for information on MerFight? Check out the release date (Mar 30, 2022), developer insights from Mattrified Games, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mattrified Games, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mattrified Games, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1719690/header.jpg?t=1658283019\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}