{
    "AppID": 719590,
    "Name": "Mesozoica",
    "Release date": "Jan 2, 2018",
    "About the game": "Mesozoica - A full featured dinosaur theme park tycoon simulator in which you focus on the construction and management of your dinosaur wonderland. From choosing your starting company to your prime attraction, everything lies in your hands. Animals: From the Mesozoica to Cenozoic era, prehistoric animals such as the Tyrannosaurus Rex and lesser known Mamenchisaurus will be waiting for you to adopt them into your park. Babies : Every dinosaur starts out as a tiny little critter, bonding you to your dinosaur from the start. Watch it go through it’s life stages and explore your world. Control : By taking control of your animals you can experience what it’s like to be a dinosaur! Attack, eat and drink to keep your dinosaur’s needs in control. Modular building system: Let your imagination run wild with the modular building system, in which you can create reusable blueprints to use in your park. Nothing is too crazy, amaze yourself! Blueprints: For those who want to jump straight into the game, a wide range of blueprints will be available to use, so you can focus on what you think is important to you. Customize: Almost everything in Mesozoica can be customized to your liking, may it be color, texture or size! You can really make the park of your dreams. DNA System: With over 14 animals in the game you can use the state of the art world map to find, purchase and extract DNA from dinosaur fossils. Next to the wide range of dinosaurs there are more than 140 skins ready for you to explore! Black market: Don’t want to wait and have better things to do than digging? For the right price you can purchase your fossils straight from the black market, guaranteeing success. Dig site: The old fashioned way of getting dinosaur DNA. Select your favorite digsite, send your digging squad and wait for them to find your new dinosaur! Community creations: Get creative and use the modular building system to build, share and download blueprints made by the community and Mesozoica developers, giving you more freedom in your own park. Import: Download other blueprints from your friends and import them into your park, giving you more content in a breeze. Export: Created a beautiful dinosaur exhibit? Export it and send it over to your friends, allowing you to share your creations with the world!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/719590/header.jpg?t=1529439509",
    "Price": 0.99,
    "Developers": "Underdog Interactive,Squadron Interactive,DreamInCode B.V.",
    "Publishers": "Underdog Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/719590/ss_38f87e3a9ae372d829a7cd03165e33dc8869d530.1920x1080.jpg?t=1529439509,https://cdn.akamai.steamstatic.com/steam/apps/719590/ss_8668898321b9a50d141093f25f8fa6f17da80e06.1920x1080.jpg?t=1529439509,https://cdn.akamai.steamstatic.com/steam/apps/719590/ss_81e394b2aa2450309e3eaa3daf78e1a379fe3ade.1920x1080.jpg?t=1529439509,https://cdn.akamai.steamstatic.com/steam/apps/719590/ss_da0a817e956255cb243a390f9e350b7bb0bc44eb.1920x1080.jpg?t=1529439509,https://cdn.akamai.steamstatic.com/steam/apps/719590/ss_7b9a01f635aa2d2991336b7a85a6a39e9f3465af.1920x1080.jpg?t=1529439509",
    "Slug": "mesozoica",
    "Meta Title": "Mesozoica: Jan 2, 2018, Underdog Interactive,Squadron Int...",
    "Meta Description": "Looking for information on Mesozoica? Check out the release date (Jan 2, 2018), developer insights from Underdog Interactive,Squadron Interactive,DreamI...",
    "Alt Text Image": "Official header image for Mesozoica game - Steam 719590",
    "Canonical URL": "https://gusku.site/game/mesozoica",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mesozoica\", \"description\": \"Looking for information on Mesozoica? Check out the release date (Jan 2, 2018), developer insights from Underdog Interactive,Squadron Interactive,DreamI...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Underdog Interactive,Squadron Interactive,DreamInCode B.V.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Underdog Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/719590/header.jpg?t=1529439509\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}