{
    "AppID": 889710,
    "Name": "Muv-Luv photonmelodies♮",
    "Release date": "Jul 29, 2020",
    "About the game": "This compilation contains the following three Muv-Luv adventures: Adoration A novella-length spinoff title set in the world of “Duty ~Lost Arcadia~ The Euro Front” which offers a rare glimpse into what the world of Muv-Luv Alternative is like outside of Japan. When an uptight Japanese cadet gets stationed at a British military base during the final leg of his Royal Guard training, he thinks he’s got it all figured out. But he soon discovers that there’s more to being a surface pilot than sheer discipline when he’s assigned to the Cerberus Battalion, an esteemed TSF corps full of elite but eccentric surface pilots. Alongside a trio of buxom babes whose frisky flirtations throw him off at every turn, he’ll have to learn to loosen up and adapt to the unexpected in order to truly understand what it takes to be a soldier. Resurrection One month prior to the events of Muv-Luv Alternative, a cybernetic soldier named Silvio Orlandi arrives at Yokohama Base to work security detail at an upcoming Alternative Program summit — though in truth, he’s an undercover agent sent by the European Union for the express purpose of gathering classified intel about Alternative IV, as well as any other concerning projects the enigmatic Professor Kouzuki might have in the works. Upon arrival, however, he quickly discovers that this won’t be a simple recon mission, as the Professor’s personal detachment — the Valkyrie Squadron — seems perpetually poised to distract him at every turn. And yet, their playful attitudes and suggestive antics seem to indicate that they have no real intention of obstructing his mission… but could it truly all be just a coincidence? Or is there more to this situation than meets the eye? A Shimmering Shard of Spacetime The long-awaited follow-up to the original Muv-Luv saga is finally here! Picking up directly where Muv-Luv Alternative left off, Takeru returns to the wacky rom-com world of Muv-Luv Extra, only this time, things are more than a little bit different! When we last left Takeru, he’d just been introduced to his new classmates — the multimillionaire Meiya, her courtly sister Yuuhi, and the timid transfer student from overseas, Kasumi. Our story picks up with a class cook-off to determine who gets the privilege of sitting next to Takeru, but this is quickly overshadowed by a much more interesting reveal two days later. It seems Kasumi won’t be the only foreigner to grace the halls of Hakuryo Prep this year, as the school board has decided to participate in an all-new “teacher exchange program,” welcoming faculty members from all over the world in an effort to broaden students’ horizons. So you see, this isn’t just a simple rehash of Extra. No, this is an all-new adventure with all-new friends and possibilities. This is Final Extra. Join Takeru and the gang as they take part in all sorts of zany antics, from a school-wide airsoft tournament, to hitting the slopes at a mountain hot spring lodge, to getting caught up in an international conspiracy, to learning the true meaning of Christmas, to an all-expenses paid tropical island getaway — where Takeru might just have the chance to live out his wildest fantasies with the apple of his eye. Anything can happen in this new, rewritten reality — this Altered Fable — and it’s your story to unfold.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/889710/header.jpg?t=1655953126",
    "Price": 29.99,
    "Developers": "aNCHOR Inc.",
    "Publishers": "aNCHOR Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_60227886c8ee4f43dc13d4a7c84c2a50b6d0de77.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_b7abd0809ee53e98f2f41e98cdc9b4df5e4de5bb.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_2942d58592fcd5a55e9f8ea591a12a659f365263.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_830f7df04f3f2dd594ebb106ad90a917ecc2bb5f.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_3d9c783945cd0d0860fc04c8480b04fbd8913b0f.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_3c01f27109c54f8f4bfa10a1e701f44da73bf20b.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_f62963e8d204878aa454ccf44ef6219bef26de78.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_18bfbaa732b4ca11b49208aa3a0874146185a0e5.1920x1080.jpg?t=1655953126,https://cdn.akamai.steamstatic.com/steam/apps/889710/ss_3e4ef79c8e09b10b8c8f440d7be8e97d2c1b56bc.1920x1080.jpg?t=1655953126",
    "Slug": "muv-luv-photonmelodies",
    "Meta Title": "Muv-Luv photonmelodies♮: Jul 29, 2020, aNCHOR Inc. and Fu...",
    "Meta Description": "Looking for information on Muv-Luv photonmelodies♮? Check out the release date (Jul 29, 2020), developer insights from aNCHOR Inc., and a complete game ...",
    "Alt Text Image": "Official header image for Muv-Luv photonmelodies♮ game - Steam 889710",
    "Canonical URL": "https://gusku.site/game/muv-luv-photonmelodies",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Muv-Luv photonmelodies\\u266e\", \"description\": \"Looking for information on Muv-Luv photonmelodies\\u266e? Check out the release date (Jul 29, 2020), developer insights from aNCHOR Inc., and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"aNCHOR Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"aNCHOR Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/889710/header.jpg?t=1655953126\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}