{
    "AppID": 864130,
    "Name": "My Magical Demon Lover",
    "Release date": "Oct 2, 2018",
    "About the game": "Tristan dreamed of being a wizard his entire life, but has no idea what it will cost him. He's the great grandson of the wizard who protects his village and the first one to show any affinity for magic in three generations. After waiting fiveever for his great grandfather to take him as his apprentice it's finally happened! He's been summoned up to the tower where his great grandfather watches over the village. But it's not what he expects... Percival has no intention of mentoring him. He's eager to leave for a smutty vacation from his village-protecting duties. Tristan needs to take over, and that means picking a mentor from three demons Percival lined up for him. The demons will give Tristan the magic he needs to become a wizard, but for a price! ...His butt. Fortunately these demons love humans and really want to connect with one. Tristan has a chance to fall in love with one of three demons, but which one will he chose? Spicy Ecchi Content + A Yaoi Fantasy Story + A Dash of Comedy = My Magical Demon Lover, a 'mature players' dating sim that puts the wannabe wizard Tristan with his choice of three hot demons. Press 'v' on your keyboard to have all text read aloud. Three sultry routes, 50,000 words, and 10 endings! Choices matter and there's a high replay value. Pick correctly for maximum love, wizarding skills, and sexy times! Includes an original sound track and over 50 computer graphics to illustrate every spicy scene! Everyone thought Tristan was going to be the worlds next greatest wizard. But then he graduated from school, never got summoned to be a wizard, and became a loser. After years of shitty work in a shitty tavern his ship has finally come in! Tristan wants to be a wizard more than ever now. Percival is Tristan’s perverted great grandfather who became immortal at fifty. He’s protected the village for 100 years. He feels he’s due for a vacation, and Tristan is just the guy to cover for him while he takes off to the Pleasure Realm. Harse lost his beloved in the underworld and is incapable of loving another demon. He wants to be with a human and learn to share his love again. He’ll be a kind, loving, and gentle mentor–but he’s all seme (a top). Karn is looking for a human to dominate into submission. As the most powerful demon of the underworld he can give Tristan the strongest magic–but it’s going to be rough! Karn is versatile and can be either seme (top) or uke (bottom). If Tristan isn’t interested in sex with a demon he might want to pick Soren, who doesn’t want sex. What he wants instead, however, is a little weird… When he does have sex Soren is all uke. Other Games from Y Press Games",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/864130/header.jpg?t=1651801823",
    "Price": 9.99,
    "Developers": "Y Press Games",
    "Publishers": "Y Press Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_a12c889823694dfd8c3054a7308d6a6b68aef87b.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_74efa8d312b2bb662499fc02660c2f1761f6eee1.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_4a87ec04c112ab5bd880559616542cd719b46d45.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_0242c86d59f1fb130b09867d54e0f00637a14085.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_078358684235b68ecbe179a35a4e554625bf93cc.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_583233b672595c12cec7f3719a976ea3c0cc22df.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_b2a284f1635812be6d9851ba1425fb2ba73434dd.1920x1080.jpg?t=1651801823,https://cdn.akamai.steamstatic.com/steam/apps/864130/ss_d61351cda6de8a21b474f01c3eb087619cda6743.1920x1080.jpg?t=1651801823",
    "Slug": "my-magical-demon-lover",
    "Meta Title": "My Magical Demon Lover: Oct 2, 2018, Y Press Games and Fu...",
    "Meta Description": "Looking for information on My Magical Demon Lover? Check out the release date (Oct 2, 2018), developer insights from Y Press Games, and a complete game ...",
    "Alt Text Image": "Official header image for My Magical Demon Lover game - Steam 864130",
    "Canonical URL": "https://gusku.site/game/my-magical-demon-lover",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Magical Demon Lover\", \"description\": \"Looking for information on My Magical Demon Lover? Check out the release date (Oct 2, 2018), developer insights from Y Press Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Y Press Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/864130/header.jpg?t=1651801823\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}