{
    "AppID": 578060,
    "Name": "Noda",
    "Release date": "Oct 22, 2020",
    "About the game": "Understand and Be Understood Our minds hold complex ideas connected in ways we cannot fully examine unaided. We often create symbolic representations of our thoughts – brainstorms, diagrams, mind-maps – but our ability to explore and represent them is limited by traditional 2D tools like whiteboards, mind-mapping software, and paper. We think and live in 3D and our thoughts are endlessly complex - no screen or wall can adequately capture or reflect them. Noda makes it possible. In Noda, your ideas take shape around you and can be mapped in limitless, multidimensional space, giving you more room to think and associate ideas. Your body’s natural abilities - movement and voice – enhance and ease the process of building conceptual structures. If traditional concept mapping tools are like architectural plans, Noda is an actual house. In Noda, shapes - along with their color, labels and spatial location - hold concepts. Links show relationships between them. This format supports representing anything where relationships between concepts is important. People are using Noda for mind-mapping, planning projects, plotting videos and articles, storyboarding, website flows, network diagrams and lesson plans. You also might use Noda to construct memory palaces, model molecular structures, or simply hang out with friends in virtual space. With multiplayer functionality available at all package levels, you can use Noda to build mental models as a reflective, independent exercise, or invite others to collaborate, co-create and explore the paths and structures of your ideas. You might invite friends or colleagues to brainstorm and build out a concept with you. Or you could bring an audience in for a walkthrough presentation of your ideas. Noda allows for interactions and demonstrations that are not possible in physical reality, like floating up together to examine a model built in vertical space. Noda’s free-to-play version provides multiplayer functionality and the ability to save a single map of up to 50 nodes. Welcome to Noda – A Space for Connected Thinking",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/578060/header.jpg?t=1603388187",
    "Price": 0.0,
    "Developers": "Coding Leap",
    "Publishers": "Coding Leap",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/578060/ss_d44d07c41a06a8147e3c9cd745b90509e977db87.1920x1080.jpg?t=1603388187,https://cdn.akamai.steamstatic.com/steam/apps/578060/ss_d203d03dd387bddcdb87c7d59e035d4fcf43256e.1920x1080.jpg?t=1603388187,https://cdn.akamai.steamstatic.com/steam/apps/578060/ss_5229a30ce916c89161527d92259c1e7221042bdc.1920x1080.jpg?t=1603388187,https://cdn.akamai.steamstatic.com/steam/apps/578060/ss_2bb0fc5ae9fb1b4f55f590ccc725f9a827341efa.1920x1080.jpg?t=1603388187,https://cdn.akamai.steamstatic.com/steam/apps/578060/ss_28c8403471866ab747d35f6604f9e7419f21ddea.1920x1080.jpg?t=1603388187",
    "Slug": "noda",
    "Meta Title": "Noda: Oct 22, 2020, Coding Leap and Full Overview",
    "Meta Description": "Looking for information on Noda? Check out the release date (Oct 22, 2020), developer insights from Coding Leap, and a complete game summary.",
    "Alt Text Image": "Official header image for Noda game - Steam 578060",
    "Canonical URL": "https://gusku.site/game/noda",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Noda\", \"description\": \"Looking for information on Noda? Check out the release date (Oct 22, 2020), developer insights from Coding Leap, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Coding Leap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Coding Leap\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/578060/header.jpg?t=1603388187\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}