{
    "AppID": 608110,
    "Name": "Null Vector",
    "Release date": "May 3, 2018",
    "About the game": "Trade. Gamble. Fight! Null Vector is a twin-stick shooter that seamlessly blends rogue-lite strategy with retro-style fun. Navigate six randomly generated sectors filled with danger and opportunity as you fight to confront the Final Boss. Discover and experiment with thousands of possible weapon combinations to maximize your firepower. Trade and gamble for new ship parts, each adding a unique and deadly dimension to your arsenal. Overpower your enemies and unleash your own bullet hell upon the Final Boss! Machines scattered throughout each sector provide strategic opportunities to trade and gamble your hard-earned Crystals and skillfully-conserved HP for new ship parts or upgrades. For example, use the Converter to trade HP for Crystals or vice-versa, the Crusher to destroy unwanted parts for rewards, or the Mechanic to permanently weld ship parts to make room for bigger and better combinations. With difficulty modifiers to change the game up, there are hours of fun and challenge to be had as you dodge enemies, create powerful weapon combinations and blast the Final Boss into oblivion. And, if you feel more adventurous, Hell Mode awaits… What are you waiting for? Plug in your controller and unleash your own bullet hell in Null Vector! Developed solely by Alex Miele (Optical Override) with music and audio by Adam Alake. On the other side of the screen, it looks so easy… Battle your way through six sectors of bullet-hell, as you fight through waves of enemies and Mini-Bosses to find and defeat the Final Boss. You’re gonna need a bigger ship… Create powerful weapon combinations from 15 ship parts that you can earn, gamble for, or discover. Ricocheting homing rockets... Dual lasers… An army of robot minions... The choice is yours! Trade, Gamble, Triumph... Strategically use machines to improve your loadout and increase your odds. Consider between trading your crystals to upgrade your parts, converting HP into Crystals for later use, welding a part to increase your loadout, and many more options! It’s all about the numbers… Rack up the highest score by avoiding damage, collecting multipliers, and clearing each room as efficiently as possible. Turn the difficulty up to 11… Use the modular difficulty settings to customise your run and achieve the highest score. Better yet, enter Hell Mode and take on unforgiving enemies that won’t let up, if your mind and hands can take it, that is. Ready Player Two? Bring a co-pilot to the battle with local couch co-op.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/608110/header.jpg?t=1600274498",
    "Price": 4.99,
    "Developers": "Optical Override",
    "Publishers": "Optical Override",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_542f2ed61bd804ba508df2b53feddbf0508f6639.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_7d78d3a1cf7de25a5c81ea982c0dc855dce70a16.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_f291edb49aa5bfb2abdbe2fc211231246d98c065.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_c4376a8e98441ee48ddb60d54552bc769b1db6ef.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_d4f2e3d77cd9543aeaf27364381be43b6688230b.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_3e40eb8617f38530795df9d94d19ab29280ddb78.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_c9172683b6ca3f5432ce5aae8ab528ae35cddc1a.1920x1080.jpg?t=1600274498,https://cdn.akamai.steamstatic.com/steam/apps/608110/ss_b4809876c534c20910a020cf3ebc9300f11c47ac.1920x1080.jpg?t=1600274498",
    "Slug": "null-vector",
    "Meta Title": "Null Vector: May 3, 2018, Optical Override and Full Overview",
    "Meta Description": "Looking for information on Null Vector? Check out the release date (May 3, 2018), developer insights from Optical Override, and a complete game summary.",
    "Alt Text Image": "Official header image for Null Vector game - Steam 608110",
    "Canonical URL": "https://gusku.site/game/null-vector",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Null Vector\", \"description\": \"Looking for information on Null Vector? Check out the release date (May 3, 2018), developer insights from Optical Override, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Optical Override\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Optical Override\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/608110/header.jpg?t=1600274498\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}