{
    "AppID": 388980,
    "Name": "Race Track Builder",
    "Release date": "Aug 20, 2015",
    "About the game": "UPDATE: From July, 2018 Google now requires Billing to be enabled. They include $200 worth per month, more info here ... / Race Track Builder is a software design tool that has a simple, easy to use interface that allows you to build fantasy race tracks or use Google Maps data to create real-life terrain and roads. For examples of the current features take a look at the TUTORIALS . Keep track of development on Facebook ... Free Upgrades Additional functions that have already been added since the initial release: Expansion Packs - more textures, materials and objects have already been added since the initial release and more content is on its way. Objects - trees, signs, barriers, pit stands, cones, tyres, fences - all can now be added into your track. Complex Objects - parent-child relations create a more complex object with greater variety. String-Objects - Make long lines (strings) of objects and quickly move them about as your design evolves. Walls - edit the cross-section and customise the look of walls. Start/Pits/Timing Positions - Set Grid/Pit positions and Timing Gates that are exported to AC. Fast Undo/Redo. Windows 64 bit support. 16k &amp; 8k textures in addition to lower resolutions already supported. Super fast GPU texture painting. Additional functions will be added as free upgrades as they are developed. Many of the BTB functions will be integrated into the new interface and many entirely new features are planned as upgrades occur each month. More Terrain editing tools for greater control. Objects - more content and improved interface. String-Objects - more content and align-to-track tool. Intersections - pre-textured sections will make intersections a cinch. Expansion Packs (Xpacks) including additional textures, materials, objects, string-object and cross-sections definitions. ... and much more. RTB exports to the Autodesk FBX format which can then be loaded into 3d modelling tools for export into games with a little more work. This opens up RTB to more game developers and this in turn will generate more RTB content (XPacks) for people to use across all types of games. In time export direct to game may be added for some titles but initially the focus is on supporting many titles. The first title with specific support is Assetto Corsa with materials and shaders created to replicate the shading used. The landscape uses Multilayering shading with support for direct modification of the underlying texture. When targeting Assetto Corsa the export prepares the objects ready to be imported into the AC Editor, generating the Configuration file so that materials and textures are applied as they appearred in RTB. More information ... / Like on Facebook ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/388980/header.jpg?t=1535842225",
    "Price": 59.99,
    "Developers": "Brendon Pywell",
    "Publishers": "Brendon Pywell",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/388980/ss_8236db5be83789d32cb766739eaa3ff5a405168e.1920x1080.jpg?t=1535842225,https://cdn.akamai.steamstatic.com/steam/apps/388980/ss_eae209308c10cd44915754d30cbbd90983aeb87b.1920x1080.jpg?t=1535842225,https://cdn.akamai.steamstatic.com/steam/apps/388980/ss_89c2dfa480850cb02ef0c4148216c7f6f263bc61.1920x1080.jpg?t=1535842225,https://cdn.akamai.steamstatic.com/steam/apps/388980/ss_fbeba30a5ba1d6a8a32fb7f31f45698c92f7da5c.1920x1080.jpg?t=1535842225,https://cdn.akamai.steamstatic.com/steam/apps/388980/ss_7617767a25ff91d6fbf8f3ca1f40afe2c8e0cc90.1920x1080.jpg?t=1535842225",
    "Slug": "race-track-builder",
    "Meta Title": "Race Track Builder: Aug 20, 2015, Brendon Pywell and Full...",
    "Meta Description": "Looking for information on Race Track Builder? Check out the release date (Aug 20, 2015), developer insights from Brendon Pywell, and a complete game su...",
    "Alt Text Image": "Official header image for Race Track Builder game - Steam 388980",
    "Canonical URL": "https://gusku.site/game/race-track-builder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Race Track Builder\", \"description\": \"Looking for information on Race Track Builder? Check out the release date (Aug 20, 2015), developer insights from Brendon Pywell, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Brendon Pywell\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brendon Pywell\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/388980/header.jpg?t=1535842225\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}