{
    "AppID": 1351820,
    "Name": "Shivering Hearts",
    "Release date": "Jul 21, 2020",
    "About the game": "Explore a unique fantasy setting with your childhood friend, Rin, and uncover what ills are plaguing the village of Shivering Hearts. Become enraptured by a colourful cast of characters and experience beauty, heart-ache, romance, death, hope, nihilism, betrayal, regret, loss, and maybe even help someone on the verge of complete mental collapse. Features Beautifully detailed, hand-drawn watercolour landscapes and characters. An emotionally gripping story that reacts to your choices. Meet a cast of 17 characters, each with their own personalities, goals and dreams. The game is a complex web of intricate dialogue choices and cascading consequences. Almost every choice has unique dialogue and outcomes. No combat or leveling. This might seem strange to put as a 'feature', but I don't want to misrepresent the experience as a typical RPG, even though I would love to design such mechanics Free Demo Check out the free demo above for an exclusive ending! I believe demos are great for people to try out an experience and see if it resonates with them without committing to a price point. Why I made this Over the past 9 months, I created Shivering Hearts by myself with RPG Maker MV in my free time to show my artistic skills. I also wanted to create something that brings back the magic that I sorely miss from old school 1990s PC RPGs like Baldur's Gate 2, Fallout 1, 2, and Planescape; Torment. CLANNAD, Undertale, LISA: the Painful RPG, and Oneshot were also huge influences. Role Playing Games can be so much more than combat, stats, character builds and optimal play (however, I still value these game design aspects very, very much). I wanted to challenge myself to see if I can still create an engaging experience that doesn't have combat or leveling mechanics, within a 1 month period. That turned into 10 months. I wanted to make a game with deep conversation trees, memorable characters and an emotionally touching story. RPG Maker MV allowed me to create and bug-test very intricate dialogue trees that match the quality and scale of those older titles but at the fraction of the development time and with plenty of polish. I hope that I have done those games justice.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1351820/header.jpg?t=1595890797",
    "Price": 7.99,
    "Developers": "Mischa",
    "Publishers": "Mischa",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1351820/ss_dd7f403d47edf121b7cd840ac1f98e17e8fcdb99.1920x1080.jpg?t=1595890797,https://cdn.akamai.steamstatic.com/steam/apps/1351820/ss_4c8528dea2f0707450c57223e7e1aabd6f4407bf.1920x1080.jpg?t=1595890797,https://cdn.akamai.steamstatic.com/steam/apps/1351820/ss_42588ce7d7c46fae57f054a39f466cfaa9f925d7.1920x1080.jpg?t=1595890797,https://cdn.akamai.steamstatic.com/steam/apps/1351820/ss_2ca8f0235c2b8088b2a698c7651fdd3bad11be15.1920x1080.jpg?t=1595890797,https://cdn.akamai.steamstatic.com/steam/apps/1351820/ss_d93652bb47b786cb800f43e8004a288db345971e.1920x1080.jpg?t=1595890797,https://cdn.akamai.steamstatic.com/steam/apps/1351820/ss_647a4cfa3df18cd1441f467280649a3a747107a8.1920x1080.jpg?t=1595890797",
    "Slug": "shivering-hearts",
    "Meta Title": "Shivering Hearts: Jul 21, 2020, Mischa and Full Overview",
    "Meta Description": "Looking for information on Shivering Hearts? Check out the release date (Jul 21, 2020), developer insights from Mischa, and a complete game summary.",
    "Alt Text Image": "Official header image for Shivering Hearts game - Steam 1351820",
    "Canonical URL": "https://gusku.site/game/shivering-hearts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shivering Hearts\", \"description\": \"Looking for information on Shivering Hearts? Check out the release date (Jul 21, 2020), developer insights from Mischa, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mischa\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mischa\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1351820/header.jpg?t=1595890797\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}