{
    "AppID": 340320,
    "Name": "Sinless + OST",
    "Release date": "Dec 16, 2015",
    "About the game": "Sinless is a unique combination of a classic point and click and a visual novel with many references and inspirations from classics of the genre, such as Snatcher, or Rise of the Dragon. Add to that custom, in-house designed lighting and parallax effects, along with a dedicated awesome Soundtrack and original storyline, we hope you will enjoy your stay! Welcome to the Omni-Care sanctioned city. The world as we know it has come to an end and a New Order has taken over. Life is seemingly perfect, in an almost utopian society humans have to officially schedule their whole days in advance via 'ports' - mandatory cybernetic implants. Large commercial entities who also happen to be port manufacturers have replaced governments and crime is practically non existent. You are the hero of this exciting cyberpunk tale, about to start a regular day, only for it to unfold in the most unexpected manner revealing the true nature of the multi-layered city. FEATURES A unique, carefully planned out story and lore: It is important to remember that you are thrown into a world of specific rules, laws, customs, lingo, social segregation etc which you will learn and unravel in time along the way. Old school gameplay: meaning little to no handholding. We wanted to give the player the choice of freedom and to discover and unravel the story at their own pace, hence Sinless offers little to no handholding. Therefore many features or lore related backstories/explanations are not thrown in your face. Instead they are somewhere in the world, waiting to be discovered; be it a feature, Easter Egg/game reference, or world news event etc. But fear not, optional hints highlighting interactive points will be available from the get-go. Hand crafted with love: Thousands of frames of hand crafted animations, graphics,textures and other assets. We put a lot of effort and attention to the lore and story as well as the general vibe- that the graphics and soundtrack complement themselves to create the desired tone. A fitting and engaging dynamic Original Soundtrack by Roland Redwood, designed and tailored specifically for the game. Custom inhouse designed visual features: Taking the extra horsepower of computers to good use, the Steam edition of Sinless underwent a serious overhaul. For aesthetic reasons the game was originally designed in a 4:3 aspect ratio. Now, after countless hours of work, all assets have been reworked for a new 3:2 and 16:9 aspect ratio, with even more cool, custom inhouse designed lighting and post effects. We intensified the particle and weather effects as well, as well as reworked other assets to higher resolutions. Game Over: when we said 'old school' experience we were dead serious. You will die...alot. Well, maybe not that much as in the Souls series, but unless you are a point n' click pro, an unexpected end to your journey will be commonplace. Heck, we even took it a level further where discovering all possible endgames is a feature and accomplishment within itself. Luckily there's a checkpoint system which will take you back to the last safe point. And fear not, we left it at that (so no trolling in the vein of which some old school classics are notorious for example AITD, where you could break a mandatory quest item at the very beginning of the game)... but we can never be sure of what the future may bring... ;) Easter Eggs &amp; references. Yup, we got that covered. Sinless is a love letter to classic games,systems and news, both old and new. Rise of the Dragon, Dredd (2013), Deus Ex, Dark Souls, Sleeping Dogs.... the list goes on and on. Will you find them all? Stay safe Citizen. And don't forget to install your scheduled Progs!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/340320/header.jpg?t=1568805512",
    "Price": 4.99,
    "Developers": "MGP Studios",
    "Publishers": "Forever Entertainment S. A.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_8f373d56032ba9e33a397f3654dd04b21762442e.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_6944ef17fd556e0e581385174850ce2708b8bdfe.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_76c766ad527d691d6825a605fb4de253f5e86eb6.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_2627960fff3d09632ea9c0223fe99ce02bfe37ce.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_fd4f04137cdab1ffae15605bd97434b1fd648f65.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_7507899bcf146baa4de474d19cdab8b4bf81079a.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_fe6d33df8cf1d6390fc6f42c40a39b6f51d5be43.1920x1080.jpg?t=1568805512,https://cdn.akamai.steamstatic.com/steam/apps/340320/ss_d1b5c500650743f7dd5ebd7b583dcc375bcf9055.1920x1080.jpg?t=1568805512",
    "Slug": "sinless-ost",
    "Meta Title": "Sinless + OST: Dec 16, 2015, MGP Studios and Full Overview",
    "Meta Description": "Looking for information on Sinless + OST? Check out the release date (Dec 16, 2015), developer insights from MGP Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Sinless + OST game - Steam 340320",
    "Canonical URL": "https://gusku.site/game/sinless-ost",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sinless + OST\", \"description\": \"Looking for information on Sinless + OST? Check out the release date (Dec 16, 2015), developer insights from MGP Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"MGP Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Forever Entertainment S. A.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/340320/header.jpg?t=1568805512\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}