{
    "AppID": 851840,
    "Name": "Strangers of the Power 2",
    "Release date": "May 21, 2018",
    "About the game": "The castle within the town of Cloudfall has been taken over by an evil demon. Prince Helios has offered a huge bounty to anyone who's able to clear his family's castle and restore order into town. It is your task, as an adventurer to help defeat this evil, bring peace and gain whatever it is that's driving your own personal motivations. Characters Samano Samano is a Ronin who hears about the demon and wants to do this job of slaying the demon to bring honor and wealth to her fame. Wilhelmina Wilhelmina is a country girl who loves to fight, the stronger the opponent the better. She thinks of herself as the greatest demon hunter ever and wants to kill the demon to prove that right. Slavia Slavia is a Sorceress who wants to capture the demon. She's not interested in money or fame, she just wants a plaything that she can torture for fun and no one will judge her, if it's an evil demon that she can use for her sadistic fun. Hacathra Hacathra is a cleric, as a spiritual and a follower of a light, she's by her very nature drawn towards the vanguish of the demon. She's not really interested in money or fame and feels that this is simply said, her duty to smite the evil. Aurae Aurae is a hunter and a mercenary. She does help people for small moneys and volunteers to aid in destroying the demon, in exchange for some money. Miwafin Miwafin is a genie, who has received a wish about the demon's demise. While Miwafin is not the most powerful genie in the world, she is determined to fulfill the wish and end the demon's rampage, no matter what the cost. Michi Michi is a fun loving catgirl, who spends most of her time doing cat things, like scratching things and being lazy. However, she volunteers destroying the demon in exchange for all the milk that she can drink. (She can drink a lot of milk.) Bentley Bentley is a pirate, who hears about the demon. This is no good for anyone and business would suffer, so she offers to get rid of the demon in exchange for gold and jewelry.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/851840/header.jpg?t=1633417303",
    "Price": 3.99,
    "Developers": "Tuomo Laine",
    "Publishers": "Tuomo's games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/851840/ss_b2f71f122feab23d98ba2e9a4b437eaae82a9705.1920x1080.jpg?t=1633417303,https://cdn.akamai.steamstatic.com/steam/apps/851840/ss_7c43abfc991a8af3209a88b01c7df2bcbc39ff54.1920x1080.jpg?t=1633417303,https://cdn.akamai.steamstatic.com/steam/apps/851840/ss_6382cb0ca957f2eaacd4bdaf0858952e9385ccda.1920x1080.jpg?t=1633417303,https://cdn.akamai.steamstatic.com/steam/apps/851840/ss_206ca92db4e23a44b193c0c1b5505dbaab4e5df1.1920x1080.jpg?t=1633417303,https://cdn.akamai.steamstatic.com/steam/apps/851840/ss_7e9579d59f62ff323b6f2c3f4f60d4dcada77159.1920x1080.jpg?t=1633417303",
    "Slug": "strangers-of-the-power-2",
    "Meta Title": "Strangers of the Power 2: May 21, 2018, Tuomo Laine and F...",
    "Meta Description": "Looking for information on Strangers of the Power 2? Check out the release date (May 21, 2018), developer insights from Tuomo Laine, and a complete game...",
    "Alt Text Image": "Official header image for Strangers of the Power 2 game - Steam 851840",
    "Canonical URL": "https://gusku.site/game/strangers-of-the-power-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strangers of the Power 2\", \"description\": \"Looking for information on Strangers of the Power 2? Check out the release date (May 21, 2018), developer insights from Tuomo Laine, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tuomo Laine\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tuomo's games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/851840/header.jpg?t=1633417303\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}