{
    "AppID": 247000,
    "Name": "Talisman: Digital Edition",
    "Release date": "Feb 25, 2014",
    "About the game": "Welcome to the world of Talisman. A land filled with perilous Quests, Enemies and challenges. But with it comes an adventure you’ll never forget. Choose from a roster of characters who have unique strengths, weaknesses and special abilities. Select your adventurer carefully as their skills could be the key to you getting your hands on the mighty Crown of Command. A magical artifact that holds the power to destroy all rivals, the Crown of Command has the power to make the bearer the true ruler of the kingdom. Your adventure to the Crown of Command won’t be an easy one. You’ll need courage, patience and some good dice rolls to survive the dangers you will face. Deadly monsters, tricky traps and magical disasters will try and stop you at every turn! Talisman: Digital Edition is the officially licensed digital version of the classic fantasy adventure board game, Talisman. Using the 4th Revised Edition rules, choose from 16 characters and venture out on a perilous journey to be the first to claim the Crown of Command. Grab up to 5 friends online or locally and delve into a Talisman adventure! Online games can be saved and continued at a later date if needed, so no need to worry about time limits! Or if you fancy looking your opponents in the eyes as you face them in deadly combat, Talisman: Digital Edition can be played in hot-seat mode. Do you see yourself as Good, Neutral or Evil? Depending on which character you decide to play they’ll have a pre-set alignment which can change how you will interact with spaces. However, alignment can be changed throughout the game if you encounter certain cards or spaces. As you adventure through Talisman anything could happen… Most spaces on the board will require you to draw one or more Adventure Cards. These cards could reveal an Event, Follower, Enemy, Places, Stranger or Objects which could include powerful weapons or magical artifacts. Adventure Cards are critical to building your character’s inventory and becoming more powerful. Before you head to claim the Crown of Command, you need to make sure you’re powerful enough! The challenge ahead isn’t an easy one, the Inner Region is fraught with danger and creatures with high Strength and Craft. Levelling up your characters Strength, Craft, Lives, Fate, and Gold isn’t too difficult, but you can lose it just as quickly…. You can pick up resources by earning Trophies, visiting certain Place Cards or spaces on the board or through the Objects you find. When you’re strong enough it’s time to climb the steep steps up to the Crown of Command, where you can conquer all and rule your kingdom. Account Leveling Each game of Talisman earns you Experience Points (XP) towards the global leaderboards. Prove you’re the mightiest adventurer! Talisman is a game like no other… Are you ready to do what it takes to rule the land?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/247000/header.jpg?t=1654078971",
    "Price": 6.99,
    "Developers": "Nomad Games",
    "Publishers": "Nomad Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_c264dc1cd3cec98b405719847eac13f98c6f3a50.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_69901bf11a90eea0360923001ed9ef10588c11d9.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_8b98ed92b693d177a33f230a2092e310b69ed952.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_27f9255cdc8f78012161502cff0304c054313a72.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_9cbab4755ea0a8da0ba5b48e710a6917c7c8d1bb.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_2efc4df817fe50a415f8c973420e9ce53b766401.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_eebe30270e469112dc78ebd1c32e5065c8664779.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_171b9eaabaf2040e9d1badbe5780d3177aaf7a8d.1920x1080.jpg?t=1654078971,https://cdn.akamai.steamstatic.com/steam/apps/247000/ss_eeab4863943e381b12fd1be4572765cd687d1c2c.1920x1080.jpg?t=1654078971",
    "Slug": "talisman-digital-edition",
    "Meta Title": "Talisman: Digital Edition: Feb 25, 2014, Nomad Games and ...",
    "Meta Description": "Looking for information on Talisman: Digital Edition? Check out the release date (Feb 25, 2014), developer insights from Nomad Games, and a complete gam...",
    "Alt Text Image": "Official header image for Talisman: Digital Edition game - Steam 247000",
    "Canonical URL": "https://gusku.site/game/talisman-digital-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Talisman: Digital Edition\", \"description\": \"Looking for information on Talisman: Digital Edition? Check out the release date (Feb 25, 2014), developer insights from Nomad Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nomad Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nomad Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/247000/header.jpg?t=1654078971\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}