{
    "AppID": 1265280,
    "Name": "The 99",
    "Release date": "May 8, 2020",
    "About the game": "The 99 is not a simple quiz. There are many different game modes here that only have one thing in common: 99 possibilities per round! Take a look at the 1vs.1 [/]: Random blocks appear. You should always merge two of them as a pair. 99 possible pairs are in play. The problem? Not all blocks are always in the game. This is how you fight for your high score against time, against randomize and against your knowledge. In 2vs.all [/] things are even more difficult. The blocks come on one side. On the other hand, there are only two large fields with assignment options. More pressure! In these two game modes, the game is constantly manipulated while you try to find all 99 pairs. You can also let new blocks appear yourself. But be careful - the space is not limitless! So plan carefully because a lot of timers run in the background. Each of them changes the game at short notice and makes blocks appear, disappear or change. And as if that weren't enough, there's a hard mode. There are random events every 99 seconds (and at ever shorter intervals). Sometimes the whole screen fills up. Sometimes the blocks turn. There are already a number of events. Things are a bit quieter in the Topsort [/] mode. There you are simply thrown 40 blocks, which you should sort as quickly as possible and without storing them incorrectly in the top 1 to top 20 places. The freequiz [/] mode is the classic quiz mode for up to 16 players. However, currently only possible locally. Because here you have the opportunity to determine the rules yourself. Simply enter the number of players and names and you will be asked random questions. You can decide when you reveal the answer, take the next question or how you distribute the points. This leaves room for discussion in large groups. It's also relaxed in the PuzzleMe [/] mode. You will be presented with one of 99 random 25-piece puzzles. Solve it and enter the correct answer. ThinkTank [/] is based on the classic 'You don't know Jack'. In the middle you see a statement, in random order and time now other statements are added. If something fits together, press your button. Other planned game modes: [/] (Almost finished) - Resolution = Pixelated images that make themselves more visible in seconds. The chain = There are terms floating around and terms belonging to them. The player should assign and pin the terms so that a chain forms under each term. Letter salad = The solution word has unfortunately got mixed up. The player has to sort the letters. Reime = It's Reimtime! Very popular back then, I'll try it. Duel = based on the good old family duel. We asked 3 billion players: name ... Extension to multiple languages. Currently designed for German-speaking countries. Which is why some categories make little sense for English-speaking players. Other features: [/] Completely randomly generated! No round is the same. Single player or up to four players locally. In-game achievements Random events in hard mode. Playing perks with which you can influence the current round. Extensive How to Play Dictionary Increasing scoring Can be expanded as required using simple CSV lists. Gladly suggestions from players! In almost all game modes: The 99! -&gt; Find 99 pairs, solve 99 puzzles, correct 99 statements. Almost everything is designed for the 99. Caution: Partially only completely solvable for nerds and very hard! [/] Please be aware that this game is originally designed for germany. So at this time of devolopment there are some more categories that doesn't make sense if you don't know german or german history! But you can send me your own categories for your country!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1265280/header.jpg?t=1588960947",
    "Price": 0.99,
    "Developers": "Dungeons & Popculture",
    "Publishers": "Dungeons & Popculture",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_abcd86662de9e8b5c054c2f4a9fcb53636309472.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_d828c6849e91e8fd60baad607e3ba57a34c8fd6b.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_7f0ee8c2ef33e63f52a8b1c1d32cdf954ed48b3d.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_92c8d33ff93cdb40b40046610590c386013ad64b.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_d2ddf1d50ce45965b104c1f7979e7a5dd4bae14b.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_8ab887cbebdd8c2aa3900b5a040b3f53cae0e90d.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_d9c5d46b0bbb0be1a4863539cbcf78c237c332c9.1920x1080.jpg?t=1588960947,https://cdn.akamai.steamstatic.com/steam/apps/1265280/ss_c28a12ca635d8fb7de36cbadfaf6163df600ff8e.1920x1080.jpg?t=1588960947",
    "Slug": "the-99",
    "Meta Title": "The 99: May 8, 2020, Dungeons & Popculture and Full Overview",
    "Meta Description": "Looking for information on The 99? Check out the release date (May 8, 2020), developer insights from Dungeons & Popculture, and a complete game summary.",
    "Alt Text Image": "Official header image for The 99 game - Steam 1265280",
    "Canonical URL": "https://gusku.site/game/the-99",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The 99\", \"description\": \"Looking for information on The 99? Check out the release date (May 8, 2020), developer insights from Dungeons & Popculture, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 8, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dungeons & Popculture\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dungeons & Popculture\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1265280/header.jpg?t=1588960947\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}