{
    "AppID": 545540,
    "Name": "The Infectious Madness of Doctor Dekker",
    "Release date": "May 19, 2017",
    "About the game": "YOU are a psychiatrist, trying to solve a murder whilst treating the unusual patients of the recently deceased Doctor Dekker - but nothing is as it seems. Type any question - and your patients will reply in full screen video. They'll have questions for you too but be careful what you say. Your words will determine their eventual fates, and your own! MAIN FEATURES FMV! - 1600+ full screen HD video responses FREE TEXT INPUT - Ask whatever you want, type questions, phrases or just keywords. SUGGESTED QUESTIONS - No keyboard? No problem. Pick from our suggested list. MULTIPLE ENDINGS - Find out whodunit, and what happens to you and your patients... MULTIPLE STORIES - 6 main suspects and 5 side-quests inc. John Guilor ( Contradiction ) RANDOM MURDERER - Chosen at the start of the game to combat spoilers SIMPLE UI - View evidence, make notes, watch replays, see your question history ACHIEVEMENTS - Steam achievements and a dynamic descriptive rating system GUINNESS WORLD RECORD - for 'The most Full Motion Video (FMV) in a videogame' WARNING - This game contains mature themes and psychological horror (including sexual themes, violence and suicide) and by its very nature is open to wide interpretation - so although not originally intended, some topics such as rape and parricide can also be inferred. Recommended for adults only. FULL DETAILS The Infectious Madness of Doctor Dekker is a Lovecraftian FMV murder mystery, which gives players full freedom to question suspects by typing their own questions instead of picking them from a predetermined list. There are no point and click puzzles to solve, just questions to ask and evidence to inspect. Finding out who killed Dr Dekker is only one part of the puzzle; working out how to fix the chaos he left behind will be so much trickier… As well as providing clues to the murder, each patient has their own bizarre problem they need your help with – from time manipulation and re-animated loved ones to horrors under the sea. Complete with an atmospheric soundtrack, The Infectious Madness of Doctor Dekker invites you to explore the shadow reality that your patients inhabit – a world full of paranormal strangeness and horrors that go bump in your head, where all you have to rely on is your own mind. Just try not to lose it... CREDITS You.............................The Doctor Aislinn De’Ath..................Marianna Bianca Beckles-Rose........Jaya Dom Lister......................Nathan Helen Jenkinson..............Elin Helga Ragnars................Claire Millin Thomas..................Bryce Mark Kitto.......................Professor Alderby and guest starring John Guilor as Professor Warwick. Additional patients played by ... Carolyn English, Catherine Stacey, John Shields and Rosie Hefferon. Directed by Tim Cowles. Note : Steam overlay is only available on the Windows platform for this game. FAQ How do you progress through the game? You play through a series of five therapy sessions. Each session you'll talk to several patients, and traffic lights tell you which patients you've unlocked so you can move on. Yellow is unlocked, but you can keep talking to reach green and find all their possible responses. On the final accusation screen you choose whodunit and if you've picked correctly the game finishes and plays your ending videos. Automatic saves mean there's no way to rollback something you've said to a patient, so be careful with that. That's it in a nutshell, but we can't tell you everything, or there'd be no surprises... What happens if I ask a question they don't have an answer for? As long-time fans of FMV games and point-and-click adventures, we're all-too familiar with the 'That's not gonna work' or 'I think I'll have to try that again' phrases repeated over and over. That's why we've given the patients lots of different ways of saying 'I don't know' - most have over 40 in fact, including some that contain clues that lead you to new storylines. Is this game an AI simulator? No. A lot of the time you might get 'don't know' answers to your questions, because there are only 1600+ actual filmed responses in the game. Listen to what patients say and follow their lines of conversation to stay on track. Responses are keyword based, so literally typing words patients have already used will do half the job for you. How many acts are there? There are five acts in total. Each act is a self-contained episode, so it's possible to ask questions (and get responses) in any order to reveal the story. Some decisions you make will affect future acts, so once you hit the continue button there's no going back! What if I get stuck? We've tried to design the game so you don't get stuck, but if you do, just type 'Hint'. Think of it as asking for advice, and you'll need a lot of it if you're trying to find every response (aka going green). Make sure you've properly watched the help video too. The new 'suggested questions' list also gets you to the finish line without having to type anything. If the murderer is chosen at random, does that mean it's replayable? The game can be replayed, but it wasn't designed with that in mind. We wanted everyone to be able to experience as much of the game as possible without needing multiple plays, so branching generally removes just a few responses at a time. That said, you will have to replay the game if you want to find *all* the videos and unlock all the achievements and endings.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/545540/header.jpg?t=1640197032",
    "Price": 8.99,
    "Developers": "D'Avekki Studios Ltd",
    "Publishers": "D'Avekki Studios Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_12dd08bcf658fa0b041aea63b998751110b238fc.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_2e256e6eb8b97845e908c40289d14243abf1730f.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_ca68ae4a4a66d4c2100ab735844420aed9c71e27.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_8d026ee0cb2b4f22dd61aee43683858b459193b5.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_396e98fd4a23a519a77468a136dd28714b9db41e.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_86857a717daa1f44849e499ae481949e75a6d66d.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_8b14561aef777fbd6b63e0ea1848b8322d6a8d56.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_655ae34798e6cc029246a8538047b0e90401e0c9.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_2b2eadad1601282b2907c2c78936ff4fc884d8a3.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_1a51356a8d899ca02b583874efbc80d5deaeaab5.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_5872ad61a1ffaa04418801750bd95dfb7009a9ee.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_bac99130d5e33bd530b98ab5172d4803133a5840.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_2060d161a203d697151583e7a3ce142ccc8157d7.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_1cb5c98fada5c8c267d174cb98aae63828d0040b.1920x1080.jpg?t=1640197032,https://cdn.akamai.steamstatic.com/steam/apps/545540/ss_faa2e17be02b7a0dd71ce448fbf2109717ea206c.1920x1080.jpg?t=1640197032",
    "Slug": "the-infectious-madness-of-doctor-dekker",
    "Meta Title": "The Infectious Madness of Doctor Dekker: May 19, 2017, D'...",
    "Meta Description": "Looking for information on The Infectious Madness of Doctor Dekker? Check out the release date (May 19, 2017), developer insights from D'Avekki Studios ...",
    "Alt Text Image": "Official header image for The Infectious Madness of Doctor Dekker game - Steam 545540",
    "Canonical URL": "https://gusku.site/game/the-infectious-madness-of-doctor-dekker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Infectious Madness of Doctor Dekker\", \"description\": \"Looking for information on The Infectious Madness of Doctor Dekker? Check out the release date (May 19, 2017), developer insights from D'Avekki Studios ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"D'Avekki Studios Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"D'Avekki Studios Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/545540/header.jpg?t=1640197032\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}