{
    "AppID": 1492680,
    "Name": "The Pathless",
    "Release date": "Nov 16, 2021",
    "About the game": "ARCHERY AND FALCONRY Become the Hunter, a master archer who travels to a mystical island to dispel a curse of darkness that grips the world. Soar through the air and forge a connection with your eagle companion. Perform fluid acrobatics and execute awesome trick shots with a unique archery system that allows effortless shooting while moving at high speeds. The Godslayer won’t rest until the world is destroyed. Your bond with your eagle and the fate of the world hang in the balance. EXPLORE AN OPEN WORLD With no map to guide you, shape your own path through ancient lands filled with secrets. Traverse lush meadows and snowy tundras, ascend mountaintops and glide over misty forests as you soar to new heights on the wings of your eagle. Discover the dark history of the island as you solve puzzles in ancient ruins and unearth long-forgotten lore. Peer through the veil of reality as you use your spirit sight to uncover the secrets of the past and find your path through this pathless land. FREE THE ANCESTRAL SPIRITS Giant corrupted spirits stalk their domains. Hunt them down with your trusty bow and a little help from your eagle companion-- but be cautious, or the Hunter could become the hunted. Engage in epic boss battles against the cursed beasts to restore light to the land. Dust yourself off and get ready to try again if you fail–The Pathless doesn’t punish you with permanent damage or death. AWARD WINNING SOUNDTRACK Immerse yourself in an interactive music system with one of the most expressive scores ever written by industry legend Austin Wintory. Featuring traditional Tuvan throat singing from the fabulous Alash Ensemble. Game Audio Network Guild Awards, 'Best Music for an Indie Game' Annual Game Music Awards, “Score of the Year, Traditional / Acoustic” Annual Game Music Awards, “Audio of the Year, In-Game Music” Annual Game Music Awards, “Audio of the Year, Main Theme” STUNNING LANDSCAPES Explore a beautiful and captivating world from the mind of Journey and ABZÛ visionary Matt Nava . In the ruins of an ancient civilization reclaimed by the wilds, verdant forests border massive cliff faces with snow-capped peaks. Navigate crumbling temples and towering spires in your quest to bring the light back to this cursed land. STORIED VOICE ACTING Set out to stop The Godslayer, voiced by Troy Baker ( The Last of Us, Arkham Origins, Bioshock Infinite ), as The Hunter, voiced by Laura Bailey ( The Legend of Vox Machina, Last of Us 2, Gears of War ).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1492680/header.jpg?t=1652206432",
    "Price": 39.99,
    "Developers": "Giant Squid",
    "Publishers": "Annapurna Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_c0ce9f3e2b149c1659968e6e0014e117bc10c178.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_bd3fd34166b46016f6d3cc59e5327d6c94d74ca7.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_b8c849409566fca568c9198e115c5974b1562997.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_e2bbf682eedfa54214094fc33ded1cb292346fb6.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_4a9a3e86b25091655abd61632fba2f43db2a631c.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_1c76e95b532021a8b044e704083ef3b98fc692c1.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_d24e7719ebf2f582d3dead10bd3f703a54a85019.1920x1080.jpg?t=1652206432,https://cdn.akamai.steamstatic.com/steam/apps/1492680/ss_4c49336887c4cea3f145d5ea1a0cc0bcda962e62.1920x1080.jpg?t=1652206432",
    "Slug": "the-pathless",
    "Meta Title": "The Pathless: Nov 16, 2021, Giant Squid and Full Overview",
    "Meta Description": "Looking for information on The Pathless? Check out the release date (Nov 16, 2021), developer insights from Giant Squid, and a complete game summary.",
    "Alt Text Image": "Official header image for The Pathless game - Steam 1492680",
    "Canonical URL": "https://gusku.site/game/the-pathless",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Pathless\", \"description\": \"Looking for information on The Pathless? Check out the release date (Nov 16, 2021), developer insights from Giant Squid, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Giant Squid\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Annapurna Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1492680/header.jpg?t=1652206432\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}