{
    "AppID": 1413990,
    "Name": "The Heart of Darkness",
    "Release date": "Apr 15, 2022",
    "About the game": "'Oh, Cursed Saintess, will your soul find the light, or will you forever be lost in the darkness?' A terrible curse blankets the kingdom in shadows, thrusting it into utter despair and erasing all light. One day, a maiden appears from the north and chases away the darkness, reintroducing light across the land. However, after taking in all the shadows, the maiden is consumed by evil, allowing it to flood out of her body. In a final attempt to seal that which escaped, the maiden locks herself away. The king, driven by fear, demands the death of the maiden to save his kingdom. Many warriors journey forth in an attempt to slay the maiden, but the darkness curses all who dare to encroach, creating an even greater evil that consumes the kingdom. Take up arms as the next brave warrior to save the land and expel the shadows! Choose between one of five origins: the lives of people who fell just short of becoming heroes, all with different skills and abilities. Inherit one of their bodies as your own and begin your heroic journey. The Heart of Darkness has multiple endings depending on the origin you choose and the decisions you make throughout your adventure. Enjoy quick turn-based battles where strategy and choice of allies are key! Find Shadow Souls—the spirits of warriors past—and enlist their aid in battle! Each has its own unique backstory and abilities and can be swapped out freely. Throughout your adventure, meet both friends and foes also exploring the Sanctuary. Take on quests to lay low powerful beasts or track down family heirlooms for fallen noble houses. Manage the Doll's Repose, your base of operations where you can learn more about the world, craft new equipment, and expand the mansion to contain new facilities! Unravel the mysteries shrouding the Sanctuary of Darkness and its inhabitants in this sinister RPG brought to you by Kagura Games and BigWednesday. Dark Fantasy Story The Kingdom of Haillard is one of humanity's most remote frontiers, and many adventurers go mad trying to brave the dangers of the Sanctuary. What will your fate be? Multiple Classes Choose a class that suits your playstyle, influencing both the way you experience combat as well as how your story will play out. Several Shadow Soul Allies Find souls of heroes past and recruit them to aid you on your quest, leveling them as you see fit. Quick Strategic Combat Make use of both your own abilities and those of the Shadow Souls, and use status effects to your advantage in battle. Large Cast of Characters From noble hunters to cowardly looters, meet several colorful characters while exploring the Sanctuary and see how their stories unfold.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1413990/header.jpg?t=1657294651",
    "Price": 19.99,
    "Developers": "BigWednesday",
    "Publishers": "Kagura Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1413990/ss_12499aa149bc4bd9be9a700ba0b8499bd5bf22f6.1920x1080.jpg?t=1657294651,https://cdn.akamai.steamstatic.com/steam/apps/1413990/ss_a556d0421fb8696adcb7e788abf8ce9fe53409d5.1920x1080.jpg?t=1657294651,https://cdn.akamai.steamstatic.com/steam/apps/1413990/ss_2b176e2ca2181aa0bfdecf24d54cb9b61ee1009a.1920x1080.jpg?t=1657294651,https://cdn.akamai.steamstatic.com/steam/apps/1413990/ss_1a0e7f77341b79c7934663f337c56048e9625583.1920x1080.jpg?t=1657294651,https://cdn.akamai.steamstatic.com/steam/apps/1413990/ss_4bab6dd8f4338ccc52301786b09e55d2a9cffac4.1920x1080.jpg?t=1657294651",
    "Slug": "the-heart-of-darkness",
    "Meta Title": "The Heart of Darkness: Apr 15, 2022, BigWednesday and Ful...",
    "Meta Description": "Looking for information on The Heart of Darkness? Check out the release date (Apr 15, 2022), developer insights from BigWednesday, and a complete game s...",
    "Alt Text Image": "Official header image for The Heart of Darkness game - Steam 1413990",
    "Canonical URL": "https://gusku.site/game/the-heart-of-darkness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Heart of Darkness\", \"description\": \"Looking for information on The Heart of Darkness? Check out the release date (Apr 15, 2022), developer insights from BigWednesday, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"BigWednesday\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kagura Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1413990/header.jpg?t=1657294651\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}