{
    "AppID": 859820,
    "Name": "TripTrip",
    "Release date": "Aug 16, 2018",
    "About the game": "TripTrip is a challenging autorunner with color-matching and platforming mixed together. Stay on track, dodge walls, and weather hazardous conditions - all while matching The Ball's color to the floor! Master switching between the four colors through more than 8 worlds of hand-crafted levels and intense boss battles! Color-changing Action! Switch your ball between Red, Blue, Yellow, and Green to match the floor's color and stay alive. You start out only alternating between two colors, but eventually you'll be switching through all four colors at once! It only takes a split-second of poor color choice before The Ball is toast... Platforming! Stay on track! Collect J Powerups to jump over gaps. Of course, the J Powerups are not in convenient locations, so you might have to work for them. You can even move in midair to extend or shorten your jumps, or move sideways. Bosses! At the end of each of the 8+ worlds, there is a boss waiting for you. Reflect shots back at The Rival in a multi-color tennis game, jump over The Brawler's rainbow shockwaves, outlast The Trickster in a fiery dance of death - and more! Every boss stage has new surprises in store that will put your skills to the test. Difficulties! TripTrip is a challenging game that only gets harder. Players struggling with the Normal difficulty can opt for 'Easy'. On Easy difficulty, you're given a Life meter that depletes a little every time you would have died in the Normal difficulty. This is a great way to learn the game without being punished harshly for mistakes; however, there are some secrets that can only be unlocked by playing on Normal or above... Secrets! When playing on Normal or above, you are shown a Bonus meter. The meter rewards you for performing a certain task while playing. If you fill the meter in a given world, you get a chance to unlock the mysterious 'Token' for that world. What is the secret of the Tokens? Legends speak of a mystical altar on the other side of a rainbow storm deep in space...perhaps there is a connection? Music! The game features a catchy, authentic retro soundtrack with 19 tracks. Each world has a theme, along with boss music and some other secret tracks. Controls! The game can be played using either a keyboard or a gamepad. The gamepad controls are mapped for an Xbox 360 controller by default, but any button can be rebound to anything. We prefer playing on keyboard, but if you're a gamepad fan more power to you! Note about Color Blindness If you experience any form of color blindness, you should carefully consider the trailer and screenshots on this page before purchasing the game. Color matching is a core aspect of the game, and there is no color-blind-friendly mode at this time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/859820/header.jpg?t=1569771589",
    "Price": 2.99,
    "Developers": "About Airplane LLC",
    "Publishers": "About Airplane LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/859820/ss_06d0b3224cf443b996d9f8dce7ea6a236c38e7bc.1920x1080.jpg?t=1569771589,https://cdn.akamai.steamstatic.com/steam/apps/859820/ss_6ae2bef43494da95ba59f1028605d3ebc8fd201d.1920x1080.jpg?t=1569771589,https://cdn.akamai.steamstatic.com/steam/apps/859820/ss_416165a5608f2b8eef9f1398c6479d59c9509c63.1920x1080.jpg?t=1569771589,https://cdn.akamai.steamstatic.com/steam/apps/859820/ss_85cee6be3ed82d28a4f3a5b605243605e91691f5.1920x1080.jpg?t=1569771589,https://cdn.akamai.steamstatic.com/steam/apps/859820/ss_2add75635351e1312dbfa17a207ce8519b1bab5a.1920x1080.jpg?t=1569771589",
    "Slug": "triptrip",
    "Meta Title": "TripTrip: Aug 16, 2018, About Airplane LLC and Full Overview",
    "Meta Description": "Looking for information on TripTrip? Check out the release date (Aug 16, 2018), developer insights from About Airplane LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for TripTrip game - Steam 859820",
    "Canonical URL": "https://gusku.site/game/triptrip",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TripTrip\", \"description\": \"Looking for information on TripTrip? Check out the release date (Aug 16, 2018), developer insights from About Airplane LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"About Airplane LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"About Airplane LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/859820/header.jpg?t=1569771589\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}