{
    "AppID": 569720,
    "Name": "TUNNEL DIVERS",
    "Release date": "Jul 6, 2018",
    "About the game": "Welcome to your new line of work, pilot. TUNNEL DIVERS is an online free to play action game featuring futuristic space fighters that are specialized in destroying hordes of robots in enclosed spaces. With plenty of ships and weapons, claustrophobia won't be the most dangerous thing in the tunnels. TUNNEL DIVERS is free to play and has no pay-to-win attached. Play online with your friends and against other pilots without feeling disadvantaged because you didn't pay for any DLC. The only one who should be paying are the suits from TAC-CORP! TUNNEL DIVERS is a lightning fast twin stick shooter, you need to keep your ship on the move while combating hordes of robots or enemy players. Only those with the best reflexes and aim can come out as the top pilot. Play cooperatively with your friends in Gauntlet, run the flag in Capture the Flag or just slaughter your enemies in Dogfight mode. More game modes on the way. Looking for a challenge? Experience a fully designed single player campaign, with 20 unique hand-made missions and 4 different boss fights. With full ship loadout customization, you can spec your ship to speedrun each mission, or to barely scrap by passing the extra challenging superior performance review. Vaporize your enemies with powerful weaponry, from long range laser guns to destructive miniature nuclear bombs. Completely customize how your ship of choice is loaded out with weapons and special modules that can give you an edge in a fight. Earn money by completing matches and unlock more and more equipment. Whether it's a single player mission made by a friend or a competitive multiplayer map made by a stranger, Workshop implementation allows you join matches with player made maps, even if you haven't downloaded the files yourself yet. Enjoy the musical talent of Gergely Kovács, who composed a full soundtrack for the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/569720/header.jpg?t=1610330290",
    "Price": 0.0,
    "Developers": "Spasman Games",
    "Publishers": "Spasman Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/569720/ss_0cf20cad509cb159dacc1c43c73448772eb48b54.1920x1080.jpg?t=1610330290,https://cdn.akamai.steamstatic.com/steam/apps/569720/ss_85ab6217cd8a14b4206e790d50e3101f15e49a06.1920x1080.jpg?t=1610330290,https://cdn.akamai.steamstatic.com/steam/apps/569720/ss_020caad4f9eba52a48076a72e86049fb2c56f561.1920x1080.jpg?t=1610330290,https://cdn.akamai.steamstatic.com/steam/apps/569720/ss_57468e1666aecf493006946004bbbf19b67fe0ce.1920x1080.jpg?t=1610330290,https://cdn.akamai.steamstatic.com/steam/apps/569720/ss_2858bb61cc91155bcf4dd5ec240807d131ee5c6f.1920x1080.jpg?t=1610330290",
    "Slug": "tunnel-divers",
    "Meta Title": "TUNNEL DIVERS: Jul 6, 2018, Spasman Games and Full Overview",
    "Meta Description": "Looking for information on TUNNEL DIVERS? Check out the release date (Jul 6, 2018), developer insights from Spasman Games, and a complete game summary.",
    "Alt Text Image": "Official header image for TUNNEL DIVERS game - Steam 569720",
    "Canonical URL": "https://gusku.site/game/tunnel-divers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TUNNEL DIVERS\", \"description\": \"Looking for information on TUNNEL DIVERS? Check out the release date (Jul 6, 2018), developer insights from Spasman Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spasman Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spasman Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/569720/header.jpg?t=1610330290\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}