{
    "AppID": 1135810,
    "Name": "Vault of the Void",
    "Release date": "Nov 20, 2020",
    "About the game": "A Single-player Roguelite card game where you're in control. Vault of the Void is built on the idea of providing a low RNG experience, throwing as much control into the players hands as possible. Card Rewards are public knowledge, and you can preview which enemies you'll be fighting before an encounter, with a chance to tailor your deck to suit! No Events are random, you know exactly where you're stepping with each path taken. You'll build your deck as you go, a CCG experience where you can always modify your deck . Swapping in and out cards before certain encounters will always help improve your odds and allows you to adapt to monster strategies. Purging Combat is always fast paced! You can use your own cards as energy, allowing you to choose which cards from your hand to discard to gain additional energy and fuel high powered combos. Customise your Cards Collect Void Stones, powerful Runes that can be socketed into cards to grant them additional abilities! Choosing where to place your Void Stones is all a part of your ever adapting strategy. Features Over 380 player cards, each with unique upgrades 4 Classes - each with 2 of their own starting decks and unique spells Unlockable cards and custom Deck Backs. Player Spells and abilities - adding another element to the card play strategy Over 90+ unique and handcrafted Monsters 6 different Void Stones to infuse with your cards, giving each card up to 14 variations when coupled with upgrades Over 250+ Artifacts Your deck - your way. Vault of the Void is not a traditional Deck Builder. You’ll have a chance to change you deck before each fight. Different encounters may require you to change and adapt your strategy before taking on a creature or guardian. Quickly switching out Bleed cards in favour of Rage gain could be the difference between victory, or an agonising defeat. The more you play, the more you’ll learn about each mob group, and which deck type would be best suited to handle the challenge ahead. Customise your Cards One of the most unique features in Vault of the Void is the ability to customise your cards. You’ll gather Void Stones as you progress through a run, and have the ability to socket them into any card in your library, giving them extra abilities. Take the humble Master Slash for example, which will deal 5 damage. Taking a Yellow Void Stone will now also grant you 4 Block. Or maybe a Blue Void Stone, which now gives it the added ability of 'Draw a Card. Discard a Card.'. There's hundreds of variations to try out, and how each of these interact with each other is part of the fun (and learning) that comes as you play. But that's not all! The variations continue, as all cards have the ability to evolve into more dynamic and powerful versions! Each card has a unique upgrade (which aren't always just number boosts!), plus the ability to add a Void Stone. Turn any humble card into potent backbones of your strategy. Fast paced combat Vault of the Void offers card fights that are fast paced and familiar, with some subtle unique changes. Although you’ll regain some energy at the start of each turn, Purging cards gives you the final decision on which cards you should play, and which you should sacrifice to setup for later turns. To Purge a card, right click it, sending it to your Discard and gain 1 Energy! As creatures attack during their turn, they’ll increase your Threat. At the end of your next turn, your Threat stack will trigger, dealing damage to your hit points equal to its total value. Play Block cards to reduce your Threat reactively, and make the hard choice between damage, or survival. The way Threat works takes a huge mental burden off the player. You'll no longer need to do math to figure out how much to Block for. If you have 20 Threat on your Threat stack, you need to play 20 Block to stop it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1135810/header.jpg?t=1646980068",
    "Price": 14.99,
    "Developers": "Spider Nest Games",
    "Publishers": "Spider Nest Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_facdc882a21da26f46c9c1ffd860596e59a6d7f6.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_1984e04a75b47c358bd60df829f181fed7696205.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_03507538dbb54a4e2ca310617f5ca5bd6260610c.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_1f4fa69ce9c868b15fd770501f253f91c37e434e.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_fe715fbe96eeeac91c643e757833c4851b14c1c7.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_39726750125cf1faa911d2bce72bd6bba6a4edec.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_4005c8d134377bfdd7dc905a9f508e36f1483318.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_f80f292cf97492f5165475ad8028baeeec13fdb3.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_64e081d437c8a4b1bcb19457a73886fdb128c6e2.1920x1080.jpg?t=1646980068,https://cdn.akamai.steamstatic.com/steam/apps/1135810/ss_c091c1331637ff04f4a45a14b98f9cbd72462ff4.1920x1080.jpg?t=1646980068",
    "Slug": "vault-of-the-void",
    "Meta Title": "Vault of the Void: Nov 20, 2020, Spider Nest Games and Fu...",
    "Meta Description": "Looking for information on Vault of the Void? Check out the release date (Nov 20, 2020), developer insights from Spider Nest Games, and a complete game ...",
    "Alt Text Image": "Official header image for Vault of the Void game - Steam 1135810",
    "Canonical URL": "https://gusku.site/game/vault-of-the-void",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vault of the Void\", \"description\": \"Looking for information on Vault of the Void? Check out the release date (Nov 20, 2020), developer insights from Spider Nest Games, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spider Nest Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spider Nest Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1135810/header.jpg?t=1646980068\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}