{
    "AppID": 601540,
    "Name": "Veil of Crows",
    "Release date": "Oct 18, 2018",
    "About the game": "Veil of crows is a sandbox style real-time strategy game set in a chaotic medieval world. From violent, and overtly bloody battles, to completely destructible castles, RPG style hero development, and meaningful interactions with other factions. Trade, bribe, extort, and destroy your way to world domination! The world of Veil of Crows remains persistent after you die, so your impact will have a lasting effect on the world even after you fail, or start over. Can you conquer the world and take the throne? Key features: Epic battles: * Command large armies in gratuitous bloody conflict. * Besiege mighty castles with siege engines. * Take advantage of destructible buildings and walls. * Every type of unit has strengths and weaknesses. * Take heed of the current weather, geography and battle conditions Sandbox: * A massive sandbox style campaign map that includes more than 75 towns and villages ready to be conquered. * Complete quests for other lords and village leaders for bounty and improving relations. * Take your time to explore the world, or take your chances with random encounters. * Hunt down the bandits who raided your village for resources and prisoners, or destroy their camps to prevent further intrusion. * Just because you might die, doesn't mean your world dies too. Start again and your former kingdom still remains, however you are just another peasant in a land of corpses. Four game modes: * Prologue: Tutorial game... you will have some help along the way. * Veil of Crows: The main game. You start with a hero and a small group of units. Keep your hero alive and put them on the throne, or die trying. Game-over will result after your hero dies, however, the world will remain as you left it, but you must start as a new character with a new faction. * Sandbox mode: A casual game mode where you can select your starting conditions. * Custom Battle: You set the scene! Units, Battle type, Location, Time of day, Current weather, your choice! Battle away! Manage your faction: * Six different resource types can be acquired in your villages. You can trade these resources, or use them to upgrade your castles and train stronger units. * Forge alliances, or threaten and backstab your way to power. Every action you take will change other factions opinions of you. * Extort and bribe enemy armies in the hope they will leave you alone, desert, or join your forces. Mighty Heroes: * Train up mighty heroes and generals to lead your armies and grant bonuses to your towns when granting vassals. * Visit the armoury and customise your heroes equipment, and watch them carve through your enemies. * Put your leader on the throne and conquer the world! In the main game, you start by customising the main character. You must keep them alive, and put them on the throne to truly conquer the world. If they die, game over!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/601540/header.jpg?t=1561464302",
    "Price": 14.99,
    "Developers": "Kerry Fawdray",
    "Publishers": "Humble Sage Games,Arrow Face Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_d91c85e0b139f5dfc95c8ceeadf72e6c04a5dac7.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_e6e03bc8b2d3a2472a050b70bb871e2122f9da8f.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_d3f2fd574124e44c57bc94260bdeb20510fa182e.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_0621dfb0d251fbd12920548bafb5e114cd75ec28.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_6240be2011893502e0452907e42cf3e9574df46c.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_b4b7981135bdbead7731debbc99bfbcaf042bd58.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_b1eedd799aede8ce13e724f49e132c96ca9e912f.1920x1080.jpg?t=1561464302,https://cdn.akamai.steamstatic.com/steam/apps/601540/ss_f35caf3c1ebb5891c1fd0d73f955370aa5dae64b.1920x1080.jpg?t=1561464302",
    "Slug": "veil-of-crows",
    "Meta Title": "Veil of Crows: Oct 18, 2018, Kerry Fawdray and Full Overview",
    "Meta Description": "Looking for information on Veil of Crows? Check out the release date (Oct 18, 2018), developer insights from Kerry Fawdray, and a complete game summary.",
    "Alt Text Image": "Official header image for Veil of Crows game - Steam 601540",
    "Canonical URL": "https://gusku.site/game/veil-of-crows",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Veil of Crows\", \"description\": \"Looking for information on Veil of Crows? Check out the release date (Oct 18, 2018), developer insights from Kerry Fawdray, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kerry Fawdray\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Humble Sage Games,Arrow Face Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/601540/header.jpg?t=1561464302\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}