{
    "AppID": 1404560,
    "Name": "Yerba Mate Tycoon",
    "Release date": "Sep 3, 2021",
    "About the game": "Yerba Mate Tycoon is a unique management game. You will take care of a yerba mate production business: creating and customizing various yerba mates, unlocking new upgrades, and growing your company. Yerba mate is a coffee alternative in South American countries, and the national drink of Argentina, Paraguay, and Uruguay! Create your yerba mate Over 156 additives to chose from, with unique stats and qualities. Set your price, logo, package sizes, target group, drying method, and much more. Create something unique or just appeal to the crowd and get marketing your product. Manage company Take care of taxes, fans, company workers (fire/hire/train them), monitor your company rank, loan rank. Buy other companies, unlock new upgrades, raise yerba mate popularity, fight with coffee. Discover various events, make multiple decisions. Unique gameplay The best Yerba Mate Tycoon game (and the only one). Many Easter eggs, references, jokes. Casual Indie Management game from one developer. Features: New update = new bugs Poor graphic and sounds Over 156 additives to chose from in your yerba creation, with unique qualities and events - including apple, orange, pomelo, honey, and uranium! Create, customize, market, and sell your yerba mate. Set its price, type, package type/logo, distribution, additives, drying method, and much more. Chose one country from 19 available in the game, set company and CEO stats. Countries got various tax rates, yerba popularity rate, workers salary, workers education, and change over time. Unlock new upgrades and fight with coffee. Hire/Train workers, discover their personalities Discover the unique world of yerba mate Tons of references to yerba mate Dynamic system means constantly evolving tax rates, loan availability, yerba popularity, workers' salaries and behavior Easter eggs And a lot more, the list is too long:-} Polish/English are the official game translations. The community does other language translations. This game will not have any office building or customizing office system, or online mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1404560/header.jpg?t=1631070896",
    "Price": 4.99,
    "Developers": "DonislawDev",
    "Publishers": "DonislawDev",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1404560/ss_878ccd0f5b2dbe4e0853f35ae38435894dfdc079.1920x1080.jpg?t=1631070896,https://cdn.akamai.steamstatic.com/steam/apps/1404560/ss_1daa7b9ff662be40bd1f64074e77e4cfa015585d.1920x1080.jpg?t=1631070896,https://cdn.akamai.steamstatic.com/steam/apps/1404560/ss_187dac1fcae4a63333a76e9fd1745df38870f7ff.1920x1080.jpg?t=1631070896,https://cdn.akamai.steamstatic.com/steam/apps/1404560/ss_35b8e596bfba8c29b07421a3faba361f2c1a6a6c.1920x1080.jpg?t=1631070896,https://cdn.akamai.steamstatic.com/steam/apps/1404560/ss_9c52c9b4166a57c8fb4c8b195fb21ebc1bf07b42.1920x1080.jpg?t=1631070896,https://cdn.akamai.steamstatic.com/steam/apps/1404560/ss_f5468c44f4aeb41df3322b4083c66c4b7d720782.1920x1080.jpg?t=1631070896",
    "Slug": "yerba-mate-tycoon",
    "Meta Title": "Yerba Mate Tycoon: Sep 3, 2021, DonislawDev and Full Over...",
    "Meta Description": "Looking for information on Yerba Mate Tycoon? Check out the release date (Sep 3, 2021), developer insights from DonislawDev, and a complete game summary.",
    "Alt Text Image": "Official header image for Yerba Mate Tycoon game - Steam 1404560",
    "Canonical URL": "https://gusku.site/game/yerba-mate-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yerba Mate Tycoon\", \"description\": \"Looking for information on Yerba Mate Tycoon? Check out the release date (Sep 3, 2021), developer insights from DonislawDev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DonislawDev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DonislawDev\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1404560/header.jpg?t=1631070896\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}