{
    "AppID": 2055490,
    "Name": "A Game with a Kitty 1 & Darkside Adventures",
    "Release date": "Jun 28, 2022",
    "About the game": "Two very old freeware games shall live again! Play as chubby Kittey trying to foil the plan of an evil mastermind in A Game with a Kitty 1, or help the Archchancellor solve the mystery of Princess Daphodil's lost crown in Darkside Adventures. These two games are retro 2d platformers with a focus on exploration. As you play, you'll learn new moves that'll let you find new places and treasures, even in previously visited levels. Run &amp; hat-glide with Kittey in A Game with a Kitty 1 or wall-run with the Archchancellor in Darkside Adventures. Numerous bosses are waiting to be challenged, too! What are you waiting for? Grab these moneybags and thoroughly kick some (evil) koala butt! And, hey -- as a special bonus, I've also added Treasure Hunter Man 1 to the collection. Features Retro pixel graphics at a VERY low resolution Two 2d platformers in one package Partially non-linear gameplay structure with light metroidvania touches Kinda hard (sorry) Saving &amp; level selection maps Gain new skills as you progress through these 2 adventures Ending variations in Darkside Adventures A Game with a Kitty is relatively short (1-2 hours), but Darkside Adventures can take you much longer to complete Completely free (you can support me by buying my other games if you like) Amazing soundtrack by Sean Cameron (thank you) Controls In both games, hitting Backspace or double-clicking will activate windowed mode. Maximize the window to go back to fullscreen. --A Game with a Kitty 1-- -Arrow Keys: Moving -X or Shift: Jump -C or Control: Run (once you have it) -X or Shift in midair: Glide (once you have it) -UP &amp; C/Control in midair: Kittey Zoom (once you have it) -LEFT or RIGHT in midair near a wall: Cling to wall (once you have it) -UP or DOWN while wall-clinging: Move (once you have it) -X or Shift while wall-clinging: Jump off (once you have it) -UP when next (not over) to a NPC: Talk --Darkside Adventures-- -Arrow Keys: Moving -X or Shift: Jump -C or Control (hold): Run (once you have it) -X or Shift in midair: Double Jump (once you have it) -C or Control (hold) and running into a wall: Wall run (once you have it) -X or Shift while wall-running: Jump off -C or Control (tap): Shoot star / pick up stuff -UP: Pick up stuff -UP when next (not over) to a NPC: Talk -TAB: Skip certain cutscenes --Treasure Hunter Man 1-- -Arrow Keys: Moving -X or Shift: Jump -C or Control (hold): Run (once you have it) -C or Control (tap): Attack with current weapon (once you have it) -Enter: Show inventory to select a usable item or use or switch weapons -Space: Switch between weapons -Jumping in midair: Double-jump (once you have it) -UP when next (not over) to a NPC: Talk There's rudimentary gamepad support. Please have the controller plugged in before starting the game. If it doesn't work, try disabling Steam Input for the game. If the controller still won't work, enable support for older programs in the Game Controller Settings (Control Panel/Win10+).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2055490/header.jpg?t=1656438869",
    "Price": 0.0,
    "Developers": "origamihero games",
    "Publishers": "origamihero games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2055490/ss_37df2e4745c4ea5973896405b35cab71fade7aa1.1920x1080.jpg?t=1656438869,https://cdn.akamai.steamstatic.com/steam/apps/2055490/ss_2d99aa0901fcab15be130e059202d4452eba0e69.1920x1080.jpg?t=1656438869,https://cdn.akamai.steamstatic.com/steam/apps/2055490/ss_3f485452b5ef8693f407641f18a6c275db7e445a.1920x1080.jpg?t=1656438869,https://cdn.akamai.steamstatic.com/steam/apps/2055490/ss_a7e52539a1bb3cc5f6d465fbfdd01eccaea0ee04.1920x1080.jpg?t=1656438869,https://cdn.akamai.steamstatic.com/steam/apps/2055490/ss_63c5d1bba17ff5eff615f16bf5b739e6a62c9bda.1920x1080.jpg?t=1656438869,https://cdn.akamai.steamstatic.com/steam/apps/2055490/ss_94da39705a81d4b1e919f4a2d99c965ce66b4729.1920x1080.jpg?t=1656438869",
    "Slug": "a-game-with-a-kitty-1-darkside-adventures",
    "Meta Title": "A Game with a Kitty 1 & Darkside Adventures: Jun 28, 2022...",
    "Meta Description": "Looking for information on A Game with a Kitty 1 & Darkside Adventures? Check out the release date (Jun 28, 2022), developer insights from origamihero g...",
    "Alt Text Image": "Official header image for A Game with a Kitty 1 & Darkside Adventures game - Steam 2055490",
    "Canonical URL": "https://gusku.site/game/a-game-with-a-kitty-1-darkside-adventures",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Game with a Kitty 1 & Darkside Adventures\", \"description\": \"Looking for information on A Game with a Kitty 1 & Darkside Adventures? Check out the release date (Jun 28, 2022), developer insights from origamihero g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"origamihero games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"origamihero games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2055490/header.jpg?t=1656438869\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}