{
    "AppID": 1249070,
    "Name": "AeternoBlade II: Director's Rewind",
    "Release date": "Sep 7, 2020",
    "About the game": "Welcome Back to the World of Aeternoblade. Reclaim the power of time and defy the abyss in this sequel to the fast-paced action-puzzle game of Time-Manipulation Combat. AeternoBlade II: Director's Rewind expects a lot out of you. Combats, puzzles, or both demand a good understanding of game mechanics, robust strategies, quick reflexes, and practices to pull off. Be prepared to spend hours of mastering both martial and time-manipulation arts to solve mind-bending puzzles and defeat merciless hoards of enemies. Note: We recommend playing the game with Mouse and Keyboard. After the event of AeternoBlade. Freyja has been living a peaceful life with her friends at the Ridgerode village. One day, The dimension begins to unstable and the existence of this reality seems to be disappeared. It is the cause of her actions to change the world lines. To fix this, her journey begins once again. On the other side of the world, two warriors, Bernard and Felix. Head to Anan Fortress according to the order from the King of Chronosian Kingdom's to stop the disaster that will destroy the kingdom to have occurred from a strange dark hole appeared in the sky, their fate exists will be revealed in AeternoBlade II. Aeternoblades and their Wielders You will play as Freyja, Bernard, and Felix. Each hero possesses a unique combat move set, and wields a different kind of AeternoBlade. Each AeternoBlade manipulates a certain aspect of time: One restores the Past, one controls the Present, and the other commands the Future. • Sonne the AeternoBlade grants the power of Time Rewind: Resurrect yourself, amend your mistakes, or send your foes back in time to relive their moments of suffering. • Nuvaran the AeternoBlade bestows the power of Time Stop: Prevent undesirable changes, and control the relative pacing of time among physical entities. • Framtider the AeternoBlade grants the power of Time Paradox: Convolute with alternate timelines, foresee the future, and defy it. No matter how insurmountable a challenge may seem to be, just remember that: 'Time is on your side' AeternoBlade II: Director's Rewind vs AeternoBlade II AeternoBlade II: Director's Rewind is a major upgrade from the original version of AeternoBlade II. Featuring: New and improved time-combat synergies. Revised combat move sets Enhanced and alternate powers introduced to the three AeternoBlades. Revamped levels, encounters, puzzles to improve game flow. New areas, relics, and secrets yet to be discovered. Over 250 relics to power up your character and customize your play style. Over 100 puzzle levels. Improved NPC and Monsters' Behaviors. You will need to learn their patterns, and solve 'combat puzzles' to effectively defeat your foes! AeternoBlade II and AeternoBlade It is perfectly fine to play AeternoBlade II without experiencing AeternoBlade first. However, AeternoBlade II references and features returning characters of AeternoBlade I. Playing AeternoBlade will help deepen understanding of the plot. /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1249070/header.jpg?t=1603885622",
    "Price": 5.99,
    "Developers": "Corecell Technology Co.,Ltd",
    "Publishers": "Corecell Technology Co.,Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_6fe6d2c0e5aa92db1426bbb78a3a8f930ac08530.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_aa5d16157bc858a27ea707810a4db191cf50ff98.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_94842918c612b52635764fea8d87957eea09eafa.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_e173fb3055eb98b8dc9915ef0a907ab3174228b6.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_b16dca08a163d501679402c69ce36873d21f94c8.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_96ee8d06a665f864fdf7e3077cccb266c419e6a1.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_063d52bf3bbdc134c6e6ab18121afc7a42feac6b.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_e1076d3fbd1b3b5df320e4122faeebec093ec1ce.1920x1080.jpg?t=1603885622,https://cdn.akamai.steamstatic.com/steam/apps/1249070/ss_3039ff0eef0a308807a9a96b1a82057343052ff6.1920x1080.jpg?t=1603885622",
    "Slug": "aeternoblade-ii-director-s-rewind",
    "Meta Title": "AeternoBlade II: Director's Rewind: Sep 7, 2020, Corecell...",
    "Meta Description": "Looking for information on AeternoBlade II: Director's Rewind? Check out the release date (Sep 7, 2020), developer insights from Corecell Technology Co....",
    "Alt Text Image": "Official header image for AeternoBlade II: Director's Rewind game - Steam 1249070",
    "Canonical URL": "https://gusku.site/game/aeternoblade-ii-director-s-rewind",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"AeternoBlade II: Director's Rewind\", \"description\": \"Looking for information on AeternoBlade II: Director's Rewind? Check out the release date (Sep 7, 2020), developer insights from Corecell Technology Co....\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Corecell Technology Co.,Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Corecell Technology Co.,Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1249070/header.jpg?t=1603885622\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}