{
    "AppID": 544610,
    "Name": "Battlestar Galactica Deadlock",
    "Release date": "Aug 31, 2017",
    "About the game": "The Cylons have rebelled! Four years of war and a steep price in human lives have not been enough to unlock a deadly stalemate. The Colonials have countered all of the Cylon’s offensives so far, but no decisive victory was achieved. The deadlock is suddenly broken by a surprise attack from the Cylons and the brutal annihilation of the Colonial Fleet High Command on Picon. The fate of mankind is now resting on the shoulders of Rear-Admiral Lucinda Cain. The secret, cunning plan she has conceived could turn the tide of the war forever… THE GAME BATTLESTAR GALACTICA Deadlock™ takes you into the heart of the First Cylon War, to fight epic 3D battles that will test your tactical prowess. Take control of the Colonial Fleet from the bridge of the mobile shipyard, Daidalos, and free the Twelve Colonies from the Cylon threat. Build your fleets, protect the Quorum alliance and prepare to dig deeper into the conspiracies of this heroic conflict. Command the Colonial Fleet Design and build fleets of powerful capital ships. Recruit officers to protect the Twelve Colonies. From the Manticore corvette to the mighty Jupiter class Battlestar, you won’t be short on firepower. Legendary Names Continue the legacy of Battlestar Galactica™ with new characters and familiar faces, in an original story set during the First Cylon War. Launch Viper squadrons and Raptor scouts and jump the Galactica in to dominate the battlefield. An authentic Battlestar Galactica™ experience awaits. WEGO 3D Tactical Battles Intense tactical space battles in full 3D. Give commands to your fleet of capital ships and watch the explosive results play out in pause-able real-time across beautiful environments. War Room Politics From the bridge of the Daidalos shipyard you will command all the Colonial Fleet. Build up your forces and jump them across the quaternary solar system of Cyrannus. Keep the Colonies safe and the Quorum of Twelve unified, lest the alliance break and introduce a new age of Cylon dominance. The Cylon Threat Prepare to face relentless opposition. Defend against squadrons of Cylon Raiders and missile salvos from Basestars. Trust in your marines to fight off Centurion boarding parties, while your firewalls slow down the hacking attacks of the Wardriver electronic fighters. Unlock blueprints for new ships, munitions and squadrons to help defeat your tireless foe. Join Forces Experience Battlestar multiplayer like never before! Outwit your opponent in fierce 1-v-1 fleet battles. Review Your Battles Review your battles from a cinematic point of view with the AutoCam replay, and then export them to YouTube with our in-game tool! NEW UPDATES - Season One Finale announcement! Since its release Battlestar Galactica Deadlock has been constantly improved and expanded through DLCs and free updates alike. The developers have added plenty new features and content to the original game. The release of Sin and Sacrifice marked the conclusion of Season One, and we decided to show and recap all that had been added until that point. Click on the link below to have a look!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/544610/header.jpg?t=1644925330",
    "Price": 39.99,
    "Developers": "Black Lab Games",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_140a34a0a5c5c4b378680ee43d5295ad224605f8.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_35a85f18410b021af15c72b168e7bc3c6aeb5a7d.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_13fca1174ca2a10364cca5570fd033121559af8d.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_f38ab2886f071515e5e54b584e9c62200823c573.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_c6f1bd9372bac978d2d92cffb1bdc81b208814fb.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_c9d6e5f70e6ee3d62349ee47e163f5489f838536.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_16fe4c588ffa9da952816221b7aaf09bd0c85a8c.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_4b643f9327fc441b4f64649bd3d362b7e62d74bb.1920x1080.jpg?t=1644925330,https://cdn.akamai.steamstatic.com/steam/apps/544610/ss_9ed2b4d8e056795874f2010a58850e07fb2d70e3.1920x1080.jpg?t=1644925330",
    "Slug": "battlestar-galactica-deadlock",
    "Meta Title": "Battlestar Galactica Deadlock: Aug 31, 2017, Black Lab Ga...",
    "Meta Description": "Looking for information on Battlestar Galactica Deadlock? Check out the release date (Aug 31, 2017), developer insights from Black Lab Games, and a comp...",
    "Alt Text Image": "Official header image for Battlestar Galactica Deadlock game - Steam 544610",
    "Canonical URL": "https://gusku.site/game/battlestar-galactica-deadlock",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Battlestar Galactica Deadlock\", \"description\": \"Looking for information on Battlestar Galactica Deadlock? Check out the release date (Aug 31, 2017), developer insights from Black Lab Games, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Black Lab Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/544610/header.jpg?t=1644925330\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}