{
    "AppID": 830580,
    "Name": "BattleBeasts",
    "Release date": "May 10, 2021",
    "About the game": "Battlebeasts story Planet Shima attracts adventure seekers from all over Galaxy BB-79 due to its unique resources. The mysterious effects on this planet turned the Artificial Intelligence of Shima aggressive towards all intelligent species of animals. You must survive in this new world, full of dangers and hostile environments by collecting resources, building and claiming territory, hunting wild animals and crafting armor, weapons, vehicles and your own bots. But the most important thing is to study the mysteries of Shima in order to fully understand what is happening on this planet. Since February 10, 2018, we have successfully developed and tested the pre-alpha version of BattleBeasts for all our followers. Using the Unreal Engine 4, we were able to implement all the mechanics of survival with joint construction in a one-time session for up to 150 people. After many tests, we created a foundation for development, and now we are working on content scaling and gameplay expansion. We will transfer the game to Steam's early access after the end of our closed alpha testing period. Appearance In BattleBeasts you will be able to choose many types of intelligent beasts as your character, the list of characters will be updated by a vote in the community of the game. Monthly armor and weapon design kits will also be available. The world of BattleBeasts is filled with SciFi weapons, which have different settings and skins that will help you find your style of play. New hoverbike skins are also being designed to allow you to make it more personal to your preference. Freedom of expression in the form of voting will help give you more power. You can control the appearance of many skins or objects. Multiplayer A well-designed system of interaction with the server will allow you to always stay on the most saturated server that corresponds to your level of achievement, using the session-saving system and your own matchmaking algorithm. World Battlebeasts The first of the presented game locations is 8 * 8 km of the beautiful forest landscapes of the island. We have created many wild forests and lakes to give a natural feeling. In all these locations, you can build defensive forts and fight, except for safe zone locations. These locations are bases in which there are security zones. In order to obtain resources and development you will have to build your own shelter outside these walls. Also, game locations include many abnormal areas with high risk to life. Day-night changes allow you to use different gameplay solutions for exploring the riddles of the planet and getting different types of resources. Take back control of the world. Learn the secrets of the planet to gain more new items. Building Using available resources such as wood and stone, you can build your own shelters. First, choose where you are going to build, it is desirable that this would be on an even and large enough area. If the image is red, then you cannot install it there, if it is green, you can. Be sure to improve all the elements of construction: the foundation, walls, doors, and roof, because if at least one element is not improved, it will break and easily allow unwanted entry. Inventory System In BattleBeasts. there is a system for numerous items to research. Branches of study for new items and the study of their settings with their own characteristics, such as weapons, armor, and transportation, will allow numerous settings. Objects contain many unique properties, allowing you to customize weapons and more for your style of play. We use a grid-based inventory system that allows you to plan, save resources, and create craft items. We made interaction with objects the most realistic. You will be able to unpack boxes of ammunition and open storage with various tools that can be found in the world. Resources The main available resources are for construction, while less available are the resources necessary for life (water, food). There are also completely unique quest resources used to recharge batteries in vehicles, upgrading shelters, crafting unique items, and many more. The more unique a resource is, the less accessible it is. You can get it from dangerous mobs and in remote anomalous places. Hazardous Forms Of Life The island filled with monsters and robots is the basis of a new game mechanics, created with C ++. Combat cyborgs, robots left without owners, show aggression to all intelligent species. We will fill the game with more lively and fast elements of the gameplay, in the form of wild animals that will behave most naturally in their habitat. Only the fastest and most cunning players can catch Mobs. Mobs are equipped with motion sensors, they perfectly see in the dark, they react to sounds, explosions and they are damn hard to kill or catch. Join Now! BattleBeasts from the very beginning was thought and developed for friends. We could not make the game without community feedback. Invite your friends to the game, create your teams, get more emotions from the game. With the help of our community Discord you can always find like-minded people. Only with your continued support, can we continue to develop BattleBeasts. We often publish to our followers information about the production process, as well as accept suggestions for improvement. Any Ideas? We're always open to the feedback from our fans and sincerely appreciate the support that we have provided so far. Thanks to everyone who supports us.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/830580/header.jpg?t=1623168179",
    "Price": 4.99,
    "Developers": "Oleg Shestoperov",
    "Publishers": "Oleg Shestoperov",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_44c382fddf0be7c0afe9e065535efeca58bdc599.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_5f4a4292ac9425ec9f0577dab05cdd6e9adc6d49.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_11fa7b43a564be46fbbc4bc55e9430e7e6a51bb6.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_e45e9e1a3b8e8c304b429219b0a7b7cef36fae2b.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_6b159486a04038a87430e2b5421de20781071ff5.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_dd7556f61b0829e83969ef50df4dca39263654a2.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_d78d0959dfb56a04a07ae557b7bbde677005627e.1920x1080.jpg?t=1623168179,https://cdn.akamai.steamstatic.com/steam/apps/830580/ss_f15612d8b4a0101aa53b72195167aaf3b78d0b17.1920x1080.jpg?t=1623168179",
    "Slug": "battlebeasts",
    "Meta Title": "BattleBeasts: May 10, 2021, Oleg Shestoperov and Full Ove...",
    "Meta Description": "Looking for information on BattleBeasts? Check out the release date (May 10, 2021), developer insights from Oleg Shestoperov, and a complete game summary.",
    "Alt Text Image": "Official header image for BattleBeasts game - Steam 830580",
    "Canonical URL": "https://gusku.site/game/battlebeasts",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BattleBeasts\", \"description\": \"Looking for information on BattleBeasts? Check out the release date (May 10, 2021), developer insights from Oleg Shestoperov, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Oleg Shestoperov\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Oleg Shestoperov\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/830580/header.jpg?t=1623168179\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}