{
    "AppID": 353890,
    "Name": "Casey Powell Lacrosse 16",
    "Release date": "Mar 8, 2016",
    "About the game": "Casey Powell Lacrosse 16 combines the player movement and passing of basketball with the stick skills, shooting, and hitting of hockey to create a high scoring, action-packed game of lacrosse. Game Features: Quick Game - Short on time? Pick up the controller and play the fastest game on two feet from the comfort of your living room! Lacrosse 16 features hundreds of custom teams and thousands of unique players! Coach Career and Be The Player Mode - Start as a youth, star, or coach and work your way from college into the pros! Online Multiplayer - Nothing is more rewarding than playing online versus friends and competitors. Our engine is built from the ground up with online gaming in the forefront. Quickly pick up the game for competitive ranked play or run a top-tier franchise with your friends through online tournament. Earn badges and experience the rise to the top of the leaderboards. Character Creation - Create teams, players, coaches, and referees in the Lacrosse Academy and share them with the world. The Lacrosse Academy opens up endless customization options from the player’s height, weight, skin and physique to facial features and hairstyle. Equipment selection allows for customizations of helmets, jerseys, elbow pads, gloves, stick handles, stick heads, war paint, socks and shoes. Gameplay Features: Big Hits: Line up the ball carrier for huge hits by perfectly timing up your attack. Imagine a football linebacker with a titanium shaft. Lay him down! Combination Stick Checks: Strip the ball away from the offense with various sword-like stick checks. Slice and dice! Evasive Dodging: Execute combination dodge moves to work your way past the defense. Lacrosse players are pure athletes. First you break their ankles, and then you break their heart. Quick Stick Passing: Perform amazingly accurate and fast passing to exploit your opponents. Tic-tac-toe anyone? Face-offs: Control every movement of your players stick in first person face-offs. Clamp, pinch and pop, laser? It’s in your hands! Transition Offense: The team who knows how to create numbers is the team who knows how to score goals! Find the 2v1s! Transition Defense: It’s on you to decide when to stop ball, when to scrape, and when to rotate. Transition defense will make or break you! Settled Offense: There are times to push transition and there are times to settle the ball down. Do you know the difference? Championship teams do... Settled Defense: How far do you want to close out to play the ball? Are you going to pack it in and play zone? Slide from the crease or adjacent? Want to lock off their two best players? If you can't play defense, you are going to be in a world of hurt... Note: You must be connected to the internet to boot this game. You may disconnect from the internet once at the main menu.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/353890/header.jpg?t=1572308315",
    "Price": 19.99,
    "Developers": "Big Ant Studios,Crosse Studios",
    "Publishers": "Big Ant Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/353890/ss_14f33beb540f064f1f3f44bc3d97591216721ae3.1920x1080.jpg?t=1572308315,https://cdn.akamai.steamstatic.com/steam/apps/353890/ss_3244119ccd79738f167dbf0a73741f6d05545ab2.1920x1080.jpg?t=1572308315,https://cdn.akamai.steamstatic.com/steam/apps/353890/ss_2838aa5008aec03cb49897a3b5e0553f00fd03ad.1920x1080.jpg?t=1572308315,https://cdn.akamai.steamstatic.com/steam/apps/353890/ss_660ff8ea5d83f4f82be7397c708b3ecde7067e15.1920x1080.jpg?t=1572308315,https://cdn.akamai.steamstatic.com/steam/apps/353890/ss_5e1ef4933741b9c56bcae803508a9909c92a0313.1920x1080.jpg?t=1572308315",
    "Slug": "casey-powell-lacrosse-16",
    "Meta Title": "Casey Powell Lacrosse 16: Mar 8, 2016, Big Ant Studios,Cr...",
    "Meta Description": "Looking for information on Casey Powell Lacrosse 16? Check out the release date (Mar 8, 2016), developer insights from Big Ant Studios,Crosse Studios, a...",
    "Alt Text Image": "Official header image for Casey Powell Lacrosse 16 game - Steam 353890",
    "Canonical URL": "https://gusku.site/game/casey-powell-lacrosse-16",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Casey Powell Lacrosse 16\", \"description\": \"Looking for information on Casey Powell Lacrosse 16? Check out the release date (Mar 8, 2016), developer insights from Big Ant Studios,Crosse Studios, a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Big Ant Studios,Crosse Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Big Ant Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/353890/header.jpg?t=1572308315\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}