{
    "AppID": 1633050,
    "Name": "Devoul- Curse of the Soulless",
    "Release date": "Jun 4, 2021",
    "About the game": "STORY Gebriel is a vampire with a dark and mysterious past that made a successful career as a demon hunter. One day he mysteriously accepted the mission that no one is willing to accept: Rid Castle Cambriala of the demons that occupied the fortress. Followed by his ghost sidekick and friend, Lani, the two hunters have the difficult mission of discovering what demonic forces now control the castle and stop their evil plans. During their dangerous mission, Gebriel and Lani will cross paths with strange characters connected to the castle's past that will reveal not only the twisted agenda of the demons but also force the demon hunters to face their own and tragic past. What could have driven Gebriel to accept such a difficult quest? Who is Lord Raizer and what is he secretly planning inside the fortress? Who is Elizabeth, Lord Raizer's first wife? And how does her past connect with Gabriel's? Who is Haldor, the mysterious demon hunter that walks on the castle freely and unopposed? and what happened between Gebriel and Lani in the past? Discover all these answers and many more as you enter the cursed castle... GAMEPLAY Devoul- Curse of the Soulless is a pixel art platformer metroidvania game. Overtake difficult obstacles, fight hordes of monsters and demons and explore a vast world map that goes beyond the cursed castle. As you advance more in the game, you will find powerful key items that will give you important abilities to use. These items will not only be usefull in combat but also alow you to open new areas and rooms once closed or secret. Exploration and backtracking is necessary and rewarding for the more attentive players. What you may expect from the gameplay includes: Explore a vast and diverse world that goes way beyond castle Cambriala. Key items to add new abilities to be used in combat and discovering new areas and secrets in once inaccessible zones. Fast and challenging combat with a wide variety of monsters and a monsterpedia to keep track of them. Tough and diverse platforming challenge. Action RPG elements that will allow you to get more powerful as your character level up, unlocks new skills or get different equipments. CUSTOMIZATIONS At its core, Devoul- Curse of the Soulless is an Action RPG game, and as such you may expect many customization options during your stay in the castle, that includes: Level up and gain Skill Tree Points to unlock 30 different combat skills. Three different classes, Warrior, Mage and Demon Hunter. All with different stats and skills. You may use only one or make diferent mixes between classes. More than 100 diferent equipments like rings, armor or souls. The Blacksmith will upgrade some of your equipments and will give you some powerful results. Special Tree Points to unlock 3 extremely powerful and final class skills. These skills can only be unlocked finding some hidden treasures. EXTRAS Altho at the center of the game lies the metroidvania and action RPG elements, Devoul- Curse of the Soulless has much, much more to ofer. Here are some of those extras: Coliseum for the more experienced players to test their habilities and unlock other secrets. Four different mini games that vary from boxing fighting game to a casino or a cooking game. Diary logs that will reveal more about the cursed castle and other characters in the game. Unlock two extra game modes once you beat the main game that offer new and different gameplays besides the classic game including Speedruning mode and the demonic Nightmare mode. Many diferent throphies for the hard-core players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1633050/header.jpg?t=1623109128",
    "Price": 4.99,
    "Developers": "Sweeping Avalanche Creations",
    "Publishers": "Sweeping Avalanche Creations",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_1a6086f5ad32ae4be6df4295c5ec30529b9c208f.1920x1080.jpg?t=1623109128,https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_3f0749e176d827c1c080ce799ccb0a357b969ebc.1920x1080.jpg?t=1623109128,https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_61ba2ac2e901bc55438e4b2475fd622d2d338165.1920x1080.jpg?t=1623109128,https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_e478aa1c2d78d53f91763ef3f1c134696d4f0589.1920x1080.jpg?t=1623109128,https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_05ac71b8739780777fab7975dfa7b283221d1846.1920x1080.jpg?t=1623109128,https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_13f94d4a5e5840863d6d5eb880db3b5de34024d4.1920x1080.jpg?t=1623109128,https://cdn.akamai.steamstatic.com/steam/apps/1633050/ss_e9e3c384826a6ee1d05bedaa310af6ad60506cc7.1920x1080.jpg?t=1623109128",
    "Slug": "devoul-curse-of-the-soulless",
    "Meta Title": "Devoul- Curse of the Soulless: Jun 4, 2021, Sweeping Aval...",
    "Meta Description": "Looking for information on Devoul- Curse of the Soulless? Check out the release date (Jun 4, 2021), developer insights from Sweeping Avalanche Creations...",
    "Alt Text Image": "Official header image for Devoul- Curse of the Soulless game - Steam 1633050",
    "Canonical URL": "https://gusku.site/game/devoul-curse-of-the-soulless",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Devoul- Curse of the Soulless\", \"description\": \"Looking for information on Devoul- Curse of the Soulless? Check out the release date (Jun 4, 2021), developer insights from Sweeping Avalanche Creations...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sweeping Avalanche Creations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sweeping Avalanche Creations\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1633050/header.jpg?t=1623109128\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}