{
    "AppID": 1980920,
    "Name": "DPET : Desktop Pet Engine",
    "Release date": "May 13, 2022",
    "About the game": "What is DPET? DPET is a desktop pet generation engine. In the client software, a lot of cute virtual pets are integrated, and you can summon them to your desktop with one click. Every pet can freely walk, run, climb on the desktop, and even self-clone itself into more partners. If you are a streamer, you can also connect your twitch account and randomly generate desktop pets for your active audience, making your audience more willing to send chats and expanding your stream influence. Is DPET a shimeji alternative game? Yes, but not only that. After using shimeji app for more than 200 hours, I suddenly got creative inspiration. Integrate excellent shimejis together and let more users know the charm of this game. So I decided to create DPET, and improve some of the shortcomings of shimeji app: 1. Easy to install and use, no need to install java8 2. Low CPU consumption, support MacOS 3. Support to summon various types of pets 4. Bring DPET to the livestream so that every viewer can create their own shimeji avatar 5. Create a friendly art community where everyone can share their creations How to use it? As so far, all our features and virtual pet resources are free. You only need to click the summon button in the client software to start the pet party. Entertainment mode: you can freely control your pets on the desktop, use the right mouse button to control them to do various interesting actions, and play with your pets when you are idle; Stream mode：turn on the stream mode in the software, apply DPET to the live broadcast, we will regularly generate virtual pets for your active viewers, so that your viewers are more willing to chat in your channel. How to get a desktop pet during live broadcast? - First, you need to complete the twitch account authorization in the settings interface; - Then, turn on the live mode switch; - After that, it will help you detect chat messages from your live channel and generate virtual pets randomly for your viewers; - Finally, add a game capture to your streaming software and capture the window for DPET. Our plan - Integrate more virtual pet resources to let more cute cats join our virtual pet party - Devolop more interactive gameplay for desktop pet while steaming - Add virtual pets to dynamic wallpapers to make your desktop full of live",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1980920/header.jpg?t=1657618388",
    "Price": 0.0,
    "Developers": "Live3D",
    "Publishers": "Live3D",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1980920/ss_308caa8ab4700861848b5615d56f94a395bbc9cf.1920x1080.jpg?t=1657618388,https://cdn.akamai.steamstatic.com/steam/apps/1980920/ss_b50fee8c552fa79560c33124e35a2477e07baeb0.1920x1080.jpg?t=1657618388,https://cdn.akamai.steamstatic.com/steam/apps/1980920/ss_fef56e132a7fed0bc529289310943b185c7e42be.1920x1080.jpg?t=1657618388,https://cdn.akamai.steamstatic.com/steam/apps/1980920/ss_0701a64d69f357207af4e0ac11a13233ffc7f16a.1920x1080.jpg?t=1657618388,https://cdn.akamai.steamstatic.com/steam/apps/1980920/ss_172bcf54a624698c5060b2c77c5ca369425abf2e.1920x1080.jpg?t=1657618388",
    "Slug": "dpet-desktop-pet-engine",
    "Meta Title": "DPET : Desktop Pet Engine: May 13, 2022, Live3D and Full ...",
    "Meta Description": "Looking for information on DPET : Desktop Pet Engine? Check out the release date (May 13, 2022), developer insights from Live3D, and a complete game sum...",
    "Alt Text Image": "Official header image for DPET : Desktop Pet Engine game - Steam 1980920",
    "Canonical URL": "https://gusku.site/game/dpet-desktop-pet-engine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DPET : Desktop Pet Engine\", \"description\": \"Looking for information on DPET : Desktop Pet Engine? Check out the release date (May 13, 2022), developer insights from Live3D, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Live3D\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Live3D\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1980920/header.jpg?t=1657618388\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}