{
    "AppID": 1578050,
    "Name": "Fatal Core",
    "Release date": "Nov 4, 2021",
    "About the game": "Fatal Core is a Trading Card Game. It is also an attempt at a small, quiet revolution in gaming. The purpose of a game is to serve the player. Many modern-day online games have veered sharply away from this purpose, seeking only to become an efficient source of revenue. Conflicts of interest arise between developers and players, as rare items and enjoyable experiences are locked behind paywalls. Instead of engaging with the players directly, changes are driven by thousands of data points they unwittingly leave behind. Fatal Core aims to be the first major TCG that is 100% free of purchases. We hope to be able to support the game entirely through crowd-funding, rewarding each player when goals are met — whether that player was able to make a donation or not. This means that every card and cosmetic item in Fatal Core must be earned through play. It means that competitive play remains pure. Most importantly, it means that the players are in the driver’s seat when it comes to the development of the game. If you talk, we will listen! GAMEPLAY Fatal Core’s gameplay is refreshingly unique. Both players take their turn simultaneously, playing one card per turn out of a mostly open hand. This gives both players great insight into their opponent’s strategy, leading to tense mind-games and graceful counter-plays! Players will assume the role of one of 6 Lead Characters, each with their own strengths, weaknesses, and special cards. Creatures are played onto a 3x2 board filled with bonuses and penalties that give each creature an unprecedented amount of flexibility. While creatures stay on the board and attack your opponent directly each turn, spells can also be played for a powerful one-time effect. Deck-building limits the number of powerful cards each opponent can put into their 18 card deck. A large collection is not needed for competitive play. Players can face powerful AI opponents, lovingly designed PvE content, and of course, each other. FEATURES NEW DRAFT MODE! Fatal Core's Draft Mode is unlike any other, allowing players to include 6 custom cards in their Draft deck! Carefully manage a special currency to buy card components, and unleash your unique creations upon opposing players! LEAVE YOUR WALLET AT HOME! All cards, cosmetic items, and in-game currency are earned through play. RICH LORE: Fatal Core is set in a dystopian future full of strange magic and alien technology. Want to learn more? How convenient, we have a free weekly comic, called Fatal Core Chronicles, just for you! SIX UNIQUE CHARACTERS forming 3 alliances... With more to come! OVER 200 CARDS with many new cards added every 2 months to keep the meta fresh. RANKED MODE: Compete and earn rewards on the ladder! AI BATTLES: Test your decks against powerful AI designed to challenge players of every skill level. RAIDS: Get creative in fights against massive “boss-style” AI opponents that bend the rules of the game. Cooperate with other players to earn the best rewards. MONTHLY TOURNAMENTS: Compete in intense monthly tournaments and win gift card prizes! PLAYER MARKET: Sell and trade your cards on a player-run market. Set your own price! COSMETIC ITEMS: Foil cards, playmats, and alternate arts can be earned by playing the game, or found in packs by a lucky few. Card sleeves are coming soon. REPLAY: save your matches, watch them again and again, or share them with other players. IMPORT AND EXPORT DECKS. Skilled Beta-testers are standing by in our Discord to help you improve them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1578050/header.jpg?t=1636190500",
    "Price": 0.0,
    "Developers": "Cosmic Cog LLC",
    "Publishers": "Cosmic Cog LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_05c422f4e4c4b421b7c9b73e41375a4e3a8dd575.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_b7b156581438689baa2b4878c3fb289c3cb271dd.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_32a956ac3287821af3516e176212aa21f0d98117.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_dbe1d72abe27af09a404889ded6dc9a7fb9931bd.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_7b9675a709a5e06b180e50a24734d92a5835c864.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_81729ce3572a6d1546cc9364be7133f93c2e93ce.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_d8cd5fc8646708ef7784b6edc742d0ca8b8490b9.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_47fb14094c81849a1bb23d8718fc30793dc1a298.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_c5eceec7e58e634fb9182b45b3addd39503327d2.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_f28bef8c934b57cd3172464c938f89ac8b977654.1920x1080.jpg?t=1636190500,https://cdn.akamai.steamstatic.com/steam/apps/1578050/ss_eb89e8da2c150f89caa4c5eeb4663e29aa46d869.1920x1080.jpg?t=1636190500",
    "Slug": "fatal-core",
    "Meta Title": "Fatal Core: Nov 4, 2021, Cosmic Cog LLC and Full Overview",
    "Meta Description": "Looking for information on Fatal Core? Check out the release date (Nov 4, 2021), developer insights from Cosmic Cog LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Fatal Core game - Steam 1578050",
    "Canonical URL": "https://gusku.site/game/fatal-core",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fatal Core\", \"description\": \"Looking for information on Fatal Core? Check out the release date (Nov 4, 2021), developer insights from Cosmic Cog LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cosmic Cog LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cosmic Cog LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1578050/header.jpg?t=1636190500\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}