{
    "AppID": 1994110,
    "Name": "Fiefdom",
    "Release date": "May 30, 2022",
    "About the game": "Summary Fiefdom is an early access medieval city management game. Keeping your subjects content becomes a lot more difficult when you have to keep the ambitions of your court in check. Manage an ever changing supply of resources like food, money, stability, and more! Balance all aspects of your fief and experience explosive growth. But remember: the mightier the crown…the heavier the head. Features Family crest designer with thousands of combinations A dynamic family tree that catalogs the history of your kingdoms rulers Large scale city simulations Wonderful pixel graphics 3 unique races (+half races) to populate your city with Randomized events with outcomes that shape the fate of your realm. Procedurally generated world for you to explore Balancing the powers of the church and nobility and avoid their wrath Construct special buildings that grant powerful decisions Manage your kingdom and its resources using decisions like creating taxes, firing priests, and importing food Day 'N' Night Cycle About the Developers We’re a team of 2 lifelong friends from Colorado. One of us has been making games all of his life and the other loves developing deep and enriching stories. Together, we want to create unique and entertaining games refined from community engagement. We aim to carve our own niche in the indie gaming community. We'd love to chat more on our discord server . Roadmap For the Future Keep in mind, Fiefdom is very early in development. So, we are looking to add much more content than what is released right now. Each update will also include a whole host of new events. With each major update, we plan to increase the price a small amount to reflect the time, effort, and love we’ve put into it. Topics for future updates include (but aren’t limited to) the following: Wildlife Update: This will aim to make the area surrounding your fief feel more alive and also make you feel like you can have a more direct impact on the local fauna. Included with this update will also be a weather revamp to make seasons feel more unique. We are already developing this and should be released by the start of Q4 2022! Military Update: This will most likely be the largest of any of the major updates. It will focus on a warring system where you can both invade and get invaded by adjacent kingdoms. Combat simulations and conquering systems will allow you to grow your kingdom at a rapid pace or drive it into the ground. Depending on the depth of the update and the demands of life (we still have real jobs for now), we’re hoping to have this out some time in 2023. Adventure Update: This update will focus on expanding the family tree system that’s already in place by allowing family members to go on adventures to earn glory or disgrace themselves trying. Minigames may also be incorporated within this system to allow for more engaging gameplay during downtime. No estimates for release date yet. Magic Update: This will add a magic system that is intertwined with other aspects of the game, adding more depth and customizability. No estimates for release date yet. Other Areas of Improvement: Control settings, accessibility settings, improving efficiency, resource/population graphs over time, steam achievements, family tree portraits, and more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1994110/header.jpg?t=1655270202",
    "Price": 4.99,
    "Developers": "Lunatinea",
    "Publishers": "Lunatinea Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_8fdebca1ae13385e3c374081bf429eecbed4f80b.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_801990e7529a8e65e784bb744447edb22733c1d1.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_0edcfe3c4bf4fe8a88e24b7f11d91d81b41bfcdf.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_94b025d16c74baaddccf31d0727517c7a7f0f2ab.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_184d2b2649f41802269f2f5b2d9272db17055f52.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_23d1dc4141acfe8e4f1c60227b2b8587bdfd8e21.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_279046c6bd17e2ba1ad2205f3f0acde43e531915.1920x1080.jpg?t=1655270202,https://cdn.akamai.steamstatic.com/steam/apps/1994110/ss_bedf0a3ea966ad8a038830afb155642bba4a9c84.1920x1080.jpg?t=1655270202",
    "Slug": "fiefdom",
    "Meta Title": "Fiefdom: May 30, 2022, Lunatinea and Full Overview",
    "Meta Description": "Looking for information on Fiefdom? Check out the release date (May 30, 2022), developer insights from Lunatinea, and a complete game summary.",
    "Alt Text Image": "Official header image for Fiefdom game - Steam 1994110",
    "Canonical URL": "https://gusku.site/game/fiefdom",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fiefdom\", \"description\": \"Looking for information on Fiefdom? Check out the release date (May 30, 2022), developer insights from Lunatinea, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lunatinea\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lunatinea Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1994110/header.jpg?t=1655270202\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}