{
    "AppID": 851800,
    "Name": "G2 Fighter / 基因特工",
    "Release date": "Oct 12, 2018",
    "About the game": "G2 FIGHTER is a Top-Down view shooter ARPG with Low Poly style. We created a grand world and have built various of cities and scenes in it. Players are able to immerse themselves here and free to fight, drive and execute all kinds of missions. There will be a main story line that leads us go into this world of chaos, find the truth behind the darkness. NOTICE We are very sorry that due to new contents added to G2 Fighter, game structure has been changed which will result in players' data being erased. We will compensate for players whose data has been changed and the notice will be announced later. EXCITING COMBAT G2 Fighter has a fast-paced combat style, you can equip with 3 different kinds of firearms, 1 melee and 1 grenade. Powerful weapons will enable you to fight a bloody path from countless enemies. You can’t stop playing with this amazing experience in challenging! DIVERSE EQUIPMENT Equipment in G2 drops randomly, they are of different qualities and ranks which can be strengthen by forging and inlaying. Randomness makes equipment unique and you should always choose to gear those that match your combat style. Epic gear will also be your ultimate goal! EXTENSIVE QUESTS Besides the main story line, there are lots of side quests for you to choose. Different decisions on quests will result in different plots. Dungeons will be active in the latter stage of game, you can enjoy yourselves in endless war. FREE WORLD Real-time system will not only determine the light and shade but also influence event trigger. The open plan world map allows you to drive as you wish. With the story goes by, more forces will appear on horizon. Their destiny will also walk to different destinations. LIVELY DUBBING We invited Doug Cockle and a dozen superior dubbers to OMUK studio to dub for G2 FIGHTER. Dubbing shapes the images of characters, makes the story more vivid and leaves you feeling exhilarated. JOYFUL MULTIPLAYER Multiplayer mode is now available in G2. Cooperate with your friends, cover, charge and fire support! Assemble your team to defeat stronger enemies or make a joke on your close friends. We are sure this mode will bring you brilliant game experience. Timeline Chapter Three active, construction mode first stage (basic functions and preview on world map) Chapter Three on line, construction mode second stage (gather resources) Chapter Four on line, fight system optimization Chapter Five on line, complete the story, legion combat system Some other dungeons and interesting gameplay will be added in Chapter Four (for example fishing, cooking and driving). We will keep on transplanting of console &amp; NS version, plan to release in the middle of next year. Discord:",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/851800/header.jpg?t=1657562245",
    "Price": 15.99,
    "Developers": "一寸光年G2工作室",
    "Publishers": "一寸光年G2工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_4ca9b098845827ec05ef686ebb542fd86955658c.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_d93cbf1eef81fb0051833d0d9b68f27d77d64cfc.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_5a04e07404ec5c734aac4b7a663885fd8635cb2a.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_2a6a0dfd1db7a4b15d23fad91c532b35505adeac.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_3826b461034f571e9dc90aceeadaf668604c28f9.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_a84d60fb8776381aa2b35e4311ddf79a9d66d0e2.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_4417c0521083116ce519c0eb4aacb61bccab632b.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_f5d74e9ed424f49daec18ba17f25dec17baa442d.1920x1080.jpg?t=1657562245,https://cdn.akamai.steamstatic.com/steam/apps/851800/ss_03e82c9c9e0ba8994c36721dd5054cedeaf87eb2.1920x1080.jpg?t=1657562245",
    "Slug": "g2-fighter",
    "Meta Title": "G2 Fighter / 基因特工: Oct 12, 2018, 一寸光年G2工作室 and Full Overview",
    "Meta Description": "Looking for information on G2 Fighter / 基因特工? Check out the release date (Oct 12, 2018), developer insights from 一寸光年G2工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for G2 Fighter / 基因特工 game - Steam 851800",
    "Canonical URL": "https://gusku.site/game/g2-fighter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"G2 Fighter / \\u57fa\\u56e0\\u7279\\u5de5\", \"description\": \"Looking for information on G2 Fighter / \\u57fa\\u56e0\\u7279\\u5de5? Check out the release date (Oct 12, 2018), developer insights from \\u4e00\\u5bf8\\u5149\\u5e74G2\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u4e00\\u5bf8\\u5149\\u5e74G2\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u4e00\\u5bf8\\u5149\\u5e74G2\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/851800/header.jpg?t=1657562245\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}