{
    "AppID": 2008560,
    "Name": "วีรบุรุษไร้พลัง ไข่ต้ม",
    "Release date": "Jun 17, 2022",
    "About the game": "เนื้อหาของเกม เกมผจญภัย Rpg ระบบ Turn-based ผู้เล่นจะได้รับบทบาทเป็น 'ผู้กล้า' ที่ถูกอัญเชิญไปยังต่างโลก เป้าหมายของ 'พระราชา' ผู้ซึ่งอัญเชิญมีเพียงอย่างเดียวคือ ให้ช่วยกำจัดภัยร้ายในดันเจี้ยน ผู้กล้าต้องฝ่าฟันอุปสรรคต่าง ๆ สำรวจพื้นที่อันตราย สะสมประสบการณ์ หาแรร์ไอเทม เพื่อพิชิต 'ราชาอสูร' ลงให้ได้ รายละเอียดของเกม จากผู้พัฒนา - เกมแนว RPG turn-based - ค้นหาความลับ เก็บเลเวล และฝ่าอุปสรรคต่าง ๆ เพื่อกำจัดราชาอสูร - มีระบบคราฟอุปกรณ์ , อัพเกรดอุปกรณ์ , ปรุงอาหาร , เก็บผัก , แล่เนื้อ - มีระบบ เวทมนต์ และ กายภาพ , มีระบบ ธาตุ แพ้ทาง ชนะทาง - มีห้องปริศนา มากกว่า 25 ห้อง - มีสูตรคราฟอุปกรณ์ มากกว่า 25 สูตร ให้ออกค้นหา - มีของให้ประดิษฐ์ มากกว่า 70 อย่าง - มีสูตรเมนูอาหาร มากกว่า 50 สูตร - มีมอนสเตอร์ มากกว่า 50 ชนิด - มีบันทึกการฆ่ามอนสเตอร์ , บันทึกการตายของตัวเอง - บันทึก save ได้เฉพาะที่จุดเริ่มต้นเท่านั้น - ใช้เวลาเล่นมากกว่า 20 ชั่วโมง (คนสร้างลองเล่นเอง) เป็นเกมผจญภัยที่ใช้ระบบการต่อสู้แบบ Turn-based ทั่ว ๆ ไป ผู้เล่นจะต้องเพิ่มขีดความสามารถของตัวละครไปเรื่อย ๆ เพื่อผ่านอุปสรรคต่าง ๆ อย่างมอนสเตอร์ และไขปริศนาที่ซ่อนอยู่มากมายเพื่อปลดล็อคเส้นทางหรือรับสมบัติต่าง ๆ เกมจะเหมาะกับคนที่ชอบความท้าทาย ต้องรวบรวมข้อมูลเพื่อเอาชนะมอนสเตอร์แต่ละตัว ต้องออกค้นหาวิธีการมากมายเพื่อนำไปใช้สำหรับผ่านด่าน มีทั้งต้องฟาร์มและค้นหาสูตรคราฟนับไม่ถ้วน รวมถึงต้องออกล่าหาไอเทมเพื่อเพิ่มระดับความสามารถของตัวเอง รายละเอียดอื่น ๆ จากผู้พัฒนา ใช้โปรแกรม RPG Marker MV ในการสร้าง Plugin ก็ใช้จากแหล่งต่าง ๆ โดยจะมีเครดิตทั้งหมดอยู่ในเกมแล้ว เป็นเกมแรกที่ลองทำเลยครับ ถ้าเล่นแล้วรู้สึกสนุกเหมือนกับที่ผมเล่นก็คงจะดีมาก ๆ เลย (หวังอย่างแรงกล้า) ทดสอบเล่นมาหลายรอบแล้ว ใช้เวลาจนจบเกมไม่ต่ำกว่า 20 ชั่วโมง (คนสร้างเล่นเองนะเนี่ย) ภาพและบทพูดอาจจะไม่ได้สวยหรูอะไรมาก แต่ gameplay คิดว่าทำออกมาได้ค่อนข้างดีเลยแหละ (โม้) ตอนแรกตั้งใจว่าจะใช้เวลา 3 เดือนในการทำครับ แต่รู้สึกสนุกอยากทำให้ออกมาดีกว่านี้ เลยใช้เวลาไปครึ่งปีกว่าจะเสร็จ ; - ; ปริศนาบางแห่งค่อนข้างยากเลย และอาจจะยากมากในหลาย ๆ ครั้ง (พยายามเข้านะครับ) เจอมอนสเตอร์บางตัวอาจท้อ ต้องค้นหาวิธีที่จะเอาชนะมันให้ได้ (สู้ ๆ ครับ) ใช้คีย์บอร์ดเล่นจะง่ายกว่าใช้เมาส์ครับ (ดูปุ่มได้ที่หน้าตั้งค่า) คิดว่าไม่มีบัคที่ทำให้จบเกมไม่ได้เหลืออยู่แล้ว และบัคอื่น ๆ ก็คิดว่าไม่มีเหมือนกัน แต่ถ้าพบเห็นก็สามารถแจ้งมาได้ทางเพจนะครับ ถ้าสามารถแก้ให้ได้ ก็จะอัพเดตแก้ให้ครับ ภาพไอเทมและมอนสเตอร์บางตัว อาจจะใช้ซ้ำกันเยอะไปหมด (เช่นรูปอาวุธชุดเกราะ) แต่ก็พยายามทำให้ภาพไอเทมหลัก ๆ (เช่นขวดยา) แตกต่างกันอยู่พอสมควร หากใครซื้อไปเล่นและสามารถเล่นจนจบเกมได้แล้ว อย่าลืมแวะเอามาอวดกันบ้างนะครับ (ลุ้นมาก) เกมจะค่อนข้างยากในช่วงต้นที่ต้องเรียนรู้ระบบครับ และจะเริ่มท้าทายขึ้นเรื่อย ๆ โดยรวมก็ถือว่าแอบยาก แต่ก็น่าจะสนุกและสามารถเล่นได้ชิว ๆ ครับ... สู้ ๆ ขอบคุณทุกคนที่ลองซื้อไปเล่นและเขียนบทวิจารณ์มากเลยนะครับ // เกมหน้าคงไม่ได้ใช้ RPGMaker สร้างแล้ว อาจใช้เวลาอีกสักพักเลยกว่าจะออกเกมต่อไปได้ สามารถติดตามอัพเดตได้ทางเพจนะครับ &gt;&gt; เพจ Okcity ใครเคลียเกมได้ทักมาอวดทางเพจได้นะ ขอให้โชคดีและสนุกไปกับการผจญภัยครับ :D",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2008560/header.jpg?t=1657060043",
    "Price": 6.99,
    "Developers": "OKCITY",
    "Publishers": "OKCITY",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_7f3575c6f4328982d99b8978bbd3ad952a1f351b.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_8966d83f2a60dbe3a6a88f0793aede3d2419be1c.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_3d97468ab35bc3c6744cc9d0161b3df6eb7061ed.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_d1a991d87cb9584965cd6f2bb3954d31e9a28ad1.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_ce89c43a3a050825dce8a5041d1d1b443709a5fc.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_e640b0affc0aab01742f1dbadffa90a9908f00e7.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_f47176a527e3c0931e88598e5e22506df2c3f774.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_5f7a28325087c3406f956625e9343bd845eafead.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_adc456336d30494adb55898100c021bd006a3683.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_ca3d4ce648b972dd3f576d86fd750b99fc048162.1920x1080.jpg?t=1657060043,https://cdn.akamai.steamstatic.com/steam/apps/2008560/ss_7628945117f0b643b2e0c5427ffec5f5595074a7.1920x1080.jpg?t=1657060043",
    "Slug": "",
    "Meta Title": "วีรบุรุษไร้พลัง ไข่ต้ม: Jun 17, 2022, OKCITY and Full Ove...",
    "Meta Description": "Looking for information on วีรบุรุษไร้พลัง ไข่ต้ม? Check out the release date (Jun 17, 2022), developer insights from OKCITY, and a complete game summary.",
    "Alt Text Image": "Official header image for วีรบุรุษไร้พลัง ไข่ต้ม game - Steam 2008560",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u0e27\\u0e35\\u0e23\\u0e1a\\u0e38\\u0e23\\u0e38\\u0e29\\u0e44\\u0e23\\u0e49\\u0e1e\\u0e25\\u0e31\\u0e07 \\u0e44\\u0e02\\u0e48\\u0e15\\u0e49\\u0e21\", \"description\": \"Looking for information on \\u0e27\\u0e35\\u0e23\\u0e1a\\u0e38\\u0e23\\u0e38\\u0e29\\u0e44\\u0e23\\u0e49\\u0e1e\\u0e25\\u0e31\\u0e07 \\u0e44\\u0e02\\u0e48\\u0e15\\u0e49\\u0e21? Check out the release date (Jun 17, 2022), developer insights from OKCITY, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"OKCITY\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"OKCITY\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2008560/header.jpg?t=1657060043\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}