{
    "AppID": 1253710,
    "Name": "Garbage",
    "Release date": "Jun 4, 2021",
    "About the game": "Garbage is a fighting simulator game with management and building elements. Experience the struggle which a homeless man goes through in a humorous yet non-offensive manner. Primitive elements of contemporary life that we take for granted, such as staying warm, well-nourished, and hygienic, will become an issue. Experience a chilling story through hand drawn comics that narrate the silliness of Garbage world. Don't experience any of the negative emotions while being sucked in by the Garbage. Garbage world features a grim city environment with Garbage visual effects and catchy music. Listen to unique sounding character voices that resemble no words but a weird hobo mumble. Garbage fights are automatic, all preparations are done before the fight. A unique system that explores the uncharted grounds of the simulation genre. Choose between hundreds of skills to build something of a masterpiece fighter. Combine techniques to build a team that works together. Game features an in depth construction system with many unique buildings and upgrades. Surviving with minimal garbage resources makes it a challange. Build wisely and prioritize the necessities. Take care of your bums as if they were a Tamagochi - feed, shower, train them and much more. Hobos are unique creatures that require no special care to survive: they don't cry, they don't ask for any fancy pleasures. The game is very similar to real life, it has a weather system. Day, night and even seasons. This amazing system can both positively and negatively influence the survival. Garbage world has an inventory system with hundreds of items. Items that you can equip, craft, consume and trade for garbage. Employ bums to work at your camp. Those tireless workers that work for no pay are crucial to your survival. The city contains 5 districts that you can occupy and explore. There are over 30 unique areas within those districts. Visit your favourite church in the Bible's belt and beat up local religious bums to claim their garbage. Kids are vicious bosses for the homeless. But who would be our next generation of homeless if not kids? Children are not the only bosses that control Garbage world, in fact they are the weaklings. Homeless people group into gangs and operate the streets in an organized mater. Join them, oppose them, build your empire. Participate in organized events: legal and illegal. Join arenas for competitive fights. Influence story based on the path you choose. Find commotion in alleys and hidden places of garbage world. Participate in unique randomly generated events with unknown outcomes. Conquer garbage streets to receive a steady flow of resources that are scarce to the point of violent encounters.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1253710/header.jpg?t=1639062308",
    "Price": 14.99,
    "Developers": "Homebased",
    "Publishers": "GrabTheGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_f9b932537026e36478bbcaf9ebfd84faf0b7cb9d.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_045800df89c03c4efbf785444125432625e215a8.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_63c5e43b0ed921048b3dcd5b60c4d4cfff8b0181.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_cd3cb1d06697fef8c1403330e0c9f4bc75fd3fc0.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_0708fb31cd408dd62ac31931643bcb0fb513daa7.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_a77e99dfc1433ce2dce7a75edd3ec3c9b3ee9e5d.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_255ea780125106d807d14b31918092ab85b252b8.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_89e7fbb85d988c0eb4640d67c1c3350aa0d580d6.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_a43949640af7a76d397505840bdb99cbe89f9d87.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_4ae80eec5c9a5e69cb633511f16220d483038eb7.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_22c368ad8e1e1ecf4393c7d29334b1fcd85b487f.1920x1080.jpg?t=1639062308,https://cdn.akamai.steamstatic.com/steam/apps/1253710/ss_3c33cfd7fe4894b4d3feb707c30e917f4aadb6ef.1920x1080.jpg?t=1639062308",
    "Slug": "garbage",
    "Meta Title": "Garbage: Jun 4, 2021, Homebased and Full Overview",
    "Meta Description": "Looking for information on Garbage? Check out the release date (Jun 4, 2021), developer insights from Homebased, and a complete game summary.",
    "Alt Text Image": "Official header image for Garbage game - Steam 1253710",
    "Canonical URL": "https://gusku.site/game/garbage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Garbage\", \"description\": \"Looking for information on Garbage? Check out the release date (Jun 4, 2021), developer insights from Homebased, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Homebased\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GrabTheGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1253710/header.jpg?t=1639062308\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}