{
    "AppID": 1522690,
    "Name": "In My Defense",
    "Release date": "Aug 1, 2021",
    "About the game": "This is a challenging, old-school, retro, side-scrolling shooter. You must defend your base, against the onslaught of alien attackers. Features: Radar of entire playfield, shows where threats exist Picture in picture view of the base, so you can keep an eye on it 28 waves 15 power-ups. Power-ups can be combined 10 bonus twin-stick shooter levels, starring Hitch, the security robot, take place under the base. Many enemies on these levels are spawned by generators, that must be destroyed. Ensects attack power generators, damaging the base. There are gas outlets that cause large explosions, if shot. Multiple weapons, including: Lasers, Bombs, and the dreaded Sonic Bomb, which can mass-kill enemies Many enemy types, each with unique abilities Boss battles Snow, thunderstorm, and darkness environments. Dark environments must be lit with flares AI-powered wingmen can be summoned to assist. Careful, they can be turned against you Rock launchers help you defend the base. You can pick them up and re-position them with your ship You can escort evacuation ships to the opposite side of the playfield. If they escape, you are rewarded with resources Defensa- your ship's computer voice. She informs you when you activate power ups, warns of threats, and makes comments about the unfolding events Original Soundtrack- original soundtrack written specifically for the game by six different composers Optional arcade style controls, where the joystick on the gamepad only moves your ship vertically. Horizontal movement is done via thrust and reverse buttons Randomized waves - no two waves are the same, for improved re-playability New Endless wave mode- One increasing endless wave with all regular enemies. How long can you last? A gamepad is recommended. Photosensitive seizure warning Thunderstorm levels have lightning flashes in the sky. A very small percentage of people may experience a seizure when exposed to certain visual images, including flashing lights or patterns that may appear in video games. Even people who have no history of seizures or epilepsy may have an undiagnosed condition that can cause these “photosensitive epileptic seizures” while playing video games. Immediately stop playing and consult a doctor if you experience any symptoms.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1522690/header.jpg?t=1652580052",
    "Price": 4.99,
    "Developers": "Scientist Software",
    "Publishers": "Scientist Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1522690/ss_03310224f632d47e6242fbc90daaa051a6a3439e.1920x1080.jpg?t=1652580052,https://cdn.akamai.steamstatic.com/steam/apps/1522690/ss_2150a66971cc5619f3c573d3522ae1e4a9680207.1920x1080.jpg?t=1652580052,https://cdn.akamai.steamstatic.com/steam/apps/1522690/ss_9c9e81684783397772f619f2028c7645b763d268.1920x1080.jpg?t=1652580052,https://cdn.akamai.steamstatic.com/steam/apps/1522690/ss_e1ddb3cd31ccfd06e57c943f5eee11c76d104fd0.1920x1080.jpg?t=1652580052,https://cdn.akamai.steamstatic.com/steam/apps/1522690/ss_f2ce61a5e810c8e410e6128205178bf0278d5478.1920x1080.jpg?t=1652580052,https://cdn.akamai.steamstatic.com/steam/apps/1522690/ss_033312e3b7e9d6663462f058a9b4db868ce8cfad.1920x1080.jpg?t=1652580052",
    "Slug": "in-my-defense",
    "Meta Title": "In My Defense: Aug 1, 2021, Scientist Software and Full O...",
    "Meta Description": "Looking for information on In My Defense? Check out the release date (Aug 1, 2021), developer insights from Scientist Software, and a complete game summ...",
    "Alt Text Image": "Official header image for In My Defense game - Steam 1522690",
    "Canonical URL": "https://gusku.site/game/in-my-defense",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"In My Defense\", \"description\": \"Looking for information on In My Defense? Check out the release date (Aug 1, 2021), developer insights from Scientist Software, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Scientist Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Scientist Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1522690/header.jpg?t=1652580052\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}