{
    "AppID": 949600,
    "Name": "Intergalactic Fishing",
    "Release date": "Apr 21, 2020",
    "About the game": "In Intergalactic Fishing you play as an angler tasked with solving the mystery of what is causing the fish to die in your local lake. You must travel to many different lakes all over the universe, exploring, catching fish, gathering data, completing quests, upgrading your gear, and talking with other anglers and scientists in order to figure out what is going on. Explore countless lakes all over the universe Explore the dozens of populated lakes in the ULT Network or venture into the unknown and explore uncharted lakes. With procedurally generated lakes and fish species, there is always something unique and interesting to discover. Fish behavior simulation Each fish in the lake is individually simulated. Fish behave differently based on their species, size, habits, lure preferences, time of day, their surroundings, etc. Learn about how a species behaves to catch more fish! Design your own lures Target certain fish species by designing a lure that they will be more likely to bite. Try to create a lure with the perfect stats and behavior with your available lure parts and mods. Use your BOAT to travel the universe The Buoyant Object for Above-Water Travel (or BOAT) is a high-tech watercraft equipped with a Universal Lake Teleporter capable of near-instant teleportation to lakes all over the universe. Your BOAT is also equipped with underwater jets for precise maneuverability in the water, a lure fabricator that can create custom-designed lures on demand, and several module slots that allow you to customize your BOAT to your liking. Participate in Tournaments Join fishing tournaments and compete for prizes against the best anglers in the universe. The live leaderboard shows you how you are doing during the tournament. Take on Fish Contracts Accept Fish Contracts to catch a certain species of fish from a certain lake then go out to the lake, get your fish, and turn it in for a reward. Meet other anglers and complete quests In your travels, you may come across other anglers who can give you some information about the lake or the fish in the lake, or perhaps you will meet someone who needs help and has a quest for you. Upgrade your gear Sell valuable fish, complete quests, win tournaments, gather and sell data about lakes and fish species, and complete fish contracts in order to upgrade your gear. Get a better BOAT, a stronger rod, or modules for your BOAT that add new functionality. Flexible main story quest The main quest acts as a guide to introduce the player to the different activities in the game, but you can strike off on your own and do whatever you feel like at any time and return to the main quest later. Detailed career stat tracking Keep a tally of just about everything you do from number of fish caught to total credits earned to number of lakes visited. Intergalactic Fishing Society An endgame progression system continues to provide goals, tasks, and challenges after completing the main quest and allows you to earn unique and powerful rewards. Together with the sandbox nature of the game, there's always something to do! Daily Tournaments and Unknown Lake Leaderboard See how you stack up against other players by competing in the Daily Tournament with Steam Leaderboard support. You can also choose to have your catches submitted to a leaderboard of the largest fish caught in Unknown Lakes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/949600/header.jpg?t=1646153420",
    "Price": 14.99,
    "Developers": "Boat Anchor Games",
    "Publishers": "Boat Anchor Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_91d98ec110e7f672410c84135c3c646a61d2ef75.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_46783b3071573bb1a33358bedf2882bed3515285.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_06789839121b87042b6335fa307f541af27f32ca.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_117fae7cf7aa2a8e3dea091923488b11a7af2bb3.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_a25f5b65240bfac8fb20ed0539c76c916bab001d.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_add51f16dbb5dccff60b231ea37fcfc260e5f0f5.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_9001426167e7ac908e12d72a27e6527f83b3d40f.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_75b4feef09e7992b0dec39ca208347676a127efc.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_4b36d9d01efd9a9b36d380d5112cc62e0dacdcfe.1920x1080.jpg?t=1646153420,https://cdn.akamai.steamstatic.com/steam/apps/949600/ss_c379e90385bf1529547e199bbe85ddaf41d83f79.1920x1080.jpg?t=1646153420",
    "Slug": "intergalactic-fishing",
    "Meta Title": "Intergalactic Fishing: Apr 21, 2020, Boat Anchor Games an...",
    "Meta Description": "Looking for information on Intergalactic Fishing? Check out the release date (Apr 21, 2020), developer insights from Boat Anchor Games, and a complete g...",
    "Alt Text Image": "Official header image for Intergalactic Fishing game - Steam 949600",
    "Canonical URL": "https://gusku.site/game/intergalactic-fishing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Intergalactic Fishing\", \"description\": \"Looking for information on Intergalactic Fishing? Check out the release date (Apr 21, 2020), developer insights from Boat Anchor Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Boat Anchor Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Boat Anchor Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/949600/header.jpg?t=1646153420\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}