{
    "AppID": 1745740,
    "Name": "Laserboy",
    "Release date": "Nov 22, 2021",
    "About the game": "NEW: SUPERFAN UPDATE (2022)! Beat your runs: start from any level you’ve already completed with our nifty new level select screen (with music!) Jump right in: Get straight to the action by skipping all intro cutscenes. No time to mess around buddy! Track your runs: view your best score ratings for each level and think about how you could spend your time to become better... at everything. Reeeewind: quickly restart a level or replay the previous one to nail those challenges. Get those perfect scores! Nice: lots of fixes and delightful features that make defeating The Scientist even more enjoyable. CHALLENGE UPDATE (2021)! Speedrun Mode : Focus on the need for speed by turning off all dialogue. Just pure gameplay, baby! Brand New Achievements : we’ve added more ways to challenge and reward players. Some are easy, some are hard but all of them are neat. No FX Mode : A new accessibility feature that turns off shakes, jitters, and other glitch effects. The game is still weird though, don’t worry. Windowed Mode : Added due to popular demand! Bug fixes : stability and performance fixes to make all this buttery mayhem feel more buttery. Laserboy is a tiny experimental game. Help Buddy reach the end of 13 levels as quickly as possible without damaging too much expensive lab equipment or personnel. The catch? You have a tactical laser shooting out of your eye every 5 seconds. Good luck! How to Play Your character can move around in the level but there’s no jumping or controlled shooting so it’s important to use the tactical beam, well, tactically. While a fast level time and low bill total will improve your score rating, you can play this game any way you like. Lots of people just take their time and destroy stuff, or look for the odd secret. From the Devs This was a ridiculous game jam idea we turned into a small passion project, and we’re just happy it exists. We hope you find something for you in it and if not that’s cool too. Feel free to join our discussions page . Say hi, share your thoughts, or ask for help. Glorbo welcomes! Additional Information LASERBOY is the miraculous remaster of the iconic video game by Catfun Corp , originally created for the Funvision Entertainment System . Thought until recently to have been forever lost to time, LASERBOY has been painstakingly rebuilt and faithfully recreated from the ground up by an expert team of digital archaeologists at Universal Entities using fragments of art and code found in the wreckage of [REDACTED]. A story of lore, lasers, and [REDACTED]. Music by Germany's pop sensation: Lenni Revenge .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1745740/header.jpg?t=1646069580",
    "Price": 0.0,
    "Developers": "Universal Entities",
    "Publishers": "Universal Entities",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_07a6380eed40067dd86ec072fb66845df1347def.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_5000c741087bfff590a127b8c2a903110795a81a.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_81f0e8ecbaa64f2719fe6b22a7f2967a0cac409f.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_8b6049e9e098f407542060b91af4b9c1027c9fec.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_ab5d47d270f3c290d8183259092a3c81ff62c046.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_e6a8503a753ba952bd3b63932dcb5599417a4358.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_2df149d87193150191a669f8e5aecfaee0501151.1920x1080.jpg?t=1646069580,https://cdn.akamai.steamstatic.com/steam/apps/1745740/ss_5e6fb5115fe99d8472b116aeb6f9760921ce3663.1920x1080.jpg?t=1646069580",
    "Slug": "laserboy",
    "Meta Title": "Laserboy: Nov 22, 2021, Universal Entities and Full Overview",
    "Meta Description": "Looking for information on Laserboy? Check out the release date (Nov 22, 2021), developer insights from Universal Entities, and a complete game summary.",
    "Alt Text Image": "Official header image for Laserboy game - Steam 1745740",
    "Canonical URL": "https://gusku.site/game/laserboy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Laserboy\", \"description\": \"Looking for information on Laserboy? Check out the release date (Nov 22, 2021), developer insights from Universal Entities, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Universal Entities\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Universal Entities\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1745740/header.jpg?t=1646069580\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}