{
    "AppID": 331980,
    "Name": "Last Inua",
    "Release date": "Dec 11, 2014",
    "About the game": "A father and son tale, Last Inua will leave you breathless with its immersive, emotional and captivating gameplay. Last Inua is an immersive and emotional, award winning 2D platform adventure game developed by Glowforth. Designed for the young and old and mixing classic platform genres, culminating in a captivating experience, Last Inua tells the tale of an Inuit family’s fight for survival against a fearsome demon and the harsh elements of the mythical Arctic. The Tonrar, a demonic trickster, has awoken in the Arctic. The mythical powers that are still very active in this part of the world are under severe threat. The Tonrar is spreading his darkness that is taking over both the physical aspects (ice, snow and caves) but also the mythological. The Inuit gods, giant mythical creatures; the Ice Bear, the Raven and the Narwhal are all under threat by the Tonrar. They are slowly losing their power, health and sanity - infected by this darkness. Hiko and Ataataq are the only hope, yet Hiko is physically and will need to rely on the brute strength of his powerhouse father, Ataataq. Guiding Hiko, his physically weak but gifted son along this epic journey, Ataataq will need to rely on his brute strength to overcome many obstacles. Hiko, although more fragile than his father, carries with him supernatural abilities and magical skills that exceed the physical powers of his father. Together, Ataataq and Hiko must traverse the arctic landscape and visit The Trinity of the Mythical Creatures to help defeat the malevolent Tonrar. Physically weak and fragile, Hiko will need the help of his father to reach the end of this wondrous tale. Key Features An immersive + emotional, award winning 2D platform adventure. Intriguing storyline, epic scenery, beautiful gameplay &amp; fun puzzles. Amazingly handcrafted character animations and artwork. Control two unique characters with a strong emotional bond A unique world combining Inuit mythology + modern game culture.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/331980/header.jpg?t=1633017292",
    "Price": 7.99,
    "Developers": "Glowforth",
    "Publishers": "Wired Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/331980/ss_cbb4c2537ab857bd4aa925c9f7ad36857745848a.1920x1080.jpg?t=1633017292,https://cdn.akamai.steamstatic.com/steam/apps/331980/ss_722c3eb4e252affaea3a5b0f33944b61ce4b5c88.1920x1080.jpg?t=1633017292,https://cdn.akamai.steamstatic.com/steam/apps/331980/ss_a98b5b2c48ee0ac1833ee35fe7e8cfd8b63a63f3.1920x1080.jpg?t=1633017292,https://cdn.akamai.steamstatic.com/steam/apps/331980/ss_5dd864abdca8d039af93804f65f02cfd9903b4d9.1920x1080.jpg?t=1633017292,https://cdn.akamai.steamstatic.com/steam/apps/331980/ss_66919f76d2cd57bd635e1cfbcefde442582a168b.1920x1080.jpg?t=1633017292",
    "Slug": "last-inua",
    "Meta Title": "Last Inua: Dec 11, 2014, Glowforth and Full Overview",
    "Meta Description": "Looking for information on Last Inua? Check out the release date (Dec 11, 2014), developer insights from Glowforth, and a complete game summary.",
    "Alt Text Image": "Official header image for Last Inua game - Steam 331980",
    "Canonical URL": "https://gusku.site/game/last-inua",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Last Inua\", \"description\": \"Looking for information on Last Inua? Check out the release date (Dec 11, 2014), developer insights from Glowforth, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Glowforth\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wired Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/331980/header.jpg?t=1633017292\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}