{
    "AppID": 397820,
    "Name": "Let's Sing 2016",
    "Release date": "Jan 21, 2016",
    "About the game": "Sing solo, in a duet or with all your friends – your talent in the spotlight! Let's Sing 2016 brings a brand new generation of karaoke to your PC! Whether you're an experienced vocalist or a bathroom crooner, grab a mic and give it all you've got with the 35 available hits , including Bruno Mars, Meghan Trainor, Calvin Harris, Sam Smith, Avicii, Maroon 5, John Legend and many more. The more the merrier! Let's Sing 2016 can be played by up to 8 singers at the same time and has 7 exciting new game modes ! So challenge your friends or sing along together to a playlist of top chart hits. Meghan Trainor – All About That Bass Mark Ronson feat. Bruno Mars – Uptown Funk Ariana Grande feat. Iggy Azalea – Problem Sam Smith – Stay With Me Jessie J, Ariana Grande &amp; Nicki Minaj – Bang Bang Lorde – Royals John Legend – All Of Me Avicii – Wake Me Up Demi Lovato – Let It Go Lady Gaga – Applause Bastille – Pompeii Calvin Harris – Summer Sia – Chandelier Charli XCX – Boom Clap Coldplay – A Sky Full Of Stars Avicii – The Nights Ella Henderson – Ghost Clean Bandit &amp; Jess Glynne – Real Love Kiesza – Hideaway Calvin Harris feat. Ellie Goulding – Outside TLC – No Scrubs Nelly Furtado – Maneater The Cure – Friday I’m In Love George Ezra – Budapest Rita Ora – I Will Never Let You Down Sigma feat. Paloma Faith – Changing Jess Glynne – Hold My Hand Olly Murs feat. Demi Lovato – Up James Blunt – You’re Beautiful Leona Lewis – Bleeding Love Roxette – It Must Have Been Love Fun feat. Janelle Monáe – We Are Young Maroon 5 – Moves Like Jagger LMFAO – Party Rock Anthem Queen – Don’t Stop Me Now Perform your favourite songs in 7 game modes that will really put your talents to the test! CLASSIC – The person with the highest score wins the round! BY HEART – Some lyrics will disappear during the song. EXPERT – Test your memory! All the lyrics and instructions are hidden. PASS THE MIC – Take it in turns! During the song, there is a signal to tell you when to pass the mic to your partner. DUET – Share a song with one or more friends. Each person sings a verse. 20,000! – The first person to get 20,000 points wins! ELIMINATION – You start with a full bar of energy that gets reduced with every wrong note. If you lose all your energy, you are eliminated. The last player still singing wins. What's more, you can launch the JUKEBOX to play a constant stream of video clips. Ideal for keeping the atmosphere going between 2 rounds! Grab your mics ... Let's Sing!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/397820/header.jpg?t=1596039426",
    "Price": 3.99,
    "Developers": "Voxler Games",
    "Publishers": "Ravenscourt",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/397820/ss_30da68a5d41e667abbe12de7e58797794397a192.1920x1080.jpg?t=1596039426,https://cdn.akamai.steamstatic.com/steam/apps/397820/ss_e46568dcf1a942da442daf66c42cf04b817dbe0d.1920x1080.jpg?t=1596039426,https://cdn.akamai.steamstatic.com/steam/apps/397820/ss_c0714de11907264ed124e190bec6ed6157c69c62.1920x1080.jpg?t=1596039426,https://cdn.akamai.steamstatic.com/steam/apps/397820/ss_e6362a355b697e29b3c238a518923c7c3c0dcf16.1920x1080.jpg?t=1596039426,https://cdn.akamai.steamstatic.com/steam/apps/397820/ss_2bb4db5b59708f2f2ceffb27eca218aa29cb4ac1.1920x1080.jpg?t=1596039426",
    "Slug": "let-s-sing-2016",
    "Meta Title": "Let's Sing 2016: Jan 21, 2016, Voxler Games and Full Over...",
    "Meta Description": "Looking for information on Let's Sing 2016? Check out the release date (Jan 21, 2016), developer insights from Voxler Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Let's Sing 2016 game - Steam 397820",
    "Canonical URL": "https://gusku.site/game/let-s-sing-2016",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Let's Sing 2016\", \"description\": \"Looking for information on Let's Sing 2016? Check out the release date (Jan 21, 2016), developer insights from Voxler Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 21, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Voxler Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ravenscourt\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/397820/header.jpg?t=1596039426\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}