{
    "AppID": 718490,
    "Name": "LOGistICAL: Japan",
    "Release date": "Oct 6, 2017",
    "About the game": "LOGistICAL: Japan is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the islands. Japan starts out with many tiny villages on the north island. Most only needing local supplies. Once you break into the main islands things escalate quickly with many huge cities and much larger trucks needed. * Supply and finish many large cities * Work your way through the long complex maze of road enhancements to finally allow all your large trucks access across the state * Many, many other small and large puzzles and situations to complete. LOGistICAL: Japan brings you all the fun and puzzling of LOGistICAL with even more towns, more puzzles and much more to do. A big thanks to Marco (desangre) for mapping out all the Japan industries and providing ideas for Japan's gameplay. THIS GAME DOES NOT REQUIRE THE ORIGINAL LOGISTICAL GAME TO PLAY. Over 700 towns to Complete. LOGistICAL: Japan game covers the islands of Japan including cities like Tokyo, Osaka, Kyoto, Kobe and many, many more. There are many new obstacles and deliveries to make. ... LOGistICAL: Japan is an independent, standalone game independent from the main LOGistICAL game (and other add-ons). It has its own money, trucks and of course, challenges. ... LOGistICAL is a large open-world, strategy, puzzle game where you transport different cargoes to complete all the towns throughout the country. The whole game is a huge puzzle while each town is its own little piece of puzzling. There are over 1,000 towns to complete. Plenty of towns are easy enough. Some take complex planning. Do them in your own order. Get bonuses for completing regions and contracts. Some cargoes are easy to get. Others you have to create in industries. Use existing industries and build your own. The further you get from the start the more strategies you have to use. Pimp up your trucks with bonuses. Last truck delivering gets the bonus. The towns and map are to scale. Current or historical industry placement. You could even say that playing is educational. There is plenty more to keep you on your toes. Towns consume the cargoes you are trying to get to completion. Big trucks are great for moving lots of stuff, but can't travel everywhere. There are lots of broken roads that need deliveries. Upgrade the industries for better exponential throughput. Cargo stores can sure come in handy. What! I can't take my big trucks across the water on a ferry. ... and what is with those quarantine checkpoints? Complete towns, roads, industries, contracts, regions and states for lots of in-game and Steam achievements.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/718490/header.jpg?t=1560250546",
    "Price": 8.99,
    "Developers": "Sacada",
    "Publishers": "Sacada",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_da165f939f28e0f4ec2808773c70778cbbb7778c.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_54d55bc946212eacbffdbc4f6cce7fab4342ffd1.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_03c822c8ed32ee371e05c2594d51a63d9ba81e04.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_61df11391b49951ef1b4ac955f5b00951093c9e1.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_83ede7f2ed59b18f84c618de0a0e29c6bda7f5e7.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_9170eecb7f5c368199af3386a2ef876a007210ad.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_9dd2eb01ee17c97a22873819b5c10c010434071a.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_a87ee3d168378904fa5defc05ab88283e61564ff.1920x1080.jpg?t=1560250546,https://cdn.akamai.steamstatic.com/steam/apps/718490/ss_4748b5661fe2cbdb4a539461c18606490581e320.1920x1080.jpg?t=1560250546",
    "Slug": "logistical-japan",
    "Meta Title": "LOGistICAL: Japan: Oct 6, 2017, Sacada and Full Overview",
    "Meta Description": "Looking for information on LOGistICAL: Japan? Check out the release date (Oct 6, 2017), developer insights from Sacada, and a complete game summary.",
    "Alt Text Image": "Official header image for LOGistICAL: Japan game - Steam 718490",
    "Canonical URL": "https://gusku.site/game/logistical-japan",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LOGistICAL: Japan\", \"description\": \"Looking for information on LOGistICAL: Japan? Check out the release date (Oct 6, 2017), developer insights from Sacada, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 6, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sacada\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/718490/header.jpg?t=1560250546\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}