{
    "AppID": 760060,
    "Name": "Mutant Year Zero: Road to Eden",
    "Release date": "Dec 4, 2018",
    "About the game": "“By blending real-time stealth with tried-and-true tactics gameplay, Mutant Year Zero: Road to Eden breaks exciting new ground for the turn-based strategy game.” - IGN From a team including former designers of HITMAN and PAYDAY comes Mutant Year Zero: Road to Eden, a tactical game that combines the turn-based combat of XCOM with real-time stealth and exploration of a post-human world reclaimed by nature… and Mutants. Of course the world ends. It was just a question of time. Extreme climate change, global economic crisis, a lethal pandemic, and increasing tension between old and new superpowers. For the first time since 1945 nuclear weapons were used in armed conflict. Mushroom clouds rose from east to west before the dust settled. Now it’s over and the Earth is still. Nature has invaded ruined cities. Wind sweeps through empty streets, turned into graveyards. The humans are all gone. Scavenging through the remains of civilization are the Mutants, deformed humanoids and animals alike, searching for salvation or just something to eat. To survive, you and your companions must venture out to explore the Zone. Maybe one day you will find the Eden of legends, the ancients’ haven in the middle of hell. That’s where truth awaits, the stories say. Maybe you will find your answers there. Then again, maybe it’s all bullshit. TACTICAL COMBAT Mutant Year Zero: Road to Eden is the ultimate fix for your tactical strategy addiction. Dive into a deep, turn-based, tactical combat system inspired by the XCOM games. EXPLORE A POST-HUMAN EARTH Journey through a post-human world of abandoned cities, crumbling highways, and overgrown countryside. Check back at the Ark, a neon-bathed oasis of ill repute and questionable characters, to restock your supplies and plan out your next adventure. CONTROL A TEAM OF MUTANTS A duck with an attitude problem and a boar with anger issues; these aren’t your typical heroes. Get to know Dux, Bormin, Selma, and many other characters each with their own unique personality and deranged perspective on the world and their situation. MASTER THE STEALTHY APPROACH Sneak through shadows to avoid conflict or to catch enemies unaware. Real-time stealth allows you full control of approach: sneak into an enemy camp, position the team of Mutants to your advantage, and gain the element of surprise. UNLOCK MUTATIONS Unlock new mutations and abilities for your Mutants, such as Selma’s grasping vines, Bormin’s Charge, and Dux‘ uncanny ability to sneak into a camp full of enemies unnoticed, despite being a 4-foot tall walking, talking duck with a crossbow. DYNAMIC ENVIRONMENT Use the environment to your advantage. Stay out of floodlights, hide from line of sight, or just blast down fully destructible walls and buildings and wreak utter havoc. LOOT, LOOT EVERYWHERE From makeshift slingshots to high-powered rifles and top hats to police vests, make sure you equip your Mutants for the dangers ahead. Nothing says post-human quite like a mutated boar in spiked metal armor charging at you with a blunderbuss in his hands.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/760060/header.jpg?t=1635420768",
    "Price": 13.99,
    "Developers": "The Bearded Ladies",
    "Publishers": "Funcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_cc3ae0dc48d7f9294eadadd2ffd96a8284455e7a.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_455ca83e8708581231fe8c7c8861aa47547f50db.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_3e897582becb70f80afa568fe85004ba4e507caa.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_1c499d1996b390e2d6e5a95d1b73f54e3fd9ec1e.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_a61f5608dfaee2e5f152d512744b3924ab43ce35.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_422c06d4911bb0a4c1f9dd010f4af26a06bbbf83.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_cd1af2c00807a6e4645506a3943491833c562313.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_fd0d399c7c6d1823963a56b73e4964f9b52d4dc6.1920x1080.jpg?t=1635420768,https://cdn.akamai.steamstatic.com/steam/apps/760060/ss_d2e76794f7064f55dda5ca66aa79e7b26271ff4c.1920x1080.jpg?t=1635420768",
    "Slug": "mutant-year-zero-road-to-eden",
    "Meta Title": "Mutant Year Zero: Road to Eden: Dec 4, 2018, The Bearded ...",
    "Meta Description": "Looking for information on Mutant Year Zero: Road to Eden? Check out the release date (Dec 4, 2018), developer insights from The Bearded Ladies, and a c...",
    "Alt Text Image": "Official header image for Mutant Year Zero: Road to Eden game - Steam 760060",
    "Canonical URL": "https://gusku.site/game/mutant-year-zero-road-to-eden",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mutant Year Zero: Road to Eden\", \"description\": \"Looking for information on Mutant Year Zero: Road to Eden? Check out the release date (Dec 4, 2018), developer insights from The Bearded Ladies, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Bearded Ladies\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Funcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/760060/header.jpg?t=1635420768\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}