{
    "AppID": 2022680,
    "Name": "NIRAVASI",
    "Release date": "Jul 6, 2022",
    "About the game": "Story In ages past, there existed a city unlike any other. From the strength and unity of humanity, Niravasi was born. But when a brutal war ravaged the world itself, Niravasi became lost to the depths of space. Some say its people remain unharmed, while others speak of dark horrors residing in its streets. In the end, these are just stories. But Niravasi is real. About NIRAVASI is a Dark Adventure game, set within the ruins of an ancient human city. You play as Mura , a feline archaeologist that finds himself trapped within the titular lost city of ruin after being split off from the rest of his team. Armed with only a flashlight, and a mysterious ally guiding him through the city with his handheld radio, Mura must now navigate the dark streets of Niravasi to find his missing team and make his way out of derelict cityscape. But Mura is not the only one living within Niravasi . Guarding it is the Artificial Ecological Overseer Network (A.E.O.N) , an artificial intelligence built to protect and perfect humanity. Together with its robotic proxies, A.E.O.N will do everything in its power to remove anyone who arrives in the city uninvited. Among these machines is a particularly devastating one known only as The Harvester , which will continually track and hunt Mura down until either the latter escapes or is killed. In order survive, you’ll need both your skills and wits to help keep Mura alive long enough to find a way to escape Niravasi . Built using the RPG Maker MV engine (and the MV3D plugin), NIRAVASI will take you through a world filled with both wonders and horrors. Whether you wish simply to leave the city or explore its most darkest secrets, the throne of humanity offers many riches to those willing to take the leap. After all, there is always protection in perfection . Explore a lost city! Niravasi may be infested by robots, but its streets are filled with many wonders to behold. From the dilapidated ruins of the ancient Stepwell of Dhara Hanirr , to the sunken streets of the Aruvi District , NIRAVASI offers players a variety of amazing levels to explore. Excavate the secrets within! While the humans that lived here are long gone, the stories they had still remain. Venture through the darkest depths of the city, and uncover the sinister secrets that shed some light on the lives of the people who lived here, as well as how the city came to fall in the first place. Evade an army of machines! In humanity's absence, A.E.O.N (the artificial intelligence that watches over the city) has filled the city with a large army of robotic proxies, which must be avoided at all costs. Use your skills and wits as an archaeologist to sneak past them and avoid detection at all cost. Escape the Harvester! If you've been detected by A.E.O.N , the Harvester will not be far behind. Hastily make your way to safety before the timer runs out, or else the Harvester will live out its namesake. Expect anything! Niravasi is an alien world to an alien cat, as well as a city that's been derelict for centuries. You'll have to open your mind to all possibilities if you want to escape the lost city unharmed. Enjoy its surreal visuals! NIRAVASI sports a very distinct art-style, blending pixel art styles with iconography found within corporate organisations, and the ancient civilisations of old. Go out there and see what you can find! Endure the truth of your heart! You get to play as a cat! What's not to love about that?!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2022680/header.jpg?t=1657184319",
    "Price": 9.99,
    "Developers": "SOVERAM",
    "Publishers": "SOVERAM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2022680/ss_cfaa5306f06d85f7dd89b5f034da2f1f0356c6f2.1920x1080.jpg?t=1657184319,https://cdn.akamai.steamstatic.com/steam/apps/2022680/ss_91c84f1e2fbf5e3e1bb998f83463b2e2c78315a1.1920x1080.jpg?t=1657184319,https://cdn.akamai.steamstatic.com/steam/apps/2022680/ss_790a4021792926262994935d4642cd4a60a62354.1920x1080.jpg?t=1657184319,https://cdn.akamai.steamstatic.com/steam/apps/2022680/ss_5eb890e1d26daa0d14a0df7254e261f9da929705.1920x1080.jpg?t=1657184319,https://cdn.akamai.steamstatic.com/steam/apps/2022680/ss_ec949e50ee16f71a83b3fbc62545bfa338a6e7d9.1920x1080.jpg?t=1657184319",
    "Slug": "niravasi",
    "Meta Title": "NIRAVASI: Jul 6, 2022, SOVERAM and Full Overview",
    "Meta Description": "Looking for information on NIRAVASI? Check out the release date (Jul 6, 2022), developer insights from SOVERAM, and a complete game summary.",
    "Alt Text Image": "Official header image for NIRAVASI game - Steam 2022680",
    "Canonical URL": "https://gusku.site/game/niravasi",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NIRAVASI\", \"description\": \"Looking for information on NIRAVASI? Check out the release date (Jul 6, 2022), developer insights from SOVERAM, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SOVERAM\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SOVERAM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2022680/header.jpg?t=1657184319\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}