{
    "AppID": 1330370,
    "Name": "One Shell Straight to Hell",
    "Release date": "Feb 9, 2021",
    "About the game": "The Padre is back with a spin-off that mixes old school twin-stick shooting action with roguelite dungeon-crawling gameplay and base defence phases ! World-famous fist of the papal order, renowned presenter at Vatican TV, Exorcist at International Association of Exorcists and the one and only internationally licensed demon-hunting priest, Father Padre Alexander! Simply known as the Padre to his friends and foes alike, Padre Alexander is a bad-ass demon hunter and a man of the cloth. He is no ordinary priest, being sarcastic towards God, church and most of all human and demonic behaviour. He is not quite sane as an ordinary person but his insights into human life and tragedy can sometimes resonate with everyman. Padre comes to assist the Halliwell family, who for generations have been keeping an earthly entrance to hell in check. The portal was quiet for far too long and such the residents of the mansion slowly forgot their task, thinking of their burden more as a fairy tale. Descend into ever-changing dungeons that overflow with demonic enemies and pit your insane skills and over the top weapon collection against the satanic hordes. Use an arsenal made of regular weapons using varieties of ammunition, holy weapons drawing on your faith, and unholy weapons craving for your blood. Gain Blessing points to customize the skill tree that makes you stronger and gives you new useful miracles. Base defence sessions. When not busy dungeon-crawling, Padre Alexander will have to defend the mansion from waves of enemies both by using his skills and by building traps, global enchantments, and powerups. While our protagonist got visibly smoother from the original The Padre, the voxel-inspired minimalist art style pervades the spooky environments as much as every character, monster and item. A collection of monsters that are madder than the Mad Hatter, ranging from the possessed kitchen drawer to drunken long-dead pirate captains, passing through spooky insects and, of course, demons... a lot of demons. And unique bosses with an attitude.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1330370/header.jpg?t=1624533433",
    "Price": 19.99,
    "Developers": "Shotgun with Glitters",
    "Publishers": "Feardemic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1330370/ss_6935eecf47e2a64fb022464f2cee7e868e100266.1920x1080.jpg?t=1624533433,https://cdn.akamai.steamstatic.com/steam/apps/1330370/ss_320f2e36871a0d436701bacad6f479400f55c6e5.1920x1080.jpg?t=1624533433,https://cdn.akamai.steamstatic.com/steam/apps/1330370/ss_f99d62b5f080b764afd1b55c32cfb62ed7095036.1920x1080.jpg?t=1624533433,https://cdn.akamai.steamstatic.com/steam/apps/1330370/ss_a9d946892580244bdb5dae72cfa73a8f272b3b43.1920x1080.jpg?t=1624533433,https://cdn.akamai.steamstatic.com/steam/apps/1330370/ss_0549777cffedb8ab112a13ba6489275da5e09024.1920x1080.jpg?t=1624533433,https://cdn.akamai.steamstatic.com/steam/apps/1330370/ss_4a5290674682ba23277eee8d6ada2f96af199508.1920x1080.jpg?t=1624533433",
    "Slug": "one-shell-straight-to-hell",
    "Meta Title": "One Shell Straight to Hell: Feb 9, 2021, Shotgun with Gli...",
    "Meta Description": "Looking for information on One Shell Straight to Hell? Check out the release date (Feb 9, 2021), developer insights from Shotgun with Glitters, and a co...",
    "Alt Text Image": "Official header image for One Shell Straight to Hell game - Steam 1330370",
    "Canonical URL": "https://gusku.site/game/one-shell-straight-to-hell",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"One Shell Straight to Hell\", \"description\": \"Looking for information on One Shell Straight to Hell? Check out the release date (Feb 9, 2021), developer insights from Shotgun with Glitters, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shotgun with Glitters\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Feardemic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1330370/header.jpg?t=1624533433\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}