{
    "AppID": 1400150,
    "Name": "Pandemic Bunny",
    "Release date": "Sep 9, 2020",
    "About the game": "PANDEMIC BUNNY OVERVIEW: Pandemic Bunny is a cute, fun, and lighthearted FPS mini-game where you can fight the global pandemic both in the game as well as in the real world. Explore your way through the city as Nurse Bunny, fighting with your trusty hand-sanitizer gun, on your quest to find the vaccine. Use the vaccine to eliminate all the Queen Viruses to halt the creation of more viruses. Finally, save humanity by successfully sanitizing all remaining viruses throughout the city. Keep your health, armor, and ammo up by collecting toilet paper, face masks, and hand sanitizer scattered throughout the city. Remember that each purchase of Pandemic Bunny supports charities fighting to aid those negatively affected by the current global pandemic. Have fun and stay healthy! WHO PANDEMIC BUNNY WILL HELP: 10% of our total proceeds will be donated to charities that help provide PPE to hospitals around the country as well as charities that help distribute food to those in need. Only together can we overcome this pandemic. HOW AND WHY PANDEMIC BUNNY WAS CREATED: Pandemic Bunny was created as a result of the events of the current global pandemic. Like many people across the country, around mid-March I was affected by the “Shelter at Home” order placed on the citizens of California. Inspired by the famous YouTuber: Michael Reeves, and how he taught himself to code, I decided to teach myself how to code by buying and learning from a book about Python. After a month of studying, I felt that completing practice problems was not effective enough in applying what I’ve learned. At the same time Unity was offering a free month Unity Learn. Thus I decided to shift my learning from doing practice problems to working on my first project: a small FPS. Around this time, many organizations as well as people were doing their part to help combat the pandemic. Inspired by them, I decided that my first game will also aid in the fight. I did this by implementing health-conscious concepts into the game such as the need for collecting hand sanitizer (ammo for combating the virus) and face masks (armor against the virus). More importantly, I decided that a portion of every purchase of my first game will be donated to charities aiding those negatively affected by the current global pandemic. I hope you enjoy this cute, simple, and lighthearted FPS minigame. Fluffy Bunny Studios will strive to continue bringing you entertaining games that can hopefully bring positive change to the world. For more information please check out the Fluffy Bunny Studios website.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1400150/header.jpg?t=1599942682",
    "Price": 0.99,
    "Developers": "Fluffy Bunny Studios",
    "Publishers": "Fluffy Bunny Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1400150/ss_1ca5c36401704a16b1b2eb3286b0f3e0714ab3d2.1920x1080.jpg?t=1599942682,https://cdn.akamai.steamstatic.com/steam/apps/1400150/ss_136e736b66d4b7d93b4e448cc15939fbd49e9286.1920x1080.jpg?t=1599942682,https://cdn.akamai.steamstatic.com/steam/apps/1400150/ss_ff3a6fa0d8ecce1e774fd53e19d0a25a4a3ad96d.1920x1080.jpg?t=1599942682,https://cdn.akamai.steamstatic.com/steam/apps/1400150/ss_4db8d907d2c7d68d2ba2b7eeb6cae52dec007cd9.1920x1080.jpg?t=1599942682,https://cdn.akamai.steamstatic.com/steam/apps/1400150/ss_35cc3e77ee07597f8912e895a41319ea7a5215fc.1920x1080.jpg?t=1599942682",
    "Slug": "pandemic-bunny",
    "Meta Title": "Pandemic Bunny: Sep 9, 2020, Fluffy Bunny Studios and Ful...",
    "Meta Description": "Looking for information on Pandemic Bunny? Check out the release date (Sep 9, 2020), developer insights from Fluffy Bunny Studios, and a complete game s...",
    "Alt Text Image": "Official header image for Pandemic Bunny game - Steam 1400150",
    "Canonical URL": "https://gusku.site/game/pandemic-bunny",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pandemic Bunny\", \"description\": \"Looking for information on Pandemic Bunny? Check out the release date (Sep 9, 2020), developer insights from Fluffy Bunny Studios, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fluffy Bunny Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fluffy Bunny Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1400150/header.jpg?t=1599942682\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}