{
    "AppID": 1813270,
    "Name": "Poptropica",
    "Release date": "May 25, 2022",
    "About the game": "Welcome to Poptropica, a 2D open-world adventure game! Embark on unbelievable escapades, originally created by Jeff Kinney, bestselling author of the Diary of A Wimpy Kid series. No matter if you’re visiting the islands for the first time or reliving treasured childhood memories, Poptropica’s charming collection of stories delivers a variety of satisfying adventures that place you at the forefront of the action. Fully experience the one-of-a-kind narratives guiding each island, often rooted in factual history! Complete quests of Olympic proportions, retrieve ancient relics, and solve puzzles that put your problem-solving skills to the test! Across the map, islanders are unified by a shared desperation. The citizens need a hero that can topple villains and curb unknown dangers. Will you rise to the challenge? Become the hero of your own story! Prove your bold prowess by completing 17 full Flash islands that present players with magical expeditions – each more exciting than the last. Choose from a variety of game styles, ranging between casual, leisurely exploration, captivating adventures, and eerie mysteries that embrace the theatrics. Confront daunting challenges with brains and brawn. Encounter peculiar creatures native to fabled lands and uncover centuries old secrets. Piece together subtle hints and information while searching for clues to aid your expedition. Upon completing each island, your efforts are rewarded with a medallion certifying your achievements. Collect the entire set to become Poptropica’s top adventurer! What’s Included? Islands Mythology (classic) Shrink Ray Poptropolis Monster Carnival Time Tangled Mystery Of the Map Virus Hunter 24 Carrot Galactic Hot Dogs Mocktropica Escape From Pelican Rock Reality Tv: Wild Safari Timmy Failure Full Episodic islands Survival Poptropicon Arabian Nights Mission Atlantis Realms: A journey of infinite discovery awaits you in Poptropica Realms! Allow your imagination to run wild in the sandbox platform, as you create brand-new worlds and explore randomly generated terrain. Encounter and tame strange creatures. Mine essential resources. Most importantly, wield ancient magic to build never-before seen environments. In Realms, you are the mastermind behind every detail! Features Costumes: Tailor your Popsona to fit your style! Mix and match costume pieces to create personalized outfits that can be changed at any time. Clubhouse: Customize your personal cottage with decor and furniture. Pets: Adopt loyal pet followers to accompany you on your travels! Store: Visit Mainstreet’s shop to buy costumes, special power items, decorations, followers, and more! Common rooms: Visit an island’s common room to find exclusive island-specific gear. The common rooms double as player hubs, where you can interact and challenge other players to 1-on-1 minigames in real time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1813270/header.jpg?t=1653543231",
    "Price": 19.99,
    "Developers": "Poptropica",
    "Publishers": "Poptropica",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1813270/ss_66cbe3b3796e30820f8df8141c805cfee67b9ca0.1920x1080.jpg?t=1653543231,https://cdn.akamai.steamstatic.com/steam/apps/1813270/ss_3e3b75e5effc48410bbf8df35591eca233400e0b.1920x1080.jpg?t=1653543231,https://cdn.akamai.steamstatic.com/steam/apps/1813270/ss_99499b39d2a78e7415cff31034bcb3c16cbde418.1920x1080.jpg?t=1653543231,https://cdn.akamai.steamstatic.com/steam/apps/1813270/ss_c0c74df8dc2facb43b9a460df10688857a540696.1920x1080.jpg?t=1653543231,https://cdn.akamai.steamstatic.com/steam/apps/1813270/ss_416b30ad7f444ec89a807aa303e1e4e6507b987c.1920x1080.jpg?t=1653543231",
    "Slug": "poptropica",
    "Meta Title": "Poptropica: May 25, 2022, Poptropica and Full Overview",
    "Meta Description": "Looking for information on Poptropica? Check out the release date (May 25, 2022), developer insights from Poptropica, and a complete game summary.",
    "Alt Text Image": "Official header image for Poptropica game - Steam 1813270",
    "Canonical URL": "https://gusku.site/game/poptropica",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Poptropica\", \"description\": \"Looking for information on Poptropica? Check out the release date (May 25, 2022), developer insights from Poptropica, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Poptropica\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Poptropica\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1813270/header.jpg?t=1653543231\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}