{
    "AppID": 1089820,
    "Name": "Reanimation Inc.",
    "Release date": "Nov 1, 2019",
    "About the game": "Interested in medicine? Then this game is for you! Faster - provide venous access, charge the defibrillator and chase! Reanimation inc is a completely realistic simulation - real urgent conditions and diseases, real protocols of care used in an ambulance, realistic simulation of the body! Do you like realistic games about medicine and simulators, games you need to think about? You 'll be happy! The game features a real ECG monitor that shows ECG, HCC, pressure, Pleth, blood saturation with oxygen (oxygenation) SpO2 How can I help a patient without real knowledge? In this medical simulator I carefully worked out the system of theory - it is submitted simplified, but explains almost all manipulations carried out by paramedics and ambulance doctors. What 's interesting about this medical resuscitation and ambulance simulator? 'An idea. I decided to create the most realistic ambulance simulator that can be available to explain to the player the body 's device, first aid algorithms and medical care. I know everything in the world can be explained! Who knows - perhaps thanks to Reanimation inc one of the players recognizes a stroke and will call an ambulance, saved life. Defibrillation. Yes! You learn how a defibrillator actually works and use it a lot of times! Learn what is meant by 'cardiac arrest,' learn to fibrillate ventricular, atrial, asystolia, heart attack on ECG. - Resuscitation. You will have to carry out CPR (indirect heart massage, make IVL artificial lung ventilation, administer drugs, defibrillate), urgently take the patient by ambulance to the hospital. - Realism. I was advised by doctors, paramedics, ambulance workers. Medical students took part in the testing. 22 diseases, 17 drugs, 8 actions, studies. Real medical care algorithms, real resuscitation. - Huge number of medical improvements! Improvements to ambulances Defibrillator Enhancements Opening of new medical courses Lung ventilation improvements Improving endurance with indirect heart massage Bleeding stop improvements Purchase of medicines Drip Improvements - States What medical simulator can do without real diseases? There are 22 of them in the game! By the way, it 's not that easy to diagnose them. Myocardial infarction (you will have to determine it by ECG and distinguish it from angina) Cardiac arrest THELA, pulmonary swelling Bleeding, including internal Anaphylactic shock Stroke And many, many others! - Medicines Do you know why adrenaline is used? And what to use in case of stroke or exacerbation of COPD? In the game a huge number of drugs for all cases of life! You 'll have to learn a lot of the knowledge of an ambulance doctor to save a patient. - Gameplay What can Reanimation inc - a biomedical simulation strategy - offer? How can I help a patient without real knowledge? In this medical simulator I carefully worked out the system of theory - it is submitted simplified, but explains almost all manipulations carried out by paramedics and ambulance doctors. What 's interesting about this medical resuscitation and ambulance simulator? 'An idea. I decided to create the most realistic ambulance simulator that can be available to explain to the player the body 's device, first aid algorithms and medical care. I know everything in the world can be explained! Who knows - perhaps thanks to Reanimation inc one of the players recognizes a stroke and will call an ambulance, saved life. Defibrillation. Yes! You learn how a defibrillator actually works and use it a lot of times! Learn what is meant by 'cardiac arrest,' learn to fibrillate ventricular, atrial, asystolia, heart attack on ECG. - Resuscitation. You will have to carry out CPR (indirect heart massage, make IVL artificial lung ventilation, administer drugs, defibrillate), urgently take the patient by ambulance to the hospital. - Realism. I was advised by doctors, paramedics, ambulance workers. Medical students took part in the testing. 22 diseases, 17 drugs, 8 actions, studies. Real medical care algorithms, real resuscitation. - Huge number of medical improvements! Improvements to ambulances Defibrillator Enhancements Opening of new medical courses Lung ventilation improvements Improving endurance with indirect heart massage Bleeding stop improvements Purchase of medicines Drip Improvements - States What medical simulator can do without real diseases? There are 22 of them in the game! By the way, it 's not that easy to diagnose them. Myocardial infarction (you will have to determine it by ECG and distinguish it from angina) Cardiac arrest THELA, pulmonary swelling Bleeding, including internal Anaphylactic shock Stroke And many, many others! - Medicines Do you know why adrenaline is used? And what to use in case of stroke or exacerbation of COPD? In the game a huge number of drugs for all cases of life! You 'll have to learn a lot of the knowledge of an ambulance doctor to save a patient. - Gameplay What can Reanimation inc - a biomedical simulation strategy - offer? You have to become an ambulance doctor - go on calls, diagnose the disease, urgently provide assistance! Sometimes, the patient 's condition is so severe that it 's no longer possible to help him - the deadly disease won 't wait. Every patient is unique. Every disease is generated accidentally. So your passing of Reanimation inc will be unique! Features: Reanimation inc is a relistic bio medical strategy simulator. Great graphics! Reanimation inc is a realistic anatomy and device of the body. 3D models of ambulances! Reanimation inc are real Ambulance algorithms! The medical theory in Reanimation inc is broken down into courses and given to the player gradually. To you precisely there will be interesting Reanimation if you the physician: the doctor, the student, the paramedic or just you are interested in medicine or you love simulators. Reanimation inc contains a large amount of drugs! Number of diseases in Reanimation inc - 22! Reanimation inc has real defibrillation, IVL and SLR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1089820/header.jpg?t=1573200194",
    "Price": 9.99,
    "Developers": "Dmitrii Lomakin",
    "Publishers": "Dmitrii Lomakin",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1089820/ss_36a42093954481dc4aac1a5c3d0a027190911f79.1920x1080.jpg?t=1573200194,https://cdn.akamai.steamstatic.com/steam/apps/1089820/ss_1f2e677d9c7b35a971558c16fe781117e9623bd5.1920x1080.jpg?t=1573200194,https://cdn.akamai.steamstatic.com/steam/apps/1089820/ss_c749d1b9c507c6e33c3c1e64c694072b66a26d83.1920x1080.jpg?t=1573200194,https://cdn.akamai.steamstatic.com/steam/apps/1089820/ss_59d041e72806c4ce093af6996365daa962492ff2.1920x1080.jpg?t=1573200194,https://cdn.akamai.steamstatic.com/steam/apps/1089820/ss_5d6c30b780d4dc467d879b3a34287ad40e5fbb25.1920x1080.jpg?t=1573200194,https://cdn.akamai.steamstatic.com/steam/apps/1089820/ss_d221fbf828172317c9768951f62773c913f33a46.1920x1080.jpg?t=1573200194",
    "Slug": "reanimation-inc",
    "Meta Title": "Reanimation Inc.: Nov 1, 2019, Dmitrii Lomakin and Full O...",
    "Meta Description": "Looking for information on Reanimation Inc.? Check out the release date (Nov 1, 2019), developer insights from Dmitrii Lomakin, and a complete game summ...",
    "Alt Text Image": "Official header image for Reanimation Inc. game - Steam 1089820",
    "Canonical URL": "https://gusku.site/game/reanimation-inc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Reanimation Inc.\", \"description\": \"Looking for information on Reanimation Inc.? Check out the release date (Nov 1, 2019), developer insights from Dmitrii Lomakin, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dmitrii Lomakin\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dmitrii Lomakin\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1089820/header.jpg?t=1573200194\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}