{
    "AppID": 891430,
    "Name": "Rogue Heist",
    "Release date": "Aug 21, 2019",
    "About the game": "Heist has always been a one sided game and you have always played it from either side, attempting to heist or fending off the bad guys. But what if both the sides were there to heist? Presenting ROGUE HEIST, there are no good or bad sides here; just two teams pitted against each other. ROGUE HEIST puts you straight in action, against an equal opponent who wants what you want. This simple sounding plan could become complex in seconds considering there’s much strategy each team has to put in place, with weapons to choose, roles to play and fierce competition; the matches get really intense. Intense Competition Decoding a win in Rogue Heist isn’t easy. The trick lies in the playing it right rather than planning it right. With so many roles to pick from and so many tasks to complete; every match requires the player’s attention right from the start till the end. The dynamics change every second and that happens when all 12 players are neck deep in competition. Sniper Ground Crew Co-Op Action Get down to heist with a sniper looking out for you. With 3 playable roles to choose from as ground crew, equipped with a different weapons and a well-coordinated sniper in action; each game is quite intense. Experience a real heist where you face an equal opponent vying for the same goal. A pure PvP setup with two teams of 6 pitted against each other, the Heist Mode is created to thrill you. A High-tech Heist Welcome to the modern day heist where it’s no longer just about looting cash. With a race for the same goal, an opponent lurking around and so many tasks to do; you better be good at stealing and killing both. Hacking into an encrypted safe, stealing, transporting a highly unstable yet rare package and securing it safely are the just some of the crucial things you do in a match. Strategic Teamplay Winning isn’t a child’s play, it requires teamwork. Rogue heist is all about putting the perfect team together. With 4 roles to choose from; sniper, hacker, support and assault, whatever combination you pick can affect your game and outcome both. Players have to work in sync to perform tasks or die at the ends of the opponent vying for the same goal. The hustle is to heist is real. Features of the game: Multiplayer: Play as a team of 6 vs 6 in an online co-op action setting. Choose your Crew: Once you enter the game, there are various crews to choose from and become a part of. Every crew has a distinct style and a specific weapon, you can choose your crew depending on your own style. Choose your Role: You can pick any one of the roles from, Sniper, Assault, Hacker &amp; Support. As a Sniper/Spotter, you give support to your ground crew while they ambush and steal high value packages. You also double up a spotter to tag opponent sniper or opponent crew. As an assault, you are placed right in the middle of action on ground to ambush, attack and eliminate. If you choose to become Hacker, your only job is to hack, steal and secure While should you choose to be Support, your role is to support the Hacker no matter what. Extracting: For extracting the high value packages, you need to hack into the safe of the convoy, this needs to be strategically done or you would become vulnerable to opponent’s attack. Securing the package: Once extracted, you also have to secure your package to make sure your team is the first one to secure 3 packages to win each match.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/891430/header.jpg?t=1603497127",
    "Price": 0.0,
    "Developers": "Lifelike Studios",
    "Publishers": "Time2Play Gaming Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/891430/ss_8f98b0b558087cbf1db66c53649e69c9c4a07a7b.1920x1080.jpg?t=1603497127,https://cdn.akamai.steamstatic.com/steam/apps/891430/ss_9c56c104554cf903587c3d364e861af6f1d07a7a.1920x1080.jpg?t=1603497127,https://cdn.akamai.steamstatic.com/steam/apps/891430/ss_1055a9986e17553be80d9b99e5b49601144432fb.1920x1080.jpg?t=1603497127,https://cdn.akamai.steamstatic.com/steam/apps/891430/ss_b61f919d9a24dba4e3ca0aaf16c9aae78f972f84.1920x1080.jpg?t=1603497127,https://cdn.akamai.steamstatic.com/steam/apps/891430/ss_43b4b0a33671c7f2d55ebebf78e4b5160d167cf2.1920x1080.jpg?t=1603497127,https://cdn.akamai.steamstatic.com/steam/apps/891430/ss_644f1c4aea12046a3517e6977f07252a631e29cc.1920x1080.jpg?t=1603497127",
    "Slug": "rogue-heist",
    "Meta Title": "Rogue Heist: Aug 21, 2019, Lifelike Studios and Full Over...",
    "Meta Description": "Looking for information on Rogue Heist? Check out the release date (Aug 21, 2019), developer insights from Lifelike Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Rogue Heist game - Steam 891430",
    "Canonical URL": "https://gusku.site/game/rogue-heist",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Heist\", \"description\": \"Looking for information on Rogue Heist? Check out the release date (Aug 21, 2019), developer insights from Lifelike Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lifelike Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Time2Play Gaming Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/891430/header.jpg?t=1603497127\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}