{
    "AppID": 1064130,
    "Name": "Sakura MMO 3",
    "Release date": "Jun 7, 2019",
    "About the game": "Sakura MMO #3 is the final part of the Sakura MMO series, which concludes Viola’s adventure. Only a few months ago, Viola was an average woman bored with her life in Japan. Her only method of escape was via the vibrant and colorful MMORPG, Asaph Online. Though Viola poured thousands of hours into Asaph Online, she knew it was little more than a game, and it could never be a suitable substitute for reality. That is, until she found herself transported into the real Asaph! In Asaph, Viola recruits a party of cute girls and decides to fulfil her biggest dream: having a harem! Light-hearted hijinks ensue… but trouble is brewing on the horizon that could spell the end of these peaceful days. The fallen goddess, Iona, has been plotting to bring about an end to Asaph for good – and now Viola must go on a journey across the ocean, alongside her crew, to defeat her. Will Viola emerge triumphant from the skirmish, or will Iona best her? Find out in Sakura MMO #3, the longest instalment of the series. Your choices can save Asaph, or doom it to destruction. Will Viola survive her greatest challenge yet – and which girl will she end up with? It’s all up to you! Viola is the heroine of the story. In Japan, she was an ordinary woman called Kotone. In Asaph Online, however, she’s a powerful dark witch with access to some of the most formidable spells imaginable. She has a bit of a sadistic side, and she loves toying with cute girls… but she’s brave and loyal, and would rather die than see her allies get injured. Neve’s is Viola’s loyal, devoted maid, and a member of the maligned darkling race. Neve cares for Viola so deeply she often disregards her own health, and it seems very likely she may one day work herself to death. Though Neve is a polite, softly-spoken young woman, she has a short temper, and won’t hesitate to attack anybody who speaks ill of her mistress. Somewhat neurotic and not entirely stable, Neve has one or two dark secrets that the evil goddess would love to exploit. Fion is an opportunistic thief girl with a penchant for shiny things. Fion joined Viola’s team after an attempted robbery went awry. Viola caught Fion and punished her accordingly – much to Fion’s chagrin. Though their relationship got off to a rocky start, Fion has grown rather fond of Viola. A cheerful and good-natured young woman, despite her years spent living on the streets, Fion is deft and wily, and a useful ally in any fight. Eleri is a cool-tempered, serious knight with a firm sense of duty. Though Eleri acts as the voice of reason in the party, she isn’t infallible. Eleri gets flustered easily, which makes her a prime target for teasing. Like Viola, Eleri is not a native resident of Asaph. Eleri’s real name is Aina, and she used to live in Japan. She met up with Viola quite by chance, and now the two travel together. Though Eleri has grown accustomed to life in Asaph, she’s determined to find her way back home. The mysterious goddess who resides in the underworld. Iona is one of the oldest goddesses in Asaph. According to Asaphian myth, it was Iona – alongside her husband, Aeron – who created life as we know it. Aeron crafted mankind in his image, while Iona was responsible for creating the darkling race. After their relationship splintered, Iona turned on her husband and tried to kill him. She was soon punished for her folly, however, and she was condemned to the darkest realm of the underworld. Iona has waited for hundreds of years, honing her magical powers in secret, so that she can one day escape from the underworld and destroy Asaph for good. - finish Viola's adventure in Asaph Online - meet a new companion - available in Chinese",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1064130/header.jpg?t=1587984545",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_1c44760e328e156d4bda20456066906136e8bab9.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_163c2415fb0f368e7bfac29e6e570dc3575a2b08.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_49d9059484b434313a8837a85272462e2164bbc2.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_a5fab57e8f9b427f4fb958abe28b249483dedec9.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_25c987058ef73ad34eeb77974568d5e4fe11a8a8.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_712ab12afcfb1475180a5891db4df202874d603a.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_e991c654a759f8277e783d6e591daa806752b925.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_38378e0592fa62eaffe9121d2afcdc392ba5f98b.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_c90d6b2695929020cb52118d468bcfa5fdad5279.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_fb41bc4fb7e287c33525f6d61e8dfd45e439cfa4.1920x1080.jpg?t=1587984545,https://cdn.akamai.steamstatic.com/steam/apps/1064130/ss_70c38198a8debba1d298f1d002c810f8f6b46afa.1920x1080.jpg?t=1587984545",
    "Slug": "sakura-mmo-3",
    "Meta Title": "Sakura MMO 3: Jun 7, 2019, Winged Cloud and Full Overview",
    "Meta Description": "Looking for information on Sakura MMO 3? Check out the release date (Jun 7, 2019), developer insights from Winged Cloud, and a complete game summary.",
    "Alt Text Image": "Official header image for Sakura MMO 3 game - Steam 1064130",
    "Canonical URL": "https://gusku.site/game/sakura-mmo-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura MMO 3\", \"description\": \"Looking for information on Sakura MMO 3? Check out the release date (Jun 7, 2019), developer insights from Winged Cloud, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1064130/header.jpg?t=1587984545\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}