{
    "AppID": 951260,
    "Name": "Shieldwall Chronicles: Swords of the North",
    "Release date": "Dec 16, 2018",
    "About the game": "In Shieldwall Chronicles: Swords of the North, you lead a mercenary band into the perilous and cold northlands of Tarren. Your search for fortune will see you pitch blade and spell book against a host of enemies including the undead, demons, and lizardmen and many other creatures. In a battle that is part game-book and part tactical RPG, you will build a powerful band of warriors and wizards and tilt the balance of power in the northern kingdoms. Key Features Take part in deep, turn-based combat. Combat is realistic and incorporates details such as weapon range, damage effects, and counter attacks without slowing down gameplay. Players will also have to use cover and line of sight effectively to be successful. Build a party from among 15 different classes. Choose a party of six heroes that range from scholarly wizards to hardened warriors. Using each character type to their fullest is vital to securing victory as most excel in only certain tasks. Wizards have massively destructive magic but will fall quickly to a simple spear thrust while great warriors can hold off a horde if properly supported. A unique morale system adds an entirely new tactical layer to the combat. Warriors will fight far better if they believe the tide of battle is on their side and will begin to panic if they believe otherwise. Watching a friend fall or an enemy leader slain drastically affects morale. Arrows and spells, even when they miss, will affect the courage of both friends and foes in their area of effect. Finally, the bloodlust mechanic means certain warriors will find new sources of energy for each foe they slay. Collect hundreds of powerful magic items to equip your party. Each character can equip up to nine items from swords, shields, cloaks, rings to helmets. Each item can range from a common item that grants only a small benefit to legendary items that can both boost stats and grant entirely new powers to its bearer. Fighters can equip magical rings that can allow them to conjure fireballs or summon undead guardians, for example. The magic item system allows you to customize your party even further and develop entirely new tactics and battle plans. Enjoy over 50 hours of gameplay in the campaign. Your journey will see you lead your party across snow-covered wilderness, through dark caverns, ancient ruins and the bloody streets of great cities. Battles can be replayed at various difficulties and no level cap provides no end of enjoyment for the die-hard player. Delve into a gritty, realistic world that blends dark age history and culture with fantasy races and monsters. The northern kingdoms of Tarren are places where men fight in shield walls with spear, axe and sword against elves, dwarfs, goblins and even dragons. Wizards and monsters are powerful but can still be defeated with sound tactics, armour and courage.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/951260/header.jpg?t=1593289233",
    "Price": 14.99,
    "Developers": "Wave Light Games Inc.",
    "Publishers": "Wave Light Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_d9e73c47f8e8d4a131b7d6ebe4d234316dcabf3a.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_e821dd74e9f505a6895b0cc7f36398cbef22c941.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_e32a246a5035a9b257800afa5443a96b74afb7bc.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_1160aedd0664d5a7f075ee9ef1a4e36aa57934e7.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_54c2a6e2bbfcd6d8d70bf1992d785161fe6e550f.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_5a571d4c3b6c0ba23ad6169ae685fc301511918d.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_908093c2bcae1f7b196f2b26fb622fa5d21734e4.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_dc9c57fdd85fcd6399a097265d63f503382cd289.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_04efd6001bf51e40bd3df59d7a33861a30c1449f.1920x1080.jpg?t=1593289233,https://cdn.akamai.steamstatic.com/steam/apps/951260/ss_95ebacf596ead9b0131b4937682fb6c8df4ab785.1920x1080.jpg?t=1593289233",
    "Slug": "shieldwall-chronicles-swords-of-the-north",
    "Meta Title": "Shieldwall Chronicles: Swords of the North: Dec 16, 2018,...",
    "Meta Description": "Looking for information on Shieldwall Chronicles: Swords of the North? Check out the release date (Dec 16, 2018), developer insights from Wave Light Gam...",
    "Alt Text Image": "Official header image for Shieldwall Chronicles: Swords of the North game - Steam 951260",
    "Canonical URL": "https://gusku.site/game/shieldwall-chronicles-swords-of-the-north",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shieldwall Chronicles: Swords of the North\", \"description\": \"Looking for information on Shieldwall Chronicles: Swords of the North? Check out the release date (Dec 16, 2018), developer insights from Wave Light Gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wave Light Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wave Light Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/951260/header.jpg?t=1593289233\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}