{
    "AppID": 454580,
    "Name": "Spider Wars",
    "Release date": "Nov 18, 2016",
    "About the game": "Spider Wars is a fast-paced shooter in which you can either work with your fellow spiderkin, or blow them up for glory. Or sport. Our spiders can traverse any solid surface at any angle. Want to get an edge by walking on the ceiling, raining death from above? Or how about reenacting nursery rhymes with the closest spout? No problem! Just run up to objects and the spiders will attach themselves, allowing you complete freedom in your ascent. What game about spiders would be complete without the ability to build webs? We don't know. What we do know however, is that you can build them in this game. String webs strand by strand to construct whatever your heart desires. Your ideal spider fortress is now within reach. Perhaps you are not much of a builder; fret not! Use your web to swing around like a certain costumed human who has been stealing all the glory that rightfully belongs to spiderkind. No radiation involved. Teamwork and our spiders' complimentary abilities plays a large role in our team-based game modes. * Those same abilities can be used to great effect in our solo modes as well. To play host to these epic battles, our spider scientists have selected a variety of interesting locales. I wouldn't expect any sanity in the choices however; our scientists are all out of their minds. I hear the majority of them suffer from arachnophobia. We have noticed an alarming amount of traps and hazards in some of these locations... Multiple game modes: Deathmatch is currently available, with more coming soon. Variable camera modes: You can choose to play in either first- or third person. Spider types: Choose from a selection of unique classes for your spider. Each class not only looks distinct, but plays different as well with class specific loadouts and abilities. Webs: All spiders can construct webs on any solid surface. The webs can be used for traversal or defense. You could even construct an artistic web to prove you are a capable home-builder to that spider-crush of yours. Webs do not have to be static however; you can use them to swing around objects - getting the drop on your foes! Oh, did I mention this game has spiders? * Our human-spider relations officer tried their best to not use buzzwords after their predecessor was ejected into space for doing so.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/454580/header.jpg?t=1572864524",
    "Price": 9.99,
    "Developers": "CarVin Interactive",
    "Publishers": "CarVin Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/454580/ss_0dfc60df45406d6e3a0e935c3fd7033445c14a66.1920x1080.jpg?t=1572864524,https://cdn.akamai.steamstatic.com/steam/apps/454580/ss_47ee4e02dba10861eb15b8ac41316181e3b7f4a7.1920x1080.jpg?t=1572864524,https://cdn.akamai.steamstatic.com/steam/apps/454580/ss_a51d54ddd045d4a0ef2788da269e2c74575935f4.1920x1080.jpg?t=1572864524,https://cdn.akamai.steamstatic.com/steam/apps/454580/ss_30a9fe6020a0dacb52c0fe83c8dd6c5a76730827.1920x1080.jpg?t=1572864524,https://cdn.akamai.steamstatic.com/steam/apps/454580/ss_f9749463d1ede55df6b81673dd8b618d8984981f.1920x1080.jpg?t=1572864524,https://cdn.akamai.steamstatic.com/steam/apps/454580/ss_b04155db28f4cb79a4dfb7c16508e171432eb504.1920x1080.jpg?t=1572864524",
    "Slug": "spider-wars",
    "Meta Title": "Spider Wars: Nov 18, 2016, CarVin Interactive and Full Ov...",
    "Meta Description": "Looking for information on Spider Wars? Check out the release date (Nov 18, 2016), developer insights from CarVin Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for Spider Wars game - Steam 454580",
    "Canonical URL": "https://gusku.site/game/spider-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spider Wars\", \"description\": \"Looking for information on Spider Wars? Check out the release date (Nov 18, 2016), developer insights from CarVin Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"CarVin Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CarVin Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/454580/header.jpg?t=1572864524\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}