{
    "AppID": 618270,
    "Name": "Spiritlands",
    "Release date": "Mar 29, 2018",
    "About the game": "Spiritlands is a 4X resource and people management game, where you can create or generate lands and build a populous from campfire to teeming city, from collecting resources, to building and assigning endless workers to a variety of roles including farmers, explorers, and soldiers! The game pits you against a changing and challenging world of countless possibilities, with bountiful forests, deserts and wastelands; each world is creatable by you in the map editor and changes the challenge ahead. Explore worlds laid with ruins and enemy camps; as you discover, research, and fight to improve and protect your people as you grow. Spiritlands is a game about progression, automation and survival. The goal is to take over the map, founding new settlements, destroying barbarian camps, exploring every ruin and befriending or fighting against the local colonies. Every settlement is designed to be as unique as you want it to be. You can have settlements dedicated to gathering faith points, or settlements geared around collecting a specific resource and distributing to your other towns and cities. You can found multiple cities, or layer your world with villages. Your lands are yours to build up as you please. Your people need 5 things: - Water - Power - Happiness - Food - Shelter Your people are your explorers, workers and soldiers- they fuel your growth and are specific to the settlement they are in. You can build them schools, taverns, create more nature or lay more flooring. Your people love to live in pleasant looking areas to call home! All power and water is natural too- with wind-farms and water-towers. Building is also super quick with the easy to use on-tile system. The people are also vulnerable to fires and infections which require emergency services and health centres to be created to combat them. Resources are the cornerstone for each settlement that you control. They fuel buildings and your people, from feeding them to training them to keeping the machines running. You can utilise your idle workers as resource collectors in the wilds. Soon after your resource collection becomes automated as you create farms, lumberyards, quarries, mines, and fishing areas and assign your people to work them. There are four main resources: - Food - Wood - Stone - Coal There are also special items such as diamonds, silver, and even flower to collect! They are used to trade, build, or buy off barbarians. Spiritlands definitely isn't a game about staying in one area with one settlement. You're encouraged to explore; placing campfires to break through the fog, uncovering old ruins that to explore for loot chests (not loot boxes). You can also uncover colonies that you can trade or fight with. There are also enemy encampments of different sizes, who will attack your settlements. You can also attack them and try and destroy them first, or give them some special items to keep them happy. There are 4 colonies across each land: - The Port Keepers - The Woodlanders - The Stonecutters - The Miners. Each colony can be traded with at your markets. Once discovered you can befriend them by trading with them the resources that they need, so that they can build and eventually provide you with freebies! Or anger them through attacks and they will raid you for food. Whether you are fighting encampments or waging wars on colonies- combat is a likely part of expanding. By building attack barracks, you can create an army. Whenever barbarians are nearby you will frequently come under attack, so you need to fortify settlements with defence barracks, water towers and walls. Even nature such as mountains make for great defences. There are 30 upgrades that fall into 5 routes: Discoverer, Scientist, Evolutionist, Dictator, and Conqueror. Upgrades range from unlocking buildings to altering resource costs. Everything can be unlocked. The Map Editor is the first thing you see after entering your name and the name of your civilisation. On the screen are 3 different sized paintbrushes, as well as a tile selection panel so you can paint tiles. You can also adjust sliders to adjust the resource amounts in your land- as well as paste in seeds you might get from the forum for example. The Editor is really easy to use, allowing you to create beautiful hand-made landscapes. The default areas are perfectly usable and randomly generated for a little variance. You can also quickly select presets on the side such as Wasteland and Desert which change the difficulty as resources become harder to find. Check out the second video at the top to see!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/618270/header.jpg?t=1549439749",
    "Price": 6.99,
    "Developers": "Prey Interactive",
    "Publishers": "Prey Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_4a8920cc0d23a0dd595f1bceb92c4416e694ddbf.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_2d9e16baf8d30cd20da4a2fe7dca682291bab422.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_782b6bd04302ab3f671ddd82ea5dad4663757a15.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_cac85aa3845f4470ea9ab16446bd6655e0f3182c.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_5fdfa6f3f790cef1eaafe77263284294326e53f0.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_adaea27ccc0881b0ddd7ef0fbe03ab108a495832.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_0d2b4b61f30470e5c501b98d426328d8e491b125.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_d25ddc348cf7844516d4e6e0718e4c14bb786b38.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_38b87ba2b7fe6f46e8808823ab3afa4abfa18b24.1920x1080.jpg?t=1549439749,https://cdn.akamai.steamstatic.com/steam/apps/618270/ss_e593d55f6b680b4302f8cffbd97c8d4402caf665.1920x1080.jpg?t=1549439749",
    "Slug": "spiritlands",
    "Meta Title": "Spiritlands: Mar 29, 2018, Prey Interactive and Full Over...",
    "Meta Description": "Looking for information on Spiritlands? Check out the release date (Mar 29, 2018), developer insights from Prey Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for Spiritlands game - Steam 618270",
    "Canonical URL": "https://gusku.site/game/spiritlands",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spiritlands\", \"description\": \"Looking for information on Spiritlands? Check out the release date (Mar 29, 2018), developer insights from Prey Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 29, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Prey Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Prey Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/618270/header.jpg?t=1549439749\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}