{
    "AppID": 415270,
    "Name": "Star Crusade CCG",
    "Release date": "Sep 7, 2016",
    "About the game": "War is coming. Dive into fast-paced, strategic battles with countless unique card and deck combinations. Build your deck, forge your destiny and shape the fate of the Galaxy! As the galaxy crumbles, whose side will you take? Choose your allegiance from six unique factions: * The Shan'Ti, who shape genetics into living weapons * The cybernetically augmented Hierarchy and their rigid, cold order * The psychically gifted Annunaki, who are worshipped as gods by their zealous followers * The insidious Consortium, who focus on intrigue and vicious mercenary armies * The brutal, adaptive Hajir-Gog, whose endless tide represents a scourge to galactic civilization * The fearless, battle-hardened Terrans, with their massive weapons of war Star Crusade™ CCG Features: UNLIMITED STRATEGY: - Customize the size of your deck for the best odds - Personalize your starting strength - Choose a commander and unleash powerful, unique abilities - Craft a killer deck from 400+ available cards EASY TO PLAY, HARD TO MASTER: - Play immediately and practice your strategies in Casual mode - Conquer the Galaxy in Raid mode - Hone your skills in the competitive multiplayer Ranked mode VARIED AND CHALLENGING MISSIONS: - Embark on intense tactical missions across the sector - Take on new events that bring life to the game world and flesh out your experience - Earn rewards for your victories PLAY ANYWHERE: - Fully cross-platform, real-time gameplay - Bring your card collection with you from iOS to PC and vice versa RICH SCI-FI UNIVERSE: - Take command of one of the six factions vying for supremacy in an unclaimed exotic sector of space - Discover the history of Star Crusade through beautiful, hand-drawn illustrations - Learn more about the deep and complex universe through lore and events hidden throughout the game COMMUNITY POWERED: - Experience thoughtful gameplay from a passionate team of CCG players - Join a community-centered, ever-evolving game world centered on interesting player choices - Submit your ideas, feedback or suggestions – we’re always glad to hear from you! Experience the ultimate tactical CCG, with millions of possible card combinations and a rich universe of lore to uncover. Download now and join the Star Crusade! This game requires an Internet connection and 1.6 GB of space on your device to play.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/415270/header.jpg?t=1503495246",
    "Price": 0.0,
    "Developers": "ZiMAD, Inc.",
    "Publishers": "ZiMAD, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/415270/ss_649a26de46ed4b0633be6dca537fea3cdb574da5.1920x1080.jpg?t=1503495246,https://cdn.akamai.steamstatic.com/steam/apps/415270/ss_ce11e4a06dce6b2824ede5eacdae8441a2599f4f.1920x1080.jpg?t=1503495246,https://cdn.akamai.steamstatic.com/steam/apps/415270/ss_df70110729d0a54a23be9346a6c042a4226b67d3.1920x1080.jpg?t=1503495246,https://cdn.akamai.steamstatic.com/steam/apps/415270/ss_0816743290623e18df3d6c15e935bd51ff8de554.1920x1080.jpg?t=1503495246,https://cdn.akamai.steamstatic.com/steam/apps/415270/ss_d93d8916a4953f899683a964a2ab2027e4359b93.1920x1080.jpg?t=1503495246",
    "Slug": "star-crusade-ccg",
    "Meta Title": "Star Crusade CCG: Sep 7, 2016, ZiMAD, Inc. and Full Overview",
    "Meta Description": "Looking for information on Star Crusade CCG? Check out the release date (Sep 7, 2016), developer insights from ZiMAD, Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Star Crusade CCG game - Steam 415270",
    "Canonical URL": "https://gusku.site/game/star-crusade-ccg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Star Crusade CCG\", \"description\": \"Looking for information on Star Crusade CCG? Check out the release date (Sep 7, 2016), developer insights from ZiMAD, Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"ZiMAD, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ZiMAD, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/415270/header.jpg?t=1503495246\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}