{
    "AppID": 530110,
    "Name": "Tales of a Spymaster",
    "Release date": "May 17, 2019",
    "About the game": "Advise the Monarch to attack, defend, improve relations, and invest. Over 200+ conquerable locations. Compete with the royal court for the trust of your Monarch. Use agents to perform blackmail, sabotage, assassination, theft. Unleash poisons and plagues upon your enemies. Build taverns, inns, brothels and more to help fuel your ventures. Investigate kingdom histories and try to uncover the secrets of the past. Combat the elements with seasons and random events like storms and volcanic eruptions. All players &amp; AI take their turn at the same time in secret. No traditional Round Robin system here. Tales of a Spymaster is a turn-based strategy game taking place within the fictional land of Elas, where 8 kingdoms vie for control, and the time has come for you to play the part of the trusted right-hand as you take on the mantle of Spymaster. As the Spymaster, you must maintain the trust and good favour of your monarch, allowing you to influence their choices and guide them to victory. It is up to you to make the correct choices, when to be bold by raiding and attacking your enemies, and when to exercise caution, by bolstering defences or favouring diplomatic relations. But be wary, for poor advice leads to mistrust meaning future advice could go unheeded at a time where it is imperative. Your monarch will turn to the other members of the court if they have to, who could even be under the influence of a rival Spymaster. If information is power, then money is the key to unlocking it, so you can construct Brothels, Inns, Taverns and more in order to grease the wheels of espionage and fund your enterprises, but still, that will not be enough to ensure victory. The very best Spymasters know how to effectively use all of the assets at their disposal, so assassins, mercenaries, saboteurs, spies, and the subtle dispatch of misinformation all have parts to play in your counter-espionage efforts. Use them wisely. Using population growth algorithms which take into account factors like age, gender, seasonal sickness, accidents, conscription and others, Tales of a Spymaster brings layers of complexity to a game world and how it affects your endeavours. For example, a heavy loss in a poorly chosen battle could be far more costly in the long run as it will mean population growth will shrink due to a new absence of appropriately aged men. A wise Spymaster knows that advising your Monarch to go to war should always be a last resort. Remember, trust is of utmost importance, for all among the Royal court have their price. Whether clergy, nobility, military, many can be bought and bring downfall from within if given the chance. Root out these weeds before they can eat away at the foundation of your royal house and deal with them. Show them the price of betrayal, or blackmail them and use them against those that turned them. If all else fails, you can even dabble in darker things like experimental poisons and virulent plagues, but take great care in dealing with such maleficence and always remember that a ruler with nobody to rule, is no ruler at all. Tales of a Spymaster will continue development long after initial release upon Steam Early Access and with your support, we shall keep releasing FREE add-ons for the game. We are currently looking at the following areas to extend. Religion. Banking. Historical elements - Funding expeditions, archaeological digs, &amp; artifact discovery. Pirates and Rebels. Guilds. Black-market. Important people like heroes and inventors. Steam Cards, Achievements, Cloud save integration. If you have ideas of features you would like to see, then feel free to reach out!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/530110/header.jpg?t=1563780811",
    "Price": 11.99,
    "Developers": "Gerard Morris",
    "Publishers": "Gerard Morris",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_4bedf1aff8172956a11f7376bdcbea2ab592eb7f.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_b43acb5eaf1a9bd4c1841cf254d745531b755d8a.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_24485585962e6cd3f7a2a50021414711c40978b7.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_50344808be342de2ca37fd1d8634b742a4bf50d0.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_386d2f183fd3f6bbeda173ed2c0c33ddbd39ca83.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_6e051f8639d556cbd3559f4dae3b0cfa853e52bf.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_929f1a199b428ecd46543a81c80d170384d3978b.1920x1080.jpg?t=1563780811,https://cdn.akamai.steamstatic.com/steam/apps/530110/ss_698e79d74b36810465d042eb9d0609ac3327e36c.1920x1080.jpg?t=1563780811",
    "Slug": "tales-of-a-spymaster",
    "Meta Title": "Tales of a Spymaster: May 17, 2019, Gerard Morris and Ful...",
    "Meta Description": "Looking for information on Tales of a Spymaster? Check out the release date (May 17, 2019), developer insights from Gerard Morris, and a complete game s...",
    "Alt Text Image": "Official header image for Tales of a Spymaster game - Steam 530110",
    "Canonical URL": "https://gusku.site/game/tales-of-a-spymaster",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tales of a Spymaster\", \"description\": \"Looking for information on Tales of a Spymaster? Check out the release date (May 17, 2019), developer insights from Gerard Morris, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gerard Morris\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gerard Morris\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/530110/header.jpg?t=1563780811\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}