{
    "AppID": 454260,
    "Name": "The HinterLands",
    "Release date": "May 27, 2016",
    "About the game": "The HinterLands is a multiplayer sandbox side scrolling survival game. In the HinterLands, there is a large focus on multiplayer, building, and survival. You arrive in The HinterLands with just a few tools and torches. To survive you must build a house, and hunt for materials to craft new items. Mine the terrain for resources, build great structures, harvest plants, trees and mobs, the choice is yours! Play cooperative or competitive multiplayer with friends or random players! The HinterLands is a work in progress, and will continue to grow, expand and evolve over time. Your feedback and suggestion will help shape the game, and you can participate in the development of the game. Features Multiplayer, featuring player vs player combat, and cooperative exploration and building Parkour style movement- run up walls, do flips, climb over ledges, run and slide under things, wall kick/jump between walls Fight with fast combos, slow strong attacks, and block incoming enemy attacks Take no damage, and unlimited blocks in creative mode Free content upgrades Optional touch screen controls Mine, Craft, Fight and Build! Mine procedurally generated, unique worlds, with randomly generated terrain, and dynamic day/ night cycles Craft tons of blocks and items, and use them to build! Farm mobs, or destroy them for food to satisfy your hunger Harvest trees and plants for food, potions, or seeds to replant and grow your own forests Multiplayer The HinterLands is an indie sandbox game, built with a heavy emphasis on multiplayer. Play on the free public servers and play with tons of people or just play with friends over LAN Play cross platform with Android, iOS, and more platforms if people are interested Why Play? If you enjoy multiplayer games, and would like to help shape the direction of this one Play with other people: create amazing structures, or just battle it out with swords, crossbows and guns Help shape the development of the game, add ideas, and watch the game evolve Explore the world, see new content added to the game, and provide feedback on what you like/ don’t like Who isn’t it for? Someone looking for a completely finished game. The game still needs a lot of development, and will continually be updated to fix bugs/ add content until it is finished The HinterLands was originally released on mobile early in development to encourage people to contribute, and since then it has grown a ton, and keeps growing thanks to player feedback! Planned features NPC’s: Characters to give you quests, buy and trade items, marry and start a family with! More advanced item, armor and weapon crafting system Bosses, more mobs, and more biomes Player vs. Player: Free for all, capture the flag, team oriented with different classes, tower defense with creeps and towers Pets: Animals to join you on quests and in combat (and mounts!) Craftable vehicles, space travel, permanent worlds on servers Instructions Customize and create your player and world Play on a public server, wifi, or single player game Mine dirt, stone, ect with the pickaxe. Chop trees and items with the axe Build amazing structures, upgrade your tools, and share on our facebook page / More instructions on the wiki: Controls Use WASD or arrow keys to move Left mouse button to mine/fast attack Right mouse button for strong attack Middle mouse button for shield Scroll the middle mouse button or +/- on the keyboard to zoom in/out Esc to exit/ go back I can add back in controller support if people are interested The game is still in still in development, because there is so much still that we want to add. There are only 2 of us working on it, but we appreciate everyone who plays the game, helps contribute by finding bugs, adding ideas, providing art or scripting, or suggestions and feedback. Feedback Join the forums: / Take the poll and let me know what you want changed in the game: -ktDDYYcqzCkCuCgYohwNL0kDXGj-TMxkrI1nt4-svM/viewform?c=0&amp;w=1",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/454260/header.jpg?t=1481571660",
    "Price": 2.99,
    "Developers": "Ackmi",
    "Publishers": "Ackmi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/454260/ss_d5af8b5c1ba441e640874c128822f47369ea828d.1920x1080.jpg?t=1481571660,https://cdn.akamai.steamstatic.com/steam/apps/454260/ss_31615f917fd1f523a10ee5276c414b1584699c1b.1920x1080.jpg?t=1481571660,https://cdn.akamai.steamstatic.com/steam/apps/454260/ss_3d604edb521d23a851e0e3c6545af127d1f37c06.1920x1080.jpg?t=1481571660,https://cdn.akamai.steamstatic.com/steam/apps/454260/ss_54d848d79bfc2f53af959952a29f88272c3fe405.1920x1080.jpg?t=1481571660,https://cdn.akamai.steamstatic.com/steam/apps/454260/ss_b6adffdf2f897c448342bce551ffbd43c6f5aade.1920x1080.jpg?t=1481571660",
    "Slug": "the-hinterlands",
    "Meta Title": "The HinterLands: May 27, 2016, Ackmi and Full Overview",
    "Meta Description": "Looking for information on The HinterLands? Check out the release date (May 27, 2016), developer insights from Ackmi, and a complete game summary.",
    "Alt Text Image": "Official header image for The HinterLands game - Steam 454260",
    "Canonical URL": "https://gusku.site/game/the-hinterlands",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The HinterLands\", \"description\": \"Looking for information on The HinterLands? Check out the release date (May 27, 2016), developer insights from Ackmi, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ackmi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ackmi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/454260/header.jpg?t=1481571660\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}