{
    "AppID": 1899430,
    "Name": "VEREDA - Mystery Escape Room Adventure",
    "Release date": "Feb 26, 2022",
    "About the game": "VEREDA - Mystery Escape Room Adventure As a secret undercover agent used to adventure and mystery you are tasked with your latest mission to infiltrate a town guarding a top secret dossier. What the dossier contains is not known, your sole focus is just to find and recover it. What you are not prepared for is the lengths the dossier has been protected. It’s down to you to use all your experience to solve the puzzles and contraptions that block your way. A letter left in your room briefly describes your mission: “…the dossier in question is located in a building further into town. We cannot give you much more information than this, as details are unclear due to the unique situation you find yourself in. To prepare you for what is to come, we have primed your room with a small training exercise…” With this your mission begins… ABOUT Vereda is a first person 3d escape room puzzle adventure, similar to games you may have played in the ’90’s or similar to a virtual escape rooms you may have played. An indoor and outdoor immersive world that you explore and an inventory where you can collect and use items you find along the way to solve puzzles and escape the rooms. Play as a secret agent assigned a mission to recover a secret dossier set in an unusual town. Explore areas and take in your surroundings. Use all of your puzzle solving skills to make your way through the town and recover the missing dossier. How you tackle the puzzles is down to you. Each puzzle has a logical solution, so take your time, there is no rush and enjoy the process of understanding what you have to do. FEATURES • Explore an immersive indoor and outdoor 3D environment, solving puzzles and collecting items • Use the inventory to collect and use objects • Beautiful all original adventure 3D graphics, environments and atmosphere to explore • Immersive backing soundtrack and effects to pull you into the adventure • Full save system with load slots, manage all controls and sound levels to your preference. CONTROLS: Movement: WASD + Mouse Inventory: I Menu: ESC HINTS &amp; TIPS If you need a hint or clue while playing Vereda then please reach out over email or social media (contact links can be found on my website) and I will be more than happy to help you. SMALL PRINT Vereda was created from the imagination of a solo indie developer. “I am always excited to hear people playing my games and their experience along the way. Adventure gaming is my passion and your feedback helps my games get better.“ Vereda is compatible with most modern PC's and has been designed to be as resource efficient as possible to allow play on many different devices. With that said, if you do run into any difficulties please email so I can provide updates that help everyone enjoy the adventure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1899430/header.jpg?t=1650275528",
    "Price": 7.99,
    "Developers": "M9 Games",
    "Publishers": "M9 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_086569fd834416d946953f7c0a5f263399e8e740.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_747aea7bf964ef78fadb98258bc07427d347a64e.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_3f0a393036078bc9b85358873adabb9e97564518.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_c37c5a69f291fad5e1934ad7def69a2901e02258.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_0fe706dcecde8dd7053bcb05b9a2defcf177594a.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_db7612aafeecd00b3b619b941ba0453cec4324dd.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_c2beffce471c6b069f77a2345e20bd60bff7f804.1920x1080.jpg?t=1650275528,https://cdn.akamai.steamstatic.com/steam/apps/1899430/ss_80ebde0ed9636ca3c964cef4f7479dcfe949d5eb.1920x1080.jpg?t=1650275528",
    "Slug": "vereda-mystery-escape-room-adventure",
    "Meta Title": "VEREDA - Mystery Escape Room Adventure: Feb 26, 2022, M9 ...",
    "Meta Description": "Looking for information on VEREDA - Mystery Escape Room Adventure? Check out the release date (Feb 26, 2022), developer insights from M9 Games, and a co...",
    "Alt Text Image": "Official header image for VEREDA - Mystery Escape Room Adventure game - Steam 1899430",
    "Canonical URL": "https://gusku.site/game/vereda-mystery-escape-room-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VEREDA - Mystery Escape Room Adventure\", \"description\": \"Looking for information on VEREDA - Mystery Escape Room Adventure? Check out the release date (Feb 26, 2022), developer insights from M9 Games, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1899430/header.jpg?t=1650275528\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}