{
    "AppID": 1848430,
    "Name": "Walk to the Woods",
    "Release date": "Jun 16, 2022",
    "About the game": "Walk to the Woods is a peaceful conversation starting game that feels like you're with your friends in the woods chatting about anything. You'll lay down and stare up at the stars as thought provoking questions are posed to everyone. Have Any Kind of Conversation How do you want to get to know your friends? Walk to the Woods has 12 different base topics of various levels of intensity ranging from casual questions you could ask any coworker to vulnerable questions that may cause some tears. Are you on a first date? Trying to learn more about your family? Want to know more about random parts of someone's past? Not only are there 1200+ questions in the game, but also 40+ special sets that are specifically about certain topics and groups of people! Some examples of special sets include First Date, Couples, Pride, Out and Proud, Generations, Bias, Programming, Politics (non-US centric!), Movies, Music, Video Games, Tabletop and much more! Special Question Types Some of the questions are repeatable and will shift every time you play them! One such mode is Picture Dates! In that game mode, a random date within the last number of years will be chosen and players will answer the question with that date in mind! What were you most afraid of 5 years ago? What was something deeply on your mind 10 years ago? What were your friends like 18 years ago? Every time the mode is played, the dates are random, so it can be played as much as you want! Another mode is called Call Outs and Call Out Pairs! In this mode, the names of the players are inserted into the question itself. For example, a question might be 'What is something you have in common with _______', where ___ is the name of one of the players playing! Since the chosen person is random and you can insert any names you want each time, the questions can change each time! Another one is Hot Seat , where players work together to come up with one question to ask a player. For example, 'Work together as a group to come up with a question for _______ about their career or their personality'. The topics are random each time, so this can be replayed over and over! Tension Breakers Sometimes, the conversations can get a bit intense. In that case, you can turn on tension breakers to break up the deep talks with some more fun questions or tasks! Every 3 questions, a random tension breaker will be chosen. These can be Tongue Twisters, Superlatives, Would You Rather, Guess Player Info, or a hidden tension breaker! Tongue Twisters - Difficult phrases to say 5 times in a row quickly. Superlatives - Which player is the funniest? Which one is the 'Cleaner'? Would You Rather - Would you rather be able to summon a pen and paper at will or an electric scooter at will? Guess Player Info - Guess what one of your friends would say about some question. Features List Topics : Romance, Career, Family, Faith, Past, Values, Ethics, Random, Fears, Friends, Personality, Gender. Question Intensities : Casual, Basic, Deep, Personal, Vulnerable. Special Sets : Art, Bias, Birthday, Books, Call Outs, Call Out Pairs, Camera Roll, Couples (1-3), Dungeon Masters, First Date (1-3), Friend Mixer, Generations (1-3), Group Questions (1-3), Hot Seat, Movies, Music, My Life, Out and Proud, Picture Dates (1-3), Politics, Pop Quiz, Pride, Programming, Quick Thinking, Rankings, Reunion, Tabletop, Tense Twelve, Video Games, Wilderness. Tension Breakers : Tongue Twisters, Would You Rather, Superlatives, Guess Player Info.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1848430/header.jpg?t=1655913792",
    "Price": 9.99,
    "Developers": "Forever Rain Studios, LLC",
    "Publishers": "Forever Rain Studios, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_2af14be27ed334c95efb625c507f28e02c46dfd0.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_0b86fba01376bdfa0050ba16a3e2793f17aa2da4.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_68ce5e60e785efe73bbbca862cfe372ec7a2de3b.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_3dd3fddf2846970fc549ce95eac75751ae684da5.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_8fd24542f68df0b739a915f509398215e545cbf1.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_7c60765297afe18c250d89a7f2c8d771d1aaf7ab.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_654cbff607c12a54f98f855e8a5ba21f4d2b616b.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_bd442bf7ff7233f7f4f99830c309c447d490c505.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_ed8abc494c3c739418955cca680ef7a3ed5485ab.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_4d3e54afaed7f65ad27ad52c8f5b0db295a542bf.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_7c819dd35f1f9a6c41d2fcdb4404340e22fdd8f6.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_b76fe132e85905106d69b77ebc66754dcb91c23b.1920x1080.jpg?t=1655913792,https://cdn.akamai.steamstatic.com/steam/apps/1848430/ss_f16ffbce806303fad9cc25314f6415e1efd3f7c2.1920x1080.jpg?t=1655913792",
    "Slug": "walk-to-the-woods",
    "Meta Title": "Walk to the Woods: Jun 16, 2022, Forever Rain Studios, LL...",
    "Meta Description": "Looking for information on Walk to the Woods? Check out the release date (Jun 16, 2022), developer insights from Forever Rain Studios, LLC, and a comple...",
    "Alt Text Image": "Official header image for Walk to the Woods game - Steam 1848430",
    "Canonical URL": "https://gusku.site/game/walk-to-the-woods",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Walk to the Woods\", \"description\": \"Looking for information on Walk to the Woods? Check out the release date (Jun 16, 2022), developer insights from Forever Rain Studios, LLC, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Forever Rain Studios, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Forever Rain Studios, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1848430/header.jpg?t=1655913792\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}