{
    "AppID": 1063580,
    "Name": "Aeon's End",
    "Release date": "Sep 17, 2019",
    "About the game": "Deck Building With a Twist Randomized turn order, no shuffling, and multiple win and loss conditions make this a deck building experience like no other! “This is not the end of the world. That already happened. This is what is left: us, gravehold, and the Nameless. For generations we have taken refuge in an ancient and haunted place. It has taken our mages an aeon to hone their craft, but they are ready... and they are lethal. The breaches, the very conduits through which the Nameless travel, have become our weapon.” -Yaleesa Rhykk, Gravehold survivor The situation is bleak. The final city - Gravehold - needs the power of the breach mages to hold back the Nameless. Join the fight, and maybe… just maybe, Gravehold will live to see another dawn. Aeon’s End is a deck-building game where you create a team of up to 4 mages who will fight cooperatively to defeat whichever Nameless nemesis has come through the breach today. You begin with a starting deck of 10 cards, 5 in hand. Each turn you play gems to gain aether , which is used to buy new gems and relics , learn new spells , and increase your casting potential by opening additional breaches . You can also play relics to give yourself or your allies a boost. Then prep spells to your opened or focused breaches to be ready to cast them on your subsequent turns. What makes Aeon’s End unique is how it uses randomness . Unlike other deck building games, players do not shuffle their deck when it runs out. The order in which you discard is preserved so plan your discards carefully to set yourself up for subsequent turns. Instead, randomness in Aeon’s End comes in the order of turns. At the start of each round, the turn order deck is shuffled to determine the order of play. Will the nemesis go twice in a row, pushing back the mages’ defense? Will the mages get 4 turns in a row to set up for the coming onslaught? It can be hard to know what’s coming next when you are deep in the melee! Finally, there’s the city of Gravehold . The breach mages of Aeon’s End are not just fighting for their own survival, but the survival of all of humanity, and the Nameless know it. If Gravehold is ever reduced to 0 life, the mages have lost and humanity is but a memory. Protect the city at all costs! What is included: Aeon’s End includes the following: 8 Breach Mages: Adelheim Brama Jian Kadir Lash Mist Phaedraxa Xaxos Each Mage has a unique starting card and a unique ability that can be charged to use in the fight. For example, Kadir has a gem that allows her to heal herself or an ally, and an ability that allows an ally to dig for and prep spells. Xaxos has a spell that allows him to reveal the top card of the turn order deck and an ability that helps allies charge their abilities. The Market: You build your deck with player cards from the market. 3 gems, 2 relics, and 4 spells allow you to grow your powers to hold back the nemesis. The market is constructed from 27 unique gems, relics, and spells. Either take a randomly generated market, or build the perfect one yourself during setup. 4 Nameless Nemeses: Carapace Queen Crooked Mask Prince of Gluttons Rageborne Each Nemesis plays differently with unique mechanics to keep even the most powerful breach mages on their toes. Rageborne lays on the damage in a more frontal assault using the Strike Deck , whereas the Prince of Gluttons fights more of a war of attrition, devouring player cards from the market. Aside from their unique mechanics, the Nemesis deck is created before each game from a combination of basic and nemesis-specific cards. You may encounter the same Nemesis many times, but it will never attack you in exactly the same way twice. Expand your gameplay options with DLC: Promo Pack 1 (Free) includes mage Xae from One Deck Dungeon , along with 3 digital exclusive player cards and 3 basic nemesis cards. The Nameless includes 2 nemeses, 1 mage, and 7 player cards. The Depths includes 1 nemesis, 3 mages, and 8 player cards. The New Age more than doubles the content in the core game, and introduces the Expedition system! The last of humanity need your protection! Pick up the mantle, focus your breaches, and beat back the Nameless - We’re all counting on you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1063580/header.jpg?t=1646067665",
    "Price": 14.99,
    "Developers": "Handelabra Games Inc.",
    "Publishers": "Handelabra Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_9fd89afda13e8ec1c2677e29c318912aedd7a0c8.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_cb7085775875787f18aa233ae5641527476ad55c.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_fd9037f225ef6a554dcb9d282e40df9e660d5ccf.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_79ef57f000e756873dee4f577033d60d8c5d6f7d.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_eabc5434f63ea8ec76901e89a9a890ae96355ad2.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_1b82d19e6cc6107e0e6755637a93f5c1ea65713f.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_b3a9ae3874dcf610c2848490fefbdf1095b08abb.1920x1080.jpg?t=1646067665,https://cdn.akamai.steamstatic.com/steam/apps/1063580/ss_f14cfc4d0787856eada6612d70434307737dfd00.1920x1080.jpg?t=1646067665",
    "Slug": "aeon-s-end",
    "Meta Title": "Aeon's End: Sep 17, 2019, Handelabra Games Inc. and Full ...",
    "Meta Description": "Looking for information on Aeon's End? Check out the release date (Sep 17, 2019), developer insights from Handelabra Games Inc., and a complete game sum...",
    "Alt Text Image": "Official header image for Aeon's End game - Steam 1063580",
    "Canonical URL": "https://gusku.site/game/aeon-s-end",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aeon's End\", \"description\": \"Looking for information on Aeon's End? Check out the release date (Sep 17, 2019), developer insights from Handelabra Games Inc., and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Handelabra Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Handelabra Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1063580/header.jpg?t=1646067665\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}