{
    "AppID": 379870,
    "Name": "Alteil: Horizons",
    "Release date": "Oct 27, 2016",
    "About the game": "Alteil: Horizons has the structure of a CCG and the flow of a unit tactics game. Collectible Card Game Structure -- collect cards, build decks and duel either PvP for ELO ranking or in single player adventure mode. Unit Tactics Game Flow -- Field units with resources, no randomly drawn hands. Units have HP, AT, DF, AGI, RNG and take turns, highest agility first. Pick from the unit’s Action Menu -- Attack, Move, Rest, or use special abilities! Hybrid Tactical RPG / Card Dueling Game mechanics Collectible cards with full RPG-style stats, alternate art and story Story and Art contributions from famous names in the Japanese game industry Over 2000 pieces of gorgeous card art, with more added each month PVP dueling / ELO ranking Single player story mode with 20 adventures at launch -- more added every other month Duel replays and spectator system Core tournament-legal set ensures tight balance Card crafting and player marketplace With a little help from our very supportive friends in the Japanese games industry, Alteil Horizons sports creative contributions from some old pros and big names: Story and direction by TAKUJI ASANUMA, director of Star Ocean and Valkyrie Profile. Art and design by... KATSUYA TERADA, concept artist of “The Legend of Zelda” HITOSHI YONEDA, lead artist of “The Secret of Mana” SHUNYA YAMASHITA, designer of “Final Fantasy X” YUJI KAIDA, franchise artist for Transformers, Godzilla and Macross Four Gods sleep under the Kingdoms of Men…harness their power! It is you who know the truth of this world. You are one of the chosen few who know of the four Ancient Gods – infinite beings forgotten by history. Each god’s Sphere of Influence still permeates this world -- all living things are subconsciously bound to one of them. Tapping into the Spheres of Influence, you summon and command the might of enormous monsters, epic heroes and arcane dragons to defeat your enemies! Each duel brings new challenges, with the huge amount of cards available, you’ll always be up against strategies that push the limits of Alteil’s various gameplay mechanics – such as the day/night cycle and its effects on undead and lycanthropes, the Soul Card system that lets each player fine tune their Life Point total to better compliment rush or combo play styles, and the Revival system that turns extra copies of a unit in the deck into ‘extra lives’ for that unit on the field. Every match also yields exciting treasure drops, to help you build a vast card collection or just fine-tune and perfect your favorite decks! In addition to completing a successful Kickstarter and presenting at the Indie Megabooth at PAX East 2014, we’ve been lucky enough to get some great press for Alteil: Horizons. Here’s what they’re saying: Kotaku praised the team of artists, saying “Alteil: Horizons is actually an all-stars kind of ensemble title.” MMO Attack focused on the game, saying “Horizons combines what players love from their favorite trading card games with RPG elements” Massively.joystiq names Alteil a “contender in the ring” in the card combat genre against HEX and Hearthstone. They also put Alteil at the top of their 2013 summer list of crowd-funding projects to watch! The Examiner noted, what “sets this game apart from its rivals is the amount and quality of the game’s art.” JStationX calls Alteil Horizons “the next best card-based RPG.” You can also read about us on: Ten Ton Hammer, BioGamerGirl, ComicBuzz, Gamasutra, Gamer’s Temple, Review the Tech, 2P, AnimeNewsNetwork, MMO Site, and On RPG.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/379870/header.jpg?t=1482262032",
    "Price": 0.0,
    "Developers": "Apocoplay LLC,Ludeme Games,Coreedge Inc",
    "Publishers": "Apocoplay LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/379870/ss_4c8811216bb8f44b3c1ac824e1da7f7a0cd51c35.1920x1080.jpg?t=1482262032,https://cdn.akamai.steamstatic.com/steam/apps/379870/ss_2c799201f9de01445a6ea2deacc7aff3bcba60ea.1920x1080.jpg?t=1482262032,https://cdn.akamai.steamstatic.com/steam/apps/379870/ss_6dd9603f41c557aa30df2bdb0f1fea4d743e9854.1920x1080.jpg?t=1482262032,https://cdn.akamai.steamstatic.com/steam/apps/379870/ss_fe856d625f71ddc87fa3a54bbde0f7621c6cd7cc.1920x1080.jpg?t=1482262032,https://cdn.akamai.steamstatic.com/steam/apps/379870/ss_22ba179e877ff61528cb2f66e12e1a368c81a979.1920x1080.jpg?t=1482262032,https://cdn.akamai.steamstatic.com/steam/apps/379870/ss_a88b3e4f03d881a31094affead04def39340a0cd.1920x1080.jpg?t=1482262032",
    "Slug": "alteil-horizons",
    "Meta Title": "Alteil: Horizons: Oct 27, 2016, Apocoplay LLC,Ludeme Game...",
    "Meta Description": "Looking for information on Alteil: Horizons? Check out the release date (Oct 27, 2016), developer insights from Apocoplay LLC,Ludeme Games,Coreedge Inc,...",
    "Alt Text Image": "Official header image for Alteil: Horizons game - Steam 379870",
    "Canonical URL": "https://gusku.site/game/alteil-horizons",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alteil: Horizons\", \"description\": \"Looking for information on Alteil: Horizons? Check out the release date (Oct 27, 2016), developer insights from Apocoplay LLC,Ludeme Games,Coreedge Inc,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Apocoplay LLC,Ludeme Games,Coreedge Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Apocoplay LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/379870/header.jpg?t=1482262032\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}