{
    "AppID": 1463730,
    "Name": "Arid",
    "Release date": "Jun 29, 2021",
    "About the game": "Welcome to Arid, a small and contained open world survival experience set during the 1930s in one of the driest places in the world: the Atacama. Plane Crash It's the 30s. You are the pilot of a cargo flying 8000 meters over the Atacama*, a mysterious failure in the engine and a miraculous landing has left you stranded in one of the largest and most arid desert in the world. Will you survive the harsh temperature and conditions of this unique setting? Is there even a way out? *We took some creative freedoms in order to extremize the harsh climate and location in which the game is set. Survival Open World As a singleplayer survival open world, Arid aims at delivering a semi-hardcore experience that does not handheld the players. After a guided onboarding the player will be left to explore and progress the story how they prefer. Will you find and repair all the refuges on the map? Will you explore for additional resources? How many days can you survive? Harsh Environment Shade in the desert is scarce, as it is water. While exploring the mountains of the Atacama, the player must survive severe dehydration, extreme temperatures, sun exposure and other kinds of natural dangers. Avoid getting sunburn and be careful to the body temperature of the character. Stock up with resources and look for a safe place! Weather Events Prepare yourself, extreme temperatures and sandstorm can occurr at any time. While they're not lethal on their own, they can heavily affect a struggling survivor. Day and Night Cycle Survive the day to embrace the darkness of the night. Find a bed to recover energy or embrace the darkness and explore the desert at night. Vision is scarce but without dangers such as the sun exposure and high temperatures, it will be easier to find resources. Remember to keep your torch well maintained, you will need oil to be able to explore at night or get deeper in the mining network of the Atacama. FEATURE SUMMARY Avoid sun exposure and keep your body temperature low. Keep yourself well-fed and hydrated. Water will be a scarce resource! Find abandoned locations and uses them as temporary refuges. Consume energy with every action, find a bed and strategize how many resources are needed to recover it back. Unlock different refuge facilities, such as the crafting bench, animal traps and the fireplace. Prepare food and craft all the items required for your survival. Hide from the lethal sandstorms. Discover the stories of the people that lived in this mysterious part of the desert. Something lies in the darkness...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1463730/header.jpg?t=1645027027",
    "Price": 0.0,
    "Developers": "Sad Viscacha Studio",
    "Publishers": "Breda University of Applied Sciences",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_f3cdf9d2fc1ad626686fb73331755df233978ac0.1920x1080.jpg?t=1645027027,https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_e91262b2ad2c397b5f9f406365c0a73116058281.1920x1080.jpg?t=1645027027,https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_723651ed7edff45ec2836cf60370400481f93ef4.1920x1080.jpg?t=1645027027,https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_b45741996fc3001a59abd84f43d7789e6de05b90.1920x1080.jpg?t=1645027027,https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_92066ffac1bcbc1bbff1786d238dbd961acc0004.1920x1080.jpg?t=1645027027,https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_7f4492edddc9a8e304440fcb2dae4f4537fca607.1920x1080.jpg?t=1645027027,https://cdn.akamai.steamstatic.com/steam/apps/1463730/ss_7247f136f54d09f0ccb84fdb22dff099118e29a8.1920x1080.jpg?t=1645027027",
    "Slug": "arid",
    "Meta Title": "Arid: Jun 29, 2021, Sad Viscacha Studio and Full Overview",
    "Meta Description": "Looking for information on Arid? Check out the release date (Jun 29, 2021), developer insights from Sad Viscacha Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Arid game - Steam 1463730",
    "Canonical URL": "https://gusku.site/game/arid",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Arid\", \"description\": \"Looking for information on Arid? Check out the release date (Jun 29, 2021), developer insights from Sad Viscacha Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sad Viscacha Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Breda University of Applied Sciences\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1463730/header.jpg?t=1645027027\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}