{
    "AppID": 376880,
    "Name": "ASTROKILL",
    "Release date": "May 27, 2016",
    "About the game": "A modern space shooter and combat sim Focused on combat without compromising realism, ASTROKILL is a modern space shooter drawing inspiration from old-school games like TIE Fighter and Freespace 2. Players pilot fighters, gunships, interceptors, and medics (in 1st or 3rd person) from warring factions in ballistic dogfights. Wage war flying for either the sprawling Dominion of Man or the rebellious Outer Belt Alliance! Full-featured space combat Progress through a variety of campaign-missions or instantly play standalone missions Use ballistic or energy weapons to destroy hostile fighters, turrets, freighters, capital ships, and even space-mines Deliver destruction downrange with high-velocity bullets, explosive flak, homing missiles, EMP missiles, and lasers Control your spacecraft with true 6DoF flight-controls via directional thrusters Repel enemy fire with anti-gravity using the one-of-a-kind GShield Play with a mouse/keyboard, gamepad, or joystick, and customize all controller-mappings AI mimics human-behavior by weighing and making decisions based on changing battle conditions Beautifully detailed planets, moons, and asteroids populate unforgiving zero-G battlefields Ballistic warfare in zero-G In the world of ASTROKILL, kinetic weapons dominate the battlefield. Wield machine guns, flak cannons, missile launchers and rail guns in chaotic space combat. Wipe out entire squads and bring down frigates in glorious explosions. But, be wary of camping interceptors, homing space-mines, and ace-pilots. To succeed in this unforgiving zero-G battlefield, you must master your ship and its weapons. Strategic energy weapons When raw kinetic energy is not enough, lasers and EMP-missiles can do the trick. Penetrate hostile GShields with rapid laser fire (anti-gravity fields have no effect on beam weapons). Or, disrupt an enemy fighter's electrical system with a well-placed EMP missile. Once disabled, fighters will drift helplessly without shields until power is restored. Not your mom's space game To survive, you will master your spacecraft and strategically manage your squad. Command squad-members to guard areas, strictly hold positions, or rearm at the nearest hangar bay. By flying as a medic, you have the ability to repair and rearm your fellow wingmen. Protect yourself from enemy fire with anti-gravity. Use asteroids and debris as concealment from enemy-detection. Support friendly capital-ships as they reign down hellfire on enemy-positions. And, above all us, out-maneuver and outgun all who cross your path.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/376880/header.jpg?t=1650511698",
    "Price": 9.99,
    "Developers": "Doomsday Games",
    "Publishers": "Doomsday Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_0e36fa7311080f9631cc2d1ed240f3e85ee59319.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_3170fa94b9ad7e5b5da9c035bddfa7fa2d54d795.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_9c57e81d16353498d1e4b49ffbab978142c68853.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_85263d192de1e22ed72e131b252c635a3241e8b1.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_59324c0a4249a0ad0775c0efe531cd0e7a3b4928.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_1e3a5db47cfa163971fc2acf119ae665776c00b6.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_49a75243b24da68e927b28c530637538166d5bea.1920x1080.jpg?t=1650511698,https://cdn.akamai.steamstatic.com/steam/apps/376880/ss_8735e8648934c8dca0f47170aaea1694c48edd79.1920x1080.jpg?t=1650511698",
    "Slug": "astrokill",
    "Meta Title": "ASTROKILL: May 27, 2016, Doomsday Games and Full Overview",
    "Meta Description": "Looking for information on ASTROKILL? Check out the release date (May 27, 2016), developer insights from Doomsday Games, and a complete game summary.",
    "Alt Text Image": "Official header image for ASTROKILL game - Steam 376880",
    "Canonical URL": "https://gusku.site/game/astrokill",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ASTROKILL\", \"description\": \"Looking for information on ASTROKILL? Check out the release date (May 27, 2016), developer insights from Doomsday Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Doomsday Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Doomsday Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/376880/header.jpg?t=1650511698\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}