{
    "AppID": 364380,
    "Name": "CINEVEO - VR Cinema",
    "Release date": "Apr 24, 2015",
    "About the game": "----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- !!! ATTENTION !!! !!! ATTENTION !!! !!! ATTENTION !!! DO NOT PURCHASE CINEVEO !!! CINEVEO has been discontinued and is no longer available! CINEVEO servers are offline! CINEVEO is being removed from Steam. DO NOT PURCHASE CINEVEO !!! !!! ATTENTION !!! !!! ATTENTION !!! !!! ATTENTION !!! ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- ----------------------------------------------------------------------------- CINEVEO is a super immersive VR Cinema experience, with the most detailed and beautifully designed VR Cinema environments on the market. Experience total presence in VR, as you watch your videos inside a collection of ultra-realistic VR Cinemas with AAA graphics. Nothing comes closer to the real thing. CINEVEO is loaded with unique features. CINEVEO has not just one VR Cinema environment. It has six! The 4D Movie Theater, the 1960 Drive-in Theater, the Ocean Theater, the Haunted Valley, the Internet Cinema and the Void. CINEVEO's 4D Movie Theater generates ambient lighting effects. The ambient lighting creates an intense atmosphere inside the theater room during movies. Both the 4D Movie Theater and the Internet Cinema have a multi-player audience. These theaters are populated with real CINEVEO users and you can see their head movements in real-time. CINEVEO is not limited to playing video files. CINEVEO's Internet Cinema has an integrated web browser that can play YouTube videos. It also has a chat room where CINEVEO users can talk, share links to YouTube videos and watch them together. Additionally, all of CINEVEO's VR Cinemas have movie subtitle support and you can customize the size and shape of the cinema screen. Several ultra-detailed and animated 3D VR Cinema environments with AAA graphics. A true VR Cinema experience with an unprecedented level of immersion. Plays all video file formats perfectly smooth (MKV, MP4, AVI, MOV, WMV, etc.). Plays 3D videos (SBS and Over / Under) with superb 3D depth perception. Crystal clear cinema screen with the best video image quality on the market. You can customize the size and shape of the cinema screen. Ambient lighting effects generate an intense atmosphere in the 4D Movie Theater &amp; Internet Cinema during movies. Movie subtitle support (SRT format). The seats in the 4D Movie Theater &amp; Internet Cinema are populated with a multi-player audience made up of real CINEVEO users. The Internet Cinema has an integrated web browser that can play YouTube videos. It also has a multi-player chat room where users can talk, share links to YouTube videos and watch them together. SPECIAL FEATURES Advanced dynamic lighting | CINEVEO's Stereo PFOV Lighting™ | Multiplayer audience CINEVEO’s 4D Movie Theater v4.0 is the most immersive and advanced VR Cinema simulation available for the Oculus Rift and HTC Vive. Feel total presence in your own personal movie theater and watch your videos on a huge customizable cinema screen. The 4D Movie Theater v4.0 features innovative dynamic lighting effects during movies, such as CINEVEO’s Stereo PFOV Lighting™ , which generates visual effects for any video and creates an incredible atmosphere inside the movie theater using the cinema screen’s light, color, reflections, shapes and shadows. To immerse you even further into VR, CINEVEO comes with a multiplayer mode, which can populate your movie theater with an animated live audience made up of real CINEVEO users, who are watching a movie at the same time as you. SPECIAL FEATURES Ultra-detailed 1960s drive-in movie theater setting | Sit in a 1958 Buick convertible | Air traffic and animated birds | Vertigo effect Inspired by the popular car drive-in movie theaters, that were all the rage throughout the United States in the 60s, CINEVEO’s 1960 Drive-in Theater v2.0 will let you watch your movies from the seat of an ultra-detailed 1958 Buick convertible car, with a fully modeled interior and exterior. Your car is parked in front of a gigantic cinema screen, located on a on a vast hill overseeing the Los Angeles city skyline by night. Look behind and you will spot a road-side diner with restroom building, projector tower and neon billboard. Search the sky long enough and you will spot classic Douglas DC airplanes flying over the city. The cinema screen casts dynamic lighting effects, creating an incredibly immersive atmosphere during movies. SPECIAL FEATURES Ultra-realistic ocean environment | Animated lighthouse, ships and birds | Cinema screen water reflection CINEVEO’s Ocean Theater v2.0 is an ultra-realistic and incredibly immersive VR Cinema environment, teleporting you in front of a gigantic cinema screen, located in the middle of the ocean at dawn time. Watch your movies, sitting inside a little wooden rowboat, dancing gently with the waves. Your rowboat is anchored next to a photo-realistic lighthouse with animated lights. In the distance you will see ships and flocks of birds passing by once in a while. The cinema screen casts dynamic lighting effects and its reflection shimmers on the surface of the ocean, creating a powerful atmosphere during movies. SPECIAL FEATURES Eerie environment ideal for horror movies | The ghost of little Lucy roams through the haunted valley | Get scared during movies The Haunted Valley v2.0 features an eerie environment that will give you the shivers. It's great for watching horror movies. This VR Cinema is haunted by little Lucy, the ghost of a 12 year old girl who disappeared in 1894. Lucy does not like it very much when strangers are around. Be prepared, as she will not hesitate to give you a scare once in a while. You can spot Lucy in four locations at random times if you keep your eyes peeled. Are you ready for little Lucy? SPECIAL FEATURES Integrated web browser and chat room | YouTube video support | Watch videos together | Play browser games | Multiplayer audience | CINEVEO's Stereo PFOV Lighting™ The Internet Cinema is based on the 4D Movie Theater and features an integrated web browser, a multi-player audience and a chat room. You can watch YouTube videos, surf the web and play browser games in the Internet Cinema. You can do this alone or together with other CINEVEO users. You can meet other CINEVEO users in the integrated chat room to talk, share links to YouTube videos and watch them together. SPECIAL FEATURES Just the screen and you in empty space | CINEVEO's ULTRA - 3D™ Mode The Void features a distraction free environment in pitch black darkness. The Void is the only cinema theme that currently supports viewing 3D movies in CINEVEO's ULTRA - 3D™ Mode .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/364380/header.jpg?t=1621338094",
    "Price": 29.99,
    "Developers": "Mindprobe Labs",
    "Publishers": "Mindprobe Labs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_b806c0291c8e371aecc5bdda044a07e62c9b393a.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_f887fab7468daee0f81f507fd29f054ec2c803e3.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_e8dedc8c17730de5547fab3b995fa7bde14a3770.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_24ab081450bd01e4d5fe3c41df10f8a8ef342b2f.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_78d2eb941be22e99cfbe92110d24c7cdf9d729ca.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_74cd18bdd8b534ad97452b7af7ab109e9988fbbe.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_ea38c01da3c7c8e178a09027f1dff39415ad6f5f.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_0b0b535ca080c795c46a9dc454e92125a7e5a036.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_49d7e1f1cb546765f7c85872a24e95cb6773c27e.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_d72e0ac2e60f617f8fd2db8df7d1b162df8d64f0.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_e13ee740ae8cadf38eb675afca58b9869b2b3493.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_36a73aac48c0f4ecbf90fca7fffffd9c3f055751.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_633e197fe1e6925cd2a425cf30bfe4156cef2c66.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_363ba19f9a1ebf64400ea8543a4dffbbfc56f151.1920x1080.jpg?t=1621338094,https://cdn.akamai.steamstatic.com/steam/apps/364380/ss_a4c2c677c39e44405b5ba0a9553ccc2372b49e9e.1920x1080.jpg?t=1621338094",
    "Slug": "cineveo-vr-cinema",
    "Meta Title": "CINEVEO - VR Cinema: Apr 24, 2015, Mindprobe Labs and Ful...",
    "Meta Description": "Looking for information on CINEVEO - VR Cinema? Check out the release date (Apr 24, 2015), developer insights from Mindprobe Labs, and a complete game s...",
    "Alt Text Image": "Official header image for CINEVEO - VR Cinema game - Steam 364380",
    "Canonical URL": "https://gusku.site/game/cineveo-vr-cinema",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CINEVEO - VR Cinema\", \"description\": \"Looking for information on CINEVEO - VR Cinema? Check out the release date (Apr 24, 2015), developer insights from Mindprobe Labs, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mindprobe Labs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mindprobe Labs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/364380/header.jpg?t=1621338094\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}