{
    "AppID": 1871620,
    "Name": "Covid Simulator",
    "Release date": "Jan 25, 2022",
    "About the game": "'So Well Made It's A Little Depressing' - Kotaku PLEASE WEAR A MASK, AND GET VACCINATED! Since early 2020, Covid-19 has caused mayhem the world over. Spreading rapidly, it can cause illness, long term disability, and death. The Covid-19 pandemic has been met with much political turmoil - causing misinformation, violence, and unnecessary risk. Many confusing charts and diagrams exists highlighting the dangers of Covid-19 in the workplace. COVID SIMULATOR hopes to visualize, in an understandable way, how quickly Covid-19 spreads, becoming a disaster. The game is an open sandbox to enjoy, or just fill yourself with dread In Covid-19 Simulator you can: Play in a sandbox environment to experiment with Create a procedural generated work spaces which you can adjust Create your OWN workplace with the level editor Name and track your workers Adjust the number of employees, and their work schedules Adjust infection rates, mask adoption, and vaccination rates Manually add/remove masks of different varieties, and give vaccinations Swap between the Alpha, Delta, and Omicron Covid strains Create your own CUSTOM Covid strain! Adopt mask mandates, and vaccine mandates Hire/Fire Employees Encourage Pro/Anti Vaccine behavior Give 'alternative medicine' treatments Speed up or slow down time to view the results View and save charts as PNG or CSV, showing spread over time Integrate with Twitch to let your viewers be in the game! TWITCH CONNECT In the game folder under Assets/Resources/ is a text file labeled 'TwitchConnect.' simply input your information and the game will automatically be connected to your steam channel. Characters in game will be named for people chatting in your chat. Simply delete your information if you'd no longer like that connection. -----DISCLAIMER----- COVID-19 is a serious disease. The game includes satire of current political climate regarding Covid-19, but hopes to convey a very serious attitude regarding the reality of this deadly disease. THE PRIMARY CONDITIONS THAT EFFECT REAL WORLD COVID-19 INFECTION/TRANSMISSION/CONDITIONS/RESULTS ARE: AGE HEALTH EXPOSURE CONDITIONS INCOME ACCESS TO HEALTH CARE The game bases the infections/transmissions/conditions/results of Covid-19 on the US CDC statistics which are based on age/gender/health/ethnicity. This game does not wish to insinuate any ethnic disposition towards Covid-19, however it is personally important to me to demonstrate the extreme dangers that minorities are currently experiencing with the pandemic. It is impossible for a simple game to fully simulate the intricacies of every day human life. The random ages, genders, health, and ethnicity is based on percentages reported in the US Census data for people in the work place. These are nation wide averages, and does not reflect any particular area. I am NOT a statistician or a virologist . I am a game developer. This simulator/visualization appears to have similar outcomes to real world results - however it will likely never be real world accurate. It is only a game, meant to demonstrate the dangers of unchecked Covid-19 spread. Within the game files is a stat sheet which can be edited if you would like to change the outcomes/results! If you ARE a statistician or a virologist, please contact me - I would LOVE to expand the accuracy of this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1871620/header.jpg?t=1643574756",
    "Price": 4.99,
    "Developers": "Coldrice Games LLC",
    "Publishers": "Coldrice Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_f14ddd15c0bb226bd98e5bd1644cb8aaeb631ebe.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_0f8c38cb66005a25196e829fac41edeff4e80dee.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_5f23ab233dde7797748f0192b675fc1e3b226a9a.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_33ba29fb1af3c1a0222655fb7a4538374ed16c8d.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_a4ed2cfce3399ad54d7e62fcc14b389a30b1a710.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_b34afd33fb45b2a0a520490d9db2d06548c05643.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_608338a390d33d0c2e66c98ce635a2819f186d00.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_284096c5555b02951315b01645b97d5f66507713.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_a8b23326895fe9c7333cc6c6ee30169f994345e6.1920x1080.jpg?t=1643574756,https://cdn.akamai.steamstatic.com/steam/apps/1871620/ss_baf897d7dc8e75043d201b79063b99f9fa768087.1920x1080.jpg?t=1643574756",
    "Slug": "covid-simulator",
    "Meta Title": "Covid Simulator: Jan 25, 2022, Coldrice Games LLC and Ful...",
    "Meta Description": "Looking for information on Covid Simulator? Check out the release date (Jan 25, 2022), developer insights from Coldrice Games LLC, and a complete game s...",
    "Alt Text Image": "Official header image for Covid Simulator game - Steam 1871620",
    "Canonical URL": "https://gusku.site/game/covid-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Covid Simulator\", \"description\": \"Looking for information on Covid Simulator? Check out the release date (Jan 25, 2022), developer insights from Coldrice Games LLC, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Coldrice Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Coldrice Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1871620/header.jpg?t=1643574756\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}