{
    "AppID": 1712890,
    "Name": "Desolation Tycoon",
    "Release date": "Jan 14, 2022",
    "About the game": "The world has ended, but life moves on. Your home is a wasteland scoured by winds blowing in from a caustic sea. Most large mammals are extinct, and insects have filled their roles. You are a merchant traveling this land in search of profit. Each character you play starts with a randomly generated history and traits. And eventually, each character's career will come to an end — whether through successful retirement or tragic death. The game remembers everything you do, and the world is persistent across characters. As a consequence of your actions, civilization will slowly grow and rebuild. Accomplishments accrued across any number of characters will unlock new cities, new crew units, new challenges, and so on. There is no fixed storyline. Instead, you have a setting, a set of gameplay mechanics, and complete freedom to do with that what you will. Core features: Travel, trade, and defend your cargo from dangers. Improve your skills through usage. Find and explore places that are worth plundering. Build relationships with city notables, and co-operate with them on various schemes. Rebuild a persistent world across multiple lifetimes. Make trade-offs in encounters that are purely decision-driven, and avoid grindy minigames. Enjoy a high-information user interface that doesn't ask you to remember things unnecessarily. Example challenges: Local climate calamities. Giant insects, bandits, and much worse. Each character will automatically retire if they live long enough; this does not leave enough time to develop all possible skills. Networks of supply and demand are randomized between playthroughs. You can't stay in a trade route rut, because trading with the same cities too much will make it less profitable. You and your crew can become injured or sick — and possibly die as a result. The locals that you trade and scheme with have minds of their own, and may betray you. Performance-enhancing symbiotes may seem like a great idea, but can lead to unfortunate side-effects. Oh, and there are also demons. They complicate everything. This is not an action-oriented game. Time doesn't pass unless you're doing something, and there are no real-time challenges. Instead, gameplay is strictly about the making of intelligent trade-offs in an open-world setting with many potential courses of action.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1712890/header.jpg?t=1653288506",
    "Price": 7.19,
    "Developers": "Iron Boar Labs Ltd.",
    "Publishers": "Iron Boar Labs Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_c21948e78d4566719d94ce0009e4c1f2b629dc14.1920x1080.jpg?t=1653288506,https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_81eccd9b4f0c11334bb5e29661387ccda37fc23b.1920x1080.jpg?t=1653288506,https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_2aae4214b2888e437842548df013927575bd485e.1920x1080.jpg?t=1653288506,https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_df2b1beb6263e88d905d2d6e53bfed6bd2f8c38d.1920x1080.jpg?t=1653288506,https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_6886bb2a325a32e1a2391da90dc7fee4c61794ed.1920x1080.jpg?t=1653288506,https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_289653859abd6f51c03361a44ba049c405a4eceb.1920x1080.jpg?t=1653288506,https://cdn.akamai.steamstatic.com/steam/apps/1712890/ss_a49e1bf8711c7c41fdb4983b59a6b197222abf4c.1920x1080.jpg?t=1653288506",
    "Slug": "desolation-tycoon",
    "Meta Title": "Desolation Tycoon: Jan 14, 2022, Iron Boar Labs Ltd. and ...",
    "Meta Description": "Looking for information on Desolation Tycoon? Check out the release date (Jan 14, 2022), developer insights from Iron Boar Labs Ltd., and a complete gam...",
    "Alt Text Image": "Official header image for Desolation Tycoon game - Steam 1712890",
    "Canonical URL": "https://gusku.site/game/desolation-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Desolation Tycoon\", \"description\": \"Looking for information on Desolation Tycoon? Check out the release date (Jan 14, 2022), developer insights from Iron Boar Labs Ltd., and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Iron Boar Labs Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Iron Boar Labs Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1712890/header.jpg?t=1653288506\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.19, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}