{
    "AppID": 315460,
    "Name": "Dig or Die",
    "Release date": "Jul 10, 2018",
    "About the game": "Explore, fight, craft and build your defenses! Enjoy a unique and innovative game: • Strategy : survive massive attacks each night by building strong walls and placing turrets wisely. • Physics : build wisely or your structures will collapse! And you will need them to defend your base, or build bridges and high towers to access remote locations. • Water cycle : rain, infiltration, underground rivers and lakes... be careful during the heavy rains, or you could be surprised by a sudden water level rise! You are a representative of the CRAFT &amp; Co company. You are selling automated fabrication tools across the galaxy when your spacecraft crashes into a hostile planet. Use the tools you sell and the local resources to build up all of what you'll need to survive and eventually be able to escape the planet. New content! • Play classic solo or multiplayer co-op , or try the custom game modes: Under the Sea (start in a cave under a huge ocean!), Sky World (a random world composed of hundreds of flying islands), or Base Defense (no exploration, only base building and defense). • Activate the Hazardous Events option to trigger various surprises like Meteor Shower, Rain Flood, Earthquake, Volcano Eruption or even a Sharkstorm! • Enjoy Creative Mode and produce all items for free. This includes cheated items and tools to modify terrain or even create water and lava! Gameplay: • Fun from the start : no awfully slow digging, so you can concentrate on the exploration, fights and strategy. • Game's final objective : you must build a rocket ship to escape the planet. • Strategy survival : the game is a survival game in a strategic meaning. No hunger needs, the whole point of the game is to survive to the massive attacks each night. And to do that, you will have to explore the world to gather resources and craft your defenses. Fights: • No swords, magic or flying clown monsters here! It's a consistent science-fiction world , with fast and fun laser guns fights! • Intelligent monsters : they will find the best path to attack your defenses. And be careful: even if they can't move through walls, they can still destroy them! • Difficulty progression : only the species of monsters you have already killed before attack during the night (they must have taken ill!). So you can progress at your own pace and choose when you are ready to move forward and fight stronger monsters. • AI companion : your crashed ship contains an AI that survived and will give you useful advices (or not!). Build him a drone so he can follow you and even help you fight the monsters! World Simulation: • Huge world with global real-time simulation of the environment, physics, water cycle and lighting. • Electricity : build solar panels or functional hydroelectric generators to power your base’s most advanced items! • Plants simulation : plants naturally grow and spread if their life-conditions are met. Create some farms with artificial sun lamps and irrigation. • Procedurally generated world : Major areas locations are specific to benefit from a logical game progression, but detailed layout of surface, caverns, ores, etc. are unique at each playthrough. Crafting and Building: • Crafting : You dig minerals, harvest plants and kill some monsters and bosses in order to craft better items and defenses. But the digging is really fast, your inventory space is infinite and all crafting recipes are displayed, so you don’t waste all your time on grinding or wikis and can concentrate on setting up better defenses. • Base construction : You build a fortress, not a holiday house. So you won't find hundreds of flowerpots or tapestries, but rather turrets, strong walls and useful machines. Remember the Starship Troopers or Aliens movies atmosphere!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/315460/header.jpg?t=1626875302",
    "Price": 11.99,
    "Developers": "Gaddy Games",
    "Publishers": "Gaddy Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_982f70514f19a51d057ca855f022ac930b0a30f2.1920x1080.jpg?t=1626875302,https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_720b1a407e2a52aa36de08ad96030e170cfd667f.1920x1080.jpg?t=1626875302,https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_291ce74978159d57f8ab9633c948b71cc8330dd5.1920x1080.jpg?t=1626875302,https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_99b9f7c2ad18e3c502599167c0266739411c1b01.1920x1080.jpg?t=1626875302,https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_f1aa10642c404e700d7357e8a8dd03454498970c.1920x1080.jpg?t=1626875302,https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_2b8fa3b685b5337c57261fee7b363db074a27b05.1920x1080.jpg?t=1626875302,https://cdn.akamai.steamstatic.com/steam/apps/315460/ss_58b48dcd9c8ef3d2759042448176bc30f492acce.1920x1080.jpg?t=1626875302",
    "Slug": "dig-or-die",
    "Meta Title": "Dig or Die: Jul 10, 2018, Gaddy Games and Full Overview",
    "Meta Description": "Looking for information on Dig or Die? Check out the release date (Jul 10, 2018), developer insights from Gaddy Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Dig or Die game - Steam 315460",
    "Canonical URL": "https://gusku.site/game/dig-or-die",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dig or Die\", \"description\": \"Looking for information on Dig or Die? Check out the release date (Jul 10, 2018), developer insights from Gaddy Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaddy Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaddy Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/315460/header.jpg?t=1626875302\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}