{
    "AppID": 1179190,
    "Name": "Dinodrifters",
    "Release date": "Dec 20, 2019",
    "About the game": "An adventure like no other! Discover the prehistoric world with DINODRIFTERS! Explore the ancient past as one of the Dinodrifters; a team of time-travelling rangers who protect prehistoric life from the evil Roguedrifters. Drift through every time period in earth’s history, from the arid plains of Wyoming to the frozen forests of Antarctica and beyond! Encounter a stunning myriad of creatures both great and small, including Tyrannosaurus, Liopleurodon, Gigantoraptor, Arthroplura and many more! Do you have what it takes to survive the most dangerous natural environments the world has ever seen? FREE MODE - play an animal, grow to adulthood, thrive and multiply PLAY AS A DINOSAUR Free Mode allows you to play as any animal in any of the time periods. Start as a hatchling and survive all the way to adulthood. Do you have what it takes to secure a mate and continue your progeny? EXPLOSION OF LIFE Meet the most famous and ferocious animals ever to walk, swim and soar across the earth! Dinosaurs, giant insects, sea scorpions, terror birds – a myriad of menaces await you! PREDATOR AND PREY The eternal conflict between predator and prey is an evolutionary arms race, with apex predators at the top of the food chain. These intelligent animals are capable of tracking you down and making you an easy meal. Beware! PORTALS THROUGH TIME Strange and powerful Time Anomalies can burst through at any moment, offering a way to another time and place. Take the plunge into a new world or wait for animals from another time to appear from the other side! STORY MODE - play a Dinodrifter, conduct missions into the past, save the world STORY-DRIVEN CAMPAIGN Create your own character and immerse yourself in a 21-episode story arc featuring unique missions and cutscenes, where your actions decide the fate of history both present and future. MASSIVE TIMELESS WORLDS Explore hand-crafted environments from every geological time period – from the Cambrian to the Jurassic to the Quaternary and beyond! Drift through frozen tundra, forests, deserts, deep oceans and azure skies across the timespan of the earth! RANGERS IN TIME As a Dinodrifter, use a suite of advanced gadgets to turn the natural order on its head! Use your Tranqchanger to change your Drifter suit and then tranquilise animals using powerful Drift Cards to sedate, placate and influence their actions. RUN A PREHISTORIC RESERVE Gather examples of prehistoric life and hold them in Blackhill Reserve! Earn reputation depending on how exciting your exhibits are to unlock new powerful Drift Cards! Drift into the past, define the future!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1179190/header.jpg?t=1577730665",
    "Price": 9.99,
    "Developers": "Jake Hugh Reece Wilson",
    "Publishers": "Trywelyn Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_19015026fc0d16f6ba13dafbb501e474f22c11d1.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_98607bb9181a0dd8f86dd02a3796720f4470f40c.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_1ce4f806563ff0c0d090314eb8507eb8fe9d7f13.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_449500467069964fa4cd30f32cf670d99b45c8c4.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_cf34f59a8e936f47cbec0cb0a5e1828f0d7c59e3.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_575cfd4fa17fed01aa4ed81231ac47a4ab732e8f.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_738c9f6e971528e3bc86c4d70fcf9a3f60460a5b.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_bfc4b1e6a0d879aeb4fe61edc488eb45e941ff9e.1920x1080.jpg?t=1577730665,https://cdn.akamai.steamstatic.com/steam/apps/1179190/ss_5019754044cb39f2c16e1b0975908bfb78f143fd.1920x1080.jpg?t=1577730665",
    "Slug": "dinodrifters",
    "Meta Title": "Dinodrifters: Dec 20, 2019, Jake Hugh Reece Wilson and Fu...",
    "Meta Description": "Looking for information on Dinodrifters? Check out the release date (Dec 20, 2019), developer insights from Jake Hugh Reece Wilson, and a complete game ...",
    "Alt Text Image": "Official header image for Dinodrifters game - Steam 1179190",
    "Canonical URL": "https://gusku.site/game/dinodrifters",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dinodrifters\", \"description\": \"Looking for information on Dinodrifters? Check out the release date (Dec 20, 2019), developer insights from Jake Hugh Reece Wilson, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jake Hugh Reece Wilson\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Trywelyn Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1179190/header.jpg?t=1577730665\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}