{
    "AppID": 1531540,
    "Name": "Distant Worlds 2",
    "Release date": "Mar 10, 2022",
    "About the game": "Distant Worlds Returns! Distant Worlds, the critically acclaimed 4X space strategy game is back with a brand new 64-bit engine, 3D graphics and a polished interface to begin an epic new Distant Worlds series with Distant Worlds 2. Distant Worlds 2 is a vast, pausable real-time 4X space strategy game. Experience the full depth and detail of turn-based strategy, but with the simplicity and ease of real-time, and on the scale of a massively-multiplayer online game. The Universe is Yours! Huge Galaxies with up to 2,000 star systems and tens of thousands of planets, moons and asteroids are yours to explore and exploit, whether peacefully through mining and diplomacy or by conquest! The complex process of generating a galaxy ensures that every new game will be different and the many galaxy setup options ensure incredible replayability as well as the ability to have your game be just the way you like it. Galaxies are so deep, fun and immersive that you won’t want to finish the game. Choose from seven playable base game factions which cover a wide variety of playstyles. Build, expand and improve your empire while playing through the storylines, with victory conditions or in an open-ended sandbox mode. Each galaxy is packed with life and activity. Encounter other empires, independent alien colonies, traders, pirates and space monsters. Explore star systems, asteroid fields, galactic storms and black holes. Discover evidence of civilizations long since past, uncovering secrets about the galaxy's troubled history... Intelligent automation allows you to tailor the game to your preferred playstyle and scale. Decide how much you want to control and which gameplay areas suit you best. You can limit your focus to just one ship or expand it all the way up to everything in a vast galactic empire. Let your advisors and the intelligent automation handle the rest! A Built-in Game Editor allows you to fine-tune your own galaxy, adding or removing star systems, planets, asteroids, ships, star bases, space monsters or anything else. Modify the attributes of any empire in your game for the ultimate custom experience. Extensive In-Game Help is included. Exhaustive, built-in, context-sensitive help is always only a single key-press away. Press F1 at any time for a detailed explanation of the current game screen, your currently selected item, and so on, or just browse the complete “Galactopedia” Tutorials are included to quickly familiarize you with all of the game elements and tools. Best of all, these all combine to let you play the game your way: enjoy a quick, intense game in a crowded sector of space or take your time in an epic game spread across a vast galaxy!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1531540/header.jpg?t=1646986506",
    "Price": 49.99,
    "Developers": "CodeForce",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_24eedfbaf9793473aab3f4369b59c8b2316d71bd.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_e4713de8a0a0f6ff36e947d600eb223110b9734b.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_1884992531d264341a4cb6712d611a5fec6c484c.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_9b9f6f222324310ff0e18ff28f375fb479a4129f.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_044feb7af4f75b775fe95480132810457f97a63f.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_d8de8b1b9f7fe55bfc418188b5656ee9cd5e4a65.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_18c695c18d3833413c900fddb2702bf8e26d6816.1920x1080.jpg?t=1646986506,https://cdn.akamai.steamstatic.com/steam/apps/1531540/ss_8e74d74752916f97ae2f3224685cf8621407dcb0.1920x1080.jpg?t=1646986506",
    "Slug": "distant-worlds-2",
    "Meta Title": "Distant Worlds 2: Mar 10, 2022, CodeForce and Full Overview",
    "Meta Description": "Looking for information on Distant Worlds 2? Check out the release date (Mar 10, 2022), developer insights from CodeForce, and a complete game summary.",
    "Alt Text Image": "Official header image for Distant Worlds 2 game - Steam 1531540",
    "Canonical URL": "https://gusku.site/game/distant-worlds-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Distant Worlds 2\", \"description\": \"Looking for information on Distant Worlds 2? Check out the release date (Mar 10, 2022), developer insights from CodeForce, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CodeForce\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1531540/header.jpg?t=1646986506\", \"offers\": {\"@type\": \"Offer\", \"price\": 49.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}