{
    "AppID": 585990,
    "Name": "Echoes of the Fey Episode 0: The Immolation",
    "Release date": "Feb 7, 2017",
    "About the game": "Imagine being the only survivor of an explosion that kills thousands of people. That is the fate of Sofya Rykov. And survival is just the beginning of her tale... *** NOTE: This game uses 3D graphics and lighting. Please check Minimum Specifications before playing to ensure a good experience *** Episode 0: The Immolation is a free, standalone chapter in the Echoes of the Fey adventure game/visual novel series. This installment will serve as an introduction to players new to the series and provide important backstory to players who enjoyed Echoes of the Fey Episode 1: The Fox's Trail, already released on Steam. Play as Sofya Rykov, before she became a private investigator and before she was cursed with unstable magic powers. An officer in the Imperial Army, Sofya is tasked with guarding Leshin prisoners at Onigrad, a city which will soon become famous for its fiery destruction. 3d environments and dynamic camera angles via our new UE4 implementation English voice acting (expression lines) Over 1 hour of story with multiple choice branches Soundtrack featuring new songs and remixes of Episode 1 tracks reflecting the dread of the Immolation of Onigrad A free introduction to a series which will span multiple episodes Achievements and trading cards In the last days of the long war between Humans and Leshin, a tense stalemate has emerged. For years, Leshin have lain siege to the Humans over their use of Fey reactors, massive machines that draw electricity from the realm of magic. Both sides tire after almost thirty years of war, and perhaps peace is now in reach. But Leshin extremists, desperate for a victory to reclaim their power among the people, are about to stage a devastating attack that will change the world forever. Echoes of the Fey is a series of detective stories set in the high fantasy world of Oraz. Episode 0: The Immolation takes place before the protagonist, Sofya Rykov, becomes a private investigator. She is an officer in the Imperial Human army who believes she has secured a safe position as a prison guard in the metropolitan city of Onigrad. One fateful night, one of the Leshin assigned to her begins to act strangely. And then a massive boom rings out from the Onigrad Fey reactor... Episode 0 is an adventure game/visual novel with dialog trees and several choices for Sofya that will affect the way the story plays out. Sofya will also be able to walk around the prison and learn more about the world from her prisoners, though with an impending disaster about to hit the prison, she will have to balance how to use her time before staging her escape.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/585990/header.jpg?t=1582841184",
    "Price": 0.0,
    "Developers": "Woodsy Studio",
    "Publishers": "Woodsy Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/585990/ss_a6c21c3b739e05c35ce8d8108c805e3ad50a80e4.1920x1080.jpg?t=1582841184,https://cdn.akamai.steamstatic.com/steam/apps/585990/ss_5042478ab23ab561b068c4e8616fd7a66f73598b.1920x1080.jpg?t=1582841184,https://cdn.akamai.steamstatic.com/steam/apps/585990/ss_f145faae4aa51454d75fd7fc0c162e73d3055f26.1920x1080.jpg?t=1582841184,https://cdn.akamai.steamstatic.com/steam/apps/585990/ss_732a5f71dd0f4076aad39acb506588e476569fd3.1920x1080.jpg?t=1582841184,https://cdn.akamai.steamstatic.com/steam/apps/585990/ss_2a501fe431dadcbb8e7a151aae394d358d90906e.1920x1080.jpg?t=1582841184",
    "Slug": "echoes-of-the-fey-episode-0-the-immolation",
    "Meta Title": "Echoes of the Fey Episode 0: The Immolation: Feb 7, 2017,...",
    "Meta Description": "Looking for information on Echoes of the Fey Episode 0: The Immolation? Check out the release date (Feb 7, 2017), developer insights from Woodsy Studio,...",
    "Alt Text Image": "Official header image for Echoes of the Fey Episode 0: The Immolation game - Steam 585990",
    "Canonical URL": "https://gusku.site/game/echoes-of-the-fey-episode-0-the-immolation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Echoes of the Fey Episode 0: The Immolation\", \"description\": \"Looking for information on Echoes of the Fey Episode 0: The Immolation? Check out the release date (Feb 7, 2017), developer insights from Woodsy Studio,...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Woodsy Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Woodsy Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/585990/header.jpg?t=1582841184\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}