{
    "AppID": 1462040,
    "Name": "FINAL FANTASY VII REMAKE INTERGRADE",
    "Release date": "Jun 17, 2022",
    "About the game": "FINAL FANTASY VII REMAKE is a bold reimagining of the original FINAL FANTASY VII, originally released in 1997, developed under the guidance of the original key developers. This critically-acclaimed game, which mixes traditional command-based combat and real-time action, makes its Steam debut along with FF7R EPISODE INTERmission─a new story arc featuring Yuffie Kisaragi. ■STORY By exploiting mako, the life-blood of the planet, through their mako reactors, the Shinra Electric Power Company has all but seized control of the entire world. A ragtag group of idealists, known as Avalanche, are one of the last bastions of resistance. Cloud, an elite SOLDIER operative-turned-mercenary takes part in an Avalanche operation to destroy Mako Reactor 1 in the city of Midgar. The bombing plunges the city into fiery chaos, and Cloud is tormented by visions of a bitter enemy long thought dead. Once more begins a story that will shape the destiny of an entire world. * This game is a remake of FINAL FANTASY VII, first released in 1997. The first title in a multi-part series, it is based on the story from the original game, up to the escape from Midgar, adding in new elements. ■FF7R EPISODE INTERmission (New episode featuring Yuffie Kisaragi) FF7R EPISODE INTERmission is a brand-new adventure in the world of FINAL FANTASY VII REMAKE INTERGRADE. Play as Wutaian ninja Yuffie Kisaragi as she infiltrates Midgar and conspires with Avalanche HQ to steal the ultimate materia from the Shinra Electric Power Company. ■Content included in this product FINAL FANTASY VII REMAKE INTERGRADE contains the following content: - FINAL FANTASY VII REMAKE full game - DLC 'FF7R EPISODE INTERmission' (New episode featuring Yuffie Kisaragi) - Weapon: Cacstar - Armor: Midgar Bangle - Armor: Shinra Bangle - Armor: Corneo Armlet - Accessory: Superstar Belt - Accessory: Mako Crystal - Accessory: Seraphic Earrings - Summon materia: Carbuncle - Summon materia: Chocobo Chick - Summon materia: Cactuar *The additional weapons, armor, accessories and summon materia can be obtained from the Gift Box on the main menu. *The weapon 'Cacstar' can only be used in FF7R EPISODE INTERmission (Yuffie episode)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1462040/header.jpg?t=1655449232",
    "Price": 69.99,
    "Developers": "Square Enix",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1462040/ss_20a352a2c20dd4bfb08fa131dc4c2e763510f584.1920x1080.jpg?t=1655449232,https://cdn.akamai.steamstatic.com/steam/apps/1462040/ss_55903e74751601e42fb7f858d5c07ec048386ce2.1920x1080.jpg?t=1655449232,https://cdn.akamai.steamstatic.com/steam/apps/1462040/ss_ac55306d00923f2902de20bb5ade7f9cc190e8cf.1920x1080.jpg?t=1655449232,https://cdn.akamai.steamstatic.com/steam/apps/1462040/ss_6e30290a5de36f3274a11bd6c78f077c9e489115.1920x1080.jpg?t=1655449232,https://cdn.akamai.steamstatic.com/steam/apps/1462040/ss_170c616f08812827d70ac2d9099447a52e114546.1920x1080.jpg?t=1655449232",
    "Slug": "final-fantasy-vii-remake-intergrade",
    "Meta Title": "FINAL FANTASY VII REMAKE INTERGRADE: Jun 17, 2022, Square...",
    "Meta Description": "Looking for information on FINAL FANTASY VII REMAKE INTERGRADE? Check out the release date (Jun 17, 2022), developer insights from Square Enix, and a co...",
    "Alt Text Image": "Official header image for FINAL FANTASY VII REMAKE INTERGRADE game - Steam 1462040",
    "Canonical URL": "https://gusku.site/game/final-fantasy-vii-remake-intergrade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FINAL FANTASY VII REMAKE INTERGRADE\", \"description\": \"Looking for information on FINAL FANTASY VII REMAKE INTERGRADE? Check out the release date (Jun 17, 2022), developer insights from Square Enix, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1462040/header.jpg?t=1655449232\", \"offers\": {\"@type\": \"Offer\", \"price\": 69.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}