{
    "AppID": 1501440,
    "Name": "Fritz & Chesster - Learn to Play Chess Vol. 1",
    "Release date": "Feb 8, 2021",
    "About the game": "Learn to think strategically, try out tricky mental exercises and master fun and exciting challenges – all with a generous helping of chess knowledge. These things and more await you on this unusual chess adventure that has already received great international acclaim. Start playing Fritz &amp; Chesster Volume 1 and join Prince Fritz and his cousin Bianca on their journey through the rules of chess and many tactical motifs. Once upon a time there was a small country, a very, very small country. And this very small country was ruled by a very wise king. In fact he was the wisest King there had ever been. And he was called 'King White' This is the beginning of a very interesting new product by ChessBase: Fritz &amp; Chesster. It is possibly also the most important piece of software created by the company, for a very simple reason. Like none of the other products, Fritz, Junior, Shredder, or even ChessBase itself, Fritz and Chesster is one that can recruit new players to the game. We predict that tens of thousands of children will take up chess because they had access to this program. Fritz and Chesster does not teach chess in the usual way. It does not set up a board and explain how each of the pieces move. Instead it targets children who have never played chess before in their lives and teaches them the basic rules in a Sesame Street like environment. There are cartoons and stories for the children to follow, and then there are tasks for them to solve interactively. Oh ye, Oh ye, Oh ye! Listen all young heroes well Whom the chess game doth compel: Aspiring masters of the game Come and enter here your name Then I beg click on the seal The world of chess awaits your zeal Each piece and each rule is explained in a subgame, which you can play against the computer. Many of them are far away from the actual game of chess, but at the same time they give the children full insight into the sometimes daunting rules of the game. Take for instance the first sequence. Young Prince Fritz has to stand in for a while for his father, King White. Together with his cousin Bianca Fritz embarks on a journey through their kingdom. On their journey they are joined by Kalaidoscope, a jolly instructor, who tells them all about the kingdom. In each scene the children can click different elements, like the mouse traps in the above picture, funny things happen. It encourages the young users to explore the scenery. On their trip around the kingdom the three encounter the daunting King Black, who challenges them to a game of chess. But Fritz doesn't know how to play. Thankfully he is able to learn the game on the rest of his trip. The first lesson comes when they see two sumo wrestlers fighting in a ring. The wrestlers are too fat to approach each other directly, so they always stay at least one square apart. They move around the board blocking each other off. If they do it properly Fritz and Bianca can push their opponent off the board. After that they try to occupy chairs before their opponent, and while trying to do so the program explains how they can use 'opposition' to outwit the opponent. At the end of this lesson the children have learnt everything they need to know about the king move, including the concept of opposition. Learning the rook moves is equally entertaining. In a pacman-like game the children learn to move the rook and avoid capture by the enemy spiders. There are sound effects and high-score lists to keep their attention. The bishop move is learnt by bouncing a ball off a rectangular paddle to destroy toilet bowls (the kind of thing young children find hilarious). Since the ball moves diagonally they are learning to operate the bishop. Mind you, these games might also create some problems. Very often the parents start to play them and compete against their offspring. There can be ugly scenes when it turns out, as it usually does, that the children are better. The stand-alone chess teacher The principle of Fritz &amp; Chesster is that you can insert the CD into a computer drive, fire up the program and then leave a child alone with it if necessary. After a few weeks the child will come to you and say: 'Can we play a game of chess?' It will have learnt all the rule – we are talking pawn moves, castling rules, promotion, mate, stalemate, everything – and even understand a bit about strategy and tactics. Naturally you do not need to or indeed should leave your child alone with the program. In fact we have discovered that it is often usually children and their mothers who pick up the game. The fathers usually get hooked on the subgames, battling to keep ahead of the kids. More Images of the game",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1501440/header.jpg?t=1612771799",
    "Price": 24.99,
    "Developers": "ChessBase GmbH",
    "Publishers": "ChessBase GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_7dd8137054af41c6605d48530a845181802ced9b.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_39ce4e0a98643f23b178759d33717dd285b175bd.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_06af4235825a6623199f24c86a2c75dc4dfdf731.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_b979be67067e62bf57e85cf3256fcd0fe95b9b8c.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_b75e614184df6fb31e1a4ba525204f6d5969f281.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_25392064aee5980cb9f9443c1d3dbc6e0601eb54.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_f8a99d0ac5f3aa66c5a518f66a5817dbe3b7341c.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_2f67d0011b6761c7ae03736d1897982e09d877b8.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_c5d29f4dc8d2db058262911409f04f1dbf88fbc0.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_0c83355102d88dd6cbd401a184d5cf2f89da5e45.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_c9c7ff1d171aae99f68f0fdfc01da12c5679bf7c.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_ddf097aa502dd7bf490bb9c9474bd236c3b0e45e.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_29d472f499f76608fc8cdfb1e9778c7e9c894ce8.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_a6d2b33f99e3a23a2a69cc266fa669ab522401d2.1920x1080.jpg?t=1612771799,https://cdn.akamai.steamstatic.com/steam/apps/1501440/ss_2c35dcd59d4065bc021559905519fb25d898dd40.1920x1080.jpg?t=1612771799",
    "Slug": "fritz-chesster-learn-to-play-chess-vol-1",
    "Meta Title": "Fritz & Chesster - Learn to Play Chess Vol. 1: Feb 8, 202...",
    "Meta Description": "Looking for information on Fritz & Chesster - Learn to Play Chess Vol. 1? Check out the release date (Feb 8, 2021), developer insights from ChessBase Gm...",
    "Alt Text Image": "Official header image for Fritz & Chesster - Learn to Play Chess Vol. 1 game - Steam 1501440",
    "Canonical URL": "https://gusku.site/game/fritz-chesster-learn-to-play-chess-vol-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fritz & Chesster - Learn to Play Chess Vol. 1\", \"description\": \"Looking for information on Fritz & Chesster - Learn to Play Chess Vol. 1? Check out the release date (Feb 8, 2021), developer insights from ChessBase Gm...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"ChessBase GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ChessBase GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1501440/header.jpg?t=1612771799\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}