{
    "AppID": 644710,
    "Name": "Gary Grigsby's War in the West",
    "Release date": "Aug 3, 2017",
    "About the game": "Gary Grigsby’s War in the West is the most ambitious and detailed computer wargame on the Western Front of World War II ever made. Starting with the Summer 1943 invasions of Sicily and Italy and proceeding through the invasions of France and the drive into Germany, War in the West brings you all the Allied campaigns in Western Europe and the capability to re-fight the Western Front according to your plan. Thousands of feet above the battles on the ground, War in the West also covers the air war and the Allied strategic bombing campaign. Based on the War in the East engine with years of additional major features and improvements, War in the West provides players the chance to pick alternative strategies in both the land and air parts of the war. There is also an East Front Control option and tracking of the front line and the entire order of battle in the East for German players that wish to make the strategic decisions on how to balance their forces between the Western and Eastern Fronts. With a new, highly accurate map of Europe, an incredibly detailed order of battle down to each squad, vehicle and plane, a very realistic logistics system (including rail usage, depots, trucks, ports and realistic interdiction), full modeling of the air as well as ground wars and a weather system that tracks and models individual weather fronts as they move across the map, War in the West is the new definitive wargame of the Western Front. Main Features Map - Huge size (36k hexes versus 25k for War in the East) - All the terrain types from War in the East, plus new terrain types for bocage, tundra, desert, sand, escarpment/impassable, and ferries - Road Quality by Country impacts weather effects - Improved weather graphics showing all effects on the map in each hex; ground, air and water (ice) - Improved map projection that minimizes map distortion effects caused by using a flat map for a round world - The map is built as a part of an enormous War in Europe map which is 378x355 hexes, a building block to a future 'mega unprecedented scale' game (134k hexes) Air War - Comprehensive new air game with a separate air resolution phase - Fixed airfields on map with additional construction possible - Each Air Force HQ is given Air Directives which are used to generate missions - Six Air Directives types - Ground Support - Ground Attack - Strategic Bombing - Air Recon - Air Superiority - Naval Patrol - Seven Ground Attack target types that are prioritized by the player - Ground Units – Airfields – Railway – Railyards – Ports – Ferries - General Interdiction (interdiction of units, reserves and resupply) - Strategic Bombing can prioritize between 14 target types - Tracking of pilots - Level of player involvement can be tailored by use of Auto Air Direction Creation screen to quickly generate Air Directives based on top level priorities - Air Doctrine screens allow quick adjustment to standard mission profiles, as well as control over pilot training Logistics - Rail usage tracked per hex w/congestion on tracks restricting troop and supply movements - Railyard location and capacity impacts total rail capacity and load/unload costs for units - On map depot system simulates need to stockpile freight near the front, especially if vehicle constrained. - Airpower can restrict/damage freight via bombing rail and/or railyards or by using interdiction to intercept supplies moving to/from depots. - Supply priorities can be adjusted by HQ (and depot) to allow player direction of limited resources. Weather - 8 Weather Zones, Weather Fronts and per hex weather conditions at a higher resolution than War in the East - 6 Ground Conditions impacting ground unit movement and combat - 6 Air Conditions impacting flying conditions and water and snow levels on the ground - Ice Conditions in Rivers - Weather determined by a combination of weather zones and 5 possible weather fronts that move across the map, with water/mud and snow levels tracked dynamically in each hex Axis Garrisons - Garrison Regions - requires minimum garrisons in combat value of troops – changes over time and with major events. - Garrison Cities - requires security units and a large garrison – also changes over time - Not fulfilling garrison requirements will increase partisan attacks on rail in the area as well as costing substantial victory points East Front Control Option (For Long Campaigns) - East Front Screen provides info on German forces, front line and Soviet offensive potential - Units may be moved between fronts. Player chooses which if any German units on the East Front are pulled back to refit. - Soviet controlled hexes are shown on the map - When using EFC Option, game ends when Berlin falls or can last until the beginning of August 1945. When not using the EFC Option the game ends in early May 1945 (or earlier if Allies capture Berlin) and movement of units between fronts is based on historical movements. Amphibious and Airborne Landing Rules - Amphibious and Airborne Prep Points and Target Hexes - Airpower Impact on Naval Movement - Amphibious HQs with Naval Support, Temporary Ports and Mulberry Harbors - Commando and Ranger supporting landings - Separate Amphibious and supporting airborne landing phase at start of other player’s turn - Coordinated airborne landings with non-amphibious forces during own turn - Multi-role support units that can switch between off-map support and on map unit status - Large Multi-role units divide into 3 parts when made support units (break brigade/regiment into 3 battalions) - Support ranger and commando units have special amphibious abilities Victory Conditions - Factors Considered in Campaign Victory Conditions - Cities Controlled Each Turn - Damage From Allied Strategic Bombing - Partisan Activity (failure of Axis to garrison) - Allied Casualties - Failure To Achieve Italian and French Beachheads - Political Targets (U-boat and V-weapon factories and V-weapon launch sites) East Front Progress (when EFC Option is in use) - Timing of Fall of Berlin Artificial Intelligence - AI manages not only tactical and operational decisions, but also strategic decisions involving different invasion locations and strategies - AI can be used to assist the player in creation of Air Force Directives based on player selection of target priorities Multiplayer - Updated PBEM++ implementation w/improved game information interface",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/644710/header.jpg?t=1605627017",
    "Price": 79.99,
    "Developers": "2by3 Games",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_ff3104c3e2c573104188d1efbc2e8056e0ee4554.1920x1080.jpg?t=1605627017,https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_3b559473104e37e99d90d0799b76792c9dcc4232.1920x1080.jpg?t=1605627017,https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_beed631f8e5cac8b7533d3564abec047de03d7f7.1920x1080.jpg?t=1605627017,https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_540d6164fd3efabd91a2ede67070f0f709b95416.1920x1080.jpg?t=1605627017,https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_a7c6312230ea1b26f7bdef1ed62671624a6f5990.1920x1080.jpg?t=1605627017,https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_c7a6017ecf34bd1f8a17872618301cbee2d3e282.1920x1080.jpg?t=1605627017,https://cdn.akamai.steamstatic.com/steam/apps/644710/ss_3942a08fb3de611bda5d40ff6d9f56552036892e.1920x1080.jpg?t=1605627017",
    "Slug": "gary-grigsby-s-war-in-the-west",
    "Meta Title": "Gary Grigsby's War in the West: Aug 3, 2017, 2by3 Games a...",
    "Meta Description": "Looking for information on Gary Grigsby's War in the West? Check out the release date (Aug 3, 2017), developer insights from 2by3 Games, and a complete ...",
    "Alt Text Image": "Official header image for Gary Grigsby's War in the West game - Steam 644710",
    "Canonical URL": "https://gusku.site/game/gary-grigsby-s-war-in-the-west",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gary Grigsby's War in the West\", \"description\": \"Looking for information on Gary Grigsby's War in the West? Check out the release date (Aug 3, 2017), developer insights from 2by3 Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"2by3 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/644710/header.jpg?t=1605627017\", \"offers\": {\"@type\": \"Offer\", \"price\": 79.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}