{
    "AppID": 558260,
    "Name": "Gravel",
    "Release date": "Feb 27, 2018",
    "About the game": "GRAVEL: THE ULTIMATE OFF-ROAD EXPERIENCE! Gravel is the ultimate off-road experience. The most extreme racing game that will let you try out amazing stunts in the wildest places on the planet! Pure fun, spectacular scenery and no-holds barred competition where each race will turn into a memorable battle! Take part in the wildest show on the Gravel Channel web TV, travel around the world to discover the wide variety of environments and be amazed by the visually impressive quality! Enjoy four different disciplines – Cross Country, Wild Rush, Stadium and Speed cross – to live the driving experience with the most extreme vehicles on any type of terrain. MAIN FEATURES A COMPLETE OFF-ROAD EXPERIENCE Take a tour around the world to discover the range of extreme and wild environments that will offer you a fully off-road experience. There are four disciplines where you can compete with the most powerful cars. Cross Country: Huge areas with different layouts, perfect for competing in checkpoint races in the most evocative landscapes. Run through a waterfall with the aurora borealis as backdrop or try the right grip in the largest deserts in the world. Wild Rush: The wildest locations where you can compete in lap races. Unique environments with natural obstacles that will force you to race your way through the slopes of a mountain, on paradise islands, and through masses of debris and quarry rocks. Speed Cross: Races set in the most beautiful tracks in the world. Real-world tracks, from Europe to America, where you can show your skills in incredible jumps and chicanes. Stadium: Real and fictional arenas, full of jumps and spectacular layouts! FUN AND REWARDING Fun and excitement are the main rules! Gravel is adrenaline, pure fun, spectacle. The game's physics is accessible and immediate and allows you to express all your driving skills and boldness during each competition. Hair-raising bends, tussles, extreme jumps and treacherous terrain for an always different and increasingly dangerous gameplay experience. There are many offline and online game modes that let you compete against human opponents! ON AIR ON GRAVEL CHANNEL Meet the off-road Masters and find your way on the wildest show on TV at Gravel Channel! Six episodes broadcast from the most extreme and wildest corners of the planet to win the title of World Champion. The Masters of the several disciplines in the game will challenge you in head-to-head races to determine who really is the best. And when the championship is over, the challenge is still not complete: take part in the final race to become an Off-Road Master. Only after beating the current titleholder you can step on the podium and raise the cup to the sky! So turn on the TV and enjoy the first episode!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/558260/header.jpg?t=1589789427",
    "Price": 29.99,
    "Developers": "Milestone S.r.l.",
    "Publishers": "Milestone S.r.l.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_ce54ccb50c9c2d3c81743f440d33b71c699dc01e.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_cdf6728082ca9514cec508fef2e8b7af52953f59.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_cd4d9d65f1b76485122a93ec43c60ac53930431a.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_5ab349d4f09929b6062fc857b850e152455bbe7f.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_0e397c474a5a1f13c2bac2a24d812c0b3faddc74.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_7c3cdd22909d5d4ca87f8a3d23a29421b74e554c.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_8ea972f060ae8655f8930c17f444ea541313c724.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_90da5506a017eb36251d25a4d34339e6e1613955.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_0962fe17b4aea388a88b3da8e4daa8cc52af4dd6.1920x1080.jpg?t=1589789427,https://cdn.akamai.steamstatic.com/steam/apps/558260/ss_22edf69560ed3deb9dac2ad59ffdf35960ba5189.1920x1080.jpg?t=1589789427",
    "Slug": "gravel",
    "Meta Title": "Gravel: Feb 27, 2018, Milestone S.r.l. and Full Overview",
    "Meta Description": "Looking for information on Gravel? Check out the release date (Feb 27, 2018), developer insights from Milestone S.r.l., and a complete game summary.",
    "Alt Text Image": "Official header image for Gravel game - Steam 558260",
    "Canonical URL": "https://gusku.site/game/gravel",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gravel\", \"description\": \"Looking for information on Gravel? Check out the release date (Feb 27, 2018), developer insights from Milestone S.r.l., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Milestone S.r.l.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Milestone S.r.l.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/558260/header.jpg?t=1589789427\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}