{
    "AppID": 1762520,
    "Name": "Guardians of Greenheart",
    "Release date": "Oct 16, 2021",
    "About the game": "Ten thousand years ago, the Great Forest called Greenheart took root in the world. Under the combined stewardship of Elves and forest spirits, the woods and meadows blossomed into incredible life. However, the mysterious magical power of the forest has drawn the most brutal demons to it. And an invasion occurred at Greenheart led by the Demon Lord Alrolloth. However, the forces of the Demon Lord Alrolloth were unable to defeat the Guardians of Greenheart. After this bitter defeat, Alrolloth returned to the hell where he was born and waited for revenge. With each passing day, the hatred in him grew bigger and bigger, and he nurtured that hatred into a loathsome force within himself. And hope came to Alrolloth when he discovered the Orcs. With his demonic powers, he tempts the Orcs to become the most bloodthirsty warriors and serve his legion. After ten thousand years of waiting, the Demon Lord Alrolloth and his bloodthirsty Orc warriors have returned to Greenheart. Realizing the superior strength of Alrolloth and his legion, the Guardians of Greenheart contacted the knights of the Kingdom of Lusnistan to seek help. However, with a force of mighty Orc warriors and help from the Demons of Hell, the fall of the Great Forest Greenheart is only a matter of time. Prepare yourself when coming to Greenheart. Where you have to fight against the most powerful monsters, with each boss is a real challenge for you. In addition to the best equipment for your characters, you must master the great skills of your characters, use the right skills at the right time of the battle to be able to win these difficult bosses. Now let's go and fight against the invaders to protect Greenheart. FEATURES: Intriguing Storyline. Female Protagonist. In-depth Battle System. Beautiful Graphics. Attractive Gameplay. High Difficulty. Diverse and Attractive Skill System. Lyraesel - Archer Lyraesel is the ranger captain at Greenheart. Her main task is to patrol and protect Greenheart's safety from trespassers. Hiding in the dense bushes, aiming at her enemies with precision, she fired arrows sharper than knives at a speed faster than the wind that pierced the weak hearts of her enemies. In addition to her superb archery skills, Lyraesel was also known as a brilliant commander and dedicated trainer. Under her command are other elite rangers with excellent archery skills just like her. Ygannea - Assassin Born and raised in Greenheart, Ygannea trained to be a master assassin. Her main mission is to assassinate the leaders who intend to invade Greenheart. From the darkness, she appeared and attacked the enemy with a speed faster than the wind, causing the enemy to die without knowing what had happened. Not only that, she is also a master at making poisons. From the seemingly harmless flowers in Greenheart, she researched and extracted the scents from those flowers to create potions with many different uses. With her rare talent, Ygannea is tasked with finding and training other talented elves to become master assassins like her. Selena - Warrior Selena is the Champion of the kingdom of Lusnistan. Since childhood, she has always been ridiculed by her friends because of her short height. However, instead of being embarrassed, she responded to the ridicule with punches that bruised their eyes. With her unrivaled strength, she proved to everyone that height isn't everything. Steadfast and brave, Selena wanted something more out of life and left her home in search of something greater. She went around and won tournament after tournament, bringing in huge amounts of wealth and fame. Realizing Selena's rare talent, the Queen trusted her and gave her the honor of becoming the Champion of the kingdom of Lusnistan. Elissa - Knight Elissa is the Grand Marshal of the kingdom of Lusnistan. Born into a noble family, from a young age, she was well trained to be a talented leader. With ingenious leadership and iron will, she defeated the most powerful enemies to bring glory to the kingdom of Lusnistan. Seeing her as a major obstacle in the invasion of Lusnistan, an orc chieftain named Khargol secretly contacted the assassins' guild and offered an irresistible reward for Elissa's life. During a campaign against an invasion of the Orcs, a group of assassins sneaked into Elissa's camp to assassinate her. However, to assassinate a Grand Marshal like Elissa is not easy, alarm bells rang, all soldiers gathered and killed the assassins. But it didn't stop there, when the attention of the guards was all on the assassins, Orc warriors from all sides appeared and attacked Elissa's camp. After this crushing defeat, she was demoted by Queen Elysabeth to become a commoner. However, not long after that, the invasion of the Dark Legion caused the kingdom of Lusnistan to fall. Five years later, Alice and Laria defeated the Dark Legion and revived the kingdom of Lusnistan. After becoming queen, Alice sought out Elissa and invited her back to the kingdom to serve the never-ending war with the Orc warriors. Solara - Fairy Knight Solara is one of the most prominent fairies at Greenheart. Contrary to other fairies who are always associated with peace, Solara was born to be a Fairy Knight. After growing up, she was entrusted with the responsibility of protecting Greenheart and she fought relentlessly to protect the peace in Greenheart. Ruby - Nature Prophet Born and raised in Greenheart, Ruby understands nature more than anyone. With her intelligence and sociability, she becomes friends with all creatures she meets. However, she is not weak, she is ready to fight anyone who destroys her homeland. She can do everything that no one can imagine to protect Greenheart.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1762520/header.jpg?t=1634391717",
    "Price": 7.99,
    "Developers": "Silver Cloud Games",
    "Publishers": "Silver Cloud Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_3b17b48a31ef5344039e8cb12454e53a00d76b9f.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_727861a7a29f3c2088976ed88ced52e282f3f10d.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_f738dce5789e7b37aee3143fe49ea274071e1d31.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_5f70c0d2c6b19a3497be813d15748b5c3b3d72fc.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_eaff5e288ef639aad78c2be3c29d9f2ffdf634a5.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_8f6ee363da9c202ef938a64933b8477f1cc69921.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_91a0b3c6d9bc34221f211333f621c5158210e17d.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_f2e21cc8b5fd991cb4d3bc68765e8c97ab23be90.1920x1080.jpg?t=1634391717,https://cdn.akamai.steamstatic.com/steam/apps/1762520/ss_5b81e3ae18898ed5b254a7dcb8d2932efda021ec.1920x1080.jpg?t=1634391717",
    "Slug": "guardians-of-greenheart",
    "Meta Title": "Guardians of Greenheart: Oct 16, 2021, Silver Cloud Games...",
    "Meta Description": "Looking for information on Guardians of Greenheart? Check out the release date (Oct 16, 2021), developer insights from Silver Cloud Games, and a complet...",
    "Alt Text Image": "Official header image for Guardians of Greenheart game - Steam 1762520",
    "Canonical URL": "https://gusku.site/game/guardians-of-greenheart",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Guardians of Greenheart\", \"description\": \"Looking for information on Guardians of Greenheart? Check out the release date (Oct 16, 2021), developer insights from Silver Cloud Games, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Silver Cloud Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Silver Cloud Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1762520/header.jpg?t=1634391717\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}