{
    "AppID": 1181650,
    "Name": "Have a Blast",
    "Release date": "Aug 26, 2021",
    "About the game": "INTRODUCTION Have a Blast is a high energy, kinetic, multiplayer party game. Battle through the most ridiculously hazardous corners of the galaxy and use your surroundings to your advantage. Outmaneuver your frenemies and shatter them into colorful bits. ARENAS Battle around the galaxy in fifteen arenas, with new ones coming. Classic asteroids, icy comets, mythical monsters, curious contraption, it is all there for you to chart a route before the match. Each arena puts you in perils, which you can turn into opportunities and use to your advantage SHIPS All the ships in Have a Blast are small and nimble, enabling you to navigate the busy arenas. Each of the five ships has a unique powerful ability, requiring a slightly different approach. But even the strongest attacks can be countered, and it is never too late to turn the tide of battle to your side. GAME MODES Deathmatch – Last pilot standing wins the round in this familiar mode. Be the first to win five rounds and you win the match. Team match – Any combination of players is possible in a team vs team play. Great opportunity to reinforce some friendships and ruin others. Mothership – Keep your mothership safe and it will provide you with health, ammo and some refuge. Lose your mothership and you’ll be toast very soon. Challenges - Try every ship and every environment by completing specific challenges against the computer. BOTS Add bots to any match. Driven by a capable AI, they can provide some challenge when friends are not around; or you can use them to add energy to matches. If the adaptive AI gets frustrating or too easy, you can always adjust the challenge from the menu. CUSTOMIZABLE CONTROLS With full support for Steam Input, it should work with most controllers out there. You can build your own input configuration and you can choose from three flying schemes from within the game itself. You can even fly with your keyboard, you just can’t win. ONLINE VIA REMOTE PLAY TOGETHER We know it is not always possible to have your friends on the same sofa, heck, we haven’t been on the same sofa in months. Luckily Have a Blast works really well with Remote Play Together and was extensively tested with it. It’s how we have been making this game for the last year. WE HOPE YOU ENJOY OUR RETRO-INSPIRED MODERN-DESIGNED ARCADE!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1181650/header.jpg?t=1629992872",
    "Price": 7.99,
    "Developers": "Bojan Endrovski",
    "Publishers": "Firenut Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_3237302d700469a36f76270a32d3b5858817caff.1920x1080.jpg?t=1629992872,https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_ec3d6636bcac43fd6c22cd10f6a24af554fb7770.1920x1080.jpg?t=1629992872,https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_e68920b5f808ca7387531d12523c3e13982edd1a.1920x1080.jpg?t=1629992872,https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_ed9aaf52276684a1eaa516af3705a2de1232af80.1920x1080.jpg?t=1629992872,https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_e91fbf897a6622ec50dc72c2ddbe751a7a285acd.1920x1080.jpg?t=1629992872,https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_b1afcaab7080c2080ac0b30d0720d2661e0c9873.1920x1080.jpg?t=1629992872,https://cdn.akamai.steamstatic.com/steam/apps/1181650/ss_af474b687fa5679daa893ee355b4d37f6d89b736.1920x1080.jpg?t=1629992872",
    "Slug": "have-a-blast",
    "Meta Title": "Have a Blast: Aug 26, 2021, Bojan Endrovski and Full Over...",
    "Meta Description": "Looking for information on Have a Blast? Check out the release date (Aug 26, 2021), developer insights from Bojan Endrovski, and a complete game summary.",
    "Alt Text Image": "Official header image for Have a Blast game - Steam 1181650",
    "Canonical URL": "https://gusku.site/game/have-a-blast",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Have a Blast\", \"description\": \"Looking for information on Have a Blast? Check out the release date (Aug 26, 2021), developer insights from Bojan Endrovski, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bojan Endrovski\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Firenut Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1181650/header.jpg?t=1629992872\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}