{
    "AppID": 748110,
    "Name": "Kitten Madness",
    "Release date": "Dec 31, 2017",
    "About the game": "Kitten Madness is an open world fast pace game where you race a kitten through various levels and game types. The first game type is a race against time to collect mice toys which are used as Cat Cash. The second game type is kitty obstacle course levels that are navigated though while guiding a ball of yarn kitten toy as fast as possible - Look out for traps cat's hate! Save up Cat Cash to unlock maps and other cats. The Early access version of Kitten Madness starts out as a single player game where you control a cute kitten performing the playful action a kitten does. Run through houses trying to collect as many mice toys as possible in the shortest amount of time, play with a ball of yarn while avoiding may perils that a kitten will encounter in the yard. Early access includes 7 levels split between 'Collect the Toy' and 'Obstacle Course' types unlocked by Cat Cash and 7 multi-color kitten skins that can also be unlocked. The Early access release is a functional playable version of the Kitten Madness game. We are looking for feed back on the game types for fine tuning during early access and will greatly appreciate community feedback. Early Access Key Features - Two map types - Collect the Toys and Obstacle Course - Collect mouse toys as your Cat Cash - Collect power-ups to perform your special kitten moves - Find and eat cat food to regain health - Special Kitten Moves - Speed Boost, Hi Jump, Slow Down Time Looking forward to the retail release we are planning on adding a multiplayer 'Capture Mouse' game type that will allow teams of kittens to compete with others trying to capture the mouse toy and return it to their home, as well as a 'Sandbox' game type where you can just run around without time bounds and act like a kitten. We also plan on creating new kitten models and skins, as well as new levels for the new game mode. The early access price will be discounted from full retail price. Once the game is feature complete, the price on the game will increase from the discounted early access price. All early access contributors will be upgraded to retail features for free when complete.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/748110/header.jpg?t=1514749612",
    "Price": 6.99,
    "Developers": "David Ogden",
    "Publishers": "LoveTrooper Entertainment L.L.C.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/748110/ss_22833ba18b089f85003df0d7ad35368ff8cad015.1920x1080.jpg?t=1514749612,https://cdn.akamai.steamstatic.com/steam/apps/748110/ss_d4e7c6ef99e284fadf590c39cba39f3b23328703.1920x1080.jpg?t=1514749612,https://cdn.akamai.steamstatic.com/steam/apps/748110/ss_76c46aff46cc43d936c6acf8140dbd851b8d29ae.1920x1080.jpg?t=1514749612,https://cdn.akamai.steamstatic.com/steam/apps/748110/ss_82492d90c200c4e3148c55b349ab27bbfa95bb0c.1920x1080.jpg?t=1514749612,https://cdn.akamai.steamstatic.com/steam/apps/748110/ss_b700c5c7babdd97a8e8a20803e688e3e7b0f642d.1920x1080.jpg?t=1514749612,https://cdn.akamai.steamstatic.com/steam/apps/748110/ss_b9ffb4f2c59b0440c0ab5d09d0b0362afbc3f847.1920x1080.jpg?t=1514749612",
    "Slug": "kitten-madness",
    "Meta Title": "Kitten Madness: Dec 31, 2017, David Ogden and Full Overview",
    "Meta Description": "Looking for information on Kitten Madness? Check out the release date (Dec 31, 2017), developer insights from David Ogden, and a complete game summary.",
    "Alt Text Image": "Official header image for Kitten Madness game - Steam 748110",
    "Canonical URL": "https://gusku.site/game/kitten-madness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Kitten Madness\", \"description\": \"Looking for information on Kitten Madness? Check out the release date (Dec 31, 2017), developer insights from David Ogden, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"David Ogden\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LoveTrooper Entertainment L.L.C.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/748110/header.jpg?t=1514749612\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}