{
    "AppID": 1712430,
    "Name": "Klondike Re-Imagined",
    "Release date": "Sep 16, 2021",
    "About the game": "I'm a solitaire nut. But I have always hated the Klondike implementations that have been available. Why should I have to click the HINT button to see all of the available moves? Why should I have to keep hitting the DRAW button to see the next triplet from the Talon? So, about 15 years ago when I retired from Boeing Computing, I decided to fix these deficiencies and coded my first Klondike. It had all available moves pre-calculated and shown as buttons. Press the button and the move is carried out. It had the entire Talon shown at once (again, with move buttons). And over the years, as I played my new Klondike, I kept thinking of other things that would be nice to have (without changing the rules). And I added them. Like: Stacking Maps - showing all 52 cards in stacking order (red on black) showing where each card is and whether it's theoretically playable. Build Maps - one for each suit in build-order, showing each card is and whether it's theoretically build-able. The Talon-Lookahead - I can see the entire Talon at once. As I play cards from the Talon, why not see the Talon as it will be the next time thru? So this Klondike has a second view of the Talon, the Lookahead-Talon. Available moves are calculated for both of them and you can even play directly from the Lookahead (which of course causes the Lookahead to become the Talon and a new Lookahead to be computed). Connector-Cards - The main thrust of Klondike is moving cards so that a downcard is exposed for a flip. Why not have the Klondike programing figure out all of the theoretical opportunities for exposing downcards and display which cards (Connector-Cards) need to be moved in order to do it? So this Klondike calculates all Connector-Cards and hilites them in yellow on the Stacking Maps and the Build Maps. The Have-We-Lost Algorithm - If a game becomes theoretically impossible to win, I want to know right away, so I can resign and go on to a deal that isn't theoretically impossible. (Life is short!) It took me three years of development, but this Klondike's Have-We-Lost Algorithm is killer. So what do all of these improvements do to the game? Well, the rules are still exactly the same. And Klondike's anti-anxiety properties are still there. But with all of the added visibility, you can really see what's going on. So the game becomes more of a puzzle-to-be-solved. And it allows for some strategies that you never even thought of before. And it is way, way more fun! So, I'm thinking that there must be some other Klondike nuts out there who will enjoy this re-imagined Klondike as much as I do. Mike Edwards",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1712430/header.jpg?t=1631809050",
    "Price": 3.99,
    "Developers": "Mike Edwards",
    "Publishers": "Mike Edwards",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1712430/ss_8648eb204f4212ded35fa71e64bc6f0e478cde4d.1920x1080.jpg?t=1631809050,https://cdn.akamai.steamstatic.com/steam/apps/1712430/ss_8fc738980e8c30a30ab2d225767705f22e9570da.1920x1080.jpg?t=1631809050,https://cdn.akamai.steamstatic.com/steam/apps/1712430/ss_428c85117aa191acc7e0ccb83e848076f51a0e73.1920x1080.jpg?t=1631809050,https://cdn.akamai.steamstatic.com/steam/apps/1712430/ss_323c7172625924edc6728ec7c7bc1ef144dc9397.1920x1080.jpg?t=1631809050,https://cdn.akamai.steamstatic.com/steam/apps/1712430/ss_843bdfbb84994d75576073e92f861f1e48e0760f.1920x1080.jpg?t=1631809050",
    "Slug": "klondike-re-imagined",
    "Meta Title": "Klondike Re-Imagined: Sep 16, 2021, Mike Edwards and Full...",
    "Meta Description": "Looking for information on Klondike Re-Imagined? Check out the release date (Sep 16, 2021), developer insights from Mike Edwards, and a complete game su...",
    "Alt Text Image": "Official header image for Klondike Re-Imagined game - Steam 1712430",
    "Canonical URL": "https://gusku.site/game/klondike-re-imagined",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Klondike Re-Imagined\", \"description\": \"Looking for information on Klondike Re-Imagined? Check out the release date (Sep 16, 2021), developer insights from Mike Edwards, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mike Edwards\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mike Edwards\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1712430/header.jpg?t=1631809050\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}