{
    "AppID": 1256670,
    "Name": "Library Of Ruina",
    "Release date": "Aug 10, 2021",
    "About the game": "“May you find your book in this place.” Become the owner of the Library and receive your guests. Your librarians will fight for the Library. Combat between the guests and the librarians breaks out as if it were on a stage. Defeated guests turn into books, and the Library grows onward. A good book will allow you to invite new guests with greater secrets. Amass a collection of books and explore the secrets of the City. And eventually, get your hands on… The one singular, perfect book. [Introduction to the Game] “May you find your book in this place.” Become the owner of the Library and receive your guests. Your librarians will fight for the Library. Combat between the guests and the librarians breaks out as if it were on a stage. Defeated guests turn into books, and the Library grows onward. A good book will allow you to invite new guests with greater secrets. Amass a collection of books and explore the secrets of the City. And eventually, get your hands on… The one singular, perfect book. [A Library Battle Simulation] Library of Ruina is a game that uses the concept of a “Library Battle Simulation”. You will invite guests to the Library and engage in combat with them to gain 'Books' with their stories. Battles are played with the 'Librarians' and the 'Guests' using cards and dice. You can plan against the guests’ moves by looking at the cards they will use and select the most optimal card to oppose them. When combat begins, how the dice from your chosen card fall will determine victory or defeat in the struggle. However, the outcome of the dice is not simply determined by pure luck. Certain effects and variables will shift the outcome of the dice for and against your favor. Be sure to carefully choose which cards you utilize to win the battle with your guests. Behold the outcome of your choices and how luck unfolds as your librarians and guests skirmish. You can go through an exhilarating experience, putting it all on the line with thrills just like betting. [Conflicts that Build Emotion] Confrontation in the Library is not just about killing your enemies, it is about heightening emotions. The emotions of the librarians and guests rise as the battle progresses, and as it grows fiercer and comes to a head, they will surge. Depending on your librarian's feelings, positive outcomes or powerful effects with penalties can occur. In addition, as the emotional tension of the guests grows, the difficulty of combat increases, yet at the same time, rarer books can be acquired. Furthermore, dialogue can appear depending on the situation of the battle and will make one’s viewing experience of the match unfolding even more enjoyable. [Books Can Be Anything] A guest who dies in the Library will turn into a book. These books can be a librarian's body, materials to grow the Library, or new cards for battle. You can also use books as the parts of an invitation to bring forth another guest. Invite different guests to acquire various books, then utilize them accordingly. How you make use of your collection to grow the Library is up to you. [The Story of the City and the Library] In Library of Ruina, you will be witness to the stories of Angela, the Sephirot, and Roland following the ending of Lobotomy Corporation. You will also watch various events occurring around the huge city in which the Library is located. Accumulate books to grow your Library and librarians, and invite more powerful guests to gain better books. From lowly canards to urban legends and beyond... Throughout the game, you will gradually become familiar with the story of the City. May you find your book in this place…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1256670/header.jpg?t=1631308649",
    "Price": 29.99,
    "Developers": "ProjectMoon",
    "Publishers": "ProjectMoon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_43f3c74028922a9e0a80be23b52e90c9cb727417.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_707fb2b0bbceecc4d4ea8517ebc709b69cca35fc.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_338843763e782212597ec2979c2ff496d5dc61d4.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_31224734740c90faf7e9d9986962c1133e0dd2c3.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_21d9365859cac3056a64424ea468ad1f577096a9.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_066a77defb90217f60742ad8d706d3d12d95aac1.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_a4c12d440fe293eaa48f31688905372d1be7aa1a.1920x1080.jpg?t=1631308649,https://cdn.akamai.steamstatic.com/steam/apps/1256670/ss_c80e2ea36a79f73d87e9740f470054199a1f5e55.1920x1080.jpg?t=1631308649",
    "Slug": "library-of-ruina",
    "Meta Title": "Library Of Ruina: Aug 10, 2021, ProjectMoon and Full Over...",
    "Meta Description": "Looking for information on Library Of Ruina? Check out the release date (Aug 10, 2021), developer insights from ProjectMoon, and a complete game summary.",
    "Alt Text Image": "Official header image for Library Of Ruina game - Steam 1256670",
    "Canonical URL": "https://gusku.site/game/library-of-ruina",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Library Of Ruina\", \"description\": \"Looking for information on Library Of Ruina? Check out the release date (Aug 10, 2021), developer insights from ProjectMoon, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"ProjectMoon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ProjectMoon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1256670/header.jpg?t=1631308649\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}