{
    "AppID": 1604800,
    "Name": "LIP! Lewd Idol Project Vol. 1",
    "Release date": "Jun 23, 2021",
    "About the game": "Welcome to the world of Lewd Idols! But… What exactly is a Lewd Idol? Join Kairi, the shy aspiring star, and Ranko, her depraved self-proclaimed producer in this lewd journey to find out! Explore the city of Akihabara, try to form a group, and overcome all the odds while having a lot of girl-on-girl action! Are you ready for it? LIP! Lewd Idol Project is a yuri Visual Novel about a girl's adventure to becoming an Akihabara Idol! Join Kairi in this lewd adventure and explore the city, meet new friends, and try to form a group overcoming all the odds while having a lot of girl-on-girl action! Kairi is a young, innocent, and cheerful girl with a dream… Becoming the biggest and most popular Idol ever! She recently moved to Akihabara in order to achieve this, but she’s been rejected by around fifteen different agencies so far… Why is this adult life so difficult!? Already short on money, with some increasing debt, and feeling defeated by yet another failed audition, she meets Ranko, a perverted and self-proclaimed lewd producer that introduces the shy Idol wannabe into her most recent and ambitious project… LIP! Lewd Idol Project. With nothing left to lose, and more questions than answers about this adult oriented Idol group, she embarks into the adventure of a lifetime! Are you ready for it? High quality anime-style artwork Fully uncensored yuri 18+ CGs Unlockable CG Gallery to view erotic scenes and character sprites Alternative Costumes and Collectibles to unlock Gacha and Crane Machine Mini-Games Relationship Meter between the girls Akihabara Exploration Partial Japanese voice acting Unlock and enjoy both wholesome and erotic yuri CG scenes in Gallery Mode! Kairi and her friends will have different alternative costumes that you can unlock and enjoy along the adventure. Swimsuit, lingerie, maid, nurse, succubus, bunny girl, you name it! After getting a new costume, you'll get unlimited access to them in Wardrobe Mode. Try to unlock them all! Take a break from business while exploring Akihabara in order to play some Gacha or Crane Machines. Explore Kairi’s Collection gallery and enjoy your Gacha and Crane Machine prizes. Can you collect them all? Our heroines will have a relationship meter that will increase or decrease each time you take an action or dialogue decision while interacting with each other. Build your meters up to 100% and unlock extra scenes and dialogues! Explore the wonderful city of Akihabara , discover some of its most famous and fun spots and have a blast in the Otaku City! During the adventure, you'll have the chance to choose which LIP! girls you'll play as on certain paths and exploration segments. Be careful , your actions and decisions may affect future outcomes! Create your own scene with your favorite girls and costumes and take a picture to save on your device!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1604800/header.jpg?t=1637708310",
    "Price": 6.99,
    "Developers": "Toffer Team",
    "Publishers": "Denpasoft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_ce3f1d7226b52af0fa0c3a2f0995bc210872a4a2.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_d2b773f7a54bcccbcd364bb7b806957471c8fa22.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_0f99a005b86cca952d04189fe4a869917e27920f.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_af140fb0143f053dbf28650edbd7d03ddbe926a8.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_713ca32170f5e39986f270709bbc7acf86db38aa.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_618678073fa449ca4cecf633edaa5f65260e0904.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_d3e1d7c82337b1325bffeed4db4861eeb440715a.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_cbfe562044e132ed03df882a28d2cdff6271f076.1920x1080.jpg?t=1637708310,https://cdn.akamai.steamstatic.com/steam/apps/1604800/ss_4c0be44537333bbd1663fa853b887fa097fc041c.1920x1080.jpg?t=1637708310",
    "Slug": "lip-lewd-idol-project-vol-1",
    "Meta Title": "LIP! Lewd Idol Project Vol. 1: Jun 23, 2021, Toffer Team ...",
    "Meta Description": "Looking for information on LIP! Lewd Idol Project Vol. 1? Check out the release date (Jun 23, 2021), developer insights from Toffer Team, and a complete...",
    "Alt Text Image": "Official header image for LIP! Lewd Idol Project Vol. 1 game - Steam 1604800",
    "Canonical URL": "https://gusku.site/game/lip-lewd-idol-project-vol-1",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LIP! Lewd Idol Project Vol. 1\", \"description\": \"Looking for information on LIP! Lewd Idol Project Vol. 1? Check out the release date (Jun 23, 2021), developer insights from Toffer Team, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Toffer Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Denpasoft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1604800/header.jpg?t=1637708310\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}