{
    "AppID": 626510,
    "Name": "LoveKami -Useless Goddess-",
    "Release date": "May 29, 2017",
    "About the game": "'I took in a goddess!' It was after the descent of uncountable goddesses in Japan... Most goddesses were able to blend in with humans, living peacefully and happily together. Some of those goddesses even went on to become idols. However, there were others who simply refused to follow the rules. These goddesses prefer living freely and doing as they please, inadvertently causing all sorts of trouble for humans. Goddesses who are naughty are called Aragami. The protagonist, Sho Narumi, stumbles upon a goddess who collapses on the street and attempts to help her. Soon enough it is revealed that she's the Aragami who had been causing frequent power outages in one small-town area of Tokyo. Sho decides to protect his beloved hometown by helping the goddess to get rehabilitated! 'Rehabilitate the goddess!' Wait...aren't goddesses supposed to help humans? With the setting moving from Akihabara to a quiet small-town area of Tokyo, the story of one naughty goddess's rehabilitation begins now! Story Backbone The story roughly remains the same, there's just something that's a little different... This is the tale of an unusual goddess set in a slightly different Japan. The Goddesses Descend! It was a time when people had forgotten their dreams and lost faith. The silhouettes of goddesses revealed themselves to the people who then could only believe in what they saw right in front of them. The confusion surrounding the countless goddesses appearing in Japan could be explained due to Amaterasu Omikami wanting to teach the goddesses about the human world. All of this brought about the implementation of the Divine Education Act. Consequently, the goddesses were able to learn, familiarize, and communicate with humans. This cross-cultural exchange between goddesses and humans helped to show the world's many colors. An Aragami brought down to the world by the Divine Education Act. She's a naughty goddess who skips school. Although she possesses the power to manipulate electricity, since she's an Aragami, she can only make electricity go haywire. She accidentally causes power outages when angry or irritated. Since she easily gets angry, she causes power outages almost every day somewhere in town. Though she'd like to be in control of her power, things always spiral out of control when she tries to use them. This doesn't bother her, since she figures it's only natural for an Aragami, such as herself, to cause messes here and there. She's stubborn and does what she wants, but it's not because she won't listen to instruction, she just doesn't want to do what she doesn't understand. She gets a kick out of teasing Sho by trying to seduce him. She also occasionally pulls pranks on Sho and seduces him in front of Maika to make her jealous. An earth goddess dispatched to rehabilitate Akane who keeps causing damage to the town by not following the Divine Education Act. This goddess is serious and focused, but innocent; she doesn't seem to know a lot about certain things. Despite being the local earth goddess, she never acts arrogant, and instead talks politely to everyone. She is charming and elegant, but is also fairly clumsy. She is easy-going, with a docile personality, but brings heavy rainfall to the town when she gets angry. Although she rarely gets angry, once she does, the damage she inflicts is incomparable to Akane's. She broods over the fact that she has no prominent advantages over other goddesses, and hates to get mislabeled as a 'dirt goddess.' Because of her laid-back personality, she doesn't really care even if Sho sees her naked. She'd even ask if he'd like to touch her chest. Sho's junior, landlady, and close childhood friend. She's just your average fashionable girl. Her looks are stylish and she loves wearing makeup. Contrary to her appearance, she's rather diligent and capable. She has feelings for Sho, but can't find it in her to confess. Although she works as the apartment landlady with her mother while attending school, she often makes comments about not caring if the old building gets demolished. In actuality, she's a good kid and is serious about looking over the apartments. She's tsundere, and wants to continue living there together with Sho. Sometimes she gets jealous when Akane or Inori gets too friendly with Sho. Even though she seems to know about the adult world, she blushes intensely only when Sho sees her underwear.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/626510/header.jpg?t=1573642502",
    "Price": 2.59,
    "Developers": "MoeNovel",
    "Publishers": "MoeNovel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_cb31789a3682143f222523ecf839a8b30a2a40a8.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_c9f5b933d01c1b3b1ee1b6cf36c84d4a4fa2d3ec.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_909be80dca642cb6e93f2f2b2bf9968f33bba77e.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_e5c51565b5356b7b10189194f2b320668ee0678d.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_279f312fa477dce402a79265a2e2a02ef22fe49f.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_d89f1885579df8400da27021f9a16462e2f058cb.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_85e3f2e8220b390e937d01eea89a00749d2cc743.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_cadb53b7902ebb18b8f665c71e1678f2ef5a9bd7.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_971a2fce4f8dde4e09691a410d8b7382cc06765c.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_8486c7421ff672d1519fc8e8a7df59f9b0630905.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_54f92504016bf07fdb5c7f902eb95f428dbc7a89.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_06acb6404631615eb58de69997885caccd760d0a.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_6cee4120ab89e897ed428764f4d68312bef64193.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_f0649c7c618194f57e951396ddb2fea2ce407fad.1920x1080.jpg?t=1573642502,https://cdn.akamai.steamstatic.com/steam/apps/626510/ss_44537247d7c501991c8317df1d22c43d2cd710ae.1920x1080.jpg?t=1573642502",
    "Slug": "lovekami-useless-goddess",
    "Meta Title": "LoveKami -Useless Goddess-: May 29, 2017, MoeNovel and Fu...",
    "Meta Description": "Looking for information on LoveKami -Useless Goddess-? Check out the release date (May 29, 2017), developer insights from MoeNovel, and a complete game ...",
    "Alt Text Image": "Official header image for LoveKami -Useless Goddess- game - Steam 626510",
    "Canonical URL": "https://gusku.site/game/lovekami-useless-goddess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LoveKami -Useless Goddess-\", \"description\": \"Looking for information on LoveKami -Useless Goddess-? Check out the release date (May 29, 2017), developer insights from MoeNovel, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"MoeNovel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MoeNovel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/626510/header.jpg?t=1573642502\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}