{
    "AppID": 1366390,
    "Name": "LuPR: Lunar Post Recruit",
    "Release date": "May 13, 2022",
    "About the game": "A retro first-person shooter party game where 1-4 local players battle with or against each other and AI bots as soldiers in a time when humans inhabit far reaches of the solar system. Peace between the planetary factions has been shattered and nowhere is safe. Join the fight for control of the planets and battle for victory! (Or just for fun) Defeat content unlock challenges or configure custom games with your favorite arena game modes, maps, weapons and player setup. Every game is a unique experience thanks to the AI NPCs and the randomness of your friends! No micro-transactions or DLC... just like the 90s! ** NOTE - for now, to use PlayStation controllers you’ll need DS4Windows (or similar). Team Based Arena-Style Game Modes Set time and/or point limits. Optional kid-friendly paintball mode to eliminate gore. Choose from 6 game maps (1 from beating the Map Unlock challenge). Combat : Shoot people NOT on your team for points King of the Hill : Race to the hill and keep enemies out long enough to get a point Capture the Phone : Grab the phone from the enemy base then back to yours for a point Hold the Grenade : Destroy the grenade holder. Once you have it DON'T DIE for more points High Score : Play against the AI to beat your own or global high scores Survival : How long can you survive the AI bots? The longer you last the harder they get. Weapons Customize or randomize your game’s weapon slots with any of 14 weapons (2 must be unlocked): grenades, rocket launchers, crossbows, black hole guns, syringes, mines, foam hands, candy canes, snipes, laser guns, rifles, pistols. Player Customization 18 heads (additional unlockable balloon and alien heads), 3 body types (unlockable alien) and player health bonus options. Set the AI count (up to 8) and difficulty of each. Customize the team count and make-up of each: 5 auto distribution options, randomize or fully customizable. Unlockable Content Defeat challenge games for Steam achievements and to unlock additional content: Balloon Heads : 16 additional funny heads but one headshot and it’s all over Get Tiny Then Explode : Shrink instead of losing health and explode once you're too small Foam Hand Gun : A pretend gun that requires no ammo, just say pew pew Lunar Bay 42 Map : Unlock an additional game map Dual Wielding, Fast Run, Slow Motion, One Hit Kills, Lunatic AI, Bouncing Bullets, Bouncy Grenades, Unstoppable Arrows, No Radar, Extended Magazines, Infinite Ammo, Alien Body More content to be released during Early Access. Provide your feedback in the forum to help shape the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1366390/header.jpg?t=1655578546",
    "Price": 9.99,
    "Developers": "Epic Tech Labs LLC",
    "Publishers": "Epic Tech Labs LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_c047d96f502a8e2120e57bcc9dc311f47b96c893.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_f38a027aba27653bdca6d150596cde80ac5c251f.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_d109e3e5bb47361f4c73222660d423205ea8ae2c.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_b4422707341c9c854f0bda82609b34692bcdee37.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_ac05f49753a7fedc333946f7af76a6b53b3975a7.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_3fde6a0941bfe2734c2977e80cdc1e069f3a032c.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_b1e23a0aed2136dfeca1b73afcd2d171e707fbe4.1920x1080.jpg?t=1655578546,https://cdn.akamai.steamstatic.com/steam/apps/1366390/ss_36af3c61355a799a2a5b3e3f4846223dc737b3ec.1920x1080.jpg?t=1655578546",
    "Slug": "lupr-lunar-post-recruit",
    "Meta Title": "LuPR: Lunar Post Recruit: May 13, 2022, Epic Tech Labs LL...",
    "Meta Description": "Looking for information on LuPR: Lunar Post Recruit? Check out the release date (May 13, 2022), developer insights from Epic Tech Labs LLC, and a comple...",
    "Alt Text Image": "Official header image for LuPR: Lunar Post Recruit game - Steam 1366390",
    "Canonical URL": "https://gusku.site/game/lupr-lunar-post-recruit",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LuPR: Lunar Post Recruit\", \"description\": \"Looking for information on LuPR: Lunar Post Recruit? Check out the release date (May 13, 2022), developer insights from Epic Tech Labs LLC, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Epic Tech Labs LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Epic Tech Labs LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1366390/header.jpg?t=1655578546\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}