{
    "AppID": 955030,
    "Name": "Metamorph",
    "Release date": "Nov 1, 2018",
    "About the game": "Metamorph is an independent work of basing on 'morph'.Wandering in the solitude of the forest,eveyone can change freely the original body shape so as to adapt to the environment,or inherit the racial talent in order to survive. FOREST Of SOLITUDE I entered into the forest,felt the generosity and sadness of life. The sunshine is bright,I enjoy the cool air who under the tree. The tiger roars in nearby,The wolves wander in the path.See the source of water and food consumed in the forest,I silently am willing to survive to the end in this game for the brave. The environment is quiet and cruel. --- how long can you survive? Different forms of life, derived from the same source of life. Who am I? Animal life?Mechanical life?Light-collecter life? There is no comparison between the animal behavior and the divine thought. There is no comparison between the law of the jungle and the common fate. Welcome to 'Metamorph',here has the innovation of the origin of life forms - the soul world view to build,we together search for the meaning of existence and the value of life. CRAFT BACKGROUND In a parallel world without knowing,where over millions of years of evolution.Many animals had learned to walk uprightly,formed the world outlook and methodology to creat their own racial civilization.These humans who had super intelligence through unique technology to changed their physical form,froming the animal form to light-collecter form. In the summer afternoon,TigerMan,WolfMan,LionMan,FoxMan,SnakeMan,FrogMan,EagleMan,and DoveMan go to the party together.These clever human take a group photo with having portraits of their ancestor,which starts the survival game called 'Metamorph'. Extraordinary genius can freely change the permutation and combination of light,so as to change their outward appearance to confuse opponents.Having unique talent,they can freely cross obstacles of ordinary construction. This is a survival game to prove your brave heart,surviving to the end is the only winner. CRAFT CREATIVITY rendering effect of forest scene,obtaining changes of 24-hour light and shadow. racial reputation system for advanced performance. unique freely morph system,different forms have different ethnic talent and properties. virtual intelligence system is based on humanity,any player's behavior will influence each other. interesting equipment and property system. the design of the stochastic system for a better ideal world. USER INTERFACE ROLE PORTRAIT USER INTERFACE TALENT DESIGN",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/955030/header.jpg?t=1541128845",
    "Price": 10.99,
    "Developers": "Chumoran",
    "Publishers": "Chumoran",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/955030/ss_61151f2e217425b58cd10d19566fa72790ddeb32.1920x1080.jpg?t=1541128845,https://cdn.akamai.steamstatic.com/steam/apps/955030/ss_6a357a02c94fa949fa52ac76628a83779c7537b2.1920x1080.jpg?t=1541128845,https://cdn.akamai.steamstatic.com/steam/apps/955030/ss_eb53db652a300018d98b808c685f534eae68c96c.1920x1080.jpg?t=1541128845,https://cdn.akamai.steamstatic.com/steam/apps/955030/ss_4e86bbf8763a3bc83e4bf498522b7b39b43e4188.1920x1080.jpg?t=1541128845,https://cdn.akamai.steamstatic.com/steam/apps/955030/ss_a697f41275bb1176f0a6158c44dd9793e859d084.1920x1080.jpg?t=1541128845",
    "Slug": "metamorph",
    "Meta Title": "Metamorph: Nov 1, 2018, Chumoran and Full Overview",
    "Meta Description": "Looking for information on Metamorph? Check out the release date (Nov 1, 2018), developer insights from Chumoran, and a complete game summary.",
    "Alt Text Image": "Official header image for Metamorph game - Steam 955030",
    "Canonical URL": "https://gusku.site/game/metamorph",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Metamorph\", \"description\": \"Looking for information on Metamorph? Check out the release date (Nov 1, 2018), developer insights from Chumoran, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chumoran\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Chumoran\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/955030/header.jpg?t=1541128845\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}