{
    "AppID": 17180,
    "Name": "Mosby's Confederacy",
    "Release date": "Nov 19, 2008",
    "About the game": "As John Singleton Mosby, one of the Civil War's most interesting and dynamic leaders, you are charged, not with leading vast armies into battle, but with commanding small bands of skirmishers, scouts, and guerilla fighters on opportunistic missions to scout, ambush, steal supplies, and harass a larger and better-armed force of Union soldiers, in this game of turn-based strategy and real-time tactical combat for the PC. Missions and their objectives are randomized, so you'll need to approach each game differently, carefully planning your strategy for success. You draw your soldiers from local towns, then, through hard-won battlefield experience, transform them into fighting men &mdash; scouts, cavalry, rangers, and riflemen. Between battles you'll invest in local towns, so they can serve as field hospitals, stables and munitions caches, helping to keep your forces fit and able to fight, and so that they remain confident and supportive of your ongoing efforts and willingly supply men to fight for your cause - and as the war rages on this becomes increasingly challenging. Throughout the campaign your progress is tracked, with a full report of your accomplishments provided at its completion. Can you build a name for yourself, just like Mosby? Turn-based Confederacy Level with unit and resource management Units live in towns that you can influence to support your goals Availability of units for specific missions is dependent on their town's support for you Your interactions with towns, as well as casualties you send home to them, changes the face of the region Real-time tactical combat missions Enemy unit concentrations and mission objectives are randomized for replayability Focus on reconnaissance and stealth tactics Units under your command vary in terms of base stats as well as attributes they earn as they level You choose who to take into combat and within a given mission you must work with those units to complete the mission (there are no unit-spawning buildings that give you replacements in battle) Randomized units that gain specializations over time with experience Emphasis on each unit as a real soldier rather than the expendable, nameless units of a traditional RTS Each campaign starts with a small group of veteran units mixed in with raw recruits whose homes are chosen at random Though most of the units come into the world as raw recruits, your ability as a leader to cultivate them into effective Rangers, Riflemen, Cavalrymen, and Scouts (each of which have their own strengths and weaknesses) will be key to your success",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/17180/header.jpg?t=1447351573",
    "Price": 9.99,
    "Developers": "Tilted Mill Entertainment, Inc.",
    "Publishers": "Tilted Mill Entertainment, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006383.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006384.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006385.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006386.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006387.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006388.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006389.1920x1080.jpg?t=1447351573,https://cdn.akamai.steamstatic.com/steam/apps/17180/0000006390.1920x1080.jpg?t=1447351573",
    "Slug": "mosby-s-confederacy",
    "Meta Title": "Mosby's Confederacy: Nov 19, 2008, Tilted Mill Entertainm...",
    "Meta Description": "Looking for information on Mosby's Confederacy? Check out the release date (Nov 19, 2008), developer insights from Tilted Mill Entertainment, Inc., and ...",
    "Alt Text Image": "Official header image for Mosby's Confederacy game - Steam 17180",
    "Canonical URL": "https://gusku.site/game/mosby-s-confederacy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mosby's Confederacy\", \"description\": \"Looking for information on Mosby's Confederacy? Check out the release date (Nov 19, 2008), developer insights from Tilted Mill Entertainment, Inc., and ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2008\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tilted Mill Entertainment, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tilted Mill Entertainment, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/17180/header.jpg?t=1447351573\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}