{
    "AppID": 1225850,
    "Name": "NonetEnsemble:MagicworkLabyrinth",
    "Release date": "Feb 13, 2020",
    "About the game": "■ Point ■ ◆ Challenge a non-fixed map each time you enter the dungeon! Level and Items will be reset if you are dead in challenging a randomly generated dungeon. The goal of the game is to defeat the BOSS at the deepest space and get 'Star Fragments'. It is a real-time Turn-based game. The enemy will act as the player to take any action. You can't undo any action. Please make the operation carefully. ◆ Use 'Gimmick' and 'Magic Stone'! Let's make a way out by using 'Magic Stone' which is a consumption type key item in this game. 'Boiling tree' that can brighten and recover by lighting a fire and 'Bud' that grows by raising water for collecting nuts. There are many 'Gimmick' everywhere in dungeons and most items can be used for something. You can get new 'Magic Stone' using 'Magic Stone Synthesis' function with the same type of 'Magic Stone' from familiar friends. Most of the synthesized 'Magic Stone' contains powerful effects. Clear the dungeon by using 'Magic Stone' greatly. ◆ Let's go on an adventure with an excellent partner who fulls of personality! At first, only the main character Yulia can select as a leader. Friends will join as the story going ahead! You can challenge the dungeon alone. Challenges with friends will make you explore much easier and more fun. Each of them has their own unique skills and it is expected that different result of fighting way depending on the skill combination. ◆ Engage your equipment! Some equipment can be equipped with items such as 'Magic Stone' and 'Tree Nut' for engagement. The player can engage with it in weapons or armor at any time. Not limit with the holding items, the equipment has various attached effects depending on Engagement. For example, it is an advantage for fighting if attaching fire property or poison state in the attack. ■ Story ■ A long time ago, when people were still fighting The earth was desolate and the sea was dry. So Heaven dispatch the Goddess. The Goddess not only heals the earth and the sea, even give magical power equally to everyone. Hopping people to promise no fighting anymore. However, people even didn't stop the battle. They choose to destroy continually and bring dead Miasma at last. The Goddess who wept as looking that. Her Tears drop down to the ground like seeds. Giving the last safe place for people away from unreasonable. A long-time later There is a girl trying to start a new adventure from a safe place. She's name is Yuria. Going outside of the world as a dream. Her adventure story is starting from here now.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1225850/header.jpg?t=1583478035",
    "Price": 19.99,
    "Developers": "PhotonSystem",
    "Publishers": "PhotonSystem",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1225850/ss_d86793d246d9d0eb5081cfabdcbe60bde3021690.1920x1080.jpg?t=1583478035,https://cdn.akamai.steamstatic.com/steam/apps/1225850/ss_cb33be537db835192855dd2ebc4bf306db5ee8dc.1920x1080.jpg?t=1583478035,https://cdn.akamai.steamstatic.com/steam/apps/1225850/ss_6d2513c840cfa2828f8065703f2fdf7c29ef17b5.1920x1080.jpg?t=1583478035,https://cdn.akamai.steamstatic.com/steam/apps/1225850/ss_1421f2d1599f025081084014de103cb6766956df.1920x1080.jpg?t=1583478035,https://cdn.akamai.steamstatic.com/steam/apps/1225850/ss_ae16228904013babf42b1234a8048f14886fc8a7.1920x1080.jpg?t=1583478035",
    "Slug": "nonetensemble-magicworklabyrinth",
    "Meta Title": "NonetEnsemble:MagicworkLabyrinth: Feb 13, 2020, PhotonSys...",
    "Meta Description": "Looking for information on NonetEnsemble:MagicworkLabyrinth? Check out the release date (Feb 13, 2020), developer insights from PhotonSystem, and a comp...",
    "Alt Text Image": "Official header image for NonetEnsemble:MagicworkLabyrinth game - Steam 1225850",
    "Canonical URL": "https://gusku.site/game/nonetensemble-magicworklabyrinth",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NonetEnsemble:MagicworkLabyrinth\", \"description\": \"Looking for information on NonetEnsemble:MagicworkLabyrinth? Check out the release date (Feb 13, 2020), developer insights from PhotonSystem, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"PhotonSystem\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PhotonSystem\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1225850/header.jpg?t=1583478035\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}