{
    "AppID": 1846330,
    "Name": "Nope Nope Nurses",
    "Release date": "Jan 25, 2022",
    "About the game": "FEATURES A visual novel about a hospital where all the nurses are the worst Full Japanese voice acting by seasoned professionals SUMMARY Hospital ≠ hospitality...?! Yamada is afflicted with a rare condition that makes his life hard, and when he manages to break bones in both his hands too, he ends up on a medical bed with beautiful nurses tending to his every need. Make no mistake, though—these nurses are vicious and no love sparks fly... Will young Yamada leave the hospital with his sanity intact? CHARACTER 'Begrudging Nurse' Tachibana Voice: Mirau Serious, responsible, and excellent at her job. However, after being stuck between difficult management and inexperienced juniors for so long, her expression is as austere as her gaze is icy—even to her patients and colleagues. Tachibana's compassion and love for nursing have all but faded, and she attends to Yamada in a brisk, soulless manner, driven only by her stubborn sense of duty. 'Insidious Nurse' Kurokawa Voice: Hikaru Isshiki Sneaky and self-deprecating, Kurokawa is quick to bow and scrape when caught out, but is equally adept at bad-mouthing others the second they're not in the room. A self-proclaimed 'trash human' with a penchant for petty revenge on all rivals, real or imagined. Avoids confronting people she sees as more powerful, but revels in bullying the weak. This nurse also loves to play the victim card—and believes all her own nonsense, too. Suspects Yamada to be fellow trash and thus a potential ally. 'Violent Nurse' Yamaguchi Voice: Misaki Kamishiro Former teen delinquent with a mean violent streak and obvious anger management issues—Yamaguchi is keen to let her fists do the talking for her. Perhaps due to her rough past, she doesn't take well to perceived slights and has a problem with following orders. Underneath, she's a hopeless romantic, although this softer side is never directed at Yamada. 'Demotivational Nurse' Hiramatsu Voice: Elena Kaibara Chronically lazy and unmotivated. Slacks off every chance she gets unless constantly supervised. Hiramatsu is thoroughly apathetic and indifferent, not least when tending to Yamada's needs. She gives off a languid anti-work aura wherever she goes, and takes her sweet time getting anything done. Sports a consistently sloppy and unkempt appearance. About the only time this nurse perks up is when she's been drinking.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1846330/header.jpg?t=1643161135",
    "Price": 19.99,
    "Developers": "Dark One!",
    "Publishers": "Shiravune",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1846330/ss_f743c624ff1b00e0ddd5658fca6a5c4f4ba681f4.1920x1080.jpg?t=1643161135,https://cdn.akamai.steamstatic.com/steam/apps/1846330/ss_0d3445ca663241b0f1eddc5cc2ead4c94f3ac4bc.1920x1080.jpg?t=1643161135,https://cdn.akamai.steamstatic.com/steam/apps/1846330/ss_4d836a53476766835c44bb859692290f81a912fc.1920x1080.jpg?t=1643161135,https://cdn.akamai.steamstatic.com/steam/apps/1846330/ss_99adf731add9d0cd2d2af673ab331616bf4b62c6.1920x1080.jpg?t=1643161135,https://cdn.akamai.steamstatic.com/steam/apps/1846330/ss_26167611bb3aed9e0ad3c82a44d889adcdc89829.1920x1080.jpg?t=1643161135",
    "Slug": "nope-nope-nurses",
    "Meta Title": "Nope Nope Nurses: Jan 25, 2022, Dark One! and Full Overview",
    "Meta Description": "Looking for information on Nope Nope Nurses? Check out the release date (Jan 25, 2022), developer insights from Dark One!, and a complete game summary.",
    "Alt Text Image": "Official header image for Nope Nope Nurses game - Steam 1846330",
    "Canonical URL": "https://gusku.site/game/nope-nope-nurses",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nope Nope Nurses\", \"description\": \"Looking for information on Nope Nope Nurses? Check out the release date (Jan 25, 2022), developer insights from Dark One!, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dark One!\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shiravune\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1846330/header.jpg?t=1643161135\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}