{
    "AppID": 517780,
    "Name": "Ogre",
    "Release date": "Oct 5, 2017",
    "About the game": "'A crowd-pleaser for the long-time faithful' - Rock, Paper, Shotgun 'Words will not suffice when it comes to me describing how much I loved getting down and dirty playing Ogre' - Digitally Downloaded 'A faithful re-engineering of a venerable classic' - Gaming Nexus 'This is probably the cheapest, fastest way to get into playing Ogre right now' - PCGamesN Ogre is a turn-based strategy game of mechanised warfare, requiring tactical decision-making and strategic thinking. It's the official video game adaptation of the legendary tabletop wargame from Steve Jackson Games, developed by the award-winning Auroch Digital. In the warfare of the near future, one type of unit inspires such fear that even allies keep a safe distance: the Ogre. These AI-powered tanks are so powerful they're the equivalent of a battalion of tanks and infantry. Hovercraft, tanks, marines, infantry, and the monstrous Ogres all take part in an endless world war. As a player, you take command and vie for supremacy on the irradiated battlefields of the future. Time-Tested, Compelling Gameplay: The Ogre tabletop game has withstood the test of time, captivating gamers for over forty years. This new release is the definitive digital edition of Ogre - including expanded G.E.V. rules for even more variety - and is the first digital adaptation since 1986. Meticulously Crafted Adaptation of the Original Game: Ogre veterans will be instantly be at home with this adaptation, while new players will find a deeply rewarding, turn-based strategy game. All-New Campaign: Engage in brand-new missions created in partnership with Steve Jackson Games. Multiplayer Capability: Test your skill against other players with online turn-based multiplayer gameplay with ranking and matchmaking, plus local 'hotseat' multiplayer. Single Player Skirmish and Tutorial Modes: Completely new to the world of Ogre ? Learn to play with our in-depth tutorial, then set up a custom game of Ogre and fight against devious AI opponents. Wide Variety of Units and Factions: Build out your faction with Light, Heavy, Superheavy, and Missile Tanks, G.E.V.s, Infantry, Marines, Howitzers, and Ogres (Mark I - Mark VI), while utilizing Trains and Command Posts as you see fit. Choose to play as either the North American Combine or the Paneuropean Federation. Varied Maps Offer Strategic Decisions: Roll through many types of terrain, across bodies of water, and make use of defensive areas to shield your units from attack. Scenario Creator: Make your own custom maps and scenarios, then easily share them with the world via Steam Workshop. Scenario Exporter: Save an image of your custom-made Scenario Editor map at super high resolution, perfect for printing out your own game boards for use with the tabletop game Playable Again and Again: Multiple game modes (including single player and multiplayer) plus achievements provide hundreds of hours of entertainment.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/517780/header.jpg?t=1654106615",
    "Price": 24.99,
    "Developers": "Auroch Digital",
    "Publishers": "Auroch Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_b0c754dce53e4a54aee63d4c7baa4d8794af5883.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_793cc6d46b159a0980c8511c50945c6394d9c4eb.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_5419ee9b0edbcba50e52ba95b4426a5b9aee1b4f.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_1ed6d4240ba223063089a641a21a3a34260ceb30.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_b7c9144905ddd5dbb0cc6def5cccd7063c6a4ba5.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_264c055606bfe9dd70962a03f1688e3564b6fd44.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_9d2a469d81d5312739764f723b18b216250b0b5a.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_cb018a643de80d2369e77d306cc000a69be10e1e.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_0d7bb80427c10c7b7cded4436b45da47630349c1.1920x1080.jpg?t=1654106615,https://cdn.akamai.steamstatic.com/steam/apps/517780/ss_48ef38a6f87bdd7b4585946d356d9dd985d526f0.1920x1080.jpg?t=1654106615",
    "Slug": "ogre",
    "Meta Title": "Ogre: Oct 5, 2017, Auroch Digital and Full Overview",
    "Meta Description": "Looking for information on Ogre? Check out the release date (Oct 5, 2017), developer insights from Auroch Digital, and a complete game summary.",
    "Alt Text Image": "Official header image for Ogre game - Steam 517780",
    "Canonical URL": "https://gusku.site/game/ogre",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ogre\", \"description\": \"Looking for information on Ogre? Check out the release date (Oct 5, 2017), developer insights from Auroch Digital, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 5, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Auroch Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Auroch Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/517780/header.jpg?t=1654106615\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}