{
    "AppID": 478020,
    "Name": "Old School 8-in-1 bundle",
    "Release date": "Jun 2, 2016",
    "About the game": "This bundle includes titles from 3 main genres: time management, match 3 and tower defence! One thing connects all these titles: they all are done in an old-school manner! Deeper description on each title could be found here: Hidden World An evil wizard has attacked a kingdom of beauty and enchantment, leaving a path of destruction in his wake! Your mission: Gather the forces of good and repair the broken land one village at a time! As you collect the resources you need, you must also fend off the wizard's followers, employ power-ups that give your workers a boost, and complete the renovations before time runs out. The citizens of Hidden World are counting on you, so don't delay! The Joy of Farming Help Joy turn a shabby homestead into the Farm of the Year by growing a variety of mouthwatering vegetables and turning them into the products her customers want. The Joy of Farming uses a side-view perspective, which adds the challenge of equipping your farm with ropes and ladders so your workers can fetch water and take their harvest to the storehouse. As you catch your breath between stages, you can upgrade your farm and purchase the plans to build ever-more elaborate production facilities. The Village Mage: Spellbinder Weave your healing magic in The Village Mage: Spellbinder, a captivating blend of match-three gameplay and time management madness. Take the role of a young apprentice who learns how to cure the illnesses of those in his village by collecting the ingredients for the potions his patients need and then delivering the medicine before they get impatient and leave. Let The Village Mage cast an unbreakable spell on you with its unique gameplay and enchanting visuals! Toy Factory Become the head of the biggest toy factory in the world as you race to save Christmas! Everyone's favorite holiday is just around the corner, but unless Santa's workers can meet their quota, the children of the world won't have presents to open Christmas morning. Fortunately, a budding entrepreneur named Wilma has the skills needed to keep hope alive! Guide her as she goes from running a small, family-owned shop to operating the very mega-plant owned by St. Nick himself, just by doing what she does best: making the customer happy! Whether a patron wants a plushy pup or an adorable doll, you've got to move fast and keep ahead of the game. Can you earn enough money by the end of each day to earn the Expert Status? Only if you serve the elves plenty of food and drink, and complete their orders fast enough to earn a big tip! It wouldn't hurt to hire a famous rock band to perform at your cafe, either. Between levels, enjoy the spoils of your hard work by spending the money you earn on countless awesome upgrades. With dozens of thrilling levels, rockin' music, and eye-popping visuals, Toy Factory is the perfect pick-up-and-play game for any time of year! Towers of Oz Return to the magical Land of Oz for an adventure beyond imagination! When wooden soldiers attack Oz, the chief wizard thinks up a clever solution: Transport Timothy, the great grandson of Dorothy, to Oz and ask him to save the day! But there's one problem: Timothy is just an ordinary kid who loves computers and his cat. When he lands in Oz with his precocious puss at his side, he can't believe the stories his great-grandmother told him were true! Help Timothy gain his footing in the wondrous 3D world of Oz and then guide him as he battles wooden soldiers, saber-toothed tigers, giant frogs and more in tense tactical battles. Unlock new attacks, use strategy to eliminate foes and defend your towers to the last brick! With simple point-and-click gameplay, eye-popping graphics and a storyline that will have you in stitches, Tower of Oz offers hours of fun for the whole family! Tory's Shop 'N' Rush When Tory's uncle retires and leaves her his store, she wonders if she has what it takes to succeed in the retail game. Give Tory a hand by stocking shelves, cashing out customers, cleaning up after messy teenagers and helping old ladies remember what they want to buy. You'll also need to keep an eye on the thief or he'll steal your goods! Between shifts, you can spend the money you earned on additional staff and upgrades for your store. Keep your customers happy in Tory's Shop 'n' Rush and you'll live to play another day! Spooky Mall When do ghosts come out to shop? Midnight! And that's when your shift begins when you play Spooky Mall! Manage five stores packed with the goods ghosts love in this ghoulishly fun time management game. Keep your shelves stocked, your customers happy and your employees hopping to earn the money you need to buy new equipment and upgrade your stores. To earn the gold ranking on each of the game's 100 fast-paced levels, you'll have to watch out for thieves, keep things clean and quickly respond to calls for help. It's all in a night's work as you run the classiest, and spookiest, mall around! The Golden Years: Way Out West Tame the Wild West in The Golden Years, a charming city building sim from the creators of Hotel Mogul! As you use your business savvy to squeeze every ounce of profit from your investments, you'll help an iron-willed woman and her young son overcome the sleazy maneuvers of a greedy ol' rip and save her guiltless husband from a life behind bars. With easy point-and-click controls, eye-catching visuals that bring the Wild West to dazzling life, and an epic story worthy of its famous setting, The Golden Years will provide hours of casual gaming thrills for the whole family!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/478020/header.jpg?t=1658419205",
    "Price": 7.99,
    "Developers": "Zoom2Games,Melesta,Alawar Southpoint",
    "Publishers": "Buka Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_8d09f3f018a61980285df2266c059e549eb75ff0.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_24d3a477f6c83ad7a41f1480afa2b564a5370670.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_5354d9b012ccb238954fcd7d16980a0e1f6a857d.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_24b0be66e5ceef3bd07465c07c9a36908a42e794.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_ad2e9b3de042a7f4533bbdf90b578f5789aa6b21.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_15d8fafe75dd26ea8772203d7b751440516b66bd.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_05e55fca2d2c289d881a67ed9956588082c6e554.1920x1080.jpg?t=1658419205,https://cdn.akamai.steamstatic.com/steam/apps/478020/ss_6e6f79d5576ba623debaba98167787b3ebad0aea.1920x1080.jpg?t=1658419205",
    "Slug": "old-school-8-in-1-bundle",
    "Meta Title": "Old School 8-in-1 bundle: Jun 2, 2016, Zoom2Games,Melesta...",
    "Meta Description": "Looking for information on Old School 8-in-1 bundle? Check out the release date (Jun 2, 2016), developer insights from Zoom2Games,Melesta,Alawar Southpo...",
    "Alt Text Image": "Official header image for Old School 8-in-1 bundle game - Steam 478020",
    "Canonical URL": "https://gusku.site/game/old-school-8-in-1-bundle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Old School 8-in-1 bundle\", \"description\": \"Looking for information on Old School 8-in-1 bundle? Check out the release date (Jun 2, 2016), developer insights from Zoom2Games,Melesta,Alawar Southpo...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoom2Games,Melesta,Alawar Southpoint\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Buka Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/478020/header.jpg?t=1658419205\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}