{
    "AppID": 1129310,
    "Name": "Receiver 2",
    "Release date": "Apr 14, 2020",
    "About the game": "THIS IS NO ARCADE SHOOTER, THIS IS 100% GUN MECHANIC REALISM Receiver 2 simulates every internal part of each firearm based on manufacturer schematics and gunsmithing resources. Learn exactly how each sidearm works, including how to load and unload them, clear malfunctions, and operate their safety features. NOT YOUR ORDINARY FPS You won't find any loot crates or bullet sponges here. Every enemy can be destroyed by a single well-placed shot, using ballistic simulation based on data from shooting incident reconstruction textbooks. Practice the Receiver virtues of resilience, focus, and courage to resist the Threat. FEATURES Sidearms modeled down to every spring and pin Enemies with physically-based damage models Ballistic modeling of ricochets, penetration, and bullet drop Train your mind to defend against the Mindkill Become literate in how guns actually operate FAQ What is Receiver? We created the original Receiver game for the '7-day FPS' challenge to explore gun handling mechanics, randomized levels, and unordered storytelling. With Receiver 2, we are doubling down on the aspects that made the original stand out: the detailed firearm controls and the tense, surreal atmosphere. Why are you so obsessed with guns? Love them or hate them, firearms are everywhere in our culture. If you want to understand it then you must understand them as well. While many games include firearms, we felt it was time to have a game that is actually about them. Are there people or animals to shoot in Receiver? We don't believe so. All our information suggests that the Threat will only dream killdrones to attack you after the Mindkill, but there's no way to be sure. How is Receiver 2 different from Receiver 1? Receiver 2 has the same basic gameplay structure as the first, but more of everything. There are many more sidearms available in Receiver 2, and while Receiver 1 simulated several moving parts for each gun, Receiver 2 simulates *all* of the moving parts. Does Receiver 2 have online multiplayer or VR support? No, Receiver 2 is designed to be a single-player experience played on a monitor with a mouse and keyboard. What is the Mindkill? You are not yet ready for that knowledge. Only a Receiver who has truly Awakened can understand the nature of the Threat.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1129310/header.jpg?t=1647981314",
    "Price": 19.99,
    "Developers": "Wolfire Games",
    "Publishers": "Wolfire Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1129310/ss_0dacc7a49a5a88290fc281670073fedba90ce04a.1920x1080.jpg?t=1647981314,https://cdn.akamai.steamstatic.com/steam/apps/1129310/ss_543d11a0fece35dd7699cc5ae897c2383df3521b.1920x1080.jpg?t=1647981314,https://cdn.akamai.steamstatic.com/steam/apps/1129310/ss_ff74fdd33a1bae7c6029d96cedae458b35b6562a.1920x1080.jpg?t=1647981314,https://cdn.akamai.steamstatic.com/steam/apps/1129310/ss_090210b128c15168f4922599ec833069b275b48a.1920x1080.jpg?t=1647981314,https://cdn.akamai.steamstatic.com/steam/apps/1129310/ss_2b1a4490c126b407d0f9a85aeffd17d7d80f1890.1920x1080.jpg?t=1647981314",
    "Slug": "receiver-2",
    "Meta Title": "Receiver 2: Apr 14, 2020, Wolfire Games and Full Overview",
    "Meta Description": "Looking for information on Receiver 2? Check out the release date (Apr 14, 2020), developer insights from Wolfire Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Receiver 2 game - Steam 1129310",
    "Canonical URL": "https://gusku.site/game/receiver-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Receiver 2\", \"description\": \"Looking for information on Receiver 2? Check out the release date (Apr 14, 2020), developer insights from Wolfire Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wolfire Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wolfire Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1129310/header.jpg?t=1647981314\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}