{
    "AppID": 949690,
    "Name": "Record of Lodoss War Online",
    "Release date": "Jan 15, 2019",
    "About the game": "Lodoss War Online is a 2D MMORPG launched in April 2017, a new RPG title developed game of L&amp;K Logic Korea that had a remarkable success in both Korea and Japan since 2015. It is based on Record of Lodoss War—a legendary fantasy novel in Japan, set in the cursed land of Lodoss, which recounts the adventures and rise and fall of heroes. It keeps you entertained by not only fully recreating heroes in the original story but introducing fascinating stories of new ones to the game. By becoming an adventurer in the world of Lodoss Islands, players can experience authentic storyline co-directed Mizno Ryo, the author of the original book “Record of Lodoss War”, while also immersing into a completely new story that would capture your interest instantly. Each class possesses their own unique active, passive, and reaction skill sets which are interchangeable, providing many different skill customizing. Combined with 1000+ magnificent items that provide different options, players can create their own unique character that suits their playstyle. Dowsing feature allows players to find rewards when activated in specific areas. One can acquire items necessary for the game or quests. Dowsing is activated by pressing the 'Space Bar' in hunting grounds. If a reward is hidden within the area, a treasure chest pops up for the players to claim. Groggy state occurs when the Fierce guage (Yellow bar) drops to 0 after being attacked by normal attacks or skills. Both players and monsters can become groggy. Some skills cause serious damage, or have reduced cooldown against groggy targets, having a great effect against them. Life Point and Mana Point recover faster in sanctuaries, where the stone statue of Goddess Marfa stands. Sanctuary serves as a resting place for players in hunting grounds. Also, when players die in hunting grounds with sanctuaries, they can revive near the statue. A golden tombstone for summoning Gold Monsters sometimes appear after a monster is eliminated. If the player destroys the tombstone, the monster comes out again as a Gold Monster. Players receive a great amount of EXP for eliminating Gold Monsters. The golden tombstone and the Gold Monster disappears after a certain period of time. Adventurer Ability allows players to plan how they want to develop their character. There are 5 abilities. Growth and Class abilities help players in combat. Adventure abilities help exploring the world of Lodoss. Hunting abilities, only obtainable from Labyrinths, helps against a specifit type of monsters. Partner abilities can be obtained by completing NPC Trust quests. There are 2 types of Reaction Skills available for players. 'Chain Reaction', and 'Job Reaction'. These skills are activated automatically when certain conditions are met. As players level up, they unlock higher tier reaction skills, which allows them to establish their own combat style according to the choice of reactions skills as their character advances. Exploration Dungeons are special dungeons with daily limit of entry. Players can make a paryth, choose the level of difficulty, then go hunting in difficult dungeons. Each dungeon has their own quests you can accept when players enter. Exploration Dungeons are completed after completing these quests, providing large amount of EXP. After completing the dungeon, players are teleported back to town after 300 seconds. [Exploration Dungeon Menu] 1. Exploration Dungeon Entry Number : Shows the number you can enter Exploration Dungeon. You can enter 2 times normally, 3 times on Sat &amp; Sun. 2. Mode Select : Choose between normal and hard difficulty. 3. Set Level Condition : Set level conditions you want to see for Exploration Dungeons. 4. Select Dungeon : Each dungeon has recommended level and party members. Select the dungeon you wish to enter. 5. Entry : You can enter the dungeon by click this button after fulfilling all conditions for entry. 6. Close : Close Exploration Dungeon menu by clicking this button. Labyrinth Dungeons are for players higher than level 30. After entering, players clear one chapter after another, moving up to next floor. Each Labyrinths are made of different number of floors to be cleared. After clearing Labyrinth Dungeon, players can gain 'Labyrinth Random Box', which contains Labyrinth EX items. These items have Labyrinth Options that enhances skill effect greatly, allowing further customization of player combat style. Guild War takes place on Sundays. Guild Masters need to apply within a preset time period, then attending guilds battle out for Honor Scores, with top ranking guilds registered in Hall of Fame. Battlefield opens on Saturdays. Players over 30 levels can participate, battling monsters and players to gain points for your side. There are 3 stages for the field as points accumulate, and all stages end when the final boss is eliminated. The side with higher score claims victory. Players can test each other's skills by duelling in the Arena. Character HP, Damage, Recovery are automatically adjusted according to duelling rules. There are no limitations as to which equipment participants can use, so prove yourself to be the best of all. ©水野良・グループSNE　　発行：株式会社ＫＡＤＯＫＡＷＡ ©GameOn Co., Ltd. All Rights Reserved. Developed by L&amp;K Co., Ltd.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/949690/header.jpg?t=1572546533",
    "Price": 0.0,
    "Developers": "L＆K CO., LTD",
    "Publishers": "L＆K CO., LTD",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/949690/ss_c5bab659d1c8712fbf03df8ab7159ab7318ecb68.1920x1080.jpg?t=1572546533,https://cdn.akamai.steamstatic.com/steam/apps/949690/ss_ecc4214b32311f758521b8ef28b1627c0d6e9f43.1920x1080.jpg?t=1572546533,https://cdn.akamai.steamstatic.com/steam/apps/949690/ss_1aa31bda1168ca907bf22a78ce19422e20895bad.1920x1080.jpg?t=1572546533,https://cdn.akamai.steamstatic.com/steam/apps/949690/ss_86917b77a05968c9530762293df146ec6f954bbd.1920x1080.jpg?t=1572546533,https://cdn.akamai.steamstatic.com/steam/apps/949690/ss_97a01862505dadea849467bbb049659c99d5f06d.1920x1080.jpg?t=1572546533",
    "Slug": "record-of-lodoss-war-online",
    "Meta Title": "Record of Lodoss War Online: Jan 15, 2019, L＆K CO., LTD a...",
    "Meta Description": "Looking for information on Record of Lodoss War Online? Check out the release date (Jan 15, 2019), developer insights from L＆K CO., LTD, and a complete ...",
    "Alt Text Image": "Official header image for Record of Lodoss War Online game - Steam 949690",
    "Canonical URL": "https://gusku.site/game/record-of-lodoss-war-online",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Record of Lodoss War Online\", \"description\": \"Looking for information on Record of Lodoss War Online? Check out the release date (Jan 15, 2019), developer insights from L\\uff06K CO., LTD, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 15, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"L\\uff06K CO., LTD\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"L\\uff06K CO., LTD\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/949690/header.jpg?t=1572546533\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}