{
    "AppID": 328070,
    "Name": "Reflex Arena",
    "Release date": "Mar 8, 2017",
    "About the game": "Reflex Arena is an old-school arena shooter that updates the dizzying speed and demanding precision of a classic arena FPS with the power of modern gaming technology. If you spent your youth gibbing your friends in Quake III Arena or Unreal Tournament, then Reflex Arena is what you’ve been missing. Reflex Arena recreates the lightning-fast twitch gameplay of the golden age of first-person arena shooters. It’s the best of both worlds: the speed and precision of a classic 1990s shooter, reborn inside a bleeding-edge 3D engine custom-built for the latest gaming hardware. In the 21st century, first-person shooters abandoned the brutal purity of Quake III Arena and Unreal Tournament, but indie studio Turbo Pixel decided it was time for a comeback. There are no chest-high walls to take cover behind here, and no profound insights into the horrors of war—Reflex Arena is nothing but fast, competitive, first-person fun. Just Check Out All these Features! Old-school arena shooter recreated in a gleaming modern game engine, welding 1990s twitch gameplay with all the benefits of modern technology. Smart matchmaking, support for group play, statistics tracking, championship ladders and everything else you need for competitive and social online multiplayer. Personal servers and full LAN support so you and your friends can play the way you want to without lag slowing you down. Classic gameplay modes including free-for-all and team deathmatch, capture the flag and tense one-on-one and two-on-two duels, plus mutators like big head, arena, and instagib. Random item drops let you personalize your character with hundreds of cosmetic upgrades, or trade them with other players using Steam Inventory. Build a custom map right inside the game, solo or multiplayer, then instantly test it in-game and upload it to the cloud for other players to check out. Customize your UI to show you the information you need the most using simple-to-learn Lua scripts, then share your custom UI with other players. Full Steam Workshop integration means you can easily browse and download community-created content. In-game replay editor with a full suite of features allows players to relive their glories and disappointments and taunt their defeated opponents with highlight reels and frag films New features coming soon! Smart and adaptable AI-controlled bots to keep you on your toes when nobody else is around—use them to hone your skills before plunging into online multiplayer. Competitive seasons will reward players for their skills in online matches by immortalizing them on a season leaderboard and awarding them points to spend in the store. Competitive points earned in online multiplayer match-ups will be redeemable for cosmetic items for personalizing the look of your combatant: character skins, golden weapons, and more. Turbo Pixel Studios is a small independent development team in Australia formed by industry veterans with decades of game development experience. Drawn together by a common love of the high-speed, high-performance, no-nonsense shooter experiences of their youth, the team came together around their debut project, Reflex Arena. This old-school competitive arena shooter is the epitome of everything the team loves: classic twitch gameplay enriched by two decades of advances in design and technology.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/328070/header.jpg?t=1520508771",
    "Price": 9.99,
    "Developers": "Turbo Pixel Studios",
    "Publishers": "Turbo Pixel Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_48527f17031da1a7e66049a34a1bb739e964989a.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_9535f7db52eb95ff541115d2a99301e66eb46900.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_03850440533e52fda315cf590c3189057ac356ec.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_f5192dc9a40d9753e2564b6b864d6a6dacb7ea81.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_be58183ed72bda4d9a222e5f20d17de0742844b1.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_bbf887e2b8c35d8cf58c48620f28429899138d6a.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_76f1eb9026d9e3ac811e3a5ff8ead2e71b879d11.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_ae3af23060a07975f16980a0ca9222ef49b755f4.1920x1080.jpg?t=1520508771,https://cdn.akamai.steamstatic.com/steam/apps/328070/ss_7e85f04c758846e6a304da14e8c5a273c1a9289b.1920x1080.jpg?t=1520508771",
    "Slug": "reflex-arena",
    "Meta Title": "Reflex Arena: Mar 8, 2017, Turbo Pixel Studios and Full O...",
    "Meta Description": "Looking for information on Reflex Arena? Check out the release date (Mar 8, 2017), developer insights from Turbo Pixel Studios, and a complete game summ...",
    "Alt Text Image": "Official header image for Reflex Arena game - Steam 328070",
    "Canonical URL": "https://gusku.site/game/reflex-arena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Reflex Arena\", \"description\": \"Looking for information on Reflex Arena? Check out the release date (Mar 8, 2017), developer insights from Turbo Pixel Studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Turbo Pixel Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Turbo Pixel Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/328070/header.jpg?t=1520508771\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}