{
    "AppID": 1458370,
    "Name": "Shuzzler",
    "Release date": "Jan 20, 2022",
    "About the game": "The classic word game first released on the iPhone has returned and is now available for the first time on Steam. The Steam edition comes with all new game modes and features to bring a fresh and challenging experience worthy of fans of the word game genre and newcomers alike. Game Play: Shuzzler involves spelling words according to criteria given by cards drawn from a deck. For example, a given card may require spelling words with exactly four letters, words that start with the letters 'SH-', or words for types of fruit, US states, or sports. Spell words with letter tiles in a grid by clicking the letter tiles individually or swiping them by click-and-dragging the mouse cursor to connect adjacent letter tiles. If you spell all of the words allotted for a card, you earn it and are awarded the card's point value in addition to the points you gained from spelling words. The objective is to earn all of the cards. Key Features: Unique game play Single-player and local PvP multiplayer or play against an AI opponent 32 fast-paced, timed levels available in single-player mode 200 unique cards and 60 category cards (e.g. colors, beverages, mammals, automobiles, etc.) featuring beautiful (mostly) original concept artwork Submit words using letter tiles in a grid by selecting tiles individually or swiping (i.e. click-and-dragging to connect adjacent tiles). Swiping earns 1-bonus point per letter tile Maximize your score by using bonus letter tiles and other special tiles in the letter tile grid 1, 2, and 3 card draw (see explanation below) In-game dictionary definitions (NEW!) Partial keyboard support Post-game stats Multiple Card Draw: The multiple card draw mechanic functions similarly to the way cards are drawn from the deck in a game of Solitaire. Either 2 or 3 cards are drawn at a time and are revealed in a stacked configuration (see graphic below). The top-most card must be earned before the underlying cards can be earned. Game Modes: In addition to solo play, the Steam version introduces quick play with two all new game modes, including Pass And Play mode that enables local multiplayer games for playing with friends and Versus AI mode that allows you to play against an AI opponent: Solo Play: Solo Play (i.e. single-player) offers 30 individually-crafted levels divided into 9 distinct categories: Food, Animal, Geography, English, Science, Home &amp; Living, Culture, Society, and Miscellaneous. Versus AI: Play a custom PVE game against an AI opponent with two different custom difficulty settings. Pass and Play: Play against a friend locally or remotely on the same device. Customizable game play options include time limit and card-draw (number of cards revealed from deck per draw).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1458370/header.jpg?t=1656034641",
    "Price": 14.99,
    "Developers": "DC Creation Studios",
    "Publishers": "DC Creation Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_7286d9749bf36105bec3f221b27d89612cbfa3b1.1920x1080.jpg?t=1656034641,https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_dc213b80059eab163b4bb70231b355bd6892cfaf.1920x1080.jpg?t=1656034641,https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_18ded2b4dfdc7c55b8723da88ac3f870bedbac48.1920x1080.jpg?t=1656034641,https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_ce63b18619ba8815c839d294d3ecc6523c75b625.1920x1080.jpg?t=1656034641,https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_047685de14004f72341e4c548248efc8e2578a43.1920x1080.jpg?t=1656034641,https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_42b7bbf22828cb32bbd267e0e251a6f0ad6f30f9.1920x1080.jpg?t=1656034641,https://cdn.akamai.steamstatic.com/steam/apps/1458370/ss_dea32ed07d22bcf8255ea6056a383e039798678a.1920x1080.jpg?t=1656034641",
    "Slug": "shuzzler",
    "Meta Title": "Shuzzler: Jan 20, 2022, DC Creation Studios and Full Over...",
    "Meta Description": "Looking for information on Shuzzler? Check out the release date (Jan 20, 2022), developer insights from DC Creation Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Shuzzler game - Steam 1458370",
    "Canonical URL": "https://gusku.site/game/shuzzler",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shuzzler\", \"description\": \"Looking for information on Shuzzler? Check out the release date (Jan 20, 2022), developer insights from DC Creation Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DC Creation Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DC Creation Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1458370/header.jpg?t=1656034641\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}