{
    "AppID": 1613950,
    "Name": "Sovereign Tea",
    "Release date": "Jul 30, 2021",
    "About the game": "Under threat of invasion from the Coffee Empire, the 12 Tea Princesses of the independent Tea Realms must overcome their differences to defend their lands. Gather resources and brew Tea Minions to your side to counter the enemy's strategy in this grid-based mechanics-focused title. Featuring 12 playable characters, 25 fine-tuned levels, and 40+ Tea Minions to brew and discover, Sovereign Tea aims to be a unique and fun video game for all lovers of strategy and tea. Gameplay In Sovereign Tea , you utilize your Tea Princesses to brew an army of Tea Minions. Tea Minions are your dispensable forces in the fight against the Coffee Empire. They all require resources to brew, some as simple as costing merely 1 tea leaf, others requiring bonus ingredients like blueberries and raspberries. Each Tea Minion has its own stats and abilities. Different Tea Minions grant you situational advantage to counter the Coffee Minions you will face. Units brewed with raspberries tend to trigger their abilities whenever they get hit by an enemy, so use them to counter multi-hit units. Units brewed with blueberries usually have a trigger to deal loads of damage, so force them into a situation where the enemy has no choice but to fight them. But that's not all: your Tea Princesses will imbue unique power into her Tea Minions. Sometimes you need territorial control, in which case Silver Needle's fast-but-fragile assassins are your key to victory. Other times you need to tank a lot of damage, so leverage the buffed healing properties of Shou Mei's minions. Maybe you need to fully disable the enemy for a turn, in which case you should strike hard with Chamomile's sleep-inducing brews. There are multiple paths to success in this game, and no single strategy will work throughout all levels in the title. Ultimately, it's up to your judgment to lead the Tea Realms to glory against the Coffee Empire. Story Before the Old War, there lived two factions: the Tea Princesses and the Coffee Regents. The Tea Princesses chose to rule their realms separately, allowing each princess to govern by her own virtue... but the Coffee Regents chose to unify their lands, forming the great and terrible Coffee Empire. The most eminent regent, the Coffee Emperor, rose mighty armies and waged blind conquest across the continent. Their domains now splintered and on the brink, the Tea Princesses must embark on a quest to reclaim their homelands... Characters and Levels There are 12 playable Tea Princesses in the game that you can recruit, divided into 4 teams: White Teas, Green Teas, Herbal Teas, and Black Teas. The game features a total of 25 replayable levels. From your arsenal of brewable and expendable minions, select your 9 brews per level and face off against the Coffee Empire! Content warning: This game contains mentions of sensitive themes, including death and suicide. The latter topic is brought up extremely sparingly and is only mentioned, never depicted. It always comes up naturally with context in dialogues and is never thrust upon the player for the purpose of shocking or surprising them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1613950/header.jpg?t=1627868122",
    "Price": 14.99,
    "Developers": "3 Halves Games",
    "Publishers": "3 Halves Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_6b99bf4493ec53e08232f70f53f29e6d1a4ef6c7.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_7ba06db25546fa1cd5d5911d5dd9ef763723ff4e.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_f8e08fd3e3e5f38bff36f612bbb7b1607276d6ce.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_d0c6d8233b66714e2acdd9a1278acb2ec78e96d6.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_3b79a4cc21a92f0eeb285e36c21238acf3f9010d.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_16e8394810faaa222dd70cc5deb09b9889effcbe.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_52740daf9029080336793f0b99ab88bcba793d6e.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_e32bd6198d768105da52815802f5247ac9c81439.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_25f04bf7f83fd2d4cb86dd7bc45cacefe10a854d.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_26a75f09dc3b4efe5f87a9976952c3ffa0fefaa1.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_016c0d8b75690130bc37f201d77667b96a6ce184.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_d139d7ace21125cba494f9f34f313fd842200c81.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_746c5796b9db543da546b0d5c140da9dd0b80a89.1920x1080.jpg?t=1627868122,https://cdn.akamai.steamstatic.com/steam/apps/1613950/ss_c8862bec5c7f0621b36d8283ae2130aa2f171996.1920x1080.jpg?t=1627868122",
    "Slug": "sovereign-tea",
    "Meta Title": "Sovereign Tea: Jul 30, 2021, 3 Halves Games and Full Over...",
    "Meta Description": "Looking for information on Sovereign Tea? Check out the release date (Jul 30, 2021), developer insights from 3 Halves Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Sovereign Tea game - Steam 1613950",
    "Canonical URL": "https://gusku.site/game/sovereign-tea",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sovereign Tea\", \"description\": \"Looking for information on Sovereign Tea? Check out the release date (Jul 30, 2021), developer insights from 3 Halves Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"3 Halves Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"3 Halves Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1613950/header.jpg?t=1627868122\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}