{
    "AppID": 1855380,
    "Name": "Spirits of Light",
    "Release date": "Jan 31, 2022",
    "About the game": "ABOUT THE GAME: Spirits of Light is an action-adventure game with RPG elements and a premise inspired by the tale of the little red hat. A game developed by a single person that hopes to provide you with a few hours of action, adventure and mysteries to be unraveled. For that, a fun and smooth mechanic inspired by the term Souls-like. Enemies, bosses and significant companions. A story full of mysteries. And an epic copyrighted soundtrack made especially for the game. You must choose your path! In Spirits of Light there will be times when your choice will be essential. What will define the end and how far you will come on your journey. Explore 'The Idril Forest' with its secrets and dangers! Much of the game takes place in the Idril forest. A place full of beauty, mysteries and fascination as well as traps, monsters and powerful beings. Face scary monsters that sprout from the forest! On your journey you will encounter monsters and scary creatures. At this point you will have to prove your skills and expertise in combat. Challenge powerful bosses imbued with strength and power. You will face great challenges and to move forward you will have to be able to conquer them, but everything will depend on difficult choices. CHARACTERISTICS: Simple but beautiful graphics. Fantastic combat and awesome moments. Face unique bosses. Level Up system like RPGs. Amazing and unique music. Weapons and movesets different ones to try out. Unravel the riddles behind the plot. PREMISE: Green fields was its name, as green was more present than any other color. From the huge trees covered in leaves on summer days to the grass that shines in the sun. The shade of green was great, but not the only one. The blue, sparkling in the mornings and deep in the waters. Yellow, precious as gold in sunlight. And a small neighborhood gave the environment another tone. He being more special than any of the others. Like an enigma, dressed in mystery. Like a yearning for the final pages of a book. A sage called it the 'Beginning and Ending' prophecy. Someday. When no one waits. A dragon will cross the skies and a great red Being will descend to earth, destroy and rebuild this world to take it as his own. And nobody will be able to avoid it. But one day someone disagreed with this premonition... Then... Soon the verdant tone of this place will be usurped by the red, harmless and innocent as it appears. What's your wish? Avoid? To allow? Following the wrong path can take you to places you have never seen before, shrouded in curiosity and fascination. But fear walks by your side. So. Seek strength! There are those who ask for help. For fearful will be your journey. Where you will find beings of great strength and power. Know that the end is saved only to those who don't give up. Do not fear defeat. Don't fear the pain. Fear not the darkness. And always choose to move forward. No matter how difficult your options are. Because these are the ones who have... Keryel will pay a visit to her grandmother at her mother's request, but the path is fraught with danger... And now with all her strength and determination she will have to face her fears in pursuit of her goal. 'The darkness can be so great, but it will never be enough to suppress the light that unveils the unknown present in every human being on the face of the Earth.'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1855380/header.jpg?t=1643627786",
    "Price": 5.99,
    "Developers": "Sunlight Studio - Davi Valentim",
    "Publishers": "Sunlight Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1855380/ss_51ef3a27d4a0e0e3d4b9576879a4f3ec6997b75e.1920x1080.jpg?t=1643627786,https://cdn.akamai.steamstatic.com/steam/apps/1855380/ss_5941be4ae5ad354e61eda857a102cb78eddbf21d.1920x1080.jpg?t=1643627786,https://cdn.akamai.steamstatic.com/steam/apps/1855380/ss_2a3588967084c7276d53fbc8d9cc14476689e224.1920x1080.jpg?t=1643627786,https://cdn.akamai.steamstatic.com/steam/apps/1855380/ss_305d7b3946679dc292d21c3a01d5188ac6644345.1920x1080.jpg?t=1643627786,https://cdn.akamai.steamstatic.com/steam/apps/1855380/ss_f8832e4398900708a5c41488563de17357b3ac47.1920x1080.jpg?t=1643627786",
    "Slug": "spirits-of-light",
    "Meta Title": "Spirits of Light: Jan 31, 2022, Sunlight Studio - Davi Va...",
    "Meta Description": "Looking for information on Spirits of Light? Check out the release date (Jan 31, 2022), developer insights from Sunlight Studio - Davi Valentim, and a c...",
    "Alt Text Image": "Official header image for Spirits of Light game - Steam 1855380",
    "Canonical URL": "https://gusku.site/game/spirits-of-light",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spirits of Light\", \"description\": \"Looking for information on Spirits of Light? Check out the release date (Jan 31, 2022), developer insights from Sunlight Studio - Davi Valentim, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sunlight Studio - Davi Valentim\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sunlight Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1855380/header.jpg?t=1643627786\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}