{
    "AppID": 466660,
    "Name": "Stash",
    "Release date": "Sep 7, 2017",
    "About the game": "Stash is bringing the magic back to MMOs. With turn based combat, customizable housing as a core feature, a unique tabletop art style, and more loot than you can fit in a portable hole, Stash delivers a fun, engaging experience unlike any other MMO. Stash is set in the fantasy world of Primordiax - a game world featured in 6 previous games by Frogdice released over the last 20 years. The intriguing world story has evolved through decades of staff plot lines and the actions of hundreds of thousands of players. NOTE: As is very common for MMORPGs, you will have to create an account to play. You do not login with your Steam account. That is the only way we can provide full support for our customers. Stash's core features include: Turn based combat on a tactical grid . Great Community : The most incredible thing about Frogdice and all of our games is the community. Our players are a major reason our games are so special and their passion and love for our game world is part of a sacred trust we cherish. Housing as a core feature . Your Base of Operations (BOO) starts as a humble bedroll and can be built and customized into a mighty fortress where you stash your loot. Dungeons : Shared world dungeons and private instanced dungeons for your dungeon crawling cravings. Character customization via class, race, build, gear, cosmetics, costumes, pets, mounts, and more. Crafting : Use, sell, trade, or enter items into competitions. Be a full time crafter or merchant. Exploration : A huge world for you to discover with hundreds of unique locations. Awesome world story with a unique twist. Players affect this story and the entire world profoundly. Our staff runs world events and plot lines. Clans : Join with friends and compete for dominance. Loot : Tons and tons of loot, and with rare exceptions we don’t do bind on pickup/equip. PvP : In Development: Group and solo leaderboards. Dueling. Clan wars and battles. Things About Stash You Will Either Love... or Hate Stash is a very unique game that is not your typical MMO. Is it the dream game you've been waiting years for or the complete opposite? Review this list carefully as we do not want to waste anyone's time with a game not suited to their tastes: Stash is a complex, deep game that requires skill, thought, and effort to excel. It also takes time to learn. We do not have a guided tutorial . We have guides , videos, in-game tutorial help screens, and both staff and community volunteers who love helping people. If you prefer games with a 1 hour automatic guided tutorial that teaches you how to play, you may have trouble with Stash. Stash embraces the grind. We believe we've made it fun, and it definitely isn't fast. Your accomplishments are meaningful and you won't get passed up if you go on vacation for a week. This goes for combat, crafting, farming, empire building, and pretty much everything. Stash is challenging but approachable. You can make Stash easier with dungeon difficulty settings, partying with other players, or simply focusing on easier content. But some battles can be quite difficult with good strategy and tactics heavily rewarded. Fleeing from battle is not easy or guaranteed. If you die after a certain level, there is a death penalty (you do not lose XP, levels, or items, but instead receive a small amount of XP debt - half your earned XP pays off debt until it is gone, but you can still level up and progress even while you have xp debt!). Questing is not a big part of Stash . We don't like quest grinds. Stash is more of a sandbox-style game. We have quest-type activities (we call them tasks), but they are not a huge focus of the game. The world is open to you to set your own goals and priorities and we do not tell you what you have to do next. Crafting and Merchants are big parts of the game . The best gear in the game is crafted gear, and many systems allow for merchants to play an important role in the economy. Your BOO (Base of Operations or house) is a major aspect of character progression. Expanding and upgrading your BOO allows more and faster crafting, more market options, more storage, and more fun. If you love housing then you will probably love Stash. Storage and carrying capacity are part of character progression. Unlocking more bag slots, getting better bags, upgrading your stash, upgrading your stall, and other storage options are all aspects of advancing your character. Some people think this is great. Some people think this is tedious. If it sounds tedious, Stash is not for you. There is no Auction House. Every player has their own merchant stall and can advertise items in the newspapers (which are divided by item category). Our economy encourages people to build their reputation as a merchant or craftsman. Auction Houses are cool but create race to the bottom pricing that leaves little room for sellers to compete on anything other than price. If you like a market that provides opportunities for full time merchants and market arbitrage, you will enjoy Stash. Stash is currently light on story, but that is changing fast. You, as a player, will be a huge part of that. Our studio has run a roleplay required, all text MUD for 21 years. Please trust us that story and lore are near and dear to our heart, and will be a huge part of Stash. The World will grow based on player actions. You currently have access to one major capital city, 9 major regions, and 41 dungeons. As the story unfolds, players will open up more of the world. If you prefer an MMO with the entire world available for exploration right away, you might be disappointed. If you like the idea of shaping and unlocking the world as a community, you will be thrilled. We have many unique game mechanics rarely or never seen in other MMOs. We have a fresh take on stat training, healing, character customization, gear upgrading, and many other things. If that sounds fun and interesting, Stash is your game. Stash has only just begun. We are a small team of passionate, indie devs who want to create a game you can call home for many years to come. If you want to be part of that growth, you will love Stash. If you don't want to be part of that journey, you might want to wait a bit. Extra Packages for Stash There are two packages available which include the game, your $ value worth of Medallions (virtual currency), and some bonus items: Citizen Package Total Value: $22.00 $15 worth of medallions Mount: donkey +25% XP Booster (2 hour duration) x2 Healing Potion x5 Mana Potion x5 Founder's Package Total Value: $75.00+ $50 worth of medallions Mount: donkey +25% XP Booster (2 hour duration) x4 Healing Potion x10 Mana Potion x10 Founder's Cloak - Fancy cloak that provides +20% XP until you reach level 20. Founder's Monument - Special outdoor item for your Base of Operations (BOO) Founders Weapon Display Case - Special interior item for your BOO Click here for step by step instructions on how to get your medallions and in-game bonus items.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/466660/header.jpg?t=1576103474",
    "Price": 0.0,
    "Developers": "Frogdice",
    "Publishers": "Frogdice",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_aea878ccc094d11337a8838358ef2dce80bc1cd6.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_0325937cbee68de268e816302848912d0554a67b.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_f990d5b7105529c96c41d77194101cd683c7b996.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_27d2f6a931f613e8f0fe30b7be2b67edb2ee1e5e.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_09c2edbd38fe8a5fbd2b9a2bf37284a175174cdd.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_7279520be4f406f6ba81ec05af526be8fce7486e.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_328638f47c83010bc835665566a85cf4d407d8b4.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_f1dab04f9b7c71a6f4df0314420319a0192d6aeb.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_184c1504b964fc1c6bf09e04415331a988a7e777.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_ff503dd633e0430ac33f4b149f6843dc97b74862.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_dff8db83cff0821993cd66afadbc4d16050bfa6c.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_6027486bd6ea806dc3a84651d821ba463c200603.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_f985d3aa0ca620033a3f32be9ee2009346eed79c.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_862e1d9835ee14bba0174e8f605fa9c2bc94da41.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_0f8c171b11a1a6c772b81420c6379fa651ac9c2f.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_2e85b0be20bd48fec4c7ba3380fcfae4645be33a.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_10f0bfba85406c63ce6bcc3e1704074763f687a1.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_a5c048c583a947d466dc0be60ff458cc28bcf473.1920x1080.jpg?t=1576103474,https://cdn.akamai.steamstatic.com/steam/apps/466660/ss_061b2d097203e138800ef286aee0d137d18d2314.1920x1080.jpg?t=1576103474",
    "Slug": "stash",
    "Meta Title": "Stash: Sep 7, 2017, Frogdice and Full Overview",
    "Meta Description": "Looking for information on Stash? Check out the release date (Sep 7, 2017), developer insights from Frogdice, and a complete game summary.",
    "Alt Text Image": "Official header image for Stash game - Steam 466660",
    "Canonical URL": "https://gusku.site/game/stash",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stash\", \"description\": \"Looking for information on Stash? Check out the release date (Sep 7, 2017), developer insights from Frogdice, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Frogdice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Frogdice\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/466660/header.jpg?t=1576103474\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}