{
    "AppID": 546700,
    "Name": "The Butterfly Sign",
    "Release date": "Dec 13, 2016",
    "About the game": "The Butterfly Sign is a first person detective story putting players in shoes of the lone survivor and the only witness to a disastrous incident. The protagonist’s destiny depends on his memories. That is why he dares to take a desperate measure. He takes an experimental drug 'Rammex' which immerses him in the depths of his mind and precisely restores all the events occurred to him. In his memories, the protagonist will discover the ones responsible for the disaster, collecting clues bit by bit… Explore Memority hospital and its premises, learn its secrets and restore the chain of events that took place here. Solve the puzzles and murders committed at Memority. Find clues, compare the facts and avoid tricky obstacles in your way. Penetrate into the new, previously inaccessible memories. Make conclusions and choose the correct route, because all your decisions affect the outcome of the game and influence the fact whether you can get to the truth. Thuth that was lost in your own mind… - Excellent graphics achieved with Unreal Engine 4 – the most advanced game engine in the world. We used photogrammetry technology and high-resolution textures to create the world of The Butterfly Sign as beautiful as possible. - Non-linear dialogues and the ability to make choices which will affect the course of the story and the ending. The progress of the dialogue always depends on your location. And you always have the opportunity to make choices, sometimes insignificant, sometimes important for the further story. - Brainstorm your head with investigation of murders, puzzles and mysteries. The Butterfly Sign develops the player’s skills of criminology and deduction. For those players who prefer the story, there is always the easiest difficulty level, but if you are really up to the true detective, you have a variety of other levels, including the hardest one causing the game restart after a single death. - In The Butterfly Sign, the events take place in the past and in the present simultaneously. - The atmospheric sound. We have paid a great attention to sound effects in The Butterfly Sign. Every lamp, every water drop falling from the ceiling has its own sound. Each room boasts of its own unique ambience corresponding to its style and mood. The action takes place in present. The protagonist, Jack, was found not far from Memority hospital, where an experimental drug called Rammex had been developed. It was created to help patients recover their memories. But the hospital was attacked. The drug was stolen, and all the staff and patients were killed. Explosion and conflagration destroyed a part of the hospital. And Jack was the only survivor. As a result of a strong explosion, Jack lost some of his memory, he remembers only small fragments of what have happened. Jack is helped by Dr. Romanov – the chief scientist of Memority hospital and the mastermind behind the drug. During the whole game, the protagonist will be staying in a hospital bed, and all the gameplay will occur in his memories restored with Rammex. The game world is divided into two parts: the real world, where the hero is confined to a hospital bed, and the world of his memories, where he will spend most of his time. The Butterfly Sign also has non-linear dialogues, and all your decisions will affect the outcome of the story at the very end. Necessary Evil The Butterfly Sign is divided into three chapters. In the first chapter, Jack, walking through the alley of his own memory, becomes the eyes and ears of Dr. Romanov. The drug 'Rammex' helps him do it. The main character tries to recover the fragments of his memory in order to find the ones responsible for the attack on Memority. Hovewer, the further he goes, the more he realizes that everything that happened was the necessary evil... Human Error Memority had been developing 'Rammex' to help sick patients recover their lost memory. According to the Memority scientists, 'Rammex' was able to quickly restore human nerve cells. It would have been a real revolution in medicine, a cure for many illnesses. But turning over the pages of his own mind and investigating the incident, Jack begins to realize how unreal his world is, and what a beautiful lie all this is... Wreck of my Warship In the end, to find the one responsible for the attack on Memority, Jack has to collect all the pieces of his memory together. He goes to the dam, where he last saw the mercenaries, but instead finds only one person who jumps down from the dam trying to commit suicide. Realizing that he has already been there, and the answer is in his head, Jack follows the self-murderer and jumps, because it’s the only chance to remember ...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/546700/header.jpg?t=1626564204",
    "Price": 4.99,
    "Developers": "Quantum Phoenix Studio,Michail Romanov,Denis Esie,Bogdan Rozymny,Artem Lynev,Artur Samoylenko",
    "Publishers": "Quantum Phoenix Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_6adc4e17d4ec2cf61eab13a886fcb27c8d59662f.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_41548b74baff5b3521b3a157459c788f6888d7b9.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_189db67651c1c878ff84d6e092ad1ed2b5b51808.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_30fa604c2009d9fc118db2b8318956357148389e.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_be96862dee766ad3755b2e2c508a5b00dcc0fd22.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_ac43983570e2d2bc009f91741c84281180c82e5d.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_3d7b5e5a79aa9140945f53abf79da2fac07348a2.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_da7a986c2105e04eb1105839aaa4493c7643ed88.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_0e8781a794a8fb5ccb2be6aff32ddac08ccef14f.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_c3f77b21486f074db37405659fd11f0f78f52548.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_33d38093aeecb628fd3c3e5d4c283eeb5016d981.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_e2f3034e92b747264e6f48f4d6568d6086ce6628.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_7874ef56aebb862aabfa077f6f6c9c7f669646e3.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_614e62dc02a2342fd1e78c16babefb563a5230ab.1920x1080.jpg?t=1626564204,https://cdn.akamai.steamstatic.com/steam/apps/546700/ss_2d29b0f4bec72b7bf8f092ecf97d1c57ca4126c3.1920x1080.jpg?t=1626564204",
    "Slug": "the-butterfly-sign",
    "Meta Title": "The Butterfly Sign: Dec 13, 2016, Quantum Phoenix Studio,...",
    "Meta Description": "Looking for information on The Butterfly Sign? Check out the release date (Dec 13, 2016), developer insights from Quantum Phoenix Studio,Michail Romanov...",
    "Alt Text Image": "Official header image for The Butterfly Sign game - Steam 546700",
    "Canonical URL": "https://gusku.site/game/the-butterfly-sign",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Butterfly Sign\", \"description\": \"Looking for information on The Butterfly Sign? Check out the release date (Dec 13, 2016), developer insights from Quantum Phoenix Studio,Michail Romanov...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 13, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Quantum Phoenix Studio,Michail Romanov,Denis Esie,Bogdan Rozymny,Artem Lynev,Artur Samoylenko\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Quantum Phoenix Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/546700/header.jpg?t=1626564204\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}