{
    "AppID": 505090,
    "Name": "The Charming Empire",
    "Release date": "Apr 18, 2017",
    "About the game": "------------------------------- * This game’s story is the same as the “The Charming Empire(帝國カレイド-万華の革命-)” smartphone application * Includes all of the main scenarios released as paid content. (Puzzle games are not included) * Features full voice acting, but MC(heroine) has no voice. ------------------------------- *What is “The Charming Empire”? “The Charming Empire” is a dating simulation game set in the Taisho Roman era of Japanese history. Each scenario is fully voiced, featuring the work of voice actors such as: Tetsuya Kakihara, Toshiki Masuda, Takuya Eguchi, Toshiyuki Toyonaga, Kenjiro Tsuda and more. Teikoku Kaleido’s detailed and gorgeous artwork is illustrated by Mitsuya Fuji, who currently creates artwork for other mobile games and CDs. *Story Our heroine, Amane Kosaka, was living a simple yet happy life in the countryside until one day she was suddenly taken away to live in the empire, summoned by her brother Soshi Amazaki -- the current ruler. Though she was unaware of the underlying circumstances, she finds herself brought to this lively and palpable central city. Living in the immaculate royal palace, our heroine comes to learn that the empire might not be as joyful as it seems. Her brother is no longer the gentle man she once knew... A corrupt organization secretly runs things behind the scenes... The heroine’s fate guides her down the path of love. *Character Introductions ＝＝＝＝＝＝＝＝＝＝＝＝＝ Toki Tanba CV: Tetsuya Kakihara The flirtatious cafe owner Toki owns a cafe in the city that serves tea and various confections. He is particularly kind to women and loved by all of his customers. But behind that kind smile, however... “Sorry for the wait. This here is the pride of the cafe, our signature baumkuchen.” ＝＝＝＝＝＝＝＝＝＝＝＝＝ Kei Yoshimine CV: Toshiki Masuda The captive former prince Kei is the heroine’s private tutor. The prince of a fallen country, he is now a captive of the empire. Perhaps because of those circumstances, he treats the heroine harshly. “My name is Kei Yoshimine. Starting today I’ll be teaching you foreign language and dance. Any questions?” ＝＝＝＝＝＝＝＝＝＝＝＝＝ Koichiro Sera CV: Takuya Eguchi The reticent bodyguard Sera is the heroine’s unsociable bodyguard. Not a minute goes buy where Sera isn’t devoted to his duties, and he also has a stubborn side. He bares distrust towards Lord Soji’s dictatorship. “Stay close to me.” ＝＝＝＝＝＝＝＝＝＝＝＝＝ Kagemitsu Togawa CV: Toshiyuki Toyonaga The mild-mannered aide Kagemitsu is Lord Soshi’s right hand man. He is a childhood friend of both our heroine and Soshi. Kagemitsu worries about the future under Lord Soshi’s dictatorship. “You’re so kind...just how I remember you.” ＝＝＝＝＝＝＝＝＝＝＝＝＝ Soshi Amazaki CV: Kenjiro Tsuda The aloof lord Soshi holds the most powerful seat in all the empire. Only trusting himself, he rejects the opinions of others as he continues his dictatorship agenda -- breeding animosity amongst the people. He’s a cold man who sees even his own sister as a political tool. “I see you’ve arrived safely. From now forth, you’ll be living here.” ＝＝＝＝＝＝＝＝＝＝＝＝＝ * You’ll love The Charming Empire if you... * Are interested in Japanese history and culture * Want to hear truly captivating voice acting * Enjoy dating simulation games * Admire Mitsuya Fuji’s artwork ------------------- Illustrations: Mitsuya Fuji",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/505090/header.jpg?t=1618564891",
    "Price": 29.99,
    "Developers": "OperaHouse Corporation",
    "Publishers": "Dogenzaka Lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_eb71a373cb0a4ded1dfca52cccf1f3595a70873f.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_7bc2e745b06e2dbdf28d5852b36c4dbbf18759a5.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_c8d9b0517527bec0c5444bdd568ef6cfa044042a.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_bdaad4cf15f69bcc4952235b4e574931550e5b11.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_6d6fef10f236038e860800578a201fad785e7fb2.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_c5d38e8aaa216d83b14b7b9293d91f2b86ed1145.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_2480b2d6f8f15815eae827d7936b4ed831b7a5a1.1920x1080.jpg?t=1618564891,https://cdn.akamai.steamstatic.com/steam/apps/505090/ss_8b8061975a0ea7ceb51574a92ca5960790914f1d.1920x1080.jpg?t=1618564891",
    "Slug": "the-charming-empire",
    "Meta Title": "The Charming Empire: Apr 18, 2017, OperaHouse Corporation...",
    "Meta Description": "Looking for information on The Charming Empire? Check out the release date (Apr 18, 2017), developer insights from OperaHouse Corporation, and a complet...",
    "Alt Text Image": "Official header image for The Charming Empire game - Steam 505090",
    "Canonical URL": "https://gusku.site/game/the-charming-empire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Charming Empire\", \"description\": \"Looking for information on The Charming Empire? Check out the release date (Apr 18, 2017), developer insights from OperaHouse Corporation, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"OperaHouse Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dogenzaka Lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/505090/header.jpg?t=1618564891\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}