{
    "AppID": 940680,
    "Name": "The Textorcist: The Story of Ray Bibbia",
    "Release date": "Feb 14, 2019",
    "About the game": "Get ready for an electrifying mix between bullet hell and typing game! Dodge bullets while typing exorcisms at the very same time: turn on both sides of your brain and jump into the adventure of Ray Bibbia, a private exorcist who's going to face the threats of a demonic outbreak and deal with his dark and sinful past at the same time! A city in decay, streets filled with thugs, crime and censorship and only one man to stop it all. Groundbreaking gameplay, exorcists, demons, metal singers, pimps, the Pope, drama, bad jokes and tons of hardcore action-filled boss battles for the first type ‘em up game ever realized. In order to defeat the forces of evil, learn how to type your exorcisms with your keyboard or with your joypad WHILE dodging tons of bullets, dealing with puddles of barf, defusing bombs, singing at the mic of a metal show and more during intense Boss Battles: easier said than done. Hold your Bible tight, both hands needed! Rome is the theatre of our adventure, discover new locations and fight in one of the biggest metropolis in history, home of some of the craziest characters and enemies! Behind a demonic outbreak, unearthly forces are scheming to seize power and subvert the order of the the biggest religious organization in Rome: The Holy Church has reached unlimited powers over the streets of the city, but how can our protagonist be sure of their good deeds? Unravel the demonic plot aimed to overturn the order in the city and put together the pieces of the dark past behind Ray Bibbia! From Goth maids to gun-crazed gangsters and the Pope himself, Ray will get his hands dirty by exploring a great variety of locations to solve a mystery that’s going to grow heavier as it takes shape. Who’s gonna turn out to be a friend and who’s gonna stab Ray behind his back? Are you a fast typer? Can you read and spell latin while you dodge bullets? THIS is the game you're looking for! Real exorcisms, english, latin and more! Avoid making mistakes and reach the highest combo! Compete with your friends by spelling the “perfect exorcism” and compare with their scores on online leaderboards! Forgotten Relics Update Features: Boss Rush Mode (Speedrunners welcome!) Story Mode now offers 30 (+1) Trinkets Hardcore Boss Fights Updated Leader Boards Main Features: An intense storytelling Tons of bullets Lots of typing 10 Boss fights Challenging twisted typing mechanics for every boss Type even to open a door Type on a Holyvetti computer Show it off with online leaderboards Play with the keyboard for a typing experience or with a gamepad for a rhythm experience Original Soundtrack composed by GosT Some more Bullets All these features and even more, if you're a fan of shooters, a masochist, a wannabe exorcist, or you just need some black comedy in your life, don't miss The Textorcist!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/940680/header.jpg?t=1647592161",
    "Price": 14.99,
    "Developers": "MorbidWare",
    "Publishers": "Headup",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_bfbd31bb0f90bcfa58a776dbf7af46e932dbdb54.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_3151c76709c1fd6d594f3dd3a115fed5f7d28f7a.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_a64b6bfa6eb230ad3b656b3f3bdba320b76241f1.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_07156ff5afff999d2f9032b81229eff097fc75c7.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_c9609cff926f7bed032c5e6748aee6b4a0969c56.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_65c54c7a70a33e2884e73a9047aa80167d72e793.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_da35bbf80795c3be16027e2d5f1877dd62e41346.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_7b10a375ff90548e60b7f2641d0b0757ce844cba.1920x1080.jpg?t=1647592161,https://cdn.akamai.steamstatic.com/steam/apps/940680/ss_07b6e9e97f83e6239f0e67da83cc8b06d1f1b274.1920x1080.jpg?t=1647592161",
    "Slug": "the-textorcist-the-story-of-ray-bibbia",
    "Meta Title": "The Textorcist: The Story of Ray Bibbia: Feb 14, 2019, Mo...",
    "Meta Description": "Looking for information on The Textorcist: The Story of Ray Bibbia? Check out the release date (Feb 14, 2019), developer insights from MorbidWare, and a...",
    "Alt Text Image": "Official header image for The Textorcist: The Story of Ray Bibbia game - Steam 940680",
    "Canonical URL": "https://gusku.site/game/the-textorcist-the-story-of-ray-bibbia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Textorcist: The Story of Ray Bibbia\", \"description\": \"Looking for information on The Textorcist: The Story of Ray Bibbia? Check out the release date (Feb 14, 2019), developer insights from MorbidWare, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"MorbidWare\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Headup\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/940680/header.jpg?t=1647592161\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}