{
    "AppID": 1497640,
    "Name": "Traitors in Salem",
    "Release date": "Apr 22, 2022",
    "About the game": "The Town of Salem was in a conflict that lasted nearly a decade in which countless souls were lost. The innocents of the Town banded together and banished the Necronomicon. The power the book held over the minds of the townsfolk was erased. An era of uneasy peace began. But, the darkness could not be sealed forever. Once again, dark magic threatens to send Salem into chaos. Play with up to 15 players online and use your wits and abilities to find the Traitors who are possessed and hold trials to decide their fate. Or, as a Traitor, unleash your inner evil onto innocents. Roles Every player gets a role. Use your roles unique abilities to gain information, deceive your enemies, or kill other players. Town Members Deal with all of the Traitors to the Town, or complete all of the quests needed to banish the Necronomicon in order to win! Use your role's abilities to do things like reveal yourself to the town as innocent, track down a killer from a dead body, and even shoot the suspicious! Do what you can to counter-act the powerful magic used by the Traitors. Find secret passages, flag down ships, and fix broken bridges to help get around the town. Use Telescopes, confer with Ghost NPCs, use the Runeboard, and more to gain information about your so-called innocent friends. Use the Town Bell to call a Town Meeting if you see anything out of the ordinary. Report a body to call a Town Meeting. Hang the suspicious at the gallows! Traitors Sneaking and Stealth are your best allies. Kill Town members to protect the Necronomicon! Use your role's abilities to do things like burn away dead bodies, convert Town members over to the side of Evil, and block all Town members from using abilities! Use your Spells granted to you by the Necronomicon to give yourself the advantage over the Town. Almost anything a Town member can do, you can too! Begin your Quest! Players can interact with this NPC to start different quests that can contribute to the towns victory, give you special personal perks, or unlock different town wide abilities! Features Roles : Wide variety of roles for both Traitors and Town members. Create Role Lists : Choose which Roles you want in your Role Deck during the lobby. Share your Role Deck : Share pre-built decks with your friends! Banning Roles : On top of choosing roles to be in the game, you can ban roles to ensure they don't appear. Choose your Adventure : You can also customize the game itself! Many different options to change gameplay. In-game text chat : Chat with other players during lobby, discussion, and trial. Familiar : Everything that you love about Town of Salem, but improved! Roam the Town : With freedom of movement, explore Salem in a way you never have before. Game-Wide Voice chat : Our Voice Chat is integrated (built-in) to Traitors in Salem. Global voice is available during discussion, trial, and lobbies. Proximity Voice : Proximity voice chat for chatting with those near you (enforced by the server) during gameplay.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1497640/header.jpg?t=1652220007",
    "Price": 3.99,
    "Developers": "BlankMediaGames",
    "Publishers": "BlankMediaGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_29da37dce1f7441263736400cddc453cbc24778c.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_af3d9297b143036c38f6e84928ddda11a6dec5b5.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_6d55d31f8909dc2b5b02bddcc77587eb474f2d74.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_ad94b8188bb8afd67316c2775cd2037421faa1bf.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_1cf4bc6d97bb9c54742e7f3eea4d67372467a754.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_99c1460235f34d3541a286c22f885a4e2918118c.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_0d3138a0a22784dc3330e37b7191c5ecbe17ed61.1920x1080.jpg?t=1652220007,https://cdn.akamai.steamstatic.com/steam/apps/1497640/ss_b7442ee9bb21178abd6d3f1ab7fa192904aaf94b.1920x1080.jpg?t=1652220007",
    "Slug": "traitors-in-salem",
    "Meta Title": "Traitors in Salem: Apr 22, 2022, BlankMediaGames and Full...",
    "Meta Description": "Looking for information on Traitors in Salem? Check out the release date (Apr 22, 2022), developer insights from BlankMediaGames, and a complete game su...",
    "Alt Text Image": "Official header image for Traitors in Salem game - Steam 1497640",
    "Canonical URL": "https://gusku.site/game/traitors-in-salem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Traitors in Salem\", \"description\": \"Looking for information on Traitors in Salem? Check out the release date (Apr 22, 2022), developer insights from BlankMediaGames, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"BlankMediaGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BlankMediaGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1497640/header.jpg?t=1652220007\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}