{
    "AppID": 1279330,
    "Name": "Under Lock",
    "Release date": "Jan 12, 2021",
    "About the game": "Important info about multiplayer Currently due low amount of players it can be hard to find a server to join, so the game suits best for group of friends who wish to play together. Alternatively you can join official Discord channel in order to find a group of players here. Description Under Lock is a survival horror game that will immerse you into the grim ambience of damnation. The players can take one of the two opposing roles: monster or survivor. The game is designed for 5 players. One of the players takes the role of the monster, whose goal is to mercilessly murder all the survivors. The other 4 players, in an attempt to survive, have to search for keys, which will eventually unlock an exit from the building. Since the keys and other items appear in random locations, each round on the same level will be unique what will keep you entertained for many hours. Moreover, the diversity of gameplay is achieved not only with random placement of items on the map, but also by completely different monsters, each of which has a unique hunting style and a separate set of skills. Play as a survivor As a survivor, your goal is to look for keys, that lead to the desired salvation. But one must remember, that not all keys lead to freedom. Some of the keys give access to other useful items. It is important to work as a team to achieve maximal efficiency against the monster, but do not forget the one main rule. The most important thing is to survive. Play as a monster Your goal is to exterminate all other players, but this cannot be done at the beginning. Scare the survivors first to become gain power which will unlock new abilities and eventually possibility to devour a victims. Currently two different monsters is available: Flatface is unable to move while someone looking at him, but it have set of abilities which allows him to disorient nearby survivors and perform unexpected attacks. Wheeper is unable to see survivors directly, however its set of abilities helps him to detect, track and hunt down survivors which are not careful enough. Shady is invisible until he gains enough strength, but still casts a shadow, and until then he is a harmless observer. VR support For people who are ready to truly challenge their mettle, Under Lock is available in VR. Now, when the boundaries of virtual reality are not clear, the monster is way scarier than you could imagine, it will follow your steps, startling you with every rustle. The monster is closer than it seems. It is almost here. Survivors in Under Lock can play in VR on the same server with non-VR players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1279330/header.jpg?t=1653129900",
    "Price": 4.99,
    "Developers": "Shakitum",
    "Publishers": "Shakitum",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_eb850777832091e36a10c5b1620742a079f4ae32.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_629cf030fb63fc6321b6b131fda26cca82151fba.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_2b880e82654338ccc7a3c356226ee9fe19477878.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_c81e7c090deef0a65ffa6f989cc8ab35261d851c.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_c8d0debc93d764f310f5bdb414cf3c764dca55d5.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_6a888f24f3ebbc5cbc55ad493709a90c3451aad8.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_f23aad489ed27a4176420ccf2df94ad47103ed55.1920x1080.jpg?t=1653129900,https://cdn.akamai.steamstatic.com/steam/apps/1279330/ss_d1f4568e7242bfb101c15e308447040c293883be.1920x1080.jpg?t=1653129900",
    "Slug": "under-lock",
    "Meta Title": "Under Lock: Jan 12, 2021, Shakitum and Full Overview",
    "Meta Description": "Looking for information on Under Lock? Check out the release date (Jan 12, 2021), developer insights from Shakitum, and a complete game summary.",
    "Alt Text Image": "Official header image for Under Lock game - Steam 1279330",
    "Canonical URL": "https://gusku.site/game/under-lock",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Under Lock\", \"description\": \"Looking for information on Under Lock? Check out the release date (Jan 12, 2021), developer insights from Shakitum, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shakitum\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shakitum\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1279330/header.jpg?t=1653129900\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}