{
    "AppID": 1219940,
    "Name": "US Spy: Mission in Russia",
    "Release date": "Feb 14, 2020",
    "About the game": "This is the most frightening humorous game of all. Scary, because if you see a simple sign (link) in the event in the game, it means that it is a link to a real YouTube interview or another resource that inspired us to write the event in the game. Do you really think that you know how people live in Russia in 2020? You can't even imagine the hard reality and actual state of things. Young female teachers approach an official of the leading party in the country to inform him that their salary of around $300 per month is nothing. However, he has a bit of sensible advice for them. He just tells those young teachers to find rich men to live in prosperity and forget about any problems. It turns out that being a teacher and educating new generations is not enough to have a normal level of living in Russia. Young ladies need old and rich lovers, who will satisfy all their needs and demands. In July 2019, forest fire covered more than 9 million hectares in the Krasnoyarsk Region in Russia (it's 70 times larger than the total area of Los Angeles). At the same time, officials and first responders aren't even trying to extinguish them. The governor of the Krasnoyarsk Region found the easiest solution for the problem. According to him, there are no economic rationale and business sense in extinguishing forest fires. By using the same logic, one can easily find a lot of economically useless things and activities. For example, what's the purpose of having kids if there's no economic benefit? I'm not going to show all the cards of the table right now because each and every of you wants to find the tiniest details of the game on your own, don't you? Welcome to the world of the parallel universe, where you will meet 150 million Russians. Kindly note that our game is a comic and humorous parody, thus the majority of events in the game are imaginary. The key story of the game is based on the fact that you are a spy from the USA. You have the following goal: To provoke a revolution in Russia. To reach your goal, you have to pay a lot of money to officials and lawmakers just to make them doing those silly and unacceptable things, which they like to do once in a while even without money. You will do your best to raise dissatisfaction and discontent of people with the government to the highest level, causing millions of citizens to start protesting and overthrow the regime. Can you make it real? Let's find it out together. About the game: - The game has 50 types of event cards that you can use to raise revolutionary moods. - 50 government response cards that respond to your actions - 5 types of resources - 17 characters participate in dialogs",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1219940/header.jpg?t=1642753033",
    "Price": 1.99,
    "Developers": "Alex Demchenko",
    "Publishers": "Hamsters Gaming",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1219940/ss_7cdf27af89b16df14c17e8ab218881aaa6616e25.1920x1080.jpg?t=1642753033,https://cdn.akamai.steamstatic.com/steam/apps/1219940/ss_3216ba61cae03b1186566b95c21caf8f6e551d74.1920x1080.jpg?t=1642753033,https://cdn.akamai.steamstatic.com/steam/apps/1219940/ss_0c0ccad047f33c3f38c1a9d44c724136424be46e.1920x1080.jpg?t=1642753033,https://cdn.akamai.steamstatic.com/steam/apps/1219940/ss_fec4efc5650d287f93a4e8e5b4d60b3f65772f20.1920x1080.jpg?t=1642753033,https://cdn.akamai.steamstatic.com/steam/apps/1219940/ss_254680e0a20a7cfbe8a045eff79556133848aa54.1920x1080.jpg?t=1642753033,https://cdn.akamai.steamstatic.com/steam/apps/1219940/ss_1e23fa10a008e4ceee9fc8f5ba2335bb0f4060e1.1920x1080.jpg?t=1642753033",
    "Slug": "us-spy-mission-in-russia",
    "Meta Title": "US Spy: Mission in Russia: Feb 14, 2020, Alex Demchenko a...",
    "Meta Description": "Looking for information on US Spy: Mission in Russia? Check out the release date (Feb 14, 2020), developer insights from Alex Demchenko, and a complete ...",
    "Alt Text Image": "Official header image for US Spy: Mission in Russia game - Steam 1219940",
    "Canonical URL": "https://gusku.site/game/us-spy-mission-in-russia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"US Spy: Mission in Russia\", \"description\": \"Looking for information on US Spy: Mission in Russia? Check out the release date (Feb 14, 2020), developer insights from Alex Demchenko, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Alex Demchenko\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hamsters Gaming\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1219940/header.jpg?t=1642753033\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}