{
    "AppID": 550080,
    "Name": "VALKYRIE DRIVE -BHIKKHUNI-",
    "Release date": "Jun 20, 2017",
    "About the game": "A mysterious illness suddenly broke out in girls in their teens and twenties, enhancing them mentally and granting them the ability to change their bodies into highly lethal weapons. The cause of the illness was a virus, currently classified into two types: the 'A-Virus' and 'V-Virus'. The world government enacted a law to care for patients infected with the Virus. Five secret artificial islands were established to quarantine the infected patients. One such quarantine island: Bhikkhuni, the island famous for successfully controlling the 'V-Virus'. Girls who enroll in Bhikkhuni's school can overcome the virus. And thus, it is a school with many hopeful applicants. Among them is a pair of sisters infected with the 'V-Virus'. The elder Rinka Kagurazaka, whose innocent grace hides power within. The younger Ranka Kagurazaka, whose outgoing energy belies her frailty. They are still unaware that there is only one way to control the virus. And that is… for infected patients to battle each other. To battle amongst themselves. ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ FROM THE CREATORS OF SENRAN KAGURA In VALKYRIE DRIVE -BHIKKHUNI- a mysterious virus known as the A-Virus infects young women, transforming them into weapons known as 'Extars' or those that control them, 'Liberators'. However, the voluptuous Valkyries are infected with a unique strain, the VR-Virus, allowing them to take on either role at will. Proving incredibly difficult to cure, they are sent for quarantine to the sun-soaked island of Bhikkhuni where a treatment is put into place: the Valkyries engage in combat against one another to strengthen both mind and body and allow them greater control of the Virus. Who runs the island? What is the secret of the Virus? Will you choose Order or Chaos ? This and more will be answered throughout your time with VALKYRIE DRIVE -BHIKKHUNI- . Fully remastered in 1080p, 60FPS with native support for even higher resolutions! Choose between 7 unique playable characters to learn and master, each with their own playstyle! Battle your way through 24 Story Missions and crank up the difficulty or change your character for even more replayability! Print the underwear of your wildest and sexiest dreams by earning Bhikkhuni Points through combat prowess to spend on Echigoya’s revolutionary Lingerie Printer! Engage in fast-paced arena based online multiplayer with up to four players! Full-featured dressing room for deep customization of all playable characters — from hair to accessories, clothing and more! Support for both Steam cloud saving, achievements, and exclusive trading cards, plus backgrounds, emoticons and badges to unlock!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/550080/header.jpg?t=1594636252",
    "Price": 29.99,
    "Developers": "Meteorise,HONEY∞PARADE GAMES",
    "Publishers": "Marvelous",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/550080/ss_7adbccdab4e475c10fb4c07b6a74ed03b9438c8a.1920x1080.jpg?t=1594636252,https://cdn.akamai.steamstatic.com/steam/apps/550080/ss_e68b79d23f9ce05043866646612600da3cd7382b.1920x1080.jpg?t=1594636252,https://cdn.akamai.steamstatic.com/steam/apps/550080/ss_cec14c2197ad4e6a7a97842b6f821f0e9c4977c0.1920x1080.jpg?t=1594636252,https://cdn.akamai.steamstatic.com/steam/apps/550080/ss_522de72d1a794089b9181a9a7f304976d6d7197a.1920x1080.jpg?t=1594636252,https://cdn.akamai.steamstatic.com/steam/apps/550080/ss_3a22e7d00380db3ea959a1ef4937631729f21743.1920x1080.jpg?t=1594636252,https://cdn.akamai.steamstatic.com/steam/apps/550080/ss_3e213728783e5f88cdbcfacb877bbda1e341d6a0.1920x1080.jpg?t=1594636252",
    "Slug": "valkyrie-drive-bhikkhuni",
    "Meta Title": "VALKYRIE DRIVE -BHIKKHUNI-: Jun 20, 2017, Meteorise,HONEY...",
    "Meta Description": "Looking for information on VALKYRIE DRIVE -BHIKKHUNI-? Check out the release date (Jun 20, 2017), developer insights from Meteorise,HONEY∞PARADE GAMES, ...",
    "Alt Text Image": "Official header image for VALKYRIE DRIVE -BHIKKHUNI- game - Steam 550080",
    "Canonical URL": "https://gusku.site/game/valkyrie-drive-bhikkhuni",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VALKYRIE DRIVE -BHIKKHUNI-\", \"description\": \"Looking for information on VALKYRIE DRIVE -BHIKKHUNI-? Check out the release date (Jun 20, 2017), developer insights from Meteorise,HONEY\\u221ePARADE GAMES, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Meteorise,HONEY\\u221ePARADE GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Marvelous\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/550080/header.jpg?t=1594636252\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}