{
    "AppID": 759540,
    "Name": "Wanted Killer VR",
    "Release date": "May 23, 2018",
    "About the game": "We're a small indie developer with the ambitious goal to create a unique VR shooter that you, the community, will love as much as we do. Being video game enthusiasts ourselves, we’d like to invite you to join us on this endeavor – share your thoughts and suggestions with us and let us together shape this amazing VR experience. The core of Wanted Killer VR is an innovative movement system called “Tactical Teleport”, which lets you maneuver towards a specific location in bullet-time while all enemies (and their bullets) move in slow-motion. The clue is that teleportation can only be used on enemies momentarily after killing them – this allows for coping with even the most intense situations and a beautiful mix of action and strategy, which we consider the secret sauce of Wanted Killer VR’s gunplay. In Wanted Killer VR, you play as dual pistol expert Ricky, allrounder Mia, shotgun brawler Teo or master sharpshooter Aya. As you progress through the single player campaign, skill challenges, or wave-based survival mode, a unique brand of teleport system lets you experience player-driven bullet-time-shooting with a twist. Paired with a flow-based combo system that invites you to take out enemies in style, Wanted Killer VR allows for unparalleled strategic combat as you dash between opponents and complete diverse challenges in spectacular settings – including skyscrapers in the clouds, a mysterious genetics lab, and an ever-changing subway station. Create your very own action sequence and chain together kills using a variety of weapon types – pistols, machine guns, flamethrowers, sniper rifles… they’re all yours! Created to offer visually stunning one-of-a-kind gunplay, you can expect innovative weapons and fluid controls when you unleash vengeance against challenging enemies in diverse and beautiful levels. FEATURES Wanted Killer VR is a frenzied first-person shooter that puts you in charge of the WK4: a trigger-happy squad of mercenaries on a mission. Choose which of the crew’s four heroes to play as, and use their teleportation powers and sharpshooting skills to fight your way through the ranks of an organization that wipes out anything – and anyone – messing with their bottom line. Four heroes, four styles: Play your way with a choice of four unique heroes. Unleash dual-pistol damage as Ricky, get up-close and personal with Teo, strike as stealthy assassin Mia or cut loose with machine gun-toting Aya. Tactical teleporting: Take control of your enemies and their weapons with mind-bending teleportation powers. Devise creative attack strategies and leap into VR combat like never before. Locked and loaded: Earn coins for completing challenges, level-up your weapons and pick your perfect loadout to survive an onslaught of deadly enemies and bosses. Hunt down the truth: Fight your way through a stunning VR world – from shadowy subways to wide-open rooftops. Only you have the firepower to complete the campaign and unravel the story behind the evil corporation's scumbag CEO. Flow-based combos: Take out your enemies in style to trigger combo-based scoring rewards. It’s time to unleash every trick in the book! Say it with bullets: Shoot to survive in high-octane, wave-based Skill Trials and test your mettle against a host of different enemy types – from fragile but fast SMG specialists, to flamethrower-wielding brutes.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/759540/header.jpg?t=1556104842",
    "Price": 9.99,
    "Developers": "Playsnak",
    "Publishers": "Playsnak",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_65086cac429be9e6765e8070cd073a321d4ee3c7.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_87b9c9d39bc3b699cf710fccb10dfb3288b9867e.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_529703420b74230123a2b40833bfc293831fc8de.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_6bf2305b106b4766a31530d84a4d0a3242a48627.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_14b99915dac62c50d1559038b5924cde2647a1cf.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_7ddbef985bdefa6181dd9d8d771ede704c7b0e6f.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_0f2065017e1cc5af2ffb90b1258dff9c72e6c404.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_8fdb0045b9a51b2eb10420a8bae03bc0d2d1e004.1920x1080.jpg?t=1556104842,https://cdn.akamai.steamstatic.com/steam/apps/759540/ss_0f1a3bc0e57d13d58d4946829583159e275ea382.1920x1080.jpg?t=1556104842",
    "Slug": "wanted-killer-vr",
    "Meta Title": "Wanted Killer VR: May 23, 2018, Playsnak and Full Overview",
    "Meta Description": "Looking for information on Wanted Killer VR? Check out the release date (May 23, 2018), developer insights from Playsnak, and a complete game summary.",
    "Alt Text Image": "Official header image for Wanted Killer VR game - Steam 759540",
    "Canonical URL": "https://gusku.site/game/wanted-killer-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wanted Killer VR\", \"description\": \"Looking for information on Wanted Killer VR? Check out the release date (May 23, 2018), developer insights from Playsnak, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Playsnak\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Playsnak\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/759540/header.jpg?t=1556104842\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}