{
    "AppID": 320240,
    "Name": "We Happy Few",
    "Release date": "Aug 10, 2018",
    "About the game": "We Happy Few is the tale of a plucky bunch of moderately terrible people trying to escape from a lifetime of cheerful denial in the city of Wellington Wells. In this alternative 1960s England, conformity is key. You’ll have to fight or blend in with the drug-addled inhabitants, most of whom don’t take kindly to people who won’t abide by their not-so-normal rules. Discover the retrofuturistic city’s dark history as you play through the intertwined narratives of three quietly rebellious citizens of Wellington Wells, each with their own strengths and weaknesses, as they face their pasts, prepare for the future, and engage in activities that aren’t exactly status quo in the artificially enthused society. Retrofuturistic 1960s England Set in retrofuturistic 1960s England, you will find a city ravaged by war and rebuilt by delusionally happy people. Everything appears joyful in Wellington Wells, including its roads, its people, and its omnipresent television personality: Uncle Jack! But, it’s actually a world on the brink of collapse. Come unveil its dark history, and discover how and why its residents came to be so beguilingly happy. Three Interwoven Narratives Play as three flawed characters who explore their own connections to the events surrounding the rebuilding of Wellington Wells. They each have a unique storyline in which they interpret and react to the events around them in different ways. As you hide, conform, or fight back as each of them, you will encounter dark humour, a spot of hope, and even some redemption along the way. A Dystopia of Your Very Own In We Happy Few, no two playthroughs are alike. While the citizens of Wellington Wells will always want to ensure that you’ve taken your Joy, the procedurally generated world will ensure that your experience with We Happy Few is different and unique. Wellington Wells is never quite like you remember it. Take Your Joy…or Don’t. The Choice is Yours Customize your We Happy Few experience: • Choose from a range of difficulties for new and experienced players alike, • Masochistic? Try permadeath!, • Collect recipes, scavenge items, and craft dozens of weapons, tools, and devices, • Creep, crush, or conform your way through puzzles and encounters, and • Fight with the crazy weapons you can craft, or fight with your bare hands and don’t kill anyone!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/320240/header.jpg?t=1648680905",
    "Price": 59.99,
    "Developers": "Compulsion Games",
    "Publishers": "Gearbox Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/320240/ss_f7fc9f2b450f683e373236076cdf66095a93779b.1920x1080.jpg?t=1648680905,https://cdn.akamai.steamstatic.com/steam/apps/320240/ss_aa92ec09d1195bffd80c773f18af98a8f3e2e874.1920x1080.jpg?t=1648680905,https://cdn.akamai.steamstatic.com/steam/apps/320240/ss_60663a0b8de69db565ebad93f73a679bb4c5be2d.1920x1080.jpg?t=1648680905,https://cdn.akamai.steamstatic.com/steam/apps/320240/ss_ea0097672eeea7cb65f09e9fe2ffc75c0ccf0a35.1920x1080.jpg?t=1648680905,https://cdn.akamai.steamstatic.com/steam/apps/320240/ss_9ea7c0685abc1d4161dd3e7798bdb92a7a84d100.1920x1080.jpg?t=1648680905",
    "Slug": "we-happy-few",
    "Meta Title": "We Happy Few: Aug 10, 2018, Compulsion Games and Full Ove...",
    "Meta Description": "Looking for information on We Happy Few? Check out the release date (Aug 10, 2018), developer insights from Compulsion Games, and a complete game summary.",
    "Alt Text Image": "Official header image for We Happy Few game - Steam 320240",
    "Canonical URL": "https://gusku.site/game/we-happy-few",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"We Happy Few\", \"description\": \"Looking for information on We Happy Few? Check out the release date (Aug 10, 2018), developer insights from Compulsion Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Compulsion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gearbox Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/320240/header.jpg?t=1648680905\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}