{
    "AppID": 770620,
    "Name": "Web Designer 15 Premium Steam Edition",
    "Release date": "Feb 22, 2018",
    "About the game": "Share your Let's Plays, game characters, fan artwork or hard-earned achievements on your own website. Drag and drop fantastic designs together exactly the way you want––no programming necessary. In addition to real gaming websites, you can also use Web Designer 15 Premium Steam Edition to make websites for other topics, or for your organization, school or business.There's no limit to the creative possibilities! Websites. Easy. One of a kind. Over 240 website templates–100% customizable Over 1,000 design elements More than 130 photo filters and advanced image editing Direct integration of screenshots, Let's Play videos and sounds Lots of widgets for integrating YouTube, Facebook, etc. Optimal display for your website on smartphones, tablets etc. Key features in the new version More than 1,000,000 photos and illustrations Brand new templates for websites, presentations and social media 10 cool photo filter overlays Practical Magic Resize tool for automatically customizing social media posts Smart Shapes for timelines, speech bubbles, diagrams, text fields and much more Design your own website Clan logo, including 3D design Every clan, guild or team clan is unique, and your clan logo should be too.Create a vector graphic with impressive 3D effects using your own logo right in the program. You can then drag it to make it the perfect size for your website, a team jersey or whatever you want. Integrate Let's Play videos in Full HD Present all your gaming highlights in top quality. Integrate your videos in true HD quality at 1080p to retain realistic graphics and an authentic gaming feel. Impressive animations &amp; effects. Impress your visitors with animations, special effects and dynamic page transitions. You can make all of these yourself right in the program. Web Designer includes improved micro animations such as elements that rotate, enlarge or shake. Animations can be activated by triggers such as mouse-overs, clicking or scrolling. Access your website on all devices You can also optimize websites for mobile devices like smartphones or tablets. The program adjusts content such as text and graphics automatically to fit different screen sizes. Xara Online Designer: Customize any time, from anywhere Modify text and images in any browser in no time at all. Just log in to Xara Online Designer and edit the uploaded website - even at the same time as your friends. Important information Web hosting is not included in Web Designer 15 Premium Steam version. The offer includes 1 full year of access to the Online Content Catalog, where you can access all the latest templates, photos, filters and more. All items from the Online Content Catalog can be downloaded during the 1 year offer period.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/770620/header.jpg?t=1564138848",
    "Price": 74.99,
    "Developers": "MAGIX Software GmbH",
    "Publishers": "MAGIX Software GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/770620/ss_46ee7a42d34e718071804bdf1d19447af04df628.1920x1080.jpg?t=1564138848,https://cdn.akamai.steamstatic.com/steam/apps/770620/ss_05a43704da0a2247ebe1018aeeebd949ea48a1a9.1920x1080.jpg?t=1564138848,https://cdn.akamai.steamstatic.com/steam/apps/770620/ss_3132fc66194585c3b63c7cb01d6f688441f55b08.1920x1080.jpg?t=1564138848,https://cdn.akamai.steamstatic.com/steam/apps/770620/ss_bc53d5276f389bda61f4f3f50ed3dec049c697bc.1920x1080.jpg?t=1564138848,https://cdn.akamai.steamstatic.com/steam/apps/770620/ss_4a98da4b54224892081d6ba81994c86f6827c619.1920x1080.jpg?t=1564138848",
    "Slug": "web-designer-15-premium-steam-edition",
    "Meta Title": "Web Designer 15 Premium Steam Edition: Feb 22, 2018, MAGI...",
    "Meta Description": "Looking for information on Web Designer 15 Premium Steam Edition? Check out the release date (Feb 22, 2018), developer insights from MAGIX Software GmbH...",
    "Alt Text Image": "Official header image for Web Designer 15 Premium Steam Edition game - Steam 770620",
    "Canonical URL": "https://gusku.site/game/web-designer-15-premium-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Web Designer 15 Premium Steam Edition\", \"description\": \"Looking for information on Web Designer 15 Premium Steam Edition? Check out the release date (Feb 22, 2018), developer insights from MAGIX Software GmbH...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/770620/header.jpg?t=1564138848\", \"offers\": {\"@type\": \"Offer\", \"price\": 74.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}