{
    "AppID": 430930,
    "Name": "Z. Year One",
    "Release date": "Feb 22, 2017",
    "About the game": "Z. Year One is a crowdfunded zombie card game brought to life by indie developer Downward Viral and 1,414 Kickstarter backers. NEW UPDATES: Since release, fans have provided lots of great feedback, with one of the most requested features being a more thorough tutorial/training system for new players. This, along with many other tweaks, bug fixes, and improvements are constantly in the works. Please check the forums for more details! IMPORTANT: Z. Year One utilizes a third party system called PlayFab to manage player accounts. Signing in enables various features in the game (such as gaining XP and unlocking new cards), allowing players to carry their progress between platforms, and to future-proof Z. in case we ever get to make a Year Two or add multiplayer, etc. We used PlayFab because as a two-man dev team, it helped us implement vital features we never would have been able to add otherwise. TWO ASYMMETRICAL FACTIONS / TWO WAYS TO PLAY! The zombie theme and horror atmosphere aren't just skin deep--they've been meticulously integrated into the game experience to create a DCG like no other! SURVIVORS Search locations for supplies and use an assortment of unique items, armor, and weapons to survive one more night! FALLEN Sabotage locations, lay traps, convert Survivors into more Fallen, or just eat them alive! THREE MODES Arcade: Four consecutive matches with random locations/objectives/enemies! Survival: Face unique Survival Challenges and see how long you can last! Supply Run: Customize your leader and risk everything for increasing loot! Supply Run is the best source of XP, Booster Packs, and rare Variants in the game! MULTIPLE OBJECTIVE TYPES Raze, Domination, Extermination, and Domination X Raze provide different takes on the familiar “duel”-style win conditions. THEMATIC LOCATIONS Z. is more than just throwing your best cards at the other player. What would a horror movie be without a properly eerie setting? In the middle of every match is one of several unique and interactive location decks. Survivors can find themed weapons and items exclusive to each Location Unique Discoveries and Events await Events provide optional objectives the Survivors can complete for special rewards Rescue Location-specific Survivors or encounter unique Fallen The last card of every Location Deck is a powerful Climax card that can turn the battle Each location is also represented by a fully 3D background UNIQUE APPROACH TO THE GENRE Z. was designed not only as an homage to games like Magic, Yu-Gi-Oh!, and a plethora of other tabletop and video games, but it was also designed to do away with some of the obsolete or less enjoyable aspects within the genre. Direct control over resources -- no mana starving or flooding Limited low-cost Location Units ensure always being able to play a unit during the early game Traps and Instants are automatic, so the game doesn’t stop every three seconds to ask if you want to play one Location Decks make games dynamic and unpredictable -- there’s always a chance of a comeback! HARDCORE DIFFICULTY When you reach level 20 you’ll unlock Hardcore Difficulty, which offers far more challenging versions of Arcade, Survival, and Supply Run for experienced players, but also doubles any XP gained from winning matches! BOOSTER PACKS &amp; VARIANTS Booster Packs work a little differently in Z. than other games: You can’t buy them, but instead earn one free Booster Pack each time you level up Leveling up always requires 1000 XP (roughly two Standard wins, or one Hardcore win) Booster Packs contain five Variants of either Rare, Prime, or Elite rarity Variants are more powerful versions of Core cards Variants are only usable on Hardcore Difficulty Variants are consumed upon use, forcing you to think carefully about how you build your decks and which cards you’re willing to sacrifice to complete your current goal Since Z. is a single-player game that takes a bit of inspiration from rogue-likes, the Hardcore/Variant system allows players access to extremely powerful cards: units gain better stats and new abilities; Traps and Actions cost less to play or become more devastating; and Heroes and Horrors can be played much earlier than in Standard, completing changing the flow of the game! There’s much more to discover in Z. Year One so if any of this sounds exciting take a look and we hope to hear from you in the forums! IMPORTANT: Z. Year One is a standalone product -- the entire game is included already, with no additional purchases or microtransactions required. There are currently no plans for DLC or expansion sets, etc. It's more like Duels of the Planeswalker and less like Hearthstone in this way, as the development team consists primarily of one full-timer and one part-timer. IMPORTANT x2: Being a tabletop card game in digital form means you'll have to read often to know what things do in Z. If you don't want to do that, you're going to have a bad time! Press TAB in-game at any time to pull up the How to Play screen! (A more involved tutorial is currently being worked on to help out new players. Stay tuned!)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/430930/header.jpg?t=1529438846",
    "Price": 14.99,
    "Developers": "Downward Viral",
    "Publishers": "Downward Viral",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_048fa363debc15dfbc887021a462a23aae6fb939.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_627651792165b10e1b773f89120f24641434e035.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_1335b6f5fbdc98fefb7c82e2f9facd515bd3a54f.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_c5d44ee98486bbcc39a00eb393e35a4858c97579.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_09a66868d0ca94c6472643b19b38b6f9bc3e9e5c.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_ec351940ff1a563e30293f4f53d9d82a2e057d41.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_e4b9827d973e9dcd09d0bced57e315e7938b645e.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_cac1113cd0706065964bcaead771e673791656fa.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_98b932eae2edf898333a6aee22cb02e63d6bae55.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_b0a271b4b7071c374fc7dd2f6da0f122e65c14e3.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_912b64f264d94ebd0b5217c36932e17cc19eb69f.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_3d6ee25914f8f90d2b18f1417706348b9ae21b96.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_ac888ede7e28df664378344211859658293009b2.1920x1080.jpg?t=1529438846,https://cdn.akamai.steamstatic.com/steam/apps/430930/ss_e6f3fa5d688aad4576b0ba0af52958f2bd90f2fe.1920x1080.jpg?t=1529438846",
    "Slug": "z-year-one",
    "Meta Title": "Z. Year One: Feb 22, 2017, Downward Viral and Full Overview",
    "Meta Description": "Looking for information on Z. Year One? Check out the release date (Feb 22, 2017), developer insights from Downward Viral, and a complete game summary.",
    "Alt Text Image": "Official header image for Z. Year One game - Steam 430930",
    "Canonical URL": "https://gusku.site/game/z-year-one",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Z. Year One\", \"description\": \"Looking for information on Z. Year One? Check out the release date (Feb 22, 2017), developer insights from Downward Viral, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Downward Viral\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Downward Viral\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/430930/header.jpg?t=1529438846\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}