{
    "AppID": 201271,
    "Name": "A Total War Saga: FALL OF THE SAMURAI",
    "Release date": "Mar 22, 2012",
    "About the game": "A Total War Saga: FALL OF THE SAMURAI features a dramatic clash of traditional Samurai culture with the explosive power of modern weaponry. Now including all DLC faction packs, build up your armies with the Saga, Obama, Tsu and Sendai factions. About Total War Saga: FALL OF THE SAMURAI Set 400 years after the events of Total War: SHOGUN 2, guide ancient Japan into the modern age, as the arrival of America, Britain and France incites a ferocious civil war which will decide the future of a nation. Based on the backdrop of the Boshin War period, the new campaign starts in 1864, a time of growing resentment against Western colonial power and influence. As Japan begins to modernise and industrialise, the inevitable social and economic changes lead to increasingly militant nationalism and antipathy towards the Shogunate. Play as a clan supporting the Imperial throne (Choshu, Satsuma, Tosa), or the last Shogunate (Aizu, Nagaoka, Jozai) in a sandbox campaign map reflecting the time period of 19th century Japan. The American, British and French nations play an important part in the story of the Boshin war, and your relations with these foreign powers will be integral to unit recruitment and to advancing your technology trees. About the Saga Faction Pack The Modernisers Centuries of trade with outsiders has given the people of Saga an understanding of foreign and modern ways, allowing them to adopt new military technology quickly. The Saga domain is ruled by Nabeshima Mochizuru, the latest in a line of daimyo who were given this territory after the Tokugawa won the vicious civil war of the Sengoku Jidai. The Saga did well by being sensible enough to join the Tokugawa cause while there was still some doubt over the result. They did not wait until the Battle of Sekigahara to decide where their true loyalties lay. The domain includes the port of Nagasaki, a valuable resource for any daimyo. It is here that Japan has its only official trade with the West, and it is here that interesting ideas arrive in the country. Perhaps this knowledge of the harshness of the outside world is what has convinced the Saga to throw their weight behind the Imperial Court rather than the Shogun. The Saga clan can rely on a few advantages in the coming struggle: they have Western connections and trade that is far ahead of any other domain. In turn, this learning allows them to be artillery experts, and have good shipbuilding and industrial facilities. The modern world has much to offer to those who would embrace it. Interestingly, the historical Nabeshima Mochizuru eventually resigned his position and left Japan to study in England. About the Obama Faction Pack The Overseers With long experience of government and administration, the authoritarian people of Obama are unsurpassed in controlling people and trade. The Sakai clan, the rulers of Obama, are firm supporters of the Shogunate. The original Sakai lord of the domain, Sakai Tadakatsu, was one of the roju, or elders, under Tokugawa Ieyasu, the first Shogun. This was a hugely important post in the affairs of Japan, and Tadakatsu was correspondingly powerful within the Shogunate's administration. The Sakai clan could also claim to be related to the Minamoto clan, and to be cousins of both the Tokugawa and the Matsudaira clans. They are, then, very well connected. Their domain is worthy of them. The town of Obama had been a prosperous trading port, but its importance declined as Japan closed itself off from the outside world. It remained an important link to Ezo, modern Hokkaido. Because of their long experience of government and administration, they are experts at managing the population of their lands. They receive a taxation bonus and are highly efficient at repression. They also spend money wisely, and they pay less upkeep for land units. All their garrison troops are also of high quality. About the Tsu Faction Pack The Betrayers Rising from humble roots, the people of Tsu are wise, artful and astute strategists. Their use of Ninja is unsurpassed on the battlefield and in covert operations. The Todo clan, rulers of the Tsu domain, cannot claim a proud samurai lineage like many of the other great clans of Japan. Their beginnings are actually rather humble: Todo Takatora was an ashigaru, a peasant footsoldier, during the great wars of the Sengoku Jidai. So what? So too was the mighty general Toyotomi Hideyoshi, revered as one of the three great unifiers of Japan! Todo Takatora was wise enough to side with the Tokugawa clan at Sekigahara, and he was rewarded with the fief of Tsu, comprising a good part of the provinces of Iga and Ise. Historically, the Tsu chose to play a 'long game', apparently supporting the Shogunate until the very last moment. At the Battle of Toba-Fushimi they sided with the Choshu and Satsuma domains, and therefore with the Imperial forces. They then provided the Imperialists with a strategic position to continue the drive towards Kyoto. Their central position on the mainland, in what is now Mie Prefecture, lay between Edo and Kyoto, and this allowed them enviable flexibility and options in their loyalties. Such flexibility goes some way to explain why they have such excellent shinobi at their command. About the Sendai Faction Pack The Negotiators Fiercely loyal to the incumbent Tokugawa Shogunate, the noble people of Sendai endured the ages of turmoil to emerge as respected tacticians and sublime diplomats. Date Yoshikuni, the lord of Sendai, is loyal to the Shogunate. His family have been loyal to the Tokugawa clan since the end of the wars of the Sengoku Jidai. Then, Date Masamune had proven himself worthy, and established the domain with the blessing of the first Shogun. Even before then, the Sendai had been a noble and notable family of samurai, beginning as the Isa clan under the Minamoto. Given control of the Date province, and taking the name as their own, they survived centuries of turmoil. They have done this by political guile, implacable enemies, and fierce warriors. Now, as lords of Sendai, they are still all of those, even after centuries of relative peace. In battle, Sendai armies have longer when attacking, and need to defend for less time, making victory less of a race to achieve. The Sendai also have a bonus to all diplomatic efforts and are tolerant towards people with different allegiance.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/201271/header.jpg?t=1624275412",
    "Price": 29.99,
    "Developers": "CREATIVE ASSEMBLY,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Publishers": "SEGA,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_0d45dba36554940561fc2fece04a149d1bb47d64.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_3135d4e43ff168ccaa7293ba8302d1c6a1ac21c5.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_c285ae4c65777efe59c2290105c3469457b5e7b7.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_4ebeb6713ed882e9910af15555256c991c471e8c.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_d5fc4ff73044f9eecbd41b0c69dc4411e8210fd0.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_7e58eac2d4eb4ec1df05ca893b043106eed32e62.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_1522700a60336d4c235dd333c479fd17a6c32ec4.1920x1080.jpg?t=1624275412,https://cdn.akamai.steamstatic.com/steam/apps/201271/ss_20659145436cbdb9b41339b65690d0c51a7811a7.1920x1080.jpg?t=1624275412",
    "Slug": "a-total-war-saga-fall-of-the-samurai",
    "Meta Title": "A Total War Saga: FALL OF THE SAMURAI: Mar 22, 2012, CREA...",
    "Meta Description": "Looking for information on A Total War Saga: FALL OF THE SAMURAI? Check out the release date (Mar 22, 2012), developer insights from CREATIVE ASSEMBLY,F...",
    "Alt Text Image": "Official header image for A Total War Saga: FALL OF THE SAMURAI game - Steam 201271",
    "Canonical URL": "https://gusku.site/game/a-total-war-saga-fall-of-the-samurai",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Total War Saga: FALL OF THE SAMURAI\", \"description\": \"Looking for information on A Total War Saga: FALL OF THE SAMURAI? Check out the release date (Mar 22, 2012), developer insights from CREATIVE ASSEMBLY,F...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2012\", \"author\": {\"@type\": \"Organization\", \"name\": \"CREATIVE ASSEMBLY,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/201271/header.jpg?t=1624275412\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}