{
    "AppID": 1260310,
    "Name": "ASTRA-256 Assembler",
    "Release date": "Apr 21, 2020",
    "About the game": "ASSEMBLY BINARY COMPUTER Maybe it sounds unusual but let us introduce a binary computer programmable in Assembly language. PRACTICAL PLAYTHING The ASTRA-256 software is an effective tool for those who want to learn the Assembly language, not knowing where to start. It is a fun toy for ‘real programmers’ and those remembering the old LPG-30, Altair 8800, PDP-11. Finally, it’s a very good mind-breaker, not wasting your time. With the ASTRA-256, you can solve real problems. For example, those real programmers solved at the dawn of computing. Along the way, acquiring Assembly programming skills, refreshing your math knowledge. REASONS TO LEARN ASSEMBLY LANGUAGE Assembly language allows to most effectively manage all the hardware resources. So it is used for programming many microcontroller devices. Assembly is still used to optimize programs written in higher-level languages. Assembly experience will give you an insight into how the magic happens. What turns hardware understanding only zeros and ones into a living intelligent computer? BACK TO THE PAST In the software, we tried to marry the atmosphere of the iconic first computers with a practical training tool. At the same time, you can prove yourself working in limited-resource conditions in which real programmers had been working in their days. ASTRA-256 FEATURES The software represents a virtual computer with a von Neumann architecture. At your disposal are the following resources: Architecture The 8-bit processor has an 8-bit accumulator, as well as 8-bit registers mapped to memory: instruction counter, input register, output register, stack pointer, FLAGS register. Memory The Astra-256 has 256 bytes of memory (exactly as it was in the first versions of the Altair 8800). Instruction Set The Assembly instruction set is quite extended and contains 102 instructions. But a novice user does not need to know all of them. It is enough to know only part of them to start writing the first assembly code. To learn more about instructions, click on the Help View button in the app or read detailed documentation on the official website. You might want to print it for more immersion in the programming process. Instructions grouped into 11 subdivisions: Processor Control Instructions Data Transfer Instructions Exchange Instructions Arithmetic and logical Instructions Shift Instructions Bit Manipulation Instructions Stack Manipulation Instructions Unconditional Transfer Instructions Conditional Transfer Instructions Input/Output Instructions Miscellaneous Instructions We provide the user with an extended set of instructions similar to those found in all modern microcontrollers, microprocessors. The ASTRA-256 allows for getting basic programming skills in low-level hardware. On these foundations, you can master the coding of any modern microcontroller. After all, its basic operating principles remain the same. PLAY, LEARN, PROGRAM! The ASTRA-256 is a tool with everything at hand. It allows puzzling over the solution of tasks with limited resources. Write in Assembly language a square root extraction program, a trigonometric function calculator, or an interactive game. And maybe you will be the next real programmer who sends a man to the Moon.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1260310/header.jpg?t=1657711900",
    "Price": 11.99,
    "Developers": "brusnik.com",
    "Publishers": "brusnik.com",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1260310/ss_61cc914b23060ac730d37d060b01540a6deab645.1920x1080.jpg?t=1657711900,https://cdn.akamai.steamstatic.com/steam/apps/1260310/ss_112eb73a84e8cf2c10366cff4358599cbab5667c.1920x1080.jpg?t=1657711900,https://cdn.akamai.steamstatic.com/steam/apps/1260310/ss_5b2049c434bd30ccfec6b451e180140195f1e03d.1920x1080.jpg?t=1657711900,https://cdn.akamai.steamstatic.com/steam/apps/1260310/ss_a83b9951cd0a41671e04ed679f22eeb31e1a11a6.1920x1080.jpg?t=1657711900,https://cdn.akamai.steamstatic.com/steam/apps/1260310/ss_e07cbe1dd029c52872d9b87bd16199b7728d042d.1920x1080.jpg?t=1657711900",
    "Slug": "astra-256-assembler",
    "Meta Title": "ASTRA-256 Assembler: Apr 21, 2020, brusnik.com and Full O...",
    "Meta Description": "Looking for information on ASTRA-256 Assembler? Check out the release date (Apr 21, 2020), developer insights from brusnik.com, and a complete game summ...",
    "Alt Text Image": "Official header image for ASTRA-256 Assembler game - Steam 1260310",
    "Canonical URL": "https://gusku.site/game/astra-256-assembler",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ASTRA-256 Assembler\", \"description\": \"Looking for information on ASTRA-256 Assembler? Check out the release date (Apr 21, 2020), developer insights from brusnik.com, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"brusnik.com\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"brusnik.com\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1260310/header.jpg?t=1657711900\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}