{
    "AppID": 523970,
    "Name": "Atomic Butcher: Homo Metabolicus",
    "Release date": "Oct 21, 2016",
    "About the game": "“Atomic Butcher: Homo Metabolicus” is a deranged, fast-paced, ridiculously gory, post-apocalyptic retro 2D platformer/shooter with 360° aiming. You play the role of a crazed mutant freak, the Atomic Butcher. On your search for food in the post-apocalyptic wastelands, you blatantly destroy everything in your way and finish off a dying society. Resources are scarce, so you turn to the next best thing: meat that is still running around; whether those are dangerous mutated animals, or humans trying to rebuild a broken world does not make much of a difference. On the bottomline, they are all very tasty. You dish out damage using mostly your own body: pee on your enemies, use your radioactive poop , vomit the hell out of the poor bastards that encounter you, and slide and dash into everything. If that's not enough, you can use weapons lying around in the wasteland, as well as corpses of slain enemies or anything that can be picked up. There are also a lot of deadly traps , but you may be able to use them to your advantage. The gameplay is pretty straight-forward: kill enemies, eat their meat, find more enemies, repeat. Really, there is not more to it. Yes, the game is very violent, but it does not try to hide this behind euphemisms; it is very blunt about that, which makes this the kind of over-the-top ridiculous gem that we from Das Humankapital like to play. Beat the single-player campaign in 13 levels stretched over 5 environments. Become the perfect weapon of mass digestion: the Homo Metabolicus. There are approximately 7 hours of gameplay waiting for you. But beware, it's not made too easy! Features Classic platformer controls combined with 360° aiming. Lots of secrets, easter eggs and hidden goodies! Reactive environments: Use fire, electricity, fluids, wind etc. to your advantage! Surreal post-apocalyptic stages, filled with absurd mutants and deadly traps! A story line about an epic battle for the future of this planet! No, really! So really in fact, that it deserves multiple exclamation marks!!!!! Retro pixel graphics drawn with intricate love for the (disgusting) details! Blood! Gore! Insanity! Preposterous acts of unwarranted violence! Perfect moonwalk skills of our hero! Story … humanity finally managed to destroy itself: The world has ended. The details have long been forgotten … a great collapse, mass madness, cannibalism, no more free wi-fi. After the downfall, strange beings emerged from the radiated, poisoned remains … Beings such as you: Ages ago born as a human in the old world, then changed into something else, mutated by radiation and toxic waste. Your brain has been completely fused with your intestinal tract, and combined with your superhuman strength you have become the perfect weapon of mass digestion. Behold the next step in human evolution: “Homo Metabolicus”! Endlessly you roam the wastes, deranged and on a mad quest for fresh meat … a scourge for the few surviving pockets of humanity, a walking manifestation of all that lead us to our end in the first place, pure desire for instant gratification and hunger, you are only known as …the ATOMIC BUTCHER! An epic struggle of gastronomic proportions is about to ravage what is left of the world! Be the one who might end it all, for better or for worse!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/523970/header.jpg?t=1480457312",
    "Price": 9.99,
    "Developers": "Das Humankapital",
    "Publishers": "Das Humankapital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_05c48b7b62c4766cdd94af747daa9ccfae8d5abd.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_a0f27ab5d34d3a393fefa65c86ecd05bc6c4593c.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_e6a16f79fe32c5ed04b61566c67ea7215d9ede87.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_04d71778d983e70a67a7a9a4a972f16955fd0424.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_59842acffc9119c611d3131825687e4458e08ea8.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_8e503a7ab9119a999c4ca45e5abb8321cf54647d.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_5447644317c1908f15c9cde07e0f471105012a7f.1920x1080.jpg?t=1480457312,https://cdn.akamai.steamstatic.com/steam/apps/523970/ss_d91d1d96cbba0a42337c8603a8f5404817ff0052.1920x1080.jpg?t=1480457312",
    "Slug": "atomic-butcher-homo-metabolicus",
    "Meta Title": "Atomic Butcher: Homo Metabolicus: Oct 21, 2016, Das Human...",
    "Meta Description": "Looking for information on Atomic Butcher: Homo Metabolicus? Check out the release date (Oct 21, 2016), developer insights from Das Humankapital, and a ...",
    "Alt Text Image": "Official header image for Atomic Butcher: Homo Metabolicus game - Steam 523970",
    "Canonical URL": "https://gusku.site/game/atomic-butcher-homo-metabolicus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Atomic Butcher: Homo Metabolicus\", \"description\": \"Looking for information on Atomic Butcher: Homo Metabolicus? Check out the release date (Oct 21, 2016), developer insights from Das Humankapital, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 21, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Das Humankapital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Das Humankapital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/523970/header.jpg?t=1480457312\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}