{
    "AppID": 1101780,
    "Name": "Bakery Biz Tycoon",
    "Release date": "Nov 25, 2021",
    "About the game": "Bakery Biz Tycoon is a tycoon game where the player begins his adventure becoming an entrepreneur and runs a bakery delivered from his grandfather in the city of Middelton. Initially, the player has a small bakery and the amount of cash to dispose. And with time, along with the development of his bakery, taking care of acquiring new customers and expanding his stores, the player gains new opportunities. In the future, the player will be able to expand his company with new and larger bakeries, which will significantly increase production possibilities. And by introducing new products to its offer, it can increase revenues in such stores and thus increase its profits. The player also has marketing campaigns at his disposal, which can significantly affect the number of customers in the player's stores. The number of customers and by the volume of sales can also be influenced by high-quality products, thanks to which the player can win occasional bakery festivals that take place from time to time. And with such a strong position, the player can conquer new markets in other cities, creating their warehouses and new stores there. On the other hand, however, the player has full freedom in action. It can focus on the production of the cheapest products and reach as many customers as possible. Finally, 3 cities where the player will be able to expand his number of stores Expansion of production capacity and production management Warehouse management so that you can use your warehouses in the most efficient way. Store management to increase the number of products available for sale and support the same level of service The player can create products with specific parameters, thanks to which the player has an influence on the production costs and on the product's opinion Opportunity to participate in events such as Regional Competitions for the best product in the industry, in which the player's product will compete with products from other manufacturers. The game itself is designed so that in each of the 'modules' I can add functions and add depth to game features. And so far, the game does not yet contain all the functions and mechanics that I would like to see in this game. But mainly add depth to the production mechanics about production lines. Whether as part of the purchase of 'technology' or building your own production line. I also think a lot about the introduction of the logistics module. It would be naturally connected to the warehouse. This would allow the introduction of delivery elements to the game. Purchase of delivery vehicles and possible plans for the supply stores. And that would probably be my biggest ideas for adding content. In the meantime, I will want to add new minor functions and improvements like a bank and other smaller features whcih will balance gameplay. A Few Words From the Author By creating Bakery Biz Tycoon, my main goal was to create a title that will relate to old school tycoon games. In which the player has to focus more on the macro of managing the enterprise than on micro-management or time management. I tried to create a more complex production than typical Time Management games, but simple enough for the time spent with Bakery Biz Tycoon to be fun. And I wish all this and I hope that my first game will give you at least a few hours of pleasant gameplay. Greetings my friends! :)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1101780/header.jpg?t=1637910684",
    "Price": 6.99,
    "Developers": "Bango.Games",
    "Publishers": "Bango.Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_a4b30aa7ec7c574010b82c4b91dfda1e5ee1c018.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_8da04ddbe7295176fa33937dfd9ba97046e5d437.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_f1970f988b11e695e871a24fbaebc08163dd961a.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_3ce2b35c9fc6fc09f8f5adba56fbcaf815f023c9.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_53e23e40283414c49ae7f43dcb37c0d1e22132c0.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_aeba0b182690abbee379f7db04418ecc0bbf40b4.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_da3ceb679b9bf19be8e000454111667f2ffae2f5.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_1ffce46478c1b1238370900ec1c23303f700383d.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_09710d4cc2be5cd87650a1da5ffce181eace1eef.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_f823bdfd63b82e896ff28ce18d95c775fa281ee7.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_9510a2a3ea19dfccf4ec9ee5037bce04a74fcbe1.1920x1080.jpg?t=1637910684,https://cdn.akamai.steamstatic.com/steam/apps/1101780/ss_90ca46da0dd51361f9ff25cee6efd29c959263cc.1920x1080.jpg?t=1637910684",
    "Slug": "bakery-biz-tycoon",
    "Meta Title": "Bakery Biz Tycoon: Nov 25, 2021, Bango.Games and Full Ove...",
    "Meta Description": "Looking for information on Bakery Biz Tycoon? Check out the release date (Nov 25, 2021), developer insights from Bango.Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Bakery Biz Tycoon game - Steam 1101780",
    "Canonical URL": "https://gusku.site/game/bakery-biz-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bakery Biz Tycoon\", \"description\": \"Looking for information on Bakery Biz Tycoon? Check out the release date (Nov 25, 2021), developer insights from Bango.Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bango.Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bango.Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1101780/header.jpg?t=1637910684\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}