{
    "AppID": 288080,
    "Name": "BoneTown: The Second Coming Edition",
    "Release date": "Jun 8, 2021",
    "About the game": "Want to party with hot chicks and get laid in a free-roaming video game? BoneTown is the first game to combine free roaming, action adventure gameplay with sex, drugs, and debauchery in one hilariously hardcore experience! Merging games like Grand Theft Auto and Red Dead Redemption with outrageous drug-induced and sexual powers never before allowed in a video game, BoneTown creates a world where crack makes you run quicker, weed lets you jump higher, and of course, you get to bone your way to the top as you seduce thousands of unique girls. Key Features 25 sex positions merged seamlessly into gameplay 200+ voices with thousands of unique male and female characters 15 levels including trailer parks, house parties, suburbia, clubs, and drug forests 7 drugs, each with their own boss, consumable effect, and fighting move 35+ replayable competitions like Hookup Contests, Butt Brawls, Hogging Contests, Smear the Steer, an Orgy Competition, Capture the Flag, a Sorority Slam, The Great Crack Caper, a Jerk Off Competition, and many more 12 Story Mode missions that follow the overthrow of The Man Inc. and your rise to BoneTown stardom 80+ weapons, ranging from tennis rackets, to sex paddles, to holy relics, to kegs A Fantasy Mode that lets you skip the gameplay and get right to the boning Want to nail a nun, do a dominatrix, jizz on a juicer, or eat out an eighteen-year-old? You've come to the right place. In BoneTown, sex on the sidewalk is as common as sex in the bedroom, and the only thing to be ashamed of is not having enough stamina to finish what you start. Every girl you see is fair game—if you have big enough Balls to convince her to bone you. The hottest girls on the island will always choose the guys with the biggest Balls, and a guy with small Balls will need to start at the bottom unless he’s willing to pay for it. Not only is sex fun, but in BoneTown it’s essential. From the blowjobs that increase your Health, to the sex that gives you bigger Balls, or the anal which does both, sex is a major part of succeeding in BoneTown. In the drug fueled paradise of BoneTown, the only drug problem is not having them. Illicit substances--from the mushrooms that can make you invincible, to the peyote that takes you to the Spirit World, to the booze that makes you more attractive to women--give you extraordinary powers and can make all the difference in winning a fight or getting laid. Many cultural groups have embraced particular kinds of drugs, and knowing who’s using what makes it easier to grow your stash. Need weed? Find a stoner. Got an itching for some Peyote? Better head to the Reservation. In BoneTown, keeping your stash full is all about knowing the city and its inhabitants. In BoneTown, you fight for everything from settling disputes, to getting drugs, to getting laid, and hitting someone with a mannequin leg, a dildo, or even a frying pan is as common as throwing an uppercut. In the BoneTown fight system, upgrades allow you to use beer bottles like shotguns, spit whiskey flames, or shoot lightning out of your ass to literally knock your opponent to their knees. Once an opponent has been KO’d, it’s time to steal their shit. Their voice, fight buffs, sexual buffs, and even the clothes off their back are fair game. But don’t expect different treatment when you lose. You have to fight your ass off with whatever’s available to survive on the mean streets of BoneTown. Over the years, BoneTown has become home to a slew of iconic individuals. Hang out with stoners, rockers, Mormons, the superhero Buttman, porn legend Ron Jeremy, or even the reclusive Jesus--then, knock them out and steal their identities. But watch out, not everyone in BoneTown is friendly, and when you run into the Devil, you know you’ve hit rock bottom. Familiar with BoneTown, and wonder what the Second Coming Edition is? Well, with Steam allowing adult games, BoneTown’s developers got one more crack at our crown jewel. In the end, we added and improved so many things that we felt it wasn’t the same game it had been before. So what’s different in the Second Coming? To start with, we increased the graphics through a complete overhaul of the levels and texture sizes. Next, we added over three times more voice content, greatly increasing the variety of girls you can bone and male characters you can become. Then, we doubled the number of competitions and other gameplay missions within each level. And that’s not all--keep an eye on the News section to see what else is coming to your favorite debaucherous town.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/288080/header.jpg?t=1645819264",
    "Price": 19.99,
    "Developers": "D-Dub Software",
    "Publishers": "D-Dub Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_16d784f5366705918be898cdbbcd51c4928669b7.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_fcb7cbe80ad7dfe3d28b3b3888cfcfbb297f2bab.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_8b4df060044bcb80ed0dfc75f8206b1e80a80b00.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_bdd8ed97fdfa8a8813960360f570740788322b0b.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_95c1191671f1cc88f7a532eaa69459e115c4cafc.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_5f47a7e1369095391ad854c8bd1c315566771696.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_058a42306b87beeede28d185381cda21d84a58be.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_581fb3b1566278e14ff515d509ac96568601658c.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_ae1a3d320be455a3883919957dc37b8920fa3710.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_1d9cfdde5dacff9e9d504697bd5e1e108a9863fc.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_24d23b668b3cbd4cee99a8557e8f3342bcc43095.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_e595296bf8ebd9a23710741c0399d19d6631e2b5.1920x1080.jpg?t=1645819264,https://cdn.akamai.steamstatic.com/steam/apps/288080/ss_11b6f3f9aa99ac9a6bee00913c1677c47c6407dc.1920x1080.jpg?t=1645819264",
    "Slug": "bonetown-the-second-coming-edition",
    "Meta Title": "BoneTown: The Second Coming Edition: Jun 8, 2021, D-Dub S...",
    "Meta Description": "Looking for information on BoneTown: The Second Coming Edition? Check out the release date (Jun 8, 2021), developer insights from D-Dub Software, and a ...",
    "Alt Text Image": "Official header image for BoneTown: The Second Coming Edition game - Steam 288080",
    "Canonical URL": "https://gusku.site/game/bonetown-the-second-coming-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BoneTown: The Second Coming Edition\", \"description\": \"Looking for information on BoneTown: The Second Coming Edition? Check out the release date (Jun 8, 2021), developer insights from D-Dub Software, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"D-Dub Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"D-Dub Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/288080/header.jpg?t=1645819264\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}