{
    "AppID": 935950,
    "Name": "Croquet Pro",
    "Release date": "Nov 15, 2018",
    "About the game": "Grab a mallet and ball, stake the wickets, and enjoy this refreshing take on the classic outdoor sport. Shoot, stroke, and knock your way through a hand-designed collection of croquet courts. Croquet the app is inspired by the sport enjoyed by many people. The rules most closely resemble 9-wicket Croquet, however, there are some creative differences including the layout of the courts. A game is played by two, three, or four players. As far as gameplay goes, the primary rule is that passing the ball through a wicket gives you another stroke. There is also the special croquet stroke that occurs after striking another ball. The first player to pass through all wickets in the course and reach the final peg is the winner. Triumphed in the literary imaginations of Lewis Carroll and Edward Gorey, the sport has been given notice by authors in the whimsical and nonsense tradition. As such, Croquet Pro takes this spirit to heart in the design of each unique court. Some courts, like the leading Monk’s Meadow feature a traditional wicket arrangement. Others – such as the eerie Creepy Castle and ultimate Erstwhile Emptiness – employ asymmetrical tendencies for more curious and intriguing gameplay. You gain access to new courts by earning stars just through playing. Another key feature of Croquet is the ability to perform the namesake croquet stroke and foot roquet. A croquet is achieved by striking the ball of another player in the same court. A successful hit gives you a choice – you may either place your foot on your ball then hit the other ball or continue with an extra stroke. It is possible when continuing to strike both balls in a way like billiards. Once the action is taken, you must be careful not to strike the same ball again before your next turn or you are penalized with returning to the same position from which your turn began. Special strokes make the game much more compelling and strategic than simply a race through wickets to the finish. Croquet supports offline and online play. You may either play against up to four of the computer opponent or go online and play against other people. There is a multiplayer lobby with public and private game options. The AI opponent in offline mode plays competitively and fairly, and can offer a fun challenge for both beginning and experienced players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/935950/header.jpg?t=1542328015",
    "Price": 0.99,
    "Developers": "Falling Ninja Productions",
    "Publishers": "Top Secret Studios LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/935950/ss_832be36f6b600ca50b783f37e99044241fb65344.1920x1080.jpg?t=1542328015,https://cdn.akamai.steamstatic.com/steam/apps/935950/ss_4f505b59988034d9af93781ae4c723c0c36d3cd8.1920x1080.jpg?t=1542328015,https://cdn.akamai.steamstatic.com/steam/apps/935950/ss_7b9a6d11bed747f088ea905edded327bd7a4200f.1920x1080.jpg?t=1542328015,https://cdn.akamai.steamstatic.com/steam/apps/935950/ss_28b6e52a048dfcd6409ba5ab765b85fbc5ec57b0.1920x1080.jpg?t=1542328015,https://cdn.akamai.steamstatic.com/steam/apps/935950/ss_549a6abc26c43f3ff499e49982517afcc8056f8e.1920x1080.jpg?t=1542328015",
    "Slug": "croquet-pro",
    "Meta Title": "Croquet Pro: Nov 15, 2018, Falling Ninja Productions and ...",
    "Meta Description": "Looking for information on Croquet Pro? Check out the release date (Nov 15, 2018), developer insights from Falling Ninja Productions, and a complete gam...",
    "Alt Text Image": "Official header image for Croquet Pro game - Steam 935950",
    "Canonical URL": "https://gusku.site/game/croquet-pro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Croquet Pro\", \"description\": \"Looking for information on Croquet Pro? Check out the release date (Nov 15, 2018), developer insights from Falling Ninja Productions, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Falling Ninja Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Top Secret Studios LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/935950/header.jpg?t=1542328015\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}