{
    "AppID": 1216710,
    "Name": "Cyber Manhunt",
    "Release date": "Feb 2, 2021",
    "About the game": "Hello everyone, we are the Aluba Studio, and we are happy to share our game with you that is Cyber Manhunt . Like this game's name mentions, this is a cyber-puzzle game which is combined with the network of violence , big data , loss of privacy and other social problems . Many plots of this series game relate to real events . So you can find many familiar stories in your life as Deja-vu scene. Theme In our creative process, we found that the Internet is more important in our life than everyone's imagination. Social events always have different opinions in the real world. And there is always has a little group of people who enjoy judging others, and because of that, the events would be more complicated, even leading emergencies to happen. When information flow quickly transforms in every place of the world, immorality and illegal news always happen. In this process, more and more people enjoy being judging process. After careful consideration, we decided to make an amazing game to let people really know about the dangers of internet world. We focus on the dark web , truly cybercrime and privacy burglary , tried to let gamers can experience being a hacker in the real world. Every little operation would affect the life of the characters in the game, which would let you rethink the relationship between people and the internet. Features You can do some really hack in our game: ·Web search You should collect basic information about the targets through the Internet search. ·Database You can use the database to get deep information about targets. ·Crack You would get passwords based on the obtained target's information, and use it to log in to accounts of different platforms (including email, social media, chat application, etc.) ·Chat The exciting thing is that you need to chat with targets by disguise and use the information to get the trust of the target. ·Picture Analysis You can get valuable information and relevant clues from pictures. ·Phishing You can send phishing links to hack the targets' hardware devices (computer, mobile phone), and get private information. More advanced hacking methods will be unlocked later! Gameplay ·Highly Immersive Gamers play as a hacker in the game, accepts the commission of the company, and solve dangerous incidents. ·Rich Gameplay There are lots of features of Social Engineering in the game, which is including Detecting, Tracking, Puzzles-Solving, Destroying and Hacking etc.. ·Complex Story The game will judge the good and evil of the player's behavior. Different judgments will lead to different plot directions. ·Multiple Roles There are many different roles in this game with a flash of personality. Their stories would be dug by yourself. Written in the end When we decided on the subject matter of the game, we thought about it for a long time. Because of This War of Mine , Papers, Please , Orwell and other excellent indie games, we also want to make a game that allows gamers to think outside the game. We tried so many times to brainstorm. We set up a Social Engineering group to find some experts and ask them about the skills for giving gamers a real hacking experience. We even read the book The Art of Deception written by the famous hacker Kevin David Mitnick to figure out how a real hacker's works. These studies directly opened the door to a new world for all of us. The disciplines involved social engineering, psychology, micro-expressions, phrase skills and so on, which kinds of studies make us have great confidence in the theme of the game and gameplay. Not just professionals and books, we also get inspiration from cinema. For example, through Who Am I: No System Is Safe , we have seen another explanation about hacking skills. Through Searching we have learned how to create storytelling in details and how to let the audiences and games focus on where we expect them to focus. Every times learning makes us closer to the game in my heart. So as we mentioned before, this game is very special and unique which combines a lot of creativity. I really hope that you guys could like this game so much. Please feel free to leave your advice and feedback in Community.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1216710/header.jpg?t=1658978941",
    "Price": 9.99,
    "Developers": "Aluba Studio",
    "Publishers": "Aluba Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_61a051d7b562b7b2a630eb987f82f96d2bd0443a.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_b4c9af7fb3abdfb5a19b67c359b92bed1de47980.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_67b6abb9d3fb492e028e087e24e89501bb7fe210.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_ef90401345f981c6d31952d95b9a2694d72c8199.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_08061536d1aea0aa48c139a9299e9bbc2b619eaa.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_6148c64cefec9b0e5706c7e5a99ce1d8f15c94e3.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_da42d51b7e9b9d3583a96153c5598f1064d8a9e4.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_6b55b6fb258655737b6566e89d570d7b5b98e89e.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_5e399bfbcfc960ecf8df9b00fda70d42ec59ef02.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_1747b9a4fa29902e25cc636c28c0cb0ad7cc8da0.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_8013e4bf0faa2f07040e808d89c6638b138fcc7b.1920x1080.jpg?t=1658978941,https://cdn.akamai.steamstatic.com/steam/apps/1216710/ss_af1bff80b9aa48822027e7ae166e80bd6ef8c76c.1920x1080.jpg?t=1658978941",
    "Slug": "cyber-manhunt",
    "Meta Title": "Cyber Manhunt: Feb 2, 2021, Aluba Studio and Full Overview",
    "Meta Description": "Looking for information on Cyber Manhunt? Check out the release date (Feb 2, 2021), developer insights from Aluba Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Cyber Manhunt game - Steam 1216710",
    "Canonical URL": "https://gusku.site/game/cyber-manhunt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyber Manhunt\", \"description\": \"Looking for information on Cyber Manhunt? Check out the release date (Feb 2, 2021), developer insights from Aluba Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aluba Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aluba Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1216710/header.jpg?t=1658978941\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}