{
    "AppID": 1223160,
    "Name": "CyberLink PowerDVD 20 Ultra",
    "Release date": "Apr 27, 2020",
    "About the game": "Redefining Entertainment - The Best Media Player for Windows PowerDVD is more than just a Blu-ray and DVD player – it's an all-in-one, premium multimedia app that allows you to get the most out of your viewing experience. In addition to the highest quality media playback available, PowerDVD allows you to organize all of your content in one place. From your full collection of video, music, and photos, PowerDVD gives you complete control and even gives you on-demand access to your media library from any device or screen, wirelessly! The new wireless, on-the-go multimedia experience. Thought you knew PowerDVD? Think again. Seamless Playback Continue watching from the exact point where you left off, in any room, seamlessly on any device. Watch On-The-Go Take your movies and TV shows anywhere with the CyberLink cloud. No internet? No problem! You can even download to your mobile device to resume watching offline. All Your Entertainment Across Devices &amp; Screens Redefine your entertainment experience with the ability to view wirelessly, cast to TV devices, or stream on-the-go. Watch your videos on-demand, from any device, in any place. On PC Watch your favorite videos on PC using the all-in-one media player with the industry’s widest support of file formats as well as Ultra HD Blu-ray and 8K video. On the Big Screen Upgrade your home cinema experience with stunning 8K video and support for 4K, HDR 10. Use the built-in TV Mode to intuitively browse your media collection. Cast to Apple TV, FireTV, Chromecast or Roku Stream your videos and TV shows to your TV using any leading casting device such as Apple TV®, Fire TV™, Chromecast™, or Roku®. Enjoy Content on Mobile or Tablet With CyberLink's 100GB cloud space included in PowerDVD 20, store hours of content and watch your favorite videos using the PowerPlayer app, wherever and whenever you choose. Unparalleled Video &amp; Audio Quality Bring your favorite Ultra HD movies and high-quality videos to life with PowerDVD’s exclusive cinematic TrueTheater video and audio enhancements, including extended GPU support for HDR 10. TrueTheater for Video TrueTheater for Audio Surround &amp; Lossless Sound View Movie and TV Media Info Access detailed information about movies and TV shows with PowerDVD’s new, extensive content database.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1223160/header.jpg?t=1642597368",
    "Price": 99.99,
    "Developers": "CyberLink",
    "Publishers": "Deep Silver",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1223160/ss_4d6914c249affe0cb57bfbfa92c4bd0269f37d7e.1920x1080.jpg?t=1642597368,https://cdn.akamai.steamstatic.com/steam/apps/1223160/ss_1e27e59aaace60b3fe21069df1ee913c1e2175fa.1920x1080.jpg?t=1642597368,https://cdn.akamai.steamstatic.com/steam/apps/1223160/ss_a238b312cd57c6cca3d819953397ce1416c1ed2e.1920x1080.jpg?t=1642597368,https://cdn.akamai.steamstatic.com/steam/apps/1223160/ss_6e585217819e04eb372597505e8bc7b7133611d5.1920x1080.jpg?t=1642597368,https://cdn.akamai.steamstatic.com/steam/apps/1223160/ss_c28fd3ab65adcb7b780d7341ead7069d9aa09024.1920x1080.jpg?t=1642597368,https://cdn.akamai.steamstatic.com/steam/apps/1223160/ss_22fef74a1a93c639634ebfb3cc8816873177b7d1.1920x1080.jpg?t=1642597368",
    "Slug": "cyberlink-powerdvd-20-ultra",
    "Meta Title": "CyberLink PowerDVD 20 Ultra: Apr 27, 2020, CyberLink and ...",
    "Meta Description": "Looking for information on CyberLink PowerDVD 20 Ultra? Check out the release date (Apr 27, 2020), developer insights from CyberLink, and a complete gam...",
    "Alt Text Image": "Official header image for CyberLink PowerDVD 20 Ultra game - Steam 1223160",
    "Canonical URL": "https://gusku.site/game/cyberlink-powerdvd-20-ultra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CyberLink PowerDVD 20 Ultra\", \"description\": \"Looking for information on CyberLink PowerDVD 20 Ultra? Check out the release date (Apr 27, 2020), developer insights from CyberLink, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Deep Silver\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1223160/header.jpg?t=1642597368\", \"offers\": {\"@type\": \"Offer\", \"price\": 99.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}