{
    "AppID": 591140,
    "Name": "Disc League",
    "Release date": "May 17, 2017",
    "About the game": "In multiplayer Disc League you engage with others in skilled medium range disc combat. Master your timing of throws and shielding, trick opponents, deflect their discs, teleport to key strategic locations and earn the most points by bashing opponents with well placed and well timed throws. The gameplay is fast, you must make split second decisions and continually work to gain greater positioning as the situations change in these free for all battles. Disc League has plenty of features now but even more are on the way. FEATURES Dedicated Servers currently in the USA, soon expanding into Europe. Dedicated servers means lower latency, better online physics and fairer gameplay. Networked Physics make for dynamic gameplay where battles are never ever the same. Unique Disc Characteristics, some are better for arced throws while others are better at the straight and fast thrusts. Character Customization offers various helmets and suits, each with their own influences on your movement, targeting and more Dynamic Environments designed for unique gameplay and stand apart aesthetics. You must vary your strategy for each level to adjust to new distances, pacing, types of cover and special places to access via teleportation. Intelligent Bots with their own personalities and abilities are available to compete with, allowing you to play anytime you'd like. IN DEVELOPMENT We have many new features in various stages of development. Some are near complete and will be released soon. Here is a roadmap of things to come. League Challenge (Single Player mode) is a sequence of tournaments where you compete against 30 other teams through 4 events of increasing skill and difficulty. Each team has unique AI with varying skills and personalities. For players seeking a real challenge, the tournaments can be played in 1v2(Hard) or 1v3(Iron Man) modes of difficulty. More Gear is nearing completion, including 2 more female uniforms, 2 more helmets and 1 more disc. The new disc (Kyokusen), which means 'curve' in Japanese, is intended for players skilled in the use of arced throws. Arced throws are a great way to get around overly defensive players. More Gameplay like power-ups, environmental effects, new match types are all in development More Arenas are on their way. Close quarters 1v1 arenas have already been created and are being used in single player modes. Other multiplayer maps exist in various degrees of completion and will be released as they are completed. COMBAT DISCS Each disc has unique characteristics that enable it fly faster, stabilize better, curve stronger, generate shields and offer some degree of assisted targeting. Current Discs offered in the League Protector ( upper left ) a powerful and stable disc with excellent defense. Easier to throw straight and still capable of arcs as needed. Faith ( right side ) a balanced disc with great speed, curvability and defense. An excellent disc for any situation. Shita ( lower left ) a light and fast disc requiring a skilled hand to keep stable but deadly quick in the hands of a veteran. ENVIRONMENTS Each environment is unique, requiring learning, skill and adjustment to make the most of each battle. The Station is a complex tunnel network with various sized rooms intertwined. Use your disc to teleport to higher ground, then jump down the chutes to literally get the drop on unsuspecting opponents. Shroom Garden an interesting planet spotted with giant mushrooms and other plant life. Teleport to the top of the mother shroom in the center to gaze upon the beautiful purple alien sky with its bright blue star and colored fog. Then jump down below and use the smaller fungi as organic cover in battle. Dark Pyramid is a smaller, more intense map composed of 2 independent levels, recommended for 4 players. The main area is a neon pyramid surrounded by angled walls, great for bouncing discs into opponents. Use the teleporters to warp below into the very dark basement where you'll need to use your disc light to see. Down here you'll find paneling, computers and other equipment to use as cover while you stock other opponents by following their disc lights. COMMUNITY FEEDBACK Purchasing this game in early access helps to fund the further development of this game. We are open to your opinions and wish to shape the product to the liking of the fans. Please consider joining us and let us know what you think and what you would like to see in the development of Disc League. THANKS",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/591140/header.jpg?t=1496182711",
    "Price": 19.99,
    "Developers": "Virtually Invincible LLC",
    "Publishers": "Virtually Invincible LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_ac205f7456974a129a4085dd6e91a5f058c8f7b1.1920x1080.jpg?t=1496182711,https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_5cd6e5ed671c1fd823b229520ac7550ec563ff8b.1920x1080.jpg?t=1496182711,https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_0e99153c43cc890f9cc5853e8bb8c05923c91969.1920x1080.jpg?t=1496182711,https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_0970a914e92074adddafeddfdef12a8077be9a51.1920x1080.jpg?t=1496182711,https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_fe59d5039a4910be2e8ec78468180064d09d8e55.1920x1080.jpg?t=1496182711,https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_10b8491a82b63eb23da771085f1bd72120f8ceb5.1920x1080.jpg?t=1496182711,https://cdn.akamai.steamstatic.com/steam/apps/591140/ss_e0aa8ef970670a2b1953d42744f325ddd6943d1c.1920x1080.jpg?t=1496182711",
    "Slug": "disc-league",
    "Meta Title": "Disc League: May 17, 2017, Virtually Invincible LLC and F...",
    "Meta Description": "Looking for information on Disc League? Check out the release date (May 17, 2017), developer insights from Virtually Invincible LLC, and a complete game...",
    "Alt Text Image": "Official header image for Disc League game - Steam 591140",
    "Canonical URL": "https://gusku.site/game/disc-league",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Disc League\", \"description\": \"Looking for information on Disc League? Check out the release date (May 17, 2017), developer insights from Virtually Invincible LLC, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Virtually Invincible LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Virtually Invincible LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/591140/header.jpg?t=1496182711\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}