{
    "AppID": 1689720,
    "Name": "Ecila",
    "Release date": "Aug 14, 2021",
    "About the game": "'We’re all mad here.' Welcome to the world of strange fairy tales. We have created a deformed world where soft, harmless-looking fairy tale characters exist. There are fairy tale characters in the world that do not die even if they fall. Also, there's some helpers to help you. In your adventures, you will discover a tangled fairy tale story, acquire various items for the adventure, and reach the truth and ending of the story hidden in a higher level of difficulty. Run, jump, fight with your friends Ecila is a 3d side scroll + MMO online game. Use the keyboard to move, run, jump, and use skills. Moving to the direction key and jumping to the S key, hunting monsters on the hill and moving forward to avoid traps. The skills acquired when leveled up are invoked more strongly when the key is pressed at the right time. Automatically, you can run and fight and use potions and skills. However, action skills are not automatically available. You have to change three weapons: one-handed sword, two-handed sword, and bow. Monsters are resistant to one of the three weapons, so they are not damaged. Monsters who are strong against the bow do not collapse no matter how many times they attack with the bow, so they have to be attacked with one-handed or two-handed swords. Register 3 weapons, armor, and costumes in advance for presets and fight while replacing them at the right time. Play games online by collaborating with other users through parties, guilds, and transactions. Invite your friends to the game. Game Features Keyboard control - You can move the character using the keyboard direction key and jump using the space bar. All-Rounder Characters - If you create one character, all weapons are available. Sometimes it must be changed. Compatibility - There is effective equipment for a distinctive opponent. Deal with it by replacing the equipment. Transformation - In addition to all-rounder characters, more specialized transformation skills can be lifted. Enjoy a more advantageous fight. Production - Items acquired have a place of use. You can make various items that can be used by characters by consuming materials. Synthetic - Accumulated equipment can collect the same equipment and transform it into other equipment with new properties. Reinforcement - Use materials to improve the capability of the equipment. Socket - Equipment with slots can be acquired and items that can be mounted in slots can be used to improve the character's combat capability. Purchase Through in-game store, players purchase a product called 'Dia' (Steam Microtransaction). 'Dia' is used to buy costumes and topaz purchases. Special costumes cannot be obtained through gameplay. Topaz is used to buy special items (Topaz can also be obtained through gameplay). Items obtained by using Topaz are HP recovery items, AP recovery items, skill initialization, experience booster, teleport order, etc.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1689720/header.jpg?t=1633638676",
    "Price": 0.0,
    "Developers": "DevFun Inc.",
    "Publishers": "DevFun Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_d768418782dc5ad39946745e5456c672e43f7be2.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_4e6c593a373d9fb49378521bb649f50c5296b287.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_f6782eca8fc33e907bc98d61a1726ce91cb62ecc.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_563d0daaa688571bd3e356cb232c1b0b2bf1462e.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_319405192f003300a1e4b34729f3e56fc02f1e99.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_fd7e8cfea94aa89eeed15242e5e21ed413d19e72.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_39aab5acad97b3889f21b9d6d6903a6876b5fac1.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_0f1825c15340db2afe235894037d74eedc56b8f6.1920x1080.jpg?t=1633638676,https://cdn.akamai.steamstatic.com/steam/apps/1689720/ss_89a4c7498e94bff4ee9e99a3ba14fe6d1e1fe4ae.1920x1080.jpg?t=1633638676",
    "Slug": "ecila",
    "Meta Title": "Ecila: Aug 14, 2021, DevFun Inc. and Full Overview",
    "Meta Description": "Looking for information on Ecila? Check out the release date (Aug 14, 2021), developer insights from DevFun Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Ecila game - Steam 1689720",
    "Canonical URL": "https://gusku.site/game/ecila",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ecila\", \"description\": \"Looking for information on Ecila? Check out the release date (Aug 14, 2021), developer insights from DevFun Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DevFun Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DevFun Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1689720/header.jpg?t=1633638676\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}