{
    "AppID": 582460,
    "Name": "Epitaph",
    "Release date": "Oct 29, 2020",
    "About the game": "Battle To the Death (And Beyond) Battle for control of the afterlife in Epitaph, a competitive, fast-paced tactical battler. Pick three Reapers, the aspects of death, and fight your opponent in real-time, cooldown-based combat. You'll control all three characters at once, sequencing their abilities and setting up explosive combos to decimate your opponent. But be careful - every time a Reaper dies, they come back stronger, so moving closer to victory will make your opponent even more deadly. Fast-Paced Tactical Combat: Epitaph’s combat is a unique mix of strategy and timing - think Darkest Dungeon’s abilities mixed with Final Fantasy’s Active Time Battle System. You’ll have to outwit and outsmart your opponent in real time, planning and sequencing your abilities carefully to land devastating combos and counter your opponent’s intentions. Battle Among Deaths: Epitaph takes place in the afterlife, where the many faces of Death are fighting against one another in a battle for souls. There are 13 different Reapers in Epitaph's roster, and you’ll draft a team of three to fit your personal strategy. Will you take Becilla, the Commander, who charges into battle and calls her allies to her side, or Ezzim the Executioner, who relentlessly hunts down his victims with his mighty ax? Stylish abstract character designs add to Epitaph's ambiance and make it look and feel like to no other competitive game. Death is a Strategy: You can kill a Reaper, but in Epitaph, nothing stays dead for long. If your Reapers die six times, you’ll lose the match - but dead Reapers come back bigger and angrier, making them even more threatening. You may be down early, but are you actually on the verge of losing, or just setting up an amazing comeback for your empowered squad? 13 Unique Reapers There's a reaper for every kind of player, the the brutal, in-your-face style of Unch, The Glutton, to the evasive and supportive strategies of Ziyan, the Martyr. Online and Local Multiplayer Capture the souls of your friends and strangers from across the internet, or the person beside you. Single-Player Puzzle Mode If you’re looking for a more individual challenge, try and solve over 150 puzzles in a single set of moves, ranging ranging from introductory and informative to devilishly hard.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/582460/header.jpg?t=1603983862",
    "Price": 12.99,
    "Developers": "Wyatt Yeong, Kailin Zhu, Jonathan Moormann, Jingjin Liu",
    "Publishers": "Everook",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/582460/ss_f2b1c0ebeb6022936cb902864624d2131d01a5a6.1920x1080.jpg?t=1603983862,https://cdn.akamai.steamstatic.com/steam/apps/582460/ss_525e9ae2bb4ba1574176a3369a8d1df2b23eb60f.1920x1080.jpg?t=1603983862,https://cdn.akamai.steamstatic.com/steam/apps/582460/ss_caeddb8f8ba19a5633f562134296408194ac463b.1920x1080.jpg?t=1603983862,https://cdn.akamai.steamstatic.com/steam/apps/582460/ss_1d6411813ffd0acda36f7fa3fa8665867fd451fd.1920x1080.jpg?t=1603983862,https://cdn.akamai.steamstatic.com/steam/apps/582460/ss_d07e2ca5954b7241120891e2b57e213d944ce14e.1920x1080.jpg?t=1603983862",
    "Slug": "epitaph",
    "Meta Title": "Epitaph: Oct 29, 2020, Wyatt Yeong, Kailin Zhu, Jonathan ...",
    "Meta Description": "Looking for information on Epitaph? Check out the release date (Oct 29, 2020), developer insights from Wyatt Yeong, Kailin Zhu, Jonathan Moormann, Jingj...",
    "Alt Text Image": "Official header image for Epitaph game - Steam 582460",
    "Canonical URL": "https://gusku.site/game/epitaph",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Epitaph\", \"description\": \"Looking for information on Epitaph? Check out the release date (Oct 29, 2020), developer insights from Wyatt Yeong, Kailin Zhu, Jonathan Moormann, Jingj...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wyatt Yeong, Kailin Zhu, Jonathan Moormann, Jingjin Liu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Everook\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/582460/header.jpg?t=1603983862\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}