{
    "AppID": 958530,
    "Name": "Fury of Dracula: Digital Edition",
    "Release date": "Nov 12, 2020",
    "About the game": "Europe stands on the edge of destruction. The nights grow colder and the days grow darker, as Dracula builds his bloodthirsty army of mindless thralls. Only the hunters Dr. Abraham Van Helsing, Dr. John Seward, Mina Harker and Lord Arthur Godalming stand against the advancing evil. But as the sun sets on Europe, can they survive long enough to stop the encroaching darkness? Fury of Dracula: Digital Edition is the digital adaptation of the much-loved board game, first published in 1987 by Games Workshop. Based on the 4th Edition of the game, this faithful adaptation allows you to re-experience this iconic game of gothic horror and deduction in a whole new way. If you’ve never played the original board game, you can see exactly why Fury of Dracula is considered a classic among the board game community! Will you take on the role of Dracula as he increases his influence over Europe? Or will you and up to three friends take on the role of Dr. Abraham Van Helsing, Dr. John Seward, Lord Arthur Godalming, and Mina Harker as they attempt to stop him before his bloody plans bear fruit? Fury of Dracula is a game that emphasizes hidden movement and teamwork, with the hunters having to coordinate their movements to close the net on Dracula. Dracula has a host of tricks and traps up his sleeves, to misdirect and hide from the hunters - but the hunters are armed with plenty of tools too! Each hunter provides a new way to play, with unique stats and abilities to aid them in the fight against this ancient evil. Dracula himself has a range of unholy powers to call upon, allowing him to transform and enthral humans, along with transforming into a bat or mist in order to escape the hunters. Once the hunters and Dracula finally clash, bloody and gruesome combat ensues. Nobody is safe as Dracula lashes out at his pursuers, and the hunters battle against the inhuman and immortal Count. Featuring a card-based combat system that rewards bluffing and tactical choices, no two clashes are the same. Feature List: Detailed Tutorial Designed with care, our in-depth tutorials will walk you through everything you need to know to start your hunt. A Faithful Adaptation Based on the 4th Edition of the physical game, Fury of Dracula: Digital Edition recreates the iconic board game in its entirety. Multiple Game Modes Choose from battling against the AI, teaming up with friends locally or taking the hunt global with up to five players in online battles. Detailed Card Library Browse everything Fury of Dracula has to offer in our detailed library, including character, combat and event cards to prepare yourself. Haunting Animations The artwork from the original board game bursts to life with beautiful and bloody animations for every single piece. A Chilling Soundtrack Composed and created from the ground up for Fury of Dracula: Digital Edition, this soundtrack is sure to send chills down your spine - also available as a standalone purchase!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/958530/header.jpg?t=1653309543",
    "Price": 19.99,
    "Developers": "Nomad Games",
    "Publishers": "Nomad Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_aec0c589a643ebc7a8d8507bb28c556bce77f10c.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_1a8cbb289be3d5e4da3ac89aaf92be0560839146.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_721e97154b886fb5a9ecca44f64ad5ce4415ecfb.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_2c5f8d756eea12d237c9c94d3dd6ad6e14ccdcdd.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_4046a70ef76cc9417bca752f5dbdae32f7fb80e8.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_d2225497edf3609f08d5c0739ef468b52cb92ddf.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_74a438a1f6292c8ad862a76e21cf63e79dc17bcc.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_f9a27ae0159d8faebb782decab26f3d4dfe76939.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_95900fb15ae132091c8e91a2b53d953be0aec4ff.1920x1080.jpg?t=1653309543,https://cdn.akamai.steamstatic.com/steam/apps/958530/ss_8f6a5a0b766e307a5672cadbbff2b09f0cae3659.1920x1080.jpg?t=1653309543",
    "Slug": "fury-of-dracula-digital-edition",
    "Meta Title": "Fury of Dracula: Digital Edition: Nov 12, 2020, Nomad Gam...",
    "Meta Description": "Looking for information on Fury of Dracula: Digital Edition? Check out the release date (Nov 12, 2020), developer insights from Nomad Games, and a compl...",
    "Alt Text Image": "Official header image for Fury of Dracula: Digital Edition game - Steam 958530",
    "Canonical URL": "https://gusku.site/game/fury-of-dracula-digital-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fury of Dracula: Digital Edition\", \"description\": \"Looking for information on Fury of Dracula: Digital Edition? Check out the release date (Nov 12, 2020), developer insights from Nomad Games, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nomad Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nomad Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/958530/header.jpg?t=1653309543\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}