{
    "AppID": 1852520,
    "Name": "元宇宙普信男生存指南",
    "Release date": "Jan 16, 2022",
    "About the game": "The content of this game is purely fictional and has nothing to do with any real groups, events, places or people. Any similarity is purely coincidental. In the 77 years of the meta-universe, 77% of the world's population is active in 114,514 disparate virtual communities. Our story takes place in one of the 114514 'Vega' communities. In Vega, the public morality is very different from the first year of the cosmic calendar (2021), and the two most prominent points are universal faith. In the first year of the meta-universe, everyone is ordinary, but it is ordinary people who make great achievements with ordinary people that make glimmers of light converge into a river of stars, creating a miracle. Confidence, on the other hand, is one of the most beautiful qualities of a human being. Confident people have an aura about them and seem to have everything under control. Unfortunately, in the 'Vega' community of 77 years in the meta-universe, the word 'universal faith' has become a criticism and accusation. It seems that everyone, no matter men or women, old or young, should not be an ordinary person, let alone be ordinary and keep a confident heart. Now, in the year 77 of the metacosmic calendar, if you are a 'universal male' like me, but have entered the 'Vega' community, I can only hope that you can keep yourself, do not lose this valuable quality. In Vega, you will encounter all kinds of events that are not in keeping with contemporary morality. Here are two options for you to choose from. For example, if you approve of stealing, snooping, or bullying, you will lose your goodness, and if you do not, you will become more virtuous. If you completely lose the goodness, will become the vast masses of 'vega', and if you are too kind, so 'Vega' is not able to accommodate you. There's a lot of funny stuff going on here, too, so gloat or take it seriously is up to you. It's worth noting that most of vega's people are schadenfreude funniers. On top of that, just like everyone else in the meta-universe, you'll have to work overtime, work overtime, and even be lucky when 'the biggest and worst incident in the history of the meta-universe -- your balls running away from your apartment.' The good news is, there's always luck in the universe, and there's always a chance you'll get a girlfriend. There are 8 endings and many achievements waiting to be unlocked.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1852520/header.jpg?t=1651125653",
    "Price": 1.99,
    "Developers": "织女星游戏",
    "Publishers": "织女星游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1852520/ss_14dc2e03de850824de84a6480bf1f6d75bc352a2.1920x1080.jpg?t=1651125653,https://cdn.akamai.steamstatic.com/steam/apps/1852520/ss_12add37c634e907d98d83ff0fa50c05644a989d5.1920x1080.jpg?t=1651125653,https://cdn.akamai.steamstatic.com/steam/apps/1852520/ss_a4b66ff2ce0d20aab9a520d30a80b3cda399c0f6.1920x1080.jpg?t=1651125653,https://cdn.akamai.steamstatic.com/steam/apps/1852520/ss_e95f89fa4d6bfa2edf8ae7932ac22ae166b093da.1920x1080.jpg?t=1651125653,https://cdn.akamai.steamstatic.com/steam/apps/1852520/ss_b3475565f6dcf01e3c61912b346a56379c1a2656.1920x1080.jpg?t=1651125653,https://cdn.akamai.steamstatic.com/steam/apps/1852520/ss_49355b72d07e20e423ef1bc2b9f357acbabba89a.1920x1080.jpg?t=1651125653",
    "Slug": "",
    "Meta Title": "元宇宙普信男生存指南: Jan 16, 2022, 织女星游戏 and Full Overview",
    "Meta Description": "Looking for information on 元宇宙普信男生存指南? Check out the release date (Jan 16, 2022), developer insights from 织女星游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for 元宇宙普信男生存指南 game - Steam 1852520",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5143\\u5b87\\u5b99\\u666e\\u4fe1\\u7537\\u751f\\u5b58\\u6307\\u5357\", \"description\": \"Looking for information on \\u5143\\u5b87\\u5b99\\u666e\\u4fe1\\u7537\\u751f\\u5b58\\u6307\\u5357? Check out the release date (Jan 16, 2022), developer insights from \\u7ec7\\u5973\\u661f\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u7ec7\\u5973\\u661f\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u7ec7\\u5973\\u661f\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1852520/header.jpg?t=1651125653\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}