{
    "AppID": 1602970,
    "Name": "Gedel Escape",
    "Release date": "Feb 22, 2022",
    "About the game": "The plot of the game Dominic Stewart is an adventurer in deep space. On board the SBS-M72 spacecraft, he studies one galaxy after another in order to find traces of his father, who did not return from another expedition several years ago. During the next trip, Dominic's ship falls into a black hole and through the curvature of space finds itself in a previously unexplored system near the planet Gedel. The ship is wrecked. The star next to which Gedel is located has gravitational instabilities, as a result of which bursts of space-time distortion occur every 12 hours. The entire planet falls into a time loop and rolls back a planetary day ago. Gödel exists on the same day every time. To get out of the planet Dominic needs to overcome time. The main enemy is time Time on the planet Gödel is divided into planetary cycles. At the end of each cycle, everything that is there disappears from the inventory. The exception is items that are placed in protected slots. But there are only five of them! You have to choose what to save in these slots: resources, crafted items, or something else you need to survive? Jetpack flights From the start, the player has access to a jetpack, with which he can fly around the world of Gedel and visit all the most inaccessible places. But keep in mind that the jetpack consumes energy, so for long flights you will need a lot of batteries! Crafting system All items are immediately available for creation. All you need is resources. But while you mine their planetary cycle will end and the contents of the inventory will be reset to zero. In pursuit of crafted items, you can stay at a broken trough! Resource management You need to constantly choose what to focus on: survival or completing quests. There is not much time, and each planetary cycle may be the last. Puzzle The world of the planet Gedel is filled with mysteries. Solving them, you get to know the plot of the game, the history of the planet and get useful things. Dangerous Enemies There are no living organisms on the planet Gedöl, but this does not mean that the surface is safe. The player will have to face dangerous robots and mechs, but one should not openly rush into battle. It is worth remembering that Dominic is, first of all, an astronaut, not a soldier. Is it not worth it in this case to be smart and try to avoid a collision?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1602970/header.jpg?t=1645549902",
    "Price": 6.99,
    "Developers": "Bantik Games",
    "Publishers": "Bantik Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1602970/ss_a7e7f54e9b880436da7f5cef4a1695d6fd22eb85.1920x1080.jpg?t=1645549902,https://cdn.akamai.steamstatic.com/steam/apps/1602970/ss_98ab098544f662a1409688621c8c04c572e464ad.1920x1080.jpg?t=1645549902,https://cdn.akamai.steamstatic.com/steam/apps/1602970/ss_9aa5f382f3dbb494366c6b22f54e880bb46b9e0f.1920x1080.jpg?t=1645549902,https://cdn.akamai.steamstatic.com/steam/apps/1602970/ss_46c2440ea99513c6f29a9664768441e8f2a77217.1920x1080.jpg?t=1645549902,https://cdn.akamai.steamstatic.com/steam/apps/1602970/ss_7df7869cb496ecc7e0049e527d9d780c33db0e2f.1920x1080.jpg?t=1645549902,https://cdn.akamai.steamstatic.com/steam/apps/1602970/ss_e280d6c2dcc7369983f0cf7f6417548a9256059c.1920x1080.jpg?t=1645549902",
    "Slug": "gedel-escape",
    "Meta Title": "Gedel Escape: Feb 22, 2022, Bantik Games and Full Overview",
    "Meta Description": "Looking for information on Gedel Escape? Check out the release date (Feb 22, 2022), developer insights from Bantik Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Gedel Escape game - Steam 1602970",
    "Canonical URL": "https://gusku.site/game/gedel-escape",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gedel Escape\", \"description\": \"Looking for information on Gedel Escape? Check out the release date (Feb 22, 2022), developer insights from Bantik Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bantik Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bantik Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1602970/header.jpg?t=1645549902\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}