{
    "AppID": 1301310,
    "Name": "Gems of Fate: the Charmed King",
    "Release date": "May 14, 2020",
    "About the game": "To all fans of puzzles, lovers of fairy tales and pixel art - specially for you game 'Gems of Fate: the Charmed King'! Happiness and joy reigned in the fairy kingdom under the rule of a wise and just king ... But one night a mysterious storm broke out, after which everything changed! The king began to give strange orders, but he himself has not been seen since. Who will challenge the forces of evil and find out what is the cause of all the ills? Maybe you, a brave hero? Go through the lands of the kingdom to the castle, solving puzzles 3-in-a-row - after all at the end of the path you are waiting for the solution of the story! Over one hundred exciting levels stand between you and the end of the story, but we know something with you that this hero will not stop it! Forward, towards a new magical adventure! Features: 1) A unique combination: 'three in a row', battles with bosses and plot scenes 2) Various modes of the game 'three in a row', different combinations, which make the levels unique. You will find in the game such modes and conditions of performance level, as: - Change in the direction of gravity - Battle with the bosses through the collection of combinations of 'three in a row' - Destruction of clay cells under stones - Release of stones from holding chains - Destruction of obstacles that explode if the stone in the next cell is destroyed - Search for an image hidden under the cells on the playing field - Delivery of one quest object to another - Collecting a certain number of quest items for a limited number of moves 3) Plenty of plot cartoon scenes - only the most stubborn players can see them 4) A fascinating fairy tale as a story, the chapters of which will be opened as the game progresses 5) More than one hundred unique levels - a real challenge for connoisseurs of puzzles 6) The game is suitable for those who just want to relax and relax, and for those who like to think 7) The atmosphere of the fairy-tale Middle Ages 8) Cozy retro style made in pixel art How to play: - Move adjacent stones on the playing field to form combinations of three stones in a row - Strive to fulfill the conditions for completion of the level - Passing through the levels, advance on the level map and open new chapters of history",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1301310/header.jpg?t=1590859012",
    "Price": 6.99,
    "Developers": "Start Warp",
    "Publishers": "Start Warp",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1301310/ss_7ff9f9e926d103658284a44d004af299133be505.1920x1080.jpg?t=1590859012,https://cdn.akamai.steamstatic.com/steam/apps/1301310/ss_69ca2c5ff2c6488113f12aefed9e6fce7bc544f7.1920x1080.jpg?t=1590859012,https://cdn.akamai.steamstatic.com/steam/apps/1301310/ss_9052abd65e4e5a0229c2251bf966df580d514622.1920x1080.jpg?t=1590859012,https://cdn.akamai.steamstatic.com/steam/apps/1301310/ss_f7d5af621979c6d4a09a7ac4410559c684e66cf0.1920x1080.jpg?t=1590859012,https://cdn.akamai.steamstatic.com/steam/apps/1301310/ss_62535191d6c3a95ed89e0f4d45cdd768f344a5be.1920x1080.jpg?t=1590859012",
    "Slug": "gems-of-fate-the-charmed-king",
    "Meta Title": "Gems of Fate: the Charmed King: May 14, 2020, Start Warp ...",
    "Meta Description": "Looking for information on Gems of Fate: the Charmed King? Check out the release date (May 14, 2020), developer insights from Start Warp, and a complete...",
    "Alt Text Image": "Official header image for Gems of Fate: the Charmed King game - Steam 1301310",
    "Canonical URL": "https://gusku.site/game/gems-of-fate-the-charmed-king",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gems of Fate: the Charmed King\", \"description\": \"Looking for information on Gems of Fate: the Charmed King? Check out the release date (May 14, 2020), developer insights from Start Warp, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 14, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Start Warp\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Start Warp\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1301310/header.jpg?t=1590859012\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}