{
    "AppID": 746580,
    "Name": "HARDCORE MECHA",
    "Release date": "Jun 26, 2019",
    "About the game": "Exciting, Fast-paced Mecha Battle, HARDCORE MECHA Well-polished Vivid Mecha World The campaign mode includes 8 chapters and 18 levels in total. As the story develops, you will encounter more than 50 types of enemy mechas with various designs and details in all kinds of scenes like mineshaft, underwater, urban, and space. Some levels even allow you to exit the mecha and infiltrate behind enemy line. Of course, you won't just have one single personal ride, you may develop and customize various new gears and focus accessory in between the missions. Seamless Story Immersion The unique animations with the seamless transition between the 2D platform game scenes have a total duration of 40 minutes, the full-length voice acting provides a unique immersive storytelling experience. Stunning Highly Polished 2D Animations The detailed skeletal animation with a unique impression of power will fully showcase the characteristics of each mecha. The smooth and natural movements have also laid a good foundation for the fine handling experience. Natural 2D rotating animation, the use of visual deception like dislocation and timely switched elements have brought out a visual effect like 3D artwork. Survive, Breakthrough, Challenge Yourself Face endless enemies in these everchanging battlefields, acquire simulation points and gear chests.As the enemy waves goes up, there are even bosses coming in! Let them see what you are truly made of! Develop, Reinforce, Equip Freely Enhance every attribute of your beloved mechas using simulation points acquired in the battle. Enhance specific attributes to a certain level unlocks new mechas! Equip primary weapons and mods acquired in the battle, push your mechas beyond the enhancement limit. (Some special mechas can only equip mods but not primary weapons) Research, Unlock, Rich Choices Unlock and drive in total of 42 mechas with different designs by enhancing prior mechas or reaching certain waves. Try out their unique combat tactics! You ready? ACE pilots, come push yourself and your beloved mechas to the limit! Various Mechas American style, Japanese style, Super style, Realistic style, there are dozens of mechas of all kinds of styles available. Each mecha has its own unique tactical value, only the player who has completely grasped the features of each mecha can fully bring out their maximum combat effectiveness. What type of Mecha is the best? Prove it with your hands in PVP mode! Challenge against Mecha with Mortal Flesh The pilot can be controlled to eject from the mecha and work alone in critical moment with proper strategy, it will absolutely be a force on the battlefield that cannot be underestimated. 4 Times Fun Apart from online PVP battles, this game also enables users to play against each other with local split-screen. Single purchase, 4 times of fun! Story",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/746580/header.jpg?t=1635400913",
    "Price": 19.99,
    "Developers": "RocketPunch Games",
    "Publishers": "RocketPunch Games,Lightning Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_7bb96001b47b526052a7195f2ad88585e22a1cc6.1920x1080.jpg?t=1635400913,https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_a463c401a9b7c67adb718239e540d3ab02b8b99c.1920x1080.jpg?t=1635400913,https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_159bd5517cf1a34fad206f0ae4020c9769326d43.1920x1080.jpg?t=1635400913,https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_6e1e781363176c497308b1cc7bbf601b72781971.1920x1080.jpg?t=1635400913,https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_eb45b3fae979929b5fab4fb33d510c7da82013c8.1920x1080.jpg?t=1635400913,https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_b4bb96340718db614ae7c7f0201369cc9babe122.1920x1080.jpg?t=1635400913,https://cdn.akamai.steamstatic.com/steam/apps/746580/ss_921466a426897dbeac56a9d149eec0d9f0524fab.1920x1080.jpg?t=1635400913",
    "Slug": "hardcore-mecha",
    "Meta Title": "HARDCORE MECHA: Jun 26, 2019, RocketPunch Games and Full ...",
    "Meta Description": "Looking for information on HARDCORE MECHA? Check out the release date (Jun 26, 2019), developer insights from RocketPunch Games, and a complete game sum...",
    "Alt Text Image": "Official header image for HARDCORE MECHA game - Steam 746580",
    "Canonical URL": "https://gusku.site/game/hardcore-mecha",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HARDCORE MECHA\", \"description\": \"Looking for information on HARDCORE MECHA? Check out the release date (Jun 26, 2019), developer insights from RocketPunch Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"RocketPunch Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RocketPunch Games,Lightning Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/746580/header.jpg?t=1635400913\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}