{
    "AppID": 611790,
    "Name": "House Party",
    "Release date": "Jul 15, 2022",
    "About the game": "This hysterical, story-rich 3D adventure game is all about player choice and partying the way you want. House Party's unique AI and scripting system allows the game to shape and mold its content around your choices. You'll see something new or different each time you play. To date, there are hundreds of different stories, side-quests, and narratives, and thousands of branching stories and dynamic elements. Content is being added regularly, so it just keeps getting bigger and better! Each new game starts at the door as a blank canvas for your decisions. One big house, packed with choices Sweet news! Your buddy Derek invited you to a rager at Madison's house. Surrounded by a group of eccentric partygoers, you must navigate your way through the night - no matter how wild it gets! Step into a sandbox adventure party game where even your simplest choices can impact the game in a magnificent way. Explore thousands of unique branching narratives with fifteen distinct NPCs that react based on your every remark and action, paving the way for tons of hours of unpredictable and hilarious entertainment. House Party’s gameplay starts with the conversations and grows with the decisions made along the way. With no true ending but dozens of stories to navigate, the night is what you make it. Discover Items &amp; Uncover Wild Interactions Explore a two-story house jam-packed with hundreds of items to discover, where every object has a purpose and some can be used in a variety of ways. Change the party's music with the mp3 player, invite a surprise guest over with the laptop, enjoy as many drinks as you can (without getting caught), and... well, we'll leave the most exciting surprises up to you to uncover. Show items to NPCs and they may react with varying dialogue or relationship fluctuations. Most of these hidden objects are vital for completing an NPC's personal storyline and winning their approval. Sometimes you don’t even need any items to cause a ruckus. Play your cards right and maybe you can win them over with your charm alone. NPCs (Not-Boring Party Comrades) You don't have to thank us, but we invited fifteen of our craziest and funniest acquaintances! A new-to-town sorority girl willing to do crazy things to fit in, the most brahsome brah around, a wild mud-wrestling southern belle, a freakishly buff straight-edge dude hawk-eyeing all the booze, and many more hilarious and unique personalities await. Listen closely and the characters will chat about your actions, conversations, and choices, and also provide hints and insights into cracking their stories open. Throughout the night, you may overhear information about their backstories or catch them gossiping about other guests at the party. Every NPC has favorite bands, personal beliefs, friends and enemies, and party goals for the night. Fully-voiced by amazingly talented voice actors and actresses, the partygoers feel vibrant and alive from the moment you set foot through the door. With fifteen of the most interesting, reactive, and hysterical NPC partygoers to ever exist and a rapidly growing roster, there is always plenty of social variety around the house. All of them have inner motivations and strong personal opinions, making them fun to make various choices around and amusing to see interact with one another! Make Friends, Enemies... or More? As you navigate the party, your words and actions will dictate whether each NPC digs your vibe or is seconds away from knocking your lights out. One bad decision might get you beaten to a pulp, while a good choice might result in making an ally that will have your back for the rest of the night. Every response you choose when speaking to an NPC changes how they feel about you. Keep an eye on your social gauges and watch your gameplay impact whether an NPC is crushing on you, feels so-so about you, sees you as a good friend, or hates your guts. Relationship values, good or bad, may open new doors. And, whether you're into guy love or girl love, it's possible to win most characters' hearts for steamy romantic fun at this party! NPCs will respond differently whether they like you, love you, or hate you, unlocking or blocking off potential party choices and unique interactions. They also see what you do and hear what you say, so be careful because one small choice can change everything. Interact With Celebrity Guests Ever heard of the Game Grumps? Make the right choices and you may find Dan and Arin landing unexpectedly in the middle of the house party! Explore their unique storyline, watch them hilariously navigate the festivities, and choose from one of the multiple paths to help them get back to their show! Looking for a hot Spanish tutor to hop in and shake things up? Your decisions could make Lety Does Stuff come knocking on the front door. Explore her wild and crazy side story if you want a real taste of adventure! As one of the only indie studios to ever integrate real-life celebrities into a video game, it has been a ton of fun connecting the guests to the story and welcoming the iconic humor and personalities of Dan, Arin, and Lety into the party. This fall, Doja Cat joins the cast in an expansive all-new optional DLC story! We're excited to welcome the AMA-winning and Grammy-nominated music star into the game and can't wait for Doja Cat's character to ramp up the party even more! Keep an eye out, because there may be more exciting guests on the way!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/611790/header.jpg?t=1657929794",
    "Price": 24.99,
    "Developers": "Eek! Games, LLC",
    "Publishers": "Eek! Games, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_a86720514822ee34d48177814f146d18c9dd4d67.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_6d31b28b30351f227f4faa2d20b5d40d3a127e7b.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_ed011be92afadb434ea17857b3353e48816c6972.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_c65f85b0ac0c71aa5491645542cbbf3156810d78.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_a4f76607ea15b004a0b3a1ef6b33ebec3b613f98.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_fe7ff3b2a5c6e98e7e8ba26339dfcea673a4ec86.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_7ddffb76370187e7fc9ceb20a0d9f50c79745671.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_3f60df6186efb09a2cf75ae3d954a2e457b639ab.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_b591d31bc23ca5c291ea4727f82879d36406abc5.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_394d204a3cf9c614376d2dbe9f8beb21943e713e.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_fd2a5f3ef49b620465998e015df6c351e3d9bd77.1920x1080.jpg?t=1657929794,https://cdn.akamai.steamstatic.com/steam/apps/611790/ss_c2e6c5fbe32ba4a0548793bdbf8980cef2b37b80.1920x1080.jpg?t=1657929794",
    "Slug": "house-party",
    "Meta Title": "House Party: Jul 15, 2022, Eek! Games, LLC and Full Overview",
    "Meta Description": "Looking for information on House Party? Check out the release date (Jul 15, 2022), developer insights from Eek! Games, LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for House Party game - Steam 611790",
    "Canonical URL": "https://gusku.site/game/house-party",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"House Party\", \"description\": \"Looking for information on House Party? Check out the release date (Jul 15, 2022), developer insights from Eek! Games, LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Eek! Games, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Eek! Games, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/611790/header.jpg?t=1657929794\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}