{
    "AppID": 1105970,
    "Name": "不死/IMMORTAL",
    "Release date": "Jul 30, 2019",
    "About the game": "Do you remember when you understood death? I have forgotten when to understand death. But, I remember, when I was a child, I thought I would always be a child, not grow up, adults will always be adults. I was shocked to know that people would grow up. My cousin didn't know about death until he was 8 years old, because I told him that he was terrified. Will you die? Yes, everyone will die, you don't know? I think it's very interesting. He doesn't even know that? And he asked, What about me? It will be. What about my mother? Yes. In this way, he knew a cruel truth. When I saw his face was not good, I comforted him that it would be a long time. Looking back on his understanding of death, it seems not so simple. Did he understand it in a flash? If so, what did he do in eight years? Now suddenly it's clear? Death should be a very abstract concept. Understanding is not simple. It takes a lot of time for human beings to understand it from the beginning of childhood. Human beings should know death in the series of explorations of games, toys, cartoons, animals and so on from childhood. In the process of growing up slowly, I learned the ability of substitution promotion, and finally asked: Will you die? Will I die? Will people die? After getting the answer, we put human beings into the concept of death and understand human death. It's like when I was a kid I didn't know that human beings would grow up, but I knew that some things would grow up. I understood the concept of growing up. How can we not die? In reality, there is indeed a shortcut to immortality at the cost of: Do you believe in reincarnation? So, does reincarnation exist? In the game, You use the 'Agree' or 'Disagree' selection button to judge the content of the statement, like the flowchart, step by step get the answer to prove it existence. You will find that it is not an unanswerable question. On the contrary, proof is very simple, just simple logical reasoning. P.S Look back at Socratic syllogism before you begin.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1105970/header.jpg?t=1564979450",
    "Price": 0.0,
    "Developers": "JW",
    "Publishers": "JW",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1105970/ss_0a5d1ecc748560a4ff084171d3b541cc242c1900.1920x1080.jpg?t=1564979450,https://cdn.akamai.steamstatic.com/steam/apps/1105970/ss_ffeb3b2ecab592de09335c156ae4ce037a2e01b8.1920x1080.jpg?t=1564979450,https://cdn.akamai.steamstatic.com/steam/apps/1105970/ss_d62e00b23ca8b155472b075e4c641e4495d74925.1920x1080.jpg?t=1564979450,https://cdn.akamai.steamstatic.com/steam/apps/1105970/ss_d2da8d78b5654509314a4f9720e860dafefc3b21.1920x1080.jpg?t=1564979450,https://cdn.akamai.steamstatic.com/steam/apps/1105970/ss_8a39d70743abd74c436261dc00610d89e5ded087.1920x1080.jpg?t=1564979450",
    "Slug": "immortal",
    "Meta Title": "不死/IMMORTAL: Jul 30, 2019, JW and Full Overview",
    "Meta Description": "Looking for information on 不死/IMMORTAL? Check out the release date (Jul 30, 2019), developer insights from JW, and a complete game summary.",
    "Alt Text Image": "Official header image for 不死/IMMORTAL game - Steam 1105970",
    "Canonical URL": "https://gusku.site/game/immortal",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4e0d\\u6b7b/IMMORTAL\", \"description\": \"Looking for information on \\u4e0d\\u6b7b/IMMORTAL? Check out the release date (Jul 30, 2019), developer insights from JW, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"JW\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"JW\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1105970/header.jpg?t=1564979450\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}