{
    "AppID": 947490,
    "Name": "Jam Studio VR - Education & Health Care Edition",
    "Release date": "Oct 23, 2018",
    "About the game": "The Jam Studio VR Education &amp; Healthcare Edition includes 100+ interactive songs and education content experiences with resources for educators, therapists and activities professionals to effectively use the App with their students, patients, clients or residents. An Education &amp; Skills Lesson Plans Guide is provided for educators to direct users while they interact with the provided education content for music education, early learning, math, life skill development and more. An Overview Therapy Guide is also included to introduce how the App may be used by therapists and activities professionals to use fun interactive music making experiences to accomplish a wide variety of physical, cognitive, sensory, communicative and social/emotional therapeutic goals. Music Instrument Discovery Series: Musical instrument tutorials and games that teach different types of instruments, including guitar, percussion, strings, wind, keyboard and instruments of the world. Quizzes are also included to test the comprehension of these lessons. Music Appreciation Series: Music appreciation interactive songs for a wide array of music genres including rock, jazz, classical, country and Hip Hop. Music Fundamentals Series: Music fundamental lessons on the principles of music, including Music Notes, Major Scales, Minor Scales, Chords, Melodies, a combo and a game quiz. Life Skills Series: A safety signs tutorial and game to teach and/or reinforce important life skills for children and/or adults with special needs. The Learning Station Series: Video content licensed from The Learning Station with fun interactive music instruments and sound effects for users to play with the video. Education and life skills topics include introducing the alphabet/ABC’s, understanding opposites, counting, Phonics, introducing days of the week, shapes, animal sounds, months of the year and other topics. Gigglebellies Learning Series: Video content licensed from Gigglebellies with fun interactive music instruments and sound effects for users to play with the video. Includes familiar kids songs to immerse users in the experience, songs such as Old MacDonald, Working on the Railroad, Wheels on the Bus and others that delight early learners. Times Table Series: 1 to 12 times tables learning lessons, games and quizzes. In aggregate there are over 100 problems progressing from easy to very difficult. Addition &amp; Subtraction Series: This includes 5 interactive addition &amp; subtraction lessons, games and quizzes within 20 and within 100. In aggregate there are 115problems progressing from easy to very difficult. Place Values, Multiples of Ten, &amp; Basic Shapes: These lessons and problems demonstrate the meaning and use of Place Values with numbers, Multiples of Ten and different Shapes. In aggregate there are dozens of problems progressing from easy to very difficult. Interactive Story Book Series: Beamz Original adaptations are inspired by classic stories and fables such as Goldilocks and the Three Bears, Hey Diddle Diddle, Hickory Dickory Dock, Little Bo Peep, Little Boy Blue, the Three Little Pigs, and Old King Cole. Interactive stories provide opportunities to participate with musical instruments and sound effects for greater immersion into the narrative.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/947490/header.jpg?t=1637198268",
    "Price": 99.0,
    "Developers": "Beamz Interactive, Inc.",
    "Publishers": "Beamz Interactive, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_7ae047f72a916f526edba6853596a7a4100adadc.1920x1080.jpg?t=1637198268,https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_3ccec6c3addda0c0e51749294f470b21ef064c5f.1920x1080.jpg?t=1637198268,https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_a95db5687d1b332867acce40e2600402e1002f5e.1920x1080.jpg?t=1637198268,https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_101cbe76b01289ddad8a64a54c6a8611e355f229.1920x1080.jpg?t=1637198268,https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_b3bf9cb2ce4ae5d63de2304bcd2b57ebdcd051df.1920x1080.jpg?t=1637198268,https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_1003798d129c348cd24eb1f8e13a25290bb7834f.1920x1080.jpg?t=1637198268,https://cdn.akamai.steamstatic.com/steam/apps/947490/ss_903147c6a25b08032d14d984cf6384e71e1097e1.1920x1080.jpg?t=1637198268",
    "Slug": "jam-studio-vr-education-health-care-edition",
    "Meta Title": "Jam Studio VR - Education & Health Care Edition: Oct 23, ...",
    "Meta Description": "Looking for information on Jam Studio VR - Education & Health Care Edition? Check out the release date (Oct 23, 2018), developer insights from Beamz Int...",
    "Alt Text Image": "Official header image for Jam Studio VR - Education & Health Care Edition game - Steam 947490",
    "Canonical URL": "https://gusku.site/game/jam-studio-vr-education-health-care-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jam Studio VR - Education & Health Care Edition\", \"description\": \"Looking for information on Jam Studio VR - Education & Health Care Edition? Check out the release date (Oct 23, 2018), developer insights from Beamz Int...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beamz Interactive, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beamz Interactive, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/947490/header.jpg?t=1637198268\", \"offers\": {\"@type\": \"Offer\", \"price\": 99.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}