{
    "AppID": 750840,
    "Name": "MAGIX Video Pro X9 Steam Edition",
    "Release date": "Nov 28, 2017",
    "About the game": "Edit videos with Video Pro X9 – Steam Edition for broadcast-ready results for all kinds of footage - from live recordings to videos shot with professional cameras.Edit footage in resolutions of up to 6K and get butter-smooth results thanks to scalable proxy editing. With high-end video effects, audio processing and authoring, Video Pro X9 – Steam Edition is a trailblazer in all things post-production and allows for true creative freedom when you're editing projects. Expand your spectrum of features with lookup tables, multicam editing, flexible track handling and 16-bit deep color grading. The most important features: The perfect opening: Create professional intros with over 250 new title templates No virtual reality headset? Create exciting 2D videos from 360 degree recordings you've imported. NEW!Achieve a chameleon effect: Apply the appearance of other footage to your recordings using lookup tables. NEW!Up to 5X faster: Optimized performance with up to five times faster processing and Intel GPU hardware acceleration. Broadcast color feature: For images more brilliant than ever before Look to the future: Easily edit 6K videos with special film, project and export presets Wide-ranging support for professional formats such as ProRes, AVC intra and many more. Add a burst of color: Primary and secondary 3-way color correction, 16-bit deep color processing Sounds right: Surround sound editing in broadcast quality Access higher quality results: Hardware-based decoding for HD UHD H.264 and H.265* *HEVC encoding requires fee-based activation. Professional image and sound Video production: Edit your gameplays in smooth 6K resolution with scalable proxy editing. Thanks to support for all current video formats, you can import drone videos, gameplays and action cam recordings without a glitch.Combine several recordings as a nested sequence and use them as a single object in your other videos – this way you can instantly create edits of your best gaming results. You can then upload these from directly within the program to YouTube and Vimeo. Audio editing: Video Pro X9 – Steam Edition also has powerful audio editing tools. A realtime audio mixer, keyframe control and sample-precise editing as well as a ton of broadcast-quality effects give you everything you need for optimizing audio tracks. Other highlights: NEW!Flexible track handling Add to your video projects at any time - even after the fact. Add new tracks directly at the position you want without having to move other tracks. Makes adding new ideas easy. Easy beat-based editing Set snap markers to the beat of the music and synchronize your recordings with the audio material. Multicam editing Just like on TV: During playback, switch perspective live on up to 9 tracks and record all cuts exactly as they happen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/750840/header.jpg?t=1541613714",
    "Price": 0.0,
    "Developers": "MAGIX Software GmbH",
    "Publishers": "MAGIX Software GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/750840/ss_205e178bd7fa1856f8936777b4eb773af044bbb4.1920x1080.jpg?t=1541613714,https://cdn.akamai.steamstatic.com/steam/apps/750840/ss_ef3c209c1dd102af27b83ea44a88001f1e63a20e.1920x1080.jpg?t=1541613714,https://cdn.akamai.steamstatic.com/steam/apps/750840/ss_5fcc462945d6b3ef8ad5564504fafd53bd0df6fb.1920x1080.jpg?t=1541613714,https://cdn.akamai.steamstatic.com/steam/apps/750840/ss_479f59825e5080696fe967d0692fd6592cf10bdc.1920x1080.jpg?t=1541613714,https://cdn.akamai.steamstatic.com/steam/apps/750840/ss_e23ed1b01691fdb1293386aea00a85348b40c68d.1920x1080.jpg?t=1541613714",
    "Slug": "magix-video-pro-x9-steam-edition",
    "Meta Title": "MAGIX Video Pro X9 Steam Edition: Nov 28, 2017, MAGIX Sof...",
    "Meta Description": "Looking for information on MAGIX Video Pro X9 Steam Edition? Check out the release date (Nov 28, 2017), developer insights from MAGIX Software GmbH, and...",
    "Alt Text Image": "Official header image for MAGIX Video Pro X9 Steam Edition game - Steam 750840",
    "Canonical URL": "https://gusku.site/game/magix-video-pro-x9-steam-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MAGIX Video Pro X9 Steam Edition\", \"description\": \"Looking for information on MAGIX Video Pro X9 Steam Edition? Check out the release date (Nov 28, 2017), developer insights from MAGIX Software GmbH, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MAGIX Software GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/750840/header.jpg?t=1541613714\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}