{
    "AppID": 1477440,
    "Name": "Mahjong Solitaire 100",
    "Release date": "Dec 16, 2020",
    "About the game": "This is a puzzle game, in which you take tiles from a pile of mahjong tiles according to the rules. Enjoy level 1 to 100 puzzles with a unique definition of difficulty. The game gets more and more difficult as the number of tiles increases with each level! Unlike other games, there is no 'shuffle' in this game. The reason for this is that the game is arranged in such a way that it can be solved by thinking, not by luck. We hope that you will use your failures as a food for thought and arrive at the right answers. ■The rules are very simple When you select 2 identical tiles (*1) from a pile of mahjong tiles, you can obtain them. The objective of the game is to take all the tiles, and leaving some of them behind is a failure. There are 2 rules for the tiles you can choose. 1. You cannot choose a tile that is sandwiched between other tiles on the left and right. 2. You cannot choose a tile with overlapping tiles on top of it. According to these rules, the same tiles should be erased from each other. Do not erase tiles at random, but choose them carefully. Initially, the tiles that cannot be removed by default are marked with different colors. Once you have a good understanding of the rules, it is recommended to turn off this feature. (*1) Seasonal and flower tiles are exceptions; the patterns do not have to be the same for the pair of both seasonal tiles or the pair of both flower tiles. ■Help Function 1. Clues (up to 3 times per level) If you can't find a tile to choose from, use this feature. However, the clues only show the combinations of tiles that can be taken at that point in time, not necessarily the correct answer. 2. Undo (up to 3 times per level) When you make a mistake in erasing a tile, you can undo the operation. 3. Selection assistance It changes the color of the unselectable tiles. 4. Time display You can choose to display or not to display the time. ■Do you care about the time? The time it takes to solve this puzzle does not affect the progress of the game. However, we use time as a guide to help you solve the puzzles. If you solve the same puzzle again, and your time is faster than before, you will be notified of your best time. Of course, if you don't want to pay attention to the time, you can hide it from the settings. You can change it according to your own playing style.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1477440/header.jpg?t=1608174076",
    "Price": 2.99,
    "Developers": "ShovelGames Inc.",
    "Publishers": "ShovelGames Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1477440/ss_6a11bc2a7b3d5da6717a5d2c11df177721afc683.1920x1080.jpg?t=1608174076,https://cdn.akamai.steamstatic.com/steam/apps/1477440/ss_3682abb16d148b287f0f218fc6ce07902071ae1d.1920x1080.jpg?t=1608174076,https://cdn.akamai.steamstatic.com/steam/apps/1477440/ss_72bc0ef1fbc3532d13e215d93c0b1f6e480bc90c.1920x1080.jpg?t=1608174076,https://cdn.akamai.steamstatic.com/steam/apps/1477440/ss_d2356bc01172a580cfd0d6ca5ec718c486530257.1920x1080.jpg?t=1608174076,https://cdn.akamai.steamstatic.com/steam/apps/1477440/ss_15aff788d76eb1af29aba50073ff3f919d49e1df.1920x1080.jpg?t=1608174076",
    "Slug": "mahjong-solitaire-100",
    "Meta Title": "Mahjong Solitaire 100: Dec 16, 2020, ShovelGames Inc. and...",
    "Meta Description": "Looking for information on Mahjong Solitaire 100? Check out the release date (Dec 16, 2020), developer insights from ShovelGames Inc., and a complete ga...",
    "Alt Text Image": "Official header image for Mahjong Solitaire 100 game - Steam 1477440",
    "Canonical URL": "https://gusku.site/game/mahjong-solitaire-100",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mahjong Solitaire 100\", \"description\": \"Looking for information on Mahjong Solitaire 100? Check out the release date (Dec 16, 2020), developer insights from ShovelGames Inc., and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"ShovelGames Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ShovelGames Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1477440/header.jpg?t=1608174076\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}