{
    "AppID": 433930,
    "Name": "MARI indie 3.0",
    "Release date": "Feb 2, 2016",
    "About the game": "MARI indie 3.0 is the fastest, most artist-friendly way to texture, paint, and detail amazing 3D assets for your game projects. Fine-tuned for individual developers and freelance artists in the game industry, MARI indie is an invaluable toolset that lets you focus on the artistic aspect of 3D game asset painting without getting bogged down by the technical side -- free of any individual commercial restrictions and without breaking your budget! Delivering massive power and flexibility at minimal cost, MARI indie 3.0 gives you ultimate control over painting and detailing every facet of your 3D models and animations in a way that's quick, intuitive, and highly creative -- all in one complete package that lets you work just the way you want. Supported by the world’s most advanced layering system, MARI indie 3.0 is a real workhorse. It gives game artists and content creators all the functionality they need to exactly replicate the look of assets in their games engine. Features and Benefits MARI indie 3.0 Includes Features For: Intuitive painting and texturing directly onto 3D models Importing custom Photoshop brushes or creating your own Advanced layer-based workflow gives greater speed and control Realistic interactive previews on-the-fly Powerful geometry handling gives you greater precision and control Alembic support for animated geometry caches and imported cameras Physically based shading and environmental lighting The Unreal Shader is now included in MARI indie as well as the Unreal Environment Map! Key Features and Workflows Explained 3D Painting and Texturing Embrace a more creative, fluid approach to 3D game asset painting with MARI indie 3.0, which features the same workflow and intuitive painting and texturing toolset found in the full version. Create stunning details, textures, and visual effects by painting in 3D directly onto your game assets in a way that flows naturally. Reused / Customized Brushes Are you a long-time Photoshop user who’s already built a stable of unique brush tools you can’t live without? You can import your favorite brushes right into MARI indie or create your own customized brush tools with our brush engine. Also, MARI’s special “healing” and “slurp” brush tools add painless seam removal and smear/texture dragging to the mix. Advanced Layering Greater speed and efficiency are within your grasp. MARI indie 3.0's layer-based workflow lets you paint faster with greater control. Real-time adjustments, GPU-accelerated procedural layers, and advanced masking make it easier to focus on nailing the look you want. The powerful blend of both procedural updates and painted detail in the same toolkit will make your work so much easier. Physically-based shading Boost your realism to the max! MARI indie 3.0’s physically-based shading system simulates real-world materials, allowing them to react more naturally under different lighting situations. It’s a real game-changer. Paint and texture as you always have been, and MARI indie will calculate shading and lighting in scene linear, simulating the real-time workflow of your game engine. Environmental lighting When paired with physically based shaders, MARI indie 3.0 s environmental lighting engine will save you time generating a closer near-final look before you button everything up for export to your game engine. With proper lighting situations that match your engine environment, you’ll be able to texture and paint more accurately to achieve the desired end result faster. Interactive Preview Need to create normal maps from bump maps on-the-fly? No sweat! MARI indie 3.0’s interactive preview is a major time-saver that simplifies the process of generating and manipulating textures. Dynamic lighting and shadow support also let you cast real-time shadows on your 3D game assets from multiple directions. Geometry Handling Exercising quick, fine-tuned control over multifaceted surfaces across animated assets is a no-hassle affair with MARI indie 3.0’s advanced geometry handling, which tackles animated geometry and textures with ease. You can also easily isolate, select, mask, and hide geometry per patch and face, giving you tremendous flexibility and control over the look of your creations. Differences between MARI indie 3.0 and full MARI Project file (.mra) linked to Steam account / cannot be shared with other users The UDIM texture patch count is limited to 6 patches per object The object count is limited to 5 objects Export texture resolution size limited to 4k and 16-bit color per channel Allowed export formats: .exr, .psd, .png, .tga, .jpg Output formats no longer available: .tif, .tiff, .hdr, .dds, and .ptx Python scripting disabled Session scripts disabled Custom shaders not allowed Advanced colourspace configurations and the loading of custom OCIO config files have been disabled. Basic 'Nuke-Default' configuration is available, however. The advanced Node Graph has been disabled, but nodes can still be utilized in Mari indie via Graph Layers. 2D colour correct filter has been disabled Custom C-API plugins not supported NukeMari bridge has been disabled MODO indie 901 + MARI indie 3.0 Bundle! Why not double your creative might by pairing MODO indie 901 and MARI indie 3.0 together in your solo 3D game asset pipeline? Read more about MODO indie 901's incredible 3D modeling, sculpting, and animation capabilities here ! Monthly subscription or perpetual license bundles available! Have More Questions? Check out our in-depth MARI indie 3.0 FAQ right here !",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/433930/header.jpg?t=1546538178",
    "Price": 0.0,
    "Developers": "The Foundry",
    "Publishers": "The Foundry",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/433930/ss_10c8f8bef3ef4da38815bebb215c80f9083f00c8.1920x1080.jpg?t=1546538178,https://cdn.akamai.steamstatic.com/steam/apps/433930/ss_820769b92940ab761e7916972f326c985125d05e.1920x1080.jpg?t=1546538178,https://cdn.akamai.steamstatic.com/steam/apps/433930/ss_d85c415d92fff5a482d2e019322efa84ec26c654.1920x1080.jpg?t=1546538178,https://cdn.akamai.steamstatic.com/steam/apps/433930/ss_6e1a9dcd594b8eb7b97498c50e81051cf4d1b1e4.1920x1080.jpg?t=1546538178,https://cdn.akamai.steamstatic.com/steam/apps/433930/ss_c25c42a62f5a24f6c048eb1c55c648d98400ab3b.1920x1080.jpg?t=1546538178",
    "Slug": "mari-indie-3-0",
    "Meta Title": "MARI indie 3.0: Feb 2, 2016, The Foundry and Full Overview",
    "Meta Description": "Looking for information on MARI indie 3.0? Check out the release date (Feb 2, 2016), developer insights from The Foundry, and a complete game summary.",
    "Alt Text Image": "Official header image for MARI indie 3.0 game - Steam 433930",
    "Canonical URL": "https://gusku.site/game/mari-indie-3-0",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MARI indie 3.0\", \"description\": \"Looking for information on MARI indie 3.0? Check out the release date (Feb 2, 2016), developer insights from The Foundry, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Foundry\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Foundry\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/433930/header.jpg?t=1546538178\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}