{
    "AppID": 1785000,
    "Name": "Mokoko X",
    "Release date": "Apr 6, 2022",
    "About the game": "About Mokoko X was inspired from the arcade games like Volfied, Qix and Gals Panic. A popular gaming style in the late 1980’s, Mokoko X looks to resurrect the soul of the arcade genre while adding a modern touch. There are 32 levels in Mokoko X; each level has its own unique boss and minions. The main goal is assisting the girls that need help from the weird bosses. This is sometimes passing a mobile game level, sometimes helping out with the insects in the kitchen. Gameplay The main goal is conquering the bigger portion of the screen. While you are in your own area, you are safe from the enemies until your shield depletes. You conquer new areas by drawing out of your area. Drawing, however, deactivates your shield and exposes you to danger. Your shield decreases constantly. If you do not conquer at a certain frequency, your shield will burn out and you will not be safe on your own areas as well. There are 3 difficulties in the game. The difficulty affects enemies, your shield, and the required conquered area percentage for the victory. Key Features 8 unlucky girls in need of help 32 levels with unique bosses and minions Absurd stories that will reveal details about the bosses and the girls Fully animated, Japanese and English voice overs for all the characters! Lovely graphics! Traps, towers, crates and bonus effects Arcade Mode Live high scores displayed for hardcore players Nostalgia remastered! Stories Have you ever asked these questions to yourself: How do you stop a heartless but not soulless emperor? Can someone be a gyroscope and a guard dog at the same time? Why do those ducks attack us? Are there really demonic headphones in the world? Why do lizardmen need a plastic toy for summoning their god? How do you become a villain after revolting against the ant queen? What do scientists want from Albert the wonderful sea creature? Well, Mokoko X answers all these questions and more! Here are some missions! Help out Iren with her arachnophobia and fight with the imaginary spider Mr. Fyodorov. Protect Issa's house from getting pillaged by the ghost pirates stuck inside the anchors. They were not the bane of Seven Seas - the crew was killed in their first naval battle. Toru wished to be a mosquito to annoy people. A local witch heard him, and transformed him into a mosquito. Now he causes trouble to people every night. Fight against the weird enemies... ... and learn about their absurd stories!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1785000/header.jpg?t=1649293109",
    "Price": 7.49,
    "Developers": "NAISU",
    "Publishers": "NAISU",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_c4d045b8bbe19b93b82a75f65c406df2683fc455.1920x1080.jpg?t=1649293109,https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_7b360a4e93f090ea2801a2ac2c74fc4055452701.1920x1080.jpg?t=1649293109,https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_60816fd74fd9c1601152e618503bc31eceb9833f.1920x1080.jpg?t=1649293109,https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_d6f2c1ac74cb2dfcc7618efaa5e517863dbca2b4.1920x1080.jpg?t=1649293109,https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_5c91dd433710612a61c44a5ad1993bad8783619e.1920x1080.jpg?t=1649293109,https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_c2018b5f723caf1fc83512b636c0110c7307e0b3.1920x1080.jpg?t=1649293109,https://cdn.akamai.steamstatic.com/steam/apps/1785000/ss_c85676051209f936434e24bb0f88212a6e1c1382.1920x1080.jpg?t=1649293109",
    "Slug": "mokoko-x",
    "Meta Title": "Mokoko X: Apr 6, 2022, NAISU and Full Overview",
    "Meta Description": "Looking for information on Mokoko X? Check out the release date (Apr 6, 2022), developer insights from NAISU, and a complete game summary.",
    "Alt Text Image": "Official header image for Mokoko X game - Steam 1785000",
    "Canonical URL": "https://gusku.site/game/mokoko-x",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mokoko X\", \"description\": \"Looking for information on Mokoko X? Check out the release date (Apr 6, 2022), developer insights from NAISU, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"NAISU\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NAISU\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1785000/header.jpg?t=1649293109\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}