{
    "AppID": 802880,
    "Name": "Muv-Luv (マブラヴ)",
    "Release date": "Feb 28, 2018",
    "About the game": "The Muv-Luv series is an epic saga told in three parts: Muv-Luv Extra, Muv-Luv Unlimited, and Muv-Luv Alternative . What begins as a tongue-in-cheek romantic comedy ultimately transforms into an action-packed thrill ride in a war-torn alternate reality, and it’s this drastic-yet-methodical genre twist that makes the final chapter the most highly-revered visual novel of all time. This is a story that will plant seeds in your brain early in the first act that you won’t even notice until they sprout in the third for maximum narrative payoff and crushing emotional impact. Don’t fall for Extra’s cutesy exterior. This series ventures into some of the darkest thematic territory you’ll ever see, and when the final curtain closes, you’ll likely need a forklift to pick your jaw up off the floor. Make no mistake: this is a story that will challenge you in ways few works of fiction dare attempt, and an emotional tour de force unlike any other. This game contains the first two arcs: Extra, and Unlimited . The final arc, Muv-Luv Alternative is the story’s massive climax, and is nearly the size of the first two combined. Muv-Luv Extra Takeru is your average unassuming high school senior whose entire world gets turned upside down one morning when he awakens to find himself in bed with the heiress to one of the world’s largest international conglomerates. She calls herself Meiya, and - despite never having met him before - she insists that the two of them are destined for one another. This comes much to the chagrin of his childhood friend Sumika, the girl next door who’s always had feelings for him, who realizes that if she doesn’t act fast, she might just lose him forever. All of which begs the question: just who is Meiya? And do his feelings for Sumika run deeper than he thought? In the end, he’ll need to decide between the girl who’s been with him through thick and thin, or the stranger who claims they’re bound together by fate. But that’s only one side of the story. Muv-Luv Unlimited Just as the page turns on Takeru’s happily ever after, he awakens one morning in a world not his own. An alternate timeline, humanity on the brink of extinction. A world infested by alien invaders locked in a war that’s been raging on for decades. And yet, all the set pieces are the same - his house is still here, albeit dilapidated and barely standing. His school is still here, though it’s now a military academy. And even though they don’t recognize him, all his friends are here too… with one exception. Was this all just a dream? Or was the world he thought he knew really a dream all along? Muv-Luv Alternative To avoid spoilers, we only recommend visiting Muv-Luv Alternative Steam page after finishing Muv-Luv Unlimited. Features: A Dating Sim - Date any of the heroines, get to know their personalities and backstories, and fall in love with each other! Available in three languages - Japanese, English and Simplified Chinese. The User Interface has been reworked, so it's compatible with the newest tablet PCs and touchscreens. User save data are stored in Steam cloud so readers can continue their progress anywhere with ease. Muv-Luv Reviews (Original AppID) ;browsefilter=toprated&amp;filterLanguage=all",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/802880/header.jpg?t=1655953040",
    "Price": 29.99,
    "Developers": "aNCHOR Inc.",
    "Publishers": "aNCHOR Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_e18a684e55004ccb80caddad8089731d5c67866c.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_47cdb4933861931f34a4a48fdf69593401801f5f.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_45cb5117619f8cd5f13c47e373fd7ec9010b64c6.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_78375973d5b8f7ba85ecd9ba6de27824ce5f130f.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_f3518a3b9470e12427229218cfe619d4ca7a2eb8.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_6d7052f259bdeb6a0595c50f3707c252a4034ac2.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_a97a5a79309d91f611422004b5086ec620d79397.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_485c3e2c43ee968afee862408f9bbe9bbc5808a6.1920x1080.jpg?t=1655953040,https://cdn.akamai.steamstatic.com/steam/apps/802880/ss_a65457a56caf9200c7775d055c2c43925316312a.1920x1080.jpg?t=1655953040",
    "Slug": "muv-luv",
    "Meta Title": "Muv-Luv (マブラヴ): Feb 28, 2018, aNCHOR Inc. and Full Overview",
    "Meta Description": "Looking for information on Muv-Luv (マブラヴ)? Check out the release date (Feb 28, 2018), developer insights from aNCHOR Inc., and a complete game summary.",
    "Alt Text Image": "Official header image for Muv-Luv (マブラヴ) game - Steam 802880",
    "Canonical URL": "https://gusku.site/game/muv-luv",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Muv-Luv (\\u30de\\u30d6\\u30e9\\u30f4)\", \"description\": \"Looking for information on Muv-Luv (\\u30de\\u30d6\\u30e9\\u30f4)? Check out the release date (Feb 28, 2018), developer insights from aNCHOR Inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"aNCHOR Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"aNCHOR Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/802880/header.jpg?t=1655953040\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}