{
    "AppID": 1394940,
    "Name": "Nak Sim: Fallen Warriors",
    "Release date": "Feb 11, 2021",
    "About the game": "‘Nak Sim’, a place where people who have died in sorrow. ‘Sims’, the inhabitants of the depression, lived in peace, leaving behind their terrifying memories. But one day, a huge sword fell from the sky, and those who touched it were sucked into an unknown world. Some of them were able to come back alive, but they were no longer the same. They have a common strong power. And that sim became a focusless or evil man who lost his will to live and attacked others. Since then, the world inside the huge sword has been called the 'Cursed Sword World,' and only those who have a strong desire for adventure and power have entered it. And now you have fallen here. Would you overcome all the trials and turn your heart into a peaceful place again? Or would it be a power-cursed evil? ‘Nak Sim: Fallen Warriors’ is a third-person roguelike action game. Weapon - All weapons have durability, but they can be strengthened to increase attack and durability. If you need other weapons, you can take them away. Capability value - Don't worry if a strong weapon is broken. You would have absorbed some of their power and become stronger every time you killed an enemy. Stage - 'The World of Sword' has a consistent form, but enemies appear in it every time in different numbers, different batches, and different equipment. If you defeat them all, you can gain the power to use new capabilities. Ability - All competencies are initialized at the end of each adventure and can be reacquired during the adventure. a protective - Armor received from a blacksmith with special abilities absorbs some of the enemy's strength, changes and strengthens. - Talk to the children of an adventurous cape shop owner in the world of Sword to get a variety of capes. The owner of the cape shop offers a better material cape in return. Cover the enemy's view with a cape and deliver a fatal blow. To maintain your combat stance by acquiring and strengthening a variety of weapons. To clear the game, you need to understand the enemy's attack patterns and learn a more efficient style of fighting. Don't worry if you fall down. Your colleague Youth Space will help you escape from the crisis.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1394940/header.jpg?t=1614067146",
    "Price": 11.99,
    "Developers": "Highlendid",
    "Publishers": "Highlendid",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1394940/ss_aafddbc18f57889d457b1b8f91b42f20934aab62.1920x1080.jpg?t=1614067146,https://cdn.akamai.steamstatic.com/steam/apps/1394940/ss_254d96839745db8ef610564589c4af7cdf01da0f.1920x1080.jpg?t=1614067146,https://cdn.akamai.steamstatic.com/steam/apps/1394940/ss_cfa3af9349a037fc21d2cfe2d2e5c6dfdd5ac5f9.1920x1080.jpg?t=1614067146,https://cdn.akamai.steamstatic.com/steam/apps/1394940/ss_25c174f45cbac59346a143b04b0b477f39347ea1.1920x1080.jpg?t=1614067146,https://cdn.akamai.steamstatic.com/steam/apps/1394940/ss_4a6ef2d376fd4bae0af2cc2367c6a7a23dd4ba8e.1920x1080.jpg?t=1614067146,https://cdn.akamai.steamstatic.com/steam/apps/1394940/ss_f907bf63447cff766e48b96bb038a73241fe9942.1920x1080.jpg?t=1614067146",
    "Slug": "nak-sim-fallen-warriors",
    "Meta Title": "Nak Sim: Fallen Warriors: Feb 11, 2021, Highlendid and Fu...",
    "Meta Description": "Looking for information on Nak Sim: Fallen Warriors? Check out the release date (Feb 11, 2021), developer insights from Highlendid, and a complete game ...",
    "Alt Text Image": "Official header image for Nak Sim: Fallen Warriors game - Steam 1394940",
    "Canonical URL": "https://gusku.site/game/nak-sim-fallen-warriors",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Nak Sim: Fallen Warriors\", \"description\": \"Looking for information on Nak Sim: Fallen Warriors? Check out the release date (Feb 11, 2021), developer insights from Highlendid, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 11, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Highlendid\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Highlendid\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1394940/header.jpg?t=1614067146\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}