{
    "AppID": 342640,
    "Name": "Pixel Privateers",
    "Release date": "Feb 21, 2017",
    "About the game": "Pixel Privateers is a Squad Based Tactical RPG “Loot ‘Em Up” that will send your team of mercenaries through a mysterious wormhole on a quest to gather technology for your employer. In a twist of fate, your journey becomes a one-way ticket – with an entire galaxy of worlds to explore, factions to encounter, and epic gear to collect. Will you make it back home, make your mark in this new universe, or become another victim of the many dangers of the cosmos? Ultimately, how your story plays out is up to you! Focusing on a user-customizable experience and robust multiplayer within the framework of a deep and engaging space exploration RPG, Pixel Privateers seeks to provide a truly accessible experience that will appeal to gamers of all types and skill levels. GAMEPLAY DETAILS Huge Universe to Explore Navigate your ship through the universe and land on any planet you choose! Take care, however, for many perils await – from warring factions to bloodthirsty aliens and more! True Tactical, Squad-Based Combat Control your squad individually in tactical mode - where you issue orders and have them carried out - or control your squad as one - directing them all at once! Accessible Gameplay An array of difficulty settings will allow you to enjoy the game in a more casual manner – or challenge yourself in Hardcore Mode where death is quite permanent! Storyline and Factions Learn the history of various factions and their place in the universe, and become part of the intrigue yourself. Where do your loyalties lie? What part will you play? See how the story unfolds! Deep Skill and Tech Trees Advance your knowledge and conquer: Gain awesome new skills, abilities, and technologies as you research alien artifacts. Train and advance individual crew members by enhancing their stats and collecting better gear! Interactive Ship Tired of all that adventuring? Spend some time building up and exploring your Ship! Maybe even hang out in your own on board bar - complete with a band to entertain you! Epic Loot! Plenty of awesome gear to make you a powerhouse is out there for the taking! Break down items you don’t need into Matter that can be spent in a variety of ways to enhance your crew. Post Launch Content We plan to bring free content expansions to Pixel Privateers post-launch. Encompassing not only our ideas, but also suggestions from the Community, we are looking forward to actively supporting Privateers for a long while to come.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/342640/header.jpg?t=1498149668",
    "Price": 14.99,
    "Developers": "Quadro Delta",
    "Publishers": "Re-Logic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/342640/ss_7eda0e2b9f1ab7b9dd12abbc07b439854d787ce1.1920x1080.jpg?t=1498149668,https://cdn.akamai.steamstatic.com/steam/apps/342640/ss_0c3c67a0da8abc0910d32af4f7edb248f318369a.1920x1080.jpg?t=1498149668,https://cdn.akamai.steamstatic.com/steam/apps/342640/ss_e20bd4c0f20fa5ea817af0af23623bb34b62e60c.1920x1080.jpg?t=1498149668,https://cdn.akamai.steamstatic.com/steam/apps/342640/ss_ee0abc680526d916f723a5789c3f4b095328a671.1920x1080.jpg?t=1498149668,https://cdn.akamai.steamstatic.com/steam/apps/342640/ss_5e6e4a6cadf1424fdf520734481f7634b0dda5f4.1920x1080.jpg?t=1498149668",
    "Slug": "pixel-privateers",
    "Meta Title": "Pixel Privateers: Feb 21, 2017, Quadro Delta and Full Ove...",
    "Meta Description": "Looking for information on Pixel Privateers? Check out the release date (Feb 21, 2017), developer insights from Quadro Delta, and a complete game summary.",
    "Alt Text Image": "Official header image for Pixel Privateers game - Steam 342640",
    "Canonical URL": "https://gusku.site/game/pixel-privateers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pixel Privateers\", \"description\": \"Looking for information on Pixel Privateers? Check out the release date (Feb 21, 2017), developer insights from Quadro Delta, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Quadro Delta\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Re-Logic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/342640/header.jpg?t=1498149668\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}