{
    "AppID": 698700,
    "Name": "Rise of the Third Power",
    "Release date": "Feb 10, 2022",
    "About the game": "Rise of the Third Power is a love letter to the glory days of the console style RPG, with modern conveniences such as auto-save and a combination of the best elements of Japanese and Western style gameplay and writing. Experience this fusion of East and West, old and new, in a game meant to surpass Stegosoft Games' previous work in every way! STORY DRIVEN - Join a party of eight, each with their own unique ambitions, perspectives and personalities as they embark upon a suicide mission to topple the Arkadyan emperor, Dimitri Noraskov. A blend of humor, drama and tragedy await players as they navigate the treacherous world of Rin. POLITICAL INTRIGUE - As the world of Rin recovers from the Great War, the balance of power remains badly skewed, with vacuums of power still waiting to be filled. The player's party will be both beset and aided by schemers, liars and betrayers, all while the clock ticks down to a reprise of the greatest war in human history. CUSTOM BATTLE SYSTEM - Rise of the Third Power offers eight playable characters in a battle system built from scratch, each with their own strengths and weaknesses, all of whom are meant to participate in battle simultaneously without the need for tedious party management. Combine each character's unique powers and disadvantages, analyze the abilities of your foes, set your formation and charge into battle. PERSISTENT EQUIPMENT - Each piece of equipment found, purchased or stolen is a permanent, unique upgrade for each character. Instead of purchasing replacements, the player purchases upgrades. No more buying that awesome helmet back in town only to stumble over a better one as treasure in a dungeon. Each character has 3 equipment slots with 8 upgrades each, with 192 to find in total. This system avoids the tedium of inventory management, while also giving the completionist something useful to hunt for. 1587, 2A - 15 years have passed since the guns of the Great War at last fell silent. The conflict rocked the world, leaving half a generation of men and women lying dead on the battlefield. Of the many players that had acted on the world stage, only two remained: the kingdom of Cirinthia and the ancient Republic of Tariq. In time, Dimitri Noraskov, a hero to the defeated Kingdom of Arkadya, rose from the ashes. He saw his king as a coward for surrendering, and a traitor for submitting to the Treaty of Evenheart. So did the people. They supported Noraskov when he overthrew the king. They supported him as he reclaimed the lands that had been stripped of them. And they supported him as he raised an army. Noraskov had theorized that the nations of the world were still too worn by the Great War to enforce the terms of the Treaty. Thus far, his gambit has proven successful. The Arkadyan Empire shows no signs of curbing its aggression. It is feared by many that a reprise of the Great War, that at one time could have been prevented, is now all but inevitable. But there are those that believe it can yet be stopped...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/698700/header.jpg?t=1652169736",
    "Price": 19.99,
    "Developers": "Stegosoft Games",
    "Publishers": "DANGEN Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_44fb285c665b2e6bf9b2cefe2dd8ac25bf3cea77.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_500562fb9aee0e199e29c48864facf3cf69d9cc9.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_682039c16070bb26b913a4b5d9716f9bbb39e2c2.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_33ad90f0da2b744ed842638b30f0d64587d9fe20.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_15208b3bfbff7fa9d4b1fcc58b923fa28372ee1e.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_8d7f361b7ff195172298c87e6d3259e86fe71994.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_6bc55ecebe4298046a4531f8aecc33b7fe48b629.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_4edaef25c9b083c7433a5a87098bae69ab3ba043.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_33825406944c9a8a955ef9e6ae032cfd22ff9ae7.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_64fe0bf5549e00043c12a7da64439b307e24ccc1.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_7d7580029e54b632d7f239a32580c4e54de573fe.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_98c8813d43cd0382ef9a5b76b111d2e9a16b6aa0.1920x1080.jpg?t=1652169736,https://cdn.akamai.steamstatic.com/steam/apps/698700/ss_e7571a05965e16e19e43d4b9bbe40a4c5e61a707.1920x1080.jpg?t=1652169736",
    "Slug": "rise-of-the-third-power",
    "Meta Title": "Rise of the Third Power: Feb 10, 2022, Stegosoft Games an...",
    "Meta Description": "Looking for information on Rise of the Third Power? Check out the release date (Feb 10, 2022), developer insights from Stegosoft Games, and a complete g...",
    "Alt Text Image": "Official header image for Rise of the Third Power game - Steam 698700",
    "Canonical URL": "https://gusku.site/game/rise-of-the-third-power",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rise of the Third Power\", \"description\": \"Looking for information on Rise of the Third Power? Check out the release date (Feb 10, 2022), developer insights from Stegosoft Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stegosoft Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DANGEN Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/698700/header.jpg?t=1652169736\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}