{
    "AppID": 204880,
    "Name": "Sins of a Solar Empire®: Rebellion",
    "Release date": "Jun 12, 2012",
    "About the game": "The Next Installment to the Award-Winning RTS. While many were hopeful that diplomacy would finally end the war, differing opinions on what should be done, along with the depleted power of the controlling factions, has led to a splintering of the groups involved. The loyalist members of the Trader Emergency Coalition adopt a policy of isolation, focusing on enhanced defenses to ride out the rest of the war. Those who rebel against the coalition take on a purely militant view, coming to the opinion that the only way to bring peace is by ultimately crushing all who oppose them - especially xenos. For the first time in their history, the war creates a schism in the Advent Unity. The loyalists seek to continue their policy of revenge against the Traders, and to assimilate all others to the Unity’s influence. However, others amongst the Advent suspect that a corrupting influence from within has diverted the Unity from its proper destiny. The divide created in the Vasari Empire is less pronounced, but just as severe to their people. With the Vasari now practically frantic to move on to new space, the loyalist faction abandons cooperation and decides to take the resources they need by any means necessary. Having accepted the need to work together, the rebel faction feels that their best chance for survival is to work with the other races and bring them along to flee the approaching enemy. Take the battle for galactic supremacy to its ultimate level in Sins of a Solar Empire: Rebellion – a standalone RT4X game that combines the tactics of real-time strategy with the depth of the 4X genre (eXplore, eXpand, eXploit, eXterminate). Key features: New Factions : Decide whether to play as a Loyalist or Rebel – each unlocks new technologies, ships and play styles for each race. New Titan Class Warships : Mighty titans enter the fray of the war to tip the scales of power. Each faction may field their own unique titan, drawing upon unique strengths and abilities on the battlefield. New and Updated Capital Ships : A new capital ship joins the fleet for each race to offer even more tactical options. Additionally, all existing capital ships have been upgraded to four levels for their abilities, allowing players to focus their ships along specific strengths. New Corvette Class Ships : Small and maneuverable, each faction has developed a new light attack craft to harass enemy forces. Updated Visuals : Updated graphics, particle effects, lighting and shadows, race specific UI and other enhancements make the Sins’ universe look better than ever. New Victory Conditions : Take multiple paths to victory including – Military, Diplomatic, Research, Last Flagship Standing, Last Capital Standing and Occupation. New Audio : More than 60 minutes of original music, countless new sound effects and dozens of new voice overs help bring the drama of battle to new levels of immersion. Tutorials : New and updated tutorials make it easy for both experienced and new players to quickly start building their own solar empire. Plus, a number of optimizations that provide better performance than ever before!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/204880/header.jpg?t=1637248699",
    "Price": 39.99,
    "Developers": "Ironclad Games,Stardock Entertainment",
    "Publishers": "Stardock Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_d018361380a56bcc8b6fd4a6395df5c114c3e188.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_9fcff4b2ac0a5baa67543446b8767278bc1c7c01.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_d08926f7d7e44b57726fad3ef675ef9443e2d0c5.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_c61a18defc13f05d1994106686eed8ff0147f819.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_8565e801bf9e4e7c43978f35bc98c15a61d8ed87.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_048d92ab5633335cb91a0075fde471c25dc73c2c.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_5d550fd4e82f1280fe9c314a111ce5d6d3076809.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_a841cf82f2bd840aeeae0c1ba91bb8489d7c3698.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_30b723a940e8ee5d5fb36e5b2cd6cd023d88d328.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_57bd3ff7445a5563f4fb741ea0b6aa4f816d868c.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_a0227e6360ab340255f45f819e0ab3affaf30d90.1920x1080.jpg?t=1637248699,https://cdn.akamai.steamstatic.com/steam/apps/204880/ss_fb0e15c743f842314928e724ec104216601c9aeb.1920x1080.jpg?t=1637248699",
    "Slug": "sins-of-a-solar-empire-rebellion",
    "Meta Title": "Sins of a Solar Empire®: Rebellion: Jun 12, 2012, Ironcla...",
    "Meta Description": "Looking for information on Sins of a Solar Empire®: Rebellion? Check out the release date (Jun 12, 2012), developer insights from Ironclad Games,Stardoc...",
    "Alt Text Image": "Official header image for Sins of a Solar Empire®: Rebellion game - Steam 204880",
    "Canonical URL": "https://gusku.site/game/sins-of-a-solar-empire-rebellion",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sins of a Solar Empire\\u00ae: Rebellion\", \"description\": \"Looking for information on Sins of a Solar Empire\\u00ae: Rebellion? Check out the release date (Jun 12, 2012), developer insights from Ironclad Games,Stardoc...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2012\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ironclad Games,Stardock Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Stardock Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/204880/header.jpg?t=1637248699\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}