{
    "AppID": 1545260,
    "Name": "Stickman Escape",
    "Release date": "Jul 13, 2021",
    "About the game": "In that age when the monitor was still a “big head” and download speed was about KB, the stickman was in flash game which must be one of your favorite characters. Stickman never made you disappoint whether his kung fu of cool fighting, or funny and nonsensical role in your childhood. Now stickman is coming back with more funny stories. More Memories The big fiends in every age have their own childhood memories, and this so-called 'childhood memories' has also changed over time and kept pace with the times. If stickman was the childhood memories of the 80s and 90s, then MOBA and 'eating chicken' are the childhood memories of the 00s and 10s. Of course. There are also some homework, learning, and the growth 'troubles' of the Spring Festival routines. And 'Stickman Escape' cleverly integrates these elements, so that every player can inadvertently reminisce about his childhood, and can't help but smile. More Funny 'Stickman Escape' has a number of bizarre adventure stories, and every step of the journey requires you to make a choice. The correct choice will advance the plot and finally reach the ending smoothly. If you think that this is over, go to experience the next trip, then your loss will be too great. Yes, unlike most games, at least half of the fun of 'Escape of Stickman' lies in experiencing 'failure'. It's not that the more frustrated you are, the more you feel the positive energy chicken soup of the philosophy of life, but it is so interesting! With my brain opened up, the screenwriter is completely incapable of describing myself! You can never figure out what kind of peculiar failure performances are arranged by the planning that often breaks out of this thinking band, and such funny and nonsensical failure performances usually have several choices for each event. More Stories If it’s just a fancy failure collection, just look at the options one by one, right? It is naive to think this way. 'Stickman Escape' uses option branches to arrange multiple endings, and also inserts 'hidden operations' in many key nodes. Just like the 'AB' secret skills of the childhood game Contra, you can rewrite the plot in the right way to play the 'anti-the sky' effect. After all, a game known for its brain-holes, wouldn't it be sorry if it didn't bury some weird foreshadowings? Expectation. The age of Flash has came to the end, but our childhood will never fade. Let us experience our childhood and enjoy a journey of joy with familiar stickmen in 'Stickman Escape'.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1545260/header.jpg?t=1626230237",
    "Price": 3.99,
    "Developers": "Happy Jay Games",
    "Publishers": "Happy Jay Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1545260/ss_2cc2789fc3469acfaee041f495a38c83b662d1dc.1920x1080.jpg?t=1626230237,https://cdn.akamai.steamstatic.com/steam/apps/1545260/ss_6a738ca65c2e8b622950b207c596d3535c5234ff.1920x1080.jpg?t=1626230237,https://cdn.akamai.steamstatic.com/steam/apps/1545260/ss_313d7f23fb59acb3d8c1d64c58608d6a3b88891e.1920x1080.jpg?t=1626230237,https://cdn.akamai.steamstatic.com/steam/apps/1545260/ss_9b5b72994e512c80418f47014690e1d5592a8034.1920x1080.jpg?t=1626230237,https://cdn.akamai.steamstatic.com/steam/apps/1545260/ss_a660b317555069e03dffe2e4980d71fb8549d188.1920x1080.jpg?t=1626230237",
    "Slug": "stickman-escape",
    "Meta Title": "Stickman Escape: Jul 13, 2021, Happy Jay Games and Full O...",
    "Meta Description": "Looking for information on Stickman Escape? Check out the release date (Jul 13, 2021), developer insights from Happy Jay Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Stickman Escape game - Steam 1545260",
    "Canonical URL": "https://gusku.site/game/stickman-escape",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stickman Escape\", \"description\": \"Looking for information on Stickman Escape? Check out the release date (Jul 13, 2021), developer insights from Happy Jay Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Happy Jay Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Happy Jay Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1545260/header.jpg?t=1626230237\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}