{
    "AppID": 1527640,
    "Name": "The Lost Game: Royal Game Of Ur",
    "Release date": "Mar 18, 2021",
    "About the game": "The Lost Game The Royal Game of Ur is the first-ever board game, thought to be played as early as 2600BC. Its rules are deceptively simple but can come together to make a complex experience. While its successor, Backgammon is still played today, The Royal Game has since been lost to time. Let's bring it back. The Royal Game of Ur, Now Restored! The Royal Game of Ur is not very hard to learn. Each player rolls three tetrahedra die where 2/4 points of each dice have silver markings. After rolling three dice, count the number of dice that landed with a silver marking at the top (the game does this for you) - that's the number of tiles you can move a piece. Moving where? Well, The Royal Game of Ur is really a racing game, where two players race to get all their pieces to the end of the board. It may all seem luck-based, but strategy will almost always prevail over luck. If the other player's piece lands on yours, that piece must start over! Certain tiles can only be occupied by one player, so pieces are safe there. Flower tiles provide an extra dice roll and are often bastions of safety in places of danger. Rolled a 2 but no pieces can move 2 tiles? Well, turns over. Don't be at luck's mercy! Level Editor The Lost Game also comes with an in-game board editor. While the strategies for The Game of Ur have already been mostly discovered, challenge yourself by recreating the game! With hundreds of thousands of potential new boards, the possibilities and the strategies on those new arenas will be endless. If you're particularly proud of your creation, you can even share it with the community through the Steam Workshop. As long as you keep trying new maps, you'll never be done with this game! Play with RealAI While this game has the basic dumb AI that's found in every other game, it also features a neural network called Real AI. While it's no AlphaStar, RealAI has been trained on 1 million + scenarios in the classical Game of Ur and is ready to make you fight for that win. Have you mastered even this beast? Give yourself a handicap and see how perfectly you can tune your strategy.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1527640/header.jpg?t=1616101219",
    "Price": 2.99,
    "Developers": "Arian Alavi",
    "Publishers": "Arian Alavi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1527640/ss_8b569f672f9431fee5fd148085d2313d930c839f.1920x1080.jpg?t=1616101219,https://cdn.akamai.steamstatic.com/steam/apps/1527640/ss_39eb0c823c121e07332874e73f198b12576448d5.1920x1080.jpg?t=1616101219,https://cdn.akamai.steamstatic.com/steam/apps/1527640/ss_6f474775244937f85b86e884cdfcb64b8f159cf0.1920x1080.jpg?t=1616101219,https://cdn.akamai.steamstatic.com/steam/apps/1527640/ss_4cfff372bd63ebae98d0b9de4f41be00e3dc9c28.1920x1080.jpg?t=1616101219,https://cdn.akamai.steamstatic.com/steam/apps/1527640/ss_13da6a93e38d449fc99f4a703e26195db8f50c83.1920x1080.jpg?t=1616101219,https://cdn.akamai.steamstatic.com/steam/apps/1527640/ss_ac2bfb3b0e7b8ec1ff2d786ccd124e87a371d1e2.1920x1080.jpg?t=1616101219",
    "Slug": "the-lost-game-royal-game-of-ur",
    "Meta Title": "The Lost Game: Royal Game Of Ur: Mar 18, 2021, Arian Alav...",
    "Meta Description": "Looking for information on The Lost Game: Royal Game Of Ur? Check out the release date (Mar 18, 2021), developer insights from Arian Alavi, and a comple...",
    "Alt Text Image": "Official header image for The Lost Game: Royal Game Of Ur game - Steam 1527640",
    "Canonical URL": "https://gusku.site/game/the-lost-game-royal-game-of-ur",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Lost Game: Royal Game Of Ur\", \"description\": \"Looking for information on The Lost Game: Royal Game Of Ur? Check out the release date (Mar 18, 2021), developer insights from Arian Alavi, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 18, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Arian Alavi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Arian Alavi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1527640/header.jpg?t=1616101219\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}