{
    "AppID": 805520,
    "Name": "The Dwarves of Glistenveld",
    "Release date": "Oct 18, 2019",
    "About the game": "The Dwarves of Glistenveld is a Real-Time Strategy game about clans of dwarves trying to live and expand underground. Manage your own clan and help them explore, mine, forage, fight, and build a home in a forgotten underworld! Goblins have invaded the land of Glistenveld and the dwarven city Glistenborg is besieged! Flanked on all sides, the surviving dwarves flee underground. Cut off and divided, they split into different clans, each with their own ideals and strategies to survive. Goblins are now searching the tunnels under the city to rid the land of dwarves for good! Will you reunite and work together with the other clans, or take the reigns and seek to regain power for yourself? Explore Hidden Depths The world of Glistenveld has many discrete mechanics and behaviours to learn about, and your actions will sometimes have lasting consequences. There are 3 difficulty options if you wish for a more (or less) forgiving experience. Meet Quirky Dwarves Each dwarf is born unique, with generated traits and details that give them their own personality. You will find that some do better at certain jobs than others, or are impacted by their surroundings, or just simply act differently from one another. With over 2,000 possible combinations of impactful traits, you'll be hard-pressed to find two dwarves the same! Hone Skills &amp; Gain Abilities Your dwarves gain experience working in each of the four classes: Mining, Foraging, Engineering &amp; Combat. As they level up, you can choose special abilities for them, like prospecting nearby minerals or uncovering enemy tracks! Advance Technologies Find schematics and artefacts to unlock new technologies! The current tech-tree features over 12 unlockable techs, that span from revealing traits to farming and industrialising your base, with many more still to come! Build a Home Most modes and levels in the game give you the freedom to build a home for your dwarves. Different modes offer different limitations on building, advancing the tech tree or increasing population. Currently features over 30 buildings and other constructs to organise, secure, refine and decorate your bases! Environmental Dangers Your dwarves might step on traps in old ruins, trigger cave-ins while excavating, or even wander unwittingly into a spider's nest! Glistenveld holds many dangers, but rewards those who stay vigilant! Manual / Automated Control You can exercise precision by controlling dwarves manually, or place instructions for them to work on and accomplish in their own time. This game provides a balance of micro and macro-management, and our goal is for you to be able to accomplish most tasks using either. Modes of Play Campaign - Play as your own clan through a story-driven campaign. Drive back the goblins, meet other dwarf clans, encounter monsters, mysteries and treasures on your journey to take back your homeland! Caverns Mode - In the farer reaches of Glistenveld lies an enormous expanse of (procedurally generated) caves and tunnels! With humble beginnings, explore, develop, and become master of the elements as you build a new, grand home for your dwarves! Every playthrough presents unique experiences and challenges! Scenarios - A series of hand-crafted, carefully designed challenge maps, to test your skills and understanding of the game mechanics. Skirmish Mode - Choose from a wide range of parameters, including opponents, biomes and resources, to create your own skirmish scenarios! Map Editor - Design, craft and script your own levels and share them on the Steam Workshop.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/805520/header.jpg?t=1633370208",
    "Price": 13.99,
    "Developers": "Nysko Games Ltd.",
    "Publishers": "Nysko Games Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_d8d31254cffd2ef5a37ffd75c3364ef38e28dc7f.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_f20b7fbfc622259eb2e53deb94bcb7b6238395c9.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_c0a3285ad9b872d95c4c7adef30ad7b32d5f9cf9.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_56290361ed3080a76b016fbd6c83373146880c38.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_a4768d4ed1a4c10fb1b1d4bc85ab49cda53598c7.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_27bc90b6924c41627ba3e902dc86c3a6fcac9370.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_16fc1d3f22f193d3cc83103e7500ce681fa158a7.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_7af820be028359926230ca85a911fde6d253c039.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_4bd060f11c7943780282ba3e8ec026da02c24ed0.1920x1080.jpg?t=1633370208,https://cdn.akamai.steamstatic.com/steam/apps/805520/ss_de20153a0f38589e537237a14fd86d207599d4a1.1920x1080.jpg?t=1633370208",
    "Slug": "the-dwarves-of-glistenveld",
    "Meta Title": "The Dwarves of Glistenveld: Oct 18, 2019, Nysko Games Ltd...",
    "Meta Description": "Looking for information on The Dwarves of Glistenveld? Check out the release date (Oct 18, 2019), developer insights from Nysko Games Ltd., and a comple...",
    "Alt Text Image": "Official header image for The Dwarves of Glistenveld game - Steam 805520",
    "Canonical URL": "https://gusku.site/game/the-dwarves-of-glistenveld",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Dwarves of Glistenveld\", \"description\": \"Looking for information on The Dwarves of Glistenveld? Check out the release date (Oct 18, 2019), developer insights from Nysko Games Ltd., and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nysko Games Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nysko Games Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/805520/header.jpg?t=1633370208\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}