{
    "AppID": 1069650,
    "Name": "Ultimate Admiral: Age of Sail",
    "Release date": "Apr 7, 2021",
    "About the game": "A TRULY UNIQUE NAVAL WARGAME EXPERIENCE Ultimate Admiral: Age of Sail is a unique wargame allowing you to experience the best of the Ultimate Series AI and tactical engine in naval, land, and combined arms landing operations. Taking the role of a famous commander, you will be at the heart of the historical battles and events. • In the British Campaign, you will follow Horatio’s Nelson journey from midshipman on the shores of Central America to the admiral who defeated the great armada in the battle of Trafalgar. • In the American campaign, you will play the role of John Paul Jones, participate in the War of Independence and stand at the origins of the United States Navy winning freedom for your country. REALISTIC SAILING Individual wind plans are based on each ship's rigging. Realistic sailing physics replicates the behavior of actual ships where yard position changes based on the chosen course and direction of the wind. When at full sail your relative position to the wind can cause your ship to roll and block your guns from firing effectively. Moving with full sails in strong winds can also capsize your ship. When sailing against the wind ships can be pushed backward. DETAILED DAMAGE MODEL Unique aiming system where you can assign a target to focus your gunner's aim on any part of a ship. A detailed damage model allows for the destruction of all ship components. Realistic ballistics and impact physics that account for energy, penetration, obstacles, and ricochets. Thickness based planking system where protection degrades as the planking is damaged. Planking penetration is also influenced by shot angle and material quality. HISTORICAL SHIPS AND WEAPONS We recreated the beautiful ships of the Age of Sail period from historical or admiralty collections drafts. Accurate hull models, sail plans, guns, internal upgrades, historical speed trials were used in the creation of vessels. We spent hundreds of hours researching numerous details on historical gunnery and firearms of the age of sail. Historical availability has also been implemented. Certain ships and weapons can only be captured by boarding ships or taken from the enemy on the battlefield. NAVAL BATTLES To win battles you will need to master the art of maneuvering at sea. In the Age of Sail, proper positioning is of the utmost importance. Gain the weather gage, sustain powerful broadsides, and anticipate the lumbering movement of enemy ships-of-the-line. Approach to deliver a broadside at your own peril; even the most experienced captains risk demasting, loss of the ships, or death when engaging the enemy. LANDING OPERATIONS When broadsides are not enough; you bring the Marines! Your hardy sea infantry can board vessels, conduct landing operations, and join land forces in assaulting enemy batteries and other fortifications. Manage cover, positioning, and morale to lead your forces to victory! LAND BATTLES Control of the seas is only half the battle. Whether on the New World, Venerable Europe, or the many islands in-between, once the war at sea is over, an invasion must commence. Take control of more traditional national armies to combat your enemies on land in major campaigns and where your small force of marines will not do. GAMEPLAY Build your fleet: Success on the high seas will earn you promotions. Grow your fleet from a small squadron of unrated ships to a fearsome battle fleet complete with powerful ships-of-the-line. Customize your ships with new technology, weapons, to create a fleet that fits your tactical doctrine. Manage your crews: With every naval engagement, your crewmen become more efficient and deadly. With every shot, their accuracy and gunnery improve. While sailing they improve their stamina and fine control of their ship. Board enemy ships and land marines to build proficiency in combat. Of course, every veteran’s death is a huge blow to the navy. Gain reputation and promotions: Participating in battles you will receive an experience that will allow you to develop your admiral. Develop your tactical doctrines, build fast and maneuverable squadrons, or slow heavily armed ships of the line to control the seas. Receive bonuses to supply, improve relations with the Admiralty, replenish crew, lower equipment prices, and gain other advantages to assist your campaigns. IMPORTANCE OF LOGISTICS AND INTERDICTION The game simulates naval warfare with small actions to huge fleet battles and amphibious operations to control the world’s oceans and shores. Fleets and flotillas are crucial for the logistical support of war requiring transportation of materials, goods, treasures, and troops. Your naval vessels have the capability to make decisive strikes against the opponent fleets or interdict their supply lines. HISTORICAL CAMPAIGNS Fight in the campaignы and participate in 80+ battles from small engagements to massive battles over land and sea. The campaign fully depends on player actions and battle results. The game includes the following famous battles in campaigns: - Battle of Bunker Hill (1775) - Burning of Norfolk (1776) - Siege of Savannah (1779) - Battle of Cape Henry (1781) - Battle of the Chesapeake (1781) - Siege of Toulon (1793) - Battle of Cape St. Vincent (1797) - Battle of the Nile (1798) - Battle of Trafalgar (1805) - + 70 additional historical and speculative battles and actions",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1069650/header.jpg?t=1619696101",
    "Price": 29.99,
    "Developers": "Game-Labs",
    "Publishers": "Game-Labs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_93fea26a9270edb6fa9db02be3e26094def78214.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_e73cd06e33b4416d3f6bdec56d97f7e1af2bc6dd.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_10f8908a5a5572926748d25ba19fbef7bb0bfd4f.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_adcfa05901b1979654f5aa7e9456ad42ba29d016.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_807e14a58e75681b796126bd90b5880631088d2d.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_128a59edc1fad897b12356b2a9465e7abfae1755.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_c0f8912d9894f2ec7b6d825ae76389948f9217d0.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_099b78b29ecfcc07e226fd1fa764f81472924482.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_55d45c9628b7eab37910e52b1a1da6e99ad81a68.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_1983f1ae9c16296344e2378b4cba54a391f7f074.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_9f91d2a1d8c79edadd6e195471f02f3a8a54485b.1920x1080.jpg?t=1619696101,https://cdn.akamai.steamstatic.com/steam/apps/1069650/ss_56db6f95299b1d66295e9e5f9930fbc9ba3bd6c3.1920x1080.jpg?t=1619696101",
    "Slug": "ultimate-admiral-age-of-sail",
    "Meta Title": "Ultimate Admiral: Age of Sail: Apr 7, 2021, Game-Labs and...",
    "Meta Description": "Looking for information on Ultimate Admiral: Age of Sail? Check out the release date (Apr 7, 2021), developer insights from Game-Labs, and a complete ga...",
    "Alt Text Image": "Official header image for Ultimate Admiral: Age of Sail game - Steam 1069650",
    "Canonical URL": "https://gusku.site/game/ultimate-admiral-age-of-sail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ultimate Admiral: Age of Sail\", \"description\": \"Looking for information on Ultimate Admiral: Age of Sail? Check out the release date (Apr 7, 2021), developer insights from Game-Labs, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game-Labs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game-Labs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1069650/header.jpg?t=1619696101\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}