{
    "AppID": 765230,
    "Name": "Unrect",
    "Release date": "Jan 17, 2018",
    "About the game": "UNRECT is a 2D sandbox game where players have a significant role. Our hero is on an important mission, working to build and extend his colony. Collecting and capsuling the essence (life source) which is scattered around the world. After that, say hello to the new colonists. Our hero has to protect these new colonists by building a home for them. As time goes by, customize and extend the base and improve the colonists’ surviving abilities, produce essences and increase the number of colonists. This is your reign, colonists do everything that you say. You can assign them to the turrets and capsules which are used for producing essence, or keep them as a companion of yours. You can build anything in this world by picking and placing blocks, as easy as walking. There is a vast open world waiting for you; explore the mysterious areas and caves, and hunt down the enemy bases. Colonists are awaiting you! Collect Life Resources Gather essence from mysterious caves or by eliminating your dangerous enemies. You can use the essence for regenerating health or creating new colonists! Capture Enemy Settlements Discover life capsules scattered all over the world and start creating new colonists! You can also regenerate your health, use fast travel and improve your abilities from life capsules. Build a Base for Your Colony Build a base for your colony to live in peace and protect it from enemy attacks. Buy various equipment and provide a comfortable life for your colony members. Command Your Colonists You can give orders to your colonists in tactical slow-motion mode, they act just like you tell them to. You can assign them to the turrets and capsules which are used for producing essence, or keep them as companions of yours. Remember, it is important to give the right command in a critical moment! Talented Colony Members Your colonists gain skill points as they work. Use these skill points wisely to make your colonists productive. In this way they can use turrets better, they become stronger and they work faster. Plan Your Defensive Strategy Build your base wisely to survive enemy attacks. Increase the power of your colony with various equipment and position your colony cleverly. Use traps, mines and other tools to make the enemies cry! Take Hold of Enemy Bases Beat enemies which guard life resources in the dangerous caves. Take your colony members as companions of yours and command them -although sometimes difficult- against your enemies and destroy them. Say hello to new life resources and companions! Discover Vast Open World Liberate these dangerous caves in the world of Unrect by eliminating your enemies. Gather essence capsules, discover new areas and expand your colony.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/765230/header.jpg?t=1586551973",
    "Price": 2.99,
    "Developers": "Sedat Güç",
    "Publishers": "Crealode Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_6c6e2d491ba25a42fc8fc913bc1cce54f035f08f.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_9fe956a9e45c250c97310226d7a92c54be259753.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_ae98d1bbb0bd5b85c528bb8bf493e0befb77f81c.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_d68dee5f79e9a10b23295ca230a911a6d4a3ea39.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_ebc0e7b64c6a08a79db3dfa1fe88f3d6aed07f27.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_22e3658d2b9d5d225f5650ee641950b18716f491.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_a87c924fbd77ea24f0301a71e2a55ed66d6a7814.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_a8b0b45818574d1a2971ed34b9f29768267a1c69.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_3c4074b82532c0d312b8e02d7f92670ffd8a9a8e.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_3557f4d362a6f811f8b364ac9400330842426fdf.1920x1080.jpg?t=1586551973,https://cdn.akamai.steamstatic.com/steam/apps/765230/ss_ac95b14acb5c085bb3194c32b137f9761851be25.1920x1080.jpg?t=1586551973",
    "Slug": "unrect",
    "Meta Title": "Unrect: Jan 17, 2018, Sedat Güç and Full Overview",
    "Meta Description": "Looking for information on Unrect? Check out the release date (Jan 17, 2018), developer insights from Sedat Güç, and a complete game summary.",
    "Alt Text Image": "Official header image for Unrect game - Steam 765230",
    "Canonical URL": "https://gusku.site/game/unrect",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Unrect\", \"description\": \"Looking for information on Unrect? Check out the release date (Jan 17, 2018), developer insights from Sedat G\\u00fc\\u00e7, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sedat G\\u00fc\\u00e7\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crealode Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/765230/header.jpg?t=1586551973\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}