{
    "AppID": 560180,
    "Name": "World In Danger",
    "Release date": "Feb 9, 2017",
    "About the game": "The world has become an increasingly dangerous place, the number of criminals, terrorists and general evildoers is at an all-time high. To counter this evil, decorated S.W.A.T. officer J.J. Colt founds the World Army. Together with his longtime friend Nathan 'Rocket' Nace, an explosives expert and mechanical engineer. It is an army with no political or national allegiance, its only goal is making the world a better place by fighting evildoers on a global scale. Colt and Rocket are quickly joined by Samantha Byington, a renown competitive martial artist; and Marco Tundo, a highly trained ninja with a mysterious past. Several dozen recruits from all over the world also sign up. Some experienced or formerly retired soldier or mercenaries, others regular people with no combat experience. All of them in need of training or a refresher course before they are ready for action. The heroes are dutifully making progress towards achieving their goal. Little do they know that behind the scenes, a great evil is plotting a scheme of grand proportions... World In Danger is a top-down action game with stealth elements, similar to classics such as 'Metal Gear'. Embark on missions across the globe, taking out groups of enemies, rescuing hostages, disarming bombs and more. Face the unique and challenging boss fights the player encounters as the story unravels in this over the top action extravaganza. Challenging Bosses Face off against interesting and unique bosses as you make your way through the story. Large Roster of Playable Characters Aside from the four main characters, unlock a large number of additional playable characters as you progress through the game. Each with their own skills and weapons Freely Explore The Headquarters (Freeroam Mode) Between missions, head to the World Army headquarters and see it evolve over the course of the storyline. Meet the entire crew and get to know them. Adjustable Difficulty Play the game either as a challenging experience or a casual playthrough. Some like a challenge, others just want to experience the story, you can pick your preference every time you start the game and enter the mission select screen. Boss Attack Mode(s) After completing the story, try your hand at the boss attack mode. Take on all the bosses back to back. If you really want to challenge yourself try the 'Ironman' variant, where health and ammo are not reset at the start of each boss. One health bar and limited ammo. Achievements/Codenames To Unlock Unlock achievements/codenames throughout the game. Defeat a boss, get the highest rank on a mission or even simply talk to all of the characters in freeroam mode... But also several secret achievements, can you find/earn them?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/560180/header.jpg?t=1572356392",
    "Price": 2.99,
    "Developers": "ColtGames",
    "Publishers": "ColtGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_39905e70fa4e1f50002f890f004ca4efe58488f5.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_a96f2e94771a647aca55e1eac65f57049e8d4b56.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_41c4c3190d8c309535bddeb0ffc8ad7e98f7c173.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_4ca8e12c2784250d99e7672322f844a0ba1f9b83.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_5fdd1079dc0da58ecff085c7b7c36285a14779b7.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_dceba58643e5704f5e9b42d6c14c7b9f8afcadb6.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_ca02c81bce1bb65e97386946a796779ca4dbf9c9.1920x1080.jpg?t=1572356392,https://cdn.akamai.steamstatic.com/steam/apps/560180/ss_9b8ea87bed6503eeb2e0fa1a2159fc0cd7a403eb.1920x1080.jpg?t=1572356392",
    "Slug": "world-in-danger",
    "Meta Title": "World In Danger: Feb 9, 2017, ColtGames and Full Overview",
    "Meta Description": "Looking for information on World In Danger? Check out the release date (Feb 9, 2017), developer insights from ColtGames, and a complete game summary.",
    "Alt Text Image": "Official header image for World In Danger game - Steam 560180",
    "Canonical URL": "https://gusku.site/game/world-in-danger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"World In Danger\", \"description\": \"Looking for information on World In Danger? Check out the release date (Feb 9, 2017), developer insights from ColtGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ColtGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ColtGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/560180/header.jpg?t=1572356392\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}