{
    "AppID": 1922750,
    "Name": "xVATrainer",
    "Release date": "Apr 1, 2022",
    "About the game": "xVATrainer is the companion app to xVASynth, the AI text-to-speech app using video game voices. xVATrainer is used for creating the voice models for xVASynth, and for curating and pre-processing the datasets used for training these models. Check the nexusmods page description for more details, instructions, and updates. Join the Discord for support, and community advice. Dataset annotation The main screen of xVATrainer contains a dataset explorer, which gives you an easy way to view, analyze, and adjust the data samples in your dataset. It further provides recording capabilities, if you need to record a dataset of your own voice, straight through the app, into the correct format. Trainer xVATrainer contains AI model training, for the FastPitch1.1 (with modified training set-up), and HiFi-GAN models (the xVASynth 'v2' models). The training follows a multi-stage approach especially optimized for maximum transfer learning (fine-tuning) quality. The generated models are exported into the correct format required by xVASynth, ready to use for generating audio with. Batch training is also supported, allowing you to queue up any number of datasets to train, with cross-session persistence. The training panel shows a cmd-like textual log of the training progress, a tensorboard-like visual graph for the most relevant metrics, and a task manager-like set of system resources graphs. Tools There are several data pre-processing tools included in xVATrainer, to help you with almost any data preparation work you may need to do, to prepare your datasets for training. There is no step-by-step order that they need to be operated in, so long as your datasets end up as 22050Hz mono wav files of clean speech audio, up to about 10 seconds in length, with an associated transcript file with each audio file's transcript. Depending on what sources your data is from, you can pick which tools you need to use, to prepare your dataset to match that format. The included tools are: Audio formatting - a tool to convert from most audio formats into the required 22050Hz mono .wav format AI speaker diarization - an AI model that automatically extracts short slices of speech audio from otherwise longer audio samples (including feature length movie sized audio clips). The audio slices are additionally separated automatically into different individual speakers AI source separation - an AI model that can remove background noise, music, and echo from an audio clip of speech Audio Normalization - a tool which normalizes (EBU R128) audio to standard loudness WEM to OGG - a tool to convert from a common audio format found in game files, to a playable .ogg format. Use the 'Audio formatting' tool to convert this to the required .wav format Cluster speakers - a tool which uses an AI model to encode audio files, and then clusters them into a known or unknown number of clusters, either separating multiple speakers, or single-speaker audio styles Speaker similarity search - a tool which encoders some query files, a larger corpus of audio files, and then re-orders the larger corpus according to each file's similarity to all the query files Speaker cluster similarity search - the same as the 'Speaker similarity search' tool, but using clusters calculated via the 'Cluster speakers' tool as data points in the corpus to sort Transcribe - an AI model which automatically generates a text transcript for audio files WER transcript evaluation - a tool which examines your dataset's transcript against one auto-generated via the 'Transcribe' tool to check for quality. Useful when supplying your own transcript, and checking if there are any transcription errors. Remove background noise - a more traditional noise removal tool, which uses a clip of just noise as reference to remove from a larger corpus of audio which consistently has matching background noise Silence Split - A simple tool which splits long audio clips based on configurable silence detection Special thanks: Caden Black, Thuggysmurf, D0lphin, radbeetle, Max Loef, Cecell, Solstice_, Anshela Asre, Tara_C, flyingvelociraptor, My Best Friend Is A Squid, Bungle Paws, neci, eldayualien, Retlaw83, Trixie, TomahawkJackson, Netherworks, Imogen, CHASE MCKELVY, Leif, ionite, Joshua Jones, CookieGalaxy, Rachel Wiles, TCG, Hellath, sadfer, Jaktt, David Keith vun Kannon, Danielle, EnculerDeTaMere, bourbonicRecluse, GOLOVATRIS, Bob, finalfrog, Buck Crutchfield, Yael van Dok, Vossler, Mikkel Jensen, yic17, AgitoRivers, John Detwiler, Alexandra Whitton, Tako-kun, Caro Tuts, beccatoria, Hammerhead96 ., PConD, Blythe, cramonty, Hazel Louise Steele, Lulzar, Vahzah Vulom, Ryan W, Laura Almeida, Wyntilda, Gorim, Krazon, squirecrow, crash blue, GrumpyBen, Adrilz, Katsuki, Calvin, hairahcaz, FeralByrd, Comical, dog, Althecow, SomeOtherWeirdo, Optimist Vamscenes, 𝖆𝖈𝖊𝖗𝖇𝖎𝖈𝖔𝖓, David, Hawkbar, Katherine Fishwick, John S., Idiotenschnitzel, Michael Gill, Jacob Garbe, NerfViking, Jacob Porter, Hapax, stormalize, Golem, Luckystroker, Tempuc, CAW CAW, Veks, stljeffbb, Zoenna, CDante, GodWaffle, Jarrett Barclay, Hound740, Jack in the Hinter, Royce, HunterAP, pimphat, PTC001, Hector Medima, CinnaMewRoll, Grant Spielbusch, Sean Lyons, Charles Hufnagel, Kirill Akimov, Mister Lyosea, Anthony Crane, Sh1tMagnet",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1922750/header.jpg?t=1648802510",
    "Price": 0.0,
    "Developers": "Dan Ruta",
    "Publishers": "Dan Ruta",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1922750/ss_ecb1847e0e7a85653f0158322c340f8a0785d380.1920x1080.jpg?t=1648802510,https://cdn.akamai.steamstatic.com/steam/apps/1922750/ss_bb1fe2255d56679a1a15fdf6f1de11e31f5dc1e4.1920x1080.jpg?t=1648802510,https://cdn.akamai.steamstatic.com/steam/apps/1922750/ss_128e7078f0dc39ba3995a731f8c990f46a1e6115.1920x1080.jpg?t=1648802510,https://cdn.akamai.steamstatic.com/steam/apps/1922750/ss_5a22dd71fbc9065073e840593b3291edb98f5617.1920x1080.jpg?t=1648802510,https://cdn.akamai.steamstatic.com/steam/apps/1922750/ss_38ba457020d3c8c1c0825823e94e09f7f7308e58.1920x1080.jpg?t=1648802510,https://cdn.akamai.steamstatic.com/steam/apps/1922750/ss_5adbf4676a94bf244f57696e9d374468ba60a709.1920x1080.jpg?t=1648802510",
    "Slug": "xvatrainer",
    "Meta Title": "xVATrainer: Apr 1, 2022, Dan Ruta and Full Overview",
    "Meta Description": "Looking for information on xVATrainer? Check out the release date (Apr 1, 2022), developer insights from Dan Ruta, and a complete game summary.",
    "Alt Text Image": "Official header image for xVATrainer game - Steam 1922750",
    "Canonical URL": "https://gusku.site/game/xvatrainer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"xVATrainer\", \"description\": \"Looking for information on xVATrainer? Check out the release date (Apr 1, 2022), developer insights from Dan Ruta, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dan Ruta\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dan Ruta\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1922750/header.jpg?t=1648802510\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}