{
    "AppID": 870520,
    "Name": "太平洋之嵐6 ～ 史上最大的激戰諾曼第攻防戰! Pacific Storm 6 - Battle for Normandy",
    "Release date": "Nov 30, 2018",
    "About the game": "'Pacific Storm 6 - Battle for Normandy”, the background was set at the beginning of the World War II. On September 3, 1939, German invaded Poland. Britain and France declared to fight against German and ignited the World War II. The game truly reproduces the world situation at the time, allowing players to experience the immersive, and strategizing to change the historical evolution. Players need to choose the scripts of the World War II at four different times, which deeply influence on European theater. Players play as the German commander to control the war situation, leading the army to counter the allied actions, promoting the great German, and let Nazi Germany dominate the battlefield. ! The legendary strategy simulation game series' Pacific Storm” launch the new title after nine years. This new title change the series as the main axis of the Pacific Naval Battle to turn the battlefield to Europe land battle finally, centering on the well-known battles in the European War. Players will compile tanks, self-propelled guns, tow guns, transport vehicles, infantry as main battalion to fight with the enemy. Player can also use fighters and bombers to carry out air strikes against the strongholds, weaken the defense, and occupy the stronghold to dominate Europe as the goal. Many new elements have been added, such as the 'combat system' that can change the tactics with the war conditions, the 'commander system' that can strengthen the combat capability of the division, and the teaching mode that leads the players to actually operate the battlefield, so both new and old players can experience the real hardcore &amp; the scene of the war. [Game Feature] ‧Return to Battlefield： The four new scripts that contain important battles of European theater, allowing players to experience the thrilling of war situation! ‧New experience: This title changes the series as the main axis of the Pacific Naval Battle to be land battle. Players will consist battalion to fight with the enemy. The information is more comprehensive, the game operation is also optimized, the interface is intuitive and easy to use, and it is easy to choose the command that meets the purpose without being confused. ‧'Tactical Combat': The new combat system 'Tactical Combat' allows players to immediately give orders to each team during each movement, attack instruction, and enjoy the fun of tactical battles. ‧Detailed teaching mode: Even if you are in the first time to play the game, players don't have to worry. The teaching mode will bring the players to do operation and learn the game base gradually into the world of war. ‧'Commander System': Well-known commanders from all over the world, such as popularly known called as the Desert Fox 'Erwin Rommel'! Different commanders will enhance the abilities of the division.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/870520/header.jpg?t=1548729268",
    "Price": 24.99,
    "Developers": "SystemSoft Alpha Cooperation",
    "Publishers": "英特衛多媒體股份有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/870520/ss_1eb1a19e19fc4dee21b709bc3b0a6480d18ba549.1920x1080.jpg?t=1548729268,https://cdn.akamai.steamstatic.com/steam/apps/870520/ss_15c5a9a49d713501267539c78b40ebfd89b440ab.1920x1080.jpg?t=1548729268,https://cdn.akamai.steamstatic.com/steam/apps/870520/ss_3651dea114f52dc085fbd283fbafe38d14b52e10.1920x1080.jpg?t=1548729268,https://cdn.akamai.steamstatic.com/steam/apps/870520/ss_cc3f8b674ebfc72b53cc705a333515520200eeee.1920x1080.jpg?t=1548729268,https://cdn.akamai.steamstatic.com/steam/apps/870520/ss_4f89cc2f94e55d6f5e634f6acf3a989f90a30427.1920x1080.jpg?t=1548729268",
    "Slug": "6-pacific-storm-6-battle-for-normandy",
    "Meta Title": "太平洋之嵐6 ～ 史上最大的激戰諾曼第攻防戰! Pacific Storm 6 - Battle for Norm...",
    "Meta Description": "Looking for information on 太平洋之嵐6 ～ 史上最大的激戰諾曼第攻防戰! Pacific Storm 6 - Battle for Normandy? Check out the release date (Nov 30, 2018), developer insights ...",
    "Alt Text Image": "Official header image for 太平洋之嵐6 ～ 史上最大的激戰諾曼第攻防戰! Pacific Storm 6 - Battle for Normandy game - Steam 870520",
    "Canonical URL": "https://gusku.site/game/6-pacific-storm-6-battle-for-normandy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u592a\\u5e73\\u6d0b\\u4e4b\\u5d506 \\uff5e \\u53f2\\u4e0a\\u6700\\u5927\\u7684\\u6fc0\\u6230\\u8afe\\u66fc\\u7b2c\\u653b\\u9632\\u6230! Pacific Storm 6 - Battle for Normandy\", \"description\": \"Looking for information on \\u592a\\u5e73\\u6d0b\\u4e4b\\u5d506 \\uff5e \\u53f2\\u4e0a\\u6700\\u5927\\u7684\\u6fc0\\u6230\\u8afe\\u66fc\\u7b2c\\u653b\\u9632\\u6230! Pacific Storm 6 - Battle for Normandy? Check out the release date (Nov 30, 2018), developer insights ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"SystemSoft Alpha Cooperation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u82f1\\u7279\\u885b\\u591a\\u5a92\\u9ad4\\u80a1\\u4efd\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/870520/header.jpg?t=1548729268\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}