{
    "AppID": 1131930,
    "Name": "BARRICADEZ",
    "Release date": "Sep 29, 2021",
    "About the game": "Humanity is almost extinct and the planet lies in ruins. The hopes of humanity lie in the survival of a child, a child that you must protect at all costs from the hordes of the night that will stop at nothing to destroy everything. You embody an all-purpose care robot, awoken by an emergency distress call. As you head to the surface, you intercept an escape pod of a human child, which results in your mission parameters being updated to protect the child at all costs. However, your memory banks are failing- if you could only remember why this child in particular is so important… As an all purpose care robot, you are the first and last line of defense of this child versus the oncoming hordes of zombie like creatures. Use your ingenuity and crafting skills to defend against the hostile creatures. Explore the world below the ground to find new materials, blueprints and upgrades, which you use to build defenses, traps and walls. Gather your resources, prepare your Barricadez and strategies during the day , and hold out against the hordes until dawn in this unique side scrolling tower defense game. You’re in it for the long haul. As day turns to night you make haste to shore up the defenses to protect the cradle. Defeat your enemies to collect experience in the form of engrams which allow you to upgrade your skills and become stronger and efficient. Key Features ・ Gather Resources by exploring the underground. The deeper you go, the more resources you collect, as well as new materials for upgrades. ・ Exploration rewards you with powerful blueprints allowing you to expand your arsenal. ・ Build and design the most effective defensive fortifications to protect the last child of humanity. ・ Utilize a wide array of traps to defeat the encroaching monsters by arranging them along a path that you force the monsters to follow. ・ Traverse and explore a procedurally generated map to plan your defense grid in advance by taking advantage of the day and night cycle. ・ Upgrade your base defenses with stronger materials to increase your odds of success, or use augments to change the way some facilities function. ・ Adapt your defenses on the fly depending on the type of enemies you fight. Different enemies require different strategies. ・ Make use of the autocraft system to provide your traps with ammunition to continually defend against the monsters. Social Media Links Twitter: Youtube: -uRAlCOCIniYTl97DP6sA",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1131930/header.jpg?t=1655172568",
    "Price": 18.99,
    "Developers": "Fly Penguin inc.",
    "Publishers": "Fly Penguin inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_49a09dc4bbc78722bf62601710a98d6b6c5ca8f4.1920x1080.jpg?t=1655172568,https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_f2d1d20a5b265b267a8093aede540d9a7cd8ad25.1920x1080.jpg?t=1655172568,https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_e397489d77696aed54144c59c5548fbd24c30ca0.1920x1080.jpg?t=1655172568,https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_155942b9478dc30dad004278991fa46ab1651dff.1920x1080.jpg?t=1655172568,https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_117b49e449cfc3f7ba69721aba06ced12529ce36.1920x1080.jpg?t=1655172568,https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_0b131d17b61a57d3e4472f6184459c6ad4ae1a69.1920x1080.jpg?t=1655172568,https://cdn.akamai.steamstatic.com/steam/apps/1131930/ss_a1d23daa57297cd20db4d73dd43a95fc3d0795b3.1920x1080.jpg?t=1655172568",
    "Slug": "barricadez",
    "Meta Title": "BARRICADEZ: Sep 29, 2021, Fly Penguin inc. and Full Overview",
    "Meta Description": "Looking for information on BARRICADEZ? Check out the release date (Sep 29, 2021), developer insights from Fly Penguin inc., and a complete game summary.",
    "Alt Text Image": "Official header image for BARRICADEZ game - Steam 1131930",
    "Canonical URL": "https://gusku.site/game/barricadez",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"BARRICADEZ\", \"description\": \"Looking for information on BARRICADEZ? Check out the release date (Sep 29, 2021), developer insights from Fly Penguin inc., and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 29, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fly Penguin inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fly Penguin inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1131930/header.jpg?t=1655172568\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}