{
    "AppID": 960630,
    "Name": "Beyond Critical",
    "Release date": "Dec 19, 2019",
    "About the game": "Overview: Beyond Critical is a sci-fi versus game where players use unique abilities to battle for control over a super massive black hole. In this game, exploding is the goal , not the end. Players in combat will choose to either grow until they explode or to sacrifice their mass for kinetic projectiles. Players must bend space-time itself in order to win in this unique and chaotic brawler! Features: 2 or 4 player versus game play. Play as a team or in a free-for-all. 4 unique ability classes. 6 different color options for customization and team selection. Supports Steam Remote Play Together to battle friends across the globe. Beautiful visual effects are complimented by reactive sound design. Full controller support and haptic feedback. Seamless looping sound track with progressive stages. Special ultra-wide monitor support that increases the play space. Optimized for high refresh rate gaming. Customizable arena configurations for varied gameplay and settings. Supports reactive RGB lighting on the PS4 DualShock 4 Controller. Can support a single keyboard and mouse pair with up to three extra controllers. Ability Classes: Photon Lots and lots of lasers...Play as Photon and fire massive laser beams that stun enemies right in their tracks. Electron Control time itself...Play as Electron and slow down time for your adversaries and take the lead. Neutrino Speed is underrated...Play as Neutrino and fuel high reaction speeds with the ability to teleport in a flash. Gravitron No obstacle is too big...Play as Gravitron and push every opponent around with massive bursts of gravitational energy. Details: Players will battle for control over a super massive black hole. The goal is to stay on the central black hole to collect mass from it while strategically denying opponents access to it. Players must keep opponents at a distance just long enough to reach critical mass and explode, scoring a point for their team. Players have to be careful while in combat, as firing kinetic projectiles sacrifices large quantities of mass in return for larger projectiles. Reaching critical mass is the only way to score, so players should keep an eye out for micro-black holes that will give them a quick boost. The player or team with the most points at the end of the match is declared the winner. Developer Note: 'This was my first release game and senior seminar project. I spent a little over 16 months working on this title in my free time after class and work. All future content will be added to the game as free DLC. Thank you for all of your support. I hope you enjoy playing Beyond Critical with your friends!' Additional Notice: Beyond Critical has no influence over the connectivity and quality of the Remote Play Together streaming service. We advise that the host be using a wired connection with at least a 15Mbps upload speed or higher to provide a good experience using the Steam service. Warning: This is a Co-Op only game and is best played with controllers. There is no single player mode. Only one keyboard and mouse combo is possible at a time, if chosen over full controllers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/960630/header.jpg?t=1576875612",
    "Price": 9.99,
    "Developers": "Dalton Fox",
    "Publishers": "Lightmass Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_3271ef47448f7c4c46d3fecd10348a41aa6405c8.1920x1080.jpg?t=1576875612,https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_4e14341cabb27306ab50945781f4b4942f2faca8.1920x1080.jpg?t=1576875612,https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_48fd9f4b05d55dd27807f0ae3a9c463402887371.1920x1080.jpg?t=1576875612,https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_098e6ecb0ca2ca2daf7a1992aa2f9ab835a64f53.1920x1080.jpg?t=1576875612,https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_93e87224a42bba221476c02cce7d499930bed709.1920x1080.jpg?t=1576875612,https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_5bcf649567d83bdfcf1765ae016ddfdcbb572e86.1920x1080.jpg?t=1576875612,https://cdn.akamai.steamstatic.com/steam/apps/960630/ss_54bc0f36802b172abc366482d236a153a36368fb.1920x1080.jpg?t=1576875612",
    "Slug": "beyond-critical",
    "Meta Title": "Beyond Critical: Dec 19, 2019, Dalton Fox and Full Overview",
    "Meta Description": "Looking for information on Beyond Critical? Check out the release date (Dec 19, 2019), developer insights from Dalton Fox, and a complete game summary.",
    "Alt Text Image": "Official header image for Beyond Critical game - Steam 960630",
    "Canonical URL": "https://gusku.site/game/beyond-critical",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beyond Critical\", \"description\": \"Looking for information on Beyond Critical? Check out the release date (Dec 19, 2019), developer insights from Dalton Fox, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dalton Fox\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lightmass Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/960630/header.jpg?t=1576875612\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}