{
    "AppID": 1901010,
    "Name": "Blob Boy",
    "Release date": "Mar 4, 2022",
    "About the game": "Roll, Bounce, and Swing your way to the top of the mountain in this 3d momentum-based precision platformer! Be warned, this game is NOT for the faint of heart! you will fail, many... MANY times! Are you up to the challenge? In this game, you take control of a little blue blob named Blob Boy. Blob Boy is on a journey to find a wizard named Wizrad who claims to grant the wish of anyone who can find him. Unfortunately for you, Wizrad's door is locked and will require 15 keys to open. Each of the game's 30 key offers a unique challenge within the connected map that will test your knowledge of the game's various mechanics. Momentum is the key to beating this game. on the ground, Blob Boy is slow and can't jump very high, fortunately, he has a variety of tools at his disposal to help him build up massive amounts of speed and fly past challenges. Speed: Blob Boy sticks to the ground so he's not very fast when rolling. if you want to build momentum, you should try to be in the air as much as possible. Mastering the art of knowing when to be in the air or on the ground is vital to beating this game. Bounciness: When hitting the ground Blob Boy bounces as if he's on a trampoline, and goes even higher with a well-timed jump. Wall Jumping: Floors aren't the only thing Blob Boy can bounce off of, if you hit a wall you can press the jump button to get an extra boost just like on the ground and you even get some extra vertical height meaning that if you know how to effectively use it, you can climb just about anything. Swinging: being the sticky amorphous blob he is, Blob Boy is able to stretch himself out and cling to any surface, and swing from it. You have no control over your movement while connected so you'll have to use your pre-existing momentum to propel yourself. The main use for this is redirecting your momentum however, well-executed swings can allow you to basically fly through the game. Huts: scattered around the map are 3 huts that can be unlocked by using 5 keys. Huts allow you to fast travel to other huts and save your keys so you don't lose them if you fall in water or quit. While they're not required to beat the game, you will probably want to unlock at least one if you can't beat the game in one session.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1901010/header.jpg?t=1646391675",
    "Price": 12.99,
    "Developers": "Radwog Games",
    "Publishers": "Radwog Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1901010/ss_df58ec04caa3679351d0fc8030edb1258686df4b.1920x1080.jpg?t=1646391675,https://cdn.akamai.steamstatic.com/steam/apps/1901010/ss_82c352a7a4ad7eeeb8fa293dd0b678007f7a89b3.1920x1080.jpg?t=1646391675,https://cdn.akamai.steamstatic.com/steam/apps/1901010/ss_0464ce9b523aeb120665d5b894eac78dcb7e0513.1920x1080.jpg?t=1646391675,https://cdn.akamai.steamstatic.com/steam/apps/1901010/ss_e7a93092df6e32065a2a339bf6c49f4b0a1eaaa0.1920x1080.jpg?t=1646391675,https://cdn.akamai.steamstatic.com/steam/apps/1901010/ss_5ff81a58f425219c14bd3edf80924a05c83ccc12.1920x1080.jpg?t=1646391675,https://cdn.akamai.steamstatic.com/steam/apps/1901010/ss_82da1a9f3400bff8e61ef60ada84284843eeb174.1920x1080.jpg?t=1646391675",
    "Slug": "blob-boy",
    "Meta Title": "Blob Boy: Mar 4, 2022, Radwog Games and Full Overview",
    "Meta Description": "Looking for information on Blob Boy? Check out the release date (Mar 4, 2022), developer insights from Radwog Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Blob Boy game - Steam 1901010",
    "Canonical URL": "https://gusku.site/game/blob-boy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Blob Boy\", \"description\": \"Looking for information on Blob Boy? Check out the release date (Mar 4, 2022), developer insights from Radwog Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Radwog Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Radwog Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1901010/header.jpg?t=1646391675\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}