{
    "AppID": 1150910,
    "Name": "Book of Beasts — The Collectible Card Game CCG",
    "Release date": "Nov 19, 2020",
    "About the game": "ABOUT BOOK OF BEASTS Book of Beasts is a multiplayer, free-to-play collectible card game (CCG).You place cards on the board by smartly connecting Gems on Beast Cards. Every card on the shared battlefield can be used against you. Additional Spell Cards and deck building offer unlimited strategies and endless battle challenges! OVER 60 CARDS ON LAUNCH DAY CARD TYPES: * BEASTS : Connect the five Gems representing Fire, Water, Air, Earth and Spirit * TURN SPELLS : Impact your turn. * BATTLE SPELLS : Change the battle to your favor ONLINE BATTLES Battle players all around the globe. SUMMON BEASTS Collect cards of mythical beasts. CAST SPELLS Use Spell Cards to win the battle. BUILD DECKS The best card decks win. HOW TO PLAY Score by connecting Beast Cards with matching Gems All your cards played in a turn must be placed next to each other. Gems can only be connected to the same Gem or blank edges. SCORING MANA POINTS: Each new Gem connection awards points according to the lower of the two Gems values. TRINITY BONUS: If at least 3 different Gems are connected in a turn, the player gets 2 Mana Points. MANA POOL: If all Gems on a card with a Mana Pool are connected, the player gets the score indicated on the Mana Pool. END OF GAME: If it’s a player’s turn and they have no more cards in their hand and deck, the game ends. The player with most Mana Points wins. PRO TIPS DECK BUILDING 1. Build decks in your card collection and play with your own creations. You are only permitted a maximum of 2 of each card in your deck. Find out how you can make your deck even better with new cards. 2. Each type of Gem (Fire, Water, Air, Earth and Spirit) has different advantages. Combine them with matching Turn Spells and Battle Spells for maximum points. 3. Balance: The relationship between Beast Cards and Spell Cards is crucial to your strategy. Experiment and find the right balance for your strategy. STRATEGIES 1. BLOCKING: Block your opponents from forming combinations by using the blank edges on your Beast Cards. This prevents your opponents from making high-scoring Beast Card connections. 2. MANA POOLS: Mana Pools can be unlocked when they are placed smartly. But be careful – your opponent can also unlock them! 3. OPPONENT’S HAND: Become a true Book of Beasts master by analysing and taking into account the opponent’s cards in your own turn.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1150910/header.jpg?t=1619011860",
    "Price": 0.0,
    "Developers": "Gbanga (Millform)",
    "Publishers": "Gbanga (Millform)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1150910/ss_f132cc9735f84bb1a59ec72aa8514609ca72a6bd.1920x1080.jpg?t=1619011860,https://cdn.akamai.steamstatic.com/steam/apps/1150910/ss_4d68a2d29ae6a8215b698a364b047bc519d72e2f.1920x1080.jpg?t=1619011860,https://cdn.akamai.steamstatic.com/steam/apps/1150910/ss_ec86b054648a90f533458912ac8e60665ff1bf6f.1920x1080.jpg?t=1619011860,https://cdn.akamai.steamstatic.com/steam/apps/1150910/ss_01aa4a4bc4237b79f6aa5c84e1e3275e0795a683.1920x1080.jpg?t=1619011860,https://cdn.akamai.steamstatic.com/steam/apps/1150910/ss_744a272c9a68502dd807b5c8e1cc9723a916c650.1920x1080.jpg?t=1619011860,https://cdn.akamai.steamstatic.com/steam/apps/1150910/ss_e3c82557bb44f9e48235f6890fdabf5eea28e822.1920x1080.jpg?t=1619011860",
    "Slug": "book-of-beasts-the-collectible-card-game-ccg",
    "Meta Title": "Book of Beasts — The Collectible Card Game CCG: Nov 19, 2...",
    "Meta Description": "Looking for information on Book of Beasts — The Collectible Card Game CCG? Check out the release date (Nov 19, 2020), developer insights from Gbanga (Mi...",
    "Alt Text Image": "Official header image for Book of Beasts — The Collectible Card Game CCG game - Steam 1150910",
    "Canonical URL": "https://gusku.site/game/book-of-beasts-the-collectible-card-game-ccg",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Book of Beasts \\u2014 The Collectible Card Game CCG\", \"description\": \"Looking for information on Book of Beasts \\u2014 The Collectible Card Game CCG? Check out the release date (Nov 19, 2020), developer insights from Gbanga (Mi...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gbanga (Millform)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gbanga (Millform)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1150910/header.jpg?t=1619011860\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}