{
    "AppID": 1528370,
    "Name": "CHACAL",
    "Release date": "Feb 19, 2021",
    "About the game": "It is the near future in Argentina, South America. A fascist president has been in power for ten years lying to people about a deadly virus from which he is protecting them. A small group of people know the truth, and they have sent a young man to look for CHACAL, a retired vigilante in the distant lands of Patagonia. Now CHACAL must make a decision. If he accompanies the people to a revolution, or if he continues his placid life among the mountains. CHACAL is a runner-style Zen game. It has 9 levels, several final bosses, and an intriguing, action-packed story. Travel from the southern reaches to the capital of the country, get the best Score and defeat the evil president of Argentina to free the nation from its subjection! Es el futuro cercano en Argentina, Sudamérica. Un presidente fascista ha estado en el poder durante una década mintiéndole a la población sobre un virus mortal del que supuestamente la está protegiendo con mano dura. No obstante, un pequeño grupo de anarquistas sabe la verdad, y han enviado a un joven a buscar a CHACAL , el anarquista definitivo, un justiciero retirado en las lejanas tierras de la Patagonia. ¡Solo él puede salvarlos! Ahora CHACAL debe tomar una decisión, si acompaña al pueblo hacia una inminente revolución, o si continúa con su plácida vida entre las montañas. CHACAL es un juego Zen del estilo runner , para amantes de las consolas en 16 bits. ¡Nueve intensos niveles, jefes finales, y una intrigante historia repleta de acción! ¡Viaja desde los confines del sur hacia la capital del país, consigue el mejor Score y derrota al malvado presidente de la Argentina para liberar a la nación de su sometimiento! CARACTERÍSTICAS / FEATURES: -Lenguaje en español e inglés. / Language in english and spanish. -Película de animación en el menú principal. / Animation film in the main menu. -Pocos botones. (¡Intuición, reflejos, y ritmo es lo único que se necesita!) / Easy buttons! -Salta, agáchate, golpea con tus puños o pega patadas. ¡Llena de agujeros a los policías y al ejército con tu pistola! / Just jump, crouch, punch or kick, fill the fucking policemen with holes with your gun! -Sprites de estilo retro y delirante música en 16 bits. / Retro-style sprites and delusional 16-bit music. Programmer, artist and writer : Tomás Pernich Co-Programmer : Turbomani789 Music : Sr Pernich Sound Design : Gino Gelsi Special Thanks to : Lucas Anfolisi, Luis Taborda, Hernán Saez, Gabriela Cévalo Boro, Nicolás Montes, Mao [/b]",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1528370/header.jpg?t=1613743231",
    "Price": 3.99,
    "Developers": "Pernich Media",
    "Publishers": "Pernich Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1528370/ss_621ae580a2f492f6e18055a794dabd25150666fd.1920x1080.jpg?t=1613743231,https://cdn.akamai.steamstatic.com/steam/apps/1528370/ss_e11a0dfdda19404d0461bc0ae02b16d16c35efac.1920x1080.jpg?t=1613743231,https://cdn.akamai.steamstatic.com/steam/apps/1528370/ss_e62aabf84f6b4b43c2029ab63a430983676467e3.1920x1080.jpg?t=1613743231,https://cdn.akamai.steamstatic.com/steam/apps/1528370/ss_3586294b14f5f54f56ced741a21b9c0c22181afc.1920x1080.jpg?t=1613743231,https://cdn.akamai.steamstatic.com/steam/apps/1528370/ss_8108bebc307917ff18fa5959107c7fbeedc44592.1920x1080.jpg?t=1613743231",
    "Slug": "chacal",
    "Meta Title": "CHACAL: Feb 19, 2021, Pernich Media and Full Overview",
    "Meta Description": "Looking for information on CHACAL? Check out the release date (Feb 19, 2021), developer insights from Pernich Media, and a complete game summary.",
    "Alt Text Image": "Official header image for CHACAL game - Steam 1528370",
    "Canonical URL": "https://gusku.site/game/chacal",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CHACAL\", \"description\": \"Looking for information on CHACAL? Check out the release date (Feb 19, 2021), developer insights from Pernich Media, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pernich Media\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pernich Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1528370/header.jpg?t=1613743231\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}