{
    "AppID": 1428630,
    "Name": "Diamond hunt",
    "Release date": "Oct 9, 2020",
    "About the game": "This is a game about collecting diamonds and avoiding traps. Sounds simple and it is simple, but do you think it's easy? This game is about collecting diamonds and making it to the end of the round while the rooms get bigger and they start to generate maze and traps as you progress further. Your job is to collect all the diamonds in order to make it to the next room and to use powerups to help you to survive. Everything is randomly generated from how the maze gets build around you to where in the room your starting position will be. There's no such a thing as remembering patterns or paths in this game. You simply have to be completely aware of your surroundings and you can't let your guard down at any point. The difficulty curve is designed to be very casual at first, but getting frustratingly difficult towards the end. Using of powerups is required to make it to the end. You need to collect diamonds in order to use them and each powerup costs 25 diamond type. There's four diamond types and two powerups on each diamond. In order to use the second powerup, the first powerup must be in use or activated. Powerups will last to the end of using time or to the end of current room, except for the purple powerups as you wont see their effect until the next room. There's also some other stats displayed on the screen to help you keep track of everything and see how well you are doing. Time shows you literally how much time you have left and it also acts like your health, sort of. You will get ten seconds more time after each finished room and loose the same amount every time you get damage from the traps. The multiplier will effect the total amount of it, say, 1,5 would be 15 seconds and so on. You can also see the total amount of diamonds in the room, the size of the room and how much of the room is maze and traps in percentage. The percentages will keep climbing up as long as they are under hundred percent. The second and the third rounds are primarily the same as the first, but with a tiny little extra challenge. You'll be chased by a monster, which forces you to move around all the time and on the third round you are forced to kill them by throwing diamonds at them. Every monster that you didn't kill will be an extra in the next room. The monsters will do a lot of damage so be careful. If you have any powerups activated, all of them will be gone. With no powerups activated the next hit will drain your diamonds to zero and after that the time will be gone as well and it's game over.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1428630/header.jpg?t=1602242577",
    "Price": 2.99,
    "Developers": "RockingDyde!",
    "Publishers": "RockingDyde!",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_be0cde267db8ea462ac4af6c1db29fa1516e1bf8.1920x1080.jpg?t=1602242577,https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_a3abcee885ce4904742b60453c3fc84b58b0a840.1920x1080.jpg?t=1602242577,https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_114653ae14c1be2fe2d4e1c549d971a21846dfd1.1920x1080.jpg?t=1602242577,https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_f24d66f8d4a327b1336482fa4972593786d553b6.1920x1080.jpg?t=1602242577,https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_0f81094e30f3b25cb30d4561e5a16e13e19c7030.1920x1080.jpg?t=1602242577,https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_7e4c5985a1302105cef035291e5228d6e3c1a217.1920x1080.jpg?t=1602242577,https://cdn.akamai.steamstatic.com/steam/apps/1428630/ss_5bb2e3f1d9b37fb1e2e14adcaf532d2270a56589.1920x1080.jpg?t=1602242577",
    "Slug": "diamond-hunt",
    "Meta Title": "Diamond hunt: Oct 9, 2020, RockingDyde! and Full Overview",
    "Meta Description": "Looking for information on Diamond hunt? Check out the release date (Oct 9, 2020), developer insights from RockingDyde!, and a complete game summary.",
    "Alt Text Image": "Official header image for Diamond hunt game - Steam 1428630",
    "Canonical URL": "https://gusku.site/game/diamond-hunt",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Diamond hunt\", \"description\": \"Looking for information on Diamond hunt? Check out the release date (Oct 9, 2020), developer insights from RockingDyde!, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 9, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"RockingDyde!\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RockingDyde!\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1428630/header.jpg?t=1602242577\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}