{
    "AppID": 505080,
    "Name": "Gakuen Club",
    "Release date": "May 9, 2017",
    "About the game": "------------------------------- ・This game's story is identical to the one for the Gakuen Club(学園CLUB～放課後のヒミツ～) smart phone app. ・The entire main story is included. (Puzzle games are not included) ・The game is fully voiced, but MC(heroine) has no voice. ------------------------------- ■ What is Gakuen Club? Gakuen Club is a school life romance game set in a famous private academy. The main cast includes popular voice actors KENN, Kensho Ono, Kosuke Toriumi, Tsubasa Yonaga, Yuichiro Umehara, and Mark Ishii whose works can be found in many anime shows and games. The game features unique and distinct characters with their own stories and outstanding voice work. ■ Story Our heroine is entering her junior year of high school when she finds out she will be suddenly transferring to the famous Kirika Academy located in the city due to her father's new job. She is quite excited about starting her new school life, but she stumbles upon a secret night club that is being operated after school hours, and gets herself roped into working the kitchen... As she grows closer to the other waitstaff of the night club, she learns of their past, and finds herself becoming more and more involved in a complicated web of human relationships and romance... ■ Character Introductions ======================== ◆Asahi Minakawa Voice Actor: KENN Heir apparent of the Minakawa Group, the powerful conglomerate that runs Kirika Academy. Accomplished in both the literary and military arts, he is a true prince. Honest and a little reckless, the older students like him for his unpredictability, while classmates and underclassmen appreciate his natural charisma. “No means no, okay?” ======================== ◆Toma Sakai Voice Actor: Kensho Ono A well-mannered and elegant young man. He generally isn't overly enthusiastic, but his frank remarks always stand out. The female guests love his aloofness and his feminist side he would sometimes show. 'You should stop worrying about me...' ======================== ◆ Saku Takizawa Voice Actor: Kosuke Toriumi A sensitive man of few words who possesses a unique nature. The females guests praise him for his good listening skills. They say the advice he offers always gives them the last bit of courage they need. “Are these feelings of mine unwelcome?” ======================== ◆Wataru Kagurazaka Voice Actor: Tsubasa Yonaga Understands his own appeal and uses it to his advantage, playing the cute cuddly puppy character for the female guests. Cunning and clever, he is generally calculating, but a privileged boy at heart, he will sometimes come off as soft. 'Hey... Do you like me?' ======================== ◆Renji Kamiki Voice Actor: Yuichiro Umehara A talented pianist, he is an avid feminist. He understands his own charms, making him a natural host. He possesses a broad perspective, seamlessly assists those in need, and treats everyone equally. 'So let's just keep this a secret between us, okay?' ======================== ◆Yuya Yamaoka Voice Actor: Mark Ishii An open-minded person who effortlessly gains the trust of those around him. Excellent at reading a room, he can skillfully adjust his energy level and personality. What's more, the dark glimpses seen behind his expression draws the female guests in, and never lets them go. 'I think you deserve a reward for being such a good learner.' ======================== ■ We recommend this game to anyone who... ・Likes going out in secret ・Wants to enjoy a fantastic voice cast ・Is a fan of popular illustrator Mero ・Loves school life romance games ----- Illustration: Mero",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/505080/header.jpg?t=1618564880",
    "Price": 29.99,
    "Developers": "OperaHouse Corporation",
    "Publishers": "Dogenzaka Lab",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_70d253bc6594e2d515cd3be3f5c0392b2cbf9f09.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_d04000f2d779b28d1486b156c8f7007474e4dd4e.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_40f86fba5e27c754e2be6a10893bba87f0690b59.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_d21b168a7f2ae702a4af042601e690429e737ea0.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_800b890a997096782f968fd35a18f00e934a0356.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_be5e877fe94acd2f07865cd725b9cd969f5e7663.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_aafbe91dd7a4cc44beab5cf258fba2c59f85137c.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_b9031bb0194fe5ab8d38c1627137aaf034900974.1920x1080.jpg?t=1618564880,https://cdn.akamai.steamstatic.com/steam/apps/505080/ss_845ec54e08feec5dd578f4877f6649714da94787.1920x1080.jpg?t=1618564880",
    "Slug": "gakuen-club",
    "Meta Title": "Gakuen Club: May 9, 2017, OperaHouse Corporation and Full...",
    "Meta Description": "Looking for information on Gakuen Club? Check out the release date (May 9, 2017), developer insights from OperaHouse Corporation, and a complete game su...",
    "Alt Text Image": "Official header image for Gakuen Club game - Steam 505080",
    "Canonical URL": "https://gusku.site/game/gakuen-club",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gakuen Club\", \"description\": \"Looking for information on Gakuen Club? Check out the release date (May 9, 2017), developer insights from OperaHouse Corporation, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 9, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"OperaHouse Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dogenzaka Lab\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/505080/header.jpg?t=1618564880\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}