{
    "AppID": 314320,
    "Name": "GamersGoMakers",
    "Release date": "Aug 8, 2014",
    "About the game": "In GamersGoMakers, you found a little company creating the first video games in history. Create your first game with only basic sound and simple graphics available in the year 1980. You´re one of the pioneers entering the rising global market for computer games. At the beginning, there are only few genres you can pick for a game to create, later you have plenty of options for more genres and sub-genres. You start in 1980 creating one of the first computer games in history Go your own way: Be a developer, designer, producer, artist or composer Choose your starting location. Each starting location has its own characteristics, which may give you a benefit of some kind in play. Optional start in 1990 or 2000, choose from 3 difficulty levels 31 genres of games to choose from Real influence on creating games (find the genre matching game parts out of 15x4 options) Intelligent game reviews give you hints about what to improve for next game in same genre Sales are influenced by trends, platform market share, competitor´s performance and many more You can create patches, addons, sequels or a new edition for a different platform Hire up to 26 employees with specialisations in genre and/or platform Rich role playing elements: level up your character and employees in 21 different skills Learning by doing: Your employees gain levels in skills by takig part in projects Improve your employees skills additionally by trainings, education programs and specializations Employees will ask for more loan, holiday, trainings or they get sick, maybe even quit for a better job at a rival´s company Become a specialized company of high renown in a certain genre, e.g. the global number 1 in Shooter games Research new gaming technologies Expand your business, rent or buy a bigger office Equip 16 different rooms like studios for sound and motioncapture, labs and marketing office Upgrade your rooms several times as time advances Compete within a global simulated games market - hundreds of simulated competitors release games Win awards for game of the month/game of the year Consoles and platforms retire from the market...except you create a game hit extending the platform´s lifetime Buy out your rival competitors: Let them work for you or destroy them Win achievements and beat the global highscore Become a publisher Visit conventions or create your own convention Pimp your games with 'real' actors for voice acting, soundtracks and motion capturing! Pay up to 30% tax per annum ...and many more features for a very deep gaming experience! If you are not sure whether you can run the game or not or you want to try out the game before buying it; there is a free downloadable demo available on the website here .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/314320/header.jpg?t=1447362716",
    "Price": 8.99,
    "Developers": "gnifrebel Games UG",
    "Publishers": "gnifrebel Games UG",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_aa66ecc71de07223e001996e705ac06fd4c73ca5.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_bc3375ba5a8eefae793614f739a2803d118b4001.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_e1d305c7b95ce76712437891f8a62ecf2f12d2d4.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_b0edfd1913e1bc4ccb2db147f6258a9ad22edb85.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_4a20998a12b90421dae383ffc05fdb01865f3a5e.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_028c32f4b7c199a4265c6c279b22e025581eb38a.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_4ff0c533384b064de03954d05ef6d2cbcb389f0f.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_2dea45876ff712a051510caf83d06d14a0375f64.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_7aa102905d6049aecb59d691add3fabb7016f7de.1920x1080.jpg?t=1447362716,https://cdn.akamai.steamstatic.com/steam/apps/314320/ss_78cf3e159ff16c5dbb401ca08d5e50d19669dfd9.1920x1080.jpg?t=1447362716",
    "Slug": "gamersgomakers",
    "Meta Title": "GamersGoMakers: Aug 8, 2014, gnifrebel Games UG and Full ...",
    "Meta Description": "Looking for information on GamersGoMakers? Check out the release date (Aug 8, 2014), developer insights from gnifrebel Games UG, and a complete game sum...",
    "Alt Text Image": "Official header image for GamersGoMakers game - Steam 314320",
    "Canonical URL": "https://gusku.site/game/gamersgomakers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GamersGoMakers\", \"description\": \"Looking for information on GamersGoMakers? Check out the release date (Aug 8, 2014), developer insights from gnifrebel Games UG, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 8, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"gnifrebel Games UG\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"gnifrebel Games UG\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/314320/header.jpg?t=1447362716\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}