{
    "AppID": 1988630,
    "Name": "佩尔霍宁",
    "Release date": "Jun 7, 2022",
    "About the game": "Introduction to playing method This is an adventure game with micro terror, shooting and puzzle solving. After a prologue that may be a little long, players will operate LXNS to explore the underground world called 'perhonen'. In the game, you may encounter many extraordinary things that you can't understand with common sense. And seemingly unstoppable enemies far beyond their own size. But fortunately, you are not alone. You have weapons and you can fight back. Although the protagonist 'LXNS' is just a weak girl, she can't even control her weapons to shoot perfectly. In this extremely cruel situation, fight with those 'guys' and discover the secrets hidden here. game features 1. Narrative mode: this game uses the traditional AVG mode to tell wonderful stories. The plot narrative adopts both linear narrative and nonlinear narrative, and integrates these elements into the decrypted plot. 2. Backpack system: including props collected in various ways, whether weapons, props or just unlocking the notes of the forward direction. 3. Scene interaction: almost all objects in the scene (whether buildings or objects) can interact, and the acquisition of some key props also depends strictly on this. 4. Shooting mode: the protagonist 'LXNS' is just a weak girl, so she can't control her weapons well and attack the enemy behind her. Moving and continuous shooting will make it more difficult for her to hit the enemy. Therefore, it may be a good choice to stop facing the enemy. 5. Cooperation mode: after completing the main plot, you can play additional content in the 'assault' module of the main menu. Here, you are allowed to cooperate with another player in the game (teammate damage is turned on, but you can press e close to your teammate to revive he/her). game duration Generally speaking, the duration of this game is about 2 hours. plot summary Fudge is my sister who once stayed at my house for a while. She invited me to her house a few days ago. Unlike my family, which runs a coffee shop, her family has a lot of money - I can't say how much, but I only know a lot. She left me a gift on the day she went back, but this thing... Well, I'll send it back to her when I go today. I can't keep it. It was called 'perhonen', but when I approached my destination, something unexpected happened. Introduction to people LXNS The protagonist of the game. A lovely girl with white hair, cautious but unexpectedly bold. She runs a coffee shop called 'snow cafe', which has all the memories of soft candy and is what she values most. operation method Move: WASD Identification / investigation: e Shooting: left mouse button Replace clip: R Switch weapons: X Open / close backpack: M Walking: shift about the author BiliBili: 莉萝爱萝莉",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1988630/header.jpg?t=1654668822",
    "Price": 0.0,
    "Developers": "liluoailuoli",
    "Publishers": "liluoailuoli",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1988630/ss_29c394da4df6ed414fb2148a3bd03ba65cb9eb6d.1920x1080.jpg?t=1654668822,https://cdn.akamai.steamstatic.com/steam/apps/1988630/ss_b3d4df39a8def4373f903364f7f36a3814924047.1920x1080.jpg?t=1654668822,https://cdn.akamai.steamstatic.com/steam/apps/1988630/ss_f48952ba4e8f3318db561cd06b9c99e687569be3.1920x1080.jpg?t=1654668822,https://cdn.akamai.steamstatic.com/steam/apps/1988630/ss_24dff42254f8eaf6aad418509c56ce46cd1b039f.1920x1080.jpg?t=1654668822,https://cdn.akamai.steamstatic.com/steam/apps/1988630/ss_8da889d9bdaaa59874a43244e39dc5548d1311ef.1920x1080.jpg?t=1654668822",
    "Slug": "",
    "Meta Title": "佩尔霍宁: Jun 7, 2022, liluoailuoli and Full Overview",
    "Meta Description": "Looking for information on 佩尔霍宁? Check out the release date (Jun 7, 2022), developer insights from liluoailuoli, and a complete game summary.",
    "Alt Text Image": "Official header image for 佩尔霍宁 game - Steam 1988630",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4f69\\u5c14\\u970d\\u5b81\", \"description\": \"Looking for information on \\u4f69\\u5c14\\u970d\\u5b81? Check out the release date (Jun 7, 2022), developer insights from liluoailuoli, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"liluoailuoli\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"liluoailuoli\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1988630/header.jpg?t=1654668822\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}