{
    "AppID": 1001040,
    "Name": "Glorious Companions",
    "Release date": "Jun 4, 2019",
    "About the game": "Glorious Companions is a turn based tactical RPG set in an original fantasy world of Navaroth where you craft your own journey as a leader of a mercenary company. You’ll spend most of your time training and equipping your companions to become an unstoppable force on the battlefield, ready to take on wild beasts just as well as war parties. We’ve come up with this idea back in 2009, and throughout many iterations and attempts it’s flourished into what it is currently. Keep in mind that the current version is still far from our goal and the game is under heavy development as you can see in our news section. The Valrenay were the last to join the war that’s been consuming the islands for centuries. Up until recently they only kept to themselves, developing their technology in peace. Now they’re fighting for their piece of the cake, fielding troops equipped with firearms and steam-powered body enhancements. Scarres were getting the short end of the stick for quite some time, until the new generation of Shamans was born. Under their leadership they began to take back lands that were once theirs. Scarres control the dangerous Blood Magics to wreck havoc on the battlefield. Their units get more powerful as their allies get withered or die near them due to their unique faction rule called ' Vengeance '. Custom and gritty combat system: no one is invincible as a single well-aimed strike can take out a careless warrior. No battle is truly over until it’s over: eliminate the enemy captain to win the battle, but be careful as it works the other way around too! Tried and proven formula: the world of Navaroth has its roots in an original pen-and-paper RPG system featuring a science based magic system. Pick your side: become an ally to the vengeful Scarres or join the ranks of the wise Valrenay militia. More factions will be revealed during the development. Take care of your men: keep their morale high by serving them luxury food and alcohol, train them at special facilities when they gather enough experience and crucially - don’t let them bleed out after a tough battle. No two soldiers are ever the same: play to your units natural predispositions, train and equip them to your liking. New world on each playthrough: the continent and its political climate are procedurally generated at the beginning of every journey. We've recently released a pretty big update that added Fog of War to battles and addressed a lot of core gameplay, balance and progression issues. You can read more on that in our Announcements section. We’re a small indie developer from Poland and we’re working hard to realize our dream project. We specialize in mechanics-heavy games for the PC, we only work on games that we want to play ourselves, and we’re all PC gamers at heart. With Glorious Companions we’re inspired by both video game classics such as Mount &amp; Blade and Heroes of Might and Magic series, but also by an array of miniature wargames and pen-and-paper RPGs that we love to play in our free time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1001040/header.jpg?t=1631721670",
    "Price": 19.99,
    "Developers": "Ancient Forge Studio",
    "Publishers": "Ancient Forge Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_831708a34e481afedb312e3c0e1824bf0fc332aa.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_8db4adbcc7142472c66fa9a7f27648e0b0933210.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_9d0e15458a548ce61d0bc7c5e19ee0f9e4a84ace.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_56166ab129e8725535e6cd754a6f94f82371d626.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_aa966fa711838d9a1868d8f45a961cde2a868d93.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_7ac17f93c98f4fa06966b3e81df9f808abe9b0db.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_269ae30ea80cbd9649b851c34e7e69ddc2ade63d.1920x1080.jpg?t=1631721670,https://cdn.akamai.steamstatic.com/steam/apps/1001040/ss_611c13e5cc1dfb71610d90ee05da599252948b07.1920x1080.jpg?t=1631721670",
    "Slug": "glorious-companions",
    "Meta Title": "Glorious Companions: Jun 4, 2019, Ancient Forge Studio an...",
    "Meta Description": "Looking for information on Glorious Companions? Check out the release date (Jun 4, 2019), developer insights from Ancient Forge Studio, and a complete g...",
    "Alt Text Image": "Official header image for Glorious Companions game - Steam 1001040",
    "Canonical URL": "https://gusku.site/game/glorious-companions",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Glorious Companions\", \"description\": \"Looking for information on Glorious Companions? Check out the release date (Jun 4, 2019), developer insights from Ancient Forge Studio, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ancient Forge Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ancient Forge Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1001040/header.jpg?t=1631721670\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}