{
    "AppID": 1011290,
    "Name": "Hotel R'n'R",
    "Release date": "May 28, 2020",
    "About the game": "Full Release v1.0 Out now! Hotel R’n’R is the gonzo VR rockstar simulator that encourages bad behaviour. Sell your soul to The Devil, smash up hotels and become Infamous. Pressure from hotel staff and your own limp wrists are against you, but with over 36 weapons, and a World Tour ahead of you, it’s time to get creative. Each hotel is a unique playground of physics-based demolition , with time to explore and plan your strategy before lighting the fireworks and trying to keep the Manager out. With a hellish pawn shop of weirdly satisfying weapons – including Wet Fish, Hot Glue, Cattle Prods, C4 and Sub-Machine Guns – and a stack of Challenges to appease The Devil, becoming the most Infamous takes brains as well as looks. Get the band together for Party Setlists (up to 5 people Pass and Play) or try out ideas at your own pace in Sandbox mode. Hotel R’n’R is a satirical journey of selling your soul and then trying to take it back; along the way there’s no shortage of luxury hotels, sarcastic maids, ragdoll physics, rock’n’roll cliches and eccentric mayhem. Featuring: Extensive single player - The World Tour features 6 hotel suites that expand in scale and ambition as you gain Infamy, each containing unique features such as robot vacuums, antique cannons, bowling alleys and even a wrecking ball! Local pass and play or solo leaderboards - 10 Setlists makeup a varied selection of game types, from skill-based challenges to all out O.P. destruction to our own version of Prop Hunt “PropSquad”. All with Local and Global Leaderboards to compete against the world. 36 Weapons, Enhancers and Modifiers - Combine items to create superweapons, complete Weapon Challenges to make items more powerful or unlock unique features that dramatically change the dynamic of gameplay. A cast of supporting characters - Each is fully voiced, sarcastic as hell and ready to be slapped or simply disappointed by you. Fully rigged player character - Totally realistic player setup with 3 fingers, wiry arms and missing teeth! Play dress up, with a multitude of different looks, poorly done tattoos and arrogant expressions for him or for her. Music by actual failed musicians! - Scuzzy guitars, 80’s synths and some booming 808 kicks. All played by unprofessional musicians who can barely string a sentence together, nevermind a riff. Are you up to it? I just need you to sign here.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1011290/header.jpg?t=1603469419",
    "Price": 19.99,
    "Developers": "Wolf & Wood Interactive Ltd",
    "Publishers": "Wolf & Wood Interactive Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1011290/ss_b584486f087a825db7e7957e38b668dec135f313.1920x1080.jpg?t=1603469419,https://cdn.akamai.steamstatic.com/steam/apps/1011290/ss_20838c57e99cdfc69633864bce823963c1bfe021.1920x1080.jpg?t=1603469419,https://cdn.akamai.steamstatic.com/steam/apps/1011290/ss_8276863fd2d62cee41af9fedc15db9357a181d1a.1920x1080.jpg?t=1603469419,https://cdn.akamai.steamstatic.com/steam/apps/1011290/ss_0169ac2445d82a04064c8618fbfe9765d2050faa.1920x1080.jpg?t=1603469419,https://cdn.akamai.steamstatic.com/steam/apps/1011290/ss_fcfd5aedc92369c71108a793e6652cb660b64d62.1920x1080.jpg?t=1603469419",
    "Slug": "hotel-r-n-r",
    "Meta Title": "Hotel R'n'R: May 28, 2020, Wolf & Wood Interactive Ltd an...",
    "Meta Description": "Looking for information on Hotel R'n'R? Check out the release date (May 28, 2020), developer insights from Wolf & Wood Interactive Ltd, and a complete g...",
    "Alt Text Image": "Official header image for Hotel R'n'R game - Steam 1011290",
    "Canonical URL": "https://gusku.site/game/hotel-r-n-r",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hotel R'n'R\", \"description\": \"Looking for information on Hotel R'n'R? Check out the release date (May 28, 2020), developer insights from Wolf & Wood Interactive Ltd, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wolf & Wood Interactive Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Wolf & Wood Interactive Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1011290/header.jpg?t=1603469419\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}