{
    "AppID": 659040,
    "Name": "Intrusion Protocol",
    "Release date": "Jul 20, 2017",
    "About the game": "Intrusion Protocol is a classic challenging retro 2-D platformer. Play as a computer virus tasked with infiltrating an enemy network to retrieve mission-critical data. As you find the data you will uncover a story that reveals the secrets of your mysterious purpose. Your only health bar is the clock, and the enemy defenses will quickly drain your precious time. Will you be able to overcome the defenses and access the data? Or will you find yourself out of time? Be quick. Be careful. There's a reason this is at the top of this page. We want this experience to be a tough one. Players will crash and burn countless times until they figure out how to reach the end of each level in time. Though the game will bring players seemingly endless death, Intrusion Protocol is designed from the ground up to give the player the drive to keep going until they reach the data. If you think you have what it takes, show our unforgiving levels who's boss! Some games are difficult because they are impossible to control. Not Intrusion Protocol. The controls are designed with the controller in mind and focus on closely connecting the player to their gaming experience. We have created a simple, tight, responsive system to make the player feel like they are in complete control. Considering the intense difficulty, it is crucial that the game has solid controls so the player doesn't feel like faulty mechanics were the reason for their (many) deaths. The levels in Intrusion Protocol are certainly designed to provide a challenge. Moving enemies will quickly drain your time, and stationary obstacles will immediately send you back to your last checkpoint. Though it will be difficult for the average gamer, there are tricks and specific timings that will allow the true masters of the game to speedrun with blazing fast times. Everything in Intrusion Protocol is designed to keep the player moving while not overloading the senses. The environment itself is in constant motion. The tail is only active when moving, and allows players to savor moments when they hit that perfect arc. These constant motion visuals immerse the player, and give them the drive to keep moving forward. Why were you created? What is your destiny? Answers to these questions will unfold as the player completes levels. At the end of each level the player will see dialogue between two of the creators of Intrusion Protocol. Hearing this discussion will shed light on the program's purpose.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/659040/header.jpg?t=1521477341",
    "Price": 2.99,
    "Developers": "Somber Dawn Studios",
    "Publishers": "Somber Dawn Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_e27f0bac9c46cfdaac411a2a133d416601bf5190.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_8e4e0c81cc4d558e16d1ebf71e56a2fe08b3effd.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_ae2622f864de3cd23af2ae862574adc33a569a5b.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_fa91781ec159c784b17afac0530717a73d356178.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_b7dd37c9ca6c7dc7f4e7e97e389c9d8de83408e8.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_99d6e7008b84d65e732406389f1223a00b91ed86.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_3a48a9e7e02980523878f583fb7f496316e22431.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_be2e4b0f5ab0657cc5734d7a1d70cc1c531c9b3f.1920x1080.jpg?t=1521477341,https://cdn.akamai.steamstatic.com/steam/apps/659040/ss_aa9b868551ce8698c5e2bdb4d27e2b4654a3128d.1920x1080.jpg?t=1521477341",
    "Slug": "intrusion-protocol",
    "Meta Title": "Intrusion Protocol: Jul 20, 2017, Somber Dawn Studios and...",
    "Meta Description": "Looking for information on Intrusion Protocol? Check out the release date (Jul 20, 2017), developer insights from Somber Dawn Studios, and a complete ga...",
    "Alt Text Image": "Official header image for Intrusion Protocol game - Steam 659040",
    "Canonical URL": "https://gusku.site/game/intrusion-protocol",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Intrusion Protocol\", \"description\": \"Looking for information on Intrusion Protocol? Check out the release date (Jul 20, 2017), developer insights from Somber Dawn Studios, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 20, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Somber Dawn Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Somber Dawn Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/659040/header.jpg?t=1521477341\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}