{
    "AppID": 1753410,
    "Name": "King of Kinks",
    "Release date": "May 10, 2022",
    "About the game": "King of Kinks is the latest quick pace fantasy RPG that will have you coming back for more. With a perfect balance of relaxing gameplay and strategy-based squad building, you’ll be getting the best of both worlds. King of Kinks sets you out on a mission to reclaim the throne of the Kingdom of Clouds while recruiting each and every merciless beauty that comes across your way in this expansive fantasy world. You will have your pick of hotties, from noble kink queens to thirsty temptresses. You might also stumble upon inhuman beauties, ready to suck you dry - whether in a nice or naughty way, that’s all up to you. Beyond the sex, King of Kinks is also a compelling and engaging RPG. The auto quick-speed combat and strategic elements work to give players the best experience on the market. For bonus points, rewards work on an AFK basis: play the game, go do your thing, come back and collect the rewards that piled up while you were offline. Through various game modes, limited events, and the good ol luck of the draw in the Gacha, you’ll be ready to take over the kingdom in no time. Build up your team of hotties! Heroes will battle for you automatically, you can collect offline rewards just by tapping the AFK chest when you log in next. You can always jump right back into the adventure, with new content being regularly updated! Progress through the campaign, see how long you can last, and climb to the top of the ranks! Enjoy automated and double-speed battles that allow you to win big with just a few taps! There are more than a thousand combat stages to take part in. Figure out the perfect combos &amp; skills and get yourself an unbeatable squad. Strategize your squads while keeping each girl’s unique fighting style in mind! The active and passive skills of the girls can be crucial in battles. Evolve your heroes to unlock bonds to strengthen your squad! Meet lots of beauties and have kinky sex with each and every one of them! Summon hot girls and evolve them to unlock their uncensored H-scenes! Get spicy private messages from the girls you meet during your adventure via the Chat functionality! Fulfill their desires and unlock their secret scenes. Unlock and level up goddesses and they will aid you in your battles! By seducing goddesses you can raise their Intimacy and unlock three videos for each of them. Plus, they are powerful allies that will help you overcome the difficult stages.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1753410/header.jpg?t=1657801583",
    "Price": 0.0,
    "Developers": "DPH Studio",
    "Publishers": "Nutaku Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1753410/ss_8f031bae64d91214bafcd9d21c1e71d5ffb806d0.1920x1080.jpg?t=1657801583,https://cdn.akamai.steamstatic.com/steam/apps/1753410/ss_8c2f41f6a8492568a6bdbe12434f0acef6579037.1920x1080.jpg?t=1657801583,https://cdn.akamai.steamstatic.com/steam/apps/1753410/ss_9c8ab649cde0f3616b3f526997043a2cf0d3accc.1920x1080.jpg?t=1657801583,https://cdn.akamai.steamstatic.com/steam/apps/1753410/ss_84b6874bc72b699261288c8ad107d688af7e606b.1920x1080.jpg?t=1657801583,https://cdn.akamai.steamstatic.com/steam/apps/1753410/ss_4cb117ebaae9a1771956b168a4ba99f3e109e3e5.1920x1080.jpg?t=1657801583",
    "Slug": "king-of-kinks",
    "Meta Title": "King of Kinks: May 10, 2022, DPH Studio and Full Overview",
    "Meta Description": "Looking for information on King of Kinks? Check out the release date (May 10, 2022), developer insights from DPH Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for King of Kinks game - Steam 1753410",
    "Canonical URL": "https://gusku.site/game/king-of-kinks",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"King of Kinks\", \"description\": \"Looking for information on King of Kinks? Check out the release date (May 10, 2022), developer insights from DPH Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"DPH Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nutaku Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1753410/header.jpg?t=1657801583\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}