{
    "AppID": 578870,
    "Name": "MegaGlest",
    "Release date": "Mar 31, 2017",
    "About the game": "MegaGlest is a classic 3d real time strategy (RTS) game, where you control the armies of one of seven different factions: Tech, Magic, Egypt, Indians, Norsemen, Persian or Romans. Gameplay: It seems to start slow, but this impression changes very quickly when the first fights start. You have to manage all things at once! While you fight you have to control your workers to build up your city, send scouts to new places and give orders to newly produced units. This way, game play is a mix of fight micromanagement, strategy and general unit management. In some more advanced games you typically have to control more than 100 units and in big games this can go up to more than 300 for each player. This game is meant to be played as an RTS game and has no special focus on storylines. Game Content: The game itself already has a lot of content and you can play hundreds of hours. More than 80 maps, 19 environment tilesets and 7 different factions with unique gameplay wait for you and if this is not enough you can download more for free in the included mod manager. If this is still not enough content for you, make your own! Making new content for MegaGlest is very easy and especially creating maps is very simple with the included map editor. Computer players: MegaGlest has a very strong and aggressive AI with random behaviour! Its strength can be controlled in many steps which allows you to setup every game as a challenge! So when you setup games, especially as a beginner, be careful and start small or you can quickly get overrun. With patience and training, you will gain a much better understanding of game mechanics and be able to stand the strongest computer players - for a while. Cross platform multiplayer From our experience the biggest fun is to play co-op multi-player games, human vs. computer controlled players. The AI can be made so strong that even very advanced players always have a fun challenge! But you can also play human vs. human or whatever you want with up to 8 players. Warning: You need a stable internet connection to play this game online, as it does not allow you to rejoin a game at the current state of development. Please consider to buy this game on Steam or to donate so we can continue to pay game servers and hosting!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/578870/header.jpg?t=1572396304",
    "Price": 0.99,
    "Developers": "SoftCoder",
    "Publishers": "Mega Glest Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/578870/ss_e75ba16f3b6912a6a481788f9ae6b62a50058192.1920x1080.jpg?t=1572396304,https://cdn.akamai.steamstatic.com/steam/apps/578870/ss_0e72713eb2257adcf0d742f071f3ae24ddfa3080.1920x1080.jpg?t=1572396304,https://cdn.akamai.steamstatic.com/steam/apps/578870/ss_559654232f9bbbe054b3b6b296e186a6fc43591f.1920x1080.jpg?t=1572396304,https://cdn.akamai.steamstatic.com/steam/apps/578870/ss_839fcdf12e0f3ab57c273c82aa9ce0ba8da280b1.1920x1080.jpg?t=1572396304,https://cdn.akamai.steamstatic.com/steam/apps/578870/ss_08e517beb24f613aca238328ef31909eab8ad328.1920x1080.jpg?t=1572396304",
    "Slug": "megaglest",
    "Meta Title": "MegaGlest: Mar 31, 2017, SoftCoder and Full Overview",
    "Meta Description": "Looking for information on MegaGlest? Check out the release date (Mar 31, 2017), developer insights from SoftCoder, and a complete game summary.",
    "Alt Text Image": "Official header image for MegaGlest game - Steam 578870",
    "Canonical URL": "https://gusku.site/game/megaglest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"MegaGlest\", \"description\": \"Looking for information on MegaGlest? Check out the release date (Mar 31, 2017), developer insights from SoftCoder, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"SoftCoder\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mega Glest Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/578870/header.jpg?t=1572396304\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}