{
    "AppID": 973600,
    "Name": "Movavi Video Suite 18 - Video Making Software - Edit, Convert, Capture Screen, and more",
    "Release date": "Dec 2, 2018",
    "About the game": "Movavi Video Suite has everything you need for video editing in a single program. This set of first-rate tools will help you turn your gameplay footage into engaging Let’s Play videos, quickly convert them to any popular media format, capture program usage, play back any video or audio, transfer data to optical disks, and more. Highlights Compact multi-track timeline: manage and re-order tracks the way you want Fast Track HD acceleration: work with large Full HD and 4K files without lags Automatic video creation: add your files and let the Montage Wizard work its magic Your own intros and outros: edit clips from the library or create them from scratch Portable projects: save and move your projects to other devices AMD acceleration and NVIDIA HD decoders: process even large videos two times faster New built-in effects: quickly enhance videos before conversion Convenient recording scheduler: don’t miss any live streams Make video editing your favorite playground Use your creativity to make the most engaging vlog ever – you have everything you need to do it. Manage your footage on a convenient multi-track timeline and don’t worry about large files – the program is perfect for working with even Full HD and 4K videos. Trim, rotate and enhance clips, add special effects like Chroma Key and Object Animation, insert stickers and titles. Make your own intro from anything you can find in the program: backgrounds, titles, stickers, callouts, and even music – then save the clip and use it in every video you create. Convert files at the speed of light Make sure your gameplay videos can be seen on any platform or device – thanks to 180+ supported formats and 200+ available mobile presets. Compress large videos to save disk space and prepare them for sharing online at YouTube, Vimeo, and other video hosting services. SuperSpeed mode guarantees lossless conversion in no time, plus you can use other types of hardware acceleration: Intel HD Graphics, AMD, NVIDIA NVENC and CUDA. Perfect your files before the conversion with the built-in editor, and you’re all set. Record live streams at the best quality Capture any activity on your desktop: live streaming, video chats, or program usage. Overlay a webcam video and you’ll get a real live screencast. The advanced scheduler ensures you miss any live streams – create multiple recording tasks and the program will do the rest, and even remind you to open the required window at the right time. Even more tools Easily share captured or edited videos via YouTube or Google Drive Automate video-making with the Montage Wizard: just add the footage and enjoy the result Split videos into multiple clips with one click Watch videos and listen to your favourite music via a handy mediaplayer Transfer data to CD, DVD, or Blu-ray Capture video from any external device – webcam, TV tuner, or VHS",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/973600/header.jpg?t=1647946009",
    "Price": 94.99,
    "Developers": "Movavi Software",
    "Publishers": "Movavi Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_ec4a24a8c18fc818b66900121a0dcc07c0721aab.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_4087695b5839a911849a29f229531b65e31020ec.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_b85ae5d4c27343b96744217cfb828b23bd1cc7aa.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_673f6aa6bbf1999d4c7382b56dc06109de15ed86.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_999029dd4dedbbf70f45011c175d9bc1437e86ec.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_df6fed475ca6af0df09673b9739944116e5afcef.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_9a4d4e11f64f69cefc0abccf4f1952efef1e2092.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_b44cf6995706265384433b1e6612dcc23088020c.1920x1080.jpg?t=1647946009,https://cdn.akamai.steamstatic.com/steam/apps/973600/ss_5d1c98aec9c0af296bf6dcadf262bb6fda88cd02.1920x1080.jpg?t=1647946009",
    "Slug": "movavi-video-suite-18-video-making-software-edit-convert-capture-screen-and-more",
    "Meta Title": "Movavi Video Suite 18 - Video Making Software - Edit, Con...",
    "Meta Description": "Looking for information on Movavi Video Suite 18 - Video Making Software - Edit, Convert, Capture Screen, and more? Check out the release date (Dec 2, 2...",
    "Alt Text Image": "Official header image for Movavi Video Suite 18 - Video Making Software - Edit, Convert, Capture Screen, and more game - Steam 973600",
    "Canonical URL": "https://gusku.site/game/movavi-video-suite-18-video-making-software-edit-convert-capture-screen-and-more",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Movavi Video Suite 18 - Video Making Software - Edit, Convert, Capture Screen, and more\", \"description\": \"Looking for information on Movavi Video Suite 18 - Video Making Software - Edit, Convert, Capture Screen, and more? Check out the release date (Dec 2, 2...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Movavi Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Movavi Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/973600/header.jpg?t=1647946009\", \"offers\": {\"@type\": \"Offer\", \"price\": 94.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}