{
    "AppID": 467680,
    "Name": "Negligee: Love Stories",
    "Release date": "Sep 14, 2018",
    "About the game": "A series of four stories following the characters Karen, Charlotte, Sophie and Jasmin. Following their early lives and the decisions they had to make, whether to follow their heart or their head and how that impacts their lives. Karen's Awakening In the first story we follow Karen as the games protagonist. After living in an emotionally abusive marriage she turns to a new friend for comfort and gets more than she bargained for, but before long her secret affair helps her to realise that she should leave her husband and start over. How will this story play out and the eventual confrontation with her husband. You decide in this visual novel tale with multiple endings. Jasmin's Stripping In the second story we follow Jasmin as the games protagonist. Jasmin is unsure of her place in the world, working as a Stripper she is unsure if she should continue within the world of adult entertainment or take stock of her life and move on. Before she can make a decision though her boss offers her work that sounds to good to be true, will these new offers open her eyes to a better life or help her to finally move on, you will decide in this story with multiple endings. Charlotte's First Love In the third story we follow Charlotte as the games protagonist. Charlotte has always been a bit timid, but on her eighteenth birthday things suddenly become clear as she realises she has been hiding behind the expectations others have had on her and been afraid to live her own life. In this story of young love Charlotte finally accepts her own feelings for her best friend and determines to make her life her own in this yuri visual novel story with multiple endings. Sophie's Temptation In the fourth story we follow Sophie as the games protagonist. Sophie lives the life of a young carefree girl. She decided long ago to never say no and to follow her instincts no matter where they may lead. So far that has meant a life of frivolous enjoyment of her baser needs, enjoying men and women as she pleases. But will her choices have a price to pay and how long can she do as she wishes without consequences. You will find out in this visual novel story with multiple endings. Features A cute and fun set of well written story-lines. Multiple routes and choices that affect the endings. High quality characters, backgrounds and CG Scenes. Het &amp; Yuri Scenes based on the characters of each story. 1080p window &amp; full screen options. Multiple save slots and full VN functions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/467680/header.jpg?t=1629216851",
    "Price": 14.99,
    "Developers": "Dharker Studio",
    "Publishers": "Dharker Studios Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/467680/ss_1f75dbf73f11a30249004810b281bba848ef4fa8.1920x1080.jpg?t=1629216851,https://cdn.akamai.steamstatic.com/steam/apps/467680/ss_4b1aa56dd0408b5a6c52df66e620dea94efe15a6.1920x1080.jpg?t=1629216851,https://cdn.akamai.steamstatic.com/steam/apps/467680/ss_62a722cad5219deac84191a0153239e9726f22a3.1920x1080.jpg?t=1629216851,https://cdn.akamai.steamstatic.com/steam/apps/467680/ss_90dc78a480c23500c33d9b32b2e399d64b6b2fa5.1920x1080.jpg?t=1629216851,https://cdn.akamai.steamstatic.com/steam/apps/467680/ss_a0494a0588d776660e4d29f42233b5eeb9a36cf2.1920x1080.jpg?t=1629216851,https://cdn.akamai.steamstatic.com/steam/apps/467680/ss_672339363a436f9acb7865854177cb9e89f11faf.1920x1080.jpg?t=1629216851",
    "Slug": "negligee-love-stories",
    "Meta Title": "Negligee: Love Stories: Sep 14, 2018, Dharker Studio and ...",
    "Meta Description": "Looking for information on Negligee: Love Stories? Check out the release date (Sep 14, 2018), developer insights from Dharker Studio, and a complete gam...",
    "Alt Text Image": "Official header image for Negligee: Love Stories game - Steam 467680",
    "Canonical URL": "https://gusku.site/game/negligee-love-stories",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Negligee: Love Stories\", \"description\": \"Looking for information on Negligee: Love Stories? Check out the release date (Sep 14, 2018), developer insights from Dharker Studio, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dharker Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dharker Studios Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/467680/header.jpg?t=1629216851\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}