{
    "AppID": 400080,
    "Name": "Out of Space",
    "Release date": "Feb 26, 2020",
    "About the game": "Out of Space is a LOCAL and ONLINE co-op multiplayer game about living together in a house in space. You and your friends are about to move into a house in space, where you will have to deal with a deadly alien infestation and face the challenges of building a sustainable spaceship, all to make your new place feel as cozy as home! Each match starts in a procedurally generated spaceship house that will demand your best planning and teamwork skills to become clean and comfy. You and your friends will need to generate resources, recycle trash and alien goo, buy and build new technologies, and take care of one another, if you ever want to call home the mess that you got into. As a COUCH-FUN game, Out of Space has short matches and is easy for everyone to grab a controller and play. At the same time also as a STRATEGY game, it will require short and long-term decisions, expanding and conquering new rooms and building technology to automate tasks. Buy, build and place your new technology, while keeping your systems efficient and sustainable. Power up your spaceship by recycling alien goo and producing energy batteries. Harvest and take care of your fruitful gardens to keep everyone fed. Clean rooms with mops and water, while containing the deadly alien menace. Take a nap on your sofa, while your friends desperately claim for help. Automate cleaning and harvesting with the help of robots. Adopt Dogs, they will love you for it and help you in any way they can! Procedural spaceship generator: different challenge everytime you play. Missions to guide the player's progression that never leave out what couch-fun is about. Unlock new content when completing achievements. Play single-player, local multiplayer and online multiplayer with your friends. No weapons of any kind. Take your mop and sweep your way out of danger. Are you up for the challenge? Living with roommates was never easy, but now you’ll do it in outer space! Behold Studios is the studio behind Knights of Pen &amp; Paper, Chroma Squad and Galaxy of Pen &amp; Paper. With a big and strong fan base, we're developing this game with the help of the community, openly sharing builds, milestones and carefully listening to feedback and improving the overall experience of the game. Please join our official Discord Server to talk to us and help us improve this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/400080/header.jpg?t=1656085340",
    "Price": 14.99,
    "Developers": "Behold Studios",
    "Publishers": "Behold Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_44aa2cfb9fc3c1763974c073c207ec7197965f2a.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_479669183e84754a88cf1dd24d0db878f8f2de79.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_6cad38b6a078d72ae59b4284aefa072a2f656f3b.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_9a2774145fcc202f0dbb899a8707da0543ce7a4e.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_2f18644ac533a0612d41913cbdb3202b8632cafd.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_0ad3afd75fffa2ebe986abb9a671a7fb46f00321.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_405a89b46724d081fa421a55ed82d8ed5dba8ade.1920x1080.jpg?t=1656085340,https://cdn.akamai.steamstatic.com/steam/apps/400080/ss_8dc7c472b8aa920f643823c18ad5e1e6fd158653.1920x1080.jpg?t=1656085340",
    "Slug": "out-of-space",
    "Meta Title": "Out of Space: Feb 26, 2020, Behold Studios and Full Overview",
    "Meta Description": "Looking for information on Out of Space? Check out the release date (Feb 26, 2020), developer insights from Behold Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Out of Space game - Steam 400080",
    "Canonical URL": "https://gusku.site/game/out-of-space",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Out of Space\", \"description\": \"Looking for information on Out of Space? Check out the release date (Feb 26, 2020), developer insights from Behold Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Behold Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Behold Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/400080/header.jpg?t=1656085340\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}