{
    "AppID": 873850,
    "Name": "PASSAGE",
    "Release date": "Nov 14, 2018",
    "About the game": "Nothing is as it seems. Danger awaits around every corner... and on every wall. Welcome To PASSAGE™, a maze-like shooter game that's always changing. Manage your weapons and items to maximize the carnage. Play it safe or throw caution to the acid pit. PASSAGE™ puts the power in your hands... CORE GAMEPLAY PASSAGE™ is a deceptively simple game where the objective of each level is to find the key and make your way to the exit door. Sounds easy right? WRONG . It's damn hard but you'll find weapons, ammo, power-ups, and treasure that will help make you into an incredible badass that will go on and save those girls. What girls you ask? Well the twin virgins that were taken to be sacrificed, silly! KEY FEATURES Gritty 16-bit graphics and sounds for an authentic arcade-era feel. You can almost smell the sweat and feel the carpet underneath your feet! And whoa, check out those those scanlines! Roguelike action means PASSAGE™ is never the same game twice. Everything from weapons, power-ups, and warp doors all spawn randomly..but fairly . Your next run could be the one! Insanely fast gameplay : wall jump, wall grab, dodge roll, or even hitch a ride on a chain blade.. they're all excellent ways to get around in PASSAGE™! Stay amped with a pulse pounding soundtrack featuring the music of TOBACCO . If you watch HBO's Silicon Valley then you know him already.. his music graces the opening of every episode! Depending on your skill level, a single run can last for hours or just minutes! PASSAGE™ was designed for maximum replayability (and FUN! ) in mind. Blast your way through a maze-like world with 5 stages of ever increasing brutality . Watch out for the spikes, the blades, and over 20 different enemy types! There is no shortage of spectacular ways to die in PASSAGE™! Seven deadly weapons : Axe, Hand Cannon, Machine Gun, Shotgun, Grenade Launcher, Chaingun, and Lightning Gun all have a very distinct feel and round out a very formidable arsenal. 9 magical power-ups (and counting) that you collect and use when you're ready. For example: activate the latest power-up, 'Night Vision' , to see all the nasties hiding in every nook and cranny! It even reveals obscured treasure chests! A selectable secondary weapon lets you seamlessly switch from a ranged weapon like the Machine Gun to your Axe when the action gets a little too close for comfort. Set up any weapon combination you like! And to make an already intense experience even more intense, there's the Plague Circle . Yea, you know the deal.. the circle begins closing in on an area of the map and you better get your butt in there or to the exit door, mister! Live score tracking lets you know when you're gunning for a top spot! Watch your potential rank increase or slip away. Be a boss and take your place on the worldwide leaderboard for all to see! Most controllers are fully supported : Xbox One/360, most generic gamepads, and native support for the DualShock 4. (Don't worry, keyboard support is included too!)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/873850/header.jpg?t=1545476084",
    "Price": 5.99,
    "Developers": "Magic Time Software",
    "Publishers": "Magic Time Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_ef62878e057fa09a4a38848687832d6fa1c65e49.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_88ba8da60b8410ac54e657ee06e5e27439e7159a.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_eedc709622ca4fff485228129d511cdcb7577e91.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_c17b08129b9c18591f64f67e218a6a743f0f1a04.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_71236bb33d9fef6363cf362e788347d74ebac1a7.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_353a3bf622d14401c6d5e71b979f103c8b12f79c.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_826be7a95b24073fff5ec83345f9f5e3b5870c53.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_a6ef4270d2eb455ea377f36a4712ab3449b5f95f.1920x1080.jpg?t=1545476084,https://cdn.akamai.steamstatic.com/steam/apps/873850/ss_72b2d29f232238650c321a34bd97be3541206f71.1920x1080.jpg?t=1545476084",
    "Slug": "passage",
    "Meta Title": "PASSAGE: Nov 14, 2018, Magic Time Software and Full Overview",
    "Meta Description": "Looking for information on PASSAGE? Check out the release date (Nov 14, 2018), developer insights from Magic Time Software, and a complete game summary.",
    "Alt Text Image": "Official header image for PASSAGE game - Steam 873850",
    "Canonical URL": "https://gusku.site/game/passage",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"PASSAGE\", \"description\": \"Looking for information on PASSAGE? Check out the release date (Nov 14, 2018), developer insights from Magic Time Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Magic Time Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Magic Time Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/873850/header.jpg?t=1545476084\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}