{
    "AppID": 342940,
    "Name": "Project: Gorgon",
    "Release date": "Mar 12, 2018",
    "About the game": "GO ON AN ADVENTURE Project: Gorgon is a 3D fantasy MMORPG (massively-multiplayer online role-playing game) featuring an immersive experience that allows the player to forge their own path through exploration and discovery. We don't guide you through a world on rails, and as a result, there are many hidden secrets awaiting discovery. Project: Gorgon also features an ambitious skill-based leveling system that bucks the current trend of pre-determined classes, allowing the player to combine skills in order to create a truly unique playing experience. DEEP DEMO! Not sure if an exploration-centric MMO is for you? Try the free demo! (See link above.) The demo lets you explore a large part of the game and learn dozens of skills. Your demo character will be capped at level 15 in each skill you learn. When you purchase the game, you'll keep your demo character and all restrictions will be lifted. AN IMMERSIVE WORLD When you play Project: Gorgon, we want you to feel as if you’re immersed in a whole new virtual world. Rather than trying to manage this with just graphics and excessive backstory, we’ve designed the game with dozens of gameplay features that make you feel like you’re really there interacting with the world, such as: Each non-player (NPC) you meet has their own goals and interest, and reward players that choose to be their friend. Shopkeepers keep inventory, so you can buy items that other players have sold to them. Want to help out new players? Sell your cast-off items to the shopkeeper in the new player zone and watch the new players go to town. If you are on fire, you can jump into a lake to put it out. This type of mechanic can have a subtle effect on your strategies, especially when you are fighting a fire mage! You can inscribe messages onto items, write books, and even leave notes for other players. Make your name as an in-game poet, or pronounce your greatness to the world! UNIQUE EXPERIENCES In Project: Gorgon you kill monsters - a lot of them - and you take their loot. In order to keep the experience fun and interesting, we’ve developed unique combat experiences to keep the fights feeling fresh. The loot is randomly generated, monsters have unique abilities, and dungeons have puzzles, traps, and terrifying bosses! The combat skills are entirely free-form. You can learn as many combat skills as you want, and use any two of them at the same time to create your own personal “class.” Project: Gorgon features dozens to choose from, including: Battle Chemistry: Create huge explosions, inject yourself with mysterious mutagens or program a pet golem! Unarmed Combat: Grapple and control enemies using a situational-aware combo system that varies based on where you are and what day it is. Animal Handling: Tame animals and train them to become ferocious fighters. Then breed your best and sell their offspring to other players. Necromancy: Seek out corpses and graveyards to raise an undead army. No graveyard around? Well, there are always the corpses of your friends. Cow: Got turned into a cow by that boss? That sucks. But learn some kicks and how to stampede, and you'll be right back out there kicking grass in no time! That’s just a few! There’s also Sword Fighting, Combat Psychology, Staff Fighting, Sigil Scripting, Mentalism, and more. Player Choices are important in Project: Gorgon. You can learn as many skills as you want, but sometimes power comes with downsides. You can become infected with lycanthropy and gain access to very powerful skill sets. As a lycanthrope, you are able to roam the world in a pack or as a lone wolf; however, when there is a full moon (which is tied to the real world lunar calendar) you are stuck in your beast form. There’s no cure for lycanthropy. You can become a Druid - which will give you great power, but you have to vow to drop everything when there’s an emergency involving nature. It could be a forest fire, a monster invasion or even a pesky insect. Nature never lets you ignore your duties, ever. New opportunists come open, but others will be closed. Can you bear heavy burdens in exchange for greater power? JOIN THE COMMUNITY The community is a critical aspect of Project: Gorgon. We strive to maintain a strong, engaged community, supporting our players through: Live Events with a focus on story. Mechanisms for player-created quest content. Player housing (limited and instanced). Player-managed shops and vendor stalls. In-game communication tools like bulletin boards. Bookshelves where you can write and submit your own books and stories (and players can vote on their favorites). HELP DEFINE THE GAME During our beta ('early access') period, your feedback helps improve the game, from small things like bug-reports to large things like new skill suggestions, monster ideas, and more! We've already used hundreds of player-provided suggestions during our alpha period, and we'll use even more suggestions during beta as we get into the down-and-dirty details of combat, crafting, and exploration.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/342940/header.jpg?t=1654424489",
    "Price": 39.99,
    "Developers": "Elder Game, LLC",
    "Publishers": "Elder Game, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_9c5351f17468dfdf43bff4d24402ba31ec0bf4bb.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_a8b7ea414270ba8debf166ce6055f0491f111dd6.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_d18cad9c03afb48d20f72f0f2631a835c823302b.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_e355655ea19d1249cbdbd9a874043cf075e5ca13.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_3a6fdf5f66b35d5df4a7dc554d1d545bbce13f09.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_142a7be0aeb7367e9873dcca5bf779d20caa0033.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_a1f33bf37762f44efd344a770996241130317d9c.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_d1b8f16c1b8539f670d86556697d25efd63957a4.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_3a900ae7840a9bcfe3061224966b12b85177b3f7.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_750779dfb072f53cbd993a6bff9eda21ec037f3e.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_dbf070901a9f50c2ecae9e9b259881af688ab623.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_137ffe77ec81549dd3b42096c777f8ca97d4faea.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_3d5ca5a648fe99bf3e03f195199f56bbbd32a60b.1920x1080.jpg?t=1654424489,https://cdn.akamai.steamstatic.com/steam/apps/342940/ss_9aa372d5a892f9221bad814cd6c5ab987b617ea1.1920x1080.jpg?t=1654424489",
    "Slug": "project-gorgon",
    "Meta Title": "Project: Gorgon: Mar 12, 2018, Elder Game, LLC and Full O...",
    "Meta Description": "Looking for information on Project: Gorgon? Check out the release date (Mar 12, 2018), developer insights from Elder Game, LLC, and a complete game summ...",
    "Alt Text Image": "Official header image for Project: Gorgon game - Steam 342940",
    "Canonical URL": "https://gusku.site/game/project-gorgon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project: Gorgon\", \"description\": \"Looking for information on Project: Gorgon? Check out the release date (Mar 12, 2018), developer insights from Elder Game, LLC, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Elder Game, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Elder Game, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/342940/header.jpg?t=1654424489\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}