{
    "AppID": 108600,
    "Name": "Project Zomboid",
    "Release date": "Nov 8, 2013",
    "About the game": "Project Zomboid is an open-ended zombie-infested sandbox. It asks one simple question – how will you die?  In the towns of Muldraugh and West Point, survivors must loot houses, build defences and do their utmost to delay their inevitable death day by day. No help is coming – their continued survival relies on their own cunning, luck and ability to evade a relentless horde. Current Features Hardcore Sandbox Zombie Survival Game with a focus on realistic survival. Online multiplayer survival with persistent player run servers. Local 4 player split-screen co-op Hundreds of zombies with swarm mechanics and in-depth visual and hearing systems. Full line of sight system and real-time lighting, sound and visibility mechanics. Hide in the shadows, keep quiet and keep the lights off at night, or at least hang sheets over the windows. Vast and growing map (loosely based on a real world location) for you to explore, loot and set up your fortress. Check out Blindcoder’s map project: / Vehicles with full physics and deep and realistic gameplay mechanics. Use tools and items to craft weapons, barricade and cook. You can even build zombie proof forts by chopping trees, sawing wood and scavenging supplies. Deal with depression, boredom, hunger, thirst and illness while trying to survive. Day turns to night. The electricity falters. Hordes migrate. Winter draws in. Nature gradually starts to take over. Farming, fishing, carpentry, cooking, trapping, character customization, skills and perks that develop based on what you do in-game. Proper zombies that don’t run. (Unless you tell them to in the sandbox menu). A ton of amazing atmospheric music tracks by the prodigy that is Zach Beever. Imaginative Challenge scenarios and instant action ‘Last Stand’ mode, on top of regular Sandbox and Survival  Full, open and powerful Lua modding support. Xbox Controller Gamepad support on Windows. [Others pads can be set up manually. Gamepad support not currently available on Mac] We’re a small team at the moment, but we’re also committed to providing the following: planned Features: The return of our PZ Stories mode that also serves as first ever tutorial actively trying to kill you at every turn. Kate and Baldspot return! In-depth and varied NPC encounters driven in a persistent world, powered by a metagame system that turns each play-through into your very own zombie survival movie with emergent narrative gameplay. Constant expansion of the countryside and cities around Muldraugh and West Point Full wilderness survival systems, animals and hunting for food. More items, crafting recipes, weapons and gameplay systems. Steam Workshop and Achievements support For more details on the game follow us on @theindiestone or visit",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/108600/header.jpg?t=1655867638",
    "Price": 19.99,
    "Developers": "The Indie Stone",
    "Publishers": "The Indie Stone",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_d4a0f78dc94273c7f0eedc186569efc091387066.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_eca8be032b3f5508bf5bea74cfbc823a4df047ce.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_7300ecc70342b6fcbdf39b6f9ff4c408066f8fc2.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_eb1862af5109e4658e2538d897cbd16b87ad1818.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_3b21d79855804e2a73468328a8fd18df0d238a2a.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_0dc0cb896202ecfa344a0af981b695f2349317e1.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_bb426e3c51a76f0605cef625094a9fbc7efad73a.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_507e952789822b69868d768e1e4476946f37b1fb.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_3eee93607a530e8a5b857bae596f4109539dfd35.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_d80677c526a1c9494a7147189e52fbf438f0a9ca.1920x1080.jpg?t=1655867638,https://cdn.akamai.steamstatic.com/steam/apps/108600/ss_327eac804820daf1554e7ee9c64eeeb3053eda40.1920x1080.jpg?t=1655867638",
    "Slug": "project-zomboid",
    "Meta Title": "Project Zomboid: Nov 8, 2013, The Indie Stone and Full Ov...",
    "Meta Description": "Looking for information on Project Zomboid? Check out the release date (Nov 8, 2013), developer insights from The Indie Stone, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Zomboid game - Steam 108600",
    "Canonical URL": "https://gusku.site/game/project-zomboid",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Zomboid\", \"description\": \"Looking for information on Project Zomboid? Check out the release date (Nov 8, 2013), developer insights from The Indie Stone, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Indie Stone\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Indie Stone\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/108600/header.jpg?t=1655867638\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}