{
    "AppID": 1795980,
    "Name": "Reborn Tribe",
    "Release date": "Nov 12, 2021",
    "About the game": "Hi, I am Luper, a part-time indie game developer. I learned game develop by myself. In the place where I live, many parents take video games as “Poisons” that are doing harm to the teenagers and interfering with their studies. But I insist that video games bring much fun to us. I worked hard silently by myself for 262 days to make sure that the Reborn Tribe can truly be called a “Game”. Due to the time and money limitation, I do not wish you to expect too much of this game. It is just a normal simulation game, added some adventure elements like Turn-Based Strategy and Equipments Refining. Lastly I would like to thank my family and my friends for their support and encouragement. Thank you for taking the time to read the contents above. If you are still interested in playing this game, read on. Reborn Tribe is a medieval style simulation game that combines education, construction and exploration. In the ancient time, wars between the gods led to the destruction of the old world. Mankind established two tribes in the new world: the Lif and the Lifthrasir. One day, an unknown magical power attacked the Lifthrasir. As one of the survivors, you decide to reborn the tribe with few resources. In this game, players build and run the farms, pastures, etc. You can obtain the resources from the workshop and fight against monsters. In this period, you have to encounter a lot difficulties. The hints left by your tribe are so limited that you need to overcome all the difficulties by your own creativity and imagination and find out the reason why the tribe disappeared. You can hire staffs to help running the farms, pastures, workshops and other buildings. Optimizing industrial structure can make it more effective. In addition, you can also organize members to explore outside the tribe, which can obtain rare items. Game Features * Normal Images : Although the images are not as good as many excellent indie games, I did my best to make sure you can have a comfortable experience. And I think you will love those cute cows, alpacas and chickens. * Non-Original Music : Aha. This may disappoint you but I spent most of the time on programming and arts. (Tip: Animal sounds can be triggered when CLICKING THE PASTURES.) * Basically No Effects : The only effect in this game exists in the battle scene. The attacking effects of Wizard and Priest will be obvious, while other jobs’ attacking effects are not obvious. (Tip: If you are focus on the experience of game effects, please think carefully before buying this game.) * Relatively Single Content : It only contains 27 levels for now. I will do my best to enrich the contents according to the feedbacks of our players. At last, I hope you like the game and be active in giving us feedback. All comments and suggestions are welcome! XD",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1795980/header.jpg?t=1636704078",
    "Price": 6.99,
    "Developers": "Luper",
    "Publishers": "Luper",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_4e37877e10ae60a117ced653a9066853d6251378.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_d1a4dc954e9cb7e5987381b58518d82d31a3c99b.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_cfa8807a8329983fa2a6d2877e3a6c2881b9874f.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_e95d87671b9910ffb33a1ecfaaf51ddd9c1468bf.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_9bbd6fd82ae3952dffbd37cd8c374f78f97fbf70.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_27a164736cefa3f976e70a4ca91a5dd27a9cf98e.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_9fd011a0f95d1928eecfcb51bf1304b100a15f2c.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_0da6398aef5c05665438f11a2f79b033de0afd71.1920x1080.jpg?t=1636704078,https://cdn.akamai.steamstatic.com/steam/apps/1795980/ss_1ca199b57f59320bc2926eed6af35ee0c06debd6.1920x1080.jpg?t=1636704078",
    "Slug": "reborn-tribe",
    "Meta Title": "Reborn Tribe: Nov 12, 2021, Luper and Full Overview",
    "Meta Description": "Looking for information on Reborn Tribe? Check out the release date (Nov 12, 2021), developer insights from Luper, and a complete game summary.",
    "Alt Text Image": "Official header image for Reborn Tribe game - Steam 1795980",
    "Canonical URL": "https://gusku.site/game/reborn-tribe",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Reborn Tribe\", \"description\": \"Looking for information on Reborn Tribe? Check out the release date (Nov 12, 2021), developer insights from Luper, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Luper\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Luper\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1795980/header.jpg?t=1636704078\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}