{
    "AppID": 1001970,
    "Name": "Rhythmy",
    "Release date": "Mar 24, 2020",
    "About the game": "'Rhythmy' is a new arcade-style rhythm bullet hell game, coming out March 24th on PC, Mac &amp; Linux. Try to dodge and survive many levels while listening to Thaehan, F-777, Boom Kitty and more, that are part of the game's soundtrack. If you're seeking for some hardcore bullet hell challenge, while listening to some epic music, you're at the right place! ABOUT STREAMING &amp; VIDEOS We know this is something important when streaming or making a video about a rhythm game, but we made sure that all our featured artists are DMCA-free. Which means for you, that you can stream the game or make videos on it without fearing of a DMCA takedown of your stream or being demonetized! Enjoy the game! YOU LIKE MUSIC? WE DO TOO! If you may be wondering what kind of awesome artist you'll find within the game, here's a list of all current featured artist in Rhythmy, present or future: Kubbi Thaehan Boom Kitty F-777 Vexento Soundstorm Kaixo Shirobon t+pazolite EARLY ACCESS CONTENT As the game is slowly but surely getting closer to the official release, we'll be adding more levels, modes and features to the game! But until then, here's what you can expect from the early access build on the day it launches: - 2 Chapters - Which will have their own design and music style! - 7 Levels - Splitted across these chapters! - 4 Mutators - Mutators are level modifiers that will power-up your experience, making everything even harder! - All Mutators Challenge - This is the ultimate challenge for people seeking real difficulty, you'll have to complete the level with all mutators enabled at once, are you ready for this? - Level Editor - Express your creativity with the Level Editor, create, share your creations with the community! GAME RELEASE FEATURES The game in its final form will be much different, and with your input, we really hope to make it even better! Here's what you can expect from the release of the game: - 4 Colorful Chapters - with their own art/music style! - 16 Levels - Which will be split across each chapter! - Even more game modes! - Once you'll complete the game, you'll unlock more game modes, more ways to enjoy the game (and being challenged!)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1001970/header.jpg?t=1622385883",
    "Price": 8.99,
    "Developers": "InsaneHawk",
    "Publishers": "InsaneHawk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1001970/ss_d9f32fec2315f043e2426c2d2019a2e92e13c5d9.1920x1080.jpg?t=1622385883,https://cdn.akamai.steamstatic.com/steam/apps/1001970/ss_be7464e187ee3156eca1d65d425c3de007feed15.1920x1080.jpg?t=1622385883,https://cdn.akamai.steamstatic.com/steam/apps/1001970/ss_5b16c5933f70a958a310ed367fb87208270c4368.1920x1080.jpg?t=1622385883,https://cdn.akamai.steamstatic.com/steam/apps/1001970/ss_e338a9ab79d3828b7b04d444c577d9ced011d8f6.1920x1080.jpg?t=1622385883,https://cdn.akamai.steamstatic.com/steam/apps/1001970/ss_2318b01fb79d7bca3e8c1db0d6fffadd75323677.1920x1080.jpg?t=1622385883",
    "Slug": "rhythmy",
    "Meta Title": "Rhythmy: Mar 24, 2020, InsaneHawk and Full Overview",
    "Meta Description": "Looking for information on Rhythmy? Check out the release date (Mar 24, 2020), developer insights from InsaneHawk, and a complete game summary.",
    "Alt Text Image": "Official header image for Rhythmy game - Steam 1001970",
    "Canonical URL": "https://gusku.site/game/rhythmy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rhythmy\", \"description\": \"Looking for information on Rhythmy? Check out the release date (Mar 24, 2020), developer insights from InsaneHawk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"InsaneHawk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"InsaneHawk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1001970/header.jpg?t=1622385883\", \"offers\": {\"@type\": \"Offer\", \"price\": 8.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}