{
    "AppID": 692890,
    "Name": "Roboquest",
    "Release date": "Aug 20, 2020",
    "About the game": "Roboquest is a fast-paced FPS with Roguelite mechanics playable in singleplayer or 2 players co-op. Shoot and run your way through randomly generated environments, pick-up upgrades along the way and blast the powerful big bad bosses you encounter. Upgrade your basecamp and unlock persistent upgrades to customize your playstyle and dive further on each subsequent run. Fast Movement – Master the frantic movement mechanics in order to run and jump through the levels with evasive maneuvers against the enemy bullet-hell. Guardian Classes – Choose from several classes: lead your army of drones, blast tons of enemies at once with a powerful rocket or stealth-in for a sudden burst attack. Build Customization - Create your build along the way with unique sets of upgrades for each class, find powerful synergies and further personalize your playstyle. Weapon Diversity – From regular shotguns, rifles and snipers to the almighty mortar and flare gun, Roboquest offers a large diversity of weapons to choose from. Random Levels – Each with a different theme and atmosphere, generated with a careful mix of pre-placed and randomized chunks, the levels offer a fresh challenge each run. Run, fall, run again – Tough challenges await you, and mastery is required. Learn the way of the enemy and master movement and shooting to prevail. Prepare to return to your basecamp if you are destroyed by the evil bots. Persistent Upgrades – Collect wrenches during your runs and use them to upgrade your basecamp and unlock new gameplay elements and choices to help you dive further into the game each run. Singleplayer or 2p-Coop – Dive into the fray alone or in 2-player co-op with your brobot (and find even more brobots with the cross-platform and the public matchmaking). Polished experience – Responsive input system with many quality-of-life ‘under-the-radar’ features to make it as fluid as possible and make sure nothing comes in your way when unleashing havoc on the badbots. Original Soundtrack – High octane, custom-tailored soundtrack supports the fast gameplay and robot-smashing action. The year is 2700. Humans live scattered through the desert, struggling to survive. It’s looking pretty bleak. Until a young scavenger girl named Max stumbles across an old Guardian robot, laying abandoned in the sand. She reactivates him, knowing that with a Guardian by her side, she may be able to give mankind a fighting chance… Together, the two begin to explore the mysterious canyons that surround them, searching for answers and a way to survive. There’s just one problem. The canyons are crawling with evil bots, determined to stop them from advancing. But who are they? And what are they guarding?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/692890/header.jpg?t=1657636795",
    "Price": 19.99,
    "Developers": "RyseUp Studios",
    "Publishers": "RyseUp Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_461232445d2ae7bbabb7c139d512e7ffde6a174f.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_f6762783dcc14914a587330f3cac214417a3253c.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_2f212de0ea75d9b1f5130973258e0ecfc889657d.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_8a765f11d9cae5cbfd5ba595457d3652d6173014.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_4f6d1daa6410a65bc5edfb92ea1be71d77eb5c45.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_996558a36245d56f5f25f7f4992fe8cf509b0a6c.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_411a4d047832d1fe36ae855263822f82abda8704.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_97781ef627689c0bdf5413fea0a7a2bb15c67cd8.1920x1080.jpg?t=1657636795,https://cdn.akamai.steamstatic.com/steam/apps/692890/ss_b40632f22d60d6022c3a344006343e341d048967.1920x1080.jpg?t=1657636795",
    "Slug": "roboquest",
    "Meta Title": "Roboquest: Aug 20, 2020, RyseUp Studios and Full Overview",
    "Meta Description": "Looking for information on Roboquest? Check out the release date (Aug 20, 2020), developer insights from RyseUp Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Roboquest game - Steam 692890",
    "Canonical URL": "https://gusku.site/game/roboquest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Roboquest\", \"description\": \"Looking for information on Roboquest? Check out the release date (Aug 20, 2020), developer insights from RyseUp Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"RyseUp Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"RyseUp Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/692890/header.jpg?t=1657636795\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}