{
    "AppID": 1665210,
    "Name": "Sakura Forest Girls 3",
    "Release date": "Nov 15, 2021",
    "About the game": "Yaya, Aiyana, and Koko were childhood friends. Born in the same small village, they spent their days together, until their home was attacked by a multitude of strange, slimy creatures. After that night, Koko vanished into thin air, leaving Yaya and Aiyana alone. Three years later, Yaya and Aiyana set out to search Koko. They enlist the help of a mischievous witch, Maia, who helps them locate their missing friend with the use of her magic. After venturing across the land, and meeting several interesting people – including a sheltered princess, Arie, and her eerie priestess, Imala – Yaya and Aiyana are eventually able to reunite with Koko, but there is a catch. They might have found their childhood friend, but she has no intention of returning to her old village with them. She’s already in an established relationship with the fast-talking merchant Mika, and she seems more than content with her lot in life. A threat looms, meanwhile, as more of the strange, sticky creatures which attacked Yaya’s village seem poised to launch further indiscriminate assaults across the land. Now that Yaya knows who is behind these attacks, she’s determined to stop them – but will her determination be enough? Yaya is the main character of the story. Trained as a hunter by her parents, she’s skilled with a spear, and has fast reflexes. Yaya is generally cheerful, and has an easygoing outlook on life. She’s fiercely protective of Aiyana, however, and can become uncharacteristically grumpy when she perceives that her friend is being threatened. She doesn’t get along particularly well with Maia, and the two are always butting heads. Aiyana is a quiet, anxious girl who has difficulties speaking her mind and expressing her true feelings. Though raised by a family of shamans, Aiyana believes herself to be devoid of magical power. She has no faith in her own abilities, and constantly belittles herself, to Yaya’s chagrin. She wants nothing more than for Aiyana to be more self-confident, but her support seems to have little effect. Maia is a wily witch who never talks about her real age, nor her past. She’s maddeningly vague when it comes to sharing her own personal details, but she’s gifted at unearthing other people’s secrets, then using them to her advantage. Maia loves nothing more than cute girls, and she flirts with almost any attractive woman she meets. This causes friction between herself and Yaya, who doesn’t appreciate Maia’s constant advances. Maia might be a handful, but her magical abilities are nothing to sneeze at, and she’s a very useful ally. Koko is Yaya and Aiyana’s childhood friend. She’s a kind, considerate girl who cares a good deal for her friends, and she’s sensitive about the feelings of others. Koko is gifted at cooking and cleaning, but she’s similarly skilled with a bow and arrow. Gentle though she is, she has no hesitation when it comes to hunting, and her skills might even rival those of Yaya’s. She has something of a stubborn streak despite her sweet face, and she used to act as amother figure to Yaya, chastising her whenever she made a nuisance of herself. Mika is a traveling merchant who roams the land selling her wares. Talkative and cheery, she’s rarely seen without a wide smile upon her face, and nothing seems to perturb her. Mika is in a dedicated relationship with Koko, whom she dotes upon. She often calls Koko silly pet names, such as ‘my little cocoa bean’ – a fact which Koko finds incredibly embarrassing. She has a bit of a past with Maia, who seems to regard her with mild disdain. Mika, meanwhile, is impervious to this, and loudly proclaims that she and Maia are the best of friends.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1665210/header.jpg?t=1637021408",
    "Price": 9.99,
    "Developers": "Winged Cloud",
    "Publishers": "Winged Cloud",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_401f775c7b46d77f3448f90fcea5ab94780f5bb2.1920x1080.jpg?t=1637021408,https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_bcac1315d45c40221f1f41a234a389760a0ac167.1920x1080.jpg?t=1637021408,https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_0cd0475e46ebabc94d00570f70f1f405fa058168.1920x1080.jpg?t=1637021408,https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_bb81c310e0ef0120c46f1dedcbbbab8372c003f8.1920x1080.jpg?t=1637021408,https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_039927cf8d496193a05c026571cd41b986540692.1920x1080.jpg?t=1637021408,https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_2c5bfbe23e1f0b57c186f5b2223dc3908def468a.1920x1080.jpg?t=1637021408,https://cdn.akamai.steamstatic.com/steam/apps/1665210/ss_a6ec9d6b0361aa43b656288fc819e66c50b7aa34.1920x1080.jpg?t=1637021408",
    "Slug": "sakura-forest-girls-3",
    "Meta Title": "Sakura Forest Girls 3: Nov 15, 2021, Winged Cloud and Ful...",
    "Meta Description": "Looking for information on Sakura Forest Girls 3? Check out the release date (Nov 15, 2021), developer insights from Winged Cloud, and a complete game s...",
    "Alt Text Image": "Official header image for Sakura Forest Girls 3 game - Steam 1665210",
    "Canonical URL": "https://gusku.site/game/sakura-forest-girls-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sakura Forest Girls 3\", \"description\": \"Looking for information on Sakura Forest Girls 3? Check out the release date (Nov 15, 2021), developer insights from Winged Cloud, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Winged Cloud\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1665210/header.jpg?t=1637021408\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}