{
    "AppID": 967210,
    "Name": "Spark Five",
    "Release date": "Nov 14, 2018",
    "About the game": "There was a time when humans moved freely across the Earth. 2029 and it is not the case. The world has turned dark. A shadow government comprising of high level officers, top leaders of powerful nations and some extremely rich multinational firms have come together to create an A.I. that has taken over every aspect of human life. They have employed cybernetic beings as guards that monitor and make sure you are a 'good citizen', otherwise you are eliminated. This oppressive rule soon led to a war after which we see the events of Spark Five unfold. Humans were almost wiped out, except for some colonies in moons of a certain gas giant. This is your work in total if you buy and download the game. Check it out!​​ (For players playing for the first time the control panel may be empty, kindly add your own controls before starting to play). SPARK CAMPAIGN Play the Spark Campaign. Search and collect all the bio-mass capsules scattered across the map. Outrun patrolling guards, evade defensive turrets, use phantom replicas and mines to carve your way out to the evacuation point. Good Luck and Have Fun. NEMESIS CAMPAIGN Play the Nemesis Campaign. Search and destroy the experimental labs created by the Spark Project in order to disrupt their mission of renovating human civilization. You have only one chance to do it right and time is against us. Extremely challenging timed missions without checkpoints. MERCENARIUM Play custom scenarios against the consortium as a hired mercenary. Objectives vary with each level. Great to hone your skills at the game. Following are some tips to make it all happen. PLANT SOME BOMBS Plant some bombs to get those annoying guards out of the way. Halfway along the way you realize there are more guards than bombs. Trust me it is not challenging. OPEN SOME BOXES Boxes are important. They contain very important things. Get a bomb or a replica, it is your luck. FEEL ALIVE AGAIN? Everyone knows we are going to become ghosts someday, but check this android that comes back to life and starts moving again. Well it does more than just moving. OUT OF TIME They are creating humans again I heard. In these chapters you are supposed to stop them from creating a top-level prototype. Those bio-pods have some time thing that might help you along the way. IMPORTANT NOTES Please note that this game is a one-man project, so updates will be slow. You can expect a major update every couple of months instead of minor updates every week. Although the game has partial controller support, it is highly recommended to use a mouse and a keyboard for unrestricted game-play and seamless navigation. Reviews would be much appreciated.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/967210/header.jpg?t=1612109950",
    "Price": 9.99,
    "Developers": "Spark5",
    "Publishers": "Spark5",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/967210/ss_bf42a4bbd61bd8457f1dfd1294fede3287798b7e.1920x1080.jpg?t=1612109950,https://cdn.akamai.steamstatic.com/steam/apps/967210/ss_8685ab5332b2dd3e151ab20be1fdc1ac549d9c29.1920x1080.jpg?t=1612109950,https://cdn.akamai.steamstatic.com/steam/apps/967210/ss_bf3722e51e21e1aa4cd8d7439a0910712f78f0d4.1920x1080.jpg?t=1612109950,https://cdn.akamai.steamstatic.com/steam/apps/967210/ss_68342c5e0c8f0707f8fdf0f4e74d94f8fc1ebbc6.1920x1080.jpg?t=1612109950,https://cdn.akamai.steamstatic.com/steam/apps/967210/ss_2eb89e7a7b51f0b19eda9f5bec6a87dffd3fa562.1920x1080.jpg?t=1612109950",
    "Slug": "spark-five",
    "Meta Title": "Spark Five: Nov 14, 2018, Spark5 and Full Overview",
    "Meta Description": "Looking for information on Spark Five? Check out the release date (Nov 14, 2018), developer insights from Spark5, and a complete game summary.",
    "Alt Text Image": "Official header image for Spark Five game - Steam 967210",
    "Canonical URL": "https://gusku.site/game/spark-five",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spark Five\", \"description\": \"Looking for information on Spark Five? Check out the release date (Nov 14, 2018), developer insights from Spark5, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spark5\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spark5\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/967210/header.jpg?t=1612109950\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}