{
    "AppID": 1592110,
    "Name": "Spirit of the Island",
    "Release date": "Mar 16, 2022",
    "About the game": "There’s an old tradition running in your homeland: to become an adult and complete the coming of age ritual, you must go on a journey of discovery. Your adventure begins on a distant island, deep in a tropical Archipelago. What was once a prosperous tourist destination is now a shade of its former glory: and it’s your job to bring it back to life! Explore the Archipelago, meet the locals, and lend them a hand to restore the tourist paradise… while you try to uncover the mysteries of your past! SETTLING IN A NEW PLACE Your tropical life will be a busy one, so grab your tools and let’s get started! First things first: you’ll need a source of food, a place to spend the night in, and some resources to build a farm and kickstart your tropical journey. So what are you waiting for — time to explore your lands! A PLETHORA OF ACTIVITIES There’s plenty to do in Spirit of the Island! No matter how you choose to spend your time, you will gain experience and improve your skills, unlock new recipes, and become more efficient at everything you do, which will make your new life easier. Spirit of the Island features 10 unique skills, such as farming, mining, foraging, social, and even fishing, which comes as its own special mini-game. Will you become a true master of all? YOUR JOURNEY TO A TOURIST PARADISE Make your island not only a welcoming home but also a booming tourist paradise, with fancy shops and landmarks. The more tourists you get, the better your economy will be, which is a crucial step to fund your journeys to the faraway Islands. But how do you please them all, and what do you sell in your stores? That’s where your skills will come in handy! Sell local produce; open museums to display the treasure and secrets you uncover on your adventures. We bet some of your visitors could even buy a couple of quality wooden planks, so do your best to improvise! THE BEST TRIP EVER Each tourist will have a chance to love your Island so much that they’ll decide to stay, adding to the Town’s population. This part is crucial since you can hire them to do various things for you, such as tending to your shops and helping you maintain the Island. So do your best to make their trip a fantastic one! THE POWER OF TWO One of the main features of Spirit of the Island is a 2-player cooperative mode, where you can do… everything together! You will have all single-player mode features (even quests) available in online play, and it will also feature its own unique story. SOTI also features Resource Sharing, meaning that you can bring some of the resources you find over to your own multiplayer campaign — how cool is that? Build a farm, grow crops and make delicious dishes, build a store and sell your produce to tourists, explore the vast Archipelago to find treasure, and discover the secrets of the tropical paradise! So invite your friend and start your coop journey right now! VAST TROPICAL ARCHIPELAGO Spirit of the Island features 14 unique explorable islands, each with its own fauna, secrets, and dangers. Information on who - or what - inhabits these islands has been lost to history, but you will find mysterious caves guarded by ancient creatures — are you brave enough to explore them and uncover the mysteries within? Doing so will net you neat rewards and help you proceed towards your final goal: revealing the secret of your past. THE LOCAL COMMUNITY The Archipelago is bustling with life! Meet more than 14 unique characters, each with its own distinct traits and quirks. And yes, there are romance options as well! Depending on your character, you’ll be able to romance and marry different NPCs and hold a grandiose wedding in the end! AN EVENTFUL LIFE One of the unique features of Spirit of the Island is events — a series of recurring occurrences happening through each in-game year (4 months). They will come in various forms: from NPCs birthdays and the Ocean Day — a traditional Holiday to celebrate the birth of the Ocean — to your own unique events. There’s always something fun happening in Town, so make sure to check your calendar often! /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1592110/header.jpg?t=1658495910",
    "Price": 24.99,
    "Developers": "1M Bits Horde",
    "Publishers": "META Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_cfa7ccc23aed11f646c8211a6c1b8762efd7a458.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_9beb61e9c7e4452f01243a170a6c442c6872b77f.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_03d963f9a5953bccb865553b13c428a06a8926b1.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_4a33b8f6af8b0884e412bb338ad8bdd05a9a4d47.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_4abbfd54d1d18ddf786dd748a32e82902559903a.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_26b289f4b2ca36cf221bfdd48cef9703c058ab45.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_a83b9caedb46a379e83f3179a127fe377f8663d1.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_a421cf32b2eb809201bd1f1fe8ca2ee0bf7aaf84.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_944bd502416629e363ca9beb78d860c110f52508.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_2b51b36b10c9ef25941da0875c92beb7642fca5c.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_4540cda18000e8571a6c0ef81037b008315fe8f2.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_a21c7dd3ea3f79ebed01a33575a6c741a027e4ce.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_712228eb9d642d3aed92b8de3203badb82d021e3.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_2391d460ad85f81e53e9ef7a59ef5bd07a49a919.1920x1080.jpg?t=1658495910,https://cdn.akamai.steamstatic.com/steam/apps/1592110/ss_9a4f287acadbac232f3a4de87755400429385b42.1920x1080.jpg?t=1658495910",
    "Slug": "spirit-of-the-island",
    "Meta Title": "Spirit of the Island: Mar 16, 2022, 1M Bits Horde and Ful...",
    "Meta Description": "Looking for information on Spirit of the Island? Check out the release date (Mar 16, 2022), developer insights from 1M Bits Horde, and a complete game s...",
    "Alt Text Image": "Official header image for Spirit of the Island game - Steam 1592110",
    "Canonical URL": "https://gusku.site/game/spirit-of-the-island",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spirit of the Island\", \"description\": \"Looking for information on Spirit of the Island? Check out the release date (Mar 16, 2022), developer insights from 1M Bits Horde, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"1M Bits Horde\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"META Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1592110/header.jpg?t=1658495910\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}