{
    "AppID": 1043560,
    "Name": "Static",
    "Release date": "Apr 5, 2019",
    "About the game": "STATIC 2.0 UPDATE: Releases February 14th! Enjoy a fully revamped and remastered Static experience! New assets, new lighting, and new gameplay mechanics! This new update to Static adds a creeper and more immersive experience including more detailed graphical assets, redesigns for characters and UI, an expanded story featuring new voice talent for the protagonist and all-new secret achievements to unlock! This update is free to anyone who already owns Static and will replace the original game when the update releases on February 14th! You built this tower from the ground up, everything inside, from the AI to the building layout is by your design. You worked hard to ensure that you had the premiere residence in the city of Umbriol, but now, why is everyone gone? You wake up in your penthouse, greeted by your concerned AI. She serves as not only your personal assistant, but also as the building manager. You soon realize that she is the only company you have left in the entire building. She claims that she knows how to get you out, but something seems off. Getting out is important, but what about all your residents? Can you figure out why your once prosperous tower is now filled with nothing but static? Static is part psychological thriller, part escape the room, part investigation adventure. The game is set entirely in first person, giving you the ability to fully explore all of your surroundings. You will have ten floors to get through, each unique to the people living there. You will work to discover what they were working on, what led to the events that you find yourself in, and what exactly happened to everyone that used to live there. Static is designed to take roughly 2-4 hours to complete, with two possible endings. The alternative ending however, will not be obvious as to how to reach it. We have worked to create a 3D game to show off everything that everyone at Dogwood Gaming has learned and built upon, we are incredibly thrilled to share what we built with you! Features - - A full 10 story futuristic tower to explore - Carefully crafted horror elements to keep you uneasy for the entire experience - Our first fully voice acted game - Full freedom of exploration, with all objects hand placed with purpose throughout all the rooms - Hundreds of unique assets to give our game a unique feel - Fully integrated with the Ashes of Kanaka universe, expanding on the story and universe we have already created We would also like to note that shortly after the release of Static, we will be releasing a FREE update to Ashes of Kanaka that will include the main character from Static as a follower, fully integrated with the story just as you would expect from all the other companions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1043560/header.jpg?t=1645538756",
    "Price": 9.99,
    "Developers": "Dogwood Gaming",
    "Publishers": "-",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1043560/ss_ca946450ccc61e0b64beadd088b3b151d82cdcda.1920x1080.jpg?t=1645538756,https://cdn.akamai.steamstatic.com/steam/apps/1043560/ss_b1a32316cb005d50ab26c0ed308167fcd63394a8.1920x1080.jpg?t=1645538756,https://cdn.akamai.steamstatic.com/steam/apps/1043560/ss_82f38de91717e0c5816dac9c9aababe45bbc81f2.1920x1080.jpg?t=1645538756,https://cdn.akamai.steamstatic.com/steam/apps/1043560/ss_7d7c46890798923020e18349eac8c10fc97bb658.1920x1080.jpg?t=1645538756,https://cdn.akamai.steamstatic.com/steam/apps/1043560/ss_7d542ea6354b62c6bc5dcf50d0971d54c485de45.1920x1080.jpg?t=1645538756",
    "Slug": "static",
    "Meta Title": "Static: Apr 5, 2019, Dogwood Gaming and Full Overview",
    "Meta Description": "Looking for information on Static? Check out the release date (Apr 5, 2019), developer insights from Dogwood Gaming, and a complete game summary.",
    "Alt Text Image": "Official header image for Static game - Steam 1043560",
    "Canonical URL": "https://gusku.site/game/static",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Static\", \"description\": \"Looking for information on Static? Check out the release date (Apr 5, 2019), developer insights from Dogwood Gaming, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dogwood Gaming\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"-\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1043560/header.jpg?t=1645538756\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}