{
    "AppID": 1102210,
    "Name": "The Legend of Viccess",
    "Release date": "Sep 30, 2019",
    "About the game": "{Game Introduction} The original hybrid RPG game mode takes you deep experience of different world adventures! The world of Viccess is magnificent. The story of the world of heroes and kings has been passed down to the present. After several years, the shackles of the Dark Lord, the arrogant royal family, the mysterious witches and other parties are on the sidelines, and the whole world is Waiting for the birth of a new legend. . . As the protagonist, you are guided by the mysterious dreams, leaving the hometown with the girl of the childhood, the many companions, opening the wonderful plot mode, embarking on the adventure of conquering the world, and writing your own legends! The RPG game that once made you addicted is back! Refused to the fast food mode, immersive exploration of the plot, fun to open the world to upgrade the journey! {Game Features} Wonderful story: The tensions are waiting to be unlocked. On the road to becoming a hero, there will always be conspiracy but also happiness, choice, sacrifice, everything is in your choice! Unique design: The retro pixel style depicts the world of Viccess, with a lot of scene switching, the picture is fresh and natural, the action is gorgeous and smooth, and the seven different styles of mainland islands bring different visual feelings! Personality role: the first person role-playing, at the same time has a large number of personality, the beautiful of companions waiting for the Raiders, childhood partner, proud goddess, Loli, mysterious boy. . . . Different character combinations will have different combat effects, see how you choose! Strengthen the experience: Reject one-click achievement, enhance the game experience, pay attention to details, guide the player to find clues in the game task to complete the game journey, and also contain a large number of professional skills such as ore, herbal collection, forging, alchemy, jewelry processing, etc. The fun experience of the game! Simulated management: In the exciting game, you also added the simulation business elements, easily build your own style shop, sell the items made during the game, you can get a lot of gold coins for use, let the players in a game. It is enough to experience the fun of RPG story games and simulation business games!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1102210/header.jpg?t=1569898229",
    "Price": 13.99,
    "Developers": "Domo Studio",
    "Publishers": "Domo Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1102210/ss_a12a6710e7e7f5d5099a8513f98cfe4583701f42.1920x1080.jpg?t=1569898229,https://cdn.akamai.steamstatic.com/steam/apps/1102210/ss_d6a1df01c6ddf63d10368d65630f3084d9c691af.1920x1080.jpg?t=1569898229,https://cdn.akamai.steamstatic.com/steam/apps/1102210/ss_16bc45fba7aaa9ddff47a6592b6688bd8c128ff1.1920x1080.jpg?t=1569898229,https://cdn.akamai.steamstatic.com/steam/apps/1102210/ss_6aea3bc1c7c095ed2c1dcad18cfe5dcadd96da30.1920x1080.jpg?t=1569898229,https://cdn.akamai.steamstatic.com/steam/apps/1102210/ss_63f548abacdfccb72116e1b55ef1bd189890457c.1920x1080.jpg?t=1569898229",
    "Slug": "the-legend-of-viccess",
    "Meta Title": "The Legend of Viccess: Sep 30, 2019, Domo Studio and Full...",
    "Meta Description": "Looking for information on The Legend of Viccess? Check out the release date (Sep 30, 2019), developer insights from Domo Studio, and a complete game su...",
    "Alt Text Image": "Official header image for The Legend of Viccess game - Steam 1102210",
    "Canonical URL": "https://gusku.site/game/the-legend-of-viccess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Legend of Viccess\", \"description\": \"Looking for information on The Legend of Viccess? Check out the release date (Sep 30, 2019), developer insights from Domo Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Domo Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Domo Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1102210/header.jpg?t=1569898229\", \"offers\": {\"@type\": \"Offer\", \"price\": 13.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}