{
    "AppID": 676500,
    "Name": "Time Warpers",
    "Release date": "Jan 16, 2020",
    "About the game": "Time Warpers is what's called an 'incremental game'. There's always a fun upgrade to look forward to, and the numbers keep getting bigger! Collect gold, upgrade your weapons &amp; teammates, and even join up with other players in the world as you defeat the enemies &amp; get stronger. All of your favorite things from Time Clickers: Time Cubes, Weapon Cubes, Active Abilities, Maximum Damage &amp; Research (aka Artifacts) are back and better than ever. UPDATE 6 - TIMELINE CARDS Promoting a teammate into Training (500, 1500, etc) gives you the ability to choose a card. When choosing a card you can select from 3 options, each card has their own bonus. There are 13 card types - each type has 4 cards (like a deck of cards). The more you collect of each card, the bigger the bonus. UPDATE 10 - OVERPOWERED! Overpowered kicks in as soon as you are e7 times stronger than a Zone, but you'll need to be e17 times stronger to be 100% Overpowered. The more Overpowered you are the more damage you'll do, instantly destroying a wave of enemies when you're 100% Overpowered. You'll also move faster, doubling your movement &amp; Hover Bike speed when you're 100% Overpowered. UPDATE 17 - AIR STRIKE Call in an Air Strike to do massive damage. Each Air Strike instantly deals 25%-100% damage to a Wave depending on how you've invested your Weapon Cubes. The Air Strike is perfect for when you're pushing through a deep run and need an extra burst of damage. UPDATE 23 - STEAM TRADING CARDS IDLE &amp; AUTOMATION Hop into your Hoverbike and automatically drive through the world as your Automatic Fire ability shoots auto-targeted enemies, letting you progress through the world even when you're away from your computer. The more you play the more you can automate. ACTIVE PLAY Take the controls and progress through the world faster. Find the optimal spots to quickly defeat enemies and swiftly move through the world using jump dash and bunnyhop. ENDLESS PROGRESSION Upgrade Perks from Common to Legendary. Invest Time Cubes into Research making you stronger with each run as you explore thousands of zones spread across multiple unique planets. How far can you get? MULTIPLAYER, CO-OP or SINGLE PLAYER Play in a Private, Co-Op (friends can join) or Public World. In Co-Op &amp; Public Worlds, player's Hoverbikes can merge together creating convoy snakes that move through the world as a pack. Get stronger and become the carrier of a group, or be backup support as you idle. You have the choice; go further together or faster alone. GUN CUSTOMIZATION Collect Perks and customize your Click Weapons, Drone &amp; Turret. Rain projectiles on a group of enemies with the Cluster Perk, create a Boss destroying build focused on Critical Damage, or combine a variety of perks to optimize your run. OPTIONAL PERMADEATH You choose how difficult you want your run to be - the higher the difficulty the higher the rewards.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/676500/header.jpg?t=1616713930",
    "Price": 19.99,
    "Developers": "Proton Studio Inc",
    "Publishers": "Proton Studio Inc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_d2a47c867085123a7251a59003b8d07ede001c8f.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_fc42984c11733cb0ea14071d89a1aea0f15c0bd9.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_5c3489f83925553e9ebbfa86a3330d9d08bfbb53.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_32bc64cca86fe77d3188684f1db806a6ebc6886c.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_3d55128ccd5837d6cc82ae54538fa994fe5fd471.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_00d7c19956d6fa092cef681218d0865695663668.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_f0c4cdc83e271ff19b2ae4a71fa97fe6cc62253f.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_efc68f9b9bd8f63813b8d1f3ab55ba0e31566964.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_9e1267cbc6d1ba7e1d859b2c74e785db5ebe2aa4.1920x1080.jpg?t=1616713930,https://cdn.akamai.steamstatic.com/steam/apps/676500/ss_f3780766cbf76beb0885b602254344205546d9c7.1920x1080.jpg?t=1616713930",
    "Slug": "time-warpers",
    "Meta Title": "Time Warpers: Jan 16, 2020, Proton Studio Inc and Full Ov...",
    "Meta Description": "Looking for information on Time Warpers? Check out the release date (Jan 16, 2020), developer insights from Proton Studio Inc, and a complete game summary.",
    "Alt Text Image": "Official header image for Time Warpers game - Steam 676500",
    "Canonical URL": "https://gusku.site/game/time-warpers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Time Warpers\", \"description\": \"Looking for information on Time Warpers? Check out the release date (Jan 16, 2020), developer insights from Proton Studio Inc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Proton Studio Inc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Proton Studio Inc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/676500/header.jpg?t=1616713930\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}