{
    "AppID": 367660,
    "Name": "UfoPilot : Astro-Creeps Elite",
    "Release date": "May 5, 2015",
    "About the game": "UfoPilot : Astro-Creeps Elite puts you at the controls of a nimble Vector-class starfighter in an epic mission to rid the galaxy of the pesky Astro-Creeps. This game is a revival of the classic Asteroids-style gameplay, with a twist. You control a small ship that must destroy entire fields of asteroids, but inside these space rocks live the evil Astro-Creeps. While the asteroids will drift blindly thru space, the Astro-Creeps, once released, will chase you down. Controls We have worked hard to create intuitive and responsive controls for this game. You aim with the mouse and fire with the left mouse button. You can thrust with your main engines using the right mouse button, and you will accelerate in the direction you are aiming. For finer control, you can also use the WASD keys to maneuver your ship in axial directions. Combine WASD and the right mouse button for even higher rates of thrust and supreme control. It is also possible to use an XBOX 360 Controller to play the game. Your Arsenal and Powerups You always have access to unlimited ammunition (orange) that you can use to destroy asteroids and Astro-Creeps. There are also 7 powerups that can be dropped randomly by asteroids and Astro-Creeps: Bombs - When detonated Bombs fire a ring of projectiles around your ship. Bounce Bullets - Unlike normal bullets (orange) Bounce bullets (blue) will continue bouncing off the edges of the screen until they hit something. Lasers - Lasers travel at infinite speed, unlike bullets, and immediately destroy everything in their path. Shields - Shields grant you invulnerability for 10 seconds, allowing you to plow thru hordes of asteroids and Astro-Creeps. Anti-Gravity - Anti-Gravity pushes things away from you for 10 seconds, allowing you to keep a safe distance between your ship and the enemy. Decoys - When a Decoy is on the playing field, all Astro-Creeps will chase it instead of your ship. Deflectors - A Deflector creates a bubble in space, within which you can remain and fire out from. Nothing else can penetrate the Deflector. All of the Powerups can be combined to great effect, with some specific twists: Bombs can fire Bounce and Laser ammunition in a devastating ring. This can be toggled in Gameplay Options. When you have both Shield and Anti-Gravity, your ship will transform into a Black Hole. With a Black Hole active, your ship is both completely invulnerable and will suck all enemies into itself, destroying them. While the default is for the game to automatically select Lasers and Bounce bullets when you have them, it is possible to enable manual weapon selection in Gameplay Options. Gameplay Options There are many Gameplay Options to choose from, resulting in 1024 permutations. How to play is up to you, and you can name and store your custom settings locally for easy access: Auto-Brake - Enabled by default, this will slow your ship to a halt when not accelerating. Explosion Impulses - Disabled by default, this will cause explosions to knock things around to a greater extent. Auto-select Weapon - Enabled by default, this will cause the game automatically select your must powerful ammunition for you (Laser, Bounce, Normal). Bombs use Lasers - Enabled by default, this causes Bombs to use Laser ammunition. Bombs use Bounces - Enabled by default, this causes Bombs to use Bounce ammunition. Weapon Recoil - Enabled by default, this causes weapons discharge to push your ship in the opposite direction. Explosive Asteroids - Enabled by default, this causes medium sized Explosive Asteroids to sometimes spawn. Destroying these will cause an explosion equivalent to a Bomb detonation with normal bullets. Explosive Bounce Asteroids - Enabled by default, this causes medium sized Explosive Bounce Asteroids to sometimes spawn. Destroying these will cause an explosion equivalent to a Bomb detonation with Bounce bullets. Random Powerups - Enabled by default, this will cause Powerups to spawn in random order. When disabled, Powerups will spawn sequentially by type. Shootable Powerups - Disabled by default, this will allow the player to pickup Powerups by shooting them with bullets or Lasers. Soundtrack The game features 7 custom composed tracks of electro/drone music by Johannes 'johno' Norneby. Steam Leaderboards Specific to the Steam release, the game now stores high scores in the Steam Leaderboards. It is thereby possible to prove that you are indeed the best UfoPilot : Astro-Creeps Elite player in the known universe.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/367660/header.jpg?t=1447373689",
    "Price": 4.99,
    "Developers": "nornware AB",
    "Publishers": "nornware AB",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_68eaeac82622a984819ce700a9cf5455e35277c3.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_e99b9266f8783ba83d172f87fda010c4c61fa59e.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_a342b632157348042636d718d0f05fb3752089c4.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_73e0f9bf0539ec6a68c2e0d6a34c227986c81a0b.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_13a1e829adbda230d8040bcbe704c1f5b5c1b993.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_22cb13fb917d799ea6955d53b6a95e76a0dad816.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_df6ae6d27b1d41f87afdd157aa9537933b954f47.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_57708a75d0e45ca2eb52ce349d2fb302d213432e.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_f1b344a65e756c472cd371f4e2c4a1a5f819d765.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_8e21e99d4888e61df0b5c4e554c6a068a682f135.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_95578fc2e560395f1a38b20b925d43d62ac716a4.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_bea11d6c21aee99c1089df4436e9532a3c16dea7.1920x1080.jpg?t=1447373689,https://cdn.akamai.steamstatic.com/steam/apps/367660/ss_f77f5da83047286d2975cbeae38c157645ebed2f.1920x1080.jpg?t=1447373689",
    "Slug": "ufopilot-astro-creeps-elite",
    "Meta Title": "UfoPilot : Astro-Creeps Elite: May 5, 2015, nornware AB a...",
    "Meta Description": "Looking for information on UfoPilot : Astro-Creeps Elite? Check out the release date (May 5, 2015), developer insights from nornware AB, and a complete ...",
    "Alt Text Image": "Official header image for UfoPilot : Astro-Creeps Elite game - Steam 367660",
    "Canonical URL": "https://gusku.site/game/ufopilot-astro-creeps-elite",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"UfoPilot : Astro-Creeps Elite\", \"description\": \"Looking for information on UfoPilot : Astro-Creeps Elite? Check out the release date (May 5, 2015), developer insights from nornware AB, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"nornware AB\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"nornware AB\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/367660/header.jpg?t=1447373689\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}