{
    "AppID": 502520,
    "Name": "Ultimate General: Civil War",
    "Release date": "Jul 14, 2017",
    "About the game": "Ultimate General: Civil War is a tactical real time strategy war game. Experience the bloodiest period of U.S. history - the American Civil War of 1861-1865. MAIN FEATURES Full campaign: Fight in the American Civil War campaign and participate in 50+ battles from small engagements to massive battles that can last several days over hundreds of square miles of terrain. Campaign fully depends on player actions and battle results. Historical battles can also be played separately. The game includes the following battles in the campaign: Battle of Aquia Creek Battle of Philippi 1st Battle of Bull Run Battle of Shiloh Battle of Gaines' Mill Battle of Malvern Hill 2nd Battle of Bull Run Battle of Antietam Battle of Fredericksburg Battle of Stones River Battle of Chancellorsville Battle of Gettysburg Battle of Chickamauga Battle of Cold Harbor Battle of Richmond Battle of Washington + 48 smaller scale battles Army management: You are the general. You have full control over the army composition. Based on your successes and reputation you might get access to more corps, divisions and brigades. Keep your soldiers alive and they will learn to fight better, turning from green rookies to crack veterans. Lose a lot of your soldiers and you might not have enough reinforcements to deliver victories. Your reputation will suffer, army morale will drop and you will be forced to resign. Innovative command system: You decide which level of control you want. Command every unit individually or just give them a main goal with one button click and watch if they can take that hill. Army divisions commanders can make decisions on their own and help you control the largest army. Draw a defensive line and allocated brigades will defend it like lions. Or design a deep flanking maneuver by just drawing an arrow and send the whole army to the enemy flank or the rear. Your generals will try to fulfill your orders, although 'no plan survives contact with the enemy'. Officer progression: Historical unit commanders progress and become better fighters together with the player. The Officers rank up based on their units’ performance, but it's war and they can be wounded or even get killed in action. New ranks open new possibilities and allow officers to lead bigger units without efficiency loss. Winning battles also opens new possibilities for you as a general, increasing skills such as reconnaissance or political influence. Historical weapons: There is huge variety of Civil War weaponry from mass produced Enfield pattern rifles to rare Whitworths. Historical availability has also been implemented. Certain weapons can only be captured by raiding supplies or taken from the enemy on the battlefield. Enhanced unit control: Detach skirmishers to send them to scout those hills ahead. Or merge several brigades into one bigger division if it’s needed. Dismount the cavalry to become less visible to the enemy or mount for fast flanking charges and supply raids. Supplies are extremely important and you have to plan and defend the provisions otherwise the battle might end for you early. Advanced Artificial Intelligence: You will face a strong enemy. AI will flank you, will hit your weak spots and undefended high ground, will chase and cut your supplies and will try to destroy unguarded artillery batteries. AI will use terrain and will take cover and retreat if overwhelmed. Terrain matters: Trenches, lines, fences, houses, fields – everything can help to achieve victory, if you know how to use it. Hills will allow you to see enemy units earlier. Rivers and bridges can become natural obstacles that will help you to defend. Forests can help you hide your movements and flank the enemy. Beautiful maps: We believe that modern technology allows hardcore war-games to finally stop being brown on green hexes. Hardcore, deep war games can be beautiful. In our game, every historical battle landscape is accurately hand-drawn, utilizing data from satellite and historical maps. The topography plays immense strategic role and helps to understand how battles were fought and to learn history.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/502520/header.jpg?t=1606630974",
    "Price": 29.99,
    "Developers": "Game-Labs",
    "Publishers": "Game-Labs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_eefd0d773d67933a02cfefb968a1bfa93f05a739.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_099b5de21f169d4c83fb42cf21f7ef5c295b8d63.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_f03f37e46d6e004e1ed1b17874355f7763429e23.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_f868c5d31b676c84185520d41aa4f3b461e88f92.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_dd049cb5fc4514b44e962fd36a6e1fe4bd181509.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_e8af6a38011450c4a09de32bc3fca86f6fdd6c18.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_917a27a475ac25ef3ecfca82d8edacf2e07e3d8d.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_369d79e0dc410e83beb836af308b6aa02e13c610.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_382ea4b9b5878187f883a0e3f8a784e95671a291.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_b339b032b17881329915ec0968bbdbd81a611932.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_d0573cf5e4b7e0e6aa8376523468b6afb0b454e9.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_5104a0e4c1e7e47529994562e2c0275a0b217bf6.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_23c61e62c06fd7fd844e6e6e6e7e2a00690701b4.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_b86523a69662c3b08e81518fc95893b8d9ca1620.1920x1080.jpg?t=1606630974,https://cdn.akamai.steamstatic.com/steam/apps/502520/ss_13eaea6670f94b5963d95a339230c5160cee789c.1920x1080.jpg?t=1606630974",
    "Slug": "ultimate-general-civil-war",
    "Meta Title": "Ultimate General: Civil War: Jul 14, 2017, Game-Labs and ...",
    "Meta Description": "Looking for information on Ultimate General: Civil War? Check out the release date (Jul 14, 2017), developer insights from Game-Labs, and a complete gam...",
    "Alt Text Image": "Official header image for Ultimate General: Civil War game - Steam 502520",
    "Canonical URL": "https://gusku.site/game/ultimate-general-civil-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ultimate General: Civil War\", \"description\": \"Looking for information on Ultimate General: Civil War? Check out the release date (Jul 14, 2017), developer insights from Game-Labs, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game-Labs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game-Labs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/502520/header.jpg?t=1606630974\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}