{
    "AppID": 732050,
    "Name": "Voxel Tycoon",
    "Release date": "Apr 15, 2021",
    "About the game": "Voxel Tycoon — a management sim set in the infinite voxel world. Mine resources and process them into goods on your custom factories. Set up supply chains and passenger routes with a huge fleet of trains, trucks, and buses, and turn small towns into prosperous megacities with a thriving economy! Transportation The game has more than 50 vehicles representing eras from steam to electric, among which are locomotives, railcars, trucks (including semi-trailers!), buses, multi-unit speed trains, and more. Every vehicle has its own unique properties that you should take into account when buying and building consists of them. Thanks to our physics simulation, vehicles will behave differently based on their weight, the type and amount of cargo they're carrying, motive power, and grades. Flexible scheduling allows, among other things, to select exact tracks where trains should arrive at stations, or choose what specific railcars should load or unload at any given stop. You can give mass orders using Routes, or set up individual tasks for each vehicle on your roster. Bridging and tunneling, along with a full signaling system (you don't want your trains to crash into each other, do you?), allow you complete freedom to build and expand your network. Factories Organize mining with mine shafts, then process the raw materials using crushers, furnaces, refineries, and other machinery. Complex production chains require complex logistics! Design unique factories of your very own by connecting machinery, buildings, and storage facilities with conveyor belts. Fund and supply research of new technologies, unlocking new buildings, production chains, and vehicles. Infinite World Explore an unlimited, procedurally-generated world filled with unique biomes, from deserts to arctic tundra. Unlock new regions to find rare resources and new development opportunities. The world is endless, so you’ll never run out of space. For the most successful tycoons, we include full-featured terraforming: turn the world into exactly what you want, all according to your perfect plan! Keep in mind, however, it might cost you a fortune. The world is not limited to the classic top-down Tycoon view - Free Camera mode allows you to immerse yourself directly into the action. Fly around in the first person for gorgeous views, get a closer detailed look at production chains, and even ride around on your trains while they do their job. Economy Every city has its own needs, which you can fulfill to kick-start growth. The bigger a city gets, the more customers and passengers move in, meaning more potential profit! The growth of a city doesn't simply increase the quantity of goods required - higher stages of development will move away from the basics, requiring more complex and expensive products. Keep in mind that the values of goods are not constant and depend heavily on your actions as the supplier. Higher demand leads to higher prices! As a last resort, you can always help cities and business solve their financial problems directly by investing funds in their development. Don’t just focus all of your efforts on freight - people have destinations to get to as well! Manage passenger flow between cities, and don't forget to treat them with care - different passengers are all heading to different places. Moddable from Day One Voxel Tycoon is developed with rich extensibility in mind. A lot of aspects can be modded: from changing existing config files to adding new vehicles and buildings, resources, production technologies, research, and any other supported content to writing custom logic using C#. The game is bundled with the always up-to-date modding tools. We support Steam Workshop as the easiest way to deliver plenty of community-made mods to you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/732050/header.jpg?t=1644101448",
    "Price": 24.99,
    "Developers": "Voxel Tycoon",
    "Publishers": "Voxel Tycoon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_1e740d91dbd969deae7f6eb6548dddb6cb48ed86.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_0879fce41c3053cdb028b6d210225d4dbac9ec23.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_cff6f59f93c616e1e075cc3cd387cc0c9d5cc2ef.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_487fcb47522294d1f8f0d77fd1e71d8b30347aa1.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_9ef8f8b5e951588ff7b5595831a86f5f74728456.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_170d3d2cb5837b79d809e9e4d8e5e94cd5c37ca3.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_2f037b90f204eb2827c523e0700ae6031768fe45.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_295f4942ac434891ccb1f882bd55e1961a7a314f.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_33083c9dad8ea70e97a3f413520e7a0fb94678a4.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_72b1bda4ba8745fe27cd2ee0b3ad1c815fe93331.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_5e31ea9fe9942b7dcae0c5ec5c8894af7bed6679.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_657a90ae63916b8b0c6802d342dec9dc108b480e.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_617178b353675d40cca82f210b5adddc50f5d6fe.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_43bd6215d7aa6528f5099ad876193d2a2648aa15.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_53e6e62866bc145979b3be28ccbfb0c205ca6c75.1920x1080.jpg?t=1644101448,https://cdn.akamai.steamstatic.com/steam/apps/732050/ss_9eeb4d991affaefab931cd3bc02781ee8086c7ca.1920x1080.jpg?t=1644101448",
    "Slug": "voxel-tycoon",
    "Meta Title": "Voxel Tycoon: Apr 15, 2021, Voxel Tycoon and Full Overview",
    "Meta Description": "Looking for information on Voxel Tycoon? Check out the release date (Apr 15, 2021), developer insights from Voxel Tycoon, and a complete game summary.",
    "Alt Text Image": "Official header image for Voxel Tycoon game - Steam 732050",
    "Canonical URL": "https://gusku.site/game/voxel-tycoon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Voxel Tycoon\", \"description\": \"Looking for information on Voxel Tycoon? Check out the release date (Apr 15, 2021), developer insights from Voxel Tycoon, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Voxel Tycoon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Voxel Tycoon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/732050/header.jpg?t=1644101448\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}