{
    "AppID": 1853260,
    "Name": "What Lies in the Multiverse - Prologue",
    "Release date": "Jan 25, 2022",
    "About the game": "What Lies in the Multiverse Prologue is the first chapter of one truly crazy adventure. Intended as an introduction to the world of What Lies in the Multiverse, this prologue will introduce you to the game’s dimension shifting mechanics, eccentric main characters, and the opening chapter of a story that's filled with laughs, gags, and a bit of the macabre. This prologue is approximately 1 hour of playing time. What Lies in the Multiverse is a story-driven, puzzle platform adventure that one could call a dramatic comedy. Filled to the brim with hilarious, cartoonish hijinks, the narrative also presents the player with mature and deep themes like death, envy, and obsession. Things inevitably go batshit crazy very fast in the Multiverse when you discover the ability to travel between parallel worlds. These worlds are alternate versions of each level and differ in aesthetic, theme, and physicality. Switching between them allows you to solve logical and spatial challenges and to progress the story. Seamless Transformations Would you like to change the game world on the fly? Now you can! Can't reach a ledge? Bam! Switch worlds mid-air. Afraid of sliding around in an icy environment? Alternate to another universe for firmer ground! Just be careful when messing with gravity... Diverse World Embark on a journey across a variety of gorgeous pixel-art worlds, each offering something unique. Explore temples, towns, harbors, the wilderness and more as you race to unlock the secrets of the Multiverse. Colorful Cast of Characters Meet a bunch of quirky but compelling characters such as Everett, your eventual genius companion. Picture a sarcastic, eccentric Albert Einstein. Then there’s EZ, a mysterious figure everyone fondly remembers but can't describe. Or ZENITH, a group of enigmatic and shadowy figures always breathing down your neck. A Deeper Story While staying true to its light-hearted nature, the story's poignancy builds as you progress. A rollercoaster of laughter, joy, and sorrow awaits.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1853260/header.jpg?t=1643194963",
    "Price": 0.0,
    "Developers": "Studio Voyager,Iguanabee",
    "Publishers": "Untold Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1853260/ss_4aa51f25433d0d092647e7df3cabf77b710ea429.1920x1080.jpg?t=1643194963,https://cdn.akamai.steamstatic.com/steam/apps/1853260/ss_d866760f19a98967ad4ac299dd277d003e3bfc38.1920x1080.jpg?t=1643194963,https://cdn.akamai.steamstatic.com/steam/apps/1853260/ss_6b84a353e4a57e391f2b4dd50bd35d34d2387e82.1920x1080.jpg?t=1643194963,https://cdn.akamai.steamstatic.com/steam/apps/1853260/ss_2402720eb8c08ed48374af1bdfa8694f75a36e48.1920x1080.jpg?t=1643194963,https://cdn.akamai.steamstatic.com/steam/apps/1853260/ss_94f5a914ef07ea069455ed2cc564ac1e754c46b5.1920x1080.jpg?t=1643194963",
    "Slug": "what-lies-in-the-multiverse-prologue",
    "Meta Title": "What Lies in the Multiverse - Prologue: Jan 25, 2022, Stu...",
    "Meta Description": "Looking for information on What Lies in the Multiverse - Prologue? Check out the release date (Jan 25, 2022), developer insights from Studio Voyager,Igu...",
    "Alt Text Image": "Official header image for What Lies in the Multiverse - Prologue game - Steam 1853260",
    "Canonical URL": "https://gusku.site/game/what-lies-in-the-multiverse-prologue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"What Lies in the Multiverse - Prologue\", \"description\": \"Looking for information on What Lies in the Multiverse - Prologue? Check out the release date (Jan 25, 2022), developer insights from Studio Voyager,Igu...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Voyager,Iguanabee\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Untold Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1853260/header.jpg?t=1643194963\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}