{
    "AppID": 821790,
    "Name": "Who Am I: The Tale of Dorothy",
    "Release date": "Apr 16, 2018",
    "About the game": "Overview Can you imagine having other people live inside your head? The protagonist of this story, Dorothy Watson, is a 14-year-old girl who just started middle school. From the outside she looks like a normal teenager but she has scars and pains that most children don’t have. Dorothy experienced trauma as a child and developed dissociative identity disorder, commonly known as multiple personality disorder, which split her into several personalities. Alice, who’s as innocent as a child but sees things that others cannot. Gretel, whose blinding rage makes her wary of everyone. Cindy, always positive and outgoing, who doesn’t really like Dorothy for being an introvert. If you don’t help her, Dorothy might not be able to adjust to her new life. Fortunately there’s still hope. You have the power to talk to the different personalities including Dorothy, when Dorothy is asleep. In her Dream Space, you can become the counsellor for Dorothy and the other kids. Use your power to integrate the split personalities into Dorothy. But do be careful! The personalities are very sensitive to your questions and answers. One wrong answer can drive the wedge between you and them, tearing the kids apart beyond repair. Dorothy’s life is in your hands and your choices will have direct impact on her. Remember only you can save Dorothy! How to play You will become a counsellor and talk to 4 personalities once per week in Dorothy’s dream. Counselling will begin after Dorothy tells you about the events that happened to her in real life during that week. When Dorothy’s story is finished, you can choose who you want to talk to. When you take your pick, the personality will start talking first and then you can choose how you want to respond. Real life events as well as your responses to the personalities will determine Dorothy’s stress level and the personalities’ integrity level. Your goal is to max out the integrity level for Alice, Gretel and Cindy before Dorothy’s stress level maxes out. This game has 6 endings in total. When you finish, you’ll get an illustrated cards for each ending that you can save and view in the Archive. Play again to collect all the cards and discover all the unique real life events that happen to Dorothy and the kids! Features Become a counsellor for Dorothy, a 14 y.o. girl with dissociative identity disorder Different storyline every time you play 6 unique endings for Dorothy and the kids Over 300 answers and questions to choose from Your answers will affect how the personalities grow and respond to future events Stress / Integrity level will help you figure out how to handle each personality Dreamy, otherworldly 2D graphic and music Beautifully illustrated cards for each ending, and Archive to save them!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/821790/header.jpg?t=1577194988",
    "Price": 0.0,
    "Developers": "Onaemo Studio",
    "Publishers": "Onaemo Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_cfc23591a63f17b0e65e7da884a31879314d83a9.1920x1080.jpg?t=1577194988,https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_5691c5ef55af29e57c4d41f01bc783020a4876f8.1920x1080.jpg?t=1577194988,https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_33a048aaf5387c481e51186949f4dd9de32a9304.1920x1080.jpg?t=1577194988,https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_612504b95a50ea2327d16d3953b5fd99c13622cf.1920x1080.jpg?t=1577194988,https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_724434b429d4ed60ac48da92df34f3632df1ba38.1920x1080.jpg?t=1577194988,https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_a6818251d697f5f6a0ef2d9bc696a6086195ea62.1920x1080.jpg?t=1577194988,https://cdn.akamai.steamstatic.com/steam/apps/821790/ss_1300ef87565c140d530025a8c278c3bfeb267af9.1920x1080.jpg?t=1577194988",
    "Slug": "who-am-i-the-tale-of-dorothy",
    "Meta Title": "Who Am I: The Tale of Dorothy: Apr 16, 2018, Onaemo Studi...",
    "Meta Description": "Looking for information on Who Am I: The Tale of Dorothy? Check out the release date (Apr 16, 2018), developer insights from Onaemo Studio, and a comple...",
    "Alt Text Image": "Official header image for Who Am I: The Tale of Dorothy game - Steam 821790",
    "Canonical URL": "https://gusku.site/game/who-am-i-the-tale-of-dorothy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Who Am I: The Tale of Dorothy\", \"description\": \"Looking for information on Who Am I: The Tale of Dorothy? Check out the release date (Apr 16, 2018), developer insights from Onaemo Studio, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 16, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Onaemo Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Onaemo Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/821790/header.jpg?t=1577194988\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}