{
    "AppID": 1487590,
    "Name": "Yoshiwara Higanbana",
    "Release date": "May 6, 2021",
    "About the game": "●About the game --Whether I end up after falling in love, in your arms or in a scarlet prison? It's up to you to make my vow of higanbana fall or wither-- Even if it's only for one night, I want to be held by you... A beautiful but fleeting love story of a Oiran. Popular otome game Yoshiwara Higanbana with new CG will soon to be released! The story of a prostitute's fragile but burning pure love in the Edo brothel Yoshiwara is now available on Steam! This title is an all-ages version of the PC otome adventure game 'Yoshiwara Higanbana' released by MariaCrown in September 2015. The scenario has been changed to match that of the PS Vita/Switch game 'Yoshiwara Higanbana: Kuon no Chigiri' and new CGs have been added. ※Attention: The Tatsukichi route added in 'Yoshiwara Higanbana: Kuon no Chigiri' is not included. ■How to play In this visual novel, you can take different routes or endings by choosing different choices. Depending on the ending you complete, new episodes will open up in the main story. ■The new CGs have been added! In the main story, scenes that were previously showed with characters and backgrounds will be turned into CGs. One scene will be turned into CG for each character. ■Chinese support In addition to Japanese, Chinese text has been added! ●About the story Edo Period. On the back side of the glamour of the town, lust is swirling in New Yoshiwara. Chihaya is the highest ranked called Oiran at the long-established brothel Oukaya. In order to return to her parents in her homeland, day and night, she entertains unknown male. Which is her unchanging everyday life. Yoshiwara might be a small world, but to Chihaya, it’s a treasured place in which she can prove herself. Oukaya's owner, Shigure. Her kamuro, Yuzu.The strong-willed fellow harlots that work alongside her. Surrounded by these irreplaceable people, Chihaya was proud of being a courtesan, even though it was a difficult world. Until she know what true love is-- The owner of a shipping agency, Souichirou Iseya. The Hairdresser, Sakuya. The Samurai, Shinobu Ootsuki. The Rice Broker, Akito Kaguraya. The owner of Oukaya, Shigure Oukaya. This is the story of a prostitute with those of five men, and her irresistible fate. ●About the charactors Rin (assumed name: Chihaya) Her character is honest and good-natured. She is a dignified woman who takes pride in her work. Even though she has become a prostitute and knows a lot about sexual matters, she still has a pure heart and a faint love for her childhood friend. Souichirou Iseya (CV:Nakazawa Masatomo) The young owner of a fast-growing a shipping agency. He is always in a calm mood and is kind to everyone. He is a straightforward person who will tell you what he thinks. Sakuya (CV:Mizushima Takahiro) A hairdresser recently hired by Oukaya. He is well-liked by the prostitutes because of his dexterity and skill. But he is not very interested in others. He doesn't talk much and rarely smiles. Shinobu Ootsuki (CV:Majima Junji) A samurai who frequents Yoshiwara. He is always seen in a drunken state at Oukaya. He is a light-hearted man who pokes fun at various prostitutes. Akito Kaguraya (CV:Takeuchi Ryouta) He is a regular customer of Oukaya, which is famous for its merciless as a Rice Broker. For some reason, he has been uncomfortable with Chihaya since they first met. Shigure Oukaya (CV:Toshiyuki Morikawa) He is the owner of Oukaya, a long-established brothel. Because of his job, he is very knowledgeable. He is strict during working and teaching, but behind the scenes he is a kind man who cares for others' health. He has a lonely air about him. About switching languages -How to switch the language of Yoshiwara Higanbana- After launching the Steam client, click on 'Library' and find Yoshiwara Higanbana. Right-click on Yoshiwara Higanbana in the title list and select 'Properties'. Change the language of the game to the language required in the 'Language' list in the properties. Once selected, the game will begin to download automatically in the corresponding language version. Each time you switch the language of the game, the game will be downloaded again in the selected language version. *Save data can continue to be used after switching languages.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1487590/header.jpg?t=1620629037",
    "Price": 44.99,
    "Developers": "MariaCrown",
    "Publishers": "Beijing Happy Entertainment Technology",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1487590/ss_81fe65d93c47b5e8ebfa04967da2109f948e2229.1920x1080.jpg?t=1620629037,https://cdn.akamai.steamstatic.com/steam/apps/1487590/ss_2141fec050a14bf3a1f997f215197046549771fb.1920x1080.jpg?t=1620629037,https://cdn.akamai.steamstatic.com/steam/apps/1487590/ss_9cb3858401ba740655913c6bc3f9453551ae1ac3.1920x1080.jpg?t=1620629037,https://cdn.akamai.steamstatic.com/steam/apps/1487590/ss_9b8ab925b390a3e0832f66b627ef206ece8b0827.1920x1080.jpg?t=1620629037,https://cdn.akamai.steamstatic.com/steam/apps/1487590/ss_7382831104b25f88ee76c3e1ded0cf6123e147f4.1920x1080.jpg?t=1620629037,https://cdn.akamai.steamstatic.com/steam/apps/1487590/ss_4f2a8abbeaae8423ca36ee2908b5644f96bf7186.1920x1080.jpg?t=1620629037",
    "Slug": "yoshiwara-higanbana",
    "Meta Title": "Yoshiwara Higanbana: May 6, 2021, MariaCrown and Full Ove...",
    "Meta Description": "Looking for information on Yoshiwara Higanbana? Check out the release date (May 6, 2021), developer insights from MariaCrown, and a complete game summary.",
    "Alt Text Image": "Official header image for Yoshiwara Higanbana game - Steam 1487590",
    "Canonical URL": "https://gusku.site/game/yoshiwara-higanbana",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Yoshiwara Higanbana\", \"description\": \"Looking for information on Yoshiwara Higanbana? Check out the release date (May 6, 2021), developer insights from MariaCrown, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"MariaCrown\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing Happy Entertainment Technology\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1487590/header.jpg?t=1620629037\", \"offers\": {\"@type\": \"Offer\", \"price\": 44.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}