{
    "AppID": 360400,
    "Name": "Zombie Quarantine",
    "Release date": "Jun 23, 2017",
    "About the game": "Lead survivors out of many complex mazes while quarantining or curing the infected. This game will test every ounce of your mental skills. The basic rules: A set number of the civilians)must reach the exit zone. A set number of zombies have to be eliminated before the time runs out. ...Oh and if a zombie reaches the blue area, you are penalised two points. Plus: The green characters (the army) act as towers, and can't move. But they will kill any character. Beware. The white characters are scientists, and they can cure zombies back into civilians. There are buttons at the top of the screen which let you end the game, or reset the current level. Press ESC anytime to bring up the save and load menu. There are 20+ levels. The first level is a tutorial which will explain the game in more detail. This game is tricky, but there are tactics which will help: 1) Units change direction when they are in the middle of certain paths such as the corners and the T-sections. They will also change direction if they run into a wall, or another unit. 2) Scientists have a range of about 1 &amp; 1/2 halls. When you see a scientist move, the effected zombie has about 3 seconds until they are cured into a civilian unit. 3) Some army personnel can kill, with 1 shot. But most of the time it takes ~5 shots to kill. 4) Isolating individual units quickly, and reserving them for later can help with the pace of the game. Level 5 is a real test of this tactic. 5) There are wooden barricades on certain levels which only the zombies can attack and destroy. Controls: Click on the walls to create a safe or unsafe path for the characters. Use the AWSD keys to move the camera around the level. The mouse wheel to move the view up and down. Every level has an optional camera view, and a level code. Clicking on the change camera button will swap to an alternate camera view. Click it again to return to the main camera. There may be updates for this game, depending on the public opinion on the current progress. Anyone to purchases this version will receive new versions for free. Known glitches: If the hall areas get filled with too many units, they may glitch and push each other through walls, or push each other off the main middle path. So try and keep them all moving, just for long enough for you to reach the requirements, and hit the end level button. Enjoy!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/360400/header.jpg?t=1604668121",
    "Price": 0.99,
    "Developers": "Tobop Productions",
    "Publishers": "Tobop Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/360400/ss_98384a05df43d7670bc108e189b2eff7adbec834.1920x1080.jpg?t=1604668121,https://cdn.akamai.steamstatic.com/steam/apps/360400/ss_c16054187e3b825debeba171350e8221dd4f28b2.1920x1080.jpg?t=1604668121,https://cdn.akamai.steamstatic.com/steam/apps/360400/ss_891f93d673f9090bb65c594ea6cc034311779ae4.1920x1080.jpg?t=1604668121,https://cdn.akamai.steamstatic.com/steam/apps/360400/ss_5cea36bac00de0a7aeb90af3cf6a0f0fce226996.1920x1080.jpg?t=1604668121",
    "Slug": "zombie-quarantine",
    "Meta Title": "Zombie Quarantine: Jun 23, 2017, Tobop Productions and Fu...",
    "Meta Description": "Looking for information on Zombie Quarantine? Check out the release date (Jun 23, 2017), developer insights from Tobop Productions, and a complete game ...",
    "Alt Text Image": "Official header image for Zombie Quarantine game - Steam 360400",
    "Canonical URL": "https://gusku.site/game/zombie-quarantine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zombie Quarantine\", \"description\": \"Looking for information on Zombie Quarantine? Check out the release date (Jun 23, 2017), developer insights from Tobop Productions, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 23, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tobop Productions\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tobop Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/360400/header.jpg?t=1604668121\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}