{
    "AppID": 1930160,
    "Name": "1001 Jigsaw American Puzzles",
    "Release date": "Mar 22, 2022",
    "About the game": "1001 Jigsaw World Tour: American Puzzles is an exciting puzzle game and a fantastic tour guide. Put together jigsaw puzzles from a multitude of pieces and study the history, traditions and sights of the United States of America in 500 high-quality photos. Now you can solve your favorite jigsaw puzzles and travel the world without leaving the comforts of home! For more enjoyable and comfortable gameplay, we’ve provided a whole host of options! Set a difficulty to suit you for each puzzle – choose the number of pieces, their grade and turn function! Save your progress at any time and go back to assembling your saved puzzles whenever you want! For those who love a challenge, there are tasks and colorful trophies! Simple controls and plenty of hints and tools make the game a joy to play. With all this flexibility, the game is suitable for both new players and true professionals in the logic puzzle genre. An exciting tour across all the states of America awaits you: see the world-famous skyscrapers of New York and Chicago, the sunny beaches and Hollywood boulevard of California, the repercussions of the Gold Rush and the active volcanoes of Alaska, inimitable Texas and ever-wakeful Las Vegas. See Washington D.C., the keeper of American glory and history, then move on to the tropical Hawaiian islands. 1001 Jigsaw World Tour offers you an epic journey through all 50 states of America! 1001 Jigsaw World Tour: American Puzzles is a game and global tour guide. 500 high-quality photos: famous sights galore, plus architecture, monuments, art, national traditions and glory, history, cuisine, sports… The real and unique America! And you can start your journey through it right now! - 500 high quality unique images - well designed game-play: useful hints, sort tool and magnifying glass. - optional game difficulty control makes your gameplay infinite - custom styles of pieces with rotation - save game progress and continue to collect the puzzle at any time - tasks and colorful trophies for those who love excitement - pleasant and relaxing music - 2 in 1: a game and a tour guide for America! - get 500 puzzles for one purchase. It is beneficial!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1930160/header.jpg?t=1648012606",
    "Price": 4.99,
    "Developers": "Creobit",
    "Publishers": "8floor",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1930160/ss_4a70e03ffe46fb29ad15004ecbf5cd1fe6be834c.1920x1080.jpg?t=1648012606,https://cdn.akamai.steamstatic.com/steam/apps/1930160/ss_be039c6b3987984fe20111ccfbbbdae09102f754.1920x1080.jpg?t=1648012606,https://cdn.akamai.steamstatic.com/steam/apps/1930160/ss_1fcadaef694a77ba2b4e526b15cab73ae5b6c3d3.1920x1080.jpg?t=1648012606,https://cdn.akamai.steamstatic.com/steam/apps/1930160/ss_61500a40b672bbdf81d6de12bea17c8e4a333140.1920x1080.jpg?t=1648012606,https://cdn.akamai.steamstatic.com/steam/apps/1930160/ss_595b9d80c551a61d1329363b80d07a317bb3fb5d.1920x1080.jpg?t=1648012606",
    "Slug": "1001-jigsaw-american-puzzles",
    "Meta Title": "1001 Jigsaw American Puzzles: Mar 22, 2022, Creobit and F...",
    "Meta Description": "Looking for information on 1001 Jigsaw American Puzzles? Check out the release date (Mar 22, 2022), developer insights from Creobit, and a complete game...",
    "Alt Text Image": "Official header image for 1001 Jigsaw American Puzzles game - Steam 1930160",
    "Canonical URL": "https://gusku.site/game/1001-jigsaw-american-puzzles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"1001 Jigsaw American Puzzles\", \"description\": \"Looking for information on 1001 Jigsaw American Puzzles? Check out the release date (Mar 22, 2022), developer insights from Creobit, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Creobit\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"8floor\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1930160/header.jpg?t=1648012606\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}