{
    "AppID": 1147500,
    "Name": "A Gay's Life",
    "Release date": "Nov 20, 2019",
    "About the game": "In this era, the word 'gay' appears more and more in TV and movies. Compared with the past, the whole society seems to be more inclusive for the homosexuals. However, looking around, there are not so many homosexuals who are willing to confess their gay identity and come out to their families. Too many homosexuals don't seem to be accepted as we imagined. This lets us start asking ourselves, do we really understand them? How many difficulties in their lives are often overlooked by us? This game may help you to understand more about the homosexual group and to understand the problems and obstacles they encounter. The game allows players to experience the first-person perspective to a gay boy's life. As a protagonist, you have discovered from childhood that you don't like girls, and for the first time in adolescence, you start to fall in love with boys. Then you fled from the small county to the big city, while feeling that the gay community is accepted by more people, but when you return home, you still see the eyes that your loved ones don't understand. As you go deep into the open circle of homosexual relationships, marriage system, surrogacy, undisclosed homosexuality, fraudulent marriage, etc. You see too much content beyond your moral bottom line. Accepting or resisting makes you feel confused. The sense of identity with the self is also changing over time. In the end, will you choose to receive treatment, swindle to avoid stress, or spend a lifetime with someone you love? The answer to this question may only be waiting for you to find it in the game. Feature： “Beautiful picture and music”: The whole game screen is in the form of hand-painted, with the music of famous artists, so that the whole game is very comfortable to play. 'The perfect combination of games and science': There are a lot of knowledge about homosexuality in the game, so that everyone can deepen their understanding of the gay community while they are entertaining. 'Big branch line': Many branch plots, different choices will lead to unexpected endings~ 'Very real story': The setting of the game story is very similar to the real situation in the real society. 'Stimulus game system': There will be a quick quiz game in the face of the dispute scene in the game. If you choose the wrong one, you may enter the ending that you do not expect to enter, which is very exciting and thrilling.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1147500/header.jpg?t=1574239886",
    "Price": 2.99,
    "Developers": "橙光游戏",
    "Publishers": "橙光游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1147500/ss_e3ed7acab7df45e27b52782a992e48ca67c9f65a.1920x1080.jpg?t=1574239886,https://cdn.akamai.steamstatic.com/steam/apps/1147500/ss_3bfc11b94180e7b342a7cc1b17b465d2ae977772.1920x1080.jpg?t=1574239886,https://cdn.akamai.steamstatic.com/steam/apps/1147500/ss_534516840021340acabfa3a18cac4f26e560c503.1920x1080.jpg?t=1574239886,https://cdn.akamai.steamstatic.com/steam/apps/1147500/ss_ee36c1c17daa2f5619fca2a171b48afbf497284a.1920x1080.jpg?t=1574239886,https://cdn.akamai.steamstatic.com/steam/apps/1147500/ss_a810edc25ad2a7db19e5fa6e0929cc69e0de8a2f.1920x1080.jpg?t=1574239886",
    "Slug": "a-gay-s-life",
    "Meta Title": "A Gay's Life: Nov 20, 2019, 橙光游戏 and Full Overview",
    "Meta Description": "Looking for information on A Gay's Life? Check out the release date (Nov 20, 2019), developer insights from 橙光游戏, and a complete game summary.",
    "Alt Text Image": "Official header image for A Gay's Life game - Steam 1147500",
    "Canonical URL": "https://gusku.site/game/a-gay-s-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Gay's Life\", \"description\": \"Looking for information on A Gay's Life? Check out the release date (Nov 20, 2019), developer insights from \\u6a59\\u5149\\u6e38\\u620f, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 20, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1147500/header.jpg?t=1574239886\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}