{
    "AppID": 473690,
    "Name": "Absolver",
    "Release date": "Aug 29, 2017",
    "About the game": "In the ruins of the fallen Adal Empire, you awaken with a mysterious mask on your face, and faint recollections of an esoteric ceremony. Freeing you from hunger, thirst, and even death, the mask is the creation of the Guides, the rulers of these lands, who have placed you here to determine whether you are worthy of becoming part of the elite corps of Absolvers. As you wander these forsaken lands, encountering other Prospects like you, you will learn new combat styles, acquire weapons, gear and armor, and build a team of warriors with whom to fight side by side in Arenas of combat. Please visit the official Absolver FAQ on the Steam discussion board for more information: / Fluid Real-Time Combat: Position yourself in one of four tactical stances during real-time battles and execute devastating attacks, dodges, and parries. Movement becomes your weapon as you engage in solo duels or intense multiplayer melee battles. Customizable Style and Flow: Players will define their character’s playstyle by picking a combat style, a weapon of choice, and arranging attacks in their Combat Deck to design their unique and personal attack flow. Online Multiplayer Action and Narrative: Prospects and Absolvers will seamlessly encounter others in the world, generating unique stories that emerge through player interaction and choices. These moments are filled with tension as intentions to battle or befriend are never clear: trust is always a leap of faith. Encounters will have lasting consequences and transform into meaningful relationships as you make friends or enemies and find mentors or disciples. PvP and PvE: Explore a rich and dynamic world including dedicated PvP battle arenas where champions will receive spoils of victory and progress in the ranks of the Absolvers, and PvE areas in which players cooperatively battle to retrieve rare loot and equipment from the ruins of Adal. ABSOLVER CONTENT UPDATES The development team at Sloclap is dedicated to improving and expanding Absolver based on community feedback once the game is live. In the coming weeks and months, Prospects can expect regular updates to the game to fix any issues that appear, as well as both minor and major content updates. These updates already include 3v3 Game Mode and a Spectator Mode soon after launch, but many more updates can be expected, from new combat styles and moves to new powers and equipment. Please follow updates here and on absolver.com or @Absolver on Twitter for the latest.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/473690/header.jpg?t=1646729216",
    "Price": 29.99,
    "Developers": "Sloclap",
    "Publishers": "Devolver Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_dc5f89de22b1ff057b964265be745531fc73fafb.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_8280082749069cb6ea55add2473d77655c710119.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_670a712dcd53076ed4780ee4d25511e73ba959cd.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_d175ea00867219f9aeb6daf665bdf90c74251e15.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_ba8f0cd35d0134501130bf897dc32a8ea03db825.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_7c822701ed6580ee17041d2709ed877e3fffd46b.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_b90d981264ffe945d3dc411b596aa079c4e6db30.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_b1dbafd90b1f81fdf4a303e5e4e79990b4a578ca.1920x1080.jpg?t=1646729216,https://cdn.akamai.steamstatic.com/steam/apps/473690/ss_c4270fe1dcb79c08a0077fcfbd9965369aeaf201.1920x1080.jpg?t=1646729216",
    "Slug": "absolver",
    "Meta Title": "Absolver: Aug 29, 2017, Sloclap and Full Overview",
    "Meta Description": "Looking for information on Absolver? Check out the release date (Aug 29, 2017), developer insights from Sloclap, and a complete game summary.",
    "Alt Text Image": "Official header image for Absolver game - Steam 473690",
    "Canonical URL": "https://gusku.site/game/absolver",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Absolver\", \"description\": \"Looking for information on Absolver? Check out the release date (Aug 29, 2017), developer insights from Sloclap, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 29, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sloclap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Devolver Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/473690/header.jpg?t=1646729216\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}