{
    "AppID": 1110210,
    "Name": "Adam's Ascending",
    "Release date": "Nov 22, 2020",
    "About the game": "In this first episode of the Adam's Ascending saga, you will embark on a short, yet fulfilling journey that will reignite feelings of nostalgia from the more simpler times of gaming. - No radars. - No hints. - No hand holding. - No Auto-Saving. You'll only have your wits and game environments to lead the way. The course and progression of the story path is entirely in your hands. And while this may make the game more difficult, the overall experience will be much more rewarding and eye opening at the end. Explore the mysterious island of Damascus: a powerful, and dimensional paradise that holds the past, present, and future of your soul. Choose your gameplay style by the paths you take. Will you make the decision to take on the world with physical strength or supernatural powers? The choice is yours. New found awakening awaits every step, and there's only your instinct to guide you. The world of ADAMS ASCENDING is filled with secrets and mysteries to drive the story forward. Embrace discovering the worlds puzzles, hidden passages and solving the deepest riddles of your own soul. Death is only the beginning of a new timeline in making change. Survive in the dimension of your soul as you take on spiritual and physical enemies, obstacles, and the journey to survive through your own purpose. Life and death will be in the power of your decisions. You play as Adam, a paralyzed explorer searching for your father who disappeared after discovering the potential cure to all diseases. After a chain of events leads our explorer to an unknown island with supernatural powers, he discovers clues to where his father could be. It's up to Adam to use the abilities he has been granted to search for the truth. Investigate why and how he's arrived into this phenomenon, but most importantly who he needs to become to find his father and return home. A supernatural exploration set in a dimension island of the soul. Multiple choice gameplay paths with purpose driven challenges. ​Unique environments that hold the secrets of life's mysteries from the past and future. ​Narrative driven pacing, focused on storytelling with detailed and captivating atmosphere that drives the players own purpose. ​Environmental puzzles that involve the player to use their own spirituality to solve the world's mysteries. ​Manipulating the physical world through time altering powers discovered throughout the journey. ​Investigating environments to collect pieces of yourself and use the discovered objects to explore, solve, and survive. ​Music by Voltz Supreme. Official Selection: E3 Kinda Funny Games Showcase (2019) Official Selection: Kinda Funny Games Showcase (2018) Official Selection: The Bit Awards Featured in Rock Paper Shotgun Featured in TechRaptor Featured in Gematsu Hi Everyone! We have been working on Adam's Ascending over the last five years. This has been a journey of growth and revelation as a self taught developer. My hope with Adams Ascending is to be a voice for inspiring others to 'ascend' into their own dreams, no matter how impossible it may be. I'm humbled to have the opportunity to share the story of Adam's Ascending with the world. Thanks for your time! Keep inspiring. Best, Nick DePalo",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1110210/header.jpg?t=1634579962",
    "Price": 4.99,
    "Developers": "Parable Worlds",
    "Publishers": "Parable Worlds",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_c348c1d13bf9cdd1ddb7b9e6f43acef362c2985c.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_ffdc5523a5a1c6f53090cf7d008bfde463590700.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_423def47c2868df86c4adddee64d71aaa84b6199.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_fcaa0c2bdb62e00d6634d4dccef772cdeeadebef.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_949cab64ada7d059cc95f76aacd1196b71c1c2a7.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_522174fa1798e24d71dd477e6e43778d4531ddf3.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_74c2f51ddd0fece5228edb43ef99bcb911573067.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_faf6c836c003e4bd1fae669946ce74d44e6b4d97.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_1633b13f7260ec44e6a94ce38011b2b0a69caddf.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_ddcad478d66994b37358c0f43276e98d8f0a008c.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_29fe1f58f94b195b0ec4c11320499e9d19f9eace.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_1fcd01e99ddf2771487522aed91eaa36861a2604.1920x1080.jpg?t=1634579962,https://cdn.akamai.steamstatic.com/steam/apps/1110210/ss_322107dd065f2ab50f6e2fef88ab1e4ebfa24571.1920x1080.jpg?t=1634579962",
    "Slug": "adam-s-ascending",
    "Meta Title": "Adam's Ascending: Nov 22, 2020, Parable Worlds and Full O...",
    "Meta Description": "Looking for information on Adam's Ascending? Check out the release date (Nov 22, 2020), developer insights from Parable Worlds, and a complete game summ...",
    "Alt Text Image": "Official header image for Adam's Ascending game - Steam 1110210",
    "Canonical URL": "https://gusku.site/game/adam-s-ascending",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adam's Ascending\", \"description\": \"Looking for information on Adam's Ascending? Check out the release date (Nov 22, 2020), developer insights from Parable Worlds, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 22, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Parable Worlds\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Parable Worlds\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1110210/header.jpg?t=1634579962\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}