{
    "AppID": 1034040,
    "Name": "Causa, Voices of the Dusk",
    "Release date": "May 26, 2021",
    "About the game": "Causa, Voices of the Dusk is an intriguing collectible card game in which your decisions will change the course of the game. Sacrifice cards to raise your Cause, and bring them back later to achieve the most strategic plays. Prove your abilities battling other players, and draft your way to Victory in extremely challenging campaigns. SACRIFICE CARDS AND BRING THEM BACK LATER FOR STRATEGIC PLAYS. The game presents an unprecedented resource system: sacrifice cards from your hand or your board to raise your Cause, and bring back these cards back later in the game to take the most out of your strategy. A HAND FULL OF POSSIBILITIES. At the beginning of your turn you’ll draw cards until fully replenishing your 4-card hand , and you’ll be able to play up to two cards per turn , as long as you meet the Cause requirement. When playing cards, your Cause isn’t consumed. This allows for a dynamic yet highly strategic gameplay with countless possibilities. CHANGE THE COURSE OF THE GAME WITH YOUR LEADER DECISIONS. As you raise your Cause, you’ll unlock each Leader’s unique set of powerful abilities. Tough decisions made wisely will likely change the course of the game. Combine your Leaders with different decks for unique gameplay experiences. DRAFT YOUR WAY TO VICTORY. Explore a vast and exotic fantasy world in extremely challenging draft Campaigns. Face the unexpected and obtain special rewards. PROVE YOUR ABILITIES IN THE RANKED MODE. Progress through the 12 Ranks in the Path of the Player. At the end of each Season, get special rewards according to your Rank. FEATURES Unique tactical gameplay with complex strategic options: - Sacrifice cards from your hand or your board to build up your resources - Play up to two cards per turn - Bring sacrificed cards back to the game for the most unexpected critical plays - Full replenishment of your 4-card hand at the beginning of your turn - Take advantage of special effects that allow you to draw, sacrifice, play and bring additional cards back to the game - ‘Leader’s Decisions’: use each Leader’s unique set of powerful skill to change the course of the game - And more Multiple paths to victory. Choose between multiple powers, factions and Leaders. Battle other players and increase your Rank in the Ranked Mode. Prove your abilities and win rewards in extremely challenging single-player draft campaigns. Original and exotic fantasy world with rich narrative experience. Cross-platform play (PC, Consoles, and Mobile).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1034040/header.jpg?t=1622033887",
    "Price": 0.0,
    "Developers": "Niebla Games",
    "Publishers": "Niebla Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_17ffe352e1dfdce21d8022a71cb832360619e2aa.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_6b1620336e6601147c2f10e51dbb0f50e3b3db74.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_bd3c099a5a7c4de4e59df6baf0b046164baff72a.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_fe93298803e78c7e5d2fa94f3e8b7cc1ef66d538.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_428ae68eafa2e5138daec0d6db7140e520a18041.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_172f91704c7403ed2b46fe44049fdeb5d4aa8acc.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_bb3bce95af1fbc3ea76d774e4eab6a39d4fce0c0.1920x1080.jpg?t=1622033887,https://cdn.akamai.steamstatic.com/steam/apps/1034040/ss_c8df981c98a18a5e48268c24f2503624f8001c2f.1920x1080.jpg?t=1622033887",
    "Slug": "causa-voices-of-the-dusk",
    "Meta Title": "Causa, Voices of the Dusk: May 26, 2021, Niebla Games and...",
    "Meta Description": "Looking for information on Causa, Voices of the Dusk? Check out the release date (May 26, 2021), developer insights from Niebla Games, and a complete ga...",
    "Alt Text Image": "Official header image for Causa, Voices of the Dusk game - Steam 1034040",
    "Canonical URL": "https://gusku.site/game/causa-voices-of-the-dusk",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Causa, Voices of the Dusk\", \"description\": \"Looking for information on Causa, Voices of the Dusk? Check out the release date (May 26, 2021), developer insights from Niebla Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Niebla Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Niebla Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1034040/header.jpg?t=1622033887\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}