{
    "AppID": 835490,
    "Name": "Deadly Stigma",
    "Release date": "Aug 25, 2018",
    "About the game": "(Steam Cards are coming soon!) Deadly Stigma Features: Gameplays There are 2 types of gameplay: • Survival , where the main target is to save your robot from destruction. • Protection , where you need to save the Life Capsule from complete destruction in addition to saving yout robot. Modes: After choosing the gameplay, you need to choose the mode. Right now there are 3 types of modes: • Hardcore - In this mode, there is a double difficulty from the start. • Classic - There are no special features. Just a 'Classic' shooter. • Cheat - The main feature of this mode is a special window for controlling a lot of parameters. You have complete freedom of actions. You can also choose a difficulty of a game and time limits. Game Locations Each of the gamemodes in the game has its own map. Every map was remade many times to play them as interesting as possible. Variety of Enemies You have to fight against 11 different types of enemies. All of them are unique. Huge Arsenal You have to take 5 guns, 1 special ability, and 1 melee weapon in the battle. The game has 19 types of guns (there is an image showing them all at the end of description), 6 types of special abilities and 4 types of melee weapons. Shop You can improve the characteristics of your robot (movement speed, jump height, the amount of health, speed of its regeneration and armor). You also can increase the damage of a specific weapon or the entire robot damage. In the shop section, you can purchase turrets and traps that will help you in the destruction of enemies. Buildings As it was written above, turrets and traps can be purchased in the shop. All types of buildings are unique, but you need to choose which one to buy because each of them is effective only for a certain situation. At the moment, the game has 6 types of turrets and 4 types of traps. P.S: A little about the developers: This is the debut project of our new Studio Black Dragon Games, consisting of two people. Originally we planned a lot of content, but we couldn't make it. But we hope that you will like this game, because, despite its simplicity, it was made with love. We appreciate any opinion about the game, whether it is positive or negative. Thanks to everyone who bought it or recommended it to anyone!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/835490/header.jpg?t=1560493516",
    "Price": 0.98,
    "Developers": "Black Dragon Studio",
    "Publishers": "Black Dragon Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/835490/ss_bd1448d37426d96ef1e7d5d33ae551c4c489154c.1920x1080.jpg?t=1560493516,https://cdn.akamai.steamstatic.com/steam/apps/835490/ss_c9afd1bd806aa99e9a6a3e88a9a9e7800fd2917a.1920x1080.jpg?t=1560493516,https://cdn.akamai.steamstatic.com/steam/apps/835490/ss_1fc38d85a0677051cd20e0b963fa6f7c504c510a.1920x1080.jpg?t=1560493516,https://cdn.akamai.steamstatic.com/steam/apps/835490/ss_1ad0adc19f924bf827aa067adc20ca4128884a32.1920x1080.jpg?t=1560493516,https://cdn.akamai.steamstatic.com/steam/apps/835490/ss_287299cb330730fad52aaa5cf9a808b47361e268.1920x1080.jpg?t=1560493516,https://cdn.akamai.steamstatic.com/steam/apps/835490/ss_f525756b53ac18c2d8f8250a5db391873f73e75b.1920x1080.jpg?t=1560493516",
    "Slug": "deadly-stigma",
    "Meta Title": "Deadly Stigma: Aug 25, 2018, Black Dragon Studio and Full...",
    "Meta Description": "Looking for information on Deadly Stigma? Check out the release date (Aug 25, 2018), developer insights from Black Dragon Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Deadly Stigma game - Steam 835490",
    "Canonical URL": "https://gusku.site/game/deadly-stigma",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deadly Stigma\", \"description\": \"Looking for information on Deadly Stigma? Check out the release date (Aug 25, 2018), developer insights from Black Dragon Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 25, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Black Dragon Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Black Dragon Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/835490/header.jpg?t=1560493516\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.98, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}