{
    "AppID": 323190,
    "Name": "Frostpunk",
    "Release date": "Apr 24, 2018",
    "About the game": "END OF THE ROAD Since the premiere, Frostpunk has been enriched with a number of updates. You can enjoy the new Endless Mode (with 3 ways of playing it) that increases the replayability of the game. There is also a new scenario - The Fall of Winterhome , that further expands the game’s universe and lore. And for the dessert, we’ve added things like naming characters and automatons and finally a photo mode . All of this is available for free for all the owners of the game. There are also three expansions, available with the paid Season Pass . At the same time we would like to inform you that we are not planning to create any more content for Frostpunk, as this journey is over for us, but there are more to come in the future, so be sure to keep an eye out for our games. Of course the game will still receive patches and fixes and we’ll provide the technical support. SEASON PASS The Official Season Pass for Frostpunk is out and complete! It grants you access to all additional content released for the game since the premiere, including three expansions ( The Last Autumn , On The Edge and The Rifts ), that widely broaden the main story and fill a lot of gaps in the game’s universe. What’s more, when you’re done with the game itself, you’ll be able to unwind while listening to the Digital Soundtrack featuring orchestrated music or learn more about the world with the exclusive Digital Artbook . CLICK FOR MORE SEASON PASS INFO Not having the game at all? Worry no more, as the Frostpunk: Game of the Year Edition is what you are looking for. It includes the main game, season pass and all exclusive content at a discounted price. ABOUT THE GAME THE CITY MUST SURVIVE Frostpunk, the newest title from the creators of This War of Mine, is a society survival game where heat means life and every decision comes at a price. In an entirely frozen world, people develop steam-powered technology to oppose the overwhelming cold. You face the task of building the last city on Earth and securing the means necessary for your community to survive. Optimization and resource management often clash with empathy and thoughtful decision-making. While city and society management will consume most of the ruler’s time, at some point exploration of the outside world is necessary to understand its history and present state. What decisions will you make to ensure the survival of your society? What will you do when pushed to the limit? And who will you become in the process? MAKE THE LAW Establish laws that regulate the existence of your growing society. Decide on their working routine, healthcare, food provision and other crucial aspects of everyday life. Maintain their hope and contentment – the moral condition of your society is as important as securing the basic means to keep them fed and safe. SHAPE YOUR SOCIETY If you reach a turning point, do not hesitate to determine the path of your people. Should you rule them with an iron fist... or show them a way of compassion and faith? Reach for extremes or try to find a fair balance. Whichever you choose, remember: there’s no turning back. WEIGH UP YOUR CHOICES Some of your decisions will seem small – like deciding the fate of a troubled citizen or meeting the demands of a newborn faction – but be aware that the sum of your doings can lead to unexpected results. Your people put their faith in you, but their devotion is not limitless. Leadership can be a burden. DEVELOP NEW TECHNOLOGIES Survival demands progress. React to current events, but don’t forget about the long term and investing in development and technological progress. Providing a highly advanced infrastructure with self-powered automatons, airships, and other technical wonders is difficult, but achievable. It all depends on your management and leadership skills. EXPLORE THE FROSTLAND While New London is your main focus, there is much more to the world than what lies within the limits of your city. Expeditions, while risky, can bring you valuable intel, precious supplies and grow your society’s population. There may be people out there, and their fate lies solely in your hands. PLAY ENDLESSLY Frostpunk Endless Mode grants you unlimited replayability for the game. Play on 8 various maps, with different terrain, weather conditions and challenges to face. We know that different people look for different experiences and that’s why there are 3 modes to play in Endless Mode. Endurance will be an ultimate test to your building, managing and survival skills in the harshest conditions. Builders, where there is no generator available from the start, which creates a different type of challenge. And last but not least, Serenity which is focused on enjoying the art of building the city itself, without unnecessary pressure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/323190/header.jpg?t=1655979223",
    "Price": 29.99,
    "Developers": "11 bit studios",
    "Publishers": "11 bit studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_98f6b65baef49d0557a04aa701c1b72b66b33c55.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_2fc6ed1e46755d6ad6091d8c1f75d94b912d1144.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_28db92509d505c855b07d480d749119fc147c84c.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_710aea3085400765ce450261ecb405ab1207552c.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_03fc3089daf0785e3bf34b32c385e80defefaeb4.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_a14917814ab134f26326aca4b97dadf1c9db060b.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_3bc7fec657def7156a22aae79e303492015c2b0e.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_680799fc8f335607924c5703e10eb62780f91d97.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_5f9c9d5944a98b68b3b57c418f4267a459c757f8.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_9f89445fe1e07acc39d3537037f33eb90ad5834e.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_4257ced5cb8e2409547363316611c4cd4d718578.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_9607dc7618a72e189f17d09e9b42a93ae8ee648c.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_6462337ad7ec4e705a501e7121aa1de7d9013dcb.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_42de814e59e57ed5344b2b65d88be7cb244cf482.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_7828d395f976c49ecc7ffd6b54e691dd215359db.1920x1080.jpg?t=1655979223,https://cdn.akamai.steamstatic.com/steam/apps/323190/ss_d95817fcc99dac8392d3e6666a0355dc9ecaefff.1920x1080.jpg?t=1655979223",
    "Slug": "frostpunk",
    "Meta Title": "Frostpunk: Apr 24, 2018, 11 bit studios and Full Overview",
    "Meta Description": "Looking for information on Frostpunk? Check out the release date (Apr 24, 2018), developer insights from 11 bit studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Frostpunk game - Steam 323190",
    "Canonical URL": "https://gusku.site/game/frostpunk",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frostpunk\", \"description\": \"Looking for information on Frostpunk? Check out the release date (Apr 24, 2018), developer insights from 11 bit studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"11 bit studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"11 bit studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/323190/header.jpg?t=1655979223\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}