{
    "AppID": 1448260,
    "Name": "下一站江湖Ⅰ",
    "Release date": "Apr 1, 2021",
    "About the game": "'Next Jianghu I', pure martial arts sandbox single game! (at present, four large DLCs have been released in succession: Fengqi southwest, Luocheng wind, Dangkou storm, Jingfeng Cangyin record) It integrates exploration and challenge, martial arts adventure, martial arts collection, teammate cultivation, school building, and identity playing methods to realize your own swordsman dream. Next Jianghu I: official group: (group 1: 978574834; group 6: 751450728) Player exchange, official interaction, opinion collection. [game features] 1. One week's eyes: small shrimps wandering in the world - multi branches and multi endings. There are more than 20 endings waiting for you to explore. Behind each event, you will be faced with a variety of choices, and different choices will bring you different fates. Whether you are the leader of the Wulin alliance, or the devil dominates the right path, or even the Duke of the East chamber, you will join the prime minister. 2. In the second week, he built his own school system. At the beginning of the second week, players can choose a different life: self built school. (at present, Longyin mountain villa, which can be ruled by the king, and the Anti Japanese beggars' sect, which has no equal loyalty and righteousness, have been opened up; in the follow-up, Dajiang Water Transport Association, which is incomparably rich, and majestic Shaolin in Buwu world, have opened up their own school system.) 3. Three weeks, more initial identity life (PS: in the previous version feedback, some players think that it takes too long to open three weeks, so we will cancel three weeks and put more initial identity playing methods into one week and two weeks, please look forward to it) The village restaurant boys (the latest version of jingfengcangyinlu has been opened), the rich dandy in Luoyang, the depressed prince in the Imperial City, the poor scholar in Jiangnan who went to Beijing for ten years. 4. Many women. When facing more than one beautiful woman to show love, you don't have to be bound by the plot. You can choose the one you like to accompany you for a lifetime. Of course, before choosing, you need to get their love. 6. The plot is rich. The plot volume of millions of words constructs a huge martial arts world. There are hundreds of branches, and there is always a way you want to go. 6. Many schools. Sixty sects in the river and the lake are either good or evil, enemies or friends. Whether you can learn the martial arts of the sect and join the sect depends on how you act. 7. Super high degree of freedom. In the sandbox world with high degree of freedom, you can roam the rivers and lakes freely regardless of the main line, make friends all over the world, and go all over the mountains and rivers in search of treasure. 8. It's a game of chess and round. In the strategic chess style round combat, the protagonist can choose weapons freely and match skills freely, bringing unprecedented fighting experience. 9. Skills match freely. There is no strongest martial arts, only the strongest person, experience the real sense of internal skill and move through. (the same qishang fist and Toad skill are different for different people.) 10. What an adventure Adventure is everywhere in the river and lake. Danger and opportunity coexist. It's full of adventure spirit and interest. At the same time, it will bring different choices and lead to different destiny. 11. Team mate development. You can make friends with many swordsmen, cultivate them, explore the world together, and understand advanced martial arts.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1448260/header.jpg?t=1646130180",
    "Price": 19.99,
    "Developers": "白玉京工作室",
    "Publishers": "成都搜发互娱网络科技有限公司",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_7239e7575c04043ab1edd620b4964733393d14c9.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_7110102da2924cafd72cfea868f8835b187426d2.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_ce8a1afba51c3ea8438da6367031f9771fe3a788.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_049e51f09dd2a6398ec42252612b961b4f9513b9.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_7b93bbc5d5186c740fe6ebc0cd2be2baa956c26e.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_946843f255fd3bacb67442f7a0fad95038e91368.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_2894479fdce784ba8bab8eb52ea7f0169a6ef2f4.1920x1080.jpg?t=1646130180,https://cdn.akamai.steamstatic.com/steam/apps/1448260/ss_0667846eef46286e875c22cc2dd77fc9e3428a25.1920x1080.jpg?t=1646130180",
    "Slug": "",
    "Meta Title": "下一站江湖Ⅰ: Apr 1, 2021, 白玉京工作室 and Full Overview",
    "Meta Description": "Looking for information on 下一站江湖Ⅰ? Check out the release date (Apr 1, 2021), developer insights from 白玉京工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for 下一站江湖Ⅰ game - Steam 1448260",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u4e0b\\u4e00\\u7ad9\\u6c5f\\u6e56\\u2160\", \"description\": \"Looking for information on \\u4e0b\\u4e00\\u7ad9\\u6c5f\\u6e56\\u2160? Check out the release date (Apr 1, 2021), developer insights from \\u767d\\u7389\\u4eac\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u767d\\u7389\\u4eac\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6210\\u90fd\\u641c\\u53d1\\u4e92\\u5a31\\u7f51\\u7edc\\u79d1\\u6280\\u6709\\u9650\\u516c\\u53f8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1448260/header.jpg?t=1646130180\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}