{
    "AppID": 1499800,
    "Name": "Geometric Sniper - Blood in Paris",
    "Release date": "Sep 9, 2021",
    "About the game": "Lots of news in this second game in the series: - Target shooting system, now on some missions in addition to worrying about completing the missions you will have to be careful not to be hit! - Cover system to protect yourself from enemy shots. - In some missions you will receive targets as you hunt, thanks to direct communication with intelligence agents. - New game mode (Mercenary); - New game mode (Survival); - Improvements in the particle system; - Now it can rain during your hunt increasing immersion in the game; - Now you can recover the lost points if you hit an innocent by accident, just pay the compensation to the family getting money in Mercenary Mode; - 4 different Rankings to challenge you to be at the top of the leaderboard; - Improved game AI; - And other news... Game Description: In Geometric Sniper - Blood in Paris you will have everything you loved in the first game (Geometric Sniper) and many other new features! Katy, a French sniper, needs to protect her magnificent city and prevent innocent lives from being lost. With increasingly challenging missions, you won't get a second chance. Accuracy is everything! As a Sniper you will have to pay attention to the details and look for the right moment for the shot. Your targets know they are wanted and will try to hide in a variety of ways. Have patience to take a clear shot memorizing the information for each mission. With live maps designed exclusively for this fantastic game, locate explosives and their targets in a crowd, buildings and other situations. This is a 2D sniper game like you've never seen! Game Modes: In all game modes the locations of targets and objects are random, so you can have a lot more fun! Help Andrew fulfill his missions to protect the people of this magnificent city! In 10 missions, one more challenging than the previous one, every detail counts: from carefully observing the mission information to finding the perfect shot opportunity. In this mode you will test your skills. After the end of the adventure mode, it will be enabled and you will have to complete the 10 adventure missions without the help of zoom and precision. With this mode a new ranking is also enabled. How fast and accurate can you be with these limitations? Who will remain at the top of the Sniper Elite? This game mode is released after completing the 6th mission, in it you can have fun with new challenges and get money to pay damages to the family of the civilian that you have mistakenly killed during the missions in modes (Adventure and Elite), by doing this the negative score will be removed and added to the scoreboard. This game mode will require all your skill to stay at the top of the leaderboard! Find randomly generated targets on the map while shooting look for you. The further you go, the more challenging the game will be! If you fail the mission and your points will be saved on the scoreboard and you will have to start your journey to beat your score or that of another player. Sharpen your precision even more! Have fun in this game mode where you will have 10 missions to find various objects scattered in the scenarios and hit them before time runs out. How fast and accurate are you able to shoot? Replay After the end of the adventure, you will also unlock the 'replay', where you can play the missions again seeking to reach the top of the ranking with the perfect shot. Ranking Who will stay on top? Who will be the fastest and most accurate Sniper? These questions will be answered here! There will be a rating for adventure, elite, mercenary and survival mode. Killing innocents in the game will result in a lot of lost ranking points, causing the ranking to drop, so be precise and hit the target!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1499800/header.jpg?t=1658695185",
    "Price": 1.99,
    "Developers": "YAW Studios",
    "Publishers": "YAW Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1499800/ss_c33789e7d74c687ba0f4be757a275792b2361e58.1920x1080.jpg?t=1658695185,https://cdn.akamai.steamstatic.com/steam/apps/1499800/ss_2292502dc370e814f0fd3fb4bdf55a2acb049352.1920x1080.jpg?t=1658695185,https://cdn.akamai.steamstatic.com/steam/apps/1499800/ss_96b5f8e7a8c4f0b3105ae94bc83b14db7ba22614.1920x1080.jpg?t=1658695185,https://cdn.akamai.steamstatic.com/steam/apps/1499800/ss_0c2aa9cd2e5b4deba9501dd8de49493345efa670.1920x1080.jpg?t=1658695185,https://cdn.akamai.steamstatic.com/steam/apps/1499800/ss_a6d84dbe0e3eb5a9fe1ed653b05969f0209139db.1920x1080.jpg?t=1658695185,https://cdn.akamai.steamstatic.com/steam/apps/1499800/ss_184c73aeffde112f1f13d4a5fc20b895e669e614.1920x1080.jpg?t=1658695185",
    "Slug": "geometric-sniper-blood-in-paris",
    "Meta Title": "Geometric Sniper - Blood in Paris: Sep 9, 2021, YAW Studi...",
    "Meta Description": "Looking for information on Geometric Sniper - Blood in Paris? Check out the release date (Sep 9, 2021), developer insights from YAW Studios, and a compl...",
    "Alt Text Image": "Official header image for Geometric Sniper - Blood in Paris game - Steam 1499800",
    "Canonical URL": "https://gusku.site/game/geometric-sniper-blood-in-paris",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Geometric Sniper - Blood in Paris\", \"description\": \"Looking for information on Geometric Sniper - Blood in Paris? Check out the release date (Sep 9, 2021), developer insights from YAW Studios, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"YAW Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"YAW Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1499800/header.jpg?t=1658695185\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}