{
    "AppID": 1119680,
    "Name": "Jade's Ascension",
    "Release date": "Mar 10, 2021",
    "About the game": "Jade’s Ascension is a local cooperative adventure – arcade game based on Chinese mythology. The players must coordinate themselves to overcome different rooms using common and unique skills from each character to defeat the creatures. In the faraway land of Mojolonia exists a tradition. When their emperors must leave the throne “Jade’s Ascension” is started, a trial to select the rightful heirs. From every corner of the empire, no matter the origin, the candidates are gathered to continue the dynasty. Fight in the trial for the ascension in Jade's Ascension with up to 4 players . Discover the main characters and the challenges that lie in wait for them in the towers based on the elements of nature. Cooperate with your partners to earn gold, defeat the enemies and upgrade your abilities to reach the highest level possible. And remember, the best emperor is the one who reaches the farthest. Don't stop playing until you have the best score! Key features 1-4 player local cooperative Play alone or with your friends! Choose one of the heirs to make your way to the top and become the emperor. Several enemies and final bosses You will encounter more than 20 enemies in the different towers and one final boss per tower. You will have to learn their attacks and defeat them before they surpass you. Prepare yourself to defeat the waves and fight against the final boss of each element! Upgrade your attack skills and life Upgrade the basic skills of your character to confront the adventure. Qilin offers you all the upgrades to increase the power of your shots and your character’s life. Multiple power-ups to help you in the game You can buy several objects to use while fighting. Each one of them has different effects that can help you. Our treasured Pixiu will offer all the available items in its shop. Different settings based on the elements of nature The towers are inspired by the elements of Chinese nature. Each one represents it's element in a very special and unique way.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1119680/header.jpg?t=1615400485",
    "Price": 11.99,
    "Developers": "Papas con Mojo Games",
    "Publishers": "Papas con Mojo Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1119680/ss_c87c17ec77d907553f48af1454e9fae9dae84f4b.1920x1080.jpg?t=1615400485,https://cdn.akamai.steamstatic.com/steam/apps/1119680/ss_f7e8fb3e9345f2b6782dea347fd8abbeafac12ab.1920x1080.jpg?t=1615400485,https://cdn.akamai.steamstatic.com/steam/apps/1119680/ss_5a55d9506a38c9fd3c648f19bb8e59f148c15ee1.1920x1080.jpg?t=1615400485,https://cdn.akamai.steamstatic.com/steam/apps/1119680/ss_7e3759cf261e5b5c34b1fae5c9931bd628307e9c.1920x1080.jpg?t=1615400485,https://cdn.akamai.steamstatic.com/steam/apps/1119680/ss_8c9bce4428e55dd3176789a8553a67a0ef488b50.1920x1080.jpg?t=1615400485",
    "Slug": "jade-s-ascension",
    "Meta Title": "Jade's Ascension: Mar 10, 2021, Papas con Mojo Games and ...",
    "Meta Description": "Looking for information on Jade's Ascension? Check out the release date (Mar 10, 2021), developer insights from Papas con Mojo Games, and a complete gam...",
    "Alt Text Image": "Official header image for Jade's Ascension game - Steam 1119680",
    "Canonical URL": "https://gusku.site/game/jade-s-ascension",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Jade's Ascension\", \"description\": \"Looking for information on Jade's Ascension? Check out the release date (Mar 10, 2021), developer insights from Papas con Mojo Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Papas con Mojo Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Papas con Mojo Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1119680/header.jpg?t=1615400485\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}