{
    "AppID": 600180,
    "Name": "Light Strike Array",
    "Release date": "Dec 22, 2017",
    "About the game": "Light Strike Array is a crystalpunk battle arena inspired by martial arts—and powered by VR. Featuring a one-of-a-kind movement system, a multifaceted team-based game mode, and a wide spectrum of motion controlled weapons, Light Strike Array challenges players in ways never experienced before. Gameplay: Heartbreak In Light Strike Array two Bands of up to three Shards each fight​ ​to​ ​destroy​ ​the​ ​enemy​ ​Heart​. Each Heart is protected by a powerful barrier called the Corona, which scatters the light of foes that would wander too close. In order to pierce the Corona, the teams must first gather strength by mining a resource called Salt ​. Salt ​ is used to crystallize new tools and weapons. Players fight for control of Salt beds scattered throughout the level, which produce Salt​ ​crystals ​ periodically. By relaying Salt back to the base and dissolving it in the Well, the Heart grows in strength, and the Band gains access to more powerful tools and weapons. Under the protective cover of the final tool, the Censer , Shards can enter the Corona and strike at the enemy heart! The Torchwave Locomotion System Light Strike Array features an original locomotion system called Torchwave ​. Each map is broken into a series of Cells ​, hexagonal platforms under 2 meters across. Normally, players are restricted to the confines of their Cell. However, by pulling the trigger, a Shard forms a Torch ​, which can be cast toward another Cell. If the throw is true, the Shard phases out of reality. Now intangible, the player is invisibly teleported to the destination. When the torch arrives, the Shard rematerializes - but unless they turn around and catch​ ​the​ ​incoming​ ​Torch , they 'crash,' leaving them momentarily defenseless! A competitive game is only as deep as its movement system is robust—and VR locomotion is a brave new world. Light Strike Array tackles these challenges together: the teleportation-derived design mitigates the risk of motion sickness , and the physical act of throwing the torch adds a natural skill cost to long-range movement, incentivising players to mix teleportation and local movement. Tools and Weapons With each completed Pillar of Salt, the Heart forms new tools ​ ​for the Band. Light Strike Array features a brilliant spectrum of tools and weapons, each with unique abilities balanced around their physicality . For example, a patient and precise Shard might take the Rod ​ ​to intimidate and blast enemies from afar. A more agile and aggressive player might wield the Sword ​, a close-range weapon with a wide variety of sweeping strikes. Naturally, for those looking for something more straightforward, there's always the Bow . Not every tool is a weapon, however! The Vial ​ is a portable reserve that dissolves and transports halite crystals in bulk. A catalyst for rapid Salt growth, its usefulness is only limited by your skill with the Torch. For the tactically-minded, consider the Focus ​. Weave mystic signs to shape your inner light, and invoke powerful spells to support your allies. The tools vary greatly in physicality, technicality, and versatility. Only by knowing your allies’ strengths and weaknesses, and picking the right tool for the right job, can your Band outshine all the rest!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/600180/header.jpg?t=1523120331",
    "Price": 24.99,
    "Developers": "Unwieldly Systems",
    "Publishers": "Unwieldly Systems",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_f9f902668f97a139902467d458e084b98c3cdfa6.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_317d8800e5ff0a77eade569e9f784d96c269eb22.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_1a8a9ffdb0c43cf39b9849fb352468f250db80f7.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_4b3870063c52511163931085312de47abaf1b5d8.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_2dc30da29daa383e8ca81065683c6326189fc2f2.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_d03da8ae04ddf1e881eebd94640f64ef871b00f3.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_e780278b6acc238b395feea900ceaa20a79a012e.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_1223292f460c29e60a99d65bceb570c355b6b143.1920x1080.jpg?t=1523120331,https://cdn.akamai.steamstatic.com/steam/apps/600180/ss_c6450f291af48d30fc3f987ab1be8d96f0801306.1920x1080.jpg?t=1523120331",
    "Slug": "light-strike-array",
    "Meta Title": "Light Strike Array: Dec 22, 2017, Unwieldly Systems and F...",
    "Meta Description": "Looking for information on Light Strike Array? Check out the release date (Dec 22, 2017), developer insights from Unwieldly Systems, and a complete game...",
    "Alt Text Image": "Official header image for Light Strike Array game - Steam 600180",
    "Canonical URL": "https://gusku.site/game/light-strike-array",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Light Strike Array\", \"description\": \"Looking for information on Light Strike Array? Check out the release date (Dec 22, 2017), developer insights from Unwieldly Systems, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Unwieldly Systems\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Unwieldly Systems\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/600180/header.jpg?t=1523120331\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}