{
    "AppID": 1309610,
    "Name": "Line War",
    "Release date": "May 5, 2022",
    "About the game": "ATTENTION: LINE WAR DOES NOT YET HAVE A SINGLE-PLAYER MODE OR AN AI TO PRACTICE AGAINST. LINE WAR IS AT THIS POINT IN TIME A 1V1 PLAYER-ONLY RTS GAME Inspired by classic RTS titles like Command and Conquer with a nod to famed board game Axis and Allies, Line War combines elements of 4X, wargame, and real-time tactics genres into a unique strategic experience for veterans and newcomers. Line War’s versatile control system allows players to quickly and intuitively issue commands by drawing lines across the battlefield to move units, form defensive lines, engage enemies and conquer territories. Configure your command lines to filter out certain units to flank your enemies, dig-in or feed distant frontlines. This game has a never-before-seen approach that lets you focus on drawing commands and executing a strategy rather than managing individual units. Chain commands and execute orchestrated operations for coordinated attacks against your opponent. This command system sets Line War apart from other strategy games. Line War features a single traditional, recognizable army to ensure the game’s focus is on balance and strategy. Each unit plays a distinct and carefully balanced role. Land Units: Infantry, Commando, Artillery, Tank, SAM Air Units: Helicopter, Interceptor, Striker, Bomber, Transport Jet, Rocket Naval Units: Landing Craft, Destroyer, Missile Ship, Cruiser, Submarine Line War focuses on strategy . We've designed the game around the typical RTS problems to remove the steep learning curve and need for ultra-fast micro-management so you can focus on planning and executing a strategy. Draw Commands. Create movement and attack commands by drawing directly onto the map, giving players flexible control over unit actions. Replay Again &amp; Again. Randomly generate asymmetrical worlds to ensure no match or strategy is ever the same. Select Your Starting Location. Choose where to begin in each world in an innovative and fair 'picking phase' to gain your initial territory. Focus on Strategy. Plan and strategize to achieve success on the battlefield. Actions Per Minute (APM) aren't crucial for success in Line War - strategy and planning are. Conquer Territory. Expand your influence and acquire resources through territory control. The more land you have, the more you’ll be able to build. Manage Resources. Produce energy with refineries and power plants for sustained mobility of tanks, air force, and naval vessels. Control One Army. Line War features a single traditional, recognizable army to ensure the game’s focus is on balance and strategy. Build. Build. Build. From barracks to refineries, ports to power plants, choose from dozens of unique structures. Build towns, cities, industries, and trade routes to earn resources and expand your forces.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1309610/header.jpg?t=1655716821",
    "Price": 19.99,
    "Developers": "Studio Centurion",
    "Publishers": "Studio Centurion",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_1b87a8e2593b029bb0466301a520f5923117c187.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_ee08b819537789d2658fbaae6efdc3391dc35502.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_cb35657b611865664fcf72e90329f226f8b6124b.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_5a94d87a38e106b79dacb361b25c2e5f4455b9d3.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_ffc63e2d93d615cc20da48b1bd96b290968253be.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_ff4c48e3efe6c9a812836f167e44764035f291c1.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_d82ebd140781e26ec450db50e1654132ea9c3a9b.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_6bbce3fb910346c42b1a8fa77023c8defc735d07.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_0b8e4cd180bd64a80b9ac5a8506d89247fe86a03.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_012b6183a019cb6e7a69d3e0f7b05e94be7f812f.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_43c3ac7c95da20591decd4c2b260f5efe2fad928.1920x1080.jpg?t=1655716821,https://cdn.akamai.steamstatic.com/steam/apps/1309610/ss_ff26909a4cbc8c4949ed2b8c12603de10bb05029.1920x1080.jpg?t=1655716821",
    "Slug": "line-war",
    "Meta Title": "Line War: May 5, 2022, Studio Centurion and Full Overview",
    "Meta Description": "Looking for information on Line War? Check out the release date (May 5, 2022), developer insights from Studio Centurion, and a complete game summary.",
    "Alt Text Image": "Official header image for Line War game - Steam 1309610",
    "Canonical URL": "https://gusku.site/game/line-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Line War\", \"description\": \"Looking for information on Line War? Check out the release date (May 5, 2022), developer insights from Studio Centurion, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 5, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Centurion\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Studio Centurion\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1309610/header.jpg?t=1655716821\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}