{
    "AppID": 1552600,
    "Name": "Mage Drops",
    "Release date": "Mar 19, 2021",
    "About the game": "Mage Drops is a golf-like platformer with a fantasy twist. Combining traditional golf &amp; mini-golf with elements of puzzle platforming, it evolves the hit-and-wait formula of golf by adding *magic*! You play as The Mage - a young wizard travelling across the multiverse. As you advance through 8 unique worlds, learn to master your arcane powers to solve weird &amp; mind-bending challenges. Harness your abilities to manipulate physics. Solve puzzles. Discover collectibles. And learn the secret of the Mage Drops… Mage Drops is a challenging physics-based platformer, with a myriad of magical mechanics! Gameplay requires carefully honed skills and picking the right arcane approach is key. Influence shots mid-flight with magical abilities: 🔥 Burn away obstacles with fire ✨ Use magic rings to gain the power of flight 🔮 Enchant airstreams and detonate ancient explosives to propel you across the level &amp; More! Enchant environments to your advantage: 🌲 Grow plants into new platforms 🗻 Lure dangerous creatures away to clear a path forward Discover 8 unique worlds in the final game, including: a forest, an underwater oasis, machine world, and the cosmos! Each environment has its own magical possibilities, secrets, and traps. Some can be used to your advantage, and some provide tricky hazards. Shots can cling to jelly walls, bounce off bubbles, be propelled by explosions, and float on clouds. Giant flowers can suck shots in and spit them out. Living bushes can block the shots. Some puzzles even hide secret collectibles &amp; lore tied to the game’s true ending. Explore and experiment to uncover the unique possibilities of each biome! Starry skies. Bright beautiful worlds. Lush forests. Underwater lagoons. Floating clouds. And relaxing music. Perfect for when you need a cosy chill-out game, with hidden depths and challenge. REVIEWS 'A stunning looking platformer that puts a twist on the golf genre' –As We Play 'A glorious entry into the puzzle and golfing genre' –Beta Tested Game Reviewed “If you like puzzle games and golf I highly recommend wishlisting Mage Drops” –Ready Set Indie Games “If you're up for a challenging new spin on a classic game, Mage Drops is the physics-based 2D-platforming golf-like game for you!” –NerdLovesGeek “It really shines through, the idea of taking a very simple mechanic and getting as much fun out of that mechanic as possible…It’s essentially like a golf game…then they add to that brilliant effects and magic…it’s easy to play difficult to master” –Raccoon Media Cafe “You’re no longer just trying to make your ball land in the right spot to make your next shot easier, you’re now trying to navigate a weird magical obstacle course. Even the way you control the ball is different…because you’re a mage, you can stop or accelerate your ball mid-air, and you can magically control some of the obstacles, making the environment interactive. Mage Drops feels like a golf game, just not like any other golf game I’ve ever played.” –CSHPicone, Steam Curator Mage Drops is being created by the Aussie/London indie studio, Orchid of Redemption. The team is dedicated to developing carefully-crafted minimalist games that create an atmosphere of peacefulness, magic, and mystery.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1552600/header.jpg?t=1635988333",
    "Price": 12.99,
    "Developers": "Orchid of Redemption",
    "Publishers": "Lamplight Forest",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_d43bb5dfec1cccb4ebc056734123f3d7fd7387e5.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_c99243b6c81ae7b9cc8df2f3c2e2f1453f19021f.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_474e97760e93771bd5195cefd8375dfd07edfd49.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_67c91681711be9fb2c86ed0b60db459865d5d871.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_32716d269efbd91edff2e7abf9c24a66b85cdbc2.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_0f54da31d02a3b06192909b11672bf15351e9dd4.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_ac3781a0f6fe4c76f4c5c19f395691f55578398f.1920x1080.jpg?t=1635988333,https://cdn.akamai.steamstatic.com/steam/apps/1552600/ss_9714db5180223c50c5b92efdabfb0af1774f8cb8.1920x1080.jpg?t=1635988333",
    "Slug": "mage-drops",
    "Meta Title": "Mage Drops: Mar 19, 2021, Orchid of Redemption and Full O...",
    "Meta Description": "Looking for information on Mage Drops? Check out the release date (Mar 19, 2021), developer insights from Orchid of Redemption, and a complete game summ...",
    "Alt Text Image": "Official header image for Mage Drops game - Steam 1552600",
    "Canonical URL": "https://gusku.site/game/mage-drops",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mage Drops\", \"description\": \"Looking for information on Mage Drops? Check out the release date (Mar 19, 2021), developer insights from Orchid of Redemption, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Orchid of Redemption\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lamplight Forest\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1552600/header.jpg?t=1635988333\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}