{
    "AppID": 287980,
    "Name": "Mini Metro",
    "Release date": "Nov 6, 2015",
    "About the game": "In Mini Metro, you take on the task of designing the subway layout for a rapidly expanding city. Your city starts with three stations. Draw routes between these stations to connect them with subway lines. Commuters travel along your lines to get around the city as fast as they can. Each station can only hold a handful of waiting commuters so your subway network will need to be well-designed to avoid delays. The city is growing. More stations are opening, and commuters are appearing faster. The demands on your network are ever-increasing. You'll be constantly redesigning your lines to maximise efficiency. The new assets you earn every week will help immensely — as long as they're used wisely. Eventually your network will fail. Stations will open too quickly. Commuters will crowd the platforms. How long the city keeps moving is up to you. Key Features Compelling, constructive, hectic, relaxed gameplay. If that makes sense. It doesn't though, aye? You just gotta play it. Three game modes: Normal for quick scored games, Endless for stress-free sandbox play, and Extreme for the ultimate challenge. Build your metro exactly how you want to with the all-new Creative mode. Over two dozen real-world cities! Design subways for London, Paris, New York City, Osaka, Saint Petersburg, São Paulo, Istanbul, Auckland and many more! Each has a unique colour theme, set of obstacles, and pace. Random city growth, so each game plays out differently. A strategy that proved successful last game may not help you in the next. Each game's map is a work of art, built by you in the classic abstract subway style of Harry Beck. If you think it's a keeper, save it, tweet it, show it off, or make it your desktop background! Responsive soundtrack created by your metro system, engineered by Disasterpeace. Colorblind and night modes. Trains! Did we mention them yet? Vast library of player-created maps for you to explore in Steam Workshop! More from Dinosaur Polo Club You can find us on all the usual social media haunts like Facebook and Twitter . If you love Mini Metro, check out the highway-planning follow up Mini Motorways ! 'Mini Metro’s clean, stylish interface encourages me over and over again to make the trains run on time, and there’s a deeper amount of strategy to growing a sprawling metro system than meets the eye. I wasn’t just hypnotized by the rhythmic movement of trains from station to station, I was completely absorbed in making them perfect.' - IGN Demo You can check out Mini Metro for yourself and play a game on the London map in the demo .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/287980/header.jpg?t=1643317266",
    "Price": 9.99,
    "Developers": "Dinosaur Polo Club",
    "Publishers": "Dinosaur Polo Club",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_c7bc5df7e606504709e9f53ff9c7584ac4c01b18.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_540acc2e1e630b059c20e2887a22ca61eb323afe.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_f9561e067cc583fb8d39e8504aa94fecb2c1da21.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_0cf32a8483e4fa24b0953d80b778c915558a2a7f.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_a79dc2d5abc1c0f23cd83deb603da33e41a09e86.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_92bdb33bfa98412f6fe4a4e82a9ee769a6e0518f.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_dfab06581648248960ecf1390f7f5fac54c23d58.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_3274bd6ef4f2ea44a02f517f60d6332048f5a058.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_eb5bd99e2757aac961cc0774ca88cd1738fce79a.1920x1080.jpg?t=1643317266,https://cdn.akamai.steamstatic.com/steam/apps/287980/ss_59eb8258fcfe32686ec98d5ac9fc922cacaca412.1920x1080.jpg?t=1643317266",
    "Slug": "mini-metro",
    "Meta Title": "Mini Metro: Nov 6, 2015, Dinosaur Polo Club and Full Over...",
    "Meta Description": "Looking for information on Mini Metro? Check out the release date (Nov 6, 2015), developer insights from Dinosaur Polo Club, and a complete game summary.",
    "Alt Text Image": "Official header image for Mini Metro game - Steam 287980",
    "Canonical URL": "https://gusku.site/game/mini-metro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Mini Metro\", \"description\": \"Looking for information on Mini Metro? Check out the release date (Nov 6, 2015), developer insights from Dinosaur Polo Club, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 6, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dinosaur Polo Club\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dinosaur Polo Club\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/287980/header.jpg?t=1643317266\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}