{
    "AppID": 233290,
    "Name": "Murdered: Soul Suspect",
    "Release date": "Jun 3, 2014",
    "About the game": "THE HARDEST MURDER TO SOLVE IS YOUR OWN. Murdered: Soul Suspect is a supernatural detective thriller which challenges players to solve possibly the hardest case of all… their own murder. When Ronan O’Connor, a detective with a chequered past, gets caught up in a violent burglary, his life is brought to an untimely end by a brutal and relentless killer. Shocked to find himself in the afterlife, his only escape from the limbo world of ‘Dusk’ is to uncover the truth behind his killer, track him down and bring him to justice using his detective instinct and new-found supernatural abilities. As Ronan, you have the freedom to explore the modern-day town of Salem: its New England-style wooden houses, narrow streets, gothic churches and mental asylum for clues. Battle demonic spirits to save your soul and uncover the shocking revelations about who is responsible for your death. FEATURES: FEATURES: A dark, detective thriller with a supernatural twist: solving your own murder from the afterlife. A twisting storyline supported by a great cast of characters constantly raises questions over the secrets that Salem hides. Explore the world of the living and dead in Salem, a brooding city with deep-rooted ties to the supernatural and mysterious. Move freely from one haunting location to the next and even if you have completed your investigation, return to previous scenes to follow new leads. Investigate your murder using supernatural skills; possess people to read their minds, influence their thoughts, or see and hear what they know. Follow leads by walking-through walls and teleporting. Discover new information by revealing memories hidden in the Dusk or interrogating the dead. Use poltergeist skills to create distractions and learn further clues. Seek-out hundreds of collectibles, side-quests and cases from Salem’s citizens past to learn facts about the town and its people, improve your detective ranking and help you piece together the truth about the killer. Survive powerful demonic spirits who devour souls in a belief that they can regain their own. Strategically use supernatural abilities to evade and outwit them before they tear away your soul forever.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/233290/header.jpg?t=1503075903",
    "Price": 19.99,
    "Developers": "Airtight Games",
    "Publishers": "Square Enix",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/233290/ss_2c1a62199acb8180c5a09f626fb3cb828b036c7b.1920x1080.jpg?t=1503075903,https://cdn.akamai.steamstatic.com/steam/apps/233290/ss_b1bd50a27f82ac5983446e50beebd924277f97cd.1920x1080.jpg?t=1503075903,https://cdn.akamai.steamstatic.com/steam/apps/233290/ss_4ce384e13e414e41a90c4eff7e3e255192bedf13.1920x1080.jpg?t=1503075903,https://cdn.akamai.steamstatic.com/steam/apps/233290/ss_107666e81f151ba1f74a9994526abdc89d8bd544.1920x1080.jpg?t=1503075903,https://cdn.akamai.steamstatic.com/steam/apps/233290/ss_33ba538ece7773970e111a86ca5efeabeb125d40.1920x1080.jpg?t=1503075903,https://cdn.akamai.steamstatic.com/steam/apps/233290/ss_b3664bd76a54c77ba4fb5b615004f4f66c3d30c1.1920x1080.jpg?t=1503075903",
    "Slug": "murdered-soul-suspect",
    "Meta Title": "Murdered: Soul Suspect: Jun 3, 2014, Airtight Games and F...",
    "Meta Description": "Looking for information on Murdered: Soul Suspect? Check out the release date (Jun 3, 2014), developer insights from Airtight Games, and a complete game...",
    "Alt Text Image": "Official header image for Murdered: Soul Suspect game - Steam 233290",
    "Canonical URL": "https://gusku.site/game/murdered-soul-suspect",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Murdered: Soul Suspect\", \"description\": \"Looking for information on Murdered: Soul Suspect? Check out the release date (Jun 3, 2014), developer insights from Airtight Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Airtight Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Square Enix\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/233290/header.jpg?t=1503075903\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}