{
    "AppID": 1884030,
    "Name": "One Of The Victims",
    "Release date": "Apr 4, 2022",
    "About the game": "Story The game's story begins when you awaken in the middle of a forest with a rifle in your hands. While attempting to escape, Zombies appear out of nowhere and try to kill you. Even After Killing All Zombies, The Adventure Has Only Just Begun! After that, you'll find yourself in a house filled with traps to avoid and healing medicine kits to collect! After that, you'll return to the forest in order to continue your journey and take back your freedom! Then there's a basement where there are zombies in every room, and you have to search for and collect keys to get out! Finally, you find yourself in a forest full of zombies who are much faster than you and against whom you have no defense! Nothing is as simple as it appears. To summarize, you will encounter numerous zombies, traps, extremely fast zombies, and even scare jumps, as well as some exploring experience. Game Mode Beside The Story, There Is One Game Mode In The Game, Basically It's You And Zombies In A Small Rounded Place Where Zombies Respawn Every Second! Will You Try To Kill Every Zombie Respawning Or You Will Keep Running From Them? Features Atmospheric places and locations. A long range rifle and a pistol to kill zombies. You can snipe while using the rifle. Many scare jumps. You can skip a chapter if you got stuck on. Hard mode available in 3 out of 5 chapters. Impossible mode available in last chapter. More Details This game includes five chapters as well as a side game mode to enjoy! In future updates, two game mods or chapters will be added. You can see what each chapter contains in detail down below. WHAT DOES EACH CHAPTER CONTAINS? Chapter One You Are Lost! Find the Way Out. Zombies Show up Out of Nowhere. Take precautions. To kill zombies, you have a slow but high-damage Rifle with a such a long range. Chapter Two You Have Nothing To Hold In Hands! A House That contain Traps. Can You Avoid All Of Them? Hard Mode Available! Chapter Three You Have Nothing To Hold In Hands! Zombies all Over The Map, And Respawns Suddenly. Very Small Parkour Which you Can Enjoy Or Ignore If You Don't Like This Stuff. It's Optional :). Chapter Four Three Keys(Easy To Find) OR Five Keys(Hard To Find) In A Small Basement. In Every Room There Are Zombies! You Have A Gun To Protect Yourself While Collecting The Needed Keys. Hard Mode Available! Chapter Five You Have Nothing To Hold In Hands! Zombies Are Very Fast, Faster Than You! Sometimes running away is the best solution.. Hard And Impossible Mode Available!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1884030/header.jpg?t=1649084389",
    "Price": 1.99,
    "Developers": "Almost Joe",
    "Publishers": "AGT - Almost Game Things",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_14178eafe8f65ed6ce1a352941cd9d835afc08dd.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_aacc56088e744a4a459aca758b282a147530e782.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_0f5a1fdedbe5bbe84585200720ea09d9cf695645.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_0edd295c00dcda32bcd91020b81dbe069f4b970e.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_f804c79b1eb9b49a69da1966d8cd73dfe3ff8411.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_7a11c78f4870b7cfe52bb520eaf100714d2f393f.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_d684924c4a499c0f138aeb4fb9601daf60cb9eee.1920x1080.jpg?t=1649084389,https://cdn.akamai.steamstatic.com/steam/apps/1884030/ss_b591ae5d65bb2c7e083c7cbfb121b743a7b8b9a2.1920x1080.jpg?t=1649084389",
    "Slug": "one-of-the-victims",
    "Meta Title": "One Of The Victims: Apr 4, 2022, Almost Joe and Full Over...",
    "Meta Description": "Looking for information on One Of The Victims? Check out the release date (Apr 4, 2022), developer insights from Almost Joe, and a complete game summary.",
    "Alt Text Image": "Official header image for One Of The Victims game - Steam 1884030",
    "Canonical URL": "https://gusku.site/game/one-of-the-victims",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"One Of The Victims\", \"description\": \"Looking for information on One Of The Victims? Check out the release date (Apr 4, 2022), developer insights from Almost Joe, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 4, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Almost Joe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AGT - Almost Game Things\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1884030/header.jpg?t=1649084389\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}