{
    "AppID": 1151740,
    "Name": "Prison Princess",
    "Release date": "Apr 2, 2020",
    "About the game": "ABOUT Now nothing more than a phantom, can the hero succeed in rescuing the kidnapped princesses?! The player must lead the two captive princesses through the castle, solving puzzles while escaping the Demon King's castle. The choices the player makes will decide the princesses' fates, and their own! STORY The Continent of Maygard– The peace and prosperity brought about by the two kingdoms of 'Aria Zaza' and 'Zanji Zed' lasted countless years. That golden era is now facing it's downfall. The Demon King, released from his seal, has turned our continent to a sea of flames. As cities were invaded one after another, a man appeared carrying the blood of ancient heroes... Oh Brave Hero. During his journey, the hero met with grave misfortune and perished. The Demon King's minions snuck into the capital cities of the two kingdoms to kidnap their precious princesses. All hope seemed to have been lost... However, it seems our hero is not wholly dead after all. Even as a spirit, the hero is determined to remain in this world, and has set off to save the princesses from danger. CHARACTER Aria CV:Mao Amatsuka The princess of the kingdom of Aria Zaza. Unable to venture far for most of her life, she's doesn't know too much about the world. She's soft-spoken, but passionate and sincerely hopes for a world where people are happy and live out their lives in peace. She says the occasional dumb thing sometimes, but she's booksmart and her astute, keen reasoning often surprises the people around her. She's also exceptionally well-versed in magic. She has always wished she could meet Princess Zena and that the two could be friends, however, they have not had the fortune of meeting one another. Zena CV:Fumiko Uchimura The princess of the kingdom of Zanji Zard. She takes herself extremely seriously but can't be upfront about her feelings - she's a classic tsundere, blowing hot and cold. She trains in swordsmanship daily and her skills are second-to-none! A dangerous mix of being afraid of nothing and willling take on anything, she belittles the hero one minute, and sets up his jokes the next. She hasn't met Aria, but has often been the target of comparisons between the two by other people and this has fuelled something of a rivalry for her. SYSTEM ＜Instruct the princesses and lead them to their escape!＞ The hero has no physical body and so he can't investigate things or solve puzzles on his own. He needs to ask the princesses to act for him. ＜Clues you find will be instrumental to disarming traps, and making your escape!＞ In order to get the princesses to escape, you're gonna need to deal with a lot of traps and puzzles. But to solve them, you're going to need to scour the room from top to bottom, and get all the items and hints! You, the hero, will have your cleverness tested at every turn! ＜No touching, no glancing and don't get distracted! The princesses will have to 'put themselves out there' if they want to solve the puzzles!＞ There are many traps which will require the princesses to get their hands, feet, just about every other part of them dirty! There's a time limit for the puzzles, so you have to concentrate on the traps without getting distracted by the women in compromising positions before you! And forget about clicking on them! You all might enjoy it, but focus or they'll scold you! So keep your eye on the prize, suppress the desire to interact with the princesses, and disarm those traps, just like a real savior of the world should! But the hero's actions in this regard just might affect the fates of all three of you... STAFF Character Design：AkasaAi／InuiWaon Scenario production：C-Garden,Inc. Producer：Yujiro Usuda",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1151740/header.jpg?t=1589331033",
    "Price": 19.99,
    "Developers": "qureate",
    "Publishers": "qureate",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_3459ed9727a9bc968ded42ef90a9b0df928fd0db.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_ee45c52ece94814841678d76706c179b3c1d1d26.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_379d057d2d2cd733c666875063d54b89cde52005.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_ae40328d262e6c9db4306d92449f9d1167f076a7.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_4c3112390c96992a1646e9399742aa2964883b08.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_4024c4112a6157d250e1a3034a4e06035c49e6cb.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_e35a0ba0923504cafc8e74737ef6222fde672764.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_2b871cf5c4c83adccc0674874996ba5ba7bdd6cb.1920x1080.jpg?t=1589331033,https://cdn.akamai.steamstatic.com/steam/apps/1151740/ss_d59d25cc41807a59de5676c268ea6cd58303a24e.1920x1080.jpg?t=1589331033",
    "Slug": "prison-princess",
    "Meta Title": "Prison Princess: Apr 2, 2020, qureate and Full Overview",
    "Meta Description": "Looking for information on Prison Princess? Check out the release date (Apr 2, 2020), developer insights from qureate, and a complete game summary.",
    "Alt Text Image": "Official header image for Prison Princess game - Steam 1151740",
    "Canonical URL": "https://gusku.site/game/prison-princess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Prison Princess\", \"description\": \"Looking for information on Prison Princess? Check out the release date (Apr 2, 2020), developer insights from qureate, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"qureate\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"qureate\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1151740/header.jpg?t=1589331033\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}