{
    "AppID": 1089650,
    "Name": "Project Zero Deaths",
    "Release date": "Jun 12, 2019",
    "About the game": "Grab your friends or prepare to fight alone in the action-filled and super fast-paced free-to-play online platform shooter Project Zero Deaths! Choose between 7 different characters with unique skills and upgrade and customize every aspect of your character and fighting gear. Put your skills to a test on a varied selection of team vs team game modes, from the classic Capture the Flag to the exciting Bomb Delivery or Payload and the frantic Ring Collecting. Feel your adrenaline pumping while you fight in a varied selection of dynamic maps with destructible environments and physics-based traps. Gear up and prepare your weapons, it’s time to brawl in Project Zero Deaths! FIGHT ALONE OR WITH FRIENDS IN ACTION-PACKED ONLINE MULTIPLAYER Team up with your friends or other fighters from all over the world to fight in super fast online matches! Your skill makes the difference in this perfectly balanced F2P experience – only the best warriors reach victory! PHYSICS-BASED AND DYNAMIC ENVIRONMENTS Bounce grenades off the wall into your enemies’ faces, destroy bridges under their feet, push them into a black hole, block their way with heavy objects… Physics are one of the most powerful weapons in your arsenal! CHOOSE YOUR HERO BETWEEN UNIQUE CHARACTERS Pick the hero that best adapts to your playstyle between 7 unique characters (as of yet – more coming soon!). Each of them has their own sets of skills. Wanna go fast? Rookie is ready for you! Stealth is your thing? Grouch will be sneaky enough! Mayhem and destruction, please? B-Man awaits your orders! PICK YOUR WEAPON FROM AN INSANELY VARIED ARMORY From simple plasma guns to portable black hole launchers or explosive spears, this armory has all kinds of crazy weapons to satisfy even the most exquisite fighter! Find your favorite weapons and customize and upgrade them to hone their destruction capabilities to their full potential. 4 COMPETITIVE GAME MODES IN VARIED MAPS Four different team vs team game modes so you never get bored with the rules! Hoard rings and fight to protect your treasure in Harvest, bring the flag to your base in classic Capture the Flag, set a bomb in your enemies’ base in Bombing Run, and protect your payload all the way to your base in Payload. Every game mode has its own set of unique maps, up to a total of 30 maps! A GAME THAT IS ALWAYS NEW Project Zero Deaths is constantly evolving with regular updates with new content such as characters, weapons, maps, and game modes. This game will always have something new waiting for you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1089650/header.jpg?t=1562674321",
    "Price": 0.0,
    "Developers": "UAB Detis",
    "Publishers": "UAB Detis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_dd00ec2eff89efe9e1cf2afd329e33c20235ed80.1920x1080.jpg?t=1562674321,https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_bd8d6517791ab4485096419e87b625de0e1beeaf.1920x1080.jpg?t=1562674321,https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_3005fa16a4cd367076ccd6d0184a2b1648bf0ba3.1920x1080.jpg?t=1562674321,https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_70176a0e6e125b05c62db47ef7fed4de008241f3.1920x1080.jpg?t=1562674321,https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_ea778e60834202705262424803f7c1b78a51c948.1920x1080.jpg?t=1562674321,https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_fe031ce7dcca9e896aea782943f28b0a030a25ea.1920x1080.jpg?t=1562674321,https://cdn.akamai.steamstatic.com/steam/apps/1089650/ss_ae5b2b4a389daff714b0d99bb24475609585990b.1920x1080.jpg?t=1562674321",
    "Slug": "project-zero-deaths",
    "Meta Title": "Project Zero Deaths: Jun 12, 2019, UAB Detis and Full Ove...",
    "Meta Description": "Looking for information on Project Zero Deaths? Check out the release date (Jun 12, 2019), developer insights from UAB Detis, and a complete game summary.",
    "Alt Text Image": "Official header image for Project Zero Deaths game - Steam 1089650",
    "Canonical URL": "https://gusku.site/game/project-zero-deaths",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Project Zero Deaths\", \"description\": \"Looking for information on Project Zero Deaths? Check out the release date (Jun 12, 2019), developer insights from UAB Detis, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"UAB Detis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"UAB Detis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1089650/header.jpg?t=1562674321\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}