{
    "AppID": 1592740,
    "Name": "Railroad Ink Challenge",
    "Release date": "Jun 17, 2021",
    "About the game": "In Railroad Ink Challenge, you have 7 rounds to make as many points as possible. Roll the dice and draw the routes to connect the exits around your board. Expand your network with railways, highways, and stations to collect points, but you will be penalized for any open connections, so plan carefully! Play solo to improve your best score, or challenge players from all over the world! HOW TO PLAY Each round you will have to roll the dice and use the available routes to build your transportation network and connect as many exits as possible. Expand your network to collect points. You’ll also score bonus points for your longest highway and railway, for building into the central spaces of your map, and for completing optional, time-dependent goals before they expire. You can also connect special structures to your network to trigger their special effects, such as duplicating routes, unlocking powerful special routes, and more. But beware: Try to not leave any open connections, as each one will cost you points at the end of the game. EXPANSIONS Forest, Desert and more expansions based on the physical board game are planned and will be coming soon as DLC in the months following release! These expansions add special dice and rules to create even more intricate landscapes for your highways and railways. MODES Play solo with random objectives and join the online rankings or challenge players from all over the world with custom game configurations! The online leaderboards (Daily, Monthly, and All-Time) are completely cross-platform! FEATURES The wonderful art of the roll and write game by Marta Tranquilli, fleshed out and digitally enhanced Network planning gameplay: try to make the best use of the available routes each round to create the perfect transportation network Try to conquer the top of the online leaderboards (Daily, Monthly, and All-Time)! Cross-platform, asynchronous multiplayer challenges with your friends!' 100% Asynchronous Multiplayer Challenges Don’t like to wait while your opponents complete their turn? Fear not! With the 100% asynchronous multiplayer challenges, that is an issue of the past! Play a full game on your own, then post the challenge online! Players from all over the world will be able to play with the same dice and goals you had and try to beat your score! Who’s gonna get the best score? Railroad Ink Challenge is the official adaptation of the critically acclaimed roll and write game created by award-winning designers Hjalmar Hach &amp; Lorenzo Silva and illustrated by artist Marta Tranquilli.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1592740/header.jpg?t=1644927144",
    "Price": 7.99,
    "Developers": "Horrible Guild",
    "Publishers": "Horrible Guild",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_8a6c3b121d15057da81d4cd124aa02989a2cd3c3.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_f92bed3a08b8bbd8884b54f8ff472a1daa9741c2.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_5e47667859bdf82ec75a6e90096252c156d4a900.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_a5bfcf7abfe5498bd448d3fc076e008a48f13667.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_11290d7db3848809d17be87bcc2464d501119a73.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_65629f21ae84e19657a2fe4f31889b4acbd03a4f.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_a7e1e70ced6c2da624d0c6894258a91ea53bed8c.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_a273d569ba7f1f3126999bc33ec718bdb6ab584b.1920x1080.jpg?t=1644927144,https://cdn.akamai.steamstatic.com/steam/apps/1592740/ss_e3b1a6ba7b310be35b3b142d54a543c9a9564805.1920x1080.jpg?t=1644927144",
    "Slug": "railroad-ink-challenge",
    "Meta Title": "Railroad Ink Challenge: Jun 17, 2021, Horrible Guild and ...",
    "Meta Description": "Looking for information on Railroad Ink Challenge? Check out the release date (Jun 17, 2021), developer insights from Horrible Guild, and a complete gam...",
    "Alt Text Image": "Official header image for Railroad Ink Challenge game - Steam 1592740",
    "Canonical URL": "https://gusku.site/game/railroad-ink-challenge",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Railroad Ink Challenge\", \"description\": \"Looking for information on Railroad Ink Challenge? Check out the release date (Jun 17, 2021), developer insights from Horrible Guild, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Horrible Guild\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Horrible Guild\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1592740/header.jpg?t=1644927144\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}