{
    "AppID": 1782890,
    "Name": "Rivers of Rain",
    "Release date": "Nov 16, 2021",
    "About the game": "1.- An unforgettable journey Rivers of Rain is the story of a little girl destined to find her place in the world after her mother's passing, who leaves her as inheritance, the love for life, the bond of family, the joy of nature, and being content with the essentials. The mother left her final wish on her daughter's hands: to know the sea and live this adventure. This little girl will travel along her maternal grandfather across the places of Maule. It is an emotional and spiritual journey that will lead us to reflect on the legacy that is left upon death. 2.- The journey of a girl and her grandfather Antonia's grandfather begins his relationship with her granddaughter from the death of the child´s mother, and as the game progresses, their relationship deepens down. Switching between the grandfather and the girl, you will need to help them complete their journey through different places in the Maule Region in Chile. The grandfather represents wisdom, strength; he is a travel companion but also a teacher. Antonia is a character with a profound world view, a beautiful understanding of death and a spiritual bond with her mother by reminisce, is seen on her. 3.- The beautiful Maule Region, Chile Chile is a long and narrow country in South America. It is the southernmost country in the world, having in the north the flowery desert phenomenon and is, towards the south, the closest country to Antarctica. The most incredible thing about Chile is that to the east, there are giant snow-capped mountains that together are known as the Cordillera de los Andes, while to the west, it borders the sea, being possible to travel from the snow to the sea. El Maule is the VII region of Chile, it is an important wine-growing region in the central zone. It is crossed by the Maule River, which flows west from the Andes through the huge lake called Colbún, it has beautiful natural landscapes and its capital is the city of Talca. 4. From reality to interactive art Rivers of Rain is based on the landscapes of southern Chile. The artist Alberto Lemus took the fundamental details of nature, animal and plant, capturing the reality of the remote landscapes of the Maule region. In addition, together with museums and other history experts, digitized and stylized elements of the prehistory and history of the region are integrated, generating an unforgettable travel experience that leads us to reflect on reality, the passage of time, courage and the love for family. 5. The music of a journey though nature The music was created by the composer Begoña A. Carrasco. The central theme is a soundtrack that blends the sounds of nature through harmonies and calming melodies that invite exploration. On the other hand, the sounds of birds, animals, wind and water are perceived with subtlety and fluidity as we travel along the Maule Region with the protagonists.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1782890/header.jpg?t=1646061662",
    "Price": 2.99,
    "Developers": "Maule Tec (U Talca),Altair Films",
    "Publishers": "Abstract Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1782890/ss_753d83387905519ac354d22f3a568a2788931834.1920x1080.jpg?t=1646061662,https://cdn.akamai.steamstatic.com/steam/apps/1782890/ss_62337b4d8039565acbb4117ff13574b72fc7a15f.1920x1080.jpg?t=1646061662,https://cdn.akamai.steamstatic.com/steam/apps/1782890/ss_8a808aaccc4457cc8149d49e23b8697855fcda04.1920x1080.jpg?t=1646061662,https://cdn.akamai.steamstatic.com/steam/apps/1782890/ss_98cfa5ca87d8032eea95ef602e148e0d89d80178.1920x1080.jpg?t=1646061662,https://cdn.akamai.steamstatic.com/steam/apps/1782890/ss_b7fa18d8124f48100af1babc43503dee6371e367.1920x1080.jpg?t=1646061662",
    "Slug": "rivers-of-rain",
    "Meta Title": "Rivers of Rain: Nov 16, 2021, Maule Tec (U Talca),Altair ...",
    "Meta Description": "Looking for information on Rivers of Rain? Check out the release date (Nov 16, 2021), developer insights from Maule Tec (U Talca),Altair Films, and a co...",
    "Alt Text Image": "Official header image for Rivers of Rain game - Steam 1782890",
    "Canonical URL": "https://gusku.site/game/rivers-of-rain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rivers of Rain\", \"description\": \"Looking for information on Rivers of Rain? Check out the release date (Nov 16, 2021), developer insights from Maule Tec (U Talca),Altair Films, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maule Tec (U Talca),Altair Films\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Abstract Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1782890/header.jpg?t=1646061662\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}