{
    "AppID": 393930,
    "Name": "RoShamBo",
    "Release date": "Jul 14, 2016",
    "About the game": "OVERVIEW Welcome to RoShamBo arena! A brand new FREE arena fighting game, based on a classic rock-paper-scissors! Choose your character out of dozens unique looks, customize your gear, fight other players, knock their teeth out and become the best in RoShamBo Arena! THE GAME In RoShamBo Arena you’re presented as an arena fighter, who can defeat opponents by choosing one of three punches – rock, paper, or scissors. The one who wins after selecting the shape kicks the other. During the fight each kick will reduce the amount of health points, and the one whose health drops to zero loses. Besides standard kicks you can use one of three special skills, that can heal you, give a boost in attack power, reflect your opponent’s kick and many more. Each character has his own bunch of special skills, which makes your unique. You can compete with other players in real-time in different modes, like duels, tournaments, group fights and clan wars in future updates. In campaign mode you can fight bosses and ordinary fighters to get experience, valuable loot, gear and even more. Get teeth, obtain or buy gear, equip it and fight stronger enemies to get higher in your league. KEY FEATURES Real-time arena fighter . Defeat other players in real-time 3-minute arena fight, choosing one three punches – rock, paper or scissors. Dozens of unique characters. Choose your own character and way him to victory in each battle. Every character has up to 3 unique skills and unique fun animations. Hundreds of unique gear. Get the best gear in the game, equip it to increase your stats and defeat your enemies. Simple and addictive gameplay. Choose rock, paper or scissors. The one who wins, kicks. Unique and fun special skills. Besides the rock, paper or scissors you can choose one of three special skills during the fight. Each skill will get you closer to victory, but be attentive. The enemy has his own bunch of skills too. Character customization. Level up and configure your stats to your own preferences. Create your own unique damage dealer, tank, or support character. Team fights up to 3x3 players. Any player can compete with others together with his friends (up to 3 players, competing each other). Achievements. In-game achievements, that set you new heights goals every level. Social features. Find player to co-operate and go to victory together.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/393930/header.jpg?t=1469173366",
    "Price": 0.0,
    "Developers": "Blam! Games LLC",
    "Publishers": "Blam! Games LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_59a4e4a9daa47c6a7468db8e4da10cd7ade603e0.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_239d48a4fe17189497e62c1f0872e4c3fef5c7fd.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_3972894f3e4a80868c2191819e6289c5b3bfe282.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_60210b5ad885bc95834ae2d892fdf5e6ede534de.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_558b71ceef4391622dc4a83c86dc22541e621e73.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_b7ee9ca42b37f085ff7980f635e177865a71c373.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_30035817c0358756c7b3d80b812ee8d57218c47e.1920x1080.jpg?t=1469173366,https://cdn.akamai.steamstatic.com/steam/apps/393930/ss_281d91d5eb9fb3b19b11c9627ff304b5772204a8.1920x1080.jpg?t=1469173366",
    "Slug": "roshambo",
    "Meta Title": "RoShamBo: Jul 14, 2016, Blam! Games LLC and Full Overview",
    "Meta Description": "Looking for information on RoShamBo? Check out the release date (Jul 14, 2016), developer insights from Blam! Games LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for RoShamBo game - Steam 393930",
    "Canonical URL": "https://gusku.site/game/roshambo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RoShamBo\", \"description\": \"Looking for information on RoShamBo? Check out the release date (Jul 14, 2016), developer insights from Blam! Games LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blam! Games LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blam! Games LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/393930/header.jpg?t=1469173366\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}