{
    "AppID": 679430,
    "Name": "Skyraine",
    "Release date": "Sep 1, 2017",
    "About the game": "Skyraine is an action packed platform/missile defender game. Stranded on an alien planet, an ancient turret is your only defense against the invasion. Between waves of enemies rush repair your base and collect supplies and power-ups. As the game progresses new enemies enter the battlefield, each with their own devastating weapons. While aim and precision may help you get through the early levels, only with the perfect strategy can you hope to conquer the final difficulty. Play with up to 3 players in local multiplayer, and face 4 exponentially challenging difficulties. The Base: Walled in between a shield generator, your turret lies on the ancient ruins of an extinct civilization. A few rusted girders and ladders are all that remain. The Power-ups: Basic ammo- It's unlimited. I don't know how, I don't know why, I don't really care, it's free. Spray and pray, baby. Shotguns- The most plentiful power-up, instead of shooting one bullet, it shoots like 20. Limited range though. Discblades- The most versatile ammunition, it'll shoot through almost anything. Vortexes- The most dangerous one. It destroys anything that gets caught in it's void, so don't shoot things too close. Zappy's- The best way to clear the screen, hit an enemy with one of these and it will chain to nearby enemies as well. They drop rarely though, so use them wisely. The Supplies: Supply ships- When the music changes you know they're coming. That's your cue to grab all the crates it drops and repair your base. Ladders and girders- The most basic of supplies, use these to expand the reach of your base above and below ground. Batteries: Load these into a shield generator and it will completely heal the shield AND fix the generator. Mines: Quite useful devices, you can place them on the ground, or send them into the air! Just don't be around it when it goes off... Autoguns: Why shoot when you can get something to shoot for you? While they have limited ammo, they're nice to have around to take out those pesky spiders. Zappy mines: zappy + mine = ??? The enemies: Bomber- The most basic of bad guys, shoot it before it shoots you. Spiders- Instead of catching bugs these evil insectoids catch your supplies! While they can't go too far above ground, they might catch you when they pop up to the surface! Suckerships- Possibly the most destructive enemy, these breathing blimps suck the life out of you by taking anything that gets caught in it's whirlwind. Mech Dogs- Clanking across the screen, these mechanical beasts want to feast... on your shield generators! Breaking through girders and ladders, nothing short of a mine will stop this beast from reaching its target! Suicide ships- While the ships themselves don't do too much, it's the explosion that counts! Don't let it hit you while you're out of the turret! Shield Ships- With a ton of health, these low-cruisers like to steal the attention while it's buddies blow up your base. Find the right power-ups to take it out fast. Transports- Light-armored ships, they don't cause too much of a threat. What they drop does. Corrosive bugs- After a nice long trip on the Transport, these little guys are hungry for just about anything, girders, ladders, your shield, it's all food to them. Soldiers- These guys come out of a crate like a clown car. Running at your base, they pile on top of each other like zombies until they find a way in. After that...it's all over. Scorpions- Scorpions can't be that scary right? Wrong. Very wrong.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/679430/header.jpg?t=1504497456",
    "Price": 1.99,
    "Developers": "DHTstudios LLC",
    "Publishers": "DHTstudios LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/679430/ss_5b722a638143402291d45fc755c3852666bd71d5.1920x1080.jpg?t=1504497456,https://cdn.akamai.steamstatic.com/steam/apps/679430/ss_8637928df01d1bda7aad511dda24347658508b51.1920x1080.jpg?t=1504497456,https://cdn.akamai.steamstatic.com/steam/apps/679430/ss_c1712b8bb41b743d052c42c46a7cee916ca1690c.1920x1080.jpg?t=1504497456,https://cdn.akamai.steamstatic.com/steam/apps/679430/ss_497d9e0419003b9ba7f1a5c50e444504fd1c91a1.1920x1080.jpg?t=1504497456,https://cdn.akamai.steamstatic.com/steam/apps/679430/ss_689c4c0065d8ed428f86bca753328d9da67aa7a9.1920x1080.jpg?t=1504497456,https://cdn.akamai.steamstatic.com/steam/apps/679430/ss_7e03290f16ee964d06fba0062c431f1fa41159f1.1920x1080.jpg?t=1504497456",
    "Slug": "skyraine",
    "Meta Title": "Skyraine: Sep 1, 2017, DHTstudios LLC and Full Overview",
    "Meta Description": "Looking for information on Skyraine? Check out the release date (Sep 1, 2017), developer insights from DHTstudios LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Skyraine game - Steam 679430",
    "Canonical URL": "https://gusku.site/game/skyraine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Skyraine\", \"description\": \"Looking for information on Skyraine? Check out the release date (Sep 1, 2017), developer insights from DHTstudios LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 1, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"DHTstudios LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DHTstudios LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/679430/header.jpg?t=1504497456\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}