{
    "AppID": 348270,
    "Name": "Social Justice Warriors",
    "Release date": "Feb 27, 2015",
    "About the game": "Social Justice Warriors expresses frustration with how people use divisive labels – like “SJW” and “troll” – to discredit and silence each other. No matter what social values you have, attacking and ridiculing other people not only fails to achieve progress but has an additional effect of escalating the conflict while exhausting your patience and eroding your reputation. The Warriors Social Justice Paladins duel foes with 140 characters or less while shrugging off attacks with a press of the Block button, at least until their foes create new accounts. Social Justice Clerics serve in the name of their patron sub deity, taking solace in its comforting presence to heal and summoning its divine power to smite their enemies. Social Justice Mages conjure powerful constructs of fact and opinion to alter minds and reality while occasionally summoning an activist organization or hurling a scathing fireball of a blog post. Social Justice Rogues fight fire with fire. Throw flurries of vitriolic character attacks, confuse enemies with smokescreens of alternate accounts, then delete your accounts and withdraw into the shadows of the net. The warriors and their opponents fight and fall by the measure of their Patience and Reputation meters. Trolls confound your patience with logical fallacies and ad hominem attacks while actively working to destroy your reputation with wild accusations and photoshopped evidence of your misdeeds. How you choose to respond to these attacks is up to you. Relying solely on logical arguments to change minds doesn’t work very well online, but resorting to personal attacks and mudslinging will erode your moral high ground. With the aid of your warrior allies and a few mysterious outsiders, you have the ability to reshape the conflict. Take down a multitude of trolls to attain a new high score or make sacrifices to become a noble Social Justice Champion, who takes no joy in tearing down other human beings. The Champion relies on mediation and reconciliation, listening to their concerns and proposing mutually beneficial compromise. The utility of compromise is just as uncertain as destroying opponents, but a Champion values its beliefs more than temporary gratification.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/348270/header.jpg?t=1547066025",
    "Price": 7.99,
    "Developers": "Nonadecimal Creative",
    "Publishers": "Nonadecimal Creative",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/348270/ss_df39384e77116e3f30d1471a1049ae933ea9bb7f.1920x1080.jpg?t=1547066025,https://cdn.akamai.steamstatic.com/steam/apps/348270/ss_7659dfe7f15cf4af28d29ad6f2e385bbf528ff1d.1920x1080.jpg?t=1547066025,https://cdn.akamai.steamstatic.com/steam/apps/348270/ss_9fc243c3808cffde79dd7df852d7c46ae1ab46b2.1920x1080.jpg?t=1547066025,https://cdn.akamai.steamstatic.com/steam/apps/348270/ss_9bd2f56be0bf2c24b13a2eec9553f1d0fb6335f2.1920x1080.jpg?t=1547066025,https://cdn.akamai.steamstatic.com/steam/apps/348270/ss_8e3f482192823d31b2e5e2194197106456669dc7.1920x1080.jpg?t=1547066025,https://cdn.akamai.steamstatic.com/steam/apps/348270/ss_617551a9079e56a4993fd776f65324c1d969fe84.1920x1080.jpg?t=1547066025",
    "Slug": "social-justice-warriors",
    "Meta Title": "Social Justice Warriors: Feb 27, 2015, Nonadecimal Creati...",
    "Meta Description": "Looking for information on Social Justice Warriors? Check out the release date (Feb 27, 2015), developer insights from Nonadecimal Creative, and a compl...",
    "Alt Text Image": "Official header image for Social Justice Warriors game - Steam 348270",
    "Canonical URL": "https://gusku.site/game/social-justice-warriors",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Social Justice Warriors\", \"description\": \"Looking for information on Social Justice Warriors? Check out the release date (Feb 27, 2015), developer insights from Nonadecimal Creative, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nonadecimal Creative\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nonadecimal Creative\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/348270/header.jpg?t=1547066025\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}