{
    "AppID": 1826300,
    "Name": "SOTANO - Mystery Escape Room Adventure",
    "Release date": "Dec 4, 2021",
    "About the game": "SOTANO - Mystery Escape Room Adventure Driving home from the airport you glance at your fuel gauge and notice the needle is hitting the red line. Starting to feel tired you decide to take a little known short cut through a quiet village, the shorter drive will save fuel rather than stopping to fill up. “It’ll be fine, I just want to get home” you say to yourself. Passing some of the large old houses the car begins to make some strange noises and you realise you have pushed your luck, rolling slowly to a halt in front of one of the largest houses on the street. How embarrassing. You decide to swallow your pride and knock the door for help. “Maybe a house this size might keep fuel for sit on mowers and generators.” You think, hopefully, to yourself. Moments after knocking on the door your world turns black and you find yourself waking up in the basement, reading a note left by the owner: I’m sorry you have found yourself waking up here but you were snooping on my property and I was alerted to your presence. I will be back shortly. You will find the door to your room locked. Don’t be alarmed, this is for your own safety as my home has many unconventional contraptions that might otherwise ‘confuse’ you. Feel free to look around, although I apologise for the rather limited decor. ABOUT Sotano is a first person 3d escape room puzzle adventure, similar to games you may have played in the ’90’s or similar to a virtual escape rooms you may have played. An indoor immersive world that you explore and an inventory where you can collect and use items you find along the way to solve puzzles and escape the rooms. Explore areas, collect hidden objects and take in your surroundings. You will need all of your puzzle solving skills to put together a plan to make your way through the house, solving riddles and through the many rooms to escape the house of Sotano. How you tackle the puzzles is down to you. Each puzzle has a logical solution, so take your time, there is no rush and enjoy the process of understanding what you have to do. FEATURES • Explore an immersive indoor environment, solving puzzles and collecting items • Use the inventory to collect and use objects • Beautiful all original adventure 3D graphics, environments and atmosphere to explore • Immersive backing soundtrack and effects to pull you into the adventure • Full save system with load slots, manage all controls and sound levels to your preference. CONTROLS: Movement: WASD + Mouse Inventory: I Menu: ESC HINTS &amp; TIPS If you need a hint or clue while playing Sotano then please reach out over email or social media (contact links can be found on my website) and I will be more than happy to help you. SMALL PRINT Sotano was created from the imagination of a solo indie developer. “I am always excited to hear people playing my games and their experience along the way. Adventure gaming is my passion and your feedback helps my games get better.“ Sotano is compatible with most modern PC's and has been designed to be as resource efficient as possible to allow play on many different devices. With that said, if you do run into any difficulties please email so I can provide updates that help everyone enjoy the adventure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1826300/header.jpg?t=1650111486",
    "Price": 6.99,
    "Developers": "M9 Games",
    "Publishers": "M9 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1826300/ss_8d3837718034f02461ca132a94ee0ee3f1507693.1920x1080.jpg?t=1650111486,https://cdn.akamai.steamstatic.com/steam/apps/1826300/ss_b16a27c575a68656c8360c49f6254a911bb8eae2.1920x1080.jpg?t=1650111486,https://cdn.akamai.steamstatic.com/steam/apps/1826300/ss_1adf803bfef9eaae97bfe590501b8e643064b14d.1920x1080.jpg?t=1650111486,https://cdn.akamai.steamstatic.com/steam/apps/1826300/ss_4bc12371a982b1bf77e33c8da166a8ed3369cbdd.1920x1080.jpg?t=1650111486,https://cdn.akamai.steamstatic.com/steam/apps/1826300/ss_faf394c0087ed2cd9b77a17158e7e2d596269e25.1920x1080.jpg?t=1650111486,https://cdn.akamai.steamstatic.com/steam/apps/1826300/ss_13983d49be651e4fa39b9c6e5e3260723ca38def.1920x1080.jpg?t=1650111486",
    "Slug": "sotano-mystery-escape-room-adventure",
    "Meta Title": "SOTANO - Mystery Escape Room Adventure: Dec 4, 2021, M9 G...",
    "Meta Description": "Looking for information on SOTANO - Mystery Escape Room Adventure? Check out the release date (Dec 4, 2021), developer insights from M9 Games, and a com...",
    "Alt Text Image": "Official header image for SOTANO - Mystery Escape Room Adventure game - Steam 1826300",
    "Canonical URL": "https://gusku.site/game/sotano-mystery-escape-room-adventure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SOTANO - Mystery Escape Room Adventure\", \"description\": \"Looking for information on SOTANO - Mystery Escape Room Adventure? Check out the release date (Dec 4, 2021), developer insights from M9 Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"M9 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1826300/header.jpg?t=1650111486\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}