{
    "AppID": 1263750,
    "Name": "The Dark Inside Me - Chapter II",
    "Release date": "Jun 5, 2021",
    "About the game": "Psychological horror adventure game from a horror movie director based on a dynamic scenario. Important Note: Internet connection is needed to play the game. Game Episodes of Chapter-II: A Cold Bitter Touch Episode 1: Angel In The Night Episode 2: Let Me Die In His Arms Episode 3: Dark Sins Of My Childhood Episode 4: Sisters The Dark Inside Me is a very unique 2d,5, 3rd person next-gen psychological horror adventure game based on a dynamic interactive scenario. Main aim is to reflect the real characteristic of a player through the game and see how far players would push their limits through the stages of the game. Game is +18 and has disturbing blood, sex and intense violence scenes. These scenes and actions are shaped according to the player’s decisions during the game. Game is based on a dynamic scenario and the game-flow changes according to player’s decisions and how they face with the situations and solve the puzzles. Puzzles can be solved with more then one way and each way effects and changes the rest of the game-play. For example; in one of the stages you find out the murderer of your wife and knock him down. At that moment it's up to you to forgive, kill or torture him to death. Game has many psychological scenes as well. You can either solve the puzzles peacefully or in a brutal way. The Dark Inside Me reveals the real characters of the players. You may choose to be good or to be bad. Sometimes players have to give critical decisions which will completely affect the following game stages. It’s said that everyone has angels. One of them leads us to the light and the other takes us in to the dark. We give our own decisions through the path of life and now we’ll give our own decisions through The Dark Inside Me. Dark Inside Me blurs the thin line between madness and reality, darkness and light, love and hate, forgive and vengeance. After the car accident, we found our self lost in a forest. We need to find our way out and try to learn more about what's going on with us. We need to find the answers and solve this dark mystery. We still don't know if we are guilty or not? We have given a chance and we will continue to face our demons and push our limits as far as we can to enlighten the dark inside us. The Dark Inside Me game-play builds upon the decisions and sacrifices between the user and the events. Puzzles in the game may be solved with more then a single way. Each way leads you to different paths and change the flow of the scenario. You can kill someone who is stopping you from your way, by finding a tool to use on. Or you may find a way to pass him without killing. The person you didn’t kill then may show up later and can either help you or makes things harder for you. When time comes for vengeance, you will decide to forgive or not. You will either torture or kill or let them go .You will face the decisions you made through the game. You can find many tools and items, use them on other objects, combine them to create new items to solve new things. Next-gen psychological horror adventure game. Dynamic scenario. Solving puzzles with various ways. Play like a game, feel it like a movie. WASD or mouse character control. Highly detailed rendered 2D graphics and animations. 2d,5 parallax and panning camera effects. 3d playable characters. More then one playable main character through the game play. Mature content including gore, violence and sexuality. Cinematic soundtracks depending on the mood of the scenes. Multiple camera angle areas and scenes. Mature content including gore, violence and sexuality. Many different environments; from houses, streets, shops, buildings to forests, buses, ships and much more. 1920x1080 Full Hd graphics. 1920x1080 Full Hd cinematics.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1263750/header.jpg?t=1622913426",
    "Price": 7.49,
    "Developers": "Akçay Karaazmak",
    "Publishers": "Akçay Karaazmak",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_55eb9791fe951f33eec7d7ff006189db82108f13.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_4e8b436caf03008327111ac44b8908d1d71603ee.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_eda875e50ca105f2769c7cf363053cbf54683ea5.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_ceb27bc601cde3efd9d47de9382a5b274d4dd1ec.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_5cd0229aa7b9f55301780d94cb6233bc09128fa1.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_f507547ed7ebe0641957b1a177fb4474583507f1.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_c75f30227dba0815d421784077655c27d092d6d5.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_c3389b2b37da1a4896e447a889afc3fb52a3ca8d.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_3243007232a4267fbc843c388adfbe1b2b185a70.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_3e3b2c1493e1688b0ef6106c9712dc839d84d0f2.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_9604c24f06b28fa328146c7fcab6bf23c84a8551.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_0676f596e2c779989912353acd86c3a269321fbe.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_a2b0f18afd949072584dd8be1ec76b75bda64f7d.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_a68f971fa0f98c125cb4d00bbdf7db991bbb807f.1920x1080.jpg?t=1622913426,https://cdn.akamai.steamstatic.com/steam/apps/1263750/ss_35a83c7a4618c447658b8a239d1f6a6fd2b9f21f.1920x1080.jpg?t=1622913426",
    "Slug": "the-dark-inside-me-chapter-ii",
    "Meta Title": "The Dark Inside Me - Chapter II: Jun 5, 2021, Akçay Karaa...",
    "Meta Description": "Looking for information on The Dark Inside Me - Chapter II? Check out the release date (Jun 5, 2021), developer insights from Akçay Karaazmak, and a com...",
    "Alt Text Image": "Official header image for The Dark Inside Me - Chapter II game - Steam 1263750",
    "Canonical URL": "https://gusku.site/game/the-dark-inside-me-chapter-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Dark Inside Me - Chapter II\", \"description\": \"Looking for information on The Dark Inside Me - Chapter II? Check out the release date (Jun 5, 2021), developer insights from Ak\\u00e7ay Karaazmak, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ak\\u00e7ay Karaazmak\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ak\\u00e7ay Karaazmak\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1263750/header.jpg?t=1622913426\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}