{
    "AppID": 387430,
    "Name": "The Viceroy",
    "Release date": "Jul 28, 2015",
    "About the game": "OVERVIEW The Viceroy is a turn-based economic strategy sci-fi game. You will rebuild vast regions recently destroyed by disaster, crush rebel fleets, explore a large, far-future tech tree, manage elaborately intertwined economies, respond to emerging events, and earn permanent skills to overcome escalating challenges. But beware, time and resources are limited! The growing rebellion and the endless march of bureaucracy will ultimately make each territory ungovernable and force you to move on. Unless... you succeed so spectacularly that you are offered a promotion and a larger territory to govern before your administration collapses. SETTING The Viceroy is set in a far future of high technology where three major factions vie for supremacy. You will represent one of their sub-factions, balancing your long-term political goals with the needs of each assigned territory. THE FACTIONS The Empire of the Elect was the great power in the galaxy, and believed they would remain so based on the prophecies of the atemporal Beyonders. Nevertheless, they have been slowly collapsing for millennia. The Commonwealth of Territories has stepped into the void, recruiting the former member-states of the Empire into a benevolent bureaucratic union. Their rule has been just and fair, but weak, inefficient and vacillating compared to the iron will and perfect faith of the Empire before them. The Panarchy embraces all forms of government simultaneously, and have become the foremost technological and cultural power within the known galaxy. They use their considerable influence to undermine, on principle, all other forms of government. GAMEPLAY Each star system in your territory is made up of planets in turn divided into districts. Districts find optimal trade routes within a complex economy in which each part of your territory is impacted by the economic conditions of its neighbors. Optimize these economies by researching over 100 technologies, building more than 100 pieces of infrastructure, and curing more than 100 disasters. Infrastructure and disasters can impact a district, a planet, or even an entire star system. Customize your faction's various ships as anything from short range brawlers to long range fire support, then watch your A.I. captains strategically jockey for optimal firing positions in hyperspace as they take the fight to the increasingly formidable rebellion. Earn valuable skill points based on your success in each assigned territory. Then allocate these skill points to gain permanent bonuses in everything from the size of your territory to taxes levied. Choose well, and these skills will put you on course for promotion to greater responsibility. FEATURES Select from six sub-factions with unique starting technologies, cultural hierarchies, and ultimate goals. Rule vast, randomly generated territories, each made up of multiple star systems with dozens of planets and fifty to four hundred districts between them. Oversee an extensive economic network with complex trade routes between systems, planets, and districts. Explore an extensive tech tree containing over one hundred technologies that can be built at system, planet or district levels. Grapple with twelve disaster sets composed of over one hundred individual challenges, which can impact districts, planets, or even entire star systems. Construct fleets to protect and defend your people from the rebellion and its campaign of terror. Customize your faction's fleets with a dozen ship patterns and multiple offensive and defensive systems. Set tax and spending rates and revise your government's military, religious, cultural, and economic policies. Complete tasks assigned by neighboring factions to bring benefits to your people and ultimately unlock the power of your territory's artifact. Gain influence according to your success at both rebuilding fallen territories and serving the political will of the Commonwealth and the Panarchy, then use that influence to select useful skills for future assignments.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/387430/header.jpg?t=1447377115",
    "Price": 19.99,
    "Developers": "Goatee Games",
    "Publishers": "Goatee Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_f545d620bcd6b0bb698592cb555393b381458944.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_f2d81211a73e7a73f9472cc32204894ae32965cc.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_5b4085e332fd07b74c790c935790b936473b0342.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_fc18f71f4886ac7a0f99fe71c43471d8fc0af3b2.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_83af6550d5fc6b6c69c17895d9c013375dcedd18.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_3e980291f571c7a3729bc685186d0cfc141a1a10.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_b656d75023cb5cf7b893743709421d3e09553997.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_bf728ba3e4f6c6b9334e9bf868e52a92fbafcec7.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_d3d6453a24d1c6d69760a06e7f97a9ea2eebc73e.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_c6b878bb1d9e01b42b6b071ddec26e31cd06684b.1920x1080.jpg?t=1447377115,https://cdn.akamai.steamstatic.com/steam/apps/387430/ss_b931e600cabe14b44e80d72031ad10bfcedade0a.1920x1080.jpg?t=1447377115",
    "Slug": "the-viceroy",
    "Meta Title": "The Viceroy: Jul 28, 2015, Goatee Games and Full Overview",
    "Meta Description": "Looking for information on The Viceroy? Check out the release date (Jul 28, 2015), developer insights from Goatee Games, and a complete game summary.",
    "Alt Text Image": "Official header image for The Viceroy game - Steam 387430",
    "Canonical URL": "https://gusku.site/game/the-viceroy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Viceroy\", \"description\": \"Looking for information on The Viceroy? Check out the release date (Jul 28, 2015), developer insights from Goatee Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 28, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Goatee Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Goatee Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/387430/header.jpg?t=1447377115\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}