{
    "AppID": 682180,
    "Name": "Tile Battle",
    "Release date": "Apr 4, 2018",
    "About the game": "Tile Battle focuses on a unique unit control system that allows players to control the flow of their units as well as their enemies. Players place tiles onto the top-down grid to direct units across the battlefield. Destroy an enemies base to stop reinforcements then finish off their remaining army to claim victory. Tile Battle is easy to jump into but various factions, abilities, and gameplay settings provide more depth to be discovered for returning players. Features 2-4 local players. (Tile Battle is local multiplayer only) Choose from 3 factions and 9 different faction abilities. Play across 6 maps per player count for a total of 18 unique maps. Customize game settings to fit your preferred experience. Many controller types supported. One player can use the mouse and keyboard to play. GAMEPLAY Units and Bases Each player starts the round with bases that automatically spawn units. Units walk in a straight line until they bump into a wall and turn around. Units will automatically engage in combat when they get close enough to attack an enemy. A player wins the game when all enemy units and bases are destroyed. Moving Units The player uses their cursor to place direction tiles (left, right, up, down) onto a grid space. When a unit of any team walks onto a directional tile they will change to walk the direction of the tile. Tiles need to be used both offensively to get your units to the enemy base and defensively to redirect enemies away from your own base. This becomes more challenging because you are limited to 5 active tiles. Players have the ability to remove a tile on a cooldown to sabotage an enemy's plan or to help push through their defenses. Factions Players can choose from one of three factions before the game starts. Choose between Marauders, The Guild, and Haunted. Each faction has its own unique base unit with two additional special units. Play each faction to discover their varying strengths and weaknesses. Abilities Each faction comes with three unique abilities to choose from. Players pick their faction ability before the game starts. Abilities range from the offensive fireball to the buff spell Undying which empowers units and delays their death. Game Settings Customize gameplay parameters to fit you and your friend's play style. Change game speed, spawn rates, sudden death settings and much more. Easily save and load presets to quickly get back to your favorite settings. About the developer Created by LadrikDev: This is my first completed entry into the indie game scene. My goals with Tile Battle were to approach the RTS genre from a new angle and create something unique for local multiplayer fans. Thanks for taking a look at my game. If you end up purchasing Tile Battle I would love to know what you think!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/682180/header.jpg?t=1522830109",
    "Price": 7.99,
    "Developers": "Masterstrike,LadrikDev",
    "Publishers": "Masterstrike",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_348143fc78954b033b5e086e32db20cfd840f137.1920x1080.jpg?t=1522830109,https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_66f28c21e11e0b4b3b6fde09f675fd0a35956ff0.1920x1080.jpg?t=1522830109,https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_40f1d47cd78fa14c6b5ef7ab360aeaa6208e4bdc.1920x1080.jpg?t=1522830109,https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_4beaeb247394fc3f670d1608e3e4bbb19c495929.1920x1080.jpg?t=1522830109,https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_6f8f28cda2708e262b9dbd404f521f2d31eec264.1920x1080.jpg?t=1522830109,https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_5fc9e27bd5a316cd50327c8cd8908231d95eb171.1920x1080.jpg?t=1522830109,https://cdn.akamai.steamstatic.com/steam/apps/682180/ss_15d9909b7ef0f1ae30b8f90fbf020e3a44bb40a1.1920x1080.jpg?t=1522830109",
    "Slug": "tile-battle",
    "Meta Title": "Tile Battle: Apr 4, 2018, Masterstrike,LadrikDev and Full...",
    "Meta Description": "Looking for information on Tile Battle? Check out the release date (Apr 4, 2018), developer insights from Masterstrike,LadrikDev, and a complete game su...",
    "Alt Text Image": "Official header image for Tile Battle game - Steam 682180",
    "Canonical URL": "https://gusku.site/game/tile-battle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tile Battle\", \"description\": \"Looking for information on Tile Battle? Check out the release date (Apr 4, 2018), developer insights from Masterstrike,LadrikDev, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 4, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Masterstrike,LadrikDev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Masterstrike\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/682180/header.jpg?t=1522830109\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}