{
    "AppID": 1536740,
    "Name": "TrackMaster: Free-For-All Motorsport",
    "Release date": "Mar 8, 2021",
    "About the game": "Hi, I'm a solo game developer from São Paulo, Brazil, and this is my game! TrackMaster is a game about physics sandbox, racing, vehicular mess and crazy types of events and competitions: doing unexpected things with unexpected vehicles! Want to take a trailer truck to a stunt track? Why not? Want to do a race in a figure 8 track featuring a monster truck, a muscle car, a truck and a bus? Why not? The game will let you drive freely in any track in a freeroam mode, race in tracks designed for collisions, and take part in events for doing stunts, dominating the hill, playing football and many others! TrackMaster is really a project I have began because of those moments of 'if no one is making the game I want to play, I'll make it'. I want the physics and chaos of the old Destruction Derby games, the freedom of old games like Interstate'76 and of modern games like BeamNGDrive, the simplicity of Super Off-Road and Super Skidmarks, the crazy modes of Test Drive: Eve of Destruction, the mayhem of Twisted Metal (the first one), the Monster Trucks from Monster Truck Madness, all this with split screen multiplayer, and more, much more, is that too much to ask? The game is designed as a balanced blend of simulation and fun: the vehicles are entirely governed by physics, so that you can always see a different result from collisions, jumps and stunts. The vehicles sizes and weights are also proportional to each other as in real life. If you drive a 6 ton truck at 100 km/h into regular cars, expect the poor cars to get thown away. But here comes the balance to be fun: the truck won't take 15 seconds to reach 100 km/h (as it would in real life), it's acceleration will let it race against sports cars and other fast vehicles! The physics based system also allows for different handling of RWD (rear wheel drive), FWD (front wheel drive) and 4WD (4 wheel drive) vehicles. GAME MODES FreeRoam - Drive freely, no time limits and no goals in any arena or track. - AVAILABLE NOW Event - Races and other events, see EVENTS, below. - AVAILABLE NOW Career - Start as a novice driver, with a bad car, and try to climb up the racing ranks! - COMING SOON Tournament - Combinations of events in sequence. - COMING SOON EVENTS 14 event types ALREADY IN THE GAME FreeStyle - Do as many tricks as you can in 2 minutes. Front flips, back flips, spiral flips, long and high jumps. Or, prevent the others from doing their hard trained tricks. Racing - You know, try to reach the finish line first. In this game, that's the only rule. Master of the Hill - Stay as long as you can on top of the hill for 2 minutes. Also, make sure the other vehicles can't make it. Tag - Or 'Touch And Go', the playground game, the one you played as a child. Now with big toys. Red Rover - Drive from one end of the arena to the other. The last vehicle each time is out, until there is only one, the winner. Kamikaze Race - A race event where half the vehicles drive the right way. The other half, the wrong way. COMING SOON There and Back Race - Also race, but you drive one lap the right way, the next lap, the wrong way. And so on until finish. Around the Flag Race - And yet another race event: after each lap, make a circle around a flag in the middle of the track, and then proceed to the next lap. Football - You know, one ball, two goals. Period. Capture the Flag - Two teams, each one with a flag. Take the other teams flag and bring to your base. Demolition - Destroy anything that moves. Cops and Robbers - Or 'Team Tag '. You also played this one as a child. Now, with big toys too. Power Potato - Stay most of the time with the potato. Touch the vehicle with the potato to steal it. Hot Potato - Stay away from the potato. The one carrying it, loses points. Touch other vehicles to pass on the potato. Trailer Mode - All of the above, but with trailers attached. Try to finish the event with your trailers, and try to make the other vehicles lose theirs. THE PLAN You can see how I'm planning to develop the game along 2021 in the TrackMaster website. Also, I will present these updates here, on Steam. So, the plan: Middle of 2022. The game at this point will feature all the vehicles (7 classes, with a varying number of models inside each class, to a total of 15 models), 11 tracks (plus the tracks variations) and 14 game modes planned now. 1.0 (end of early access phase) is planned to the end of 2022. The game at this point will feature on-line multiplayer, LAN multiplayer, track editor and of course, more vehicles, tracks and game modes are going to be made. Nothing prevents some features to come out earlier than planned, like online multiplayer, I just can't promise it now. After 1.0, free updates with more of everything described above, and, why not, some new and cool things, like an open world, real world tracks, steering wheel support, vehicle destruction (with soft body physics!), missions and scenarios... but this are just dreams right now and I can't promise any of this. So, the idea is to build a racing game that is easy to play, with a nice balance of fun and physics simulation, so that there are always new stuff to do and try, but that you can play in a relaxed way if you want. As long as the game proves to be good and is financially viable, I don't plan to abandon it after some features have being added, it could go on for years, why not!? I really like the way games like Euro/American Truck Simulator, BeamNGDrive, Cities Skylines and Elite Dangerous are made: with great involvement from a community and constant and free updates and improvements. I don't think I'm going for the paid DLC way, even for the big content updates. I like the idea of a game you can have at the beginning, with just a few features, but a solid foundation, and years later you are still able to have fun with it, but with much more content, and more important, with no more money for it. So, if you like the idea of a racing game to play the way you want, with any vehicle that comes to your mind, in crazy tracks, with lots of chaos, mayhem and solid physics, I hope you can enjoy the game from now on!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1536740/header.jpg?t=1645118685",
    "Price": 7.99,
    "Developers": "The Motor Game Company",
    "Publishers": "The Motor Game Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_2bb9636e8aaf087854cdc0986d71ff88b87923e7.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_bc8f7e13b1d798834868b3df19ff3bc25763e57f.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_9570d495b10c94f75dae2fd99969137b93d89cef.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_0653a2226ebb3c4d06b07fe0e09b4cc91beb55bf.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_83851234203de5bd197d74daed5bfe98b310908b.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_3337f090fe53e94e340451bff4d9c77eb5b67a66.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_bae6904c50656beee785e6371d72b551304a9714.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_8d84bcd0eb11b0f2bc2c43bea63cd95749f5b1e0.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_6dc974ad30e5159595c9c3019be1c80906c3d2fa.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_cd388e794db84a2142dd4d1aa780321ce8fa4d57.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_a6ad3e7cd0975fa2a9377661014c736146a8f935.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_ae244c3700edb553cb2fa33a123dae1e1e179fa5.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_eecd81f8d03e7949cceeac30c248e9d1a1af0624.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_d06aa7d968a3c8d6b1ab5c7d9793a6f1d2c48d34.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_00f7a3d87ca425668c7af350094c186390de77c5.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_636927806abf204930ead54337f7bf4ce6318241.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_6864b80f8a73434f415ffe2138af7ca6e374238c.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_2388bf61cde36f39c369b260b652c0989de865ed.1920x1080.jpg?t=1645118685,https://cdn.akamai.steamstatic.com/steam/apps/1536740/ss_11e4ed8aa65a3723fca7656887c435fcaf5cdf66.1920x1080.jpg?t=1645118685",
    "Slug": "trackmaster-free-for-all-motorsport",
    "Meta Title": "TrackMaster: Free-For-All Motorsport: Mar 8, 2021, The Mo...",
    "Meta Description": "Looking for information on TrackMaster: Free-For-All Motorsport? Check out the release date (Mar 8, 2021), developer insights from The Motor Game Compan...",
    "Alt Text Image": "Official header image for TrackMaster: Free-For-All Motorsport game - Steam 1536740",
    "Canonical URL": "https://gusku.site/game/trackmaster-free-for-all-motorsport",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TrackMaster: Free-For-All Motorsport\", \"description\": \"Looking for information on TrackMaster: Free-For-All Motorsport? Check out the release date (Mar 8, 2021), developer insights from The Motor Game Compan...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"The Motor Game Company\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Motor Game Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1536740/header.jpg?t=1645118685\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}