{
    "AppID": 259190,
    "Name": "Alone in the Dark: The New Nightmare",
    "Release date": "Oct 29, 2013",
    "About the game": "From the moment Edward Carnby and Aline Cedrac set foot on Shadow Island, they are confronted by mysterious, evil creatures intent on thwarting their progress to recover 3 ancient tablets believed to hold the secret key to some incredible menacing phenomena. Danger threatens from every corner. The slightest shadow could be hiding deep secrets, or concealing worse nightmares... Can you see beyond your fear? Edward Carnby, the supernatural detective is back! And this time it's for revenge. Carnby's best friend, Charles Fiske has been found dead off a mysterious island off the coast of Maine, Shadow Island. Carnby's investigation quickly leads him to Fred Johnson who informs him of Fiske's search for the three ancient tablets which, when placed in a specific location, will unlock an incredible and dangerous power. Johnson pleads with Carnby to pick up where Fiske left off and reopen the investigation in order to recover the tablets. Carnby accepts the mission to find and destroy the murderer of Fiske and avenge his death. The original survival horror franchise continues with a pure blend of intense action and suspenseful adventure. Alone in the Dark immerses the player into a dark and strange atmosphere where conventional rules do not apply. The player must overcome his natural fear of the dark unknown and control Edward Carnby through a deep and highly detailed storyline. Armed with a flashlight and a pistol, Carnby must find the necessary items to survive as well as the clues which will help him escape his ultimate nightmare. Features The original survival terror franchise is reborn Incredibly detailed and realistic environments Dark atmosphere playing with obscurity and light - use your flashlight as a weapon against creatures from the dark Influenced by H.P. Lovecraft A gripping script that goes beyond your imagination. Over 20 characters, in a chilling atmosphere, deep in cinematographical production and realism. 2 totally different, but equally terrifying adventures, combined in one: Will you be Edward Carnby or Aline Cedrac?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/259190/header.jpg?t=1568008965",
    "Price": 6.99,
    "Developers": "Darkworks,Spiral House",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/259190/ss_fee58265a8a3f9902761f67896c924bbef12e3c8.1920x1080.jpg?t=1568008965,https://cdn.akamai.steamstatic.com/steam/apps/259190/ss_25fd08d09cd1faf7c03ec7883bfb0fb42b6438a5.1920x1080.jpg?t=1568008965,https://cdn.akamai.steamstatic.com/steam/apps/259190/ss_245e020c89b57b7e0564666963a59f0ba09dab54.1920x1080.jpg?t=1568008965,https://cdn.akamai.steamstatic.com/steam/apps/259190/ss_e103532f016a403ee5f58f01f5826871c5d932de.1920x1080.jpg?t=1568008965,https://cdn.akamai.steamstatic.com/steam/apps/259190/ss_6417e0b825f707980068dc9226db51c79998be5c.1920x1080.jpg?t=1568008965",
    "Slug": "alone-in-the-dark-the-new-nightmare",
    "Meta Title": "Alone in the Dark: The New Nightmare: Oct 29, 2013, Darkw...",
    "Meta Description": "Looking for information on Alone in the Dark: The New Nightmare? Check out the release date (Oct 29, 2013), developer insights from Darkworks,Spiral Hou...",
    "Alt Text Image": "Official header image for Alone in the Dark: The New Nightmare game - Steam 259190",
    "Canonical URL": "https://gusku.site/game/alone-in-the-dark-the-new-nightmare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alone in the Dark: The New Nightmare\", \"description\": \"Looking for information on Alone in the Dark: The New Nightmare? Check out the release date (Oct 29, 2013), developer insights from Darkworks,Spiral Hou...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 29, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Darkworks,Spiral House\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/259190/header.jpg?t=1568008965\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}