{
    "AppID": 1987900,
    "Name": "Ante Mortem",
    "Release date": "May 31, 2022",
    "About the game": "Presentation Ante Mortem is an exploration game with a touch of puzzles in order to solve a mystery, that of this scary and mysterious island in a vintage and pixelated style reminiscent of PS1 games ! Horror is part of it WITHOUT ANY JUMPSCARE simply with the heavy and chilling atmosphere of abandonment, melancholy and 'things' that live on this island. Developed by me, Neil Augereau, 17 years old, after more than 700 hours of work (Development, 3D and 2D modeling, Sound part, learning, Trailer, poster etc.) Today I'm releasing this game because I think it's ready, I know some of its flaws but it's also a personal outlet for my life. thank you to everyone who will order this game so that I can continue to live my dream! With that... Good game! Explore. With more than 7 different locations, try to solve the puzzles there, some complex and others very simple! Face your fears and anxieties to get through this adventure. The Lake Shed (easy) The Warehouse (medium) The Camp (hard) The Boat &amp; The Gas Station (easy) The Mountain The Cosy House Solve the mysteries there to try to escape from this place that will seem more and more cursed to you over time. Where death is near and awaits you, where spirits watch and judge you. Where your soul is and isn't. Where everything ends and everything begins. Vintage aesthetic This game takes up an approaching style of old games with of course modern additions to have a graphic style close to Silent Hill 1! Of course, the aesthetics may be vintage, but the graphic resources requested are important in view of the style, however, this is completely normal because this aesthetics is done through 3D calculation work to give a pixelated aesthetic. If you have any questions or requests about performance, please contact me on my differents social networks and also through the game's Steam discussion group or the Steam group: Coffee Interactive Search. Research is a main element of this adventure. If you don't like it then move on, this game is based on mechanics specific to old games and borrows many dogmas and values ​​from them such as the type of puzzle or as said above, aesthetics. Easter Eggs A few small Easter Eggs are hidden in the game, achievements are even dedicated to them! So walk around and have fun looking for them through the game map! Thanks &amp; Credits! I wanted to thank: Julien Jolly, Enzo Moreau &amp; Az' for their support during the development, their idea and their beta test. Thanks a lot guys :hearts: Thanks to Michael Tension for letting me use his 'Leander' font! All background musics and its usage rights were taken from Adobe Stock Audition. Tribute to Al Bowlly, a great artist of the 20s, some of whose music I used for the atmosphere of the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1987900/header.jpg?t=1654810014",
    "Price": 3.99,
    "Developers": "Neil Augereau",
    "Publishers": "Coffee Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_c911365be989b2d556ef3b50e87f48cca13e2f75.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_6394032043a83bb093175c070913f79dff626bef.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_4c1994e236b5e4a7f3d4ef1996e46fb18a9b2c70.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_bda04b6b48e7d073da8b9601e94ba07ef94b54d9.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_5b571f466b1fb0078463e6d22d42ae6485a114e3.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_1f10052dd68e54a0eec506256ffe30f447de3335.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_fb54e302f6be997b2e6f45a7a17a25d9bb589416.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_3b2c3470335ef55b37f428094adb72d1c3048d54.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_bab5a419caf4545c85ac08c02537130a4288afa1.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_f319ab41369b1d21d43f9fba305f486384307ace.1920x1080.jpg?t=1654810014,https://cdn.akamai.steamstatic.com/steam/apps/1987900/ss_6538ee0dad8b920705b7a257475a3e762f34fb78.1920x1080.jpg?t=1654810014",
    "Slug": "ante-mortem",
    "Meta Title": "Ante Mortem: May 31, 2022, Neil Augereau and Full Overview",
    "Meta Description": "Looking for information on Ante Mortem? Check out the release date (May 31, 2022), developer insights from Neil Augereau, and a complete game summary.",
    "Alt Text Image": "Official header image for Ante Mortem game - Steam 1987900",
    "Canonical URL": "https://gusku.site/game/ante-mortem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ante Mortem\", \"description\": \"Looking for information on Ante Mortem? Check out the release date (May 31, 2022), developer insights from Neil Augereau, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Neil Augereau\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Coffee Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1987900/header.jpg?t=1654810014\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}