{
    "AppID": 1039910,
    "Name": "Buckler 2",
    "Release date": "Apr 14, 2019",
    "About the game": "BUCKLER 2 , originally titled Rosefury: The Golden Plains , is an action-packed platformer with a few roguelike elements sprinkled in. You can play as a wide variety of unique characters, each with their own weapons, styles, and personalities. Travel across a brand new world, fight some baddies, dodge some hazards, and maybe make a few friends along the way. Shield-bash your way to victory and take back what's rightfully yours! The Olive Heroes A group of unlikely heroes bands to together to embark on a journey across Sector Omega , the last thing standing between the Olives and victory. However, the Roses will make sure they take the last area of uncovered land for themselves and will do anything to ensure they are triumphant. With an army of savage killers fighting against our heroes, they will have no choice but to use powerful weapons to wipe them out. Venice, our silent scarved protagonist, wields The Buckler , a mighty shield with offensive capability. Using The Buckler and a wide variety of unique weapons, Venice and his friends are ready to take on the Roses and seize Sector Omega once and for all! Cool Features What can you do in this game? Well, there's all sorts of stuff to do! You can: Bash some red dudes in the face with a shield Venture across many unique levels, each varying in shape, size, and difficulty Go fishing Play as a diverse cast of characters, each with their own weapons, abilities, and personalities Unlock powerful items that can aid you on your journey Die a bunch of times Fight a giant worm Play the slots Strive to achieve both endings ...And so much more! The World of Regroja Long ago, somewhere in the Goodbar Galaxy, there was a planet called Regroja. On this planet dwelled Regrojans, a race designed to create love. However, due to their curiosity, they stumbled upon a sleeping god, awakening it from its slumber. This diety cursed the Regrojans with two plagues, each changing the mind and bodies of Regrojans, eventually splitting them into two factions. Rising tensions between the Regrojans lead to a worldwide race war, and the once united Regrojans turned their backs on one another and killed solely in the name of hate. This continued to about 1000 years, until the day they remembered their purpose. Do you think you have what it takes to leave every square inch of this world untouched? What will you find on your adventures? How far will your luck take you? Who will live? Who will die? I leave that up to you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1039910/header.jpg?t=1576793259",
    "Price": 3.99,
    "Developers": "AploveStudio",
    "Publishers": "AploveStudio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1039910/ss_eebf387ded041c2278db1dfdfdb4f7a947198b82.1920x1080.jpg?t=1576793259,https://cdn.akamai.steamstatic.com/steam/apps/1039910/ss_0488f9d23bcb1f4ee1766de76085e75a9feb070b.1920x1080.jpg?t=1576793259,https://cdn.akamai.steamstatic.com/steam/apps/1039910/ss_47d017875cc5628a46304fd18bdcfc2f02af7e1d.1920x1080.jpg?t=1576793259,https://cdn.akamai.steamstatic.com/steam/apps/1039910/ss_5813840cf60b78397c02acf0bb63f45636da9bd7.1920x1080.jpg?t=1576793259,https://cdn.akamai.steamstatic.com/steam/apps/1039910/ss_9a9828be04cae5ecabb84e55e26303f2eabb1626.1920x1080.jpg?t=1576793259",
    "Slug": "buckler-2",
    "Meta Title": "Buckler 2: Apr 14, 2019, AploveStudio and Full Overview",
    "Meta Description": "Looking for information on Buckler 2? Check out the release date (Apr 14, 2019), developer insights from AploveStudio, and a complete game summary.",
    "Alt Text Image": "Official header image for Buckler 2 game - Steam 1039910",
    "Canonical URL": "https://gusku.site/game/buckler-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Buckler 2\", \"description\": \"Looking for information on Buckler 2? Check out the release date (Apr 14, 2019), developer insights from AploveStudio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"AploveStudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AploveStudio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1039910/header.jpg?t=1576793259\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}