{
    "AppID": 1238080,
    "Name": "Burnout™ Paradise Remastered",
    "Release date": "Jun 4, 2020",
    "About the game": "Welcome back to Paradise City! Make action your middle name as you rule the streets in Burnout™ Paradise Remastered. Tear up the town from hectic downtown avenues to wild mountain roads. Relive the high-octane stunts and wanton destruction of one of the greatest arcade-driving games ever! Burnout Paradise Remastered provides the ultimate driving playground for you and your friends to play online. This remaster includes all add-ons from the Year of Paradise, including the Big Surf Island update, meticulously recreated and ready to wreck in 4K. Big Surf Island - Introduces an all-new district to Paradise City with fresh discoverables, events, online challenges, and nine new vehicles. Cops and Robbers - Introduces new online game mode along with police variations for 33 of Paradise's original vehicles. Legendary Cars - Includes the Carson GT Nighthawk, Hunter Cavalry Bootlegger, Hunter Manhattan Spirit, and the Jansen 88 Special. Burnout Bikes - Adds 7-10 hours of single-player and countless hours of multiplayer play. Includes four motorbikes: FV1100, FV1100-T1, Firehawk V4, and Firehawk GP Competition. Burnout Paradise Toys - Includes toy versions of the following cars: Hunter Cavalry, Hunter Manhattan, Krieger WTR, Jansen P12, Hunter Takedown 4x4, Carson GT Concept, Hunter Citizen, Carson Inferno Van, and the Nakamura Firehawk GP Competition (Bike). Burnout Paradise Party - Allows for a pass-the-controls group party in-game to complete challenges. Burnout Paradise Boost - Includes two vehicles with unique boost abilities: the Carson Extreme Hotrod and Montgomery Hawker Mech. Burnout Paradise Cagney - Includes two brand new vehicles and additional 'community' vehicle finishes plus online game modes. Explore Paradise City with Friends- Burn rubber and shred metal across the open roads of Paradise City while discovering jumps, stunts, and shortcuts. Blaze your path to glory in unique events, using your knowledge of the city to find the fastest routes and get the drop on rivals. Wreck your friends online or join forces to demolish hundreds of online challenges. Break the Rules and Crash Anywhere at Any Time- Throw out that driver’s handbook and set speed and destruction records all over town. Track how many you own, and prove your demolition dominance against your friends. Send your car launching, spinning, and scraping through the city, smashing through traffic and leaving a very expensive trail of wreckage in your rearview. The Definitive Burnout Paradise Experience- The remaster delivers the complete original game and all additional downloadable content ever released with a range of technical enhancements for greater visual fidelity and authenticity, including high resolution textures and more.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1238080/header.jpg?t=1625518920",
    "Price": 19.99,
    "Developers": "Stellar Entertainment,Criterion Games",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1238080/ss_99a41070a24edee74d8d1cad94bf390a427978aa.1920x1080.jpg?t=1625518920,https://cdn.akamai.steamstatic.com/steam/apps/1238080/ss_0ede399d2c0a7ad1bd4416bef9a4da22f840df75.1920x1080.jpg?t=1625518920,https://cdn.akamai.steamstatic.com/steam/apps/1238080/ss_c584613cd8b78f2395783b911631898ec44a6eda.1920x1080.jpg?t=1625518920,https://cdn.akamai.steamstatic.com/steam/apps/1238080/ss_6b49979c197ee247719a607e3a2b5b23eb1e837f.1920x1080.jpg?t=1625518920,https://cdn.akamai.steamstatic.com/steam/apps/1238080/ss_2b620c52d66c2c05a0e63b55787c46c224ee906d.1920x1080.jpg?t=1625518920",
    "Slug": "burnout-paradise-remastered",
    "Meta Title": "Burnout™ Paradise Remastered: Jun 4, 2020, Stellar Entert...",
    "Meta Description": "Looking for information on Burnout™ Paradise Remastered? Check out the release date (Jun 4, 2020), developer insights from Stellar Entertainment,Criteri...",
    "Alt Text Image": "Official header image for Burnout™ Paradise Remastered game - Steam 1238080",
    "Canonical URL": "https://gusku.site/game/burnout-paradise-remastered",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Burnout\\u2122 Paradise Remastered\", \"description\": \"Looking for information on Burnout\\u2122 Paradise Remastered? Check out the release date (Jun 4, 2020), developer insights from Stellar Entertainment,Criteri...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Stellar Entertainment,Criterion Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1238080/header.jpg?t=1625518920\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}