{
    "AppID": 1156810,
    "Name": "Channel Player",
    "Release date": "Oct 8, 2019",
    "About the game": "Multiple VR movie files saved in each folder on your PC can be played back in folders like a single VR work. You can also display still image (jpg, png) or comic book (zip, cbz) files. Supports Oculus Touch, keyboard and Xbox game controller. When operating for Rift, it is recommended to use Open Composite. The evaluation version and Quest2 version are available on our website. Video supports VR360, VR180, 2D and Side by Side (LR), Top &amp; Bottom (Over Under), and Mono video formats. Add support for FishEye 180 Side by Side. The extension of supported movie file names is mp4. It supports jpg and png for still images and zip and cbz for comic books. If there is a still image file in the folder in addition to the video, it will be treated as a video playback folder, but the first file found will be used as a thumbnail of that folder and displayed on the screen of the SciFI theater room. For folders and comic books that have only still images, the still image display mode is set when playback starts. The playback order of videos and still images is the order of file names displayed in Explorer. It is equipped with a favorite registration function, unplayed title display, history function, and search function. You can also move the viewpoint and change the orientation while the video is playing. There is a ceiling display mode, and you can operate and view it while lying on your back. Since it does not use a laser pointer method, there is no need to raise your arm while lying on your back. In playback mode, you can change the aspect and format of your video by double-clicking the D-Pad Up / Down button on your Xbox game controller or from the radial menu. You can also specify the video format in advance in the properties dialog. A single click of the D-Pad Up / Down button will display the video title and help screen. In the setting dialog, if you set the playback start with a trigger, or if you enable the camera movement only during the pause in the movement of the left and right sticks, you can also change the setting to normally be a trick play operation. Also, if you enable swapping of AB and XY and set the movement only during the pause at the same time, the operation with Oculus Touch will be easier.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1156810/header.jpg?t=1617121036",
    "Price": 4.99,
    "Developers": "Applet LLC",
    "Publishers": "Applet LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1156810/ss_9adfa1a4d15644c98311cb3cae74e329d9179c94.1920x1080.jpg?t=1617121036,https://cdn.akamai.steamstatic.com/steam/apps/1156810/ss_d6a8345d21328920b5952f11291942ba31483a90.1920x1080.jpg?t=1617121036,https://cdn.akamai.steamstatic.com/steam/apps/1156810/ss_c4b316de1e414fd9863298da03f675ddb40eb212.1920x1080.jpg?t=1617121036,https://cdn.akamai.steamstatic.com/steam/apps/1156810/ss_045d77e4507411896aea726092738a66a104c4af.1920x1080.jpg?t=1617121036,https://cdn.akamai.steamstatic.com/steam/apps/1156810/ss_aa6f5d5bde2dda89f62545d1281c1ce2e7803556.1920x1080.jpg?t=1617121036",
    "Slug": "channel-player",
    "Meta Title": "Channel Player: Oct 8, 2019, Applet LLC and Full Overview",
    "Meta Description": "Looking for information on Channel Player? Check out the release date (Oct 8, 2019), developer insights from Applet LLC, and a complete game summary.",
    "Alt Text Image": "Official header image for Channel Player game - Steam 1156810",
    "Canonical URL": "https://gusku.site/game/channel-player",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Channel Player\", \"description\": \"Looking for information on Channel Player? Check out the release date (Oct 8, 2019), developer insights from Applet LLC, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Applet LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Applet LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1156810/header.jpg?t=1617121036\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}