{
    "AppID": 377350,
    "Name": "ChessBase 13 Pro",
    "Release date": "Aug 4, 2016",
    "About the game": "Note : ChessBase in not a chess video game. It is an educational tool designed for serious chess players for training and preparation purposes. ChessBase Pro is a personal, stand-alone chess database that has become the standard throughout the world. All kinds of players use ChessBase, from the World Champion to the amateur next door. It is the program of choice for anyone who loves the game and wants to know more about it. Start your personal success story with ChessBase and enjoy your chess even more. WHAT YOU CAN DO WITH CHESSBASE: Retrieve games according to openings, players and tournaments; generate tournament cross tables and full graphic statistics of players or openings; “Similarity search” shows all games with similar pawn structures, sacrifice patterns, endgame positions etc.; “Let's check”*: access the world's largest database of in-depth analysis (more than 200 million positions); Cloud analysis: analysis of a single position with several engines from different computers running in parallel; “Deep analysis”: generates an analysis tree that changes dynamically as with time weaker variations are dropped. One click annotates your game with the “Theoretical Novelty”; merge games on-the-fly into an opening tree; generate a player's dossier containing all available information from the database; generate a comprehensive openings report with main and critical lines, plans and most important games; Single click publishing of games on the Internet; print games in superb quality with diagrams and multiple columns; automatic update of your local reference database with the weekly installments of games; access to the ChessBase online database with over 7 million games**. NEW IN CHESSBASE 13: The ChessBase Cloud***: You are now able to make use of your databases from any computer. Set up your own repertoire and your own games in private space in our cloud. Optimize the performance of your engines with analysis tasks. Define which positions are to be analyzed, one after the other. Your engine will track your performance over time and assemble and store in-depth analyses of your games. The improved repertoire function distinguishes between the repertoire for White and Black. Ergonomic operation: Easier analysis and annotation via a new series of buttons. More efficient input of variations during analysis, new variations accepted without a request for confirmation. And much more! ChessBase Pro ChessBase 13 program Mega Database 2016 (approx. 6.4 million games, 68,500 with annotations) Access to ChessBase Cloud and ChessBase Online Database (over 7 million games Access to Weekly Games Update until 31st December 2016 * Let's Check service access last through Dec. 31, 2016 ** Live-Database access through Dec. 31, 2016 *** A ChessBase Account is required for ChessBase Cloud access",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/377350/header.jpg?t=1471449964",
    "Price": 0.0,
    "Developers": "Chessbase",
    "Publishers": "Viva Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_70f35aa7d0e7a04029f1327f4011f2b51181a053.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_25b9ea95046e138dd03f66ba6ce3ba38d2b7876f.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_3e1d968f46277bb58c8a5925dfd923ef736b15d2.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_894c8f937bfd2e41040f4979b7cf342ad78ddd1a.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_d5bf2971ca4249515944dd777ca1dc1d8cc741cd.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_0164609153c9cfd8d3202ba1d67332102068f561.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_c69ab4ffe70fef7149960753c72d94a786f0e8ec.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_0226d9c765a037ed734d0dd5e62543f2a96c8c91.1920x1080.jpg?t=1471449964,https://cdn.akamai.steamstatic.com/steam/apps/377350/ss_1c309e61852b1723b4dd282dd0e1be2178451344.1920x1080.jpg?t=1471449964",
    "Slug": "chessbase-13-pro",
    "Meta Title": "ChessBase 13 Pro: Aug 4, 2016, Chessbase and Full Overview",
    "Meta Description": "Looking for information on ChessBase 13 Pro? Check out the release date (Aug 4, 2016), developer insights from Chessbase, and a complete game summary.",
    "Alt Text Image": "Official header image for ChessBase 13 Pro game - Steam 377350",
    "Canonical URL": "https://gusku.site/game/chessbase-13-pro",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ChessBase 13 Pro\", \"description\": \"Looking for information on ChessBase 13 Pro? Check out the release date (Aug 4, 2016), developer insights from Chessbase, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chessbase\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Viva Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/377350/header.jpg?t=1471449964\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}