{
    "AppID": 1271420,
    "Name": "Chronicles of Honor",
    "Release date": "Apr 17, 2020",
    "About the game": "CHRONICLES OF HONOR is a 3rd-Person Shooter Rogue-like RPG, set in the distant future of the THON universe. -Fully customizable character, weapons, equipment and armor to support a variety of playstyles. -Select from one of three upgrades each time you level up; Mobility, Survivability, and Killing Power. Each with advantages and disadvantages. -Special Core Encrypted items will further boost your characters armor, stats and abilities. ============== == REVIEWS == ============== 'The fighting system is awesome.' 'The dynamics are just super, the choice of weapons also pleased. Levels and enemies are perfectly detailed and interesting. A good choice!' 'We will go on survival and look for weapons, we will fight with enemies in funny arenas. Grade 10.' 'Chronicles of Honor is a third person futuristic roguelite shooter with some light rpg element (upgrade, inventory, quest). Beautiful design, needs some polish (game in ea) to become a great game! ' '...a really interesting game with a lot of missions to be done I feel there is a lot of potential here... there is a cool game with fun times to be had.' =================== === EARLY ACCESS === =================== Our main focus during Early Access is: 1. Polish. Tuning items, enemies and overall difficulty ramp. Making each playstyle feel unique and rewarding. 2. Animations - Character and Enemy - It may feel a little janky or rough to start. Stick with us. 3. Sound/Audio - Some items are placeholder or have not been tuned. 4. AI - You will certainly see them do some stupid stuff. 5. Fixing bugs and incorporating feedback. Things we probably won't change: 1. General game loop - shoot and fight enemies to acquire increasingly better items. 2. Map/Waypoints/Direction. - This is intentional for exploration. 3. 'Mission' or fetch structure. Things we would like to add: 1. More Vehicles and mechs. 2. Additional areas and procedural dungeon/vaults. 3. Classes/Character customization to the base character. 4. Your suggestions. THANKS! ============== === SETTING === ============== Set on Starlight Kala, an artificial world and Interstellar data library. ============== = CHARACTER = ============== The player takes on the role of JUNA, an indestructible blackframe prototype sent to Kala for archiving, when her ship comes under surprise attack, she crashes on the surface, left with nothing. Through exploration, the player will discover core-scrolls, encrypted data that expands JUNA’s abilities in one of three categories: mobility, survivability, and killing power. Each scroll grants one point upgrade. ============== == GAMEPLAY == ============== Kala is a vast open-world, with a variety of lethal enemies and dungeons called Vaults. NPC’s will act as guides for the player, but there is no formal mission structure, waypoint or quest markers. Players are free to explore. Survival is critical. Using a power core found in the environment, or printed at a Flash Production Drive, the player will reactivate Local Relays, uncovering sections of the map and allowing for teleportation fast travel back to that point at any time. -Each activated relay grants a node, allowing players to unlock new items in the order of their choice. -Unlocked items will persist on each playthrough even after death. -Customize your perfect transhuman through hundreds of weapons and items. -Honor is a rogue-like, in that if you die, you are teleported back to the start and lose everything… except previously unlocked items. -Defeat your enemies and rescue the scions of Kala. HONOR Superhumans. Distant Future.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1271420/header.jpg?t=1589032373",
    "Price": 12.99,
    "Developers": "Forge Father Games, Inc.",
    "Publishers": "Forge Father Games, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_47df0ae1448f8abcb593bf60ffb399aa5a490e7c.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_dd12d6627b66517c3d0ab8b23a9ee2dbbdee5f5a.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_0428243a95f7c529bcb77c99ba31d6567dfb1a1a.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_7280245c0b3107eb54dfcd5c4abff1d88293cd50.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_454d8e0e9985c83b512370609fccd9cbfff94755.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_eca0c926e63c061743af3e993bb618142cd47704.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_415a9456e83ca40b2aa5cf021e89f2f9301d8bdb.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_93f3ced81f00adb092aa18089ad8b587f557e757.1920x1080.jpg?t=1589032373,https://cdn.akamai.steamstatic.com/steam/apps/1271420/ss_581d65c9678ad761b8796edf7a555a3063540c40.1920x1080.jpg?t=1589032373",
    "Slug": "chronicles-of-honor",
    "Meta Title": "Chronicles of Honor: Apr 17, 2020, Forge Father Games, In...",
    "Meta Description": "Looking for information on Chronicles of Honor? Check out the release date (Apr 17, 2020), developer insights from Forge Father Games, Inc., and a compl...",
    "Alt Text Image": "Official header image for Chronicles of Honor game - Steam 1271420",
    "Canonical URL": "https://gusku.site/game/chronicles-of-honor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chronicles of Honor\", \"description\": \"Looking for information on Chronicles of Honor? Check out the release date (Apr 17, 2020), developer insights from Forge Father Games, Inc., and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Forge Father Games, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Forge Father Games, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1271420/header.jpg?t=1589032373\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}