{
    "AppID": 1484680,
    "Name": "CrazyFlasher7 Mercenary Empire",
    "Release date": "Jan 19, 2021",
    "About the game": "Role operation 1. Use the 'W' 'S' 'A' 'D' keys on the keyboard to control the character's actions in all directions. 2. Double-click 'A' or 'D' to run the character. 3. The attack key is 'J' and the jump key is 'K' (only in the empty hand and cold weapon mode Can jump, the 'K' key in the short gun mode is also used as an attack key, and the 'K' key in the long gun mode has no effect) 4. Standing on an item and pressing the 'J' key can make the character pick up the item. 5. Weapon switching number '1' is unarmed mode, number '2' is cold weapon mode, number '3' is pistol, submachine gun and other short gun mode, number '4' is long gun mode, number '5' is grenade mode. 6. The 'R' key changes the magazine, and the 'Q' switches the attack mode. 7. '7', '8', '9' recovery type props shortcut keys; 'Y' 'U' 'I' 'O' 'P' '[{' skill shortcut keys. 8. Click the NPC with the mouse to open the corresponding menu for trading, learning skills and other functions. Weapon system 1. Weapon switching number '1' is unarmed mode, number '2' is cold weapon mode, number '3' is pistol, submachine gun and other short gun mode, number '4' is long gun mode, number '5' is grenade mode. 2. Unarmed combat (1) Hold down 'J' to make a set of combo punches. (2) Press 'K' to jump, and press 'J' in the air to make a flying kick. (3) According to the player's preferences, you can arrange the skills you need on the skill shortcut bar in the lower right corner. First change the skill icon under the 'Skills' option in the 'Inventory'. Drag to the skill shortcut bar at the bottom right corner of the game screen, and use the corresponding 'Y' 'U' 'I' 'O' 'P' '[{' keys on the keyboard to use the skills. 3. Cold weapon combat (1) Press '2' to change to cold weapon mode, press and hold 'J' to kill with cold weapon. (2) Press 'J' in the running state to stab the enemy with the weapon in your hand. 4. Modern weapon combat (1) Press '3' to change into short gun mode, you can equip the short guns of left and right hands at will, and press 'J' and 'K' to control the firing of left and right hands respectively. (2) Press '4' to change to long gun mode, press 'J' to fire. (3) Press '5' to change to grenade mode, press 'J' to throw the grenade. (4) Except for grenades, all firearms can be replaced by pressing 'R'. Dual-wield firearms can replace 2 magazines at a time. (But you need to pay attention to the remaining bullets in the previous magazine will be discarded when changing the magazine) Note: There will be an introduction to the weapon when the mouse is placed on the firearm Different weapons need to use their corresponding magazines. The magazines not available in the game NPC can be purchased in the game store. Equipment items There are four icons at the bottom of the game screen, from left to right are the prop bar, task bar, music, and system settings. Click the inventory icon to open the item equipment interface As shown in the figure above, drag from the lower inventory (hold down the left mouse button on the selected item) and equip it to the corresponding position in the upper equipment area to equip the item. Click on the equipped item. The small X in the upper right corner of the icon can remove the equipment. Food items such as HP potions, MP potions, and canned beef can be dragged to the shortcut bar at the bottom left of the screen. Use the corresponding '7', '8' and '9' keys on the keyboard to facilitate the use of food items. Unnecessary props can be dragged to the trash can icon in the lower right corner of the interface to discard. View task Click the task bar icon at the bottom of the game screen to open the task information interface. 'My task' option can view the current task status and task details. In the 'Event log' option, you can view the completed tasks. The task status is divided into two states: in progress and completed. For tasks in progress, please follow the prompts in the detailed information. (The task of prompting to obtain the item needs to return to the base after the specified item is picked up, otherwise the task cannot be completed) After the task is completed, a prompt icon will appear in the lower right corner of the game screen. At this time, you can complete the task by looking for the NCP who completed the task. Take the next task while getting the reward. Buy and sell items Buy items: Andy Law (armor), The Girl (medicine food), Blue (groceries), Shop Girl (arms and ammunition) in the base And Boy (ammunition) of the BPK team can buy and sell items. Talk to them (click on the character with the left mouse button) Select the 'Buy items' option to open the purchase item interface, click on the item you want to buy and click OK to buy and sell items: While opening the purchase item interface, open the character inventory and drag the item you want to sell from the character inventory to the purchase item interface to sell items Upgrading the system At the bottom of the game interface, there is a set of green experience slots When the green experience value fills the empty slot, you can increase it by one level, and your attack power, defense power, speed and other values ​​will be improved. The number on the left of the experience slot is your current You can gain experience points by defeating enemies and completing tasks at the previous level. You can gain a lot of experience when defeating enemies with higher levels and completing difficult tasks. Skill system Dialogue with Andy Law and Blue in the base (click on the character with the left mouse button), select the 'Skills' option to open the learning skills interface Click the skill you want to learn and click OK to learn successfully. Repeat learning the same skill to upgrade the skill, currently the highest is level 10. Learning skills need to consume skill points, each level you can get a certain skill point NPC Click the thumbnail map in the upper right corner of the screen to expand the detailed base map The detailed map indicates the location of each key NPC, the location of the facilities in the base, and the entrance to each large map On-hook system The leftmost room on the basement level of the base is a gym, where you can use dumbbells, barbells, and stakes to train to gain experience points When the mouse is moved to a training item, there will be a yellow light effect Barber shop The location of the barber shop is on the left side of the mercenary hall on the first floor of the base. You can pay a certain K point in the barber shop to change the character’s hairstyle and hair color Note: After receiving the items, please click on the upper right corner of the game screen, save the game next to the small map or use the safe exit in the system settings to save the game (After you click to exit the game, you can click 'Cancel' to continue the game while achieving the purpose of saving). If the game is not saved after receiving the item, close the browser directly It may cause the items to disappear. Please pay special attention to players! ! ! exit the game In the upper right corner of the game screen, there is an icon on the left side of the minimap. Click to save the game data and exit the game. You can also save data and exit the game through the 'Safe Exit' button in the system settings interface. If you don’t want to exit the game, click 'Cancel' to continue the game after the save is successful",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1484680/header.jpg?t=1611102671",
    "Price": 0.0,
    "Developers": "AndyLaw",
    "Publishers": "AndyLaw",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_d9ab968201cb2f9e307acaac5ead0e2b15027310.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_3a3d993647a83ac7b5a9e8f835d320a3e1b5aa14.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_ba311e14bfc9b90743883ce2149fba05c36475bf.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_9c0eba63f4fe02552d2a2f95766455cfc215dbeb.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_b34ee76a41e08b27f7688a6b626a4cdfaf926961.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_121979fcb9541ed56e2fc02e46bbf5790349a107.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_ce3ff62fa92427d294d9cbdc1159bca57f733469.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_e9644f3ded04a2cfb05197cb8e3e823c1b8e4adc.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_c9a87bb38c2ada17f1cf0c92c05b08e056c4e281.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_38dfee511ab9bd68f980e0360bddd07e80813a64.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_98c65564ae426d6405ee2b33d541e915728bb35a.1920x1080.jpg?t=1611102671,https://cdn.akamai.steamstatic.com/steam/apps/1484680/ss_7116ec5a8ce24acdf52286401d00a33f1e7b91c0.1920x1080.jpg?t=1611102671",
    "Slug": "crazyflasher7-mercenary-empire",
    "Meta Title": "CrazyFlasher7 Mercenary Empire: Jan 19, 2021, AndyLaw and...",
    "Meta Description": "Looking for information on CrazyFlasher7 Mercenary Empire? Check out the release date (Jan 19, 2021), developer insights from AndyLaw, and a complete ga...",
    "Alt Text Image": "Official header image for CrazyFlasher7 Mercenary Empire game - Steam 1484680",
    "Canonical URL": "https://gusku.site/game/crazyflasher7-mercenary-empire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"CrazyFlasher7 Mercenary Empire\", \"description\": \"Looking for information on CrazyFlasher7 Mercenary Empire? Check out the release date (Jan 19, 2021), developer insights from AndyLaw, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"AndyLaw\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AndyLaw\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1484680/header.jpg?t=1611102671\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}