{
    "AppID": 854500,
    "Name": "Dawn of the Celestialpod",
    "Release date": "Jun 12, 2018",
    "About the game": "Gameplay At the core of Celestialpod is a unique physics based tentacle system that allows you to swing, pull, and grab your way through rigorous challenges. Every ship poses new tests where you’ll need to master the use of your tentacles in order to stand a chance. The robots will do anything they can to keep harvesting the Starfish, and will constantly invent new enemies to prevent you from rescuing them. Overcome the hostile environments inside the ships of the robotic fleet and destroy them from the inside out! Features Challenging physics based gameplay 10 unique ships with specialized tools to kill you 1 Boss created in your image Upgrade system which empowers your squid Custom 2D-tentacle system Highly destructible environment Unique 2D art style, with parallaxing depth The Story Starting out as a Starfish yourself, one day a robotic fleet appears above your planet. In mere seconds they descend, capturing every Starfish on the surface. While you’re locked in one of the cages another Starfish somehow manages to escape and frees you. The two of you make it outside, but the defense system of the ship notices and takes aim. Your savior sees the danger and, in an act of self-sacrifice, pushes you out of the way just in time. As they perish, the Starfish leaves you their remaining power. The influx of Starfish energy changes your very DNA, turning you into a Squid-like creature. With their sacrifice fresh in your mind you charge towards the fleet, determined to save the rest of the Starfish! // Defeat robotic enemies reminiscent of forgotten species and discover the chilling reality of what could befall your friends. A Little About How This Started Dawn of the Celestialpod started development in early September 2017 as part of a Student Capstone project. Over the next couple of months we built out and expanded upon the original concept. At the end of the semester we presented to the campus faculty and game studio cohort in an effort to move on to Senior Production. We’re here because we made it through that challenge, and over the past couple months have expanded upon the game immensely. We've gotten the game to the point where we are comfortable releasing it to Steam, and can't wait for everyone to play it!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/854500/header.jpg?t=1528808952",
    "Price": 0.0,
    "Developers": "GWAMM LLC",
    "Publishers": "GWAMM LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/854500/ss_ee1fe008ee8c3f7f04f2acea74dcf065ab5e85d9.1920x1080.jpg?t=1528808952,https://cdn.akamai.steamstatic.com/steam/apps/854500/ss_284072f4430ffe2775bace221c1a5b39a670bfb0.1920x1080.jpg?t=1528808952,https://cdn.akamai.steamstatic.com/steam/apps/854500/ss_efb4411e155932e525f8cc552265352facc92f1c.1920x1080.jpg?t=1528808952,https://cdn.akamai.steamstatic.com/steam/apps/854500/ss_589c4caef5bb09069ebd811d9999ffbdeb07822d.1920x1080.jpg?t=1528808952,https://cdn.akamai.steamstatic.com/steam/apps/854500/ss_a542339a8f3c3394193f96bf0b35a219c47bb888.1920x1080.jpg?t=1528808952",
    "Slug": "dawn-of-the-celestialpod",
    "Meta Title": "Dawn of the Celestialpod: Jun 12, 2018, GWAMM LLC and Ful...",
    "Meta Description": "Looking for information on Dawn of the Celestialpod? Check out the release date (Jun 12, 2018), developer insights from GWAMM LLC, and a complete game s...",
    "Alt Text Image": "Official header image for Dawn of the Celestialpod game - Steam 854500",
    "Canonical URL": "https://gusku.site/game/dawn-of-the-celestialpod",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dawn of the Celestialpod\", \"description\": \"Looking for information on Dawn of the Celestialpod? Check out the release date (Jun 12, 2018), developer insights from GWAMM LLC, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 12, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"GWAMM LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GWAMM LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/854500/header.jpg?t=1528808952\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}