{
    "AppID": 1371220,
    "Name": "Death: The Ascension",
    "Release date": "Oct 20, 2020",
    "About the game": "[STORY] You found true love and lived happily with your wife . That was until her death made you alone again. The next moment, you found yourself in the presence of Death itself. Death offered you a deal to get your wife back. However, her life had a price that you must pay at the end of your mortal life. Fail to pay, and you will lose your soul. [GAMEPLAY] You play cards that represent an action you could take, all actions have 4 different outcomes 2 good and 2 bad, each card has its unique chance that is affected by your resources and you. 'High risk, High reward' Resources are needed for paying the price, death has given you a chance but you need to pay, so instead of getting powerful for the final boss, you need to be as greedy as possible to have enough to pay at the end. 'The rich get richer and the poor get poorer' You can change drastically the chance of your action negatively or positively by using the soul extraction/infusion power you were granted by death so you may have a chance. “Souls are the most valuable resource” -The Grim Reaper Gathering resources is not enough. You also need to ' ASCEND ' by climbing one of the 3 paths at every step you will face a decision you must take. Everything is up to chance, but as in life the more you ' sacrifice ' the better the chance is. [MANAGEMENT] GOLD - as much as you can. LOVE - too much can be distracting. FAME - bow before the king. LAW - no one is above the law. [CARDS] You start your new life with the desire to make gold, to change fate, and hatred for this world. 4 Gold cards 1 Hate card Each card has 4 outcomes: Terrible Bad Good Formidable [CHANCE MANIPULATION] You can change the outcome of a card in 2 ways. [Indirectly] Gathering resources affiliated with the card. [Directly] Using SOULS to change the chance. [SOULS] Sacrifice the chance of a card to get souls, but get a terrible outcome. Sacrifice souls to get a better chance at the card you play for a formidable outcome. [EXCHANGE] From GOLD, LOVE, FAME, and LAW to SOUL and back. At insane exchange rates. “Would rather starve than lose your wife?” [BLOOD RITUALS] Use your blood to perform rituals: Destroy one of your desire (card) Become a new self (random card from the deck) Devil Bet (pay blood to receive wealth or lose years out of your life) [BLOOD &amp; MAP] You chose your own path to the God gamble: the PURE path Proves little challenge but no hate or blood. the OPORTUNIS path The balance between hard encounters and rewards of hate and blood. the CORRUPTED path The hardest path, but with lots of hate and blood. [DEATH CARD] Death has his own deck of cards base on the path you take, Death could burden you or help you. Every Death card has 3 results The Intention The default card effect if no action is taken. The Prevention Using a blue gem card. Prevents the bad effect or amplify the good one. The Elimination Using a red gem card. Remove the card from the Death deck. Every death card has a different blue/red gem card.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1371220/header.jpg?t=1634200101",
    "Price": 4.99,
    "Developers": "Dystopian Ruler",
    "Publishers": "Dystopian Ruler",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_ebb123d38852d6c6898894ce1fd608abc040cbe6.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_0b06e69f8ff5a81d13e2a38b4bd840d8b6f7e7b8.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_bec7a530d45a0c834cb4b18a2075149200db71dc.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_e2a2b9d7047dfc6f9a7a9f2baa751f567d45674f.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_b118fa4a676ac2113f0e8ea8b3a0f1a7a6e6661c.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_407640c68bd457332e28765b46b6c5161d8cfebc.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_26fb4c799cd0437e31aad63ae5c8b4ed3f46d763.1920x1080.jpg?t=1634200101,https://cdn.akamai.steamstatic.com/steam/apps/1371220/ss_29eddbfb3082b1c77f33c19fe1f3c83f91bfb1b3.1920x1080.jpg?t=1634200101",
    "Slug": "death-the-ascension",
    "Meta Title": "Death: The Ascension: Oct 20, 2020, Dystopian Ruler and F...",
    "Meta Description": "Looking for information on Death: The Ascension? Check out the release date (Oct 20, 2020), developer insights from Dystopian Ruler, and a complete game...",
    "Alt Text Image": "Official header image for Death: The Ascension game - Steam 1371220",
    "Canonical URL": "https://gusku.site/game/death-the-ascension",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Death: The Ascension\", \"description\": \"Looking for information on Death: The Ascension? Check out the release date (Oct 20, 2020), developer insights from Dystopian Ruler, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dystopian Ruler\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dystopian Ruler\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1371220/header.jpg?t=1634200101\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}