{
    "AppID": 1208390,
    "Name": "Deserted",
    "Release date": "Mar 15, 2021",
    "About the game": "Deserted is a stylized 3D low poly, action adventure with light RPG and narrative elements. Inspired by the alien atmosphere of Out Of This World, Deserted combines narrative storytelling with survival and fast paced strategic combat to deliver a thrilling adventure supported by a tailored musical score and sound design to maximize the experience. In a vast and uncharted system, you crash land on a planet scarred with ancient ruins and technology long faded from any recollection. As your only companion takes his last breath, your journey unfolds and the fight for survival begins. Players will traverse dense forests, enormous spires, and ancient ruins to run down factories and deserted laboratories set against a colorful low poly aesthetic. Many secrets and paths lay hidden for players to find that uncover the lore and offer upgrades and weapons. The combat mainly focuses on fast paced strategic game-play, and offers players many options and play styles. Lock on to your target and build your character around sword, shield and stamina upgrades for a visceral blade to flesh approach or equip gun specific modules and modify the characteristics of your ammo and guns. You can upgrade your character to suit your needs and adapt your combat style. Core Features Survival in Deserted plays a pivotal role, but will never punish you. Explorers will be rewarded with unique items, and upgrades to help them along on the journey. Combat that is both fun and challenging. Tear apart your enemies with up-gradable weapons and turn the tide against even the strongest foe. With a unique skill tree system utilize and forge strategies against a vast array of enemies. Local Co-Op - In Deserted you don’t have to play alone. We offer up to 2 players local co-op through the entire campaign. Play as either a female or male special operative and customize your appearance. As a galactic special operative you come equipped with an arm mounted module system that allows you to track your health, synthesize materials, emits wonderful glows, and more importantly gives you the ability to construct a powerful holo-blade. A.T.0.M. Drone (Advanced, Tactical, Operative, Module) – Is your mechanical companion on this journey. Use its features to scan the landscape and generate a 3D map, help you in combat by providing extra fire power, communicate with technology and provide a holographic display. The Fallen One – The soul essence of one of the “Ancient”. His people were lost to the great war, but his energy lived on imbued in a remembrance stone. With this energy you are able to interact with their technology, access areas that were closed off and use the spirit force in combat by summoning “the spectral beast”. Primary Weapon – An up-gradable Holo-Blade constructed from energy in your arm mounted module system. Cuts through most matter and adapts it self to foreign bodies. Secondary Weapons – An array of matter decimating weapons capable of burning, freezing and electrifying enemies. These include a hand gun, automatic rifle, rocket launcher, rail gun and shotgun. Gadgets – Grenades and throw-able items able to create powerful stun fields, decimate many enemies and burst through stone walls to uncover hidden passage. Modules – Equipping different modules gives you access to different skill trees unlocking a variety of awesome upgrades and unique abilities. Each module can be maxed-out and crafted into master modules. Crafting – To survive this planet, you will need to harvest materials and resources. You can utilize the unique energy signature of plants and materials and synthesize a whole array of healing options, antidotes, augment modules, and craft batteries for your guns.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1208390/header.jpg?t=1647361438",
    "Price": 19.99,
    "Developers": "Zebik Media Interactive Ltd.",
    "Publishers": "Zebik Media Interactive Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_981a38f9b0ad1e4aa99a98255ea223f95052f349.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_b05d88c6bcad96e200d6cc98886158680d6cec2d.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_0d2e0fc84aaa3db0c2b6a812584d7cf7588f8160.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_1f4bb1fd3e9709ee5ea879d8954a4c0a8fca7498.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_bb2e99855407f9e572c0bd35e3cce752563595d0.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_3a876dbc6da9e1522b72209d8ff013ff8cd89467.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_a71bd64be205f1b120a5b7b60646a169ac9ce5a9.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_b2155eaa1adcff83fbc64be1497d56d1be4f27de.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_e28a340a869d092165d7285ef656b3c2575c3fcf.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_b2e0d8d3e532b78edc4b96f9055678ce793dd509.1920x1080.jpg?t=1647361438,https://cdn.akamai.steamstatic.com/steam/apps/1208390/ss_5f0c24e840b61bc8c53d633f3e7cf61afebb0782.1920x1080.jpg?t=1647361438",
    "Slug": "deserted",
    "Meta Title": "Deserted: Mar 15, 2021, Zebik Media Interactive Ltd. and ...",
    "Meta Description": "Looking for information on Deserted? Check out the release date (Mar 15, 2021), developer insights from Zebik Media Interactive Ltd., and a complete gam...",
    "Alt Text Image": "Official header image for Deserted game - Steam 1208390",
    "Canonical URL": "https://gusku.site/game/deserted",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Deserted\", \"description\": \"Looking for information on Deserted? Check out the release date (Mar 15, 2021), developer insights from Zebik Media Interactive Ltd., and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zebik Media Interactive Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zebik Media Interactive Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1208390/header.jpg?t=1647361438\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}