{
    "AppID": 993840,
    "Name": "Drive",
    "Release date": "Jul 23, 2021",
    "About the game": "Headset on, wait for the lights, then pedal to the floor and push it hard around the track as fast as you can. Drive was built for VR and lets you experience being behind the wheel in fast and breathtaking arcade racing. Remember to look around and use your mirrors as your competition will push hard to take those hard-earned positions from you. RACING VARIETY Traditional racing pits you against AI opponents testing your skill in single races or multi-race series. Arcade challenges let you really fly with classic checkpoint mode and jumps races adding an extra dimension to your racing. Think you're a champion? Test yourself in the new Season 1 Career Mode across eight series and thirty-two races. Keep racing to earn experience and rise through the ranks of the global leader boards. YOU’RE IN THE CAR VR puts you inside the car so remember the mirrors are your friends and keep your eyes and ears open. Whether you’re enjoying the hardwood dash of an old classic, the heavy roar of a modern engine or the nice scenery try not to get too distracted. ONLINE MULTIPLAYER Race against friends and players from around the world. Featuring all cars, tracks and racing modes with some extra multiplayer only arcade modes including Slalom and Magic Doors (ever driven 400kph before?). DRIVE CUSTOMS Drive Customs is the new in game customisation workshop in Drive which allows you to add a little flair to your ride. Earn EP (Earnings Points) when you race then duck into Drive Customs and redeem them for new suits, helmets, special paint jobs or body mods for your cars. [NOTE: You can only redeem in game EP points in DRIVE Customs, no micro transactions. Non-tradeable] CORE FEATURES Built for VR arcade racing (supports Oculus Rift, HTC Vive, OpenVR, WMR headsets) 2D play mode supported (non-VR screen mode) Online multiplayer racing Multiple race modes: Quick races, Challenge races, Championship Series Career Season 1: Season 1 of career mode is now available with 32 races across 8 series Includes 19 tracks and 5 cars Race up to 19 AI opponents Customise your ride with Drive Customs Car configuration including ABS, steering stabilisation, traction control and gearing. Vehicle damage, tyre wear, fuel usage Pit system with animated pit crew XP Points, EP Points, Achievements and Global Leader Boards Supports controllers, keyboard and steering wheels Configurable control input settings HAVE FUN Drive is based on traditional racing but with plenty of freedom to make mistakes or cut corners. Don’t be afraid to explore the racing experience by going the wrong way or causing some mayhem…ever barrel roll a convertible off a jump? It’s all good in arcade racing and exhilarating in VR. NON-VR MODE No headset? No problem, Drive also runs in 2D (screen mode) allowing VR and non-VR player to race together. HARDWARE SUPPORT Drive was built for VR and supports Oculus and Open VR. Input control is by controller (XInput supported devices), keyboard and steering wheel. Rumble is supported for controllers and XInput devices.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/993840/header.jpg?t=1627046808",
    "Price": 18.99,
    "Developers": "Novus Res",
    "Publishers": "Novus Res",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_20b858f6c8f980341b0b46d307f0c99e8f693620.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_94db1ef5c50aef657b5c43f36290f71a1ce3f069.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_63da1b4f02228c50f13a2d98b6572730dac323a4.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_3aa16a037f6e09333e37437e5ccf0b9d9ce1a341.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_fdfe26781b255fb9c88624d7d71ca52ad5c77b8e.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_c0c00747c77ffd0d0a93b1e749895ba96097e15f.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_8005f05e241563883701cdd5e3467b4bbb6dda07.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_e83665c1b01fe9932495dd166066ab2da3dffa5b.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_d2a463d90fce9a4caf518a10e3597cbaf063d830.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_476315c54684ed3acb50bd69632fe6cad856fd0f.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_5199c39180b5c4c6202c3974101f0efe3e359fe8.1920x1080.jpg?t=1627046808,https://cdn.akamai.steamstatic.com/steam/apps/993840/ss_4e83b86953df2b356a75fc4f041d90226f9f5d91.1920x1080.jpg?t=1627046808",
    "Slug": "drive",
    "Meta Title": "Drive: Jul 23, 2021, Novus Res and Full Overview",
    "Meta Description": "Looking for information on Drive? Check out the release date (Jul 23, 2021), developer insights from Novus Res, and a complete game summary.",
    "Alt Text Image": "Official header image for Drive game - Steam 993840",
    "Canonical URL": "https://gusku.site/game/drive",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Drive\", \"description\": \"Looking for information on Drive? Check out the release date (Jul 23, 2021), developer insights from Novus Res, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 23, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Novus Res\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Novus Res\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/993840/header.jpg?t=1627046808\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}