{
    "AppID": 1090960,
    "Name": "DunkRatz",
    "Release date": "Sep 4, 2019",
    "About the game": "When you’re out of the kitchen, the rats will dunk. DunkRatz is a team-based local multiplayer game for 2-4 players. Each player takes control of a rat on a kitchen floor, with the goal of feeding a ball of cheese to their team’s giant baby rat to score a point. Unique dashing and grabbing mechanics mean that teams that work together will have the most success feeding their baby. Not only can players grab the cheese and throw it towards their baby, but they can pick up ANYTHING and throw it around: their baby, the other team’s baby, even other players! Special items periodically spawn into the kitchen that players can pick up and use to shake-up the match. First team to reach the score limit wins! Simple controls with physics-based movements: rotate your rat with the analog stick, and hold down the dash button to charge up a dash. Running into objects with your mouth will automatically grab them, allowing you to charge up and throw the object instead of moving yourself with a dash. Interact with everything: Pick up the cheese to throw it to your baby, or pick up your baby and throw it towards the cheese! Want to play defense? Pick up the other team’s baby and move it away from the cheese. Players can even grab other players if they manage to get to their rear. But remember: if you are holding an object then you cannot dash. Wrestle other players: Not only can players pick up and throw the babies and the cheese, but they can also grab other players. Dominate the game by grabbing other players by the rear and throwing them far away from the action, or grab them and hold them in place right before they dash away with the cheese. 5 different special items: Players can bump into special cabinets that periodically activate to obtain special items that can help tip the match into their favor: get a quick speed boost with a bottle rocket, pull in objects from far away with a plunger, lay down mouse-traps to catch your opponents, block off part of the arena with Jelly molds, or knock objects out of your opponents hands with a well-aimed egg. Cheese cannons never break the flow: Instead of stopping and restarting play after each cheese ball is scored, 2 big cheese cannons appear from the refrigerators and allow each team to strategically launch the next cheese ball onto the arena. Jazz-inspired musical soundscape: Every action in the game has a musical sound-effect that makes for a unique funky tune every match. Customize your match: Choose which items can spawn into the game, and choose what score limit to play to (we recommend 10). We cut the fat: Like most sports, DunkRatz has just one game mode and one arena. We focused on the fun and designed every mechanic around it. DunkRatz requires a controller for each player and does not support keyboard/mouse play. While DunkRatz does not have native online support it does takes full advantage of Steam's Remote Play Together feature allowing you and up to 3 friends to play together online! Controls: Left stick - Rotate your rat. A button (while not holding anything) - Hold to charge up a dash or tap quickly for smaller steps. A button (while holding an object) - Hold to charge up a long throw, or tap to quickly toss the object a small distance. B button - Use special item.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1090960/header.jpg?t=1573838961",
    "Price": 3.99,
    "Developers": "Pink House Games",
    "Publishers": "Pink House Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1090960/ss_ef7f282556e9de1ff743a9ac4537ad980b8ff158.1920x1080.jpg?t=1573838961,https://cdn.akamai.steamstatic.com/steam/apps/1090960/ss_10afabf09e9d19d3450135cd5f11744501d99042.1920x1080.jpg?t=1573838961,https://cdn.akamai.steamstatic.com/steam/apps/1090960/ss_d02b52dc244530e5c7fc130814a224e91f02c9a4.1920x1080.jpg?t=1573838961,https://cdn.akamai.steamstatic.com/steam/apps/1090960/ss_90b535853edf8e965ca2252797c8eacc25b65bca.1920x1080.jpg?t=1573838961,https://cdn.akamai.steamstatic.com/steam/apps/1090960/ss_7651d4413cf02a9fcad0ebf2ebc25634b9ccce34.1920x1080.jpg?t=1573838961",
    "Slug": "dunkratz",
    "Meta Title": "DunkRatz: Sep 4, 2019, Pink House Games and Full Overview",
    "Meta Description": "Looking for information on DunkRatz? Check out the release date (Sep 4, 2019), developer insights from Pink House Games, and a complete game summary.",
    "Alt Text Image": "Official header image for DunkRatz game - Steam 1090960",
    "Canonical URL": "https://gusku.site/game/dunkratz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DunkRatz\", \"description\": \"Looking for information on DunkRatz? Check out the release date (Sep 4, 2019), developer insights from Pink House Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pink House Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Pink House Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1090960/header.jpg?t=1573838961\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}