{
    "AppID": 259570,
    "Name": "EDEN STAR",
    "Release date": "Jan 30, 2015",
    "About the game": "Eden Star is an immersive Sci-Fi survival game that blends innovative physics based combat, destructible environments and free-form construction with the exploration of a hostile alien world. Explore and gather resources from the environment of Pharus 7, use these materials to construct defensive outposts, craft powerful weaponry and upgrade your Pioneer. Current Features Co-op &amp; PVP Multiplayer 4x4 km World All New Crafting Inventories 20 + Material and Compound Material Types Colony Creation System (Teams) Physics based combat (Smash) Splintermite (Ground Enemy) Cerberus (Wolf) Stalker (Ground Enemy) Ika (Flying Enemy) Ika Viper (Flying Enemy) 5 Wildlife Creatures (neutral) Swamp Walker (Neutral/Defensive Creature) Swamp Biome Forest Biome Foliage Destruction Mineral Rock Destruction Wall running and Mantling Weapon Combos and Ammo; Pistol Machine Pistol SMG Assault SMG Heavy SMG Rifle Assault Rifle Assault Shotgun Heavy Rifle Long Range Assault Rifle Sniper Rifle TAC (heavy) Rifle Ammo Clips for each reviever variant Gauss Module Flechettes Reflex Sight Sniper Scope Multiple “MATA-Tool” Abilities/Upgrade Modules; Kinetic Blast Kinetic Laser Energy Harness (Mining) Energy Harness Reclaim Structures (Undo) Regeneration (Heal Structures) Energy Harness MATA-Combat (Smash) Gauss Cannon Melee Baton Melee Energy Blade Primitive Structures; Foundations Barriers (Half Walls) Walls Glass Wall Windows Ramp Pillar Ceilings (Floors) Functional Structures; Eden Kit Auto Turret Energy Turret Missile Turret Energy Walls Doors &amp; Doorways Energy Generator For an up to date list of what we are currently working on we have a public Trello board available HERE (you must have a Trello account to comment or vote on features) In Development Splintermite Queen (large ground enemy) Weapon - Grenade Launcher Weapon - Frag Grenade Expanded build types &amp; Decorators Fauna Creatures Vehicles In Planning We will not promise that the following features will make it into the game until they are actually in the game! Further Refinement of Melee (Combos) Expanded World Additional Pioneer Characters Steam Achievements Health Packs Craftable/ Upgradable Armour Utility buildings (generators etc) Caves/Catacombs More enemies! More neutral creatures Robotic allies Vehicles/Mechs Procedurally generated loot and rescources THE GAWR... Current Feature Overview Destroy Use your MATA-Tool (Remote Manipulation Device) to harvest trees, foliage and mineral rich rocks within a real-time physics driven environment. Obtain Material Shards for use in outpost building, weapon construction and powerful upgrades. Destroy and recreate your surroundings at will; the world is yours to manipulate, just watch out for the indigenous lifeforms… Build Use gathered Materials to craft defenses, walls, ramps and turrets to protect your outpost or construct powerful weapons and upgrades for your Pioneer. Place gathered Materials within your Eden Kit to store, or use them to upgrade the Eden Kit's protective shield and power additional defenses. Expand your territory by building additional Eden kits. How you balance your resources is up to you. Protect Using unique physics-driven combat you can remotely grab enemies and smash or blast them into the destructible environment. Upgrade your weaponry to tackle the alien hives and claim the territory for your own. Combine different attacks and abilities in order to survive against enemies and environmental hazards. A simple, but fluid movement system gives you freedom to move athletically across surfaces. Death in Eden Star is permanent. You can be reconstructed back by the Eden Kit provided it contains Teslinium and remains intact, but naturally it must be protected... The Tech Demo is free and is automatically downloaded with Eden Star. To access it you must do the following; Find Eden Star :: Destroy - Build - Protect ® in your Steam Game Library Right Mouse Click over Eden Star :: Destroy - Build - Protect ® and select Properties from the bottom of the list Left Mouse Click on the 3rd tab labelled Local Files Left Mouse Click on the Browse Local Files button This Will Open Up A Browser Window Click on the UE3 Combat Tech Demo folder Follow the instructions listed within the associated Readme file within the folder, all instructions are also within the Readme document To launch the Eden Star Tech Demo you must find the folder where you have installed the Tech Demo and find the following folder; EdenDemo_5.7 &gt; Binaries &gt; Win64 then click on the application (.exe) 'EdenGame' to launch the demo e.g. :: C:\\Eden\\EdenDemo_5.7\\Binaries\\Win64\\EdenGame.exe",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/259570/header.jpg?t=1572427211",
    "Price": 19.99,
    "Developers": "Flix Interactive",
    "Publishers": "Flix Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_1a9800dc2343c90d1bb1986dc62b7ccbbafa7328.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_0e9fec0fc5641a03b925f1ef265c17314f7ff3b0.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_351a4e6f33526b44f52183b0d73b5278ed9da1db.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_77046acfdbc6c82403feb7b76e2dd77179cb2424.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_4bc28148352a2f564560f021a0bdbd454baea803.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_7d67b4198a5499c00697f60a66c6cee7784bcce6.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_c27006471b35576cdee0b5045f6e0b84b06a841f.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_5d5bb075edf7f6a06c99ce400775fc552340bdb6.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_83ddec697749ca550fda59f2019a8544d312608d.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_8a8a757031a2646308f78ef14477ee3ad98b83ad.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_1f5db20ed303c27f9574394a33c84a87bb470f38.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_4393cde77eb4515337d69755ccf0962b5625b017.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_862a00edafe7a506066274a212dd47917f2be54b.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_925c7f26874d1ec3e334b8a996a6fbda5d6dee9a.1920x1080.jpg?t=1572427211,https://cdn.akamai.steamstatic.com/steam/apps/259570/ss_cac9ad75f5bc4293f28f089a215723419ac1815d.1920x1080.jpg?t=1572427211",
    "Slug": "eden-star",
    "Meta Title": "EDEN STAR: Jan 30, 2015, Flix Interactive and Full Overview",
    "Meta Description": "Looking for information on EDEN STAR? Check out the release date (Jan 30, 2015), developer insights from Flix Interactive, and a complete game summary.",
    "Alt Text Image": "Official header image for EDEN STAR game - Steam 259570",
    "Canonical URL": "https://gusku.site/game/eden-star",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"EDEN STAR\", \"description\": \"Looking for information on EDEN STAR? Check out the release date (Jan 30, 2015), developer insights from Flix Interactive, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 30, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Flix Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Flix Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/259570/header.jpg?t=1572427211\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}