{
    "AppID": 1137450,
    "Name": "ENCODYA",
    "Release date": "Jan 26, 2021",
    "About the game": "The Save the World Edition includes ENCODYA, the official ENCODYA soundtrack, a lovingly designed artbook, wallpapers and a Making of Video. In addition, Assemble Entertainment donates 10% of the revenues of this edition to the children's charity Plan International . This is the best option for all those who would like to support the work of the developer of ENCODYA even more and do something good at the same time. Neo Berlin 2062. Tina – a nine-year-old orphan – lives with SAM-53 – her big clumsy robot guardian – in a rooftop makeshift shelter in Neo-Berlin, a dark megalopolis controlled by corporations. Tina is an urban jungle kid, who has learned to live alone, scavenging from city dumpsters and eking out a living from scraps. Her funny robot is always with her, programmed to protect her no matter what. One day, the little girl discovers that her father left her an important mission: to finish his plan to save the world from grayness! Tina and SAM embark on an incredible adventure across different realities full of bizarre robotic creatures and grotesque human beings. Through puzzles and exciting dialogues, they’ll find out the true meaning of being alive. About Encodya The sweetness and creativity of Studio Ghibli, the setting and atmosphere of Blade Runner and the humor and game style of Monkey Island: these are the ingredients that inspired ENCODYA, a point-and-click adventure game set in a dystopian future. Explore the dark cyberpunk world of ENCODYA in 2.5D with 2 playable characters. Over 34+ non-player characters bring the world of ENCODYA to life and provide a varied and exciting story. Your journey will take you to more than 100 locations where there is a lot to explore and discover. Special, randomly generated puzzles provide a unique gaming experience and present you with great challenges. The cinematic cutscenes and the futuristic art and sound design brings the story of ENCODYA alive. The original soundtrack, especially created for ENCODYA, makes the exciting, crackling atmosphere even more tangible. Professional dubbing actors lend their voices to the characters 'If you enjoy good looking point and click puzzlers, especially if they make you scratch your head along with an interesting story - ENCODYA seems like a good choice.' - Gamingonlinux 'Chaosmonger Studio has delivered a wonderful game with Encodya.' - Gamesunit 'Nice, imaginative and a bit gloomy point-and-click game with heart.' 80/100 - Senses 'A very well achieved Cyberpunk setting.'80/100 - PC Indie Master Race 'The game manages to combine the dark setting with the wit and lightness familiar from titles like Monkey Island.' 80/100 - Levelup Chip DE 'Pixar does cyberpunk. // If you’re a lover of classic adventure games, Encodya is worthy of your time.' 74/100 - Fullsync 'You just have to like the big robot and the little orphan!' 70/100 - 4Players 'Excellent aesthetics cyberpunk point 'n' click adventure, with a nice story and beautiful characters, which leaves a bittersweet taste in the end.' 70/100 - Ragequit GR",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1137450/header.jpg?t=1655302306",
    "Price": 4.99,
    "Developers": "Chaosmonger Studio",
    "Publishers": "Assemble Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_5b5b99804a24502657e4afec8d6ff64bd12b2f5f.1920x1080.jpg?t=1655302306,https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_bf6b7e118511b77e71ae34ad3fb6e35bab8659ac.1920x1080.jpg?t=1655302306,https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_ef303a74f67d8896e6bd81d6a40d49c5421c4f54.1920x1080.jpg?t=1655302306,https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_12198bc7164ff57e169fd774d5a2921f0ad1e25e.1920x1080.jpg?t=1655302306,https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_f4e852663a4640ec1b9493ae3272a7cd23efdff5.1920x1080.jpg?t=1655302306,https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_5687f6d62ac038578253dc5c53961a011bbc9c3c.1920x1080.jpg?t=1655302306,https://cdn.akamai.steamstatic.com/steam/apps/1137450/ss_772edd3769e68a622c9d8b617066b0a2ba93187b.1920x1080.jpg?t=1655302306",
    "Slug": "encodya",
    "Meta Title": "ENCODYA: Jan 26, 2021, Chaosmonger Studio and Full Overview",
    "Meta Description": "Looking for information on ENCODYA? Check out the release date (Jan 26, 2021), developer insights from Chaosmonger Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for ENCODYA game - Steam 1137450",
    "Canonical URL": "https://gusku.site/game/encodya",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ENCODYA\", \"description\": \"Looking for information on ENCODYA? Check out the release date (Jan 26, 2021), developer insights from Chaosmonger Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 26, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Chaosmonger Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Assemble Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1137450/header.jpg?t=1655302306\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}