{
    "AppID": 793200,
    "Name": "Escape the Darkness",
    "Release date": "Apr 3, 2018",
    "About the game": "Escape the Darkness is an adventure Endless Runner game. You are Beralt, one of the three brothers born in a magnificent kingdom of Cyvia. The brothers grew as fierce warriors and were always together until the fate separated them. Later on, yet again fighting the undead, the youngest brother made a fatal mistake. This is how this story begins... Features: atmospheric and mysterious setting; nice-looking graphics; simple character controls; exciting and dynamic gameplay; detailed history of the world; curious easter eggs; authentic soundtrack. Unusual game mechanics you’ll see in EtD are not bugs — they are features. No one knows where a tricky road of adventures can lead… In the world where dangerous adventures are a fact of life, three brothers were born. They lived together until the eldest one (his name is still a mystery) got a message from beyond. One night he secretly left his home. They say he has become a demonologist, but no one can confirm that for sure. Later Zeralt, the middle brother, made his way to the Misty Lands. He actually decided to do that because he lost his beloved one — she perished in the paws of an unknown monstrosity. Locals say that Zeralt wants to make a deal with the dark side to return both of his dearest to life. The youngest brother, Beralt, was into travelling. The most of his «travelling» though was visiting inns and brothels infamous all over Cyvia. This still made him a strong and intelligent warrior, a defender of his lands. One day, fighting the undead, Beralt made a fatal mistake. Vettlaff, a dying beast slain by Beralt’s sword, emitted something… unearthly. It easily disarmed Beralt and charmed him with a mighty dark spell. He could do nothing else but flee, run in terror, run for his life… Escape the Darkness is the first project of the Indie Ninjas company. We’ve carefully plotted the story, threw in a handful of references, gave birth to original game mechanics, amassed our party by adding famous streamers to our companion rooster and translated our creation into many wondrous languages. The preparations for the journey have been completed — now go on and have fun in the comfortable game world we have created for you. Thank you for being our swords in the darkness!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/793200/header.jpg?t=1527679593",
    "Price": 0.99,
    "Developers": "Indie Ninjas",
    "Publishers": "Indie Ninjas",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/793200/ss_985a52990085eb321e02083110e5d8ab70af8a56.1920x1080.jpg?t=1527679593,https://cdn.akamai.steamstatic.com/steam/apps/793200/ss_b2bcb2db05e242f9d41f695dd1f4d0ab70506211.1920x1080.jpg?t=1527679593,https://cdn.akamai.steamstatic.com/steam/apps/793200/ss_2874546526f8de2f66f4af5f1b145dbe866c4fec.1920x1080.jpg?t=1527679593,https://cdn.akamai.steamstatic.com/steam/apps/793200/ss_da545d624fc96582bc0a92a3a7e1390a814013e1.1920x1080.jpg?t=1527679593,https://cdn.akamai.steamstatic.com/steam/apps/793200/ss_1f4f678b6b8bc50c24064abf0558a7cefe38d89e.1920x1080.jpg?t=1527679593",
    "Slug": "escape-the-darkness",
    "Meta Title": "Escape the Darkness: Apr 3, 2018, Indie Ninjas and Full O...",
    "Meta Description": "Looking for information on Escape the Darkness? Check out the release date (Apr 3, 2018), developer insights from Indie Ninjas, and a complete game summ...",
    "Alt Text Image": "Official header image for Escape the Darkness game - Steam 793200",
    "Canonical URL": "https://gusku.site/game/escape-the-darkness",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Escape the Darkness\", \"description\": \"Looking for information on Escape the Darkness? Check out the release date (Apr 3, 2018), developer insights from Indie Ninjas, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 3, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Indie Ninjas\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Indie Ninjas\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/793200/header.jpg?t=1527679593\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}