{
    "AppID": 505740,
    "Name": "Eximius: Seize the Frontline",
    "Release date": "Mar 16, 2021",
    "About the game": "Eximius is a Strategic Action Shooter (FPS/RTS Hybrid) that focuses on squad-based combat. Eximius combines tactical First Person Shooter gameplay with high level strategic decision-making of a Real-time Strategy(RTS) game. The game features a competitive 5v5 team battles where players square off in a post apocalyptic urban environment. Play as a Commander ( RTS ) ; build base, train an army and call down support abilities to help your allies on the ground to gain territory. Play as an Officer ( FPS ) ; lead your infantry squad into combat and crush your enemies with your agile tactics or brute force. Capture resources for your team, upgrade weapons and equip battlesuits suitable for your combat role. Eximius provides a multi-role gameplay experience where each player could choose to play a diversely different role and fight not only with brawns but also with their brains. An expert shooter could be outnumbered, ambushed and overwhelmed if caught in a wrong position. While a scheming officer could be assassinated in the right moment at the frontline. Objectives The objective of the gameplay is to win by holding down the most victory points. Alternatively, if your forces are powerful enough, you can completely destroy your enemy’s base and win the match immediately. The command headquarters cannot be rebuilt and the game will be instantly over. Seamless Transition As a commander , you are also an officer. But you have the extra capability to switch to top down RTS interface to build bases and command units. An aggressive commander can also join the battle in the frontline but they are normally expected to stay in relative safety and manage base development. Commander needs to be nominated by the team. Base Building As the gameplay of Eximius revolves around Team vs Team battles, each team shares a base, resource and technology tree. RTS Commander to support the battle operations by training infantry units and vehicles,building bases and call in airstrikes or support abilities. Train Armies Commander can train AI infantry and assign them to players. Leading them as a frontline officer; your squad will fight with you sensibly , taking cover and help you both offensively and defensively. Tactical Battles Decide your combat roles and purchase weapons suitable to your play style and tactics. Your weapon and equipment determine your roles in the team. Respond to enemy strategy with appropriate firepower and equipments; be it vehicles , massive amount of infantry or sneaky players. Unlock Technologies As your resources and technology grow, you can construct increasingly powerful units such as armored vehicles, gunships and elite soldiers. Your team can also gain powerful team abilities when you tech up to new tiers. Call down artillery, deploy quick-response force or launch EMP strikes. BattleSuits The pinnacle of each team’s firepower is the legendary battle-suit. Equipping battlesuits allow players to use powerful abilities, have increased stats and is able to push the frontline much faster. Officers will have choice of several choice of battlesuits, each with their own play style and set of abilities. Axeron Corporation ( AXR ) AXR is private research organisation that turned into a security contractor out of global needs. Being at the forefront of science, many believes that this wealthy organisation holds key technologies that could bring about global peace. With limited manpower , the Axeron industrial complex produces highly advanced drones for their workforce , both for military and nonmilitary use. This elusive organisation operates in an extremely organised and stealthy manner. Nations that choose to fund AXR do so for their advanced scientific capability and confidence that they will be the solution to the growing mutant threat. Global Security Force ( GSF ) A peacekeeping organisation set up after the first initial great war; the GSF foundation is built upon the principles of securing the walls, recovering human survivors and rebuilding the civilized world. They command the largest military force in the world and operates on a near limitless budget. Nations that choose to fund GSF do so for their vast armies and their global presence.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/505740/header.jpg?t=1640183362",
    "Price": 29.99,
    "Developers": "Ammobox Studios",
    "Publishers": "Ammobox Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_86dee3bf89b53f732ee14614c16dc58b0fc39783.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_6a2f1fe408d473d117f2b8ddf58643c3feccd4ba.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_436c0651bbdf68fd386c1edc9e8f7073751e68d0.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_d93fe6fbbda45754c2a695a059f1d7cc50bbf658.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_5cf9a5194a25d77125d950b0961492aa3a5bea1c.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_d64bc5e7b6679a416d3ad870c763e59744e3edc1.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_451791729b7cd28ceda8e887b7f4d45ac5d48f4c.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_3d413f4f4244e194021c81588351dfb4dc309123.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_4752ceccfd6c19b498a174f745806dac41ed2b89.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_62606683df0443c58ba7bfa02fcca99ccea40089.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_8fa5cdb27c4ab7d50ccec1d6107016c2af1a1d09.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_f03003cfa8ed3e2004af96124666d0bdf7b477f3.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_12cf5626e9a30e87de2eae95710793ea97819a3d.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_20949e70b6f03e4ba980e391afda65276425e169.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_bbef4246cdfed655e3405dabde41946c6fb3798f.1920x1080.jpg?t=1640183362,https://cdn.akamai.steamstatic.com/steam/apps/505740/ss_389dbd753c11ba783fcb0aab6f3d2042a6e5ce6e.1920x1080.jpg?t=1640183362",
    "Slug": "eximius-seize-the-frontline",
    "Meta Title": "Eximius: Seize the Frontline: Mar 16, 2021, Ammobox Studi...",
    "Meta Description": "Looking for information on Eximius: Seize the Frontline? Check out the release date (Mar 16, 2021), developer insights from Ammobox Studios, and a compl...",
    "Alt Text Image": "Official header image for Eximius: Seize the Frontline game - Steam 505740",
    "Canonical URL": "https://gusku.site/game/eximius-seize-the-frontline",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Eximius: Seize the Frontline\", \"description\": \"Looking for information on Eximius: Seize the Frontline? Check out the release date (Mar 16, 2021), developer insights from Ammobox Studios, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ammobox Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ammobox Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/505740/header.jpg?t=1640183362\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}