{
    "AppID": 1196310,
    "Name": "Fantasy Grounds Unity",
    "Release date": "Nov 5, 2020",
    "About the game": "Prep Less. Play Better. Fantasy Grounds is known as the most supported virtual tabletop, with more official licenses than any other tabletop of its kind. Now with Fantasy Grounds Unity , we’ve rebuilt from the ground up, so you’ll have access to more amazing features with all the benefits of an upgraded Unity platform. What is Fantasy Grounds: Fantasy Grounds is a dynamic system for playing a host of different roleplaying games online. It is used by hundreds of thousands of gamers worldwide to connect and play popular games such as Dungeons and Dragons, Pathfinder, Savage Worlds, Call of Cthulhu, and so many more. This type of program is commonly referred to as a ‘virtual tabletop’, or VTT, due to their ability to emulate various parts of an RPG session in digital form. While you can play ANY game on Fantasy Grounds, these available systems allow you to buy preloaded content that is ready to go. Less prep time for the GM means more playtime for the players and a more enjoyable online experience overall. Even for those wanting to run their games in person, Fantasy Grounds helps keep all your information handy and helps keep the game moving along at a fast pace. With cross-platform play, Fantasy Grounds users can play with users on Steam or with a mixed group of users on Mac, Windows PC, and Linux platforms across the world and different time zones. What’s New with Fantasy Grounds Unity: 64-bit support to allow for more content (quality and quantity) Native support for Mac, Linux and Windows PC Network lobby for easy hosting and joining of games (no port forwarding required) Tile based map building with built-in support for dynamic Line of Sight Enhanced Drawing Tools Additional Dice Macros support A new FGU only skin Dynamic Line of Sight with enhanced toggle blockers for walls, doors, terrain and secret areas. Paint with images, such as walls Animated image effects Locally stored Asset Library for use in campaigns Backward compatibility with all existing campaigns and DLC from FGC The Ultimate license upgrade let's you host Demo players who don't need their own license. What's included Standard and Ultimate licenses both contain these items. Combat Battlemaps Battlemaps for streets, caves, dungeons and tunnels Shockbolt GMW Kit Asset Pack with over 600 pieces of art for Tiles, effects, floors and more Saz Asset Pack Around 100 pieces of art for Tiles, brushes, floors and more Torsten's Asset Pack Over 260 pieces of art for Tiles, terrain, markers and more Portraits SmiteWorks (39) FG Animals (29) FG Fantasy (282) FG Modern (59) FG SCI-FI (106) Rulesets * D&amp;D 2E D&amp;D 3.5E D&amp;D 4E D&amp;D 5E FATECore Pathfinder 1 Pathfinder 2 Numenera Starfinder CoreRPG*** Data Libraries ** D&amp;D 5e SRD D&amp;D 5e Basic Rules D&amp;D 3.5E SRD FATECore Pathfinder 1E SRD * - Rulesets provide the understanding for the mechanics of a system, and it allows you to enter data into predefined fields for items, NPCs, characters, etc. ** Data libraries are pre-loaded content packs that provide the data for the ruleset to use. *** CoreRPG is a generic ruleset that can be used to play any system. It won't have game-specific automation of an officially supported ruleset, a commercial ruleset (purchased as DLC), or a community ruleset (available for free on the forums) In addition to these features, we are now poised to add even greater functionality going forward. With the Unity platform, we have lots of ideas for new features and this rebuilt engine will make it easier for us to reach those goals and deliver consistent updates for free.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1196310/header.jpg?t=1658777718",
    "Price": 39.99,
    "Developers": "SmiteWorks USA, LLC",
    "Publishers": "SmiteWorks USA, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_023826b487bf8103415ed7eac02ae85888244ef4.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_f7e8fc0b83cdd8e344d4fdeb0b1ba08e5051f798.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_dd3a2e28bf2f14e263cf2c275c901c715659fcfd.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_fd0c8c9ce0ffb3dcab3e9529b73a206bc1af5c68.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_eb93cb8dd00d864b8724695e91ec4137ba8b735b.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_908760dc0e0afcbd8c8f056e8e6188d255417ad2.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_696b289d8604d706cdfa917c032b967f5ce27930.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_dea75d20daaa001ad11739bd5bafdc25a9ce5e15.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_e6bec63e7bcd922695938b11174986006c1a0703.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_e683376bcfc31b4d1bfcce8abc3f16b3a0015aab.1920x1080.jpg?t=1658777718,https://cdn.akamai.steamstatic.com/steam/apps/1196310/ss_8d49b7672cf204b0a8b1b27821268cef71339773.1920x1080.jpg?t=1658777718",
    "Slug": "fantasy-grounds-unity",
    "Meta Title": "Fantasy Grounds Unity: Nov 5, 2020, SmiteWorks USA, LLC a...",
    "Meta Description": "Looking for information on Fantasy Grounds Unity? Check out the release date (Nov 5, 2020), developer insights from SmiteWorks USA, LLC, and a complete ...",
    "Alt Text Image": "Official header image for Fantasy Grounds Unity game - Steam 1196310",
    "Canonical URL": "https://gusku.site/game/fantasy-grounds-unity",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fantasy Grounds Unity\", \"description\": \"Looking for information on Fantasy Grounds Unity? Check out the release date (Nov 5, 2020), developer insights from SmiteWorks USA, LLC, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"SmiteWorks USA, LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SmiteWorks USA, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1196310/header.jpg?t=1658777718\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}