{
    "AppID": 269210,
    "Name": "Hero Siege",
    "Release date": "Jan 29, 2014",
    "About the game": "Hero Siege is a Hack 'n' Slash game with roguelike- &amp; RPG elements. Annihilate hordes of enemies, grow your talent tree, grind better loot and explore up to 7 Acts enhanced with beautiful Pixel Art graphics! This game offers countless hours of gameplay and up to 4 player online multiplayer! 17 Classes to choose from! Choose from up to 17 classes for your journey through the world of Hero Siege! 8 Classes are available in the base game and the rest can be unlocked as extra content via DLC! Every class has 2 unique talent tree, set of abilities and unique voice acting! Loot &amp; Inventory! Like any good Hack N Slash game, Hero Siege has an Loot/Inventory system. Loot drops can be of several different rarities such as Normal, Magic, Rare, Legendary, Mythic and Satanic! The loot system gives you the opportunity to build your Hero just the way you want! Online Multiplayer for up to 4 Players! Gather up to 3 friends and fight together against the forces of evil! The online multiplayer also has leader boards for Hero Levels and Wormhole rankings. Every class has its own solo leader board. In the end of every season, the best players are awarded with seasonal rewards! Random Generated World! The world is randomly generated so the zones are always fresh and different filled with secret dungeons, crypts, treasure and hazards! The game consists of 7 Acts with 5 levels + end boss each. The levels contain secret dungeons that can be explored. 30+ Unique Bosses to fight! Hero Siege contains a wide arsenal of different enemies and bosses. The game holds over 30 unique crafted boss fights as well as enemies that vary in rarity and have special attacks. Higher rarity enemies give more experience and better loot, but are dangerous and harder to kill! Features - ONLINE MULTIPLAYER with up to 4 players! - Randomly generated levels, items, dungeons, bosses, secrets and events. Every game session you play is different! - Over 350 unique crafted items that are either passive, usable or orbiting. - Over 80 different enemies with the possibility to spawn as rare or elite with extra hp/damage and abilities, but dropping better loot and giving more exp! - Over 30 Achievements to unlock! - Customize your character with over 60 different hats! - 6 Acts to play through! Extra acts come with Expansion sets! - Random Dungeons and Crypts to explore and clear from loot and enemies! - 8 playable classes! Extra classes come with Expansion sets! - 4 different difficulty levels to unlock! - Tons of random! Start discovering all the wonderful secrets and content! - Loot system with: normal, superior, rare, legendary, mythic and satanic loot! Hero Siege has full controller support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/269210/header.jpg?t=1628765735",
    "Price": 6.99,
    "Developers": "Elias Viglione,Jussi Kukkonen",
    "Publishers": "Panic Art Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_b68bbc17d4333d0d28b9d638fb4858eed4e39cb2.1920x1080.jpg?t=1628765735,https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_8f083409162da9efb632a1a4569b229309ce0942.1920x1080.jpg?t=1628765735,https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_20732ce38fceb7e05b72ffb5c78b90349ba78e52.1920x1080.jpg?t=1628765735,https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_fe0252ec7f9eac2e9d219855d4924e168eb5538b.1920x1080.jpg?t=1628765735,https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_1bdc945c906f2e48a3d7e16065445a50600b85d7.1920x1080.jpg?t=1628765735,https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_177e667df6ca2c2d8cbb20674bf0ec400ce7037b.1920x1080.jpg?t=1628765735,https://cdn.akamai.steamstatic.com/steam/apps/269210/ss_3d716b6bfd15bce39f9569aa7181e432b02cf94e.1920x1080.jpg?t=1628765735",
    "Slug": "hero-siege",
    "Meta Title": "Hero Siege: Jan 29, 2014, Elias Viglione,Jussi Kukkonen a...",
    "Meta Description": "Looking for information on Hero Siege? Check out the release date (Jan 29, 2014), developer insights from Elias Viglione,Jussi Kukkonen, and a complete ...",
    "Alt Text Image": "Official header image for Hero Siege game - Steam 269210",
    "Canonical URL": "https://gusku.site/game/hero-siege",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hero Siege\", \"description\": \"Looking for information on Hero Siege? Check out the release date (Jan 29, 2014), developer insights from Elias Viglione,Jussi Kukkonen, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 29, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Elias Viglione,Jussi Kukkonen\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Panic Art Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/269210/header.jpg?t=1628765735\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}