{
    "AppID": 616220,
    "Name": "Hide vs. Seek",
    "Release date": "Aug 7, 2017",
    "About the game": "An experiment has gone horribly awry, giving birth to a mischievous, shape-shifting blob of goo! A state-of-the-art tracking robot was created as a countermeasure to protect the house. Take the role of either character and join the frantic cat-and-mouse chase as the blob sneaks through the house while the robot hunts it down! Key Features: Intense chases Narrow escapes Online peer-to-peer multiplayer through Steam Unique character abilities Free! No micro-transactions, no in-app purchases, just free. Character Descriptions: Hider : A blob of sentient goo, the Hider's objective is to sneak around and gather as much goo as possible from canisters scattered throughout the house. It can turn into almost any object to disguise itself, but it also has a few defensive measures in case it is found by the Seeker. A brief sprint helps create some distance so the Hider can morph into a new object and vanish again. It can even vaporize a small percentage of its body to create a smoke screen that leaves a gelatinous residue on the Seeker's ocular unit. Once enough goo has been collected, the Hider can take over the Seeker by assimilating it into the glorious mass the Hider has become. If the Hider does not collect enough goo, however, it will run out of energy and the Seeker will reclaim the house in the name of order and cleanliness. Seeker : A robot hastily constructed to combat the goo, the Seeker is equipped with only the highest quality gear to stop the Hider. A high-tech squirt gun dilutes the Hider's goo until it is weak enough to be captured. A tracking grenade causes a chemical reaction on contact with the Hider that will cause it to leave a trail behind it for a short time. The Seeker can even detect how far away the Hider is, displaying the data on a hot-and-cold meter for maximum effectiveness - who needs numbers, anyway? The Seeker has to prevent the Hider from collecting goo until it runs out of energy, or capture it once it has been sufficiently weakened. Who are we? Brave Little Studios is a group of 9 graduate students from the University of Utah's Entertainment Arts and Engineering program.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/616220/header.jpg?t=1502172058",
    "Price": 0.0,
    "Developers": "Brave Little Studios",
    "Publishers": "Brave Little Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/616220/ss_ee62dd19919ecf569b70e5478d43a69063db70f3.1920x1080.jpg?t=1502172058,https://cdn.akamai.steamstatic.com/steam/apps/616220/ss_47aaf1741f152bd39628364f3e3809dc93410165.1920x1080.jpg?t=1502172058,https://cdn.akamai.steamstatic.com/steam/apps/616220/ss_e37bb03d84c88569cacbe7d49b03940491506c6d.1920x1080.jpg?t=1502172058,https://cdn.akamai.steamstatic.com/steam/apps/616220/ss_5fd7274448b1ba216e328a4e76015e6b5c2db6f2.1920x1080.jpg?t=1502172058,https://cdn.akamai.steamstatic.com/steam/apps/616220/ss_84b3970156e6918a4f3b49b890257f0376b0c530.1920x1080.jpg?t=1502172058",
    "Slug": "hide-vs-seek",
    "Meta Title": "Hide vs. Seek: Aug 7, 2017, Brave Little Studios and Full...",
    "Meta Description": "Looking for information on Hide vs. Seek? Check out the release date (Aug 7, 2017), developer insights from Brave Little Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Hide vs. Seek game - Steam 616220",
    "Canonical URL": "https://gusku.site/game/hide-vs-seek",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hide vs. Seek\", \"description\": \"Looking for information on Hide vs. Seek? Check out the release date (Aug 7, 2017), developer insights from Brave Little Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Brave Little Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Brave Little Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/616220/header.jpg?t=1502172058\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}