{
    "AppID": 1046980,
    "Name": "HORGIHUGH (ホーギーヒュー)",
    "Release date": "Jun 11, 2019",
    "About the game": "OVERVIEW HORGIHUGH (ホーギーヒュー) is a challenging horizontal side-scrolling shooter from Japanese developer PiXEL. Developed by a team of industry veterans, HORGIHUGH mixes old with new to deliver a beautiful retro shoot 'em up experience that sports vibrant pixel graphics, intense boss battles, a unique power-up system, unlockable upgrades, and an adorable roster of anthropomorphic characters. FEATURES Classic shoot 'em up gameplay reminiscent of the 16-bit era. 6 challenging stages and 13 grueling boss battles. Over a dozen weapons and items to unlock and equip to help you blast through the enemy. Unique mechanics like last-minute dodges, unlockable upgrades, and the innovative Buddy System that lets players team up with an AI-controlled companion to dish out extra punishment and control some of their movement. Two difficulty modes to match your skill level. Charming and upbeat music from renown Konami composer Motoaki Furukawa (Gradius 2, Gradius II, Salamander, Metal Gear, Policenauts). Character designs from illustrator KOU (Mega Man ZX, Shantae series) and pixel art from Neo Geo background artist Kengo Tanaka (Ironclad Brikinger) and Hidekunki Sasaki (Dotto no Ken · Giga). STORY This is the tale of a world different from that of our own. Various species live here, their lives governed by their own respective values and religions... It is a world close to home in many ways. The various nations of this world avoided meddling with one another, which allowed their people to live in relative peace and harmony. However, this all changed when a terrible murder occurred in a small town, which cascaded into a great war that engulfed the entire world. At the height of the war, the renown scientist Dr. Howard went on a journey, spurred on by his lamentations on the world's struggles. There, by pure chance, he found a glowing stone. Howard plunged himself into his research to try and analyze the stone's power, to create a device that could nullify any and all weapons and transmissions, which he hoped to use to resolve the war peacefully. But the world did not wait for Howard and his invention. Two years after the war had begun, it had come to an end. Six years after the war's closure, invaders we call the 'Gozarean' suddenly started attacking the planet, summoned by the signal that had been continually transmitted into outer space by the glowing stone that Professor Howard had long since forsaken. Only one country had the means of fighting back against the Gozarean—a country who had retained their weaponry in breach of the post-war peace accords. They struck the sudden invaders with everything they had, but to no avail. The Gozarean's counterattack would go on to bring about massive casualties to the country's largest cities. Any attempts to establish communications with the Gozarean resulted in failure. In light of this verified alien threat, the world quickly unified and devised a plan of counteroffensive. However, due to the peace accords and the rash acts of their one militarized country, there were no powerful weapons remaining in the world. —On a small island slightly south of the continent— “Why kill them just because their values are different from our own?” “It doesn't matter if we understand one another or not. Lives are lives.” “Yeah. I didn't become a pilot to kill people.” Such was the dialogue between the pair of pilots who evaded the war eight years earlier. They were Hugh and Figaro; two pilots who had retired to the south after the war started. In a fit of irony, the trusty vintage airplanes that they had retained in evading the war were the only weapons that eluded the effects of the Gozarean's weapon-nullifying technology, marking them truly as the world's final wings of hope. Although they had continuously refused the nations' pleas for help, they slowly witnessed the invasion's effects on their family and friends, leading to their finally deciding to sally out and defend those dear to them. Thus marks the start of our tale. CONTROLS Keyboard → ← ↑ ↓ : Movement Shift : Shoot, Confirm Control : Loop the loop maneuver Space : Control positioning of Figaro Enter : Bomb A controller/gamepad is recommended.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1046980/header.jpg?t=1565020213",
    "Price": 11.99,
    "Developers": "PiXEL",
    "Publishers": "LionWing Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_d6b1bef386203440af90282d142c3f557c47e50e.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_9c3513171e4d860d5086e360dcf673dd84f5da0e.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_16a619483cf2dfbec6a4c42b37af53d171965a35.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_d1bae8f51923f1c99c78f49a10f044ee0dc27ab6.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_7c6afe78271275567c6b2a4378f30305a5b89cab.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_6893b77aabffdc0dccab4d6f9ce341b3ebbd7b4f.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_8b9bc30afd84d794b6c100f3b38d5006244cc014.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_2a5257e4d80dfbef214c356534f4ab9d66d68da1.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_873bd4b3f38768f4cafd6f2fe81e63032c167c3a.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_19d650ade8ea27546898419110331ae83aee5138.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_bf82f20c30353307296eac0f31050ac1cca9aea9.1920x1080.jpg?t=1565020213,https://cdn.akamai.steamstatic.com/steam/apps/1046980/ss_a48573ef954c6bb61fb813d7e30677b9020774e1.1920x1080.jpg?t=1565020213",
    "Slug": "horgihugh",
    "Meta Title": "HORGIHUGH (ホーギーヒュー): Jun 11, 2019, PiXEL and Full Overview",
    "Meta Description": "Looking for information on HORGIHUGH (ホーギーヒュー)? Check out the release date (Jun 11, 2019), developer insights from PiXEL, and a complete game summary.",
    "Alt Text Image": "Official header image for HORGIHUGH (ホーギーヒュー) game - Steam 1046980",
    "Canonical URL": "https://gusku.site/game/horgihugh",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"HORGIHUGH (\\u30db\\u30fc\\u30ae\\u30fc\\u30d2\\u30e5\\u30fc)\", \"description\": \"Looking for information on HORGIHUGH (\\u30db\\u30fc\\u30ae\\u30fc\\u30d2\\u30e5\\u30fc)? Check out the release date (Jun 11, 2019), developer insights from PiXEL, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"PiXEL\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"LionWing Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1046980/header.jpg?t=1565020213\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}