{
    "AppID": 502570,
    "Name": "Houdini Indie",
    "Release date": "Oct 10, 2018",
    "About the game": "As an indie game dev you are faced with the challenge of building bigger and richer worlds with smaller teams and limited resources. Houdini Indie’s procedural workflow can help you keep up as you automate repetitive tasks, making it easier to quickly generate larger amounts of high quality content. PROCEDURAL WORKFLOW Houdini Indie provides you with a procedural pipeline-in-a-box where all the steps needed to set up a model or game level are represented by networks of nodes. These nodes can be maintained deep into production, making last minute creative decisions easy. SHAREABLE ASSETS Networks can be wrapped up into Digital Assets which can be loaded into the Unity® or Unreal Engine® game engines using the Houdini Engine plug-ins. There is also Houdini Engine plug-ins for Autodesk® Maya® and Autodesk® 3ds Max.® Your Houdini Indie license will let you work with these plug-ins on your computer while your teammates use the free Houdini Engine Indie to load Houdini Digital Assets into host applications. GAME DEV TOOLS Houdini Indie gives you access to the Game Development Toolset, a collection of over 100 shelf tools and assets designed to speed up game dev workflows. Developed by expert Technical Artists at SideFX, these tools range from managing LOD creation, UV mapping, and texture baking to generating vertex animation textures for a wide range of FX. MODELING Whether you are modeling by hand or working procedurally, Houdini Indie helps you create large models faster than ever before. The modeling tools in Houdini Indie make it easier to create good surface topology for use in games and VR, and can be used interactively in the viewport or procedurally in the Network editor. Choose from a wide variety of polygon, NURBS, and Subdivision Surface modeling tools and use procedural techniques to set up instancing that ensures an efficient deployment of geometry in your game. TERRAINS The terrain system in Houdini Indie lets you layer and edit terrain easily with tools such as procedural noise, heightfields, erosion, and paint and mask out areas directly. The operations are very similar to image compositing, so terrain artists will find the Houdini Indie workflow familiar. VFX From Bullet Rigid Body destruction, to Pyro FX fire and smoke, to sand and snow, to FLIP fluid liquids, Houdini Indie empowers you to create bigger, more explosive visual effects. Using the same tools deployed by top film and game studios, you can simulate a wide range of natural effects. Use the game dev tools to convert simulations into runtime FX for use in-game. LIGHTING, TEXTURING, &amp; RENDERING Houdini Indie’s lighting workflow provides a flexible and powerful environment for managing lights, building shaders, and defining the look of a scene. With Houdini Indie, you can rely on a built-in, physically-based rendering solution called Mantra to render out cinematics or to bake out texture maps from high-res to low-res meshes. CHARACTER RIGGING &amp; ANIMATION Houdini Indie offers a complete solution for rigging and animating characters and creatures for your games. These tools include Auto-rigging, Muscle and Flesh, Cloth, Hair and Fur, Crowd tools and more. INDIE LICENSE The annual gross revenue of commercial entities and contracting entities does not exceed $100K USD Houdini Indie cannot be used in the same pipeline as commercial versions of Houdini Houdini Indie uses its own file format for saving scenes and assets Resolution is restricted to 4096 x 4096 when rendering out animations Houdini Indie works with the following third party renderers: RenderMan, Arnold, Redshift and OctaneRender. V-ray and Maxwell Render will be supported in the future Please refer to the EULA for a complete description of Indie License restrictions.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/502570/header.jpg?t=1569869236",
    "Price": 269.99,
    "Developers": "SideFX",
    "Publishers": "SideFX",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_bb600f6c5fe3682a4ed1194cf362f793307ca901.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_873b2a446c452ca8611d93db8e824c7960e516d0.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_a6e61d3d227adb010f140d949ed5ec2643e313ab.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_a49c25efe9124a21f6486efb572cb9e544e048ca.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_1c8d9950d78aebfceb22524817f8e32d1a616160.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_26ef884b590ed2cab2d2b9253046e8191f024c40.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_54a58e785e82e55de14b42132d9c39d89eae9cf7.1920x1080.jpg?t=1569869236,https://cdn.akamai.steamstatic.com/steam/apps/502570/ss_490d796698991e822dd592b3298103f2045d544e.1920x1080.jpg?t=1569869236",
    "Slug": "houdini-indie",
    "Meta Title": "Houdini Indie: Oct 10, 2018, SideFX and Full Overview",
    "Meta Description": "Looking for information on Houdini Indie? Check out the release date (Oct 10, 2018), developer insights from SideFX, and a complete game summary.",
    "Alt Text Image": "Official header image for Houdini Indie game - Steam 502570",
    "Canonical URL": "https://gusku.site/game/houdini-indie",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Houdini Indie\", \"description\": \"Looking for information on Houdini Indie? Check out the release date (Oct 10, 2018), developer insights from SideFX, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"SideFX\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SideFX\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/502570/header.jpg?t=1569869236\", \"offers\": {\"@type\": \"Offer\", \"price\": 269.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}