{
    "AppID": 1073860,
    "Name": "Idle Guardians",
    "Release date": "May 10, 2019",
    "About the game": "Recruit heroes and idle your way to glory! Fight in dungeons, defeat powerful raid bosses and find legendary items! - Many unique hero classes, each with their own playstyle, abilities and upgrades. - Special raid encounters, each requiring their own strategies to complete. - 1500+ quests, each granting gems to keep you powered up! - Hundreds of unique items to collect. - Multiple prestige systems to allow you to keep growing your power. - Each hero has many progression systems. - Discover powerful guardians that grant bonuses to aligned heroes. Endless Idle RPG Gameplay Your heroes will always fight so it's very easy to play. Use each hero's rage ability when it's fully charged to lay waste to your enemies. Timing is important. Fight Powerful Bosses There are many unique bosses, each with their own abilities that you must learn to counter. The right team of heroes is critical to your success. Find Powerful Items Items provide global bonuses to all of your heroes. Rare items also have unique bonuses that than turn the tide of battle in your favor, but you must choose which items to equip. There are tons of swords, axes, spell books, runes, and sets of armor to find around the world and in challenging dungeons and deadly raids. Easy to Play, Difficult to Master It's easy to start playing, battles happen automatically and never stop! But don't be fooled, to progress far into this game you must learn how to construct the best team of heroes for the given challenges you are faced with. Earn Progress While Not Playing You always gain gold even if you aren't playing the game! This is a key feature of idle games. When you come back to the game, get all your offline gold and level up your heroes a ton. Now you can breeze through the next set of levels. After you use the Portal of Renewal for the first time you will even get stage progression while offline. How to Play - You will begin with one hero. Let him battle while you collect gold. Level up your hero and recruit new heroes as they become available. Keep battling and leveling up. - Eventually the monsters will become very difficult. This is a good time to leave and come back a bit later. You will still collect gold even when you aren't playing, so when you come back you can level up a ton and progress very quickly. - Once things are really difficult, tap the Portals tab and use the Portal of Renewal. This is the 'prestige' system. You will reset to stage 1. Your heroes will reset to level 1, however you will gain shards. Use these to rank up your heroes, giving them extra power. - Just keep doing this over and over. This is the nature of idle games! They are really fun. There's lots of other things to do also, explore the game! The frontier is endless, see how far you can get! Note: This game DOES have in-app purchases, but we make sure to give away tons of gems for free. You get gems for beating bosses and completing hero quests (there are over 1,500), plus there are free gem boosts you get every day just for showing up. As long as you don't go crazy with spending gems you should always have enough to buy some boosts.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1073860/header.jpg?t=1557499174",
    "Price": 0.0,
    "Developers": "Blade Fire Studios",
    "Publishers": "Blade Fire Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_04da4cd2af4457e630bd8b1dbfe90a90ed9653a0.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_957269fa03a6897773f5ff1c6b210b35dfc2566f.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_b5ebdcaa374c37cfa1da6308bb5ab593c7387aee.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_8e950d30d01baf989249b70783557484c3c2d900.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_0bbcc0e6fe5903b6e57b9f3e66c1df5664937b00.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_9d458226d2349b63b5f83eb00ea586fb78533375.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_68f3f08b182a6943e725c3ffa3c6f0e90f071ebf.1920x1080.jpg?t=1557499174,https://cdn.akamai.steamstatic.com/steam/apps/1073860/ss_e2f29470902ec4e2e2b100b521178f3d0965d307.1920x1080.jpg?t=1557499174",
    "Slug": "idle-guardians",
    "Meta Title": "Idle Guardians: May 10, 2019, Blade Fire Studios and Full...",
    "Meta Description": "Looking for information on Idle Guardians? Check out the release date (May 10, 2019), developer insights from Blade Fire Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Idle Guardians game - Steam 1073860",
    "Canonical URL": "https://gusku.site/game/idle-guardians",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Idle Guardians\", \"description\": \"Looking for information on Idle Guardians? Check out the release date (May 10, 2019), developer insights from Blade Fire Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blade Fire Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blade Fire Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1073860/header.jpg?t=1557499174\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}