{
    "AppID": 544810,
    "Name": "KARDS - The WWII Card Game",
    "Release date": "Apr 15, 2020",
    "About the game": "Card Game meets WWII KARDS, The World War II Card Game, combines traditional CCG gameplay with innovative mechanics inspired by classic strategy games and real battlefield tactics. Take command and challenge other players in grand-scale warfare on the ground, air, or seas. KARDS is completely free to play with all features available from the start. You can earn all cards through regular gameplay, daily missions and an extensive achievement system. Why should you play KARDS? KARDS blends familiar trading card gameplay that make it easy to learn and are combined with innovative mechanics that provide strategic depth and tactical diversity. The innovative frontline mechanics allows you to better protect your support assets and take the battle to your enemy. Rush your enemies with Blitzkrieg tactics, gain air superiority or dig in for bitter defensive warfare until you outproduce and outgun your enemies. Managing your forces is an important part of any military campaign. In KARDS you need to carefully manage your resources (Kredits) between deploying new units, operating units already deployed on the battlefield and disseminating orders to support your battle plans. Strategy Your deck is constructed around one of the five major powers of WW2 and competes head to head with other players. Each deck is allowed one ally nation, where you can draw support from to create an edge against the opposition. Depending on what you believe to be a winning strategy, players craft their deck on a combination of units and supporting orders. Infantry: Try to overrun your opponent with lighter and often less costly units Tanks: Blitz your opponent with heavily armored units Artillery: Blast your opponent from the safety of your support line Aircraft: Achieve air superiority and wreak havoc from the sky Move up through the ranks via gameplay from Private to Field Marshall and earn your place in the officer's club while reaping monthly rewards for your rank. Authentic atmosphere All the cards are beautifully illustrated to match the unique WW2-style. Weapons and units have been diligently researched and behave exactly as one would expect based on official documentation, specifications and operational history. Regular updates and events With a vibrant player community and active developers, KARDS is regularly getting exciting new gameplay features and improvements. The first expansion was released on December 10th, offering players 2 new ally nations with 150 cards for expansion. From then onwards, several more expansions and updates with new cards, game mechanics, and visuals have been released. In December 2019 and 2021, the World Championship took place in Iceland, the home of 1939 Games. The four finalists were flown in to compete head to head for the title. About 1939 Games 1939 Games is a creative indie studio located in Iceland. Founded by ex-CCP veterans famous for creating EVE Online, 1939 Games is out to boost the market with KARDS, the unique and groundbreaking WWII CCG.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/544810/header.jpg?t=1656322500",
    "Price": 0.0,
    "Developers": "1939 Games",
    "Publishers": "1939 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_daca4a82181e6258dcbd62f4f86dc6fe64da682d.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_f8b86b56de5029c4025700c46d9aa1988739dd73.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_da14c9b8002446e97da40d3ee613c727efe0aa7a.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_1b61ad319dffd94b4b57486db7cf504d4c048a72.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_02e06f25bfd8188cb8da5648d69f33afa986a441.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_359e43d3df67133ae8a41c9547f01c0563d9de03.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_ff46f745b1da53fc60d4204f81edea7e5106de93.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_8474d20b8e756729ba11a5fcf435b0f4ff31fb70.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_64a2826320dcadc504645de69110f8ca5ec42053.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_42a601744ab34c09d5583739cd05e54402a27472.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_96affc517dc3301f5fdc9a606f2b4b2955dbae31.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_fd14c6504a68c81e0839f72cdba554d72bdc46c0.1920x1080.jpg?t=1656322500,https://cdn.akamai.steamstatic.com/steam/apps/544810/ss_885e7cf81a0ab086aed96cdeea1125697e092b9f.1920x1080.jpg?t=1656322500",
    "Slug": "kards-the-wwii-card-game",
    "Meta Title": "KARDS - The WWII Card Game: Apr 15, 2020, 1939 Games and ...",
    "Meta Description": "Looking for information on KARDS - The WWII Card Game? Check out the release date (Apr 15, 2020), developer insights from 1939 Games, and a complete gam...",
    "Alt Text Image": "Official header image for KARDS - The WWII Card Game game - Steam 544810",
    "Canonical URL": "https://gusku.site/game/kards-the-wwii-card-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"KARDS - The WWII Card Game\", \"description\": \"Looking for information on KARDS - The WWII Card Game? Check out the release date (Apr 15, 2020), developer insights from 1939 Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 15, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"1939 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"1939 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/544810/header.jpg?t=1656322500\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}