{
    "AppID": 734020,
    "Name": "Legendary DXP",
    "Release date": "Jan 23, 2018",
    "About the game": "Welcome to the fantastical world of Alamyth where you can recruit all new legendary heroes and fight the terrifying forces of evil. Visit all new landscapes of Alamyth such as the Firelands and fight the likes of The Leprechaun Henchmen and the evil villain, Ernak The Lethal. Just beware, if the Mastermind, Terriskai: Terror Of The Skies completes his evil scheme, everyone loses. The bestselling Legendary® Deck Building Game is here. Experience Legendary with your friends like never before; same great game, a brand new fantasy. Over the course of the game, players will recruit powerful hero cards to add to their deck in order to build a stronger and more resourceful deck. Players need to build both their recruitment powers (to enlist more heroes) and their fighting ability (to combat the villains who keep popping up to cause trouble). Players recruit heroes from an array of six cards, with empty slots refilled as needed. At the start of a player's turn a villain card is revealed and added to the row of villains. This row has a limited number of spaces, and if it fills up, villains start to escape. The villain deck also contains 'master strike' cards, and whenever one of these shows up, the mastermind villain (controlled by the game) takes a bonus action. As players fight and defeat villains, they collect those cards, which will be worth points at game's end. Players can also fight the mastermind; if a player has enough fighting power, he claims one of the attack cards beneath the mastermind, which has a particular effect on the game. If all of these cards are claimed, the game ends and players tally their victory points to see who wins. If the mastermind completes his scheme, however – having a certain number of villains escape, for example, or imposing a certain number of wounds on the heroes – then the players all lose.You will never play the same game twice as the game changes each time you play. Team up with other players and fight to the end but make sure you have collected enough victory points along the way to be victorious. Features: Multiple Game Modes - Solo, Quick Match, VS Friends, Gauntlet, Raids Collections - Rare Cards, Gameplay Mats, Avatars and Emotes (Collect them all!) Gauntlet - Tournament style competitive play Cross-Platform Play",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/734020/header.jpg?t=1632781393",
    "Price": 0.0,
    "Developers": "SkyReacher Entertainment",
    "Publishers": "The Upper Deck Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/734020/ss_c49b35c47586de948fb82abd2eecb9383efd5f70.1920x1080.jpg?t=1632781393,https://cdn.akamai.steamstatic.com/steam/apps/734020/ss_a3b1b23cbfe43fbf4e3ca115f2fc48b7a49eeefe.1920x1080.jpg?t=1632781393,https://cdn.akamai.steamstatic.com/steam/apps/734020/ss_1c201d382ac76f920e2a733372ff799bdc40232e.1920x1080.jpg?t=1632781393,https://cdn.akamai.steamstatic.com/steam/apps/734020/ss_851fc070fac544c66c21aad2d2afb7990d984696.1920x1080.jpg?t=1632781393,https://cdn.akamai.steamstatic.com/steam/apps/734020/ss_57daf7bb15ad787824e75774366dbb5812550983.1920x1080.jpg?t=1632781393",
    "Slug": "legendary-dxp",
    "Meta Title": "Legendary DXP: Jan 23, 2018, SkyReacher Entertainment and...",
    "Meta Description": "Looking for information on Legendary DXP? Check out the release date (Jan 23, 2018), developer insights from SkyReacher Entertainment, and a complete ga...",
    "Alt Text Image": "Official header image for Legendary DXP game - Steam 734020",
    "Canonical URL": "https://gusku.site/game/legendary-dxp",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Legendary DXP\", \"description\": \"Looking for information on Legendary DXP? Check out the release date (Jan 23, 2018), developer insights from SkyReacher Entertainment, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"SkyReacher Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Upper Deck Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/734020/header.jpg?t=1632781393\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}