{
    "AppID": 601500,
    "Name": "Lost in Nature",
    "Release date": "Mar 14, 2017",
    "About the game": "As a shipwrecked person, you are stranded on a beautiful and wild island. Explore the island, collect resources and build structures to survive. Lost in Nature is a challenging survival simulation that will test you, but not in a frustrating way. Dynamic Ocean The realistic and beautiful ocean generates thousands of waves in real time. Foam, sound and caustic effects are also included. You can swim and dive, which gets you wet and can cost you your life in the wilderness (while night or bad weather). To prevent that, you should go to a campfire and dry up. Day-Night cycle and realistic, randomly generated weather In Lost in Nature, a day is not like the other. Sun and moon move like in reality which creates breathtaking sunsets and the weather is randomly generated: Sun, clouds, wind, rain, fog and lightning create a realistic weather which can produce the whole range from nice weather to massive storms. Collect Ressources To survive, you must use what nature offers you. Many things like stones, shells and branches can be simply picked up, but there are also things that you can only gather with tools. These include, among other things, chopping rocks and trees. You can find leaves, bark and berries by searching trees and shrubs. The items spawn in random time intervals for a random time. If you want to pick them up, you have to be fast. This is not only much more fun than simply clicking, but you also have only items in the inventory that you really wanted. Build Structures Build structures such as camp fire, shelter, crates and fences! A campfire is very important, you can dry yourself and in the night they are vital. In order to ignite a fire, you first have to produce tinder and light it with a branch. Put enough wood on it to fuel it and put food on top that you want to roast. The food is cooking slowly and you should take them back at the right moment, so they don't carbonize! Dynamic Generated Environment Most resources are generated randomly, but realistically. Where in the last game was a berry bush is now perhaps a water source. For example, mushrooms always grow near dead wood. If you remove the fallen tree trunk, no more fungi will grow. The sea also rinses crates from the sunken ship to the beach, which can contain a valuable cargo. Loneliness as a risk Besides hunger and thirst, you must also take care of your mental state. A lonely life in isolation is not easy and your additional status 'sanity' will be really exciting, especially during the endgame. Underwater world: In the near future I will add an underwater world with seaweed, corals and fish swarms. In addition to that, the structure 'fish trap'. Animals &amp; fighting: I also will add animals in near future, which are aggressive or gentle. For example bears/goats/crabs. They provide new resources (fur, meat, ...) and the new structure 'animal trap', as well as weapons and armor. Cooking: There will be a new resource 'clay' and a buildable structure 'improvised cooking station' to cook food with individual ingredients and spices. Metal Processing: A simple form of metal processing may be implemented. Food Conservation: There will be ways to conserve food. Multiple Scenarios: The islands are handmade in LIN. There will probably be several islands (different scenarios) that can be played. An island possesses perhaps a volcano, which is just before the break out and you must leave it within a certain time. Events: Eventually 'Events' will be added, which will provide variety and surprise. Example: Giant crabs or pirates appear all over the beach. Skill tree: There will be a talent tree and each day you get a skill point. This increases the replay value. Survive Permadeath: In LIN, death is permanent, but LIN should not be frustrating, so there will be the structure 'emergency shelter'. Instead of dying, you awake there (you escaped the danger) and all items on the island lose 25% durability (because you were 2 weeks in the cave). Endgame: There will be structures to make you visible to ships. This includes flags and signal fires. When you see floating ships, you can get their attention. If the attention is high enough, you can be saved. I think I can make Lost in Nature GREAT with your help! Are you coming on board? :o)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/601500/header.jpg?t=1572522849",
    "Price": 14.99,
    "Developers": "Moongate Digital",
    "Publishers": "Moongate Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_cfb3186907d0a32976a2165bf5d957d3d1ba0b97.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_84f39661f538f56f5f76fde2f857d617621f00f1.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_c1a74a71da3d7c107fe4cb8fb6796dc666ed538b.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_361322e4448dcac2557dd4f514ebbd1cfaab1b1d.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_b250fb7aaa6021fb8a6801e66134173311d48b6b.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_e3ae074425e5f7466fc357a427c4f8e100f7524f.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_3fef9e7f6d215d2a29fb3ae11f73286239ee9a15.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_fda1598f3c2fc99adadc86a5e20de7b34c376f4e.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_f98e04e750fc9cb7f9a777288f7337d2e1f66e38.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_c5b41848113ea5362f3e218ec686a138ec7d452b.1920x1080.jpg?t=1572522849,https://cdn.akamai.steamstatic.com/steam/apps/601500/ss_35ebe177c84232ae7fdd9d5b78ddb7749f755eab.1920x1080.jpg?t=1572522849",
    "Slug": "lost-in-nature",
    "Meta Title": "Lost in Nature: Mar 14, 2017, Moongate Digital and Full O...",
    "Meta Description": "Looking for information on Lost in Nature? Check out the release date (Mar 14, 2017), developer insights from Moongate Digital, and a complete game summ...",
    "Alt Text Image": "Official header image for Lost in Nature game - Steam 601500",
    "Canonical URL": "https://gusku.site/game/lost-in-nature",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lost in Nature\", \"description\": \"Looking for information on Lost in Nature? Check out the release date (Mar 14, 2017), developer insights from Moongate Digital, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 14, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Moongate Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Moongate Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/601500/header.jpg?t=1572522849\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}