{
    "AppID": 1227200,
    "Name": "Magic Academy Estoria",
    "Release date": "Feb 20, 2020",
    "About the game": "This game is the original RPG which I, HINASE HIROTO made. As can be seen, I made it in RPG Maker MV. Although it is a so-called JRPG made by Japanese, the title and this explanation are in English because we want foreigners to play. The content is only available in Japanese, but ... Although it is a Japanese title in the video, Please be assured that the title is properly written in English. There is no track record and basically it is a non-stop one-way road to the end if you buy it out. There are some Caraibe like RPG. It is a type of RPG that enjoys the story thoroughly. Play time is about 10-15 hours. Synopsis Kazuki, a boy living in the Aries Kingdom, was born in the country. At the age of 15, he left his hometown and enrolled in the metropolis of Estoria as a student to live. The reason is that I want to learn magic. Kazuki was born with a difficulty in learning magic, and more specifically, did not rely on magic. To put it another way, all of Kazuki's hometowns live that way, but whatever the reason, Kazuki felt that he would be left behind in the times, and he entered the school against the opposition of his relatives. . One year passed, Kazuki was a junior of Torque and Alice. With my best friend Ark, my classmates Atina and Erie, and my seniors Harty and Ozma, I will be in my second year. Can you really graduate and learn magic? Kazuki's passionate training (adventure) begins now! ※I am writing this attention sentence using Google Translate. If there is the part which a meaning does not understand, I am sorry. We are currently struggling with the effects of COVID-19. Please, I hope there are good people out there who are willing to support my life by purchasing this game. I'm also working on my third game [Realize the Promise] in good faith. I plan to sell this one on steam as well, so please support me. URL of promised realization is ↓. このゲームはRPGです。 RPGツクールMVで作りました。 日本人が作ったいわゆるJRPGですが、外国に方にもプレイしてほしいのでタイトルやこの説明が英語表記です。 英語翻訳及び、日本語と英語の選択字幕制にするため、現在英語表記のみです(つまり海外専用)。 英語字幕になっているのでご注意ください。 また、日本語版はDLsiteやBOOTHで売っております。いたらどうぞ買ってくださると嬉しいです。 ↓がURLです。 実績などはなく、基本的に買い切ったら最後までノンストップの一本道です。 RPGらしくキャライベは多少あります。ストーリーをとことん楽しむタイプのRPGです。 プレイ時間は10時間～15時間ぐらいです。 あらすじ アリエス王国に住む少年、カズキは田舎生まれ。15歳になり、一人故郷を離れ大都市エストリアに学生として入学し生活を送っていた。その理由は、魔法を覚えたいから。 カズキは生まれつき魔法を覚えにくい、具体的に言うと魔法に頼らない、使わない生活を送っていたためその方面の知識や技術がかけていたのである。 もっといえば、カズキの故郷の人達全員がそういう生活を送っているのだが、理由はどうであれ、このままでは時代に取り残されると感じたカズキはなんとかしようと親族の反対を押し切って入学したのである。 1年がたち、トルクとアリスという後輩が出来たカズキ。親友のアークと同級生のアティナとエリー、そして先輩のハーティーとオズマと一緒に2年目を迎えるが、果たして無事に魔法を覚え卒業することが出来るのか？ カズキ達の熱き修行(冒険)が今、始まる！",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1227200/header.jpg?t=1650969187",
    "Price": 12.99,
    "Developers": "HIROTO HINASE",
    "Publishers": "HIROTO HINASE",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1227200/ss_b11cd9563c9b97f58264665a2535e007ca26e6ac.1920x1080.jpg?t=1650969187,https://cdn.akamai.steamstatic.com/steam/apps/1227200/ss_d142c7a89f36e49aa411b1ff25ed9401fb03526f.1920x1080.jpg?t=1650969187,https://cdn.akamai.steamstatic.com/steam/apps/1227200/ss_acbdc4f5e7f2ba31aad5ebbc2f644fd425819bed.1920x1080.jpg?t=1650969187,https://cdn.akamai.steamstatic.com/steam/apps/1227200/ss_d90d575d59274cec097791b860772cb9852bf06b.1920x1080.jpg?t=1650969187,https://cdn.akamai.steamstatic.com/steam/apps/1227200/ss_4f970e1eedaab086e1cae05df9312762590865d6.1920x1080.jpg?t=1650969187",
    "Slug": "magic-academy-estoria",
    "Meta Title": "Magic Academy Estoria: Feb 20, 2020, HIROTO HINASE and Fu...",
    "Meta Description": "Looking for information on Magic Academy Estoria? Check out the release date (Feb 20, 2020), developer insights from HIROTO HINASE, and a complete game ...",
    "Alt Text Image": "Official header image for Magic Academy Estoria game - Steam 1227200",
    "Canonical URL": "https://gusku.site/game/magic-academy-estoria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magic Academy Estoria\", \"description\": \"Looking for information on Magic Academy Estoria? Check out the release date (Feb 20, 2020), developer insights from HIROTO HINASE, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 20, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"HIROTO HINASE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HIROTO HINASE\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1227200/header.jpg?t=1650969187\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}