{
    "AppID": 940910,
    "Name": "Minoria",
    "Release date": "Aug 27, 2019",
    "About the game": "Minoria is the latest and most ambitious game from Bombservice, and a spiritual sequel to the Momodora series, from the same studio. Fans of Momodora will find familiar aspects in the design and gameplay elements, as they master the ins-and-outs of parries, dodges, and a variety of different spells. The presentation has evolved to an HD format, with aesthetics mixing 2D hand-painted backgrounds and cel-shaded characters. The story takes place during the fourth Witch War. It is a time of fanatical religious fervor. The Sacred Office, a powerful organization leading an Inquisition against heresy, purges the sinners who threaten humanity. Those responsible for conducting a mysterious ceremony that contradicts the rules of the Church are labeled “witches.” Set forth with Sisters Semilla and Fran, missionaries in the Church’s service, on their journey to thwart the witches’ ceremony and protect the common-folk from heresy that endangers the status quo. A powerful fantasy story inspired by the history of medieval Europe A unique visual aesthetic combining hand-painted 2D art with cel-shading Fluid controls encouraging careful engagement and patient play Offensive combat enabling players to crush enemies with a mix of swordplay and spells Defensive options including dodge-rolls and parries A leveling system that helps players adjust their character to their desired difficulty Hello there! I’m rdein, the creator and director of Minoria. First of all, I’d like to share my excitement in announcing this project. This is a universe I care a lot for, from the setting to the characters, and it’s been a lot of fun to explore and develop its concepts during the process of game development. For the first time in many years, I started a game project set in a new universe. It felt like a breath of fresh air for me. With that said, Minoria does contain some similarities with my previous projects (especially Momodora’s latest installment, Reverie Under the Moonlight). I am proud of what we’ve been making for Minoria, and I hope you will enjoy the story and characters I’ve prepared this time around! Howdy folks, Dan here from Dangen Entertainment. It’s been hard patiently waiting for the announcement of Minoria, knowing what an amazing game it’s going to be. It combines everything I love about the Momodora games with stronger emphasis on a solemn story. I love how Bombservice is approaching the visuals this time around too--it’s a unique take that looks beautiful and shows another evolutionary step in the team’s development experience, just as previous titles have. This game is extraordinary. A must-play if you’ve got an appetite for action-platformers like I do.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/940910/header.jpg?t=1655807173",
    "Price": 19.99,
    "Developers": "Bombservice",
    "Publishers": "DANGEN Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_62063af8489f9d9dc0cbb57e7f5daa5b12ea8747.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_61bd630a41647cae2ef393ed5d09a296192e3898.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_8c981550eb35a55f78a798f194244079572a3fbb.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_bb25c4374e885d47545ff82368c50ca03061fcaf.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_82e60dc07925aec0fbf0a97a6d7184f302f64ee7.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_a76a6ca87a1ca39f6c6bac5ea45e34f1f784ae9a.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_ddbb1f969725344cee9bee21b8a2713b85c7254f.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_510c9431f2bfc7df2240d458c40c3345bb73afa3.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_98caaa2c7850d774885f6e4d7d24131570f19014.1920x1080.jpg?t=1655807173,https://cdn.akamai.steamstatic.com/steam/apps/940910/ss_450a0491dcc8437a8c6443c1e2c935a64505bd24.1920x1080.jpg?t=1655807173",
    "Slug": "minoria",
    "Meta Title": "Minoria: Aug 27, 2019, Bombservice and Full Overview",
    "Meta Description": "Looking for information on Minoria? Check out the release date (Aug 27, 2019), developer insights from Bombservice, and a complete game summary.",
    "Alt Text Image": "Official header image for Minoria game - Steam 940910",
    "Canonical URL": "https://gusku.site/game/minoria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Minoria\", \"description\": \"Looking for information on Minoria? Check out the release date (Aug 27, 2019), developer insights from Bombservice, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 27, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bombservice\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DANGEN Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/940910/header.jpg?t=1655807173\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}