{
    "AppID": 1684660,
    "Name": "natsuno-kanata - beyond the summer",
    "Release date": "Aug 4, 2021",
    "About the game": "── In the summer of the after apocalypse, the girl travels unaimlesly. 'natsuno-kanata - beyond the summer' A text adventure game depicting girls traveling the world to the end. You found an old computer which can connect to talk with strange garl you have never met. The girl's name is Natsuno. She said said to be traveling alone in a world collapsed by a pandemic. But in the world, you know, there is no pandemic or social collapse. Where is the world she is in and why are the calls connected each other? As you talk to Natsuno and watch over her journey, you will explore the mysteries of the end of the world. STORY Natsuno, a girl who leaves her hometown of Tokyo and continues traveling alone to the north. She is alone. She left her high school classmate at Tokyo,and got separeted separated from her parents at some station. After the train stopped working, she walked alone and continued her journey. She had'nt where to go and any purpose. The world has ended before half a year. An unprecedented pandemic has destroyed society in just a few moments. When infected, a person loses reason and becomes a monster cannot speak that attacks the person. Neither the causative virus nor the bacteria were finally revealed. People don't know anything. Still, what is in front of her is just reality, Even if she walks around the town, she don't meet anyone and have no choice but to continue her journey alone. You happened to talk to a girl traveling in such a world. It all started when you found an old computer,throught my grantmother's possessions after her death. Looking for memories with your grandmother, you opened the data on your computer. But what I heard from the computer was the voice of an unknown girl ── You dont know why but a call was connected to a girl who called herself Natsuno. Of course, there is no pandemic in the world you live in. High school students enjoy their summer vacation,they doesnt wandering around an empty town. Still, it's true that Natsuno and the call are connected. Where is she? Why can the call be connected? There were so many things I didn't understand, She just 'talk to me,' she said. While meeting other girls who live in a world that has ended, You gradually approach the truth ── CHARACTER Natsuno 'Hey, will you come with me?' A girl in the second year of high school. Leaving her hometown of Tokyo, she is traveling alone. She has the strength to survive alone,but She doesn't like herself so much that she gets used to everything. Akane 'Mmm. Don't cry like that, Natsuno-chan.' An elusive woman at her own pace. She lives with the gathered people for some reason before the collapse of the world. she seems to there is something to think about the pandemic that destroyed this world ... Kiko 'Wow! I'm sorry! Its not me!' She is a warm-hearted girl who travels alone in search of her stray dog. She's timid, but She has the strength of her will to continue traveling alone for her dog. Shino 'Unless such a situation, I can't travel alone, right?' She is a girl who travels in search of the location of the photo she found by chance. She's playfully looking for a place in a photo where she doesn't even know who took it. Her bright smile is impressive, but there seems to be a hidden feeling behind it ── STAFF Planning /Production /Scenario: Kazuhide Oka Character design: Chiji Original soundtrack: ruichiro Translator: NY",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1684660/header.jpg?t=1654521696",
    "Price": 0.0,
    "Developers": "Kazuhide Oka",
    "Publishers": "Kazuhide Oka",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_0ca0f2888e481dbce7c90fa3949e5b7642fb4446.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_c540fded4939b146e45188f1b43286c66f63abbb.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_f86fe48c4aa69ce835262bcadf9716d7b9fedc4e.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_934ba7831874ede9c48d03a3bcd5bef0f2a12307.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_d647955a6328f40676354278e44485286de402ba.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_e52e386a907d8963da3403379de386fe69bf2d53.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_cc4bd9ac78b17fb914ac2498f064faeefc5bca4c.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_41d43789e85d18a411cdc14ee162cb6be5c1ade5.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_e4cd9ab8c41c4a9e6c4f2d3798e9e33f35f73f20.1920x1080.jpg?t=1654521696,https://cdn.akamai.steamstatic.com/steam/apps/1684660/ss_d8712bf8228532c37d83eee90180bdc5fd372c5a.1920x1080.jpg?t=1654521696",
    "Slug": "natsuno-kanata-beyond-the-summer",
    "Meta Title": "natsuno-kanata - beyond the summer: Aug 4, 2021, Kazuhide...",
    "Meta Description": "Looking for information on natsuno-kanata - beyond the summer? Check out the release date (Aug 4, 2021), developer insights from Kazuhide Oka, and a com...",
    "Alt Text Image": "Official header image for natsuno-kanata - beyond the summer game - Steam 1684660",
    "Canonical URL": "https://gusku.site/game/natsuno-kanata-beyond-the-summer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"natsuno-kanata - beyond the summer\", \"description\": \"Looking for information on natsuno-kanata - beyond the summer? Check out the release date (Aug 4, 2021), developer insights from Kazuhide Oka, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 4, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kazuhide Oka\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kazuhide Oka\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1684660/header.jpg?t=1654521696\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}