{
    "AppID": 670500,
    "Name": "RC Plane 3",
    "Release date": "Aug 7, 2017",
    "About the game": "The third chapter in the RC Plane series reaches PC world bringing a whole new engine, custom realistic flight physics and huge scenarios to explore at real RC Plane scale. Learn to fly a large (and growing) selection of RC Planes in huge and beautiful scenarios rich of detail. Grab an easy flier to enjoy a majestic sunset over the hills of Tuscany or hop in a fast stunt plane to fly through barns and high voltage pylons. Practice landings, stunts, wind handling and cow scaring or compete on global leaderboards across the many challenging game modes. RC Plane 3 was built from the very beginning with multi-platform support in mind, so while the series originated on mobile, we tried to strike some kind of balance between PC and mobile experiences, with core gameplay shared across all platforms, but many platform specific improvements too. We are a very small team, so don't expect impressive graphics, but hopefully you'll appreciate the general experience and feel the 'Joy of flight'. Designed to be expanded and grow radically during it's life time, expect a constant flow of updates and DLC from RC Plane 3, bringing improvements,  new game modes, vehicles and scenarios (and bug fixes..). While not officially in early access, you can sort of consider it so, in the sense that we are committed to continue improving the experience and fix bugs as we discover them (with your help possibly). RC Plane is a 'Freemium' game, don't hate us too much for this, it comes with a lot of completely free content while DLC's help us sustain game constant development, growth and improvement, plus users get to try a lot of the game before deciding if they are willing to invest into it. Or , purchase the 'Complete Edition' DLC which will unlock all current and future content with you never having to worry about a DLC anymore. FEATURES: - Realistic custom flight physics using am hybrid blade element theory approach. - Real-life electronic stabilization techniques help beginners get into the world of real RC Plane flying with same kind of electronic assists you can find on modern RC Planes. - Custom account system allowing users to carry their progress and unlocked content across all supported platforms.* - Arcade Physics to enjoy a much slower paced flight as in the original RC Plane games. - Two free scenarios available. - Huge 'Tuscany' scenario with a 4x4 mile environment to explore at a micro scale. - Realistic FPV and ground camera modes available for pros. - User editable FPV camera field of view to replicate real life cameras. - Rich soundscape and beautiful, original soundtrack. - Up to 6 players online (multiplatform) free flight, team death-match, Air Show and other soon coming game modes. - Combat Survival game modes have you dogfight against realistic AI opponents. - Many leaderboards and challenging game modes to compete on. - King of the week competition grants you a chance for global weekly glory ! - A growing list of game modes and vehicles. - Thermal air current simulation for realistic glider flight - Drone simulation. - Realtime illumination with realistic Night and Day cycles. - Multiplatform global leaderboards and achievements. - Much, much more to discover in-game. - VR Support possibly coming, we had oculus dev kit running fine but currently on hold. Hope to better coordinate with community on this. We'd love to hear your feedback and ideas as we plan to continue adding content and improve RC Plane 3, so please post and share on our forums, comments sections, Facebook , Twitter, Email or even smoke signals :). *We, by design, allow users to share their DLC purchases across all platforms supported by RC Plane 3, unfortunately we can't guarantee that this support will continue on all platforms as it might violate possible interpretations of some app stores policies. We will continue doing what's possible in this regard, and currently all platforms are supported.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/670500/header.jpg?t=1502210456",
    "Price": 0.0,
    "Developers": "FrozenPepper S.R.L",
    "Publishers": "FrozenPepper S.R.L.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_b8704ba84a6cfa3b4081283879b1c389f5620ad1.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_b4a9c30d161c5efe6e7e38807a4e3a8a21a434c8.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_9f3f5f04973d95cc06f702623a654a299c30718a.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_159acdab734f31dd2d56acccf4a1f4be893f6279.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_7cd9903d48c1ffb862771c663693dcb387bfd1f2.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_aed07cdd024c851b5ccae068f02953290aff5a4e.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_407bae057db281fb47cf8955469f7ff1170ffd91.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_1fb4211fc4c7cc09aeb25175789dfcd285c9ff4c.1920x1080.jpg?t=1502210456,https://cdn.akamai.steamstatic.com/steam/apps/670500/ss_9206623d9f4453802e5ce9d946734d5f8ad93048.1920x1080.jpg?t=1502210456",
    "Slug": "rc-plane-3",
    "Meta Title": "RC Plane 3: Aug 7, 2017, FrozenPepper S.R.L and Full Over...",
    "Meta Description": "Looking for information on RC Plane 3? Check out the release date (Aug 7, 2017), developer insights from FrozenPepper S.R.L, and a complete game summary.",
    "Alt Text Image": "Official header image for RC Plane 3 game - Steam 670500",
    "Canonical URL": "https://gusku.site/game/rc-plane-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RC Plane 3\", \"description\": \"Looking for information on RC Plane 3? Check out the release date (Aug 7, 2017), developer insights from FrozenPepper S.R.L, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 7, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"FrozenPepper S.R.L\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"FrozenPepper S.R.L.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/670500/header.jpg?t=1502210456\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}