{
    "AppID": 524490,
    "Name": "Shadron",
    "Release date": "Sep 5, 2016",
    "About the game": "Shadron is a procedural graphics editor based on GLSL shaders. Using a simple scripting language, you can define images, animations, 2D or 3D models, cubemaps, particle systems, and even audio. Describe how they are generated with shader code. You can load image files or use intermediate outputs as textures and alter them in any way you can imagine. A library of functions that are commonly used in procedural graphics is readily available for use in your scripts. Includes 17 commented example scripts for your inspiration This version requires Steam to run in the background. If that is an issue, you can buy the standalone version from the official website. Warning : Basic programming skills required! Please watch the introduction tutorial to see if this program is for you. There will be more tutorials coming soon. Shadron is a very versatile tool with many applications. What can you do with it? Create game assets. Create natural-looking seamlessly-tiled procedurally-generated textures using the bundled gradient noise functions. Generate 3D heightmap terrain. Create environment maps (cubemaps). Design and test materials with many different texture channels. Perform trivial image modifications. Sometimes, it can be much easier than using conventional image editors, especially when applying the same modification on multiple images. Create simple icons or animations. They will be mathematically precise, and for certain types of animations, some form of procedural generation is essential. Spinning loading progress animation included as an example. Create videos. All of the demos in the trailer were created only using Shadron, including the intro. You can have text, 3D perspective, particles, raytracing - anything, as long as you're able to write it in code. 4K resolution at 60 FPS is not a problem for Shadron. Design shaders or learn how to write them. Preview how they're going to look and see the changes as you type. No need to worry about setting up the rest of OpenGL. Play around with shaders. The possibilities of shaders are endless. Just experiment, be creative, and you might even surprise yourself. There are probably many other uses I didn't even think of.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/524490/header.jpg?t=1572688895",
    "Price": 17.99,
    "Developers": "Viktor Chlumský",
    "Publishers": "Viktor Chlumský",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_41d4c5f78cf568e659e32495d4045e135e8b2e25.1920x1080.jpg?t=1572688895,https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_54859de47395f9d45274c1df9cb78c52df3d1bb1.1920x1080.jpg?t=1572688895,https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_a4b74451e92a265a722c5a1bde9357b6b90dc53d.1920x1080.jpg?t=1572688895,https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_3fa1f8903b05947eb991ca5f0d065e228fc21882.1920x1080.jpg?t=1572688895,https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_b39a8d6e7c148e8929d03f220bf39269f3331cf7.1920x1080.jpg?t=1572688895,https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_3f93856ecf2632569084bd66692511ad2c10493f.1920x1080.jpg?t=1572688895,https://cdn.akamai.steamstatic.com/steam/apps/524490/ss_afd4114edd8124f32e93014adf0e994197bf02dd.1920x1080.jpg?t=1572688895",
    "Slug": "shadron",
    "Meta Title": "Shadron: Sep 5, 2016, Viktor Chlumský and Full Overview",
    "Meta Description": "Looking for information on Shadron? Check out the release date (Sep 5, 2016), developer insights from Viktor Chlumský, and a complete game summary.",
    "Alt Text Image": "Official header image for Shadron game - Steam 524490",
    "Canonical URL": "https://gusku.site/game/shadron",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadron\", \"description\": \"Looking for information on Shadron? Check out the release date (Sep 5, 2016), developer insights from Viktor Chlumsk\\u00fd, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Viktor Chlumsk\\u00fd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Viktor Chlumsk\\u00fd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/524490/header.jpg?t=1572688895\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}