{
    "AppID": 1258410,
    "Name": "Shinobi no Okite/The three female ninjas",
    "Release date": "Mar 26, 2020",
    "About the game": "Adventure in the Tokaido 53-tsugi with three female ninjas! STORY Ieyasu Tokugawa, who ended the era of Sengoku and unified Japan. This man created a highway connecting the capital of Kyoto and Edo. It is called the Tokaido-53-tsugi. It is said that 53 post towns were set up along the highway, where travelers stay, rest, and trade harnesses and outfits. One can find in these Fifty-three stations many famous places and historic sites that still have their features even after 400 years. On this Tokaido, three ninjas will travel from Edo in this present day with a secret mission. The three were the ninjas who worked during the Sengoku period; Karin from Koga, Kunai from Iga, and Yuri from Negoro. There are many obstacles on the road as well as many enemies obstructing them. Overcoming the difficulties and achieving their goals, the three will obtain a certain precious experience that is, 'Kizuna'. Game System The main feature of 'Shinobi no Okite/The three female ninjas' is that it allows the player to enjoy both the Ukiyoe and the action packed part of the game. Upon selecting the stage, the Ukiyoe part will be shown first. Once a certain part of the Ukiyoe has been reached, the player will then be thrusted into the action part of the game. In the action part of the game, you will control the female ninja and try to cut as much area as you can (specified in the beginning of the stage) without getting attacked by the enemies. If the player cuts certain area of the stage, the player can see the continuation of the Ukiyoe art. In a single stage, there will be 2 action parts in between the 3 Ukiyoe parts. The flow of events would be as follows: Ukiyoe Art A -&gt; Action Part A -&gt; Ukiyoe Art B -&gt; Action Part B -&gt; Ukiyoe Art C. The adventurer You are on an adventure with the three Kunoichi (female ninjas) who came from Iga, Koga and Negoro. They are users of techniques and ninjutsu that have survived the era of the Sengoku. Kunai IGA Shi is a female ninja from IGA village. Shi has three main skills which are 'Karasemi','Toha' and 'Hagan' Yuri NEGORO Shi is a female ninja from NEGORO village. Shi has three main skills which are 'Shinma','Jinrai' and 'Hien' Karin KOGA Shi is a female ninja from KOGA village. Shi has three main skills which are 'Hito','Shityo' and 'Onjutsu' 'Shinobi no Okite/The three female ninjas' is a highly addictive action game that anyone can play. Surely, every time you clear the stage, you will want to solve the next stage and next, and next. If you complete the mission with an exquisite balance, you will be able to know the history of Japan through the Japanese art 'Ukiyoe'. Enjoy the Japanese art of Ukiyoe, which was introduced in Japan and later influenced famous Western artists(Claude Monet). It is said that the now famous anime and manga, which are the representing subcultures of modern Japan, have inherited the deformation technology from Ukiyoe. You can choose from three types of game modes: an encampment mode, a treasure hunting mode, and the capture-the-enemy mode. You will explore the inn of Tokaido together with a female ninja as an adventurer. At each post, you can peek into the modern scenery of the inns. As you approach the end of the game, you will learn about Japan's history through traditional Japanese art and think beyond eternity. How to Play The flow of the game is as follows: Select Character Pick which character to play as. The characters have their own unique Superpowers and quirks. Kunai IGA Balanced in terms of movement and incision speed. Yuri NEGORO Slower movement but faster incision speed. Karin KOGA Faster movement but slower incision speed. Regarding the action part of the game you have to move your selected character across the main screen to perform incision on it while avoiding enemies and obstacles. Layout of the Game Screen ① Main Screen The area where the enemy characters can move around. You can use the player character to remove these. ② Back Screen The image for the continuation of the Ukiyoe part. Once an area of the Main Screen has been removed, that same area will reveal the corresponding area in the image of the Back Screen. ③ Timer Shows the remaining time to complete the stage ④ Stage Title The title of the currently selected stage ⑤ Obstacle Objects that are in your way ⑥ Player Character The character you control ⑦ Enemy Character Characters that will impede your progress ⑧ Character Stock The number of remaining character lives ⑨ Completion Status Shows much closer you are in clearing the stage ⑩ Superpower Gauge The gauge that stores up power to be used when activating the Superpower How to cut through the Main Screen ① When the Incision Button is pressed, you can now cut through the parts of the Main Screen. ② With the Incision Button held down, you can now enter inside the Main Screen. Incision marks will be left as you move along the Main Screen. ③ Connect the incision mark back to the border lines. ④ The area of the Main Screen inside the incision marks and the border lines can be cut through. Game Rules ・ The player character can be moved up, down, to the left and to the right (moving diagonally is not possible). ・ It is generally possible to move along the border lines. ・ While moving along the border lines, the player character won't take damage from anything from the Main Screen except from the bombs. ・ With the Incision Button held down, the player character can move through the main screen and trailing incision marks will be drawn. ・ The area of the Main Screen covered inside the border lines and the incision marks can be removed. ・ During the removal of the cut area, the larger portion of the Main Screen will remain afterwards. ・ When there is an Enemy Character in the removed area, that Enemy Character will also be removed in the Main Screen. When there is an item in the removed area, that item will be used. ・ When the Player Character takes damages, the value of the Character Stock will be reduced. ・ If the Player Character takes damage while the number shown in the Character Stock is zero (0), it will result to a Game Over. ・ If the Timer runs out before the condition to beat the stage has been achieved, it will result to a Game Over. ・ When the Continue option is chosen, you will start all over at the same stage where you got the Game Over. ・ When the clear condition has been achieved, you can now proceed to see the continuation of the Ukiyoe part. ★ The Player Character will take damage when: ・ Coming in contact with the Enemy Character while inside the Main Screen ・ Getting attacked while inside the Main Screen ・ Is in the blast range of the bombs ・ The Enemy Character touches the incision marks ・ The incision marks overlap one another (this will result into the incision marks covering Main Screen) ・ The Clear Condition has not been achieved Clear Condition Once the transition from Ukiyoe part to the action game occurred, the condition to beat the current stage will be shown. The stage will be considered cleared once this condition has been met. ・Cover XX% area! Clear Condition of the NORMAL game type. Remove XX% of the Main Screen (the value of XX varies) to clear the stage. ・Item extraction! Clear Condition of TREASURE game type. The stage is cleared once all of the items hidden in the Main Screen have been used. ・Queued up! Clear Condition of the CATCH game type. Take out the Enemy Characters (isolate them from the Main Screen) in the exact order they appeared. Enemy Character Enemy Characters move inside the Main Screen and around the border lines, making it hard for the Player Character to clear the stage. Avoid them and make your way to fulfill the Clear Condition. It is possible to take them out by cutting the area they are in. Obstacle These are things that the Player Character cannot go through. When the Enemy Characters move through these inside the Main Screen, the effects would be as follows: Block Has no effect on the Enemy Character's movement. Speed Panel Changes the movement speed. Will change within a set time. Reactive Handicap When the Enemy Character bumps into this or bumps into the borderlines, it will push it back. Items The following are hidden in the Main Screen (the quantity and the kind of items in the stage varies). If item is in the removed area, that item will be automatically used. 1UP Increase the Character Stock by 1 Item Reveal See the location of all the hidden items Special Up Increase the level of the Superpower Gauge Special Plus Gain certain amount for the Superpower Gauge ※When trying to use another item while you are already using an item, the effects of the latest item you used will take priority. Pause Pressing the Esc key will pause the game and will bring up the System Menu. This will work when you are either on the Ukiyoe part or the action part. (When the Esc key is pressed during the Ukiyoe part, it will also stop the voice that is currently being played.) Superpower When part of the Main Area has been removed, the Superpower Gauge will fill up based on the size of the removed area. When the Superpower Button is pressed, you perform a certain ability. If the effects of the Superpower is random, pressing the Superpower Button will start the roulette wherein you use the Incision Button to stop the roulette. The effect displayed on the spot where the roulette stopped will then be activated.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1258410/header.jpg?t=1585228414",
    "Price": 2.99,
    "Developers": "Panther Software",
    "Publishers": "Yumeville inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_eba140fef5ad178cf168873c0ccf14ad71532435.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_d23cfa4d5459e5b898b7ff3e9ea78130c34850d5.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_b2c86f68c4e20e4182d572c7e5d2fd19a27f5b7d.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_840bc8ed5946a3c0a3c255e2927942f7fbc0b961.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_5546ab45d9b7fc66a6e9f9c661f2186ad24ca29c.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_9db16c69f993a44755130d3ea135fc8790c84124.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_1541660c75162ce977ae0da8c53d08e4ce83f9bb.1920x1080.jpg?t=1585228414,https://cdn.akamai.steamstatic.com/steam/apps/1258410/ss_e937906b2ae90449292d876210a1d2402afca22f.1920x1080.jpg?t=1585228414",
    "Slug": "shinobi-no-okite-the-three-female-ninjas",
    "Meta Title": "Shinobi no Okite/The three female ninjas: Mar 26, 2020, P...",
    "Meta Description": "Looking for information on Shinobi no Okite/The three female ninjas? Check out the release date (Mar 26, 2020), developer insights from Panther Software...",
    "Alt Text Image": "Official header image for Shinobi no Okite/The three female ninjas game - Steam 1258410",
    "Canonical URL": "https://gusku.site/game/shinobi-no-okite-the-three-female-ninjas",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shinobi no Okite/The three female ninjas\", \"description\": \"Looking for information on Shinobi no Okite/The three female ninjas? Check out the release date (Mar 26, 2020), developer insights from Panther Software...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Panther Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yumeville inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1258410/header.jpg?t=1585228414\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}