{
    "AppID": 665310,
    "Name": "Tank Battle: Pacific",
    "Release date": "Jul 27, 2017",
    "About the game": "Ask most historical strategy gamers about World War Two and not many would have thought there were any tank battles in the Pacific Theatre of World War Two. They did happen, and they happened often, but they never matched the scale of the Western Theatre. Starting in China in the 1930’s the Chinese engaged the Japanese using Russian T26’s and German Panzer I’s. The Japanese fought the Russians in 1939 and 1945, the Soviets with the one of the world’s greatest generals, Zhukov, in command! In 1941 the French in Vietnam briefly fought the Japanese with World War One era tanks. In Burma and India, British Commonwealth forces regularly engaged in battle using equipment that would have been considered obsolete on the West Front. Finally the titanic struggle between the Japanese and United States of American resulted in dozens of tank engagements. Even the Island War battles saw some engagements with over 30 Japanese tanks in a single mass assault. Tank Battle: Pacific attempts to create many of these battles with a mixture of historical battles and themed scenarios that capture the experience of being a tank commander in the Pacific Theatre in World War Two. Fight battles between Japan, France, China, Russia, British Commonwealth and The United States of America. The game has a wide range of features from the tank battles of Northern Manchuria to the battlefields of Burma and the landings on the Pacific Islands. The game even includes a what-if scenario for Operation Olympic, the invasion of the Japanese homelands. Key Game Features: High Definition World War II era graphics. 15 Missions to play through, including 2 large-scale beach invasions. Play as the Japanese in the 8 Mission ‘First Strike’ tutorial campaign, concluding with a full-scale mission. Play as the Chinese versus the Japanese in the ‘Bonus’ Campaign (1 Mission). Play as the Japanese versus the French, then Chinese, the Americans in the 3 Mission ‘Rising Sun’ Campaign. Play as the Americans versus the Japanese in the 3 Mission ‘Eclipse’ Campaign. Play as the Japanese versus the British Commonwealth in a 5 mission ‘Empire’ campaign. Play as the British Commonwealth versus the Japanese in a 5 mission ‘Commonwealth’ campaign. Play as the Soviet Union versus the Japanese in a 3 mission ‘Red Bear’ campaign. Over 123 unique units! Specialist units such as LV’Ts (Landing Craft Tank), LVCP’s (Landing Craft), Engineers and the ubiquitous LVT (Landing Vehicle Tracked) Japanese bunkers and other fortifications. Japanese Infiltration units. Japanese ‘Nikuhaku’ anti-tank suicide units. High Definition grassland and beach terrains. Four troop classes; Raw, Average, Veteran and Elite. Other Game Features; detailed combat analysis, flank attacks, strategic movement, indirect fire, mounting and dismounting from vehicles, multi-level hills and minesweepers. Hours of game play. Map zoom.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/665310/header.jpg?t=1574077125",
    "Price": 9.99,
    "Developers": "HexWar Games",
    "Publishers": "HexWar Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/665310/ss_5e6917597d0f21ff93a076c5b24629747bee2532.1920x1080.jpg?t=1574077125,https://cdn.akamai.steamstatic.com/steam/apps/665310/ss_815f44f0082a9ce9c35f9b441736db84b24cd1a9.1920x1080.jpg?t=1574077125,https://cdn.akamai.steamstatic.com/steam/apps/665310/ss_1de3aeb69b2b114fb37dc50cbf6d533909a1f0ad.1920x1080.jpg?t=1574077125,https://cdn.akamai.steamstatic.com/steam/apps/665310/ss_1190335458419e1dd443e294ad621373c7cd45c1.1920x1080.jpg?t=1574077125,https://cdn.akamai.steamstatic.com/steam/apps/665310/ss_545c417eca1cb3a6eac1d7dbab232517405bc576.1920x1080.jpg?t=1574077125",
    "Slug": "tank-battle-pacific",
    "Meta Title": "Tank Battle: Pacific: Jul 27, 2017, HexWar Games and Full...",
    "Meta Description": "Looking for information on Tank Battle: Pacific? Check out the release date (Jul 27, 2017), developer insights from HexWar Games, and a complete game su...",
    "Alt Text Image": "Official header image for Tank Battle: Pacific game - Steam 665310",
    "Canonical URL": "https://gusku.site/game/tank-battle-pacific",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tank Battle: Pacific\", \"description\": \"Looking for information on Tank Battle: Pacific? Check out the release date (Jul 27, 2017), developer insights from HexWar Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"HexWar Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"HexWar Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/665310/header.jpg?t=1574077125\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}