{
    "AppID": 278640,
    "Name": "Terrian Saga: KR-17",
    "Release date": "Jul 9, 2014",
    "About the game": "In Terrian Saga: KR-17 players take control of a misfit military drone as it gains sentience and grows a conscious after being activated for war. Players will use an assortment of upgradable weapons including a laser, grenades, and flame thrower along with their trusted friend and sidekick, an also sentient guided missile named J1M. Players must fight their way through hordes of varying enemy robots while exploring intricate levels to uncover their mysterious past and discover the true enemy. Within the galaxy on the Carina arm live twin solar systems riddled with conflict: the Terrius system and his brother, the Cyrinus system. These two empires travel so closely together they share multiple planets within their gravitational complex. However, the Cyrians have become embroiled in an interplanetary conflict with the Glortac People’s Resistance. Terrius has begun building military installations in order to better help combat the threat of the GPR. One of these bases, built on the planet Valiant, has been sabotaged. A terrorist has released thousands of killer robots on the Valiant base, destroying all personnel. The Terrius military has determined that this terrorist may have contacts with the GPR. Due to the risk of one of their most powerful military installations and armory falling into the hands of the GPR, Terrius has sent a strike force of 100 advanced KR drones to destroy these evil robots and restore order to the base- all before Valiant makes it’s swing into the Cyrinus system. Features Adventure across 65 boards spread over 9 themed zones Test your mettle against 8 deadly bosses Fire and guide J1M to take out hard to reach enemies, blast open new passages and explore Receive important updates and explore the relationship between KR-17 and J1M with in-level dialogue Collect Gears, find hidden jetpacks, and race the clock to climb the Steam leaderboards Experience varied level design: play through non-linear levels that encourage exploration, along with high intensity action platforming sequences Earn Steam Achievements that unlock alterations to your character",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/278640/header.jpg?t=1447360373",
    "Price": 4.99,
    "Developers": "Wonderfling",
    "Publishers": "Digital Tribe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/278640/ss_de69913ff2c8ac5af8a19507af7152bf91d175a2.1920x1080.jpg?t=1447360373,https://cdn.akamai.steamstatic.com/steam/apps/278640/ss_aa230050b8842279bed3312dfd6f92dadb02b632.1920x1080.jpg?t=1447360373,https://cdn.akamai.steamstatic.com/steam/apps/278640/ss_2d09dbe4c2fcef5f155077154829afae3f2f8f66.1920x1080.jpg?t=1447360373,https://cdn.akamai.steamstatic.com/steam/apps/278640/ss_66cef9aaf60282bd1526561d82f85d7bbc75b3d6.1920x1080.jpg?t=1447360373,https://cdn.akamai.steamstatic.com/steam/apps/278640/ss_d89e8a290a12a36e83c5203bb3fb5882dec64d05.1920x1080.jpg?t=1447360373",
    "Slug": "terrian-saga-kr-17",
    "Meta Title": "Terrian Saga: KR-17: Jul 9, 2014, Wonderfling and Full Ov...",
    "Meta Description": "Looking for information on Terrian Saga: KR-17? Check out the release date (Jul 9, 2014), developer insights from Wonderfling, and a complete game summary.",
    "Alt Text Image": "Official header image for Terrian Saga: KR-17 game - Steam 278640",
    "Canonical URL": "https://gusku.site/game/terrian-saga-kr-17",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Terrian Saga: KR-17\", \"description\": \"Looking for information on Terrian Saga: KR-17? Check out the release date (Jul 9, 2014), developer insights from Wonderfling, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 9, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"Wonderfling\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Digital Tribe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/278640/header.jpg?t=1447360373\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}