{
    "AppID": 1275600,
    "Name": "The Wizard or: How I Learned to Stop Worrying About My Face and Love the Tactical Dungeon Crawl",
    "Release date": "Nov 27, 2020",
    "About the game": "In The Wizard, you’ll face a greater challenge than ever. You’ll have to be a wiz kid to beat this one — and thankfully, you already are. You play as Kevin, a wizarding student , though you aren’t doing much magic these days. After all, being the handsomest kid in school sure does take a lot of work! That is until one day, this no-good thief up and steals your face ! You just can’t face your classmates without it, of course, so the adventure begins. You’ll have to navigate through the dark and gloomy dungeons beneath the academy to fight enemies aplenty, from rats to slimes to whatever that thing is. …Yeah, we’ll let you find out for yourself on that one. Either way, you’ll have to collect these mysterious spells and cast them using a unique gesture-based spellcasting system. Draw the pattern of the spell in the 3x3 aether grid in any direction you choose to kill an enemy, break down a door, or uncover some secrets along the way. Turn-based movement You can’t just keep blasting Magic Missile forever, though, and that’s where movement comes in. Click on yourself to wait a turn, click on one of the green squares around you to creep around one turn at a time, or click and drag to advance multiple turns at once. Choose wisely, though — each turn that passes is another chance to kill or be killed . You won’t be the only thing creeping around in this place. Check your enemy’s movement range and health, then navigate carefully. With stronger enemies each level and increasingly mind boggling turn-based maps, it’ll take more than just blind luck to make it out alive. Upgrade your spells Thankfully, you’ll get stronger as you go along too. Each time you use a spell, its specific skill-meter goes up until you cross a threshold and suddenly start blasting away enemies from even further away! Or that tiny freezing spell you got in the beginning? It can now freeze almost half the map! But remember, with great power comes great responsibility. Explore every inch of these sordid halls and you might just find extra potions, hearts to expand your life meter , and maybe even some forbidden spells. Each new thing you find is just one more chance to make it out alive. Between plenty of spells to collect and cast, life-saving features like mid-map checkpoints, and tons of mazes to explore, you’ll have plenty to enjoy in The Wizard. Features Challenging tactical turn-based gameplay Unique and intuitive gesture-based spellcasting system Upgrade your spells by simply using them Save your progress mid-map with checkpoints Planned Features Roguelike Mode with daily challenges New levels, spells and enemies Extensive customization and accessibility options A Mario Maker-style level editor to create and share levels",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1275600/header.jpg?t=1653024231",
    "Price": 18.99,
    "Developers": "Hypnotic Owl",
    "Publishers": "Hypnotic Owl",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_9e22b725669ddd0fe5d7930861ba5d563c425688.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_d31c1b80f3852ba5bdd7bae7a36d0e52ec2cfb7c.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_08ac74255e5dee23d15b5003c6bb342264b19a77.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_44f18451b29f48f49ec737b0ec54610e9f91eacc.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_59a0a2d51e0b551c9cae264465340587cfdc0d59.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_fc29a6b58b0dd779204df50a8a4c1069df3d074d.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_35b3e48e23cec7be4b52258a8fcb15a64a6628b4.1920x1080.jpg?t=1653024231,https://cdn.akamai.steamstatic.com/steam/apps/1275600/ss_a4debdfaba1f4bf24ec7dee4cc2f48e76a36d0c2.1920x1080.jpg?t=1653024231",
    "Slug": "the-wizard-or-how-i-learned-to-stop-worrying-about-my-face-and-love-the-tactical-dungeon-crawl",
    "Meta Title": "The Wizard or: How I Learned to Stop Worrying About My Fa...",
    "Meta Description": "Looking for information on The Wizard or: How I Learned to Stop Worrying About My Face and Love the Tactical Dungeon Crawl? Check out the release date (...",
    "Alt Text Image": "Official header image for The Wizard or: How I Learned to Stop Worrying About My Face and Love the Tactical Dungeon Crawl game - Steam 1275600",
    "Canonical URL": "https://gusku.site/game/the-wizard-or-how-i-learned-to-stop-worrying-about-my-face-and-love-the-tactical-dungeon-crawl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Wizard or: How I Learned to Stop Worrying About My Face and Love the Tactical Dungeon Crawl\", \"description\": \"Looking for information on The Wizard or: How I Learned to Stop Worrying About My Face and Love the Tactical Dungeon Crawl? Check out the release date (...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 27, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hypnotic Owl\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hypnotic Owl\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1275600/header.jpg?t=1653024231\", \"offers\": {\"@type\": \"Offer\", \"price\": 18.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}