{
    "AppID": 287630,
    "Name": "The Council",
    "Release date": "Mar 13, 2018",
    "About the game": "The Complete Season of The Council grants you access to all 5 episodes. The Council is an episodic game like no other. Delivering a fresh new take on the Narrative Adventure, your choices and character growth truly matter. Make hard-hitting decisions, but also develop an array of skills to directly impact how the story unfolds. With permanent, long-lasting consequences, there is no going back. Plunge into a tale of intrigue and manipulation in the style of a classic murder mystery, living with a cast of alluring characters each hiding their own dark secrets. Trust no one while uncovering dire truths – no matter the cost to mind and body. The Council begins in 1793, with players taking the role of secret society member Louis de Richet after his invitation to a private island off the shores of England by the enigmatic Lord Mortimer. Joining him are a number of high profile guests, including Napoleon Bonaparte and President of the newly-formed United States of America, George Washington. The strange nature of this private reception goes beyond just the prestigious guests –Richet’s own mother has recently gone missing on the island, while each and every one of the colorful cast seems to have their own hidden agendas. In a new twist for the genre, the core of The Council’s gameplay comes from manipulating and maneuvering through character encounters using the unique Social Influence system. During confrontations, skills and limited resources can be used to gain the upper hand and achieve the desired outcome. Players will be rewarded for their knowledge of each character’s psychological vulnerabilities and immunities, as well as their preparations made during prior exploration and investigation. Failing an encounter does not mean ‘game over’, and no action can be taken back. The consequences are permanent, and may result in persistent physical disfigurements or mental traits that help or hinder the rest of the player’s adventure. Richet’s numerous skills can be developed to align with your chosen approach to the adventure. Solve issues with diplomacy, delve into occultism to expand your historical and scientific knowledge, or play detective and see what others do not perceive. Your skills will have uses that extend far beyond your conversations with fellow guests. With 15 diverse skills to use and invest in, players are free to uncover The Council’s mysteries how they see fit, with wildly varying consequences depending on their methods. The results will forever alter the life of Louis de Richet, of those around him, and shape history as we know it.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/287630/header.jpg?t=1651049187",
    "Price": 0.0,
    "Developers": "Big Bad Wolf",
    "Publishers": "Focus Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_cd41cd45ad426c8353d21a537d252654fab8024d.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_d26aba5d99a8860b9590482dbed08d07adc5f01f.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_83b299f8f02cbd9c5a3dfd8d6af737f97b0552fb.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_1c51a90619ed591917cbbb6ce48a1a3e635ce293.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_a25dbe71c9617d80afff9daf75c9b9578d52c1e2.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_03e6a635d2395f0941c8525f3242dbb3bc88a85e.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_06e0934db9177be3fbc9bb31ca62185763d92380.1920x1080.jpg?t=1651049187,https://cdn.akamai.steamstatic.com/steam/apps/287630/ss_bb36e9d49a56ff939840d4999828566f0892fc99.1920x1080.jpg?t=1651049187",
    "Slug": "the-council",
    "Meta Title": "The Council: Mar 13, 2018, Big Bad Wolf and Full Overview",
    "Meta Description": "Looking for information on The Council? Check out the release date (Mar 13, 2018), developer insights from Big Bad Wolf, and a complete game summary.",
    "Alt Text Image": "Official header image for The Council game - Steam 287630",
    "Canonical URL": "https://gusku.site/game/the-council",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Council\", \"description\": \"Looking for information on The Council? Check out the release date (Mar 13, 2018), developer insights from Big Bad Wolf, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Big Bad Wolf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Focus Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/287630/header.jpg?t=1651049187\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}