{
    "AppID": 1564020,
    "Name": "The Dark",
    "Release date": "Apr 12, 2021",
    "About the game": "You come round as your escape pod plummets into the inky waters of a distant flooded planet. Comms are down and power failing. You have no choice but to head out into.. the dark. This is a game idea that has been floating around my head for 20 years or so. I’m a triple AAA dev but had a couple of weeks off between jobs. I decided to finally make this as a short personal game jam. I’m pretty happy with the results- obviously given it’s just me and the timescale a lot is still a bit rough around the edges. This is very much early access. Some things will be improved for the final game - particularly the voice acting I see as placeholder (It's me! - and I’m no actor). Once the game is finished I’d like to employ someone really talented to really bring the Captain to life. I’ve only got about the first 20-30 minutes or so of gameplay done. I’d expect this to be a quarter of the final game / experience. This is reflected in the cheap price for the moment! The game works well in non VR 3rd person camera and VR. I’m loving this as a VR experience however if you are playing in VR I’d describe it as “Medium” comfort level. It starts pretty rough, but I’ve tried to keep decent smooth periods between higher action (and motion) moments. However…if you are sensitive, you might just get seasick, if so unplug and fire it up again without VR. Also its control pad only for the moment (no touch controller etc) support. I hope to add that later - although the pad does work well for the interface that you need to pilot the pod touch is just more involved. You can expect to crash land in your pod on a dark ocean planet. As you explore a story will unfold with full voiceover as you pilot your escape pod over dark waters unlock the secrets of the planet. If you enjoy it, please leave me some encouragement and also let me know whether you are enjoying playing VR / 3rd person. I could do with deciding whether to focus it mainly as a VR experience or not. Thanks for playing and good luck out there, Captain.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1564020/header.jpg?t=1618214219",
    "Price": 0.99,
    "Developers": "Light Arc Studio Ltd",
    "Publishers": "Light Arc Studio Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1564020/ss_fe9596d10800b3676dccfb3b8383eb0033585e0f.1920x1080.jpg?t=1618214219,https://cdn.akamai.steamstatic.com/steam/apps/1564020/ss_20c5f836d73162772f3cb46143adb614fd263346.1920x1080.jpg?t=1618214219,https://cdn.akamai.steamstatic.com/steam/apps/1564020/ss_1f4c3899a6f79d20a06fa03dccf050f1ec6f00df.1920x1080.jpg?t=1618214219,https://cdn.akamai.steamstatic.com/steam/apps/1564020/ss_c712eeefc9c52d08bf558aba20d2aaf2fceed2c0.1920x1080.jpg?t=1618214219,https://cdn.akamai.steamstatic.com/steam/apps/1564020/ss_69d453270371dc6dae295f0a929af2c2ca2a6dd2.1920x1080.jpg?t=1618214219,https://cdn.akamai.steamstatic.com/steam/apps/1564020/ss_418192d8d9f3a97fa8b81a85aa0c9b416862790a.1920x1080.jpg?t=1618214219",
    "Slug": "the-dark",
    "Meta Title": "The Dark: Apr 12, 2021, Light Arc Studio Ltd and Full Ove...",
    "Meta Description": "Looking for information on The Dark? Check out the release date (Apr 12, 2021), developer insights from Light Arc Studio Ltd, and a complete game summary.",
    "Alt Text Image": "Official header image for The Dark game - Steam 1564020",
    "Canonical URL": "https://gusku.site/game/the-dark",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Dark\", \"description\": \"Looking for information on The Dark? Check out the release date (Apr 12, 2021), developer insights from Light Arc Studio Ltd, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Light Arc Studio Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Light Arc Studio Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1564020/header.jpg?t=1618214219\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}