{
    "AppID": 222618,
    "Name": "Train Simulator: East Coast Main Line London-Peterborough Route Add-On",
    "Release date": "Dec 5, 2013",
    "About the game": "One of the busiest routes on the British rail network springs to life in the stunning East Coast Main Line London-Peterborough route for Train Simulator, featuring the classic High Speed Train and commuter Class 365 EMU. The East Coast Main Line was originally built by three railway companies in the mid-1800s – the North British Railway, North Eastern Railway and Great Northern Railway - each constructing their own section but with the intention of linking up to form a through route from London to Scotland, later to become known as the East Coast Main Line. The full ECML covers 393 miles (632km) from London King’s Cross to Edinburgh, passing through Peterborough, Doncaster, York, Darlington and Newcastle. It forms a key artery on the eastern side of the UK and broadly runs parallel to the A1 trunk road. Classed as a high speed line, as it mostly meets the speed criteria of 125mph (201km/h), the route handles cross-country, commuter and local passenger services, and is a primary route for heavy tonnage of freight traffic between the north and south of the UK. Electrification of the route was authorised in 1984 and work began in 1985. The first electrified section between London and Leeds opened for operational trials in 1988, and was the fastest main line in the UK until the opening of High Speed 1 in 2003. The route for Train Simulator takes in the 76 mile (122 km) section of the ECML from London to Peterborough. Starting out at the busy London King’s Cross station, a large hub for long distance and outer-suburban services, the route winds its way slowly out of the sprawling Capital and, passing Finsbury Park and Alexandra Palace. As the route opens up into Hertfordshire, the four track line passes through Potters Bar, Hatfield, Welwyn Garden City and Hitchin, before terminating in Peterborough. Significant landmarks along the route also include the striking Alexandra Palace, the Emirates Stadium (home to Arsenal Football Club), Digswell Viaduct, Gasworks Tunnel at King’s Cross, Copenhagen Tunnels, Bounds Green train maintenance depot, and Peterborough’s large freight yard and Post Office depot. Also included with the route is the popular High Speed Train, complete with Class 43 locomotives and full coach consist, and the commuter Class 365 EMU in First Capital Connect livery, a train which is seen on outer-suburban services between London, Peterborough and beyond. Whether you are looking for high speed running or the more serene stopping commuter services along the route of the famous Flying Scotsman, the East Coast Main Line London-Peterborough route for Train Simulator is filled with challenging drives and magnificent scenery across the UK’s capital and Home Counties. Twelve Scenarios For the Route Peterborough Nene Sidings Departure Tutorial King’s Cross Empty Stock Tutorial Peterborough Southbound Stopper North to Hitchin Welwyn Garden City – Down Slow from London (Part 1) Welwyn Garden City – Back Up to London (Part 2) Back to Bounds Green The Staff Train In a Hurry Morning commute to Stevenage Southbound to Kings Cross The 801 at 08:01 More scenarios are available on Steam Workshop online and in-game. Train Simulator’s Steam Workshop scenarios are free and easy to download, adding many more hours of exciting gameplay. With scenarios being added daily, why don’t you check it out now! Click here for Steam Workshop scenarios. Key Features 76 mile (122km) East Coast Main Line route from London King’s Cross to Peterborough Landmarks including Alexandra Palace, Emirates Stadium, Digswell Viaduct, Gasworks Tunnel at King’s Cross, Copenhagen Tunnels and Bounds Green train maintenance depot Freight yards and Post Office depot at Peterborough High Speed Train (HST), including Class 43 locomotives and full coach consist Class 365 EMU in First Capital Connect livery Hitachi Class 801 EMU prototype Scenarios for the route Quick Drive compatible Download size: 1,542mb",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/222618/header.jpg?t=1493805887",
    "Price": 19.99,
    "Developers": "Dovetail Games",
    "Publishers": "Dovetail Games - Trains",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_dbab981f6d6527cc2ac371711a39bb765fd0e7f7.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_5d0262573a8d2caf37c2c9c9267e19e6e4089e5f.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_f2122ee5a98ad1d373c42d5e55b1ebda3d1f02ef.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_6f2e823d9d68e537e5029b8b3f128c7271d2d092.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_76713e5d72791686b07f66f705cf759b339d5498.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_8b550151b1fe254846f785cf445783725adc28bc.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_29d31f4a7855647d1b6ed2f2ae5d3af1faa920c9.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_cd318c2ccd2d38f1f419462b6768a3853ac3e535.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_3f611cf3ecb0237508395af941d1d9bfc9cdf31e.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_77a61dc081e2520344c4030c637b6e3543f5b6d5.1920x1080.jpg?t=1493805887,https://cdn.akamai.steamstatic.com/steam/apps/222618/ss_9809430360f8e12974753951700cd5417dc2c458.1920x1080.jpg?t=1493805887",
    "Slug": "train-simulator-east-coast-main-line-london-peterborough-route-add-on",
    "Meta Title": "Train Simulator: East Coast Main Line London-Peterborough...",
    "Meta Description": "Looking for information on Train Simulator: East Coast Main Line London-Peterborough Route Add-On? Check out the release date (Dec 5, 2013), developer i...",
    "Alt Text Image": "Official header image for Train Simulator: East Coast Main Line London-Peterborough Route Add-On game - Steam 222618",
    "Canonical URL": "https://gusku.site/game/train-simulator-east-coast-main-line-london-peterborough-route-add-on",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Train Simulator: East Coast Main Line London-Peterborough Route Add-On\", \"description\": \"Looking for information on Train Simulator: East Coast Main Line London-Peterborough Route Add-On? Check out the release date (Dec 5, 2013), developer i...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2013\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dovetail Games - Trains\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/222618/header.jpg?t=1493805887\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}