{
    "AppID": 575400,
    "Name": "Try Hard Parking",
    "Release date": "Jan 3, 2017",
    "About the game": "Welcome to 'The Hardest and most rage inducing Parking Game in The World', just give it a try. Tempt fate &amp; physics as you navigate obstacle courses in pursuit of your holy parking spot in this 80s retro environment in Try Hard Parking! . Put your driving skills to the test in this retro styled game as you jump,drop and carefully steer across levels full of obstacle to reach your holy parking lot. This is not your typical parking game. We have so many driving games these days that they are proud of their driving skills. Do a good time and throw the controller to a friend and see all his driving skills diminish. Feature List : 10 Unique Crazy Levels with Different Vehicles ranging from 80s known Cars to A-Team's Van. Difficult, Fun, Fast, Frustrating and Rage Inducing Gameplay with great music to keep your cool. Game Trophies such as 'Grand ma' for slowest and 'Takumi 86' for Fastest or 'Super Tuber' for extreme players. Some Trophies can only be achieved within a limited amount of tries after that its gone (Consequence filled Score Resetting, which makes you lose all your best times) Steam Achievements with some levels with hidden achievement. (Do 'Trial 1' in under 45 seconds and 5 Tries, to get a cool achievement) Don't lose your Zen, it only gets harder -&gt; 'be in the zone'. Hit 'ENTER' or 'Start' on Xbox360 Controller to Quickly Reset if your vehicle is stuck(which will be a lot of times). It resets the timer too, but keeps the number of tries. Use pulses of Acceleration: Don't Go full throttle , use short bursts of speed. Use Handbrake turns: Use brakes and handbrakes, rear wheel slides to get the car in to position. Keep wheels in contact : Try to be keep your wheels in contact for traction. Don't get stuck : The car gets stuck easily on corners &amp; ledges, so it requires a bit of precision to drive. Note : I really believe in 'Try Before you Buy model' , therefore suggest you type 'Try Hard Parking' in YouTube and see some Gameplays before you buy the game, so that you are sure what you are getting. The steam GreenLight page has a demo for you to play. Thank you. Also please don't give thumb down, because you find it hard. The style and camera view of Try Hard Parking pays homage to Neo DriftOut &amp; OverTop for NeoGeo 1994. Soundtrack Artists: Evan King Jeremy Lelis Navigation on Level Screen - Click on the arrows on the level selection screen to move around different Level Grids. - Mouse over Blocks too see Trophies (some are achievements). about the Developer: Hi my name is Sayem Chaklader. I am a lonewolf developer who loves contributing to OpenSource Software. Currently my 11 year nephew is my playtester (in exchange for Lays &amp; Pringles).",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/575400/header.jpg?t=1487097979",
    "Price": 1.99,
    "Developers": "gearspecs",
    "Publishers": "gearspecs",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_5351096a2a7cd350e6ab4143d92214037cc56466.1920x1080.jpg?t=1487097979,https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_a01a6f65c43e8c7004f1ed5e064693b1529eb88c.1920x1080.jpg?t=1487097979,https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_632b86b02414581a6715e6c300c733d22184a3b2.1920x1080.jpg?t=1487097979,https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_ec307ad57fa52ea749929af4ead0a8c4dffa8f7b.1920x1080.jpg?t=1487097979,https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_0fd528293f63fffe4dad5b1f0f798c30789af181.1920x1080.jpg?t=1487097979,https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_d3504613163536d88094ef39e4d9115abd2b8d13.1920x1080.jpg?t=1487097979,https://cdn.akamai.steamstatic.com/steam/apps/575400/ss_84031b30e17b9efa9c113e145de91b9902c63607.1920x1080.jpg?t=1487097979",
    "Slug": "try-hard-parking",
    "Meta Title": "Try Hard Parking: Jan 3, 2017, gearspecs and Full Overview",
    "Meta Description": "Looking for information on Try Hard Parking? Check out the release date (Jan 3, 2017), developer insights from gearspecs, and a complete game summary.",
    "Alt Text Image": "Official header image for Try Hard Parking game - Steam 575400",
    "Canonical URL": "https://gusku.site/game/try-hard-parking",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Try Hard Parking\", \"description\": \"Looking for information on Try Hard Parking? Check out the release date (Jan 3, 2017), developer insights from gearspecs, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 3, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"gearspecs\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"gearspecs\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/575400/header.jpg?t=1487097979\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}