{
    "AppID": 377360,
    "Name": "Western Press",
    "Release date": "Apr 21, 2016",
    "About the game": "Based on a true story, Western Press is the most historically accurate frontier dueling game available for PC and Mac. Probably. Competing in tournaments of up to 16 players (or bots), duelists both online and off will face each other in rapid fire, 1v1 sprints to finally settle who can press a random string of ten buttons the fastest. Features No Time to Explain Learning to play is incredibly simple: Buttons go top to bottom, do them fast. A duel takes seconds, and a 16 player tournament takes minutes. So just how good is your guest list’s controller knowledge, and just how fast are their reactions? Submit your answer in ten buttons or less. (Not less, you'll lose. Do ten.) As Easy as A, B, Square, Triangle Custom settings allow you to control which buttons are used, so combos are as complicated as you’d like them to be, from directions only to the full gamut. Western Press features prompts for Xbox controllers, PlayStation controllers, dance mats, and supports a large range of third party controllers. Of course, who could forget our friends on keyboards... Not My Type Keyboarding cow-folk can expertly type their opponent to death. With a choice between ten letter words, random gibberish, or our not-trademarked 'Controller, Replicated ' layouts, discover which best suits your style, select it, and [W] [] [N]! (They're letters. From the keyboard.) Online and Local Tournaments for Humans and Machines Alike Hold custom tournaments for from two to 16 competitors with any mix of local players, online players and bots. The tournament system works out all the match-ups for you, so you get to just sit back and relax. Until it’s your turn. Then stop relaxing because it’s time for extreme and relentless stress. A Test of Character Create a profile and play through the Skill Tester to earn your rank, while simultaneously unlocking some of Western Press’ wild bunch. You start with four playable characters, but you’ll have to earn the other 12 by playing the game. Is there anyone fast enough to unlock Wyatt Hurt? Stroll Down Memory Lane Fancy yourself more intellect than athlete? Try Memory Mode , where players must memorise and repeat an ever increasing string of buttons. But make more mistakes than your opponent, and you eat lead. Steam Workshop Support Create custom characters and environments with your own animations, sounds and taunts. Then share them with the community via Steam Workshop, where they’ll be downloaded dynamically at the beginning of an online tournament! Create yourself, your friends, your favourite characters, celebrities, politicians, inanimate objects with faces, whatever!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/377360/header.jpg?t=1611957419",
    "Price": 4.99,
    "Developers": "Bandit-1",
    "Publishers": "Surprise Attack",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_48241ca67d79f1b7703707ec14747fc2d2142a41.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_b083619bf0798a702eb18824567260758bd3bd0a.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_70e8cdc1236bd3cce447963914d3ebd5f8bc4ac5.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_865fc44c73e4187c74ae37cecdb129c2a8230f68.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_27d31e1a469465e29e9ad170cc709df7ebfd040d.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_c656b7609377b1f324e90a42a507ff963d1f9eed.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_0af09200edb6c24ba563e2d1f61344c220ddc298.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_c0d3987103f1bdd4542558571be5a455147ace3c.1920x1080.jpg?t=1611957419,https://cdn.akamai.steamstatic.com/steam/apps/377360/ss_3c12f2bd9933d86eebf6e0a726cadb18d9856dcb.1920x1080.jpg?t=1611957419",
    "Slug": "western-press",
    "Meta Title": "Western Press: Apr 21, 2016, Bandit-1 and Full Overview",
    "Meta Description": "Looking for information on Western Press? Check out the release date (Apr 21, 2016), developer insights from Bandit-1, and a complete game summary.",
    "Alt Text Image": "Official header image for Western Press game - Steam 377360",
    "Canonical URL": "https://gusku.site/game/western-press",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Western Press\", \"description\": \"Looking for information on Western Press? Check out the release date (Apr 21, 2016), developer insights from Bandit-1, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bandit-1\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Surprise Attack\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/377360/header.jpg?t=1611957419\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}