{
    "AppID": 1359090,
    "Name": "Zero Hour",
    "Release date": "Aug 12, 2020",
    "About the game": "A tactical FPS with online team-based action game play that takes place in a variety of locations in Bangladesh with Real-life scale &amp; resource management. Inspired by various other tactical shooter games, Zero Hour tries to bring a very grounded CO-OP and Team vs Team experience in locations with real-life scale (no video game scale) and resource management. In multiplayer, both sides are tasked to wipe out the other team and complete objectives. The defenders are tasked to protect the bomb from being defused and keep their hostage from being rescued and running away. On the contrary, the attackers are to defuse the bomb or rescue the hostage held captive. In the CO-OP mode, based on the map you decide to play in, will have several objectives that will need to be completed in order to call for extraction. TACTICAL GAMEPLAY Zero Hour brings a very grounded CO-OP, 5v5, team vs team, Close quarter combat experience to the game that focuses on two teams with each player having their own roles. The attackers utilizing shields, weapons and the planning table and the terrorists utilizing traps and gadgets in order to fortify the area. With CO-OP game mode will allow you to play bigger operations that you can either tackle solo or with a team of 5. The game mode will have a difficulty level of 'Regular' or 'Hardcore'. The difficulty level will determine the reaction time and predictability of the enemies. The game mode will not prioritize killing all enemies and will allow stealthy approach to complete objectives. You will be able to arrest the enemies if in the right scenarios. You will also need to collect evidence, such as dropped guns from the enemy. CO-OP The CO-OP mode is a new installment we added where players can play to achieve the experience of SWAT units. This game mode will allow you to play bigger operations that you can either tackle solo or with a team of up to 5. With each operation, you are tasked to complete objectives such as bringing order to chaos. There are more objectives such as rescuing multiple hostages, arresting or neutralizing specific suspects and more which are being added down the line. Suspects may or may not have patrolling routes that are random every session and can interact with the environment to give it a challenge. They can hide under beds, tables and inside closets. They are also capable of taking a hostage and use them as a shield, making it harder for you to engage. Suspects can also surrender based on a few criteria; If a suspect is outnumbered from behind they will always surrender and if you are one on one with a suspect, based on the suspect's fear level, they may or may not surrender. PLANNING TABLE At the start of each round, MS-09 Unit (The Attacking Team) can come up with strategies by drawing in the planning table with a 3D miniature version of the location being played similar to the use of blueprints. It can be used to direct teammates where to spawn and/or advance from. There are 3 types of marker that you can place around the planning table which can indicate danger and objectives. During this phase, The Terrorists (The Defending Team) will be given time to place traps and gadgets to aid in their defense strategy. RESOURCE MANAGEMENT Both Teams have resources that they need to manage per 3 rounds. The Attacking Team has 2 sets of 7 types of weapons while The Defending Team has 5 sets of 5 types of gadgets. This is crucial in terms of saving your resources, picking up and utilizing your opponent’s weapons, and not giving an advantage to your enemies HOSTAGE The hostage held captive by the defenders will have its own mindset which means it would run away if not careful. This indicates that it would be critical to keep an eye on the hostage and move it around wherever a player feels necessary. DOORS In order to bring a realistic approach, the doors help in encouraging slow and tactical gameplay. It would cause both teams to hesitate before entering a room since it will be oblivious to know what’s going on behind the door. BREAKER SWITCH The switch causes a complete blackout of the whole operation building that you're playing on. By doing this, the players won’t be able to visualize their surroundings unless they use the tactical flashlight.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1359090/header.jpg?t=1653321642",
    "Price": 11.99,
    "Developers": "M7 Productions,Attrito",
    "Publishers": "Attrito,M7 Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_6da61695e7d6bfaf4a213f19b93c19f0549b1f6d.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_e3753972cdc6756ef7fc0c477922dfad7d338106.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_124a9391060753f776f14a27ad3b7fb06c9093f1.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_91f60dc26faa9396152709bbf6fd7fccdf1e5f5f.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_1e59586e349b6ec092a98ee0d032d92822989341.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_0daa437e2aea649bd3e5d9aa650f9517686ffaf8.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_8b727a0fae4928603e3d822c35dcdd6ea63058aa.1920x1080.jpg?t=1653321642,https://cdn.akamai.steamstatic.com/steam/apps/1359090/ss_15a83c672c4184442239275bd68f537664c37829.1920x1080.jpg?t=1653321642",
    "Slug": "zero-hour",
    "Meta Title": "Zero Hour: Aug 12, 2020, M7 Productions,Attrito and Full ...",
    "Meta Description": "Looking for information on Zero Hour? Check out the release date (Aug 12, 2020), developer insights from M7 Productions,Attrito, and a complete game sum...",
    "Alt Text Image": "Official header image for Zero Hour game - Steam 1359090",
    "Canonical URL": "https://gusku.site/game/zero-hour",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zero Hour\", \"description\": \"Looking for information on Zero Hour? Check out the release date (Aug 12, 2020), developer insights from M7 Productions,Attrito, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 12, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"M7 Productions,Attrito\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Attrito,M7 Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1359090/header.jpg?t=1653321642\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}