{
    "AppID": 956500,
    "Name": "Bow to Blood: Last Captain Standing",
    "Release date": "Apr 2, 2019",
    "About the game": "In Bow to Blood you will compete to become Champion of the Arena, as its inscrutable Overseers test you and your fellow challengers in a winner-takes-all reality show. TAKE COMMAND Stand at the bridge of your mighty airship, pilot your vessel and fire your cannons. A wide variety of opponents will keep you busy as you employ split-second tactics to stay on top of each new situation. Your ship also comes equipped with an array of powerful weapons, each with their own specialty. Order your crew between various stations to strategize and customize your ship's strengths for every situation. When assigned to a station, your crew can use their expertise to push it beyond its normal operating capabilities. Shields provide an extra layer of protection, the turret gives you another gunner, drone control unleashes powerful automatons that menace your opponents, engines provide a significant speed boost, and sensors highlight valuable items in the world and jam incoming projectiles. Use your command console to route power between ship systems to charge and activate critical abilities, or overcharge a system for a massive short-term boost! Pull out your trusty sidearm when things get up close and personal! Repel enemy boarding parties to prevent vital components from being disabled. FORGE ALLIANCES AND PLOT BETRAYALS Your AI rivals in Bow to Blood have their own motivations, objectives, and personalities. Assist your fellow challengers and gain their support, or exploit them for personal gain and earn their enmity. The choice is yours, but choose wisely – challengers will remember how you have treated them, and in the Arena, grudges die hard. At the end of each match you’ll need enough friends to avoid getting voted off the season! Make sure someone always has your back, or earn enough points to go it alone. When it comes down to the vote, how confident are you that your allies will follow through for you? EVERY PLAYTHROUGH IS UNIQUE Randomized encounters and a rotating cast ensure that no two experiences will be the same. Play over and over again to discover new environments, opponents, and challenges. Bow to Blood also offers a 'hard' difficulty mode with all new opponents and greater risks if you crave the challenge! EARN SPONSORSHIPS AND REWARDS Impress fans, overseers, or other captains to earn sponsorships that upgrade the capabilities of your ship. Complete challenges to gain rewards that fill your private quarters. virtual reality headset NOT required to play.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/956500/header.jpg?t=1641524981",
    "Price": 0.0,
    "Developers": "Tribetoy",
    "Publishers": "Tribetoy",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/956500/ss_2ede00c760f6ef18b575a9bed9a7af0f8967a2bb.1920x1080.jpg?t=1641524981,https://cdn.akamai.steamstatic.com/steam/apps/956500/ss_577fd876803f22d93ef1d7c88f6a074383e33ad9.1920x1080.jpg?t=1641524981,https://cdn.akamai.steamstatic.com/steam/apps/956500/ss_b48e151227ec7bffcd33d05b3677acb5f021a828.1920x1080.jpg?t=1641524981,https://cdn.akamai.steamstatic.com/steam/apps/956500/ss_1553c26e5216c895dbaa1a87410409a00545666c.1920x1080.jpg?t=1641524981,https://cdn.akamai.steamstatic.com/steam/apps/956500/ss_b3ec3e51c885ff59a05193cb1d98c59684e6d90e.1920x1080.jpg?t=1641524981,https://cdn.akamai.steamstatic.com/steam/apps/956500/ss_804990d406a0592ba4ac71b81ef233fddd66a598.1920x1080.jpg?t=1641524981",
    "Slug": "bow-to-blood-last-captain-standing",
    "Meta Title": "Bow to Blood: Last Captain Standing: Apr 2, 2019, Tribeto...",
    "Meta Description": "Looking for information on Bow to Blood: Last Captain Standing? Check out the release date (Apr 2, 2019), developer insights from Tribetoy, and a comple...",
    "Alt Text Image": "Official header image for Bow to Blood: Last Captain Standing game - Steam 956500",
    "Canonical URL": "https://gusku.site/game/bow-to-blood-last-captain-standing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bow to Blood: Last Captain Standing\", \"description\": \"Looking for information on Bow to Blood: Last Captain Standing? Check out the release date (Apr 2, 2019), developer insights from Tribetoy, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 2, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Tribetoy\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Tribetoy\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/956500/header.jpg?t=1641524981\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}