{
    "AppID": 631950,
    "Name": "Caelum: Into the Sky",
    "Release date": "Jun 8, 2017",
    "About the game": "Follow us on Twitter @DigitalRealmsVR and join the conversation! About the devs: We are a small team of students/graduates all on the course Games Art and Design at Norwich University of the Arts (UK). The game was originally a University project that focused on independent development. Even though the original concept was a common baby, the first level and the mechanics had to be produced by me, Adam, as it was my final project. I graduated from NUA with Caelum's first level, including models and mechanics as the final project. I received Vice-Chancellor's commendation and Caelum has been picked for 'Best of NUA' Exhibition in Norwich(UK). Ben, my friend from way back, has helped with the initial concept, and now, as his third year University practice joins me in the development of Caelum. We both have a fair amount of digital art experience behind us and a lot of passion to push us forward! We hope to carry on with quality content that all of you can enjoy! Please be patient, as this is a part time thing (while it doesn't pay for the rent) for both of us. About the game: Caelum is a world of many wonders and treasures, in development for the HTC Vive. It has fallen to pieces hundreds of years ago, but the people learnt to adapt to the new order and life continues in this fascinating realm. You will be exploring magnificent ruins of the past to find Borri’s hidden notes and acquire a Philosopher’s stone yourself. This journey will be full of dangers and intricate puzzles that hide secrets of Alchemy and the history of Caelum. You will discover hidden secrets, solve puzzles and explore this broken world. There will be times when we challenge your perception, others when it all comes down to the knowledge of the natural world and the mystical practices of Alchemy. This world holds many secrets, and some have been unearthed by the events of the past. You as a scavenger hunt these treasures and find a living in doing so. Some are hidden behind massive doors some behind riddles and puzzles, it is up to you to find your way and snatch up the glory and wealth. On your journey you find this island that looks like a sort of monastery, these places are always promising great loot. You head in to find what is inside those stone walls, but it is nothing you ever imagined. This is one of Francesco Borri’s secret laboratories, hidden from sight and from the Inquisition. Alchemy was his trade and he was hunted for it…but it’s not just any kind of alchemy, he has found the way to create the Philosopher’s stone, a source of eternal life!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/631950/header.jpg?t=1503495572",
    "Price": 4.99,
    "Developers": "Digital Realms Ltd",
    "Publishers": "Digital Realms Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/631950/ss_5e105a0eb1a169a0fc16bbbdddaccbd7286de23a.1920x1080.jpg?t=1503495572,https://cdn.akamai.steamstatic.com/steam/apps/631950/ss_b9de2f4c134096ac4d06adc4cc45addfddaae87b.1920x1080.jpg?t=1503495572,https://cdn.akamai.steamstatic.com/steam/apps/631950/ss_e92f8f0eddc391169eee0f82164fdcb8130e9678.1920x1080.jpg?t=1503495572,https://cdn.akamai.steamstatic.com/steam/apps/631950/ss_1eb00601b99218a5ccc65080a4b21831aa97e65b.1920x1080.jpg?t=1503495572,https://cdn.akamai.steamstatic.com/steam/apps/631950/ss_f69e92516c845dc653cd3864456816529354e6ce.1920x1080.jpg?t=1503495572",
    "Slug": "caelum-into-the-sky",
    "Meta Title": "Caelum: Into the Sky: Jun 8, 2017, Digital Realms Ltd and...",
    "Meta Description": "Looking for information on Caelum: Into the Sky? Check out the release date (Jun 8, 2017), developer insights from Digital Realms Ltd, and a complete ga...",
    "Alt Text Image": "Official header image for Caelum: Into the Sky game - Steam 631950",
    "Canonical URL": "https://gusku.site/game/caelum-into-the-sky",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Caelum: Into the Sky\", \"description\": \"Looking for information on Caelum: Into the Sky? Check out the release date (Jun 8, 2017), developer insights from Digital Realms Ltd, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 8, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Digital Realms Ltd\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Digital Realms Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/631950/header.jpg?t=1503495572\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}