{
    "AppID": 1994680,
    "Name": "Cazzarion: Demon Hunting",
    "Release date": "Jun 9, 2022",
    "About the game": "Mysterious incidents were reported in abandoned locations. The Gate of Hell has been opened and demons are troubling here. Ram Ganger, special agent of WOM, arrive to send the brood of evil back to hell. You landed in the middle of the Demons Apocalypse, try to stay alive as long as possible. The good news: You don't have to crawl into hell to fight the demons, the demons come to you in places such as the Chateau, Palace, Pandora, Laketown, abandoned castles, etc. The usual dark caves and tombs are of course also present. The bad news: You can't win, you'll die. Death is certain for you. You cannot win in this game, the game will beat you. This game is like life, it ends with death. Don't look for the demons, the demons will search and find you. Search for ammunition to stay alive as long as possible. Use the weapons properly: Strong weapons for strong demons, flamethrowers for flying demons, etc. Move through the map and collect ammunition and extra lives. You start with a limited number of lives and ammunition. Ammunition and extra lives are spawned after some time. With every minute you survive, the game becomes more difficult, every minute more demons attack you and you find less ammunition and extra life every minute. Once all your lives are exhausted, the battle for survival is over for you. You can win Steam Achievements on each map: Bronze if you survive 10 minutes, silver if you survive 20 minutes. The best of the best win gold after 30 minutes. Furthermore, 3 dragon eggs are hidden in each map. There is an Steam Achievement for every dragon egg you find. There are 60 Steam achievements in total. REMARK: The Achievements are not available in game mode (Difficulty) easy. If you wish to use the controller, then you need to enable 'USE GAMECONTROLLER' in the SETTINGS/CONTROLS Menue. HINT: Internal testing on Steam Deck done: The game runs on the Steam deck using the controller sticks and buttons, but the 'P' key need to be mapped to the Steam Deck 'view' button. However, the menus have to be operated with the mouse or with the touchpad. On the Steam Deck you need to enable 'USE GAMECONTROLLER' in the SETTINGS/CONTROLS Menue. Pros: - Runs on Steam Deck - 10 Maps - Sexy vampire women who kill you - Zombie granny on Ecstasy - Tranfeminine, lesbian werepig - Funny splatter, dismemberments and physics effects - Special weapons for exorcising demons: Multi Rocket launcher and Flamethrower Boomshot for short distance splatter and dismemberment. The Reaper do this job on the long distance. With the Desouler you shoot the souls out of the demons. - Demons of Color: Green lizards and green weresnakes. Blue-grey weresharks and multicoloured insectoids, rose werepigs, brown werewolves and flesh colored, naked vampires. Reddish-brown fire-breathing dragons. Grey decayed zombie Grandmothers with pitchfork. Lava colored exploding devils. - No lengthy tutorials necessary: ​​choose your weapon and start shooting ('Roarrr....BOOM') - An average of 15 kills per minute - 21:9 Screen support - 60 Steam Archivements - Difficulty level Easy available (in the Settings) - Partial Xbox One controller support Cons: - No 'Heroes of Color' no 'Female/Diversity Heros' - The hero is a toxic white old man - No keyboard remapping - No brightness adjustment - No FOV slider - No Windowed mode - No mouse sensitivy adjustment - Exploding, small, suicide lava devils that annoy you (this devils are a disease!) - Steam DRM Who is the game suitable for: - For people who like challenging Steam achievements - For people who don't have time to waste in any tutorials and weapon lessons/instructions - For people who just want to shoot down demons/monsters ('Groarrr.....BOOOOOM') - For people who like to shoot around with 'Boom-Splatter' weapons - For people who can do without a story - For people who like shooting games Who is the game NOT suitable for: - For people who want to play 'Heroes of Color' and 'Female/Diversity Heros'. - For people who don't want to play a toxic white old man as a hero - For people who can't see blood - For people who are afraid of the dark and easily startled - For people who don't like shooting games IMPORTANT REMARKS: - If the game is to hard for you the first time, then try Difficulty level Easy first (available in the Settings Menue) - Only Xbox Controller and Xbox compatible Controller are supported !! - For the Menue the Mouse is required - If you wish to use the Xbox Controller you need to enable 'USE GAMECONTROLLER' in the SETTINGS/CONTROLS Menue. Also on the Steam Deck you need to enable 'USE GAMECONTROLLER' - 'REVERSE Y-AXIS' in the SETTINGS/CONTROLS Menue is used for Mouse and Game Controller",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1994680/header.jpg?t=1656499016",
    "Price": 5.99,
    "Developers": "Zarpazo",
    "Publishers": "Zarpazo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_564289de01b05a80c6e5466f59e226691080b181.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_af89427b583b9ef4da5f78084395528cb357d826.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_a9fb142ac567d3b9aa1a616745760fe9bdf8eee6.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_e32bcf515c60b64263c032533e630ac5150dead9.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_bafee2831d96b530f549db0ec9920e268a7b354e.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_9cd6180a8aa8aaf3624955a167bd90c47ef88827.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_4662e59e04a32c52475745f94d36265f9612b50f.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_fe9379f7dcfb85be7e41917470b1b070ec20ec5b.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_04becc47a46b159d5791c28913f52f522765369f.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_93711cd6311a3deaf028adb140e4e01c7af01f9f.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_6675304dc3876654a51f1c1d2becc6e74a97e7da.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_e431b0db0ff44ebae02408af1ec83e2969d898da.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_393fa3f53ae332354d98ab922acaf8af3bbd433f.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_fa045aa14575aef791b75e448da53efa4ed5fa89.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_237056a1f1bb5060677107b0125a1bb4b9b848b0.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_26bf64ad55e8bbf5bbf827750409a819cb72c8af.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_710a736f5850fe6528cdcc49bf8159a79dd171f8.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_727cf4855f228485b564fb9bf13ffa15ba2885fb.1920x1080.jpg?t=1656499016,https://cdn.akamai.steamstatic.com/steam/apps/1994680/ss_ec81865c1a8cf14725ac09b219e521a3c36b5e21.1920x1080.jpg?t=1656499016",
    "Slug": "cazzarion-demon-hunting",
    "Meta Title": "Cazzarion: Demon Hunting: Jun 9, 2022, Zarpazo and Full O...",
    "Meta Description": "Looking for information on Cazzarion: Demon Hunting? Check out the release date (Jun 9, 2022), developer insights from Zarpazo, and a complete game summ...",
    "Alt Text Image": "Official header image for Cazzarion: Demon Hunting game - Steam 1994680",
    "Canonical URL": "https://gusku.site/game/cazzarion-demon-hunting",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cazzarion: Demon Hunting\", \"description\": \"Looking for information on Cazzarion: Demon Hunting? Check out the release date (Jun 9, 2022), developer insights from Zarpazo, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zarpazo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zarpazo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1994680/header.jpg?t=1656499016\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}