{
    "AppID": 619620,
    "Name": "Cellz",
    "Release date": "Oct 31, 2017",
    "About the game": "Take place in the weirdest game to ever occur! Take the role of a virus which invades the human body one organ at a time. Your goal is to completely eradicate the immune system by using your dexterity, logic, weapons, skills and friends! Here, in Quebec (Canada), there is an awesome foundation named 'Opération Enfant Soleil' that raises funds for the development of high-quality paediatrics for all sick children in Quebec. As a father of a wonderful 3 years old girl, I deeply feel concerned about helping other families that can't have the same life style as we do... So let's give them 10% of all Cellz profits! Important notes! If you want to record the game play in a 'Let's Play' kind of video, I would personally prefer that you wait a couple of updates so it can really be a fun game to watch. Note that I will start a 'Youtuber Helper' program soon! The Adventure mode is not implemented yet and consider that this game is only created by one person (me - Hello! :D ). I am planning to work on it till 2020 (I also consider hiring employees to help me if needed) and also notice that this is my first experience on Steamworks and everything around it. The game is buggy, full of glitches and is very small by now, but it has a very promising future in which you can play an important role. Cellz is going to be developed with the help of Steam's community. Filling forms, detecting bugs and glitches, sharing ideas are some examples of the help you could give to Cellz. Cellz right now: By now, Cellz is a small independent, local multiplayer arcade game made in Quebec (si t'es Québecois, t'as pas l'choix de m'encourager! :D) using Unity3D. Challenge up to 3 of your friends in different arenas in this unique and colorful experience and be the very best invader! This game may not be fully representative of the human defense system behaviors, but is still based on it. To this day, there are 7 mutations and over 25 abilities to choose from which really changes the game experience and allow you to discover something new about your cell, or the game itself! There are 4 different types of enemies and 4 different types of elements and there are a couple of modes and arenas. Steam Overlay is actually working and Steam success are coming very soon (as soon as I managed how to do it...). Cellz in the future: Each update, you will be asked to fill a form planned to help me define what system I should implement in the game. For instance, if the majority of the community says: More multiplayer modes, I will work on that and it will be implemented in the following update! I want to add: Steam Integration (the more functionalities as possible), online multiplayer with plenty of modes (Versus, Teams, Coop, etc), level builder, huge adventure, puzzles, more weapons &amp; abilities, different game modes (Arenas, Races, Puzzles, Battles, etc), skins and hats !... Or not :P As soon as I will be able to test it on different OS, I will distribute it for Linux and Mac. About Minor Updates: The minor updates consists of bug fixes and glitches corrections. They may add some little things in the game, but are really conceived to enhance mechanics, performance and appearance. They will mostly appear every 2 weeks. About Major Updates: The major updates integrates new systems and modes in the game (they also fixes glitches and bugs). They come at a slower rate and their arrival dates are undetermined, but they really worth it! **Each major updates could increase the game price. So buy it now while it is at his cheapest price! **",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/619620/header.jpg?t=1509471958",
    "Price": 4.99,
    "Developers": "MGP",
    "Publishers": "MGP",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_32701d8f4b55371481963180dd3e19137785e48e.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_5f2955a5c95b3106dea14facc0dfc93ebf976ba4.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_13d78f3629f6fb0867652696e43f57811487f83a.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_9eddc2a714155208ea246fd4f5e9626999c83f9b.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_1a0d7758ed5bd2ed017e5ccef16e9f1c8d6c22d5.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_2d61c7c5515820275f691642490a10fb62792f69.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_44efc71ba9973ca2cad8140081fde341b22c4118.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_37add2339b5a6afa23b9461b46bbec5ecafcc530.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_733d581e6d4527f24183e0d3c0bdfe5463c2dc5f.1920x1080.jpg?t=1509471958,https://cdn.akamai.steamstatic.com/steam/apps/619620/ss_764e99ffaea5e1ec9845194f96a15dca90d29a7d.1920x1080.jpg?t=1509471958",
    "Slug": "cellz",
    "Meta Title": "Cellz: Oct 31, 2017, MGP and Full Overview",
    "Meta Description": "Looking for information on Cellz? Check out the release date (Oct 31, 2017), developer insights from MGP, and a complete game summary.",
    "Alt Text Image": "Official header image for Cellz game - Steam 619620",
    "Canonical URL": "https://gusku.site/game/cellz",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cellz\", \"description\": \"Looking for information on Cellz? Check out the release date (Oct 31, 2017), developer insights from MGP, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"MGP\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MGP\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/619620/header.jpg?t=1509471958\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}