{
    "AppID": 630870,
    "Name": "Chuusotsu! 1st Graduation: Time After Time",
    "Release date": "Apr 24, 2018",
    "About the game": "Chuusotsu! is a fun, colorful visual novel telling the story of three girls brought by their individual circumstances to live under the same roof and being forced to tackle existential questions to win their place in society. Fruitbat Factory is bringing Chuusotsu! to fans all over the world in dual language (English and Japanese text, characters fully voiced in Japanese). Story Under the P3 law enacted under the Global People's Federation, citizens are ranked according to the Authorization Seals issued by the world government. As spring arrives, the manga lover Marisugawa Arue, set back by a long-lasting illness, finds herself having to live her life as a 'chuusotsu' - a person with no education beyond middle school. The chuusotsu are not in possession of any Seals, and are considered to be failures at life. As such, their Authorized Power level is only 5 - young Arue's future is already looking mighty bleak. 'How will I be able to accomplish my goals now...' In order to break free of her grim situation, and reach her true goal in life, Arue applies for a government relief program where she will... Share a room with other chuusotsu!? Her two roommates are overwhelmingly unique: a taciturn girl in a souvenir jacket and a crazy chuuni girl. And then the three girls are given group challenges to clear. What makes a wonderful life? Synchronize your minds and philosophize on this proposition. 'There's no way incompetents like us can do philosophy...' Their time is limited, and failure means that they will immediately get kicked out of the apartment! Will Arue manage to successfully complete the philosophical challenges and achieve a happy, steady-going life...!? This is a philosophical story of how the three girls considered lame ducks by the society spend their unusual youth in a world where Authorization Seals decide the lives of all people. Characters Marisugawa Arue (Voice: Takeda Eruru) The protagonist. A manga lover with delicate health. Arue’s mental fortitude is also on the weak side, and because of those issues, her academic performance was so poor that she has ended up a chuusotsu (a person with no education beyond middle school). However, although she was a shy, fragile girl back in middle school, Arue has now leveled up into a blunt riposte machine. She has signed up for the room sharing program with extraordinary enthusiasm for the sake of getting the strongest job of 'Government Employee.' That's why she gets super passionate toward, and aggressively tackles the challenges she faces, whose failure would get her kicked out of the apartment. Arue’s really crazy about manga. She cannot and will not stop reading it. Favorite Drawing Pens: Cobac, Multi-Line 'You have got to be more serious! Don't you understand that if we get kicked out of here we're going to be just ordinary unemployed 15-year-old girls!?' Hachisuka Koiro (Voice: Inukai Ao) One of Arue's roomates, who made her first contact with her in a love hotel street. Wearing a rabbit-printed jacket as her trademark, she was well known as 'Beachside White Rabbit' back in her hometown. Having left home and quitting her role as the strongest gang leader, she has become just another chuusotsu. Although her being taciturn and great at fighting scares people off, on the inside she is actually a good girl who is pure and airheaded. Koiro is an ally of justice, and takes a firm stance against all sorts of immorality. She is starving practically all the time. You can't fight on an empty stomach. Favorite Food: Rice (any brand) '...Salted rice tastes good, you know?' Fujisaki Arara (Voice: Ohyama Chiroru) A crazy little girl who is embarrassing to be around. Ever since her childhood, all Arara has been doing is yelling out that she will defeat what she calls 'The Ruler of the World,' which steadily led her up the stairs to becoming a chuusotsu. She is the kind of girl who talks to a stuffed animal tied up to her arm. Arara only learns the things that interest her, and often does not know about commonplace things. She's also a picky eater and hence, as you can see, is flat as a board. Favorite Celebrity: J. Inagawa 'That steel tower is the source of the Poison Pulse, Arara detects.' Kokoro (Voice: Amakawa Milk) The neighbor. She is a poker-faced little girl. Kokoro looks and acts childish, but is always alone. Whether it's because of her doggy hoodie or not, Kokoro's sense of smell is quite sharp. She starts her sentences with 'completely' and ends them with interrogatives.   Her treasure is a tiny glass ball. She is a canned coffee lover. Favorite Canned Coffee: Boos 'I completely want to do something for you in return, okay?' Holo (Voice: Inuoka Yamato) A hologram interface developed by QUOLIC Co., Ltd. You can summon her from the mysterious machine known as 'Soul Dispenser.' She thinks and acts just like an air-headed large-busted blonde straight out of an American stereotype. Despite being an autonomous AI, she is not autonomous in the slightest. Her job is to be the adviser to the three girls. Favorite Car: Bummer H2 'Check and promise! Holo is here!'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/630870/header.jpg?t=1645781410",
    "Price": 9.99,
    "Developers": "Studio Beast",
    "Publishers": "Fruitbat Factory",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/630870/ss_2ce6c4576316bf809ae0e4c03c16fe5bb7bf420b.1920x1080.jpg?t=1645781410,https://cdn.akamai.steamstatic.com/steam/apps/630870/ss_6134f5e1d658febca75e4371cccaafb54dc65ffa.1920x1080.jpg?t=1645781410,https://cdn.akamai.steamstatic.com/steam/apps/630870/ss_e072f2016382529a550e6ba73fff493634c31d50.1920x1080.jpg?t=1645781410,https://cdn.akamai.steamstatic.com/steam/apps/630870/ss_a658146c4fa7b9436c5ea1b295f1d7653107fcab.1920x1080.jpg?t=1645781410,https://cdn.akamai.steamstatic.com/steam/apps/630870/ss_a5a0f510424c51d8bb92c6405f96754c69af380a.1920x1080.jpg?t=1645781410",
    "Slug": "chuusotsu-1st-graduation-time-after-time",
    "Meta Title": "Chuusotsu! 1st Graduation: Time After Time: Apr 24, 2018,...",
    "Meta Description": "Looking for information on Chuusotsu! 1st Graduation: Time After Time? Check out the release date (Apr 24, 2018), developer insights from Studio Beast, ...",
    "Alt Text Image": "Official header image for Chuusotsu! 1st Graduation: Time After Time game - Steam 630870",
    "Canonical URL": "https://gusku.site/game/chuusotsu-1st-graduation-time-after-time",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Chuusotsu! 1st Graduation: Time After Time\", \"description\": \"Looking for information on Chuusotsu! 1st Graduation: Time After Time? Check out the release date (Apr 24, 2018), developer insights from Studio Beast, ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 24, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Studio Beast\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fruitbat Factory\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/630870/header.jpg?t=1645781410\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}