{
    "AppID": 614130,
    "Name": "Command: Chains of War",
    "Release date": "May 18, 2017",
    "About the game": "PACIFIC WATERS RUN RED 20 minutes into the future, a spark erupts in the Korean peninsula that will lead to a theaterwide conflagration embroiling the entire Western Pacific and drag all major powers into it. With nothing less at stake than control over the world's busiest trade routes and containment of the emergent superpower, the Pacific becomes the world's stage - and the players are getting down to brass tacks, for this is the game that no side can afford to lose. The geopolitical nightmares of the new century: The creators of the award-winning 'Northern Inferno' shift their gaze from the Atlantic to the Pacific and bring into focus the challenges of the early 21st century: The ever-present tensions between North and South Korea reach a boiling point, while China and the US vie for control of the strategic choke points and bases through which the world's commerce functions. Will the US maintain its strategic pre-eminence in the most important world theater or will China complete its ascend to superpower status? The new gears of war: Think the new war in the Pacific will be just like the 1940s but with better bullets? Think again! All-new systems and technologies radically change the face of modern high-level conflict. Network and cyber attacks pull apart carefully constructed communications networks, leaving forces in the field blind and separated from their consorts. Electromagnetic pulses delivered from high-altitude nuclear detonations or tactical EMP weapons fry vulnerable electronics, disarming powerful units in a split-second. Massive anti-ship ballistic missiles threaten to turn aircraft carriers into sinking, burning hulks. Railguns deliver accurate, punishing fire at long ranges, challenging the post-WW2 reign of guided missiles. Anti-satellite weapons disrupt the critical communications &amp; intelligence nodes orbiting high in the stars. High-energy lasers burn their targets with intense beams invisible to the naked eye. Are you ready for the intricacies of 21st century war ? Chains of War is a new DLC release for Command: Modern Air/Naval Operations , the premier game of air &amp; naval combat and the Pentagon's hottest new simulation tool. Twelve campaign scenarios walk you through an erupting crisis in the western Pacific that threatens to bring chaos to world order, while an additional four bonus standalone scenarios take you back to hotspots in the past that did not lead to conflict - but could easily have. The Chains of War are rattling loose. The world is right to fear their tremble; for a new superpower war may prove to be mankind's last spectacle. FEATURES A standalone expansion for Command: Modern Air/Naval Operations. 12 thrilling campaign scenarios and 4 bonus standalone scenarios written by Mike Mykytyn, founding member of the CMANO development team. NEW! Communications disruption by network/cyber attack or any other arbitrary factor : Isolated units realistically limit their tactical awareness to only what they themselves can detect and engage, and are completely of their parent side's control. Say goodbye to Borg-view of the battlefield! NEW! Cargo, landing and airdrop operations. Load mobile forces on ships, aircraft and even submarines, and unload them on any suitable point on the battlefield. Platforms are realistically limited by volume, weight and crew on what they can transport. NEW! Comprehensive damage model for aircraft. Aircraft may be shot down outright or receive damage that will still allow them to limp back home. Different aircraft can absorb different punishment on their fuselage, cockpit and engines. Depending on the amount of damage received a plane may be 'mission killed' if its repairs take so long that it misses the fight. NEW! Advanced weapons for the new age of war . Tactical EMP weapons, railguns, high-energy lasers and more",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/614130/header.jpg?t=1573686866",
    "Price": 0.0,
    "Developers": "WarfareSims",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_1b3338abe764a292b659f77c827ee16bf81008b1.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_3e9ef41c3c2c912f9dd92dae125b855ca8169db2.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_ec58c2042dce050e05ba5318d99b2474fbff5004.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_6ba7cbed9ac33ac20f1291348f259c0df1e204c4.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_b8f7bc8ee2a6e68955b842744aeefb6b57533098.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_d7af0da22ca0a375b70b44febb969b9e6fb91ca6.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_c9abb833b2819ba570a2708980ba71e228a71719.1920x1080.jpg?t=1573686866,https://cdn.akamai.steamstatic.com/steam/apps/614130/ss_8148cff1f93beef2b6d04a254379a1c9154b7dba.1920x1080.jpg?t=1573686866",
    "Slug": "command-chains-of-war",
    "Meta Title": "Command: Chains of War: May 18, 2017, WarfareSims and Ful...",
    "Meta Description": "Looking for information on Command: Chains of War? Check out the release date (May 18, 2017), developer insights from WarfareSims, and a complete game s...",
    "Alt Text Image": "Official header image for Command: Chains of War game - Steam 614130",
    "Canonical URL": "https://gusku.site/game/command-chains-of-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Command: Chains of War\", \"description\": \"Looking for information on Command: Chains of War? Check out the release date (May 18, 2017), developer insights from WarfareSims, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"WarfareSims\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/614130/header.jpg?t=1573686866\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}