{
    "AppID": 785930,
    "Name": "Command: The Silent Service",
    "Release date": "Mar 1, 2018",
    "About the game": "'There are submarines, and then there are targets...' They are out there, in the vast expanse of the sea. You don't see them, and you're not supposed to; they reveal themselves only reluctantly, when in port or transiting a shallow passage. They've grown from an unsuccessful, almost laughable nuisance, to a practical weapon in fleet battles, to the scourge of seaborne transport lines, and ultimately to mobile undersea fortresses that can end life on the planet in less than 10 minutes. A junior branch compared to their centuries-old naval surface warfare counterparts, submarines have nevertheless seen and done it all, both in peacetime and wartime. And it takes a special kind of people to handle and operate them - for one, claustrophobics and fragile nerves need not apply. These people often share more in common with their direct adversaries from foreign, even hostile nations than with their comrades in the other services. Like their boats, they are discreet, persistent and deadly. They are submariners. They are The Silent Service. Undersea warfare from post-WW2 to the present: Explore the progression of submarine operations from the Korean War right up to today's headlines. Witness first-hand how technological advances like the snorkel, nuclear power, cruise and ballistic missiles, silencing measures and advanced sonars, computers and torpedoes have radically expanded both the remit and capabilities of the submarine platform - and how its hunters on the surface and in the air improved their own gear and tactics to keep up in the race. Stars and workhorses: Take charge of some of the most famous boats and classes of the post-war period - and some that you may have never heard of. USS Nautilus, the first-ever nuclear-powered submarine - and her counterparts beyond the Iron Curtain, the November-class. HMS Swiftsure, nemesis of the Soviet Northern Fleet in '77. USS Parche, the most highly decorated vessel in the US Navy. Sturgeon-, Los Angeles- and Seawolf-class, frontline of the US sub force from the 1960s to the late-00s. Soviet/Russian conventional and nuclear-powered attack subs, worthy adversaries of NATO during the Cold War and beyond. Giants of the deep like the carrier-killer Oscar-class and the ballistic missile-toting Delta-class. And much more... The busiest platform at sea: If you thought subs are only good for sinking ships and other subs, prepare to be amazed. Lay minefields right on the enemy's backyard with them being none the wiser. Launch carefully-plotted cruise missile attacks against defended land targets. Creep up to surface vessels close enough that you can take underwater hull and screw photos - and remain undetected. Detect and record sensitive electronic emissions, the ones that radar/comms operators dare activate only when they think nobody's around to sniff. Provide unseen escort to merchant ships in the middle of a crisis. Shower distant land targets with ballistic missiles armed with multiple nuclear warheads. Tap undersea communications cables in the worst moment of the Cold War. Covertly deliver special-operations teams ashore, or deploy swimmer delivery vehicles (SDVs) against capital ships to eliminate them out of the blue. And of course hunt down anything on the sea surface or underneath it, from miniscule patrol boats all the way to battleships, supercarriers and strategic missile submarines, using an array of torpedoes, missiles and other means. The depths are your domain - and your playground. The Silent Service is a standalone expansion for Command: Modern Air/Naval Operations, 2013's Digital Wargame of the Year: play as a single, separate game, or add it to your collection of scenarios for CMANO. Eighteen standalone scenarios, played either in ascending difficulty or chronological order, walk you through the nuances of modern submarine operations, in control of a wide range of submarine classes from both the East and West, in conditions ranging from peacetime to crisis to all-out war. Can you fill the shoes of the legends of The Silent Service? FEATURES: * A standalone expansion for Command: Modern Air/Naval Operations, 2013's Wargame of the Year: play as a single, separate game, or add it to your collection of scenarios for CMANO * 18 intense standalone scenarios written by Rory Noonan, CMANO community veteran: Each scenario is accompanied by era-authentic mission briefings placing you into the scene of action * A wide range of introductory tutorials, designed to teach you how to get into the game in an approachable and accessible way * Underwater warfare utilizing CMANO's award-winning simulation engine - with new wrinkles specific to the submarine domain",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/785930/header.jpg?t=1573687044",
    "Price": 0.0,
    "Developers": "WarfareSims",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_6e9f77eda754950cf35701dc174e18ce5a08543f.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_1757b122824e1c9d10e3519800dc3e9b927e0ba0.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_2c6f3d414134f23bf3fb361a0dd888b56158e676.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_403c7a6f45e6fc979c10030058bc2d4fe98e6184.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_f6630b8ffadf71e2b32f227c9c5e1736c0facdd9.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_a61c61f493eab27ab5354d159a654e2a414d0386.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_e3a99443d683f25257354b9d2b7b765a53cf0908.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_888e44aea07d2eabacdda8507f8225e54e1a0aa5.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_ec738868164df1d22e6adfb120d7960678bd2021.1920x1080.jpg?t=1573687044,https://cdn.akamai.steamstatic.com/steam/apps/785930/ss_f68766ecedc7a2d2698da58183d598e6f375c4ba.1920x1080.jpg?t=1573687044",
    "Slug": "command-the-silent-service",
    "Meta Title": "Command: The Silent Service: Mar 1, 2018, WarfareSims and...",
    "Meta Description": "Looking for information on Command: The Silent Service? Check out the release date (Mar 1, 2018), developer insights from WarfareSims, and a complete ga...",
    "Alt Text Image": "Official header image for Command: The Silent Service game - Steam 785930",
    "Canonical URL": "https://gusku.site/game/command-the-silent-service",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Command: The Silent Service\", \"description\": \"Looking for information on Command: The Silent Service? Check out the release date (Mar 1, 2018), developer insights from WarfareSims, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 1, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"WarfareSims\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/785930/header.jpg?t=1573687044\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}