{
    "AppID": 560920,
    "Name": "Cyberlink PowerDVD 17 Ultra",
    "Release date": "Apr 18, 2017",
    "About the game": "PowerDVD is the must-have companion for PCs and home entertainment systems. It’s packed with unique movie, music and photo features indispensable for creating an unbeatably immersive sight &amp; sound experience. And for people looking to create a cinema feel in their own homes, PowerDVD now has world-first technology essential to maximize the potential of your 4K and HDR TVs! TV Mode — Bring the Movies Home! The most natural, enjoyable movie experience you can have at home on your TV. Enjoy a cinema-quality movie experience from the comfort of your sofa with software that is optimized for big-screen displays. Experience Better-Than-Original Quality with TrueTheater® CyberLink's unique TrueTheater enhancements improve the quality of even Blu-ray and hi-def video, and the difference it makes to watching movies on your big screen TV has to be seen to be believed. TrueTheater HDR - Darker Darks, Richer Colors Creates HDR video from standard dynamic range content for better viewing on HDR displays. TrueTheater® Color Intelligently analyzes video footage and optimizes hues and vibrancy, creating a true-to-life viewing experience. TrueTheater® Sound Enjoy a richer, fuller audio environment by enhancing bass, vocal range, reverb and boosting volume. VR - The Future is Now Immerse Yourself in VR with support for Oculus Rift and HTC Vive headsets, PowerDVD is the must-have player for the next-generation in multimedia entertainment. Explore new worlds in 360° video and photos. New 3D-360 video support makes the whole experience feel even more real! Media Casting to Big Screen Stream directly from PowerDVD to your TV through leading media casting devices—Roku®, Apple TV® and Chromecast™. Pin YouTube Videos in High Quality PowerDVD is the best way to save videos from YouTube to your PC so you can watch them offline, or transfer them to your phone to save on data charges. You can even pin 4K and 360 videos!It's also a great way to add to your music collection – PowerDVD can rip audio tracks from any video and save them as music files! Cinema Quality Audio Playback For a truly immersive movie experience you need exceptional audio. PowerDVD supports master-quality sound technology from the leaders in professional digital audio—Dolby and DTS. Enjoy the acoustic difference of specialized multichannel audio and lossless audio formats such as FLAC and DSD. Hi-Res &amp; 3D Photo Slideshows Enjoy photo albums in beautiful high-resolution on your PC or TV just by selecting a folder or group of images and clicking “Play”.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/560920/header.jpg?t=1555952319",
    "Price": 0.0,
    "Developers": "CyberLink",
    "Publishers": "Koch Media",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_db7678bcd6e810c15504fb4cd21372fadf0f4aaa.1920x1080.jpg?t=1555952319,https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_d6cd1b7190996993b5f07ee4318e52607599b9a7.1920x1080.jpg?t=1555952319,https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_88ef5aafaa36d984485a3937a53da24a3186768c.1920x1080.jpg?t=1555952319,https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_9b81df58610ae3b299dfe778a30861d7f4050ed0.1920x1080.jpg?t=1555952319,https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_6a331ef7dd4691a7144587f55415924768096f4f.1920x1080.jpg?t=1555952319,https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_17794a05f16301ffc2ab6b26b2537fb0c93d891e.1920x1080.jpg?t=1555952319,https://cdn.akamai.steamstatic.com/steam/apps/560920/ss_835e345053e6d2a17ef6d9e3e83ab095c22ca5af.1920x1080.jpg?t=1555952319",
    "Slug": "cyberlink-powerdvd-17-ultra",
    "Meta Title": "Cyberlink PowerDVD 17 Ultra: Apr 18, 2017, CyberLink and ...",
    "Meta Description": "Looking for information on Cyberlink PowerDVD 17 Ultra? Check out the release date (Apr 18, 2017), developer insights from CyberLink, and a complete gam...",
    "Alt Text Image": "Official header image for Cyberlink PowerDVD 17 Ultra game - Steam 560920",
    "Canonical URL": "https://gusku.site/game/cyberlink-powerdvd-17-ultra",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Cyberlink PowerDVD 17 Ultra\", \"description\": \"Looking for information on Cyberlink PowerDVD 17 Ultra? Check out the release date (Apr 18, 2017), developer insights from CyberLink, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"CyberLink\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Koch Media\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/560920/header.jpg?t=1555952319\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}