{
    "AppID": 450020,
    "Name": "DAMAGE CONTROL",
    "Release date": "Apr 5, 2016",
    "About the game": "Control your squad of engineers and maintain your ship, and it's crew, until it reaches it's destination. Careful planning and timing will be required to place the right resource in the right place to tackle the dangers of deep space. The environment is brutal and unforgiving and sudden bloody death comes quickly to the slow and unwary! Only your team stand between your sturdy ship and it's faithful crew and certain death. Take command! Relentless Action The air is venting out of your craft, the lower decks are completely ablaze, and asteroids are pounding the hull to smithereens. It's nothing you can't handle! Grab your tools and get started! Full Campaign Mode Take control of your engineering corporation, earn funding by taking on jobs across the galaxy and use the funds to take over the competition! Tactics and Management Prioritize your tasks! Do you rescue the injured crew member? Or stop the fire on the next deck? Equip your engineers with the right tools for the job! Planning and Timing Your tools will run out of charge, and the ship has many paths to your objectives, where will you go first? In space no one can hear you.. The crew have reported strange noises coming from the air vents. Not to worry. I'm sure it's nothing. Hi every one! I'm Ross Edgar, the lead designer and developer of Damage Control. I've very proud of what we have created so far and I'm very excited to share it with you today. Damage Control is currently in an alpha state. To explain what we mean by that - it's playable (very), but it has some bugs, and not all the features are implemented. When all the features we want are in we will call it beta, and commence bug squashing. So.. whats currently in? Basic Menu screens and Options Basic Campaign Mode Basic Freeplay Mode 7 Basic Levels 5 Basic Damage Types and the tools to fix them : Hull, o2, Radiation, Fire and Crew Basic Music and Sound Effects Basic Particles and Lighting effects Basic Save/Load system .. when you write it like that it sounds un-impressive! But trust me, when you see it all running together it's a glorious, bombastic, hectic and violent chaos management game with lots of room to expand! Our immediate short-term goal is to get to just before beta stage, then get Greenlit (see?), then do an Early Access release. Why? We really want to get feedback on the current feature set and catch anything we missed before we freeze the feature set and commence beta development. Will we charge for the Early Access game? Yes we will. We need to keep the lights on and cover development costs like art and marketing, but it will be at a heavy discount from the full price as a thank you to everyone who buys the game. We are investigating adding users who contribute suggestions, bug reports and ideas to the game as NPC's or even playable characters. Watch this space! So what do we plan to add to the game before Early Access? More levels. The levels will be split into 'stages', you can only unlock a stage after completing the current stages levels to a particular standard. More on this later. More damage types. Collapsing superstructures, Gas Leaks, Loss of gravity, Electrical Damage are just some ideas we are throwing around right now. Campaign Cards. Cards, earned during the tactical phase, that you play during the strategy phases to confer bonuses and buffs. Level Hazards. We think that large, industrial spaceships would have lots of moving parts. We want to add crushing pistons and slicing lasers to the environment. Device Management I want you to manage your ship, not just stick it back together. We want you to insert fuel rods into the engines, activate shields and dump radioactive waste overboard! Alien. An alien monster is onboard! It will hunt throughout the ship and can only be scared off by the flamethrower. Think of it like the ghosts in pacman, except the ghost is a bloodthirsty monster. And the maze is on fire. Steam Achievements Steam Trading Cards European Language Support Full graphical options Full tutorial Phew. It's a large shopping list, but we think every one of these ideas adds more value to the current game and we cannot wait to see it in game and see players having fun (and complaining) about all of it! If you have any comments or questions I'd be pleased to respond to you directly, or via the comments page. Thank you for reading. Ross Edgar. Highland Gaming.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/450020/header.jpg?t=1462924100",
    "Price": 0.99,
    "Developers": "Ross Edgar",
    "Publishers": "Ross Edgar",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_c4b20083de83d52d556fe5206e643749191f6ddb.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_9582e095841fad0cae6a5efbd260ce8e4e556ecc.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_df21e30f1d10b36a71d4f1bc003c69f1c5512d7c.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_e07d554a32651e7a1233c15c747a6b24524d833e.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_4549b05bd3a16d755d51d0e5f5bb9390d049532c.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_9ea3a4f040fc1153682c8bb4b20d2be7d7f2450e.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_8d89fc5b56cdbe94a755e8a191edf8f67e95cd39.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_bae010dc6033177a5a61f88cbdb421878c61affd.1920x1080.jpg?t=1462924100,https://cdn.akamai.steamstatic.com/steam/apps/450020/ss_bd4e62fb19e1ac51723a3d696145e9eb73e14050.1920x1080.jpg?t=1462924100",
    "Slug": "damage-control",
    "Meta Title": "DAMAGE CONTROL: Apr 5, 2016, Ross Edgar and Full Overview",
    "Meta Description": "Looking for information on DAMAGE CONTROL? Check out the release date (Apr 5, 2016), developer insights from Ross Edgar, and a complete game summary.",
    "Alt Text Image": "Official header image for DAMAGE CONTROL game - Steam 450020",
    "Canonical URL": "https://gusku.site/game/damage-control",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DAMAGE CONTROL\", \"description\": \"Looking for information on DAMAGE CONTROL? Check out the release date (Apr 5, 2016), developer insights from Ross Edgar, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 5, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ross Edgar\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ross Edgar\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/450020/header.jpg?t=1462924100\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}