{
    "AppID": 1680050,
    "Name": "DarkFighter",
    "Release date": "Aug 9, 2021",
    "About the game": "Story Background This is a story about the adventures of the brave. The war of the gods in the past reduced the world to a demon world, and the continent was dominated by Hades. The brave man wakes up from his deep sleep and embarks on the way to find the gods and find himself. Game play This is a game with certain rogelike elements. The rogelike mode will be updated later. The game map is composed of small squares, through which we can explore unknown places. You may also encounter different monsters and random events. The round combat system adopted in the game takes breaking shield as the core. The monster has a layer of armor. The number of armor layers of the enemy can be broken by attack or magic. When the enemy's armor layer becomes 0, it is in the shield breaking state. In the shield breaking state, you will hit more damage. Diverse monsters There are abundant monsters and seven different styles of boss wars on the map. Each boss has a unique fighting mechanism and playing method. Of course, you can also pass level rolling or props To win the battle. In a powerful boss battle, the shield breaking mechanism is an important strategic means. You need to observe the enemy's shot and singing time, and reasonably allocate physical strength and magic value. Physical strength: used for power accumulation attack or magic. The attack command after power accumulation will hit multiple segments of damage. The magic command after power accumulation will hit higher damage. Magic value: when dealing with the boss, if the enemy is magic armor, you need to beat magic damage rhythmically to break the shield, but you should master yourself When your magic value is empty, you can fill your magic value back and forth through defense. Defense mechanism: when facing the enemy's powerful moves, you can defend. Defense will provide you with 50% damage reduction by default. Anger skill: attack or magic damage will accumulate anger value. When the anger value is full, you can use anger skill, which will be a full screen second kill skill. Random events Players will play a boy with amazing boxing skills in the game, constantly defeat the enemies in the game and kill hell on the way of exploration and round based combat. In the world view of this game, Hades, the king of the underworld, steps into the world with his army, and the player will play a role similar to the savior to defeat the enemy and save the world. The initial platform is added to the game. In the initial platform, you can have a rest, chat with women and play small games. (it is not open yet and will be updated later) At present, the game has only one regional mode, which supports few events and playing methods. More events will be updated later.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1680050/header.jpg?t=1651328861",
    "Price": 1.99,
    "Developers": "清泉工作室",
    "Publishers": "清泉工作室",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_ebd6696b3a68524e6d8c6cbb38db5db6939e68a2.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_bdf8be8e18867d401b0070d96ff8a7aaadf9a0bc.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_59b94eb52d789524d02ef84369754e1d71ee6145.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_5b4ce9d6beb0d5f81665dfa657824c2f5a17644a.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_2b56ff28bcf4201b5310e9ddc2329f11b40dbb27.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_6347fe2f9e9c7de7b55c2c4e0c9e53416e119602.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_45df76290f15528d6aab5eb7cd14172adc1932df.1920x1080.jpg?t=1651328861,https://cdn.akamai.steamstatic.com/steam/apps/1680050/ss_22ef0be910242e605b2ac152f5777dd7789b81b8.1920x1080.jpg?t=1651328861",
    "Slug": "darkfighter",
    "Meta Title": "DarkFighter: Aug 9, 2021, 清泉工作室 and Full Overview",
    "Meta Description": "Looking for information on DarkFighter? Check out the release date (Aug 9, 2021), developer insights from 清泉工作室, and a complete game summary.",
    "Alt Text Image": "Official header image for DarkFighter game - Steam 1680050",
    "Canonical URL": "https://gusku.site/game/darkfighter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DarkFighter\", \"description\": \"Looking for information on DarkFighter? Check out the release date (Aug 9, 2021), developer insights from \\u6e05\\u6cc9\\u5de5\\u4f5c\\u5ba4, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6e05\\u6cc9\\u5de5\\u4f5c\\u5ba4\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6e05\\u6cc9\\u5de5\\u4f5c\\u5ba4\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1680050/header.jpg?t=1651328861\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}