{
    "AppID": 1467560,
    "Name": "Desktop Panels",
    "Release date": "Jan 5, 2021",
    "About the game": "Desktop Panels - Display gifs and images on your desktop Desktop Panels is a small tool to easily display gifs and images on your desktop. For usage please visit the Desktop Panels Homepage (click on 'visit the website' on the shop page) Simple usage is explained below. Desktop Panels is making its way to become a productivity tool. Not only can you display gifs and images on your desktop, but also can enhance your entire desktop experience. There are a lot of ways Desktop Panels can be used - be creative. Current state and features: Moving and scaling by mouse actions Very simple UI and easy to use Mostly based on drag &amp; drop actions and mouse controls Works with common formats like GIF, PNG, BMP, and JPEG including transparency Transparent areas don't affect the OS Control opacity for all panels Control speed for animated panels Less CPU and RAM usage. (You can still play any game or do other stuff) Saving and loading of Configs Always-On-Top can be toggled for each panel Panels can be locked Panels can be set Click-Through Autostart and Offline Mode Hotkey options to quickly toggle the visibility and switch through Configs Simple usage - More advanced features will be available later in the UI Drag&amp;Drop your gif and image files into the main window to create a panel. Hold the left mouse button to move it. Hold the right mouse button and use the scroll wheel to resize it. Double-click to toggle the panel options (contains options for a panel). Triple-click or use the delete button in the Panel-Options to remove a panel. You can close the Desktop Panels window. It will minimize it to the tray. The UI can be opened again with a double-click on the tray icon. Right-click on the tray icon to open the menu. Here you can save and load your default configuration. The Autostart option is also toggled in the tray icon menu. Mode advanced features are available in the UI... Usecases Here are some scenarios of how Desktop Panels can be used: Have your favorite animated character on your Desktop. (of course) Watermark screenshots and recordings. Use icons and symbols to prototype UI Use images as a reference while drawing Using it as an image viewer (because the windows gallery app sucks and has a window) Using icons and shapes while presenting Panel-chan While developing Desktop Panels she came to life",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1467560/header.jpg?t=1650292200",
    "Price": 3.99,
    "Developers": "Knakra",
    "Publishers": "Knakra",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_c01fafe3910c958d51adda80ac8030cae0bf26a9.1920x1080.jpg?t=1650292200,https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_20c0b0c84d962ef55d2f0f2503b176d519b5f77f.1920x1080.jpg?t=1650292200,https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_00aa30b1051109e651a8fba89d855ca31b593cb9.1920x1080.jpg?t=1650292200,https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_f706af0bf64d3153ff3f08a278262487e8e24965.1920x1080.jpg?t=1650292200,https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_cb960d04c79a8a70c3f3a21fe2df9c8aacbfbacf.1920x1080.jpg?t=1650292200,https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_18dad805a17ea45438580e415c4755e3e4fcf4f6.1920x1080.jpg?t=1650292200,https://cdn.akamai.steamstatic.com/steam/apps/1467560/ss_d5c904b2ce2a87baa65cd554dc05135abbb0bc45.1920x1080.jpg?t=1650292200",
    "Slug": "desktop-panels",
    "Meta Title": "Desktop Panels: Jan 5, 2021, Knakra and Full Overview",
    "Meta Description": "Looking for information on Desktop Panels? Check out the release date (Jan 5, 2021), developer insights from Knakra, and a complete game summary.",
    "Alt Text Image": "Official header image for Desktop Panels game - Steam 1467560",
    "Canonical URL": "https://gusku.site/game/desktop-panels",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Desktop Panels\", \"description\": \"Looking for information on Desktop Panels? Check out the release date (Jan 5, 2021), developer insights from Knakra, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Knakra\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Knakra\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1467560/header.jpg?t=1650292200\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}