{
    "AppID": 952240,
    "Name": "Dieselpunk Wars",
    "Release date": "May 13, 2021",
    "About the game": "Dieselpunk Wars: Prologue is a free preview version of an epic vehicle building game. / Build magnificent machines from over 300 unique elements. Utilize various kinds of weapons, armor, engines, wheels, and propulsion systems. Take air drag into account since every element has an impact on a vehicle’s handling and its capabilities. Expand upon your vessel’s design to complete a mission or start over from a blank slate. Construct fighters, transporters, tanks, destroyers, or blimps and savor your creative freedom. Use different kinds of guns and plating to duke it out with hostile vehicles. Revel in the destruction caused by your weapons with fully simulated projectiles. Protect yourself with angled armor which might reflect enemy shots. Be careful not to overexert your engines or else they might catch on fire. Make good use of physics and rain destruction upon your enemies. Take pleasure in exploring a vast and interesting world filled with adventure. Face danger on the desert, in the mountains, and in the swamp. Launch a full-scale invasion and conquer entire islands. Delve into the world of a single-player campaign and onto an arena filled with enemies. Enjoy limitless freedom in sandbox mode. Go where combat is the most intense and take part in massive battles, unleashing your vehicle’s full potential. Learn the extent of your creations’ capabilities and face increasing challenges. Figure out your enemies’ battle plan and spot the weaknesses of their vessels. Fight alongside allies or solo. Features Advanced destruction simulation, vehicles can be cut in half. Projectiles with their own ballistics, penetration, and ricochet mechanics. Simulation of aerodynamics, buoyancy, fires, and flooding. Vehicles constructed from many different materials, paintable armors with various levels of thickness. Vehicles with various ranges of visibility and detection radii. New parts acquired by completing missions. Campaign mode with an interesting plot and lots of missions. Various unique biomes, visited as the campaign progresses. Level progression, ability to unlock new skills and use active powers. Battle mode where you can create custom battles between vehicles of your creation. Creative mode where you can build any vehicle you want. Integrated Steam workshop to share your creativity. Destruction The most important part of any ship is its core block, there can be only one of this type and its destruction will annihilate the whole vehicle. Every block must have a connection to the core. Each element has its own hit points, level of fire resistance, ability to resist impact and explosion. Some of them can also be flooded or lose their lift power. Every destroyed element has an impact on a vessel's combat capabilities - strategic block placement can improve your vehicle’s survivability and efficiency. Weapons Each weapon is a separate object with its own logic and physics systems. Before shooting, a weapon checks if it doesn’t don't hit or collide with its own vehicle. Weapons types include many variants of artillery, missile launchers, machine guns, flamethrowers, torpedo launchers, bombs, depth charges, and crazy close combat weapons. One of the unique weapons is a harpoon that can grab and pull enemies or pull its own vehicle to the ground. Physics The shape and size of the vehicles' hull affects their air and water drag. Vessels with an angled, aerodynamic hull are faster than those that look like a brick. Some blocks generate buoyancy or lift, center of which should be balanced with the center of mass. Water has realistic wave simulation, there is also wind that can be used by sails. Mechanics The game has realistic gun ballistics and armor penetration mechanics; angled surfaces offer better protection from projectiles and can cause them to ricochet. Most blocks can be made using different materials that have different weights and other properties. Enemy vehicles can behave differently, depending on what weapons they have installed and what their goals are.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/952240/header.jpg?t=1654263589",
    "Price": 14.99,
    "Developers": "Image Power S.A.,Roasted Games",
    "Publishers": "Image Power S.A.,PlayWay S.A.,HeartBeat Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_7ace9c5bde92eeab41478b8a8b6e7705937b2cf5.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_b8840a7929a1f7fa048716bad6e71dada29d000b.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_a7ef26e5e702020d3aa588f9f6f812273a7b4f85.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_8ad109d64a097464f471c4bf2f4cd06ebb581e6c.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_76e431fdb207b4d5407d2360376e2478e4acb158.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_9a40074911fbfef26d67da70e9162b1a152ccdf6.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_047ae3ca4dc1fb109416f39669862375db902666.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_04362264774c5518de9cd1d19c6a04492e84dded.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_43e7839ccc6a78282baab7ca895f995284c3fb33.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_dd0c7da72ef648355d07d3ac912466d40b9b68db.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_2f3e72bfb5cc5288d2062f7666258b648bf0c5b9.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_040e405eb398f8f512334c1c634cf839cda84317.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_175ffcb70e2d4b3e238bb6d92955a504dca942a4.1920x1080.jpg?t=1654263589,https://cdn.akamai.steamstatic.com/steam/apps/952240/ss_b69b7dcddb20608696c38a26f2a19c9a1a6b0d7b.1920x1080.jpg?t=1654263589",
    "Slug": "dieselpunk-wars",
    "Meta Title": "Dieselpunk Wars: May 13, 2021, Image Power S.A.,Roasted G...",
    "Meta Description": "Looking for information on Dieselpunk Wars? Check out the release date (May 13, 2021), developer insights from Image Power S.A.,Roasted Games, and a com...",
    "Alt Text Image": "Official header image for Dieselpunk Wars game - Steam 952240",
    "Canonical URL": "https://gusku.site/game/dieselpunk-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dieselpunk Wars\", \"description\": \"Looking for information on Dieselpunk Wars? Check out the release date (May 13, 2021), developer insights from Image Power S.A.,Roasted Games, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Image Power S.A.,Roasted Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Image Power S.A.,PlayWay S.A.,HeartBeat Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/952240/header.jpg?t=1654263589\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}