{
    "AppID": 1272320,
    "Name": "Diplomacy is Not an Option",
    "Release date": "Feb 9, 2022",
    "About the game": "Step into the well-worn shoes of our Hero: a long-suffering minor Lord, who is forced by circumstances to engage in battle with vastly superior enemy forces. Boxed in a by a quarrelsome king, duplicitous advisors, and enemies on all sides, there is no recourse to resolve this peacefully. It seems that Diplomacy Is Not an Option! Experience warfare on an entirely new scale as over 10 THOUSAND enemy units assault your castle walls. Do you have what it takes to save the kingdom? Is the kingdom even worth saving? The Law Of War Your King is a mighty, and bold leader. The only thing he loves more than drinking is fighting, and he’s done a lot of it. Whilst waging foreign wars and conquests, the lands at home have been neglected; infrastructure is decaying, and the people are slowly starving. The ground is fertile for the seeds of rebellion! Misled by feckless advisors the King cares not for the bureaucracy of statecraft, so when the masses rise up there is little warning or aide to be found. You alone must don the helm of battle and defend your lands from the murderous peasants. But victory will grant you scarce relief as you are the only one proven capable of protecting the kingdom. You must put down the rebellions, flush out its leaders, and restore stability. Rumours abound of vast treasures in distant lands, exactly what the King needs to feed the people and fund more beer and war. Will you do as your sovereign bids and set sail to replenish the palace coffers? Surely the native peoples will offer no resistance to your pilfering. What could go wrong? The Physical Laws Diplomacy Is Not an Option takes the laws of physics very seriously: there are no hit-scan crossbows to be found here! Your archers and siege engines will need clear trajectories to hit their targets, so good placement of your towers and defences is vital. Thousands of enemy soldiers will advance on your walls and archers positioned behind them must fire up and over; dramatically reducing their range and accuracy. Providing your units with elevated firing positions will greatly increase their effectiveness. Likewise, a ballista or catapult-thrown boulder will do no good if they crash into a cliff mid-flight. Consider your gates, your lines of advancement and retreat. Create kill-zones and fall-back positions. You will need to take an active role in combat to get the best from your men. The Laws of a Functional Society The world of Diplomacy Is Not an Option is not a kind one. Food can become scarce, and your soldiers can starve on the battlefield. Homes must be protected, diseases managed, and corpses hauled away and buried with respect. If you do not care for your people you may soon find yourself overrun with a most unpleasant plague, or with battlements guarded only by the wasting bones of your malnourished soldiers. Economic Laws A functional army requires a functional economy to support and feed it. Food, Wood, Stone, Iron, and Gold are the foundations of your city’s economy, and you will need to watch your supplies carefully if you are to meet the advancing foe in a timely manner. Gather resources, choose your storage locations, plan your expansions and upgrades with care. The enemy will not cede their lands willingly, and unprotected civilian expansions will fall prey to hostile incursion. Trade, via the impressive merchant dirigible, offers a lifeline to besieged cities, bringing emergency supplies of food to feed the men, or stone to rebuild the walls. It might help just enough to tip the scales. Can you strike the balance between greedy expansion and security? Between builders and farmers and fighters? The Laws of Magic Fickle and treacherous, most shun the use of magic in the lands. Those who dare tamper with the occult are viewed with suspicion and fear, and with good reason. There is a dark history of tainted power that stirs the dead and traps wayward souls. A proper burial for your slain is not just a tradition, it is a necessity. On the lighter side: it can also be used to call down really very big fireballs onto your enemies. So enjoy that too. The Fundamental Laws of Life The game has been designed with freedom as a core concept. The Endless Mode grants you full access to the tech tree and there are no limitations on how you approach the challenges that the procedurally generated maps provide. Go heavy on walls early, build large armies of cannon-fodder, or pursue the macro game of greedy growth and costly investments. Finding which style grants you the most success is up to you. The campaign will offer you challenges of combat and morality: it is a grim and unpleasant world. Few are worthy of your allegiance and even fewer will trust it. As in real life, stupidity and greed lie behind most problems, but here it is far too late to talk it through. You have no recourse to resolve this peacefully. At this stage: Diplomacy Is Not an Option!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1272320/header.jpg?t=1658750276",
    "Price": 24.99,
    "Developers": "Door 407",
    "Publishers": "Door 407",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_3829c9541fbaab7b8cd557bf571067c28aefe640.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_b620a2d1be23e013156b2823c72c0c16e6888463.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_938c20706aa0e37ca320dcbe449d0eb6cec93a7f.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_54bfdf9ca0b20ad279ea63433b2c5151d50a255f.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_ccd4f5d84ec40fbf8a70cd072b12cb373699176c.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_9870f59e1ffaaadc78ca9a9a5eb8ba6416cf11ff.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_35a1a50c9c60cc0eac88ca32b247a1cbb6fe8b8c.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_75dc8a823fef66b1f6a8893f92c55e4cda2c4a3a.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_a6a35aa1ff7df27b3c365c45817407a5fdd5f57d.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_114edabba1aa0946434b47b24c1dfddae29b07e9.1920x1080.jpg?t=1658750276,https://cdn.akamai.steamstatic.com/steam/apps/1272320/ss_0ccd3c4d736ce42976d4ffc00f618073cbf1577b.1920x1080.jpg?t=1658750276",
    "Slug": "diplomacy-is-not-an-option",
    "Meta Title": "Diplomacy is Not an Option: Feb 9, 2022, Door 407 and Ful...",
    "Meta Description": "Looking for information on Diplomacy is Not an Option? Check out the release date (Feb 9, 2022), developer insights from Door 407, and a complete game s...",
    "Alt Text Image": "Official header image for Diplomacy is Not an Option game - Steam 1272320",
    "Canonical URL": "https://gusku.site/game/diplomacy-is-not-an-option",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Diplomacy is Not an Option\", \"description\": \"Looking for information on Diplomacy is Not an Option? Check out the release date (Feb 9, 2022), developer insights from Door 407, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 9, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Door 407\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Door 407\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1272320/header.jpg?t=1658750276\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}