{
    "AppID": 1181880,
    "Name": "Draconic Echoes: The Ardent War",
    "Release date": "Dec 4, 2019",
    "About the game": "The Golden Age of the Kingdom of Draknus, brought forth by the legendary Golden Hero’s rebellion, is long over. However, those ancient malicious dragons, which once kept the Draknians enslaved for hundreds of years, are invading in order to return the people to fetters and chains. Fortunately, the ancestors of the Golden Hero remain as the royal family of Draknus. Of warfare and a burning passion is what I sing. In this fantasy RPG inspired by both ancient western literature and contemporary media, you play as Princess Vendra Thetis, one of the two royal twins of Draknus, and travel the provinces of the kingdom in order to secure stability for the lands, which have been blighted by the destabilization efforts of the kingdom’s ancient and hated enemy, the Malhepteon. Fight and watch how Vendra develops into a person fit for her station as she burns away her reputation as the “Worthless Princess,” a title attributed to her that originated from her bitter rivalry with her twin brother, Prince Gaius Thetis. This Game Features: A strategic take on turn-based party combat. A new, but simple magic element system that encourages using spell combinations, thinking a turn or two ahead, and coordination across party members. A dynamic level cap that helps avid explorers from becoming undesirably over-leveled. Three difficulty settings that work in tandem with the dynamic level cap to keep players on par with the power curve, under-powered, or over-powered. 20+ hours of main quest and side quest content (may vary based on play style). A rich character-driven narrative set in a fantasy kingdom with some unique cultural aspects. A segmented open world! Due to the warped nature of the term 'open world, 'perhaps this one needs some explaining... Each chapter opens up a new area of the world. You are free to explore the world and do quests at your own pace, but you may find blocks at entrances to new areas, where you must clear the current area's main story quest before progressing. See? Open world, but in segments! This Game Does NOT Feature: Mundane fetch quests with no real narrative impact. Granny Smith will never ask you to collect ten apples for a small pittance of gold and EXP, Arduous and dragging escort quests... Actually, there are no escort quests at all! Water levels/puzzles. Yeah... I don't like these either. Overworld maps. Almost every area of the game is a continuous, explorable environment. Microtransactions. You are purchasing a full experience, and no, I won't try to sell you EXP buffs or over-powered weapons for real money later. Extensive original graphics/audio. My apologies, but I'm not adept with designing images or music. Jokes aside, I sincerely hope this does not detract from your enjoyment of this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1181880/header.jpg?t=1579938107",
    "Price": 4.99,
    "Developers": "Mark Vanderploeg",
    "Publishers": "Mark Vanderploeg",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1181880/ss_8f8ed10c172bb0fb3dbc65d4e39f6c7c19709f4e.1920x1080.jpg?t=1579938107,https://cdn.akamai.steamstatic.com/steam/apps/1181880/ss_1c7585e191a96cc3820e7fd7b0e9b9abc07236cb.1920x1080.jpg?t=1579938107,https://cdn.akamai.steamstatic.com/steam/apps/1181880/ss_dd013a7a509c5e573dc43e8b70a746a54d927f16.1920x1080.jpg?t=1579938107,https://cdn.akamai.steamstatic.com/steam/apps/1181880/ss_ff484c70813cee8a7f377f0b55db03518a6d882d.1920x1080.jpg?t=1579938107,https://cdn.akamai.steamstatic.com/steam/apps/1181880/ss_e47a569911fa10e765ee28e1b2ae81993dc69383.1920x1080.jpg?t=1579938107,https://cdn.akamai.steamstatic.com/steam/apps/1181880/ss_7d41135833841585b713ca2e56af440c09c71db6.1920x1080.jpg?t=1579938107",
    "Slug": "draconic-echoes-the-ardent-war",
    "Meta Title": "Draconic Echoes: The Ardent War: Dec 4, 2019, Mark Vander...",
    "Meta Description": "Looking for information on Draconic Echoes: The Ardent War? Check out the release date (Dec 4, 2019), developer insights from Mark Vanderploeg, and a co...",
    "Alt Text Image": "Official header image for Draconic Echoes: The Ardent War game - Steam 1181880",
    "Canonical URL": "https://gusku.site/game/draconic-echoes-the-ardent-war",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Draconic Echoes: The Ardent War\", \"description\": \"Looking for information on Draconic Echoes: The Ardent War? Check out the release date (Dec 4, 2019), developer insights from Mark Vanderploeg, and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mark Vanderploeg\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mark Vanderploeg\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1181880/header.jpg?t=1579938107\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}