{
    "AppID": 1469620,
    "Name": "Epic Battle Fantasy Collection",
    "Release date": "May 30, 2022",
    "About the game": "This collection includes 8 ancient games from the early days of the internet. Each game has been updated with quality-of-life features, such as difficulty and accessibility options. Most of these games can be completed in a single session, but there's plenty of re-playability if you want to collect all 150 achievements. The entire soundtrack is included as free DLC - 65 tracks in total! Bullet Heaven Dodge thousands of beautiful bullets in this shoot-em-up game! There's plenty of upgrades to unlock - and this version adds 4 new playable characters. This game can be played with either a mouse or keyboard. Adventure Story Jump and fight your way through 27 action-packed levels to rescue your cat and girlfriend. Along the way you'll level up, and collect new equipment and spells. This platformer can be played with either a keyboard or a controller. New levels, bosses, and abilities have been added! Epic Battle Fantasy 1 The game that started off the Epic Battle Fantasy series of turn-based RPGs! It ain't much, but it's got plenty of nostalgic value. You start with two level 99 characters and must fight through waves of enemies - now with added checkpoints and a new soundtrack! Epic Battle Fantasy 2 A direct continuation of the first game, the second instalment features character customization, limit breaks, and more intense battles. The difficulty has been rebalanced to make a variety of character builds more viable - and many bugs have been fixed. Brawl Royale A simple quick-draw game where you must react faster than your CPU or human opponent. It features some very violent animations! This version has 4 difficulty settings and a new soundtrack. The Kitten Game Slaughter hundreds of cats in this clicker game, featuring whacky scenarios and pointless violence. The difficulty has been balanced, and an auto-clicker feature has been added. Wrist injuries are no longer part of the game. Mecha Dress Up Game Build your own killer robot from hundreds of parts. You can take screenshots and share your creations with the community! Now with better controls, color-picking functionality, and a new soundtrack. Cat Cafe You run a cafe for cats, and must serve them drinks as fast as possible! This is a very simple game with not much depth to it. You can listen to a podcast or something while playing. Also included in the EBF Collection are several art galleries, game prototypes, and development lore about the history of the Epic Battle Fantasy series. There's even some Easter eggs and secret images hidden inside the installation folder.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1469620/header.jpg?t=1653999451",
    "Price": 7.99,
    "Developers": "Matt Roszak",
    "Publishers": "Matt Roszak",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_df8a72f99e1a9da75328336c2702b36cde55b26f.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_22fc4f13e17ab4802cdc9f22f38578f33e9590d2.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_0ca3d7f5867ace4eb123135976040d503192ae66.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_231e83f9ba4e6bf9f9acc8e7310ef187e9655e8a.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_2588bde3432cfdbb57dc028973487ecd258c32c6.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_f8bc147f0ceb97e12b6b37029ea75d11887b5503.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_cc2443a3456d678ed508b26300ccfa0c10653bf4.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_35c1d788b284a5354b0f3251c60b2b177a6ed896.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_c9bc2ed3898545c6e54e8cf6bb8f760b13ffc9d6.1920x1080.jpg?t=1653999451,https://cdn.akamai.steamstatic.com/steam/apps/1469620/ss_a590333ee9f84eb16c7b18de182138efea81dc03.1920x1080.jpg?t=1653999451",
    "Slug": "epic-battle-fantasy-collection",
    "Meta Title": "Epic Battle Fantasy Collection: May 30, 2022, Matt Roszak...",
    "Meta Description": "Looking for information on Epic Battle Fantasy Collection? Check out the release date (May 30, 2022), developer insights from Matt Roszak, and a complet...",
    "Alt Text Image": "Official header image for Epic Battle Fantasy Collection game - Steam 1469620",
    "Canonical URL": "https://gusku.site/game/epic-battle-fantasy-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Epic Battle Fantasy Collection\", \"description\": \"Looking for information on Epic Battle Fantasy Collection? Check out the release date (May 30, 2022), developer insights from Matt Roszak, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Matt Roszak\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Matt Roszak\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1469620/header.jpg?t=1653999451\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}