{
    "AppID": 1038740,
    "Name": "Fluffy Store",
    "Release date": "Aug 14, 2019",
    "About the game": "Lin Yang was unemployed when he graduated from college this summer, so he went back to his hometown, planning to start his own convenience store. ——｢Well, though I don’t have any employees yet, I’m a boss now.｣ That was what he thought at the beginning... However, a string of mysterious wind chimes changed this situation, maybe even his life. Along with the ringing chimes blown by the summer wind, three strange looking girls, each with a different pair of furry ears, appeared out of nowhere before him. He didn’t know who they were and they seemed to have some sort of secret with them, but Lin Yang decided to accept them anyway, and also hired them in this new convenience store. Well, no secret can stay a secret forever. Despite working his heart out, Lin has no experience in running anything. What lies ahead on their road of adventure? It’s for you to find out. Live 2D animations to bring every character to life. High definition, exquisite scenes and CGs. Subtitles in multiple languages supported. Lin Yang: As a young man, he felt a little lost after graduation and was unemployed. But he is so independent that he decided to start his own business even when his parents tried to stop him. But as cruel as the real world could be, he could only afford to open a small convenience store on his ｢own｣. ——｢I name you after a type of food because you are as important to me as food is to a human!｣ Cherry: A girl summoned here by the wind chimes. Her most distinctive feature is a pair of pointy fox ears and a fluffy tail. She’s usually quite careless, even a bit ignorant, but she’s reliable at critical moments. ——｢Way too easy, just count on me! As long as I get my treats!｣ Purin: As a rabbit girl with long ears that's summoned by the sound of the wind chimes, she’s as gentle and lovely as the rabbit she is, along with her way of treating others. But she can be very sneaky and gnarly sometimes... ——｢About today’s business? Uhmmm, which one do you prefer, good news, bad news or the truth?｣ Puff: Well, obviously, look at her round brown ears, she must be a bear. She’s very strong, a bit lazy, easy-going, clever and surprisingly crafty. Sometimes, you just can’t figure out what’s in her mind with that poker face. ——｢My ears? These are REAL, not props.｣ English subtitles proofread by woosk from Visual novel, JRPG, Anime and partner website Sinical Network.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1038740/header.jpg?t=1601399701",
    "Price": 1.99,
    "Developers": "AsicxArt",
    "Publishers": "SakuraGame",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_8f90aa9fb2d55234ac3c84e9d2cb526e38b8770a.1920x1080.jpg?t=1601399701,https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_6f64c77fca271a47ff26d1f4ecdfe21df217e0e1.1920x1080.jpg?t=1601399701,https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_615fb35a91b1fab5500701ccaf0372c97fde0385.1920x1080.jpg?t=1601399701,https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_13cba355271b5efc37983381918ad6903dafe875.1920x1080.jpg?t=1601399701,https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_1e073b265a1aa49407039f8d454ff0685370180d.1920x1080.jpg?t=1601399701,https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_12b6c94513c64520750107a6f7ea53f446898b1b.1920x1080.jpg?t=1601399701,https://cdn.akamai.steamstatic.com/steam/apps/1038740/ss_df9b9814eb3dacf784c76b435c616dba552686c5.1920x1080.jpg?t=1601399701",
    "Slug": "fluffy-store",
    "Meta Title": "Fluffy Store: Aug 14, 2019, AsicxArt and Full Overview",
    "Meta Description": "Looking for information on Fluffy Store? Check out the release date (Aug 14, 2019), developer insights from AsicxArt, and a complete game summary.",
    "Alt Text Image": "Official header image for Fluffy Store game - Steam 1038740",
    "Canonical URL": "https://gusku.site/game/fluffy-store",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fluffy Store\", \"description\": \"Looking for information on Fluffy Store? Check out the release date (Aug 14, 2019), developer insights from AsicxArt, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 14, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"AsicxArt\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SakuraGame\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1038740/header.jpg?t=1601399701\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}