{
    "AppID": 1100600,
    "Name": "Football Manager 2020",
    "Release date": "Nov 19, 2019",
    "About the game": "Run your football club, your way. Every decision counts in Football Manager 2020 with new features and polished game mechanics rewarding planning and progression like never before, empowering managers to develop and refine both your club’s and your own unique identity. Walk down the tunnel to a living, breathing football world with you at the very heart of it. Around here, your opinion matters! This is a world that rewards planning and knowledge but, unlike other games, there’s no pre-defined ending or script to follow – just endless possibilities and opportunities. Every club has a story to tell and it’s down to you to create it. They say football is a game of dreams. Well, managers are a special breed of dreamers. They don’t see problems, only opportunities: the chance to prove themselves against the best in the world, to develop and instil a new footballing philosophy, to nurture talent through the ranks, to lift the club to greater heights and end the wait for silverware. How you get to the top is up to you… you’ll own your decisions, and the consequences they bring… Base yourself in 50 of the biggest footballing countries worldwide Oversee a new era of success at one of 2,500 clubs at every level Sign the best and mould the future – scout more than 500,000 real players and staff Create your tactical vision and bring it to life on the training pitch Kick every ball with our most immersive and smartest match engine to date DEVELOPMENT CENTRE Take full control of your youth team operations in a new all-encompassing hub. Nurture your young stars from the moment they arrive at your club and through the youth ranks until they’re ready for first-team action. CLUB VISION Develop a culture, work with the board to achieve ongoing objectives and plot a course for your club to progress in seasons to come. Club vision goes far beyond the boardroom; impacting on transfers, playing style and competition expectations as you look to strengthen your club’s identity and meet the multi-year milestones. PLAYING TIME PATHWAY A whole new way to define a player’s standing in your squad. Build in current and future playing time across the length of a contract, defining a clear pathway from Fringe Player to Star Player and everything in between. BACKROOM STAFF New roles, advice and interaction make your staff more involved and important than ever. More collaboration across more areas brings the game closer to the structure of a real-life backroom team. GRAPHIC IMPROVEMENTS Redesigned player and manager models, improved lighting and overhauled pitch visuals combine to create the most realistic and best-looking match experience to date.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1100600/header.jpg?t=1608137526",
    "Price": 0.0,
    "Developers": "Sports Interactive",
    "Publishers": "SEGA",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1100600/ss_f6483b536d3e6f1906f1468ee3b909ae7cc351f7.1920x1080.jpg?t=1608137526,https://cdn.akamai.steamstatic.com/steam/apps/1100600/ss_0d7f08881ffc2fe1ee646975471094008917c042.1920x1080.jpg?t=1608137526,https://cdn.akamai.steamstatic.com/steam/apps/1100600/ss_9a89c5b67c519abdf60996297ab8d7dec6ef2dbd.1920x1080.jpg?t=1608137526,https://cdn.akamai.steamstatic.com/steam/apps/1100600/ss_9331e477370810cfe269f1c7e18e4ad4ce01ee1c.1920x1080.jpg?t=1608137526,https://cdn.akamai.steamstatic.com/steam/apps/1100600/ss_50f9419330cce58ec10cac1a49d38fa20663e097.1920x1080.jpg?t=1608137526",
    "Slug": "football-manager-2020",
    "Meta Title": "Football Manager 2020: Nov 19, 2019, Sports Interactive a...",
    "Meta Description": "Looking for information on Football Manager 2020? Check out the release date (Nov 19, 2019), developer insights from Sports Interactive, and a complete ...",
    "Alt Text Image": "Official header image for Football Manager 2020 game - Steam 1100600",
    "Canonical URL": "https://gusku.site/game/football-manager-2020",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Football Manager 2020\", \"description\": \"Looking for information on Football Manager 2020? Check out the release date (Nov 19, 2019), developer insights from Sports Interactive, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sports Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1100600/header.jpg?t=1608137526\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}