{
    "AppID": 752520,
    "Name": "Football Nation VR Tournament 2018",
    "Release date": "Jun 7, 2018",
    "About the game": "Football Nation VR™, bringing virtual football to life. NEW 2018 Tournaments inspired by the World Cup. For the first time ever, you can physically feel the rush of playing in Football's biggest VR tournament as the vast stadium surrounds you; the virtual grass underfoot, the crowd cheering, the excitement and the undeniable patriotism for your country - a childhood dream come true. Play solo against the A.I, join up to 16 player matches (8 Player online lobbies), or invite your friends into a private match for a little friendly competition. With a choice of pitches to play on, players can choose to play in the International league Stadium, or just have a Five A Side kick around with friends. However you play, Football Nation VR™ brings to life the players, teams, and atmosphere of competitive football like no other game can; celebrate together as you and your team run, kick and tackle your way to the top spot on the global leaderboards. PLAY FOOTBALL IN VR: For the first time you can play a game of football in VR, against the AI or online with friends. OFFLINE TRAINING CHALLENGES: Play in a selection of offline challenges to help master your skills from dribbling, kicking, to striking to a variety of fun target practice challenges WORLD TOURNAMENT MODE: Play solo against the AI in 16 player matches; with 8 AI and 8 player lobbies you can choose to all be on one team or 4v4 (human) online matches with friends. This mode is inspired by the World Cup, 36 teams enter and only one can win. Choose your country you want to play for, and for every win your country gets 3 points, the teams with the highest points will avoid elimination, after each round the leaderboards are wiped and only the top teams go through. After each round half the teams are knocked out until only 2 remain. The world tournament mode includes professional rules and penalties! 5 ASIDE FOOTBALL MATCHES: Play solo against the AI or 4v4 online matches with friends, 5 Aside is a fun take on Sunday league football, with matches lasting 5 minutes, and no strict rules this is a kick around game at its best TEAMS: *COMING JULY 2018 Teams will be a permanent fixture in the game, giving players the ability to create, join and customise teams with their friends. It was such a great addition to the game that we couldn’t see it end once the tournament did so instead we expanded it further. Giving the players more flexibility to manage members and create their own teams. Football Nation VR is the WORLDS FIRST first person football (soccer) game (fpf) played in VR from a first person perspective where you control the running, dribbling and kicking motions with the unique agile locomotion mechanic, giving you the abilty to play a a game of football in VR. In Football Nation VR your hands control your feet, (no need for extra controllers or trackers!) with the increase in popularity of running games in VR this was a natural progression for us, to bring the worlds most loved sport into VR.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/752520/header.jpg?t=1529056591",
    "Price": 14.99,
    "Developers": "Cherry Pop Games",
    "Publishers": "Cherry Pop Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/752520/ss_e8873cd7428cfbccd275b61a8e7ed6d5de70cef5.1920x1080.jpg?t=1529056591,https://cdn.akamai.steamstatic.com/steam/apps/752520/ss_8e83351a2e65449e69aa36ad28f91e237275ff16.1920x1080.jpg?t=1529056591,https://cdn.akamai.steamstatic.com/steam/apps/752520/ss_283096b53c134e26aba37bd33ff84ed38d799ba9.1920x1080.jpg?t=1529056591,https://cdn.akamai.steamstatic.com/steam/apps/752520/ss_a7174d228faf15a80158fe572fa294dbd2bfb670.1920x1080.jpg?t=1529056591,https://cdn.akamai.steamstatic.com/steam/apps/752520/ss_4342a9d12369135f4fed6a4f5b3af63548331e3f.1920x1080.jpg?t=1529056591,https://cdn.akamai.steamstatic.com/steam/apps/752520/ss_1379d2b49e0eb69d52c14d1ea0b5105636064913.1920x1080.jpg?t=1529056591",
    "Slug": "football-nation-vr-tournament-2018",
    "Meta Title": "Football Nation VR Tournament 2018: Jun 7, 2018, Cherry P...",
    "Meta Description": "Looking for information on Football Nation VR Tournament 2018? Check out the release date (Jun 7, 2018), developer insights from Cherry Pop Games, and a...",
    "Alt Text Image": "Official header image for Football Nation VR Tournament 2018 game - Steam 752520",
    "Canonical URL": "https://gusku.site/game/football-nation-vr-tournament-2018",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Football Nation VR Tournament 2018\", \"description\": \"Looking for information on Football Nation VR Tournament 2018? Check out the release date (Jun 7, 2018), developer insights from Cherry Pop Games, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cherry Pop Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cherry Pop Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/752520/header.jpg?t=1529056591\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}