{
    "AppID": 997270,
    "Name": "傲皇忆剑诀",
    "Release date": "Dec 30, 2018",
    "About the game": "[With this game, I salute Mr. Jinyong who died immortally] Since many domestic players are unable to log on to the Steam forum, please use the following channels for feedback on the suggestions and feedback on the game. QQ group: 536843153 I have been engaged in hand-swimming development for many years, this is the first time to do independent games, the shortcomings also look to the sea! There are many reasons for my idea of making games. One of them is that in 2015 I happened to watch a 6-minute short film about Mr. Yao Zhuangxian's mental journey in making The Legend of Fairy Sword and Chivalrous Swordsman. When I saw half of it, my eyes were wet and touched with tears. In a word, I hope I can make a little contribution to the domestic single-player games. Game Description: Generally speaking, it belongs to strategy games. It needs to use attribute points to train generals. They can be very aggressive, defensive and quick to shoot. It's up to you to decide. In the game, the emperor's decree can recruit generals to form teams and represent their country to participate in the competition meeting. The first two can be promoted and promoted in the competition meeting every year. 1. It is possible to establish such interpersonal relationships as husband and wife, brothers, siblings and sisters with military generals. 2. After each round of the contest, the fighter will get one attribute point, and the player can freely assign the attribute points to different attributes. 3. There is a certain probability of repelling monsters every month. By repelling monsters, we can get the prize of Yuan Bao and the treasure carried by monsters. 4. In the contest of martial arts, one point can be accumulated in the first round of victory. According to the level of points, the countries participating in the contest are ranked. The first two places in the list are promoted, and the last two are demoted. 5. Buying equipment in stores can equip military generals in the ranks, so that they can acquire higher attributes and fight better. 6. In battle, the generals will use their skills to consume their physical strength, and they can buy physical medicines in stores to recover. 7. Every martial art will grow older with the passage of time, and the attributes of older martial arts generals will decline. At last, they will retire. They can choose to enter Lingyan Pavilion to show respect. 8. Players'roles will also decline as they grow older, so they can use prop recycling mirrors to regain their new life. 9. When the player is promoted, he can get a treasure reward in the Puritant Interface. 10. The game will be automatically archived. Restarting the game will cover the original archive. ------------------------------------------------------------------ ------------------------------------------------------------------ This is my first independent game, from conception to basic completion can be said to have changed a lot, originally wanted to do a similar game Jinyong swordsman biography, but thinking about it has become the present look. I have worked in the game company for several years. Like other colleagues, I used to complain about the foolishness of some designs of the planners. Now when I design the game plot, I find it really difficult. I can't help saying 'sorry' to my former planners. This game as my pioneering work feels basically satisfied, although there are certainly many shortcomings, may not be able to meet the preferences of most people, but my original intention is that it can be fun. In the production process, some of the early design, later self will feel very bad, and revision again and again, because I also try to make myself play comfortable, believe that others will be comfortable. ----------------------------------------------------------------------------------------------------------------------------------------------------------------------",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/997270/header.jpg?t=1546646080",
    "Price": 7.99,
    "Developers": "流一心",
    "Publishers": "流一心娱乐游戏集团总部",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_9664764914a0fe19b5cf4974cd745cfdc5fee800.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_fe27a0f6ef45cb6c84de71cb7e888014a167b20b.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_a4d7b366669a98d9c4bf8bcade398af68f016ba9.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_8c7d874b3cdbb58ea10b628103bc6d20d6fbaa8c.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_574b1db8ba1e9fa4ff031a00147f6edf097b5fd5.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_345500e975a7a99589f6e6a9d4befced980397f2.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_1fdf306dd4b1eedb7d60f42e1a1be623d271a21b.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_17dfa53c4cfaddb548080b6732c723ca7ad1c5cb.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_53058d363c5bf07019c0dec6b2ce2b4dcbe944f7.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_cd9a54867b95421eaf7aa81bdecad86bb3c1f904.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_10a9c17569ed01acf69c86d137d9204018dfcc1b.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_eb06d103dc68d2ab54c8e183f658ca34e1ef1975.1920x1080.jpg?t=1546646080,https://cdn.akamai.steamstatic.com/steam/apps/997270/ss_a1c8783bcebffcee92646b37ce793ddc317ccc42.1920x1080.jpg?t=1546646080",
    "Slug": "",
    "Meta Title": "傲皇忆剑诀: Dec 30, 2018, 流一心 and Full Overview",
    "Meta Description": "Looking for information on 傲皇忆剑诀? Check out the release date (Dec 30, 2018), developer insights from 流一心, and a complete game summary.",
    "Alt Text Image": "Official header image for 傲皇忆剑诀 game - Steam 997270",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u50b2\\u7687\\u5fc6\\u5251\\u8bc0\", \"description\": \"Looking for information on \\u50b2\\u7687\\u5fc6\\u5251\\u8bc0? Check out the release date (Dec 30, 2018), developer insights from \\u6d41\\u4e00\\u5fc3, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 30, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6d41\\u4e00\\u5fc3\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6d41\\u4e00\\u5fc3\\u5a31\\u4e50\\u6e38\\u620f\\u96c6\\u56e2\\u603b\\u90e8\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/997270/header.jpg?t=1546646080\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}