{
    "AppID": 1779240,
    "Name": "天国病院-Heaven's Hospital-",
    "Release date": "Oct 31, 2021",
    "About the game": "1. Overview 'Heaven's Hospital-' collects key items, expands the range of action, collects repulsive items, repels items, guidance items installed in various places, etc. while running away from the gods of death in the shape of cute nurses. This is a horror game where you can manage your resources, prevent the god of death from coming to your room, and survive for 7 days. The protagonist can have either the ability to locate the enemy or the ability to see the enemy's field of vision. You can also choose not to have either ability. A stress-free simple design that does not solve any mysteries. In Basic Mode, which aims to survive for 7 days, you can choose the difficulty level from Easy, Normal, Hard, and the highest difficulty level (released after clearing Hard Mode). In addition to the basic mode, there is an endless night mode where you can survive for a long time and aim for a high score from the time you survived and the score items you collected. 2. Basic mode to survive for 7 days For 7 days, the hero needs to collect key items to expand the range of action, collect repulsive items, etc., protect himself, and prevent the god of death from coming to his room. Each time you reach the hospital room, one day passes and the patients in the room disappear one by one. Since there are 3 patients in the same room, the game will not be over up to 3 times. The protagonist can choose to assist with either the ability to locate the enemy, the ability to see the enemy's field of vision, or neither. In addition, the difficulty level can be selected from Easy, Normal, Hard, and the highest difficulty level (released after clearing the hard mode). The number of enemies appearing, the search range, and the movement speed differ depending on the difficulty level, and 3 special enemies will be added at the highest difficulty level. In other words, there are 12 ways to enjoy the combination of assist ability and difficulty level. The clear rank varies depending on the number of surviving patients in the same room and the number of times the patient in the same room found and delivered the lost stuffed animal. 3. Infinite night mode aiming for a high score It is a mode to aim for a high score by surviving for a longer time while collecting score items. There are three types of score items: gold, silver, and bronze. As for the score, the personal best top 3 is recorded for each assist ability. The Steam version has a ranking feature that allows you to compete with players from around the world for scores. 4. Reaper's various attack methods There are 8 Shinigami (11 at the highest difficulty level). Attack methods include poor visibility, abnormal visibility, noise, poisoning, slowing down, motion reversal, coma, and instant death. 5. All 5 types of costumes In addition to the default nurse costume, there are four additional costumes. These will be available as achievements are released. 6. Horror production according to fear value etc. The hero accumulates fear value every time he is attacked by the gods of death. Horror events occur depending on the horror value. In addition, special game over scenes are available under certain conditions. 7. Stress-free game design This work does not solve the mystery at all, so you will not be frustrated because you cannot solve the mystery. Also, since the stage is a limited place called a hospital, there is no stress of moving. It also has achievements (there are the same in Steam and in-game), and there are 24 of them. And, as mentioned above, the basic mode can be enjoyed in various ways by combining the difficulty level and the assist ability, and the infinite night mode can also be enjoyed according to the assist ability. 8. Supports 16 languages Supports Japanese, English, Chinese (traditional / simplified), Korean, Russian, German, French, Italian, Portuguese, Spanish, Turkish, Indonesian, Thai, Vietnamese, Hindi I am.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1779240/header.jpg?t=1635692637",
    "Price": 7.99,
    "Developers": "NNゲーム工房",
    "Publishers": "NNゲーム工房",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_40430604e44383a0408581f4b4b407c0f11c4a32.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_c96d576e0a75f6c3f3d785e4dfd0a131c9f089e7.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_34b34bcaa4db23ec7caef99df85d0a547f20415c.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_164c4b3ee92f56f25156ccbab6b95183a6527d09.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_848d2c5f65d33d2f95703e67fd69b96bf16e2c90.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_d4338a86930f85731298b4c520061813c7686204.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_ff6b5c775fcad2c548cc28ddee4aca81da76a3e3.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_6e520c1bc379283ab5e6fa3ae1582483ed1acc2f.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_207a125e96c11dbd4db27807dac3f4dfc7f3aecd.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_473e53e5753f237d2dbdf3725bda5ef3add05579.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_0d086cb713c71972e18b8d20a1bbc0e30b6ae257.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_7cf89910d790a9772e9bb0f2060c4a610ae02140.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_5403d06d2245cc99424f43ed69ee6c9246aa413b.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_b111661d83e66419f0a7f7fce1d1de3a7d19ee19.1920x1080.jpg?t=1635692637,https://cdn.akamai.steamstatic.com/steam/apps/1779240/ss_9ae8f8c0b9188c4190a843994c187f03bc97fee9.1920x1080.jpg?t=1635692637",
    "Slug": "heaven-s-hospital",
    "Meta Title": "天国病院-Heaven's Hospital-: Oct 31, 2021, NNゲーム工房 and Full O...",
    "Meta Description": "Looking for information on 天国病院-Heaven's Hospital-? Check out the release date (Oct 31, 2021), developer insights from NNゲーム工房, and a complete game summ...",
    "Alt Text Image": "Official header image for 天国病院-Heaven's Hospital- game - Steam 1779240",
    "Canonical URL": "https://gusku.site/game/heaven-s-hospital",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u5929\\u56fd\\u75c5\\u9662-Heaven's Hospital-\", \"description\": \"Looking for information on \\u5929\\u56fd\\u75c5\\u9662-Heaven's Hospital-? Check out the release date (Oct 31, 2021), developer insights from NN\\u30b2\\u30fc\\u30e0\\u5de5\\u623f, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"NN\\u30b2\\u30fc\\u30e0\\u5de5\\u623f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NN\\u30b2\\u30fc\\u30e0\\u5de5\\u623f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1779240/header.jpg?t=1635692637\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}