{
    "AppID": 448730,
    "Name": "Imhotep, Pyramid Builder",
    "Release date": "May 6, 2016",
    "About the game": "WARNING - This game is for AVX -equipped CPUs only, (2011+) Do you like watching others do all the work? Cats do! In this unique game you will plan, direct and oversee the construction of a Pyramid in Ancient Egypt. Organize agriculture, plan the village, direct the building and watch thousands of workers on screen , in real time. Or not: You may be forced to watch them die of exhaustion. Which is all caused by your incapacity of planning the biggest project on earth. So rise to the occasion, and get that thing built, stone by stone! Game Play Your first challenge, should you accept it, is to decipher the hieroglyphic User Interface. Yes, that's right, the UI uses genuine ancient Egyptian hieroglyphs. But if you want, you can cheat, and enable transcription into English. You will need to build a food supply with farms and bakeries, and provide shelter for the workers. And you will also need to hire your labour force. Be careful though: do not hire more than you can feed and shelter: they may die if you fail to do so. Oh, and don't run out of silver either. It is what buys you buildings and labour. Labour You will need to hire: Irrigation Workers Farmers Household Servants Builders All of these workers will go about their lives autonomously, in one massive and unparalleled crowd simulation that can grow into a force of thousands of workers. But for the impatient Imhoteps among you: you can speed things along by picking up individual workers and place them back anywhere in the world. Buildings Farms are the backbone of your civilization. They require irrigation, and provide grain. Bakeries will turn grain into food. Tax offices will take the surplus food and provide the project with much needed silver. Huts are required to shelter your workers when they become exhausted. Food is distributed to them. Warning This game uses the latest AVX CPU technology to simulate the crowd. This means you need a recent computer to run this game. Intel Sandy Bridge or newer, or AMD Bulldozer or newer. Check your CPU first for AVX support, before buying. Thank you! (It also requires an up-to-date OpenGL driver -- v3.2 or higher.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/448730/header.jpg?t=1478239471",
    "Price": 7.99,
    "Developers": "Game Studio Abraham Stolk Inc.",
    "Publishers": "Game Studio Abraham Stolk Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/448730/ss_8de3e86748e34b9b91fcf7a677f6558c551c8637.1920x1080.jpg?t=1478239471,https://cdn.akamai.steamstatic.com/steam/apps/448730/ss_5a0c42e0a533dc82cd2decc0e2b26b4918d90c86.1920x1080.jpg?t=1478239471,https://cdn.akamai.steamstatic.com/steam/apps/448730/ss_1f4d9821713abd467f28a7831a63ce5e37ae8df5.1920x1080.jpg?t=1478239471,https://cdn.akamai.steamstatic.com/steam/apps/448730/ss_978567dd73b11bd32e78dd6222538c49f026f292.1920x1080.jpg?t=1478239471,https://cdn.akamai.steamstatic.com/steam/apps/448730/ss_85e3ccca2d552012273910c9c328cbdabf1c033b.1920x1080.jpg?t=1478239471",
    "Slug": "imhotep-pyramid-builder",
    "Meta Title": "Imhotep, Pyramid Builder: May 6, 2016, Game Studio Abraha...",
    "Meta Description": "Looking for information on Imhotep, Pyramid Builder? Check out the release date (May 6, 2016), developer insights from Game Studio Abraham Stolk Inc., a...",
    "Alt Text Image": "Official header image for Imhotep, Pyramid Builder game - Steam 448730",
    "Canonical URL": "https://gusku.site/game/imhotep-pyramid-builder",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Imhotep, Pyramid Builder\", \"description\": \"Looking for information on Imhotep, Pyramid Builder? Check out the release date (May 6, 2016), developer insights from Game Studio Abraham Stolk Inc., a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 6, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Game Studio Abraham Stolk Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Game Studio Abraham Stolk Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/448730/header.jpg?t=1478239471\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}