{
    "AppID": 1987080,
    "Name": "Inside the Backrooms",
    "Release date": "Jun 20, 2022",
    "About the game": "DESCRIPTION Inside the Backrooms is a Co-op online horror game up to 3 players, where you and your friends will fight to escape from the different levels of the backrooms, solving different puzzles with different mechanics in each one. This game is based on the famous creepypasta with many real references implemented such as iconic entities and important elements. You will have to explore each room, look for elements that help you to continue advancing throughout the game and unlock new areas, but the further you go, more dangerous it will be, you must pay close attention in the area, identify each entity and know how to avoid them if you want to survive. Look for supplies, store them in your inventory, explore all the rooms, solve puzzles, unlock areas of the map, interact, try to collect everything you find. The main objective of Inside the Backrooms is to engage players with its gameplay, difficulty and atmosphere. There are countless identical rooms with an old, dirty carpet and pale yellowish walls, where at first glance it gives you a gloomy and bad feeling where you realize that it is not a safe place. LEVELS The game currently has 4 levels, each level is huge and is designed to be more difficult than the previous one and each one with different puzzles and mechanics. VIRTUAL REALITY The game is compatible with VR for those who want to live the most terrifying experience in the backrooms, If you have an Oculus Quest device you can't miss the experience of being trapped in the backrooms in virtual reality. (ONLY OCULUS QUEST HAVE BEEN FULLY TESTED AT THE MOMENT, OTHER VR DEVICES MAY PRESENT ERRORS) ENTITIES In this game you will find several entities, currently 6 entities, all based on the original creepypasta, each entity will have different ways of attacking and manifesting, so it will be important to know it's behavior of each of these and avoid at all costs that several entities finds you at the same time, if this happens, you will have a bad time. PUZZLES Inside the Backrooms has a lot of diverse, interesting and entertaining puzzles, from simple ones to the complex and laborious, they are carefully elaborated with the purpouse of being solved both individually and cooperatively, in addition to this, to make the puzzles more dynamic and attractive, in each new game the solution of all of them changes, which means that it wont be always the same answer! so test your puzzle resolution skills and try to escape from this terrifying place full of mysteries. ITEMS If you want to survive in the backrooms you will need to look for essential items and manage them properly, because if you get short of any of them, it could mean your death. These are some of the items you can find on your journey through the backrooms: Almond Water: Regenerate part of life. Pills: Eliminate Anxiety Radios: Allows communication at a distance with your team Flashlight: Allows you to see in dark areas. Protection Suit: Allows you to prevent getting radiation on some areas. Documents and Notes: Provides relevant information. FEATURES Here are some of the current features of the game: Proximity Voice Chat: Talk to the nearest people using the voice chat, but be careful, some entities could hear you... Stamina: The player will have limited stamina that you will need to manage correctly, if an entity is close to you, it will be your best ally to escape. Inventory: You will be able to take various items and store them in your inventory, however, space is limited. Anxiety: When you see an entity, your state of anxiety will increase, going through a disorder of fear and poor visibility. Entities: Each entity has its own attack modes, learn their techniques to evade them. Respawn: The game incorpore a creative and dynamic way to respawn, you will able to respawn up to 3 times. DEVELOPMENT ROADMAP We want to keep improving the game, to the point where it becomes one of the best games that represent backroom creepypasta. For this reason we will continue to polishing and adding new content to the game, these are some features that are planned to be added throughout the final development of the game: New Entities More Levels New Puzzles and Mechanics Procedural Levels New Items Improve Gameplay Language Localization",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1987080/header.jpg?t=1658618873",
    "Price": 4.99,
    "Developers": "MrFatcat",
    "Publishers": "MrFatcat,Dropsiick",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_e1fbb74ac929ed2b1fbb8e466cb5b8816029d77c.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_ab3484852ac23a0fc1c3caec0c794d55006b74f0.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_29fd4d1ab866c65f24dc23f34e63e60bd2cc27d4.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_8a20fed6c281ca0e8207d9bc44948f7dee0b9d01.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_6e6ab6ff59aaecfd716d06a32eab6df9c15367c9.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_e77072b3dc05a70620776bd857f2ee68f221a650.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_dd5840d810a7840fe74d31adb7209cb0ab72f628.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_a1cf2e89817f2afed2dae9424b38f4ed7289bee7.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_681e4311082caae9005af25dec6b8929eba1fd77.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_7a01b4fe20e234851a5c8a9b774f12caf3a2a2e7.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_6a834e48e56bb6c3ea6ad98d1044c4d51363ec19.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_8d8c7d1bd4f920135afb0757679a2cffc1996fb8.1920x1080.jpg?t=1658618873,https://cdn.akamai.steamstatic.com/steam/apps/1987080/ss_fd7c489a4bb80a40e1f77c045e0b503c92b81296.1920x1080.jpg?t=1658618873",
    "Slug": "inside-the-backrooms",
    "Meta Title": "Inside the Backrooms: Jun 20, 2022, MrFatcat and Full Ove...",
    "Meta Description": "Looking for information on Inside the Backrooms? Check out the release date (Jun 20, 2022), developer insights from MrFatcat, and a complete game summary.",
    "Alt Text Image": "Official header image for Inside the Backrooms game - Steam 1987080",
    "Canonical URL": "https://gusku.site/game/inside-the-backrooms",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Inside the Backrooms\", \"description\": \"Looking for information on Inside the Backrooms? Check out the release date (Jun 20, 2022), developer insights from MrFatcat, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MrFatcat\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MrFatcat,Dropsiick\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1987080/header.jpg?t=1658618873\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}