{
    "AppID": 1677510,
    "Name": "Knotfiction",
    "Release date": "Aug 13, 2021",
    "About the game": "Game Outline A flirty marriage with an older bride! A story of flirting with a playful older bride. Mainly female-dominant sex, and sometimes even sex where main character Yuuki goes wild! Genre A wonderful adventure with your older bride. Concept The second 'married couple' project following HarmonEy is a work that focuses on flirting with an older bride! Point 1 Enjoy married life while your older bride teases you! In this work, Yuuki fulfilled his childhood promise to marry the older girl next door, and gets childishly teased by his new wife as she supports him in his life! Point 2 It's the epitome of aggravating love! Even though she and Yuuki are married now, their relationship is still like a boy and an older girl! And he'll never be able to bridge that gap...! She knows how hard he's trying, though, and she's sure to spoil him sometimes, too! It's a sweet and adorable story. Point 3 Aggressive sex! The heroine is very proactive and likes to top, but and sometimes Yuuki lets his inner beast out, too! There are 10 whole sex scenes for you to enjoy! The Unbeatable Older Bride Chisa Narumiya Height: 165cm　Blood type: A type　Nickname: Chisane Favorite things: Her husband, cats, nature Dislikes: Deadlines, ghosts, natto Hobbies: Hanging out with Yuuki, reading Strengths: Beauty and intelligence, honesty Weaknesses: Too mischievous, a bit sluggish Alcohol Tolerance: Normal (gets hungover easily) She was Yuuki's older next-door neighbor and has always liked him. She's also a writer who mainly works on novels. She's the rare sort of person to have actually followed through on a childhood marriage proposal. She still has some fun at Yuuki's expense now that they're together, possibly because that's how they were when they met. She is good at housework and her job, is very generally talented, and has a lot of income. Perhaps that's why she 'forcibly' pays for most of the living expenses. She was worried she wouldn't get to marry Yuuki, but still stayed pure all those years. After two decades of waiting, though, her inner beast gets unleashed in bed. Like the previous work 'HarmonEy', this work features a simple story that focuses on the relationship between the two characters.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1677510/header.jpg?t=1631868932",
    "Price": 24.99,
    "Developers": "はちみつそふと",
    "Publishers": "ARTLINK",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_ac02d17e928e930974790e07603c97a8ed1a45ba.1920x1080.jpg?t=1631868932,https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_f85e94e36cdd3212491eecb18630dafaa3cd6852.1920x1080.jpg?t=1631868932,https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_144826bb58152cff7bf5ce9a7179ddb6f9e87cd9.1920x1080.jpg?t=1631868932,https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_657269bcc7738c69c8116f7cd7a2b221225d8df2.1920x1080.jpg?t=1631868932,https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_771d84340e759094596ed3b67d17bcc2c4234fc3.1920x1080.jpg?t=1631868932,https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_34dab73e0bf0f5abc88c7d19b76fcdb1c1468028.1920x1080.jpg?t=1631868932,https://cdn.akamai.steamstatic.com/steam/apps/1677510/ss_c278dfe84bff0e005d80fd901c043d91af5bdcb9.1920x1080.jpg?t=1631868932",
    "Slug": "knotfiction",
    "Meta Title": "Knotfiction: Aug 13, 2021, はちみつそふと and Full Overview",
    "Meta Description": "Looking for information on Knotfiction? Check out the release date (Aug 13, 2021), developer insights from はちみつそふと, and a complete game summary.",
    "Alt Text Image": "Official header image for Knotfiction game - Steam 1677510",
    "Canonical URL": "https://gusku.site/game/knotfiction",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Knotfiction\", \"description\": \"Looking for information on Knotfiction? Check out the release date (Aug 13, 2021), developer insights from \\u306f\\u3061\\u307f\\u3064\\u305d\\u3075\\u3068, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 13, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u306f\\u3061\\u307f\\u3064\\u305d\\u3075\\u3068\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ARTLINK\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1677510/header.jpg?t=1631868932\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}