{
    "AppID": 1373220,
    "Name": "Live the Life",
    "Release date": "Sep 16, 2020",
    "About the game": "Welcome to Port-Anthony. A small town that has recently begun to attract young people with its perspective. Choose your look and become one of those who start their new life in a new city. Start with an apartment or live on the street, the game does not limit you in your choice. Explore your neighbourhood and find out where to buy furniture, food and clothing. Earn and spend money, allow yourself whatever you want. Keep an eye on your health. Don't freeze on cold nights. Drink water on hot days... You will have access to one of the districts of Port-Anthony, the number of which will increase with new updates. Also, regular updates will add new activities and facilities to the areas available at their time. The idea of the game is not to make the biggest world, but to make it as complex and comfortable as possible, so that the player feels comfortable and knows every corner of the city. In general - provide the world you really want to live in. Create your own or any other look you like with the flexible character creation editor. Customize everything to your liking and realize your crazy ideas. Visit places like a tattoo salon, barbershop, or beauty salon to refresh your appearance. Change your clothing style effortlessly Explore the world without loading screens. Visit stores and other places you want to go. Usual actions are felt in a new way. Now you can feel like you're part of the world without having to pause. Have the option of living in your own home. But for those who want some extreme conditions, can live on the street at all. But be aware that it won't be easy. But speaking of the decorating tools, the game gives the player a wide range of opportunities in the decorating of their own home, not limited only by the perspective of the camera. Combine the furniture as you wish. With a wide range of different styles of assortment, you can create your own and unique design that will reflect your personality. Home design becomes intuitive and performed in real time. With advanced features, you can combine furniture in your own way. During early access, frequent updates are planned, the purpose of which is to improve the game and add new content. All future content will be completely free, no full game price DLC, no microtransactions. But what exactly are we expecting and what are the plans? The game really has a huge potential, and we have to initially implement the most important moments of the game. New stores and opportunities. The implementation of a full dialogue system, which is partly already present in the game and not only. Expect new space for buying and renting in the near future... I also have something else that I can definitely surprise you with. Ahead of us there is an interesting way to develop the game and do not miss the opportunity to join it... Stay tuned for new information on social networks and Steam page.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1373220/header.jpg?t=1636628191",
    "Price": 19.99,
    "Developers": "One Man Behind",
    "Publishers": "One Man Behind",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_04866f39429938919e13542dfcffd80412d8d208.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_f5316e0bebf8f53f6830a562a4a928986373648c.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_69bd1af1565c1aba6926b6e2da2b0278bc801f04.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_60cb3c32d043333cca4af91bdc50b22974801ce5.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_9de9c214b89bf8d5389c2eb5b9a22706243fdf94.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_3bca5a39b0f2bf1eec8db024955652021d4a4cbc.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_9ab521e9c621abba5eeeb5d47c49d9fe44a3154f.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_d50d128e0c1ee80a7efcc72e9ebdd154511bbe3f.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_967b5c63107a44fc0d910f2a1d9a0a852dc00df6.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_f1b997c35f61ed4f9732f847ce206302bf9a1808.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_d253a28b45e64398e73a5178bf3eebafe6fa9a0b.1920x1080.jpg?t=1636628191,https://cdn.akamai.steamstatic.com/steam/apps/1373220/ss_c568c0c885b6069f4979b7fb7ca654b400eaf261.1920x1080.jpg?t=1636628191",
    "Slug": "live-the-life",
    "Meta Title": "Live the Life: Sep 16, 2020, One Man Behind and Full Over...",
    "Meta Description": "Looking for information on Live the Life? Check out the release date (Sep 16, 2020), developer insights from One Man Behind, and a complete game summary.",
    "Alt Text Image": "Official header image for Live the Life game - Steam 1373220",
    "Canonical URL": "https://gusku.site/game/live-the-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Live the Life\", \"description\": \"Looking for information on Live the Life? Check out the release date (Sep 16, 2020), developer insights from One Man Behind, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 16, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"One Man Behind\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"One Man Behind\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1373220/header.jpg?t=1636628191\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}