{
    "AppID": 1026370,
    "Name": "My Fair Princess",
    "Release date": "Nov 8, 2019",
    "About the game": "Story Satoshi Kanamori attends the world-renowned Ryokufuuin Academy as a scholarship student. Thanks to his scholarship, he doesn't have to worry about the tuition--a critical concern for the eldest son of a poor family of six (and a sheep). Despite that, Hitomi Miyazono, a cute underclassman who adores him with everything she's got, Ayame Enatsu, his trusty aid willing to lend an ear to all his troubles, and the seemingly blunt and abusive Rin Washio, his closest friends, have no idea about his financial situation. The weight of attending such a prestigious school sometimes becomes unbearable, but he's enjoying his busy student life at this glamorous establishment. One day, however, Kana Takamine, the school's biggest celebrity, gives him a life-changing assignment: 'Satoshi, you'll play the leading role during this year's Ryokufuu Fest.' Follow Satoshi on his journey to make the festival a success, all the while strengthening his bonds and finding love in his rose-colored student life. Now, let the curtain rise on the gentle, sweet love story of My Fair Princess! Characters Rin Washio A hot-blooded, blunt girl from Satoshi's class. She's keeping her distance from her classmates, and is often seen wandering alone in the school. Her rude and uncaring personality gets turned on its head the moment she steps on stage as the popular idol, RIN. Her sweet smile and voice of an angel charms anyone who lays eyes on this side of hers. Ayame Enatsu A dependable upperclassmen who looks out for Satoshi. Thanks to her kind nature, everyone adores her. As the daughter of a world-renowned manga author, she is interested in drawing manga as well. She holds Satoshi very close to her heart... Maiki Hoshikawa The girl Satoshi danced with at a party. Since she was raised as a true lady, she can come off a bit naive and full of herself. Under her rich and refined exterior, however, lies a lonely girl, craving the affection of her parents, who are constantly traveling all over the world as renowned actors. Kana Takamine She stands at the very top of the hierarchy as the wealthiest person in school. As the daughter of the CEO of one of the world's leading financial groups, the Takamine Conglomerate, she quickly rose to the summit as the student body representative. Her grown-up, cool demeanor quickly earned the admiration of all her peers. No one has seen her smile before, however. Hitomi Miyazono As a first-year, she looks up to and admires Satoshi. She's a genius scientist, the type that only comes around once every century. She specializes in robotics, priding herself on having built a completely functional maid-robot. She's really passionate about her own 'Mage Club', and her goal is to make friends. Features Read through this visual novel with approximately 40 hours worth of content! Swoon your favorite princess through compelling stories of romance! Full female voice cast! Five heroines to romance! Relive touching and hilarious CG scenes with the CG Gallery feature. Listen to your favorite tunes from the game in the Music Gallery.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1026370/header.jpg?t=1573237634",
    "Price": 34.99,
    "Developers": "PeasSoft",
    "Publishers": "Sol Press",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_c954783e215c5d1be0ad77f97da096c64b44166d.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_fae45ff9a5b16ccc1f71c1e29c2d9f28fae516b1.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_ec3c4f8945ce11425f92206a80ff99d633833f34.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_b5a7e06a237f33a26d769bff845998cde1ee9a2e.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_27801d820550120467518877bf155a7d9782f052.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_14534fa388479626c99a6e1c0b199041cd4f52f5.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_51b3334f6907acc37193d57a2e630c35426e43ce.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_fc3569ccd2078382bb9f2dbc06033650702f38ee.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_eea996160912f93af48a8ff794961b21d8340693.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_d1ca2436d8065530251a07d5802b752569b529cd.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_e912ebfb01f5f85a95a867d4672db7ce4b19db4b.1920x1080.jpg?t=1573237634,https://cdn.akamai.steamstatic.com/steam/apps/1026370/ss_28c5278bd33644fb841b6544c7d08c92ae350d3b.1920x1080.jpg?t=1573237634",
    "Slug": "my-fair-princess",
    "Meta Title": "My Fair Princess: Nov 8, 2019, PeasSoft and Full Overview",
    "Meta Description": "Looking for information on My Fair Princess? Check out the release date (Nov 8, 2019), developer insights from PeasSoft, and a complete game summary.",
    "Alt Text Image": "Official header image for My Fair Princess game - Steam 1026370",
    "Canonical URL": "https://gusku.site/game/my-fair-princess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"My Fair Princess\", \"description\": \"Looking for information on My Fair Princess? Check out the release date (Nov 8, 2019), developer insights from PeasSoft, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"PeasSoft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sol Press\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1026370/header.jpg?t=1573237634\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}