{
    "AppID": 1931600,
    "Name": "NejicomiSimulator Vol.4 (a strong-willed lady gets soaked by a thick wild man's dick!)",
    "Release date": "Apr 14, 2022",
    "About the game": "A smoothly-animated Live2D onahole simulator about jamming a massive dick inside a certain strong-willed lady. Yes, delight in her lusciously animated reactions in real time. The penetration controls make it feel like it's you that's dolling out the divine dick punishment! Her movements, breaths are fully synced with the sound effects for an ultra realistic experience. This simulation has no cheap machine-generated loops; it's all been hand-tuned for maximum ERO. * Have a look at the trial version if you're not convinced! Customization? How does ball gags, blindfolds, piercings, squirt intensity, body-scribbling, dick-size/intensity, hair color, skin color, breast size, and clit size sound? There are approximately 50 customizable parts in total! Voice actor: 綾奈まりあ Click and drag to control... Head Body Ass Breast Clitoris Male performer Fiddle around with her body, see how she moves, and you might just find a new favorite position! Emotion Engine! The heroine's expressions change naturally depending on 3 parameters: Pleasure, Pain, and Stimulation. Sudden intense movements can ramp up the pain if you want to play it that way, but the choice is yours. Check the top left corner to check these parameters: Yellow: Stimulation Heart: Pleasure Red: Pain If you're having trouble controlling the parameters, a setting is included for displaying the Emotion Graph, which makes it easier to understand the exact effects of intensity, etc. Of course, it's great fun fiddling with her body, but this time, things have been taken up a notch with the multi-recording function! Record your specific motions for each part, and combine them to easily create your own original animation! Trial Version You can verify your system compatibility via the trial version. The specs are a bit high due to the real-time processing going on. The trial version is missing some setting options. Gems Get Gems for unlocking settings via a daily login bonus, climax bonuses(up to 10/day), and the Twitter connect feature. It takes about 2-5 days to unlock everything. Key Features - Enjoy 4K resolution quality ero with real-time heroine feedback, and fully customizable penetration methods and timing. It's like you're in the director's seat filming your own smut! - There are also 9 customizable shortcuts to help you get to the settings you enjoy most. (Click the hamburger button in the top right of the settings menu to access the shortcut menu) - Up to 5 preset patterns can be registered. By presetting your favorite combination of settings, you can immediately play back the optimal scene. - TONS of real-time toggles are included for spicing things up on the go! You can even remove the background, and have yourself a fun desktop accessory. Drag-action recording, replay functions, MP4 video exporting and hands-free options complete the package! (There is a problem that the application will force close when trying to use the video recording function in some environments. Please be aware of this.) Settings / Toggles SFX / Voice / BGM volume BGM selection Language toggle (Japanese / English / Simplified Chinese) Clothing ON/OF Food Bowl ON/OFF Background ON/OFF Endless squirting ON/OFF Vaginal wall display ON / OFF Unlimited milk ON/OFF Onomatope ON/OFF Piston speed Dick size Dick belt ON/OFF Dick/clit transparency Breast size Ass size Clit size Sensitivity (x1~x3000) Skin color Hair color Time stop Onahole transformation Squirting intensity Milk amount Milk type Breath Mouth Expression Heart eyes Eye size Eyebrow expression / angle / height Piercings (5 places) Body graffiti (8 places) Bar/mosaic censoring Reverberation settings Situations Nipple piercing Genital piercing Genital expansion Ball gags Gut punching Onahole transformation Time stop Breast milk Squirting Sexual training",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1931600/header.jpg?t=1650298206",
    "Price": 24.99,
    "Developers": "やぶから堂",
    "Publishers": "やぶから堂",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_71bd3c97a212afa7b8a10ac39cf87d61841e50a2.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_ff7d00f01b5d12b18df03da226a9c330b2258641.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_66a729661a006ac1f84384e770f5cba7cfd121b9.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_e599c039d7edf7e0ec1fd4f6b45533eec1d9663e.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_c6acf3221c811b995a29b7a1b008932e329d74fd.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_0f3145016e81c4c2a5f1f8aedc3960bb77000bb5.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_f616375f22de08d53029f9ef4af4d15ef3285d08.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_ba84c3e50330d39ff60ea22df0b69bb21adc81a7.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_821c315026af853fc40b8879220ffc8c7e011701.1920x1080.jpg?t=1650298206,https://cdn.akamai.steamstatic.com/steam/apps/1931600/ss_b750b29f83387e4b153fca57a020bcf27766839c.1920x1080.jpg?t=1650298206",
    "Slug": "nejicomisimulator-vol-4-a-strong-willed-lady-gets-soaked-by-a-thick-wild-man-s-dick",
    "Meta Title": "NejicomiSimulator Vol.4 (a strong-willed lady gets soaked...",
    "Meta Description": "Looking for information on NejicomiSimulator Vol.4 (a strong-willed lady gets soaked by a thick wild man's dick!)? Check out the release date (Apr 14, 2...",
    "Alt Text Image": "Official header image for NejicomiSimulator Vol.4 (a strong-willed lady gets soaked by a thick wild man's dick!) game - Steam 1931600",
    "Canonical URL": "https://gusku.site/game/nejicomisimulator-vol-4-a-strong-willed-lady-gets-soaked-by-a-thick-wild-man-s-dick",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NejicomiSimulator Vol.4 (a strong-willed lady gets soaked by a thick wild man's dick!)\", \"description\": \"Looking for information on NejicomiSimulator Vol.4 (a strong-willed lady gets soaked by a thick wild man's dick!)? Check out the release date (Apr 14, 2...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u3084\\u3076\\u304b\\u3089\\u5802\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u3084\\u3076\\u304b\\u3089\\u5802\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1931600/header.jpg?t=1650298206\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}