{
    "AppID": 1701740,
    "Name": "Noctem",
    "Release date": "Jul 1, 2022",
    "About the game": "Noctem is a psychological horror game with an element of some real life experiences. What we are trying to achieve, is to give you an immersive experience outside of what you can see in your screen and for that reason we invest mostly in an atmosphere and the ambience. Noctem is set in a little town in Alaska, with beautiful nature and mostly foggy, a place that strange things happen daily. There are whispers about the Alaska Triangle which connects the states of Anchorage, Juneau and Barrow creating a triangle in which many people have disappeared and most of them have never been found. There are many theories behind this phenomenon, but no one is willing to speak about it. People disappear and most of them remain lost. Some say they died, some say they left... Others are still searching for them, to this day. The question is, where are they? The game takes place in Dry Creek which is a little town inside that triangle. Amelia Hudson used to live in there with her family, right before she moved to England to study writing. While she was 14 years old her little brother, Tommy, was diagnosed with leukemia. After two years, he died. Her mother couldn't bare the pain and 8 months later, she commits suicide. Four years after the tragedy, Amelia was ready to move to England to study writing. But at the time she was there, she found out that her father died under mysterious circumstances in their house. She attended the funeral and devastated as she was, returned to England to continue her studies. The time of graduation was close and Amelia needed to complete her thesis. She decided to return home in order to have quiet and be able to concentrate. By the time she arrives though, she knows that something is wrong. She could feel that she was not alone in the house. Someone or something was messing with her head, her thoughts, her reality. Something is happening that is beyond any human understanding. Can she escape reality? Humans haven’t yet explained the complexity behind the theories of the parallel universes, the only thing we can do, is only imagine. ⦁ Interactive environment. Player is able to open doors, drawers, cabinets etc. with the mouse... Slower or faster...You decide what is best for you! ⦁ Pick up items and interact with them. ⦁ Carry items in inventory. ⦁ Be careful with the anxiety level. Amelia has asthma so you need to pick up inhalers and keep her relaxed. ⦁ Read and collect letters, notes, photographs and bring together all the pieces to reveal the story.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1701740/header.jpg?t=1658250106",
    "Price": 11.99,
    "Developers": "Dreamtale Studio",
    "Publishers": "Dreamtale Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_8749ddc685dff68afaafe9114588a6f5ea4f6423.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_7e92fafc5e07b0b2b2453d28eae249adc84d5fdd.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_4dd186d7522f4bd2bdfdaabe90139155410fb0c3.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_11c3f559e1c0750f0ed3cc3f79a4189b2147d4f9.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_497d4ea2e86bb9b43049faa603fbde0447c6047a.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_e214d7909dbff55f046b9038dddd4bc909ced77a.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_897b746502facdc2e7e746abbfafb3a32dc30376.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_8465954c88c2377934b125514d46f48d81793ceb.1920x1080.jpg?t=1658250106,https://cdn.akamai.steamstatic.com/steam/apps/1701740/ss_23a85963148ef9ababbafeac716764264cfb9897.1920x1080.jpg?t=1658250106",
    "Slug": "noctem",
    "Meta Title": "Noctem: Jul 1, 2022, Dreamtale Studio and Full Overview",
    "Meta Description": "Looking for information on Noctem? Check out the release date (Jul 1, 2022), developer insights from Dreamtale Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Noctem game - Steam 1701740",
    "Canonical URL": "https://gusku.site/game/noctem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Noctem\", \"description\": \"Looking for information on Noctem? Check out the release date (Jul 1, 2022), developer insights from Dreamtale Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 1, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dreamtale Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dreamtale Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1701740/header.jpg?t=1658250106\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}