{
    "AppID": 851050,
    "Name": "Paper Dolls VR",
    "Release date": "May 28, 2018",
    "About the game": "A man drove his daughter to his estranged wife's house. On the road, this man, tortured by depression, was deeply immersed in his past memories. Suddenly, his car crashed and he lost consciousness. When the man woke up, he found himself in a deserted ancient Chinese house. Could this be a dream? Or an illusion? Or a space-time anomaly? By following his daughter's voice, he began to explore this eerie ancient house. It seems, however, what had happened was by no means accidental. As he went deeper into the ancient house, all seemingly unrelated mysteries were gradually pieced together into the truth that had been buried for a century. Would the man find his daughter and leave with her safely? 'Where am I? Why am I here? What does all this have to do with me? ' Exploring an eerie ancient house Alone in a dark and gloomy old house built near the end of Qing Dynasty to find your daughter, accompanied only by creepy music, you stumble forward in fear and anxiety. Logical reasoning To search for your daughter, you will have to go through thick and thin, but as the ancient house's past events are gradually revealed, the truth is about to be uncovered. An omnipresent enemy The enemy that haunts the place is mysterious and evil, and is behind every danger. Try to survive Only by conquering fear can you survive, but when you think it's over, the real story is just beginning. A virtual reality game of creepy adventures and puzzles. Explore the ancient house, hide from danger, experience fear, and solve puzzles. Step by step, uncover the truth implied in the story. Please note : The sound is an important basis for storyline and foreseeing hazards. Please wear headphone and start the game. This is a virtual reality game of creepy adventures and puzzles. In the game, you will experience various simulated VR interactive operations. Its detailed and realistic style makes the ancient house an extremely real and gloomy place. The unique innovative movement design enables you to immerse in it for hours continuously without feeling giddy. In the game, you will experience unique oriental culture and explore the mysterious ancient house built at the end of the Qing Dynasty. A complete story line goes through the whole game. After exploring the house and solving puzzles you will finally uncover the hidden truth. The game lasts approximately 15 hours. Its music is a combination of folk music, rock 'n' roll and chanting, with realistic sound effects, you will be struck by feelings of extreme horror. Measure the route you tread and uncover each mystery you encounter. Our design philosophy is not to scare you, but to make you feel the eerie atmosphere. Experience the pleasures of exploration and conquer your own fears. Gather your courage, the Yin Family welcomes you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/851050/header.jpg?t=1618797305",
    "Price": 15.99,
    "Developers": "Beijing Litchi Culture Media Co., Ltd.",
    "Publishers": "Beijing Litchi Culture Media Co., Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_26c7a796c893d281d6d29740ce47bb94fcd65870.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_e84c2aaae1d17ba37e6b2a010268b7c2de04fdd4.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_2d5ab25fd44303fa9f79f570d322bc7ad2d6a7ab.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_250b7a8dc9fd5cb07d2ff57c843528c60ff6f978.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_01c8ed89d9bdcbbd6c3e9dc8eb354d17c928045a.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_e31bcee319e4b2362ec1023a1193918a807c3fb6.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_4aa026f9e22b10ed20026388f01e16f34b922749.1920x1080.jpg?t=1618797305,https://cdn.akamai.steamstatic.com/steam/apps/851050/ss_e2a1627c8ef3fef39a62cfdcd56c41c9616a383d.1920x1080.jpg?t=1618797305",
    "Slug": "paper-dolls-vr",
    "Meta Title": "Paper Dolls VR: May 28, 2018, Beijing Litchi Culture Medi...",
    "Meta Description": "Looking for information on Paper Dolls VR? Check out the release date (May 28, 2018), developer insights from Beijing Litchi Culture Media Co., Ltd., an...",
    "Alt Text Image": "Official header image for Paper Dolls VR game - Steam 851050",
    "Canonical URL": "https://gusku.site/game/paper-dolls-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Paper Dolls VR\", \"description\": \"Looking for information on Paper Dolls VR? Check out the release date (May 28, 2018), developer insights from Beijing Litchi Culture Media Co., Ltd., an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 28, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Beijing Litchi Culture Media Co., Ltd.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Beijing Litchi Culture Media Co., Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/851050/header.jpg?t=1618797305\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}