{
    "AppID": 1707780,
    "Name": "Parasite Infection",
    "Release date": "Sep 1, 2021",
    "About the game": "You are Chet, an average person working in a mundane job. One day you are accidentally abducted onto an alien ship as part of their bio-weapon science experiment. Explore and discover what is going on - escape if you can! Or maybe you won't want to. The vessel is filled with parasites capable of merging with and altering the body in various ways. Why are we putting this on steam: 1) It's just really cool to have a game on steam 2) The game is expanding with fan-made versions on rpgmaker, ren'py, and fan-made language localizations. Publishing on steam feels like a natural next step. 3) It is a good game development and publishing experience for the resident coder, who wants to get more into game development. Steam's rigorous submission process actually forces a lot of good generalized practices for game publishing in terms of asset management. Parasite Infection has been evolving from a pure text-based choose your own adventure story into a fairly complex game involving mind control, body modification, gender fluidity, and unique sex acts which are physically impossible under normal circumstances. The art started as stick figure hand drawn abominations (by me) and has turned into the amazing artwork you see in the screenshots (by ModeSeven). Player feedback and ideas have helped to push the game forward. There are some truly out of this world sex situations in this game which I wouldn't have thought up if it wasn't for communication with the fans. As per user feedback, we have just updated the game with parts 2+3. If you want to venture offroad, you can find larger versions of the game around the web. However, part 4+ are under construction and will not work very well (if you find versions w/ them on the deepweb somewhere) Some people have said this game is addictive. If you feel you are playing it too much, please take a break and go outside. Parasite Infection started as a way of sharing an erotic fantasy, and that's still the primary goal. I don't need your money that badly (although it does help - the artwork was only possible once I monetized the project). Games should be about fun, not entrapment. Yes I know how ironic it is that I'm saying this about a game literally designed around mind control, but it's what I believe. Finally - if you choose to buy this game, thank you for your support. I will be monitoring feedback and improving the game based on reviews and discussion.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1707780/header.jpg?t=1630946629",
    "Price": 7.99,
    "Developers": "Light Dark Deviant",
    "Publishers": "Light Dark Deviant",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1707780/ss_6ee54e1627aa40cb806a808b17b0f2eb71868550.1920x1080.jpg?t=1630946629,https://cdn.akamai.steamstatic.com/steam/apps/1707780/ss_7f4ec7e5c8f3740da4ff2586a9b184db4506ebf6.1920x1080.jpg?t=1630946629,https://cdn.akamai.steamstatic.com/steam/apps/1707780/ss_a4549e9b15414c7f01619eff808d7d4a3603b945.1920x1080.jpg?t=1630946629,https://cdn.akamai.steamstatic.com/steam/apps/1707780/ss_2745c259d70314a742fe05bb006c1548bbaa7429.1920x1080.jpg?t=1630946629,https://cdn.akamai.steamstatic.com/steam/apps/1707780/ss_93d3be5e213fcdc22662b9643d920632ebde17e0.1920x1080.jpg?t=1630946629",
    "Slug": "parasite-infection",
    "Meta Title": "Parasite Infection: Sep 1, 2021, Light Dark Deviant and F...",
    "Meta Description": "Looking for information on Parasite Infection? Check out the release date (Sep 1, 2021), developer insights from Light Dark Deviant, and a complete game...",
    "Alt Text Image": "Official header image for Parasite Infection game - Steam 1707780",
    "Canonical URL": "https://gusku.site/game/parasite-infection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Parasite Infection\", \"description\": \"Looking for information on Parasite Infection? Check out the release date (Sep 1, 2021), developer insights from Light Dark Deviant, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 1, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Light Dark Deviant\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Light Dark Deviant\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1707780/header.jpg?t=1630946629\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}