{
    "AppID": 890630,
    "Name": "Perspectrum",
    "Release date": "Aug 9, 2018",
    "About the game": "Perspectrum is an indie-developed 2D puzzle-platformer! Story Players take the role of the Tall Stranger , a being who has awakened with the power to use ancient fountains to change the elements of the world. The stranger must use spirit fragments scattered throughout the various levels to bring the mountain back to life. The game includes an overworld and five dungeons, each introducing it's own unique mechanic to help collect more spirit fragments. Features Control four elements. Switch the world between water, ice, lava, and acid to handle different enemies, solve puzzles, and conquer dungeons. Fun side-scrolling platformer mechanics. Responsive environmental physics and player control, fine-tuned to stay out of your way as you play the game. Unique atmosphere and aesthetic. Featuring pixelated, sprite-based graphics - every dungeon is uniquely designed around a specific theme. In the central town, you can interact with various villagers and learn their backstories. Five dungeons and multiple endings. In the main story of the game, there are five dungeons, each with their own unique mechanic. The ending varies depending on the number of spirit fragments collected throughout the game. Post-game challenges. Element-specific fragments are hidden throughout the world after the main story is completed for an additional test. Original soundtrack. Seven unique music tracks were composed for the game. Keyboard remapping and Xbox controller support. Play the way you want. Steam achievements. Earn them as you progress through the levels, then prove and brag to your friends about completing the game! Multi platform support. Perspectrum works on Windows, Mac, Linux, and SteamOS! Multiple languages. Play in your language of choice – options include English, French, German, Russian, Spanish, or Portuguese. Steam Cloud support. Save your game to the cloud on one computer, pick up where you left off on another computer. Indie Team - ProudMom Games Based in West Virginia, USA, our small team put many hours into creating this puzzle platform game with a different central mechanic that we believe players will enjoy. Thank you for checking out our game and if you purchased, we appreciate your support!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/890630/header.jpg?t=1572627450",
    "Price": 4.99,
    "Developers": "ProudMom Games",
    "Publishers": "Vandalia Softworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_87393798537f9dc3ddc9f22ac13c944e3960ffd6.1920x1080.jpg?t=1572627450,https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_8ba617b5b433001e8f45621218fac4b8ce65fa2d.1920x1080.jpg?t=1572627450,https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_b01ee1949eb2dac7dad4c0c57db22d7cd41f6187.1920x1080.jpg?t=1572627450,https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_fc44503d8ff576eca37542004eca812cb8dc85ab.1920x1080.jpg?t=1572627450,https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_ef820cda1163de924ee60c5fb0a8bddc269f97c3.1920x1080.jpg?t=1572627450,https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_664e7dd4ad87e26a1e88b1141e1725f7c786e155.1920x1080.jpg?t=1572627450,https://cdn.akamai.steamstatic.com/steam/apps/890630/ss_63a5caf585cc79f2381747f5c6501ede0fa1a594.1920x1080.jpg?t=1572627450",
    "Slug": "perspectrum",
    "Meta Title": "Perspectrum: Aug 9, 2018, ProudMom Games and Full Overview",
    "Meta Description": "Looking for information on Perspectrum? Check out the release date (Aug 9, 2018), developer insights from ProudMom Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Perspectrum game - Steam 890630",
    "Canonical URL": "https://gusku.site/game/perspectrum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Perspectrum\", \"description\": \"Looking for information on Perspectrum? Check out the release date (Aug 9, 2018), developer insights from ProudMom Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"ProudMom Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vandalia Softworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/890630/header.jpg?t=1572627450\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}