{
    "AppID": 1708610,
    "Name": "Pretty Girls Breakout!",
    "Release date": "Sep 28, 2021",
    "About the game": "Striking the ball at the right time, breaking blocks and collecting costumes of cute girls with animal features! A battling action-type breakout game that hits, hits, and hits back! ■ Game content Pretty Girls Breakout!' is a block-busting game where you control the player and bat the ball back at the right time. The more blocks you break, the more your character's costume will change, and when you break all the blocks, the stage is cleared and you get your character's costume! Depending on the stage, enemies will appear and shoot attack bullets, but aggressively hit back the bullets, destroy blocks and defeat the enemies to aim for the high score! There are more than 20 different character costumes and stages to choose from! ■ Use batting action to hit the ball back and break the blocks! Pretty Girls Breakout! features batting action! Hitting the ball back at the right time will result in a smash, which will accelerate the ball and increase the damage it does to the block! In addition, a series of smashes will give you a hit bonus that further increases the speed and power of the ball. In some stages, enemies will appear and fire attack bullets at you, but you can bat the bullets back at them and damage the enemies and blocks! Use your smash, which can do a lot of damage, to break blocks, kill enemies, and aim for a high score! ■ Know the different types of blocks and their characteristics, and strategize to conquer them! 'Pretty Girls Breakout!' comes with five different types of blocks, each with different characteristics. Some of the indestructible blocks rotate the bar to hit the ball back, while others will fire enemy bullets from their turrets. The player's strategy and technique are the keys to success! Also, by breaking the blocks that contain items, you will get a chance to get various power-up items. This is a normal block. It can be destroyed by hitting it with a ball or an enemy bullet. This is a block that cannot be destroyed even if you hit it with a ball or an enemy bullet. This is a block where an item always appears when it is destroyed. A block with a rotating bar on it. If a ball touches the bar, it will be repelled. This is a block that cannot be destroyed even if you hit it with a ball or an enemy bullet. This is a turret block that fires enemy bullets at your ship. It is a block that cannot be destroyed even if you hit it with a ball or an enemy bullet. ■ Use the effects of the items to your advantage and break the blocks! When you break a block, an item with various temporary effects will appear. It assists the player by slowing down the ball's movement speed and preventing it from falling through the barrier. In addition, the power to break blocks is enhanced by adding more balls, firing attack bullets, and destroying the surroundings of the block they land on. Use the effects of the items to your advantage and conquer the stage! Wide Flipper: The size and swinging range of your ship will increase. Double Ball: Adds an extra ball. Barrier: The ball can be rebounded a certain number of times, preventing it from falling past your ship. Slow ball: The movement speed of all balls slows down for a certain period of time. Shot: Fires bullets from your ship for a certain period of time. Bomb: Shoot a bomb that destroys the surrounding blocks only once. ■ Clear the stages and collect the cute costumes! As you clear each stage, you will get new costumes for your characters, which will be added to your dressing room. There are multiple costumes for each character! Try to get all the costumes for seven characters. ■ Character introduction ・ AOI A dog yokai. Aoi is a dog demon with a cheerful, energetic, and pure personality, and is loved as a mascot. ・ NAZUNA A raccoon dog yokai. She has a fast-paced personality and is intelligent, but she is not good at sports. ・ SUMIRE The fox yokai. She is a kind older sister who brings everyone together, but she has a habit of making people upset and teasing them. ・ TSUBAKI Cat yokai. She has a serious and firm personality, but she is a Tsundere who is often lax in her judgment. ・ CHERELA Daughter of the cat race. She has a strong personality, but she also has a sweet side when she is with someone she trusts. ・ PRIMINA Daughter of the dog race. She is gentle and obedient, and is as innocent as a dog ・ LATY Canine beastman. She is gentle, calm, and maternal. * Bishoujo characters are officially licensed and used. * All the characters appearing in this game are over 18 years old.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1708610/header.jpg?t=1658800064",
    "Price": 5.99,
    "Developers": "Zoo Corporation",
    "Publishers": "Zoo Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_c4625b6634390366747c651f05230804288a6a50.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_390070e39c2e2c9bdc3293eeb19e4e8f848a8c07.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_737e6c7501162c2aeb938e44bf0ef8bdfb8bbb5f.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_2fa1c117803f88beef0d1df81d92c6630890b7e3.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_0a8b1ab4153c3df6d77089c7392e50d42cd859b6.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_81b109e4b1fb9ca4a79bd193153eccf96980740a.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_39f12c57d02d1c30dfeaa4f3dfb58134da2bd2e6.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_092a4cdb7897fa22fa8839380d3f76b1edc41f9c.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_d5b4af6565eea66fcec2d61cc270888b42822f40.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_ffa1f1f731901b239bfc832a79d315c0876064d8.1920x1080.jpg?t=1658800064,https://cdn.akamai.steamstatic.com/steam/apps/1708610/ss_0c78c8b79c3bd15448c5e6a3911eeb139ae5f745.1920x1080.jpg?t=1658800064",
    "Slug": "pretty-girls-breakout",
    "Meta Title": "Pretty Girls Breakout!: Sep 28, 2021, Zoo Corporation and...",
    "Meta Description": "Looking for information on Pretty Girls Breakout!? Check out the release date (Sep 28, 2021), developer insights from Zoo Corporation, and a complete ga...",
    "Alt Text Image": "Official header image for Pretty Girls Breakout! game - Steam 1708610",
    "Canonical URL": "https://gusku.site/game/pretty-girls-breakout",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Pretty Girls Breakout!\", \"description\": \"Looking for information on Pretty Girls Breakout!? Check out the release date (Sep 28, 2021), developer insights from Zoo Corporation, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 28, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zoo Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1708610/header.jpg?t=1658800064\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}