{
    "AppID": 1262770,
    "Name": "Snake Core",
    "Release date": "Apr 21, 2020",
    "About the game": "Snake Core is an Arcade game combining the gameplay mechanics of Snake but twisting and turning the setting and variation into an inter-galactic war against an alien threat with a variation of mission types and army units. Command your army of different soldier units as they attack aliens, take out bombs, retrieve soldiers, defend key locations, and hunt down big Snake like creatures. The game plays in different game-modes, with a multi-route map that allows the player to decide the best route to the Alien Overlord. Grab power-ups to improve your soldiers skills, wipe out aliens, and increase your score.. because in true Arcade tradition, getting your name at the top of the high-score list might be the most important thing! AVAILABLE UNITS Soldier – Soldiers are pretty much frag-meat for these missions. But wee work with what we got.. Elite – Elite grunts are the best of the best, trained for off-planet missions like these. They also look pretty cool. Swat – Swat members wear protective gear, making them better in defending against alien attacks. Jeeps – Not a fan of these Jeep drivers, they are reckless and crazy. They do come in handy in battles, so we let them. Tanks – Tank drivers, the crazy ones! They’ll drive into anything while shooting like a maniac. Mech – Our scientists finally came up with something nice: heavy mobile robots, controlled by hand picked Elite soldiers. Medic – Soldier with medical training. With a medic in your ranks, you will increase the life-span of your front-runner. Defense – We’ve send out some protective guards to defend our scientists and their gadgets. (Mostly there to make the scientists less jumpy). Doc – Our scientists are working hard on… science things. Can’t win this fight without them! FEATURES Simple to understand game-loop – The game is easy to understand, and it allows everyone to enjoy the commanding of an off-world army with different units and strengths. Node based mission map – A randomized mission screen, allows you to choose which path you take to reach the end boss. Upgrades – Recruit new units, and upgrade your units for a stronger army. Short game sessions – Snake Core is designed for short gaming sessions, a great game to pick up at any time for a quick go!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1262770/header.jpg?t=1587478188",
    "Price": 4.99,
    "Developers": "Orangepixel",
    "Publishers": "Orangepixel",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1262770/ss_62caf5c81300e082968aadf72f673c9ca383ebb1.1920x1080.jpg?t=1587478188,https://cdn.akamai.steamstatic.com/steam/apps/1262770/ss_d1711398c562a651f4edb2c6e884d1f5d0577632.1920x1080.jpg?t=1587478188,https://cdn.akamai.steamstatic.com/steam/apps/1262770/ss_a145c68da2f5e938bea3f10ff3c07960f4d331aa.1920x1080.jpg?t=1587478188,https://cdn.akamai.steamstatic.com/steam/apps/1262770/ss_fb9757800bc76cb4358ec4e01c7e0e2fe77aa526.1920x1080.jpg?t=1587478188,https://cdn.akamai.steamstatic.com/steam/apps/1262770/ss_1c3feb4ba8f61b78bbfc70a96ec9a952f8ff5dab.1920x1080.jpg?t=1587478188,https://cdn.akamai.steamstatic.com/steam/apps/1262770/ss_158a966bfc381b942b5de74f1cd81c97ab2ad0c1.1920x1080.jpg?t=1587478188",
    "Slug": "snake-core",
    "Meta Title": "Snake Core: Apr 21, 2020, Orangepixel and Full Overview",
    "Meta Description": "Looking for information on Snake Core? Check out the release date (Apr 21, 2020), developer insights from Orangepixel, and a complete game summary.",
    "Alt Text Image": "Official header image for Snake Core game - Steam 1262770",
    "Canonical URL": "https://gusku.site/game/snake-core",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Snake Core\", \"description\": \"Looking for information on Snake Core? Check out the release date (Apr 21, 2020), developer insights from Orangepixel, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Orangepixel\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Orangepixel\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1262770/header.jpg?t=1587478188\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}