{
    "AppID": 1470670,
    "Name": "Squirrelmageddon!",
    "Release date": "Oct 11, 2021",
    "About the game": "About the Game Squirrelmageddon! is an solo-dev, dark humor, 'squirrels like' 3rd / 1st Person, arcade, action, RPG lite, run and gun, high score mutant squirrel shooter for single player, or 2-4 LAN / ONLINE. Difficulty Squirrelmageddon! is an arcade shooter at it's core. The ultimate goal is the high score. It's hard at first. You will die... a lot... in a 'squirrels like' way. Keep at it, level up your weapons of choice, spend skill points and upgrade your suit to insane proportions. This game rewards skill and perseverance and will result in some frantic and insane gameplay! WARNING Squirrelmageddon! contains extreme human on squirrel and squirrel on human violence. It's serious. It's bloody, It's so serious some people have begun to take it too seriously. In all seriousness, if you are taking this game too seriously, stop it... but if you are looking for something completely different, or perhaps some quick 'hardcore mutant squirrel action'... Highlights: - Versatile action shooter core. Play the game the way you want to play it - Plenty of cheese opportunity for those that like cheese - One of the most consistently amusing corpse launch physics of any game ever made - Train skills and upgrade your power suit - RPG Lite elements with character weapon load out, suit mods and skill management - New features, improvements, upgrades and content added weekly CURRENT FEATURE LIST: - 12 maps (including Halloween and Xmas event maps) - 10 biomes - 52 missions (complete all missions to face the Uber Squirrel!) - 8 hive soldier characters (perma-death on Insane difficulty) - 15 Weapons (including Proximity Mines and Grenades) - Sonic Plasma Turrets (moveable) - drop FAN BLADE TRAPS - playable 'chipped' squirrels (in single and multiplayer) - mission system with objectives (or just shoot mutant squirrels for stress relief lols) - continuing a failed mission keeps objective progress to reduce grind - 4 difficulty levels with increasing soldier PTSD (Post Traumatic Squirrel Disorder) recovery times - progressive time of day most maps (continuing progresses time) - persistent unit armory (weapons found or bought are usable by all characters) - primary and secondary weapon load-out - hive shop to sell and buy goods - soldier training and skill unlocks - power suit mods / upgrades - unlock maps / zones by completing missions - 1-4 players LAN or Online (local listen server) - 3rd / 1st person camera toggle hotkey - Quick glider toggle (glider as an arcade gameplay mechanic) - 8 GM Squirrel sizes - Barricades, crates and other moveable objects (in single and multiplayer) - placed moveable objects are persistent until reset (single player) - weapon leveling and proficiency progression - pickups (weapons, items, recyclables and orbs of delight) - End game completion time 20-40 hours depending on your skill and strategy - Global High Score Leaderboards DEVELOPER NOTE: Squirrelmageddon! was made on the Unreal Engine by a solo developer using both custom and marketplace assets. I am making a game with a balance of shooter, RPG and action arcade gameplay. It's janky, it's un-polished, it's insane and will be continually being updated until I'm ready to start Squirrelmageddon! 2. Expect continual improvements and new features at least until the end of 2022! I want to thank everyone who has contributed to the project with their advice, help, and support. Thank you as well to Epic, Steam and all the talented asset creators who have made their awesome work available to us solo-devs - without whom crazy experimental games like this would never have been possible...! Hope you have some fun and laughs with Squirrelmageddon! See you top-side!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1470670/header.jpg?t=1656757739",
    "Price": 4.99,
    "Developers": "Squirrel Brain Games",
    "Publishers": "The Streets Network",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_dbceac713c4efcb24ca39272b83a4093e85c9b86.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_d1208775ff8e51488bb3b525ce0389f0e92ca898.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_0d93c0a9da749d45b0b0ff9ba5153e6b3b8d43bb.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_e0f159035f3aaf0ff52d63966e8b407bede2b9aa.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_78f2b7234369fcb8b13fbf600d3a3b36e3a4e3d3.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_d626d7b29a97e7b29bbaa843b22f64b43beb78bc.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_14551ea8179a94de93d61a4aa768ec5c426cce2e.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_fd2dd300497ce48d210a14875252b8513f84e805.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_691105be955655abe971cf5484f9eedd112a3933.1920x1080.jpg?t=1656757739,https://cdn.akamai.steamstatic.com/steam/apps/1470670/ss_0bcf49a8de625c9a94f1d961f7848190feb258e0.1920x1080.jpg?t=1656757739",
    "Slug": "squirrelmageddon",
    "Meta Title": "Squirrelmageddon!: Oct 11, 2021, Squirrel Brain Games and...",
    "Meta Description": "Looking for information on Squirrelmageddon!? Check out the release date (Oct 11, 2021), developer insights from Squirrel Brain Games, and a complete ga...",
    "Alt Text Image": "Official header image for Squirrelmageddon! game - Steam 1470670",
    "Canonical URL": "https://gusku.site/game/squirrelmageddon",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Squirrelmageddon!\", \"description\": \"Looking for information on Squirrelmageddon!? Check out the release date (Oct 11, 2021), developer insights from Squirrel Brain Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Squirrel Brain Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Streets Network\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1470670/header.jpg?t=1656757739\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}