{
    "AppID": 573090,
    "Name": "Stormworks: Build and Rescue",
    "Release date": "Sep 17, 2020",
    "About the game": "Join a world where you design, create and pilot your own air sea rescue service. Stormworks: Build and Rescue is a rich and dramatic physics playground. Take your custom-designed, block-based and programmable vehicles into fierce oceanic storms. Plan and execute thrilling rescues in a variety of challenging crisis scenarios. Export and share your meticulously designed vehicles and missions with other players via the Steam workshop. Stormworks: Build and Rescue - create, rescue and release your inner hero! Custom Creative Mode Play the game how you want. Custom mode gives dozens of creative tools and options, suited for players who like to let their creativity run free and wild. In this mode, you are not limited by the survival and realism rules allowing you to create large and complex vehicles from the outset. Ideal for players who like to create scale replicas of real-world vehicles or wacky and ambitious creations of their own design. Career Survival mode Career mode focuses on progression and an overarching plot of starting your own search and rescue service from humble beginnings and building it up to cover the entire Stormworks world map. You will have to manage your finances, build space, and your own safety as you complete various missions to finance larger, more complex vehicles and new land bases. Survival difficulty options Survival difficulty options add an extra level of difficulty to your search and rescue operation with the most in depth and advanced game features including: advanced engine and fuel mechanics, LUA based micro controllers, vehicle damage, spreadable fire, and a variety of player damage types that can result in player deaths including: fall / impact damage fire damage prolonged exposure to the sea resulting in hypothermia mechanical damage (rotor blades) water pressure damage ...and sharks! Construct vehicles by placing blocks in a rich editing suite, customize them with your own design and program their behaviour using the powerful in-game logic system. Choose from a wide array of components to assemble your own rescue helicopters, boats, submersibles and more… Take to the sea, land or sky in your newly created vehicle. Navigate through over 15,000 square kilometres of ocean and islands in an amazingly dynamic world. Players will need to ensure that they create the right vehicle for the job as every mission is unique. Design specific vehicles to respond to challenging missions across open oceans, island facilities, remote rigs and more. Rescue survivors from the water, fight fires, help repair oil rigs, operate nuclear power station machinery and more. Create and share your own missions using the rich missions editor. Unlock new locations and components in career mode or explore your imagination in creative mode. Join your friends in cooperative multiplayer as you operate multi-crew vehicles, and execute complex missions involving careful planning and coordination. The day-night cycle and dynamic weather system create diverse environments to put your creations to the test. From calm sunny mornings, to unforgiving stormy nights and even tsunamis - strong winds can turn the ocean from gentle ripples to fierce heaving waves, affecting your vehicles using physics-based hydrodynamics and displacement-buoyancy systems.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/573090/header_alt_assets_2.jpg?t=1654186079",
    "Price": 24.99,
    "Developers": "Geometa",
    "Publishers": "Geometa",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_8d88ab68e09667c7e11206b8019388189e58555d.1920x1080.jpg?t=1654186079,https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_9c4e929ee6327e9daae3307e94ee98c14c2ac10f.1920x1080.jpg?t=1654186079,https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_81ff65074f8fab794c13914362f65f4965ee4f44.1920x1080.jpg?t=1654186079,https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_b58213e1fba782392bcc70e1c53422b4b9a8962e.1920x1080.jpg?t=1654186079,https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_3e0c7b083e0cc203e1dccdd9c4eeb243756ca63d.1920x1080.jpg?t=1654186079,https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_849b22f2c3045f5845af55a5de912a785fdefece.1920x1080.jpg?t=1654186079,https://cdn.akamai.steamstatic.com/steam/apps/573090/ss_4bee406f666c24cce8e7dfd5d96384284e529c25.1920x1080.jpg?t=1654186079",
    "Slug": "stormworks-build-and-rescue",
    "Meta Title": "Stormworks: Build and Rescue: Sep 17, 2020, Geometa and F...",
    "Meta Description": "Looking for information on Stormworks: Build and Rescue? Check out the release date (Sep 17, 2020), developer insights from Geometa, and a complete game...",
    "Alt Text Image": "Official header image for Stormworks: Build and Rescue game - Steam 573090",
    "Canonical URL": "https://gusku.site/game/stormworks-build-and-rescue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stormworks: Build and Rescue\", \"description\": \"Looking for information on Stormworks: Build and Rescue? Check out the release date (Sep 17, 2020), developer insights from Geometa, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 17, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Geometa\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Geometa\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/573090/header_alt_assets_2.jpg?t=1654186079\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}