{
    "AppID": 1655800,
    "Name": "System Under Surveillance",
    "Release date": "Feb 25, 2022",
    "About the game": "System Under Surveillance (SUS) is an upcoming indie stealth game with adventure and puzzle elements, reminiscent of some of the classics of the 80s and 90s. The graphic style is retro with a modern twist, with gameplay taking place in an old-school isometric world, while the story unfolds as an interactive comic book with all illustrations hand-drawn in pixel art! THE STORY SO FAR: Adam is a young boy, who only remembers running away from the burning car his mother had just crashed into the side of a building. He now finds himself alone in the middle of a dystopian city without any trace of his mother, or anyone else for that matter. Being chased by mysterious robots, Adam runs deeper into the labyrinthian city trying to escape. This is where he meets the eccentric cleaning robot called TURBO. Despite its name, TURBO is clumsy and slow, but has a big digital heart. Adam and TURBO team up to escape the robots and uncover the truth surrounding the accident and the desolate city. IT'S A COMIC BOOK, TOO!: Get drawn into the game through its carefully illustrated pixel-art comic book. Your progress helps tell the story. Recover the missing pages to piece together the unsettling truth behind the accident and why you’re being followed wherever you go by deadly robots. And the story has only just begun. STEALTH OR DIE: In the world of SUS, you have no power over your enemies. You’re completely vulnerable! Without any combat capability, your only chance of surviving is through stealth. Scan your surroundings and work out how to use them to your advantage. Make the most of each character’s unique abilities to trick your enemies, sneak past them and stay undercover. SWITCH BETWEEN TWO UNIQUE CHARACTERS, AT ANY TIME!: TURBO ,is a rickety old cleaning robot, but it has some very handy skills! It can: hover above holes to propel itself to new areas; transform into a metallic ball and roll up pipes and down narrow alleys; generate a powerful electric shock by spinning in place, temporarily disabling nearby electronics; Adam , is a regular boy who is also uncommonly resourceful. He can: remotely take control of enemies, open doors and disable security systems; create diversions with everyday objects; make use of clever gadgets to solve the puzzles in minigames; and more... NO ORDINARY HEALTH SYSTEM: SUS replaces the old-school health bar with a threat level . It serves to immerse you even further into the story, bringing you closer to Adam, the ordinary boy whose life depends on outsmarting his enemies. Stay undetected to keep the threat level low, or get detected to make enemies follow you, only to trick them into letting you into restricted areas. The threat level goes back down when you hide. But you can’t stay hidden forever! WELCOME TO AN UNWELCOMING CITY The streets of the city of New Eden are narrow and maze-like. The government has imposed a very strict curfew on the citizens, and tightly controls the flow of information. For these reasons, automatic drones are mobilized to patrol the street to arrest anyone who defies the curfew. The streets are also littered with AI controlled surveillance cameras. Being a young boy, Adam’s chances of freedom are narrow. He cannot possibly fight back through sheer force, but together with TURBO, he just might have what it takes to sneak around and trick the enemies to his own advantage. As he explores the city in his quest to find more details about the accident, he must also collect encryption keys, called Data Cubes, allowing him to decrypt the information the local government does not want anyone to see. It turns out, that the quest might lead to a much darker path than first anticipated.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1655800/header.jpg?t=1647252344",
    "Price": 15.99,
    "Developers": "Ink To Pixels",
    "Publishers": "Ink To Pixels",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_cbbb263f2f14c5081e708f658ad96302bab23f5d.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_c637afa54225a0a2edb5c421b435019574766c2a.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_08f9e4ea23c4929d9d3e6b08f99723472277f66a.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_48be7b41bbf60d642c6ccd8896419a4a99f78268.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_92bb389b3f94bb85d7b37ed53e0c0bc2cca8ef63.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_ca1a753eb19591415ee38830d6c8f9ebe0dc15d5.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_0df2645e5842bc4bbc1c376c9efd21c8302cc8ad.1920x1080.jpg?t=1647252344,https://cdn.akamai.steamstatic.com/steam/apps/1655800/ss_09032dbf7347627a963de6e97776926d5cb54789.1920x1080.jpg?t=1647252344",
    "Slug": "system-under-surveillance",
    "Meta Title": "System Under Surveillance: Feb 25, 2022, Ink To Pixels an...",
    "Meta Description": "Looking for information on System Under Surveillance? Check out the release date (Feb 25, 2022), developer insights from Ink To Pixels, and a complete g...",
    "Alt Text Image": "Official header image for System Under Surveillance game - Steam 1655800",
    "Canonical URL": "https://gusku.site/game/system-under-surveillance",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"System Under Surveillance\", \"description\": \"Looking for information on System Under Surveillance? Check out the release date (Feb 25, 2022), developer insights from Ink To Pixels, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ink To Pixels\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ink To Pixels\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1655800/header.jpg?t=1647252344\", \"offers\": {\"@type\": \"Offer\", \"price\": 15.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}