{
    "AppID": 1525700,
    "Name": "Tavern Master",
    "Release date": "Nov 16, 2021",
    "About the game": "Design and build your own medieval tavern! Tavern Master is a medieval tavern management game where you are in charge of building, maintaining and running your very own cozy tavern! Buy tables and benches, fill barrels with drinks, hire staff and you are ready to serve your first customers. Make sure your employees are happy, there are enough drinks and seats for guests and soon you will be able to expand your business in various ways. Build a kitchen and hire chefs to start serving food of all kinds. Make sure that there are enough ingredients or your customers might leave angry Hold special events to attract special customers who have very specific food and drink requirements. They will come in the morning and stay all day Hire musicians to attract more people to your tavern and make customers have more patience while waiting for a drink Build your dream tavern You will have many tools at your disposal that will help you create a perfect tavern. There are many different walls, floors, fences, stairs and furniture that will make every tavern unique. At the beginning there will not be enough gold to buy the best quality furniture but as your business grows so will the tavern! As a cherry on top, make sure to think of an amazing name for it! Optimize the workflow In order to attract customers you will need to have enough seats and tables with a light source close by. The surrounding area also needs to look beautiful and decorations will help with that. At one point there will be a lot of guests coming in and it is important that your staff can serve everyone before they leave angry from waiting too long. In order to do that you will have to design the space so there is an efficient way for your employees to walk in an optimized route. Create rooms for overnight stay Some of the guests will want to spend the night so it’s a great thing that you can create rooms with beds in your tavern! Every room will be rated with stars from 1 to 5 which will determine how much money you can earn from the guests. It’s your choice if you want to create big rooms with 5 beds or smaller rooms with expensive furniture that would make guests spend more money. Many ways to play There are many different possibilities in Tavern Master and there is no single best way to play. You can spend your time decorating the tavern and making it look cozy and beautiful, you can work towards maximizing revenue by adjusting seating arrangement, prices and salaries for the staff or figure out a completely new way like building only bedrooms instead of having the bar and the kitchen.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1525700/header.jpg?t=1654080232",
    "Price": 14.99,
    "Developers": "Untitled Studio",
    "Publishers": "Untitled Studio,WhisperGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1525700/ss_12f9d1b425e277ff22137372be3d483e5d38ea3d.1920x1080.jpg?t=1654080232,https://cdn.akamai.steamstatic.com/steam/apps/1525700/ss_3a425af699721878ca2dbc5eb876ad4de5cc54dc.1920x1080.jpg?t=1654080232,https://cdn.akamai.steamstatic.com/steam/apps/1525700/ss_dc8ccdc4a509c99e6abe7bcd45a12d21dd6be342.1920x1080.jpg?t=1654080232,https://cdn.akamai.steamstatic.com/steam/apps/1525700/ss_6519b1eae02bc1f98f74ba196877b83cbe10dcd7.1920x1080.jpg?t=1654080232,https://cdn.akamai.steamstatic.com/steam/apps/1525700/ss_895942a2f1920bb8a6447dca456a6ad0924dbb5a.1920x1080.jpg?t=1654080232,https://cdn.akamai.steamstatic.com/steam/apps/1525700/ss_7b3057aac770cd6806abb972cc7a8ca1087c573d.1920x1080.jpg?t=1654080232",
    "Slug": "tavern-master",
    "Meta Title": "Tavern Master: Nov 16, 2021, Untitled Studio and Full Ove...",
    "Meta Description": "Looking for information on Tavern Master? Check out the release date (Nov 16, 2021), developer insights from Untitled Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Tavern Master game - Steam 1525700",
    "Canonical URL": "https://gusku.site/game/tavern-master",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tavern Master\", \"description\": \"Looking for information on Tavern Master? Check out the release date (Nov 16, 2021), developer insights from Untitled Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Untitled Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Untitled Studio,WhisperGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1525700/header.jpg?t=1654080232\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}