{
    "AppID": 1544250,
    "Name": "Trickery&Strategy",
    "Release date": "Mar 2, 2021",
    "About the game": "In the game, the player plays a king who has just succeeded to the throne in the spring and Autumn period. Through the way of full picture war chess to dominate the world. All the following play methods are carried out around the war map. Main playing methods: war [/] The battle mode is the world round system of hexagonal grid. Players have enough time to think about the arrangement of troops. Let's first demonstrate some basic art of war. (there will be more art of war in the game) night attack [/] Attacking the resting enemy at night can make the enemy fall into chaos for a short time and cause a large number of casualties. The force value of a general will affect the number of casualties. ambush [/] Predict the enemy's marching route in the enemy's field of vision. Find a shelter, set an ambush and wait for the enemy to approach and ambush. It will cause long-term chaos and a large number of casualties. The intelligence value of a general will affect the number of casualties. The choice of bunker is influenced by the intelligence of the general. The intelligent general can ambush in any terrain. rockfall [/] Use the terrain difference to launch rockfall. With very few troops, it can cause a large number of casualties to the enemy. The intelligence value of the general will affect Number of casualties. Poor terrain will affect the number of casualties. charge [/] Charge in one direction and increase the impact force by 20% for each run-up. When the impact force is 100%, it will impact Disrupt the enemy's formation and repel the enemy. drowning [/] Make use of the characteristic that the charge can repel the enemy and repel the enemy into the water. It can drown the enemy and cause great damage Number of casualties. fire attack [/] Set fire to the combustible and then control the enemy's position. Caused a large number of casualties to the enemy. The more the enemy, the more the wounded The greater the death. The fire is divided into 1 ~ 10 levels. The higher the intelligence of the general, the greater the fire caused by arson. Fires above level 5 will Ignite the surrounding combustibles according to the wind direction. Players can build combustibles by themselves. The army uses the chinese words to express the current formation and state of the army. From the understanding of the military dispute in Sun Tzu's art of war. it's as fast as the wind [/] The army is in a rapid marching formation, which can increase its movement speed. This posture is not good at fighting and is very afraid of the ambush in the 'Yin' posture. Slow as a forest [/] The army is in formation. This posture is suitable for combat, but it moves slowly. plunder like fire [/] The army is in a state of death battle. The damage of this posture is extremely high. It can be launched only when the morale is full. immobile as a mountain [/] The army is in a defensive formation. This posture has extremely high defense and is suitable for inferior defense. it's hard to know [/] The army is in an ambush. Successfully squatting to the enemy will confuse the enemy. The army in this posture cannot be seen in front of the enemy. move like thunder [/] The army is in a charge formation and can only move forward in a straight line. It needs to be completed quickly because it is afraid of being attacked. This state State can rush the enemy formation and repel it. line up [/] The army is on March, with moderate speed and attack and defense. make the enemy confused [/] This posture is for suspicious soldiers. After launching, the enemy can't judge your real soldier number, but it can't move and needs a shelter. the whole army rested [/] The army is at rest and will suffer heavy losses if attacked. Do nothing and keep this state to the next Half a day will restore energy. Rest at night will recover more energy than rest during the day. formation chaos [/] The army is in a state of chaos and will suffer heavy losses if attacked. The execution of certain orders will turn the army into 'Chaos' requires the general to regroup. This state cannot rest automatically. morale and energy [/] Morale and energy will directly affect the outcome of the war. A good general must learn to control The morale and energy of soldiers. When you are an army, morale and energy are 40%. Suppose you this time The damage caused by attack is 1000 points. Due to the influence of morale and energy, the result will be: five hundred × 40%+500 × 40%=400 armor [/] Equipping soldiers with armor gives soldiers immunity, but reduces execution. No armour, no damage 0%, initial execution. Light armour, 40% damage free, initial execution force / 2. Heavy armor, 80% damage free, initial execution force / 4. arms restraint [/] characteristics of arms [/] Allies can take 80 ~ 30% of the damage when parrying the enemy's bow and arrow The damage. Under the influence of command. Long spearmen: long spearmen have super impact resistance (they can't be rushed by the enemy), the main general The higher the command or force, the higher the impact resistance, up to 100%. Halberd Soldier: the king of positional warfare. He doesn't move after attack. Each attack will increase by 10% The damage. Increase by up to 60%. Archers: the most lethal weapon in the era of cold weapons. Volley will cause additional streamer damage, The higher the number of target troops, the higher the damage of streamer. Chariot: increases the impact power by 20% when charging. Charge the chaotic troops, There will be a damage bonus equal to the impact force, up to 60%. Leather vehicle: a transport unit that automatically replenishes military rations for friendly forces within two squares. Scouts: scouts, with survival skills, can get food in rivers and forests. using terrain [/] The terrain in the game is curved. Players can use the terrain difference to avoid injury. The higher the terrain, the worse the injury. world [/] This small box will record the historical events taking place in the world at that time. These events will directly affect the national strength of other countries. For example, when Guan Zhong is too slaughtered, the state of Qi will enter a strong period, unless the player has national strength Very strong, otherwise it's best not to fight directly. plot [/] When encountering an enemy that is difficult to defeat head-on. First find the enemy's city and send detailed work Then ask your own counselors for advice. Your own counselors will help you analyze the enemy's weaknesses, Then make a plan. The Nangong changwan here has the characteristic of drinking, so he can Drunk him with wine. It made it impossible for him to command the army for a certain period of time. Internal Affairs [/] Players need to gather talents and establish their own cabinet team at the beginning. The official system in the game is completely consistent with the historical books, including taizai, Zongbo, Sikou, Sikong, situ and Sima. As Liuqing, interact with players and govern the country! There are also low-level officials subordinate to Liuqing, who implement their functions to assist players in governing the country! Good internal affairs will provide players with a large population and army. And equipment, materials and military grain. The following is an example of officials managing the population: After this official is appointed, he will tell you about your capital Total population, distribution of population types, utilization rate of each population type, Last month's capital, food, material income, and per capita ownership value. It can also adjust the tax rate of each population type and the proportion of each population type. You can also conduct a census to see the specific number of men, women, young and old Unemployment rate to help you better govern the country. We can even adjust social productivity by controlling the current social climate. Note: if you lead troops, the population change of the club will also be real Embodied in the game. If you go out in large numbers in the autumn harvest month, it will be very difficult Seriously affect your food output and taxes. Let's take another example: In ancient times, the function of officials was to manage all officials. We find that Mozi in Figure 1 has been dissatisfied. Then find it Bian he, who served as a secretary, told us that we were normal and no one was dissatisfied. these two items. The contradiction of information made us feel that something was wrong, so we found someone who was better at commanding Sun Wu served as the secretary. Then we found that Sun Wu gave us a completely different answer. story [/] Historical figures will have corresponding historical stories. After completing the historical story to which the character belongs You will get the corresponding famous products or characters. Take Bian he's story as an example. After completion, you will get the well-known Heshi Bi. harem [/] Players can study and practice martial arts in the harem to improve themselves. Enhance command and force Will improve the monarch's own combat effectiveness. Intelligence will enhance the feasibility and harm of the strategy. Politics and charm will enhance the ability of internal affairs. Of course, the most important thing is to open the harem and interact with your favorite characters. Get children. door guest [/] It is the most popular thing in the spring and Autumn period to have 3000 door guests. We can also accommodate guests. Sent out on an assassination mission. assassination [/] When a player becomes enemies with a country. You may encounter an assassin sent by the other party assassination. You can appoint personal guards and guards to protect yourself. Of course you I am confident in my martial arts and can choose a hand blade assassin. The above is only an introduction to the types of games, not all the contents of the game. Actual game The content is much larger than the above introduction. If it's your favorite type, you can buy games Experience, thank you for reading.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1544250/header.jpg?t=1653360983",
    "Price": 9.99,
    "Developers": "Ian Young",
    "Publishers": "Ian Young",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1544250/ss_302af0a04881d6ddf9a92cf836ceb8f9601125d4.1920x1080.jpg?t=1653360983,https://cdn.akamai.steamstatic.com/steam/apps/1544250/ss_ed600e54f5d2117ea0c4867b505d4cb26ed0765b.1920x1080.jpg?t=1653360983,https://cdn.akamai.steamstatic.com/steam/apps/1544250/ss_f51699197f614b430a38340b33db7805b142935e.1920x1080.jpg?t=1653360983,https://cdn.akamai.steamstatic.com/steam/apps/1544250/ss_61417c9c76b2a9760b9255afc6796a05c7835a9c.1920x1080.jpg?t=1653360983,https://cdn.akamai.steamstatic.com/steam/apps/1544250/ss_1fb03b45e837fd26d34f76f6aafd6f1e6fee0d57.1920x1080.jpg?t=1653360983",
    "Slug": "trickery-strategy",
    "Meta Title": "Trickery&Strategy: Mar 2, 2021, Ian Young and Full Overview",
    "Meta Description": "Looking for information on Trickery&Strategy? Check out the release date (Mar 2, 2021), developer insights from Ian Young, and a complete game summary.",
    "Alt Text Image": "Official header image for Trickery&Strategy game - Steam 1544250",
    "Canonical URL": "https://gusku.site/game/trickery-strategy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trickery&Strategy\", \"description\": \"Looking for information on Trickery&Strategy? Check out the release date (Mar 2, 2021), developer insights from Ian Young, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ian Young\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ian Young\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1544250/header.jpg?t=1653360983\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}