{
    "AppID": 1296410,
    "Name": "Underdog Arena",
    "Release date": "Jun 26, 2020",
    "About the game": "What is this game? The goal is to score a set amount of points faster than your opponents. However, with each death, your character becomes stronger. So, the player who does the most poorly will eventually gain the upper hand. This mechanic evens out matches that could otherwise have a pretty clear winner, which is more fun for everybody involved. It also makes it a lot of fun to spectate! Why is this game? I'm glad you asked! Remember the good old days of huddling up on your friend's worn down couch to slap the pixels out of each other in a video game of questionable quality? Oh, you don't? Well, I do, and that's what inspired the creation of this game. It's made for anyone who enjoys playing video games, regardless of experience. It's easy to understand the objective of the game and the controls are configured to suit inexperienced (intuitively jump with the A button) and more experienced players alike (jump with a shoulder button to enable full twin-stick control). So jump into that couch (physical or digital via Remote Play Together ) and have some fun! What is included? The game includes three modes: * Free-for-all: Fight against each other in a classic, winner-takes-all game mode, where every competitor fends for themselves. That is, unless you decide to help each other take down the strongest enemy in order to get a leg up. * Team Versus Team up with one or more friends. This mode is ideal for 2 vs 2 or if you want to team up against the most confident player in your group. As a father, this is the game mode I play with my kids. They team up against me, but I'm sure that will change once they become better video gamers than me... * Capture the Flag The classic game of Capture the Flag changes up the format. You win by capturing the other team's flag, but the enemy still grows stronger with every death. It mixes a little strategy into the frantic platforming fighting. Summary: This is a pretty simple (as in easy to pick up ) action game with a twist; the worse you do, the stronger your character becomes . You might think that this is some profound metaphor for life or something. It isn't. But it makes for some fun, exciting gameplay, which is why you're here in the first place, right? So, grab a couple of friends, jump up on that old couch (physical or digital) and duke it out for old time's sake!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1296410/header.jpg?t=1601499120",
    "Price": 3.99,
    "Developers": "Björn Fredberger",
    "Publishers": "Björn Fredberger",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_b47b02cd5176f50f625e9afbb984517a3d2f380a.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_9f65be159ed1e6ea4856fca0d551654c40b5de29.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_e23e96dcdce214a9e71f00078f9225cb120294f5.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_cc1270a8f6003b2259dc0b694485df1cfe575a80.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_bc15009fced755e827ee61b4ce9218a672e212ad.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_3db4209054a4a86e7067faa72b11a31d7662eb2a.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_0cce99422187e74f1a0364e864639e3561a95125.1920x1080.jpg?t=1601499120,https://cdn.akamai.steamstatic.com/steam/apps/1296410/ss_5545831efd8dbddac1a7b96f84b902a7df8cb034.1920x1080.jpg?t=1601499120",
    "Slug": "underdog-arena",
    "Meta Title": "Underdog Arena: Jun 26, 2020, Björn Fredberger and Full O...",
    "Meta Description": "Looking for information on Underdog Arena? Check out the release date (Jun 26, 2020), developer insights from Björn Fredberger, and a complete game summ...",
    "Alt Text Image": "Official header image for Underdog Arena game - Steam 1296410",
    "Canonical URL": "https://gusku.site/game/underdog-arena",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Underdog Arena\", \"description\": \"Looking for information on Underdog Arena? Check out the release date (Jun 26, 2020), developer insights from Bj\\u00f6rn Fredberger, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bj\\u00f6rn Fredberger\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bj\\u00f6rn Fredberger\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1296410/header.jpg?t=1601499120\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}