{
    "AppID": 443650,
    "Name": "Wailing Heights",
    "Release date": "Apr 27, 2016",
    "About the game": "A coffin-rocking, body-hopping, musical adventure game, set in a horrific hamlet of monsters. Set in a peaceful, blood-curdling village blessed with gorgeous panoramic mountaintop views and the blissful stench of rotting corpses, Wailing Heights is home to the likes of vegan werewolves, hipster vampires, soulful zombies and all manner of well-adjusted supernatural taxpaying home-owners. Story Meet Frances Finklestein​ , the one-time manager of the all-time greatest rock band that Great Britain ever produced: The Deadbeats​ . After being invited to a gig in a town no one's ever heard of, Frances Finklestein is trapped in a holding cell, charged with the crime of... Being Alive! A mysterious cellmate teaches you the power of possession. You learn to “body­-hop”, leaving your corpse in the holding cell and jumping from ghost to vampire to werewolf to zombie. Each creature’s skills and abilities bring you one step closer to getting your body out of lock-up and getting the hell out of Wailing Heights. But of course, it’s never that easy… As you jump from one musical monster to another, familiar sounds and faces start up show up. The Deadbeats have returned as the undead, and they want to get the band back together. Gameplay In the style of classic adventure games, you will need to talk to the locals, choosing just the right thing to say (and who to be), collect lyrics as you explore the town, listen to musical clues, and like all great songwriters; steal things from other songs. Add these ingredients to your musical possession wheel, and sing your soul right into a monsters' body, gaining their supernatural abilities and moving one step closer to escaping Wailing Heights. Features A laugh-out-loud script from Kevin Beimers , who brought you tthe critically-defamed Hector: Badge of Carnage (Published by Telltale Games) and Schrödinger’s Cat and the Raiders of the Lost Quark (Published by Team17) Gorgeous comic-book styled visuals and cut-scenes, brought to you by awesome artists such as John Mc Farlane (The Revenants), Glenn Fabry (Preacher), John McCrea (Hitman), PJ Holden (Judge Dredd) and more... Over 4000 lines of quality voice acting! An original soundtrack of indie, pop, soul and country tunes!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/443650/header.jpg?t=1599129114",
    "Price": 9.99,
    "Developers": "Outsider Games",
    "Publishers": "Outsider Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_c4138413ceb149df6637c2b72ff5213ce1fc12cd.1920x1080.jpg?t=1599129114,https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_a275cad525a9cf305d5421625b845aa6e8794b9e.1920x1080.jpg?t=1599129114,https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_bf112e00c06c5a4d9ef4a4432484e79e671f22b6.1920x1080.jpg?t=1599129114,https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_0daae4af25c7be45c398bedefacae19c54aba2e4.1920x1080.jpg?t=1599129114,https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_06e10a615d603a975e9b9504e016dbe3f2577057.1920x1080.jpg?t=1599129114,https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_7a043b43c33f2a3708775f76119f773a84917e64.1920x1080.jpg?t=1599129114,https://cdn.akamai.steamstatic.com/steam/apps/443650/ss_1b1bc918ab9767e447dbda9ecc1f6585de730f8f.1920x1080.jpg?t=1599129114",
    "Slug": "wailing-heights",
    "Meta Title": "Wailing Heights: Apr 27, 2016, Outsider Games and Full Ov...",
    "Meta Description": "Looking for information on Wailing Heights? Check out the release date (Apr 27, 2016), developer insights from Outsider Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Wailing Heights game - Steam 443650",
    "Canonical URL": "https://gusku.site/game/wailing-heights",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wailing Heights\", \"description\": \"Looking for information on Wailing Heights? Check out the release date (Apr 27, 2016), developer insights from Outsider Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Outsider Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Outsider Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/443650/header.jpg?t=1599129114\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}