{
    "AppID": 936780,
    "Name": "Warplanes: WW2 Dogfight",
    "Release date": "Apr 6, 2019",
    "About the game": "Grab the control yoke of a warplane and jump into the battlefields of World War 2 in this thrilling combat flight action game. In each of the campaigns for USA, Great Britain, USSR, Germany and Japan you will assume the role of a pilot and squadron leader of an elite air force unit, established for the most dangerous and strategic missions that can turn the tide of war. In Warplanes: WW2 Dogfight you take control of over 50 historical airplanes – from classic fighters to light and heavy bombers. Spitfire, P-51, Hurricane, Lancaster, Il-2 “Shturmovik”, La-5FN, Ju-87 “Stuka”, Fw 200 “Condor” and B-17 “Flying Fortress” are only a few of the beautiful machines that you can fly, repaint, customize and upgrade. Gather a squadron of the best pilots and train them to assist you in the most risky missions. If you need an additional adrenaline rush, you can go on a mission by yourself and rule the sky. Build your base – construct additional hangars and structures for your pilots and crew. Ensure its safety by building anti-aircraft artillery and barrage balloons. Develop your management skills to cut costs and manage your unit more efficiently, and become the ultimate squadron leader. Play through varied missions in each of the available campaigns – experience deadly encounters with enemy fighters, protect ground structures from bombers, fight over the sea and weaken the enemy’s navy, pilot bombers and destroy targets of strategic value. These are only a few examples of multiple mission types that you will experience in the beautiful landscapes of Europe, Africa and Asia. Pick the best planes and pilots for the job and fly over the cold Russian tundra or sunny deserts of Egypt. Fight over the Pacific Ocean and experience the war from the perspective of American and Japanese pilots. EXPERIENCE WW2 FLIGHT COMBAT LIKE NEVER BEFORE WW2 air combat game with intuitive controls and user-friendly flight mechanics. Over 50 historical planes from RAF, Luftwaffe, American, Japanese and Soviet Air Forces, with various customization, paint and upgrade options. As squadron leader, you are tasked with more than piloting your plane – you also manage the base. Buy planes, recruit and train pilots, and keep building additional structures. Detailed 3D graphics with awesome special effects. Radio chatter in American English, British English, Russian, German and Japanese to give you the full experience of a World War II dogfight.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/936780/header.jpg?t=1607189381",
    "Price": 0.0,
    "Developers": "Home Net Games",
    "Publishers": "Home Net Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_6dd2881fa2d58e0e885e5746bfc70500888bbccb.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_8d49420beae1a0b3010406b39e26ddc080007d05.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_671f2f80e1238d1e86b248cf489bd195a393ed86.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_96890666ba8ac7e1781c33e80ed992ad79469884.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_42099e9e2d5590c1acbdf778998c353179ed1ea1.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_4cb777fc87e50be9ee5905ea300b9a8212f843ad.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_0166a056764cd7b566fb382558d12c219d521ddf.1920x1080.jpg?t=1607189381,https://cdn.akamai.steamstatic.com/steam/apps/936780/ss_2ac82ad531817dd873a5599cfa6653e04cad96e2.1920x1080.jpg?t=1607189381",
    "Slug": "warplanes-ww2-dogfight",
    "Meta Title": "Warplanes: WW2 Dogfight: Apr 6, 2019, Home Net Games and ...",
    "Meta Description": "Looking for information on Warplanes: WW2 Dogfight? Check out the release date (Apr 6, 2019), developer insights from Home Net Games, and a complete gam...",
    "Alt Text Image": "Official header image for Warplanes: WW2 Dogfight game - Steam 936780",
    "Canonical URL": "https://gusku.site/game/warplanes-ww2-dogfight",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Warplanes: WW2 Dogfight\", \"description\": \"Looking for information on Warplanes: WW2 Dogfight? Check out the release date (Apr 6, 2019), developer insights from Home Net Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Home Net Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Home Net Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/936780/header.jpg?t=1607189381\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}