{
    "AppID": 1196470,
    "Name": "WE ARE FOOTBALL",
    "Release date": "Jun 10, 2021",
    "About the game": "As a manager and trainer in WE ARE FOOTBALL, you’ll come face to face with the latest trends in the world of football, experiencing all the emotional highs and lows of your favorite club. For the first time ever, this modern football manager game also offers a women’s football game mode, featuring all the same functionality as well as many unique gameplay elements. To maintain and ensure the highest quality across all game modes, WE ARE FOOTBALL has been developed with experienced football management veterans such as Gerald Köhler, Rolf Langenberg, and Dirk Winter. You’ll get immediate feedback for every decision, big and small. You’ll have to plan out your deadlines effectively in the game, and will only be truly successful in the club by working together with your colleagues. WE ARE FOOTBALL focuses on real management tasks. The goal of the game is to build up the club over the long haul, including growing the team, colleagues, infrastructure, fans, and more. As a result, the football players in the game are individual personalities who spin their own stories. A season can be played through in a few hours: You’re in the middle of the action after just a few minutes. Alone, several seasons can be played through in one afternoon, and two players can even finish a season in an evening. There’s always new challenges to face in WE ARE FOOTBALL. The bigger the club, the bigger the challenge! Features: Beginner-friendly and playable without long introductions or tutorials – easy to learn but hard to master Just as complex as traditional manager games Club selection and career mode via settings quiz Comprehensive manager functionality (finances, sponsors, HR, organization, fan support, followers, IPO, sale of shares to investors, fan shares, and much more) Manager skills can be upgraded Implementation of the latest developments in football Detailed team and player attributes Modern training and realistic training planning Individual skills tree for each player Full psychological profile for each player – the team’s types need to match each other perfectly to have any chance of success Huge youth sector – manage player development even from a young age Comprehensive list of playing styles and basic rules New match engine with a focus on the ball and the players involved in the offenses with additional text commentary All matches in the game world are calculated equally Spectacular half-time speeches Expandable 3D stadium and 3D club grounds, as well as a club museum you can walk through Weekly progress with exciting negotiations and many small and big decisions to be made Comprehensive statistics section – a real treat for fans Critical fan commentary after the match Simulation of the ups and downs of major football teams Simulation of national team tournaments with changes in the market value of team players The game doesn’t include any official football licenses. The game comes with an editor which lets you create your own leagues or clubs: Any country in the world can be edited Men’s and women’s leagues Choice of official or personal database at the beginning of the game Open league systems with editable promotion and demotion rules Expandable names list per language Automatic creation of players and teams Comprehensive editors for crests and shirts Options to integrate your own graphics WE ARE FOOTBALL is future-proof: the game’s start year can be adjusted in the editor.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1196470/header.jpg?t=1643658626",
    "Price": 34.99,
    "Developers": "Winning Streak Games",
    "Publishers": "THQ Nordic",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_fa416729eef30721bc1c6fc9618a448e2106c422.1920x1080.jpg?t=1643658626,https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_234ff958dcb100e26a98e6004246152b2cbf9c37.1920x1080.jpg?t=1643658626,https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_6dcd52423bdfb3b115a8140ff4dee8e9b65e4dcb.1920x1080.jpg?t=1643658626,https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_8c4f5a87b2ef87adaf2cb47be1fd147e7f5173a4.1920x1080.jpg?t=1643658626,https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_5f6d42d6b90ec65a90343621ab9008b828ef3b4d.1920x1080.jpg?t=1643658626,https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_65a88eee974de50beaf8bc372d4350fdd4dc524e.1920x1080.jpg?t=1643658626,https://cdn.akamai.steamstatic.com/steam/apps/1196470/ss_9fb87632cb6956a9fdf5f3b4f7aa2abda3d94b36.1920x1080.jpg?t=1643658626",
    "Slug": "we-are-football",
    "Meta Title": "WE ARE FOOTBALL: Jun 10, 2021, Winning Streak Games and F...",
    "Meta Description": "Looking for information on WE ARE FOOTBALL? Check out the release date (Jun 10, 2021), developer insights from Winning Streak Games, and a complete game...",
    "Alt Text Image": "Official header image for WE ARE FOOTBALL game - Steam 1196470",
    "Canonical URL": "https://gusku.site/game/we-are-football",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"WE ARE FOOTBALL\", \"description\": \"Looking for information on WE ARE FOOTBALL? Check out the release date (Jun 10, 2021), developer insights from Winning Streak Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 10, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Winning Streak Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"THQ Nordic\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1196470/header.jpg?t=1643658626\", \"offers\": {\"@type\": \"Offer\", \"price\": 34.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}