{
    "AppID": 1341290,
    "Name": "We Were Here Forever",
    "Release date": "May 10, 2022",
    "About the game": "You and your fellow prisoner are trapped in the realm of Castle Rock - were you betrayed, or simply not that clever? To escape, you must explore the sinister castle for puzzles and plot your escape together. Secrets and riddles are hidden in the shadows. Just be aware that nothing is what it seems in this mysterious Antarctic adventure. Can you two escape together, or will you be trapped… forever? Locked up in the dungeons, deep in the bowels of Castle Rock, you and a fellow prisoner must seek a way out and return to stand again beneath the icy Antarctic skies - but escaping this nightmare will not be so easy, let alone escaping the castle itself. Freeing yourselves from your cells and escaping the Keep is only the beginning - but does one truly escape Castle Rock? Fresh mysteries await, and you’ll have to make some choices about how to proceed. Your journey leads from the dark prison through the royal halls to the outside. Outside the Keep, you will discover the story of Rockbury, it’s inhabitants, and plans of a resistance formed against the King to escape this icy place. Hope will lead you on to an eerie Graveyard and have you descend down into the dark waters of the Foundry. You two have been brought here for a purpose. You might even be the missing piece of a puzzle set in motion long ago, in a time long forgotten. But someone, or something, desperately seeks to solve that puzzle, by any means necessary. Only an unshakeable bond with your partner will give you any hope of survival in the face of such dreadful desire… Does one truly escape Castle Rock? Feature list Two player co-op: the puzzles you encounter take two to solve - you both have a role to play! Communicate via walkie-talkies, and act as each other’s eyes and ears Connect through experience: when you find yourself in sudden danger, will you freeze, or can you keep cool and explain things clearly to your friend - before your time runs out… On the edge of your seat: be part of a thrilling adventure in the lively world of Castle Rock as you and your friend take on the ancient powers aligned against you Spine-tingling story: there is much to discover… and much to fear - you’ve met the Jester, but is he even the most powerful being within the walls of Castle Rock? NOTE: This game is co-op only. It requires both players to have a working PC-compatible microphone and an internet connection. Talk Your voice is all you have... at first. You and your fellow prisoner must escape from Castle Rock and uncover an ancient mystery. All you have to start with is a pair of walkie-talkies - can you work together on the same wavelength? Solve Two partners, one purpose. Get on the same page! Immerse yourself in an intriguing cooperative experience as you and your partner puzzle your way through a series of thrilling situations. Search for a way out through brand new environments, together. Escape The King awaits us... The frozen grounds and dark chambers of Castle Rock hold many secrets and hidden dangers. Unravel the web you find yourself trapped within, for there are hungry eyes watching. The fallen king of the castle has plans for you… can you truly escape from his sinister grasp? The We Were Here Series Looking for more cooperative puzzling? There are currently four games in the series: We Were Here (free on Steam), We Were Here Too , We Were Here Together , and of course We Were Here Forever! Every game in the We Were Here Series is a standalone co-op adventure – the stories are connected but you don’t need to play them in order. You can also learn more about the history of Castle Rock in the We Were Here Stories: Chronicles of Castle Rock - a six part live-action video series available on the Total Mayhem Games YouTube.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1341290/header.jpg?t=1652436547",
    "Price": 17.99,
    "Developers": "Total Mayhem Games",
    "Publishers": "Total Mayhem Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_aa6def930b8bac921a64094ba1bac69148b7f2dc.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_1d11524ae8bd060494a77a5a9de467898af38337.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_29d598c21ee3f0f62d189eef51d9ad3904a78a92.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_80c9f43aa702d8c78280a72857341c1aa7ede817.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_6435e260bee6aafd8e15c70a67a871890ad81a8c.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_1fea6df9abe9246c03bde708526692086fbfd4b5.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_29b64b4de15d31b729c0453448046c56d59f3961.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_b87d4c7486ea28cb40863ce4863b0a7d656d34c8.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_0d364132974262516ed56e005ff895a0d78814fb.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_98acd03978cb3b1d0638e5e9bc9559914f11725f.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_37c60d6cfd973f71922ac6a594d04320ba25a8ec.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_7a73ed07594d63221de54c107a11fdcf4fabd3bc.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_af3393ab46ef86de2f5312669ca35f8da0a617f7.1920x1080.jpg?t=1652436547,https://cdn.akamai.steamstatic.com/steam/apps/1341290/ss_44b661685398d6f1ef1a527416ee157d7bed4529.1920x1080.jpg?t=1652436547",
    "Slug": "we-were-here-forever",
    "Meta Title": "We Were Here Forever: May 10, 2022, Total Mayhem Games an...",
    "Meta Description": "Looking for information on We Were Here Forever? Check out the release date (May 10, 2022), developer insights from Total Mayhem Games, and a complete g...",
    "Alt Text Image": "Official header image for We Were Here Forever game - Steam 1341290",
    "Canonical URL": "https://gusku.site/game/we-were-here-forever",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"We Were Here Forever\", \"description\": \"Looking for information on We Were Here Forever? Check out the release date (May 10, 2022), developer insights from Total Mayhem Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 10, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Total Mayhem Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Total Mayhem Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1341290/header.jpg?t=1652436547\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}