{
    "AppID": 1728130,
    "Name": "Alone: Recode",
    "Release date": "Sep 24, 2021",
    "About the game": "'You are dragged into a house in the middle of nowhere. The last few hours? Days? Are all a blur. Who is this person who won't show their face? Why won't they answer any of your questions? Your friends... you have to find your friends...' 'When making Alone I really wanted to challenge old-school RPG stereotypes of level and encounter design. Like others who enjoy RPGs I had played many of the old classics and spamming the same abilities through menus with key memory on felt like holding down the 'A' button leads to assured victory. With Alone I wanted to put a little more into the combat and gameplay sides and less into the narrative fiction of the world.' -Fengraf Games These are some of the ways Alone changes the game on what a classic RPG can be. Story - Alone is somewhat light on the narrative front. Most of the game's story is optional and much of it can be completed in or out of order and without speaking to the characters you find throughout the game. Though it drives your actions for much of your play, the way you engage with the story is up to you. Exploration - There are no maps here. No overworld where you grow to enormous proportions and can travel to the next area in a few steps. The path forward is sometimes hidden, sometimes blocked, and sometimes back the way you came. Your only hope in Alone is to continue exploring and working your way in around and back through the numerous environments. Character Growth - Your characters in Alone do not acquire skills naturally. Instead, points will be earned from levels that can be spent in two unique skill books to each character. Don't like your current skills? Visit the pub to reset them. Great control is given to the player to determine how they want each party member to feel. Your weapons will also provide you special abilities, so the customization does not stop at the skill books. Your gear can be upgraded in a few ways to further augment your preferred strategies. Combat - If you have a love for classic turn-based RPG games, you'll know many of the older installments spare no expense building hype for that final boss – only to have them fall to your bottomless supply of potions. Alone wants to throw that out the window and introduce more punishing and difficult bosses as a result. Potions may heal you for a substantial amount, but that health is then lost again over time. The turn order can also be manipulated by clever players who take advantage of the ACCEL system. Spells / items / actions will have an ACCEL value to them that causes that characters next turn to come up quicker by that amount. Your enemies will target the strongest among you and do everything they can to throw a wrench in your plans. Alone tries to create a more engaging combat experience by requiring pattern recognition and thoughtful choices about the order in which attacks occur.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1728130/header.jpg?t=1645113249",
    "Price": 4.99,
    "Developers": "Fengraf",
    "Publishers": "Fengraf",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_5d89d4a5fad53bed2dace935568d30a2cffcd10b.1920x1080.jpg?t=1645113249,https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_20b8b7175ae0ff6bbf924f6e4c5e9630f6a725ad.1920x1080.jpg?t=1645113249,https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_a535650403e3c0c164f83c633faec828776482df.1920x1080.jpg?t=1645113249,https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_5614fa46138d17519fd8aeb11dfc353b3d15a596.1920x1080.jpg?t=1645113249,https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_bc3603e02bff98a5ee7e925a0c0e6611a5e635a2.1920x1080.jpg?t=1645113249,https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_45fed89d332fff8a71b8009bf7a887ceea98d368.1920x1080.jpg?t=1645113249,https://cdn.akamai.steamstatic.com/steam/apps/1728130/ss_24d281b51867c6328c7a3745caac5b97c12d6cf5.1920x1080.jpg?t=1645113249",
    "Slug": "alone-recode",
    "Meta Title": "Alone: Recode: Sep 24, 2021, Fengraf and Full Overview",
    "Meta Description": "Looking for information on Alone: Recode? Check out the release date (Sep 24, 2021), developer insights from Fengraf, and a complete game summary.",
    "Alt Text Image": "Official header image for Alone: Recode game - Steam 1728130",
    "Canonical URL": "https://gusku.site/game/alone-recode",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Alone: Recode\", \"description\": \"Looking for information on Alone: Recode? Check out the release date (Sep 24, 2021), developer insights from Fengraf, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fengraf\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fengraf\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1728130/header.jpg?t=1645113249\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}