{
    "AppID": 1355840,
    "Name": "animARide",
    "Release date": "Jul 24, 2020",
    "About the game": "AnimARide software allows users to upgrade any real-life captured panoramic video into an AR animated experience by using motion file from the video to animate different 3D elements inside the movie. Choose from a wide range of animARide’s pre-installed cockpits and set up individual motion characteristics such as incline of the cockpit, shake intensity, shadow positioning, and a lot more, to create your own AR animated experiences. AR content production has never been so simple as with our unique technology. AnimARide animates different elements inside the video including the chosen cockpit, speedometer and tachometer, steering wheel and joystick, transmission stick, and a lot more. No manual animation needed. Create new Supercar or Space Bike adventures using your own panoramic videos. Upgrade your panoramic video with 3D augmented reality elements animated with animARide software. Enjoy the highest video quality with resolution up to 8K, 60fps using animARide’s player that is optimized for GPU rendering. Are you a motion simulator user? Just install our plugin and animARide will work as a 5D cinema with your motion seat. animARide synchronously transfers 6DOF data to SimTools at 100Hz. How it works: Capture any video using a panoramic camera. In case you have GoPro Fusion or GoPro MAX, just record the video. For all other types of cameras, use iOS app animARide MVC , to record the motion together with the video. Export the video as a mp4 file, H.265(HEVC) preferred. Get motion data from your raw GoPro movie file using our Parser &amp; Editor application. Save as a separate .4dr file. The movie file in .mp4 and the motion file in .4dr should have the same name and should be located in the same folder. Upload movie file in animARide and run. Adjust cockpit position using sliders. Adjust sun direction and intensity for correct rays and shadows. Adjust motion and shake intensity. Adjust rendering quality, depending on GPU power level. If desired, you can save your individual settings for the ride into a separate .INI file. Choose your role in the car: a driver or a passenger with professional driver. Choose between 6 Supercar cockpits or 5 Space Bikes, while running the video. Record upgraded adventure into a 4K resolution 16:9 video file that is ready for sharing. Software has been tested with Oculus Rift CV1, HTC Vive Pro, Samsung Odyssey +, PiMax 5K +, PiMax 8K, desktop non VR and is suitable for all of the above. Works with any kind of input control: keyboard and mouse, VR controllers. Customizable controller and keyboard hotkeys. live In Motion Redefined!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1355840/header.jpg?t=1596003771",
    "Price": 0.99,
    "Developers": "Evgeny Merzlyakov,Alexey Odnorog",
    "Publishers": "Yasmina Surfside LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1355840/ss_08df657e8c6137dbf8976ad3e0da538515354f04.1920x1080.jpg?t=1596003771,https://cdn.akamai.steamstatic.com/steam/apps/1355840/ss_1e78ee834c3abbe2ab9344eba69dc6d0b072f423.1920x1080.jpg?t=1596003771,https://cdn.akamai.steamstatic.com/steam/apps/1355840/ss_a5e1d51660151b2806c4e0708973202df53903f7.1920x1080.jpg?t=1596003771,https://cdn.akamai.steamstatic.com/steam/apps/1355840/ss_a2b594fcc24b8f9a4723108a53fe0e0da222fc7c.1920x1080.jpg?t=1596003771,https://cdn.akamai.steamstatic.com/steam/apps/1355840/ss_549235f800409f566506ce974439344530d99e8c.1920x1080.jpg?t=1596003771",
    "Slug": "animaride",
    "Meta Title": "animARide: Jul 24, 2020, Evgeny Merzlyakov,Alexey Odnorog...",
    "Meta Description": "Looking for information on animARide? Check out the release date (Jul 24, 2020), developer insights from Evgeny Merzlyakov,Alexey Odnorog, and a complet...",
    "Alt Text Image": "Official header image for animARide game - Steam 1355840",
    "Canonical URL": "https://gusku.site/game/animaride",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"animARide\", \"description\": \"Looking for information on animARide? Check out the release date (Jul 24, 2020), developer insights from Evgeny Merzlyakov,Alexey Odnorog, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Evgeny Merzlyakov,Alexey Odnorog\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Yasmina Surfside LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1355840/header.jpg?t=1596003771\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}