{
    "AppID": 1694610,
    "Name": "Beku",
    "Release date": "Feb 25, 2022",
    "About the game": "*Beku is still in active development but was launched fully on Steam. Players can still expect this to be treated as an Early Access product, taking on feedback and more as we head to our launch later this year.* Welcome to Beku A troubled monarch seeks a warrior worthy of standing by his side. Is it you? Haunted by a traumatizing upbringing, the king of Beku seeks a warrior strong enough to help bring an end to his anguish by eliminating a mystery being that is stopping his evil plot. But to do so, warriors must complete challenging trials created through the king's power of sorcery. But the closer to achieving their quest, the more secrets begin to be revealed by the world of Beku itself. Beku is a challenging game and designed to test your skills. Are you up to the task? Prove Yourself To find a warrior worthy enough of being his knight, the king mercilessly gathers unwilling participants and forces them through his arduous trials to prove themselves. Knight A respected soldier of the kingdom magically altered by the king's own magic to be remarkably strong, but with his strength costs him his speed. Ninja Driven by curiosity, she learned some harsh truths about the kingdom of Beku and taught herself the art of stealth to survive against those hunting her down. Archer He's an outsider with a desire to earn money through noble and honest work. His aim is impeccable and he keeps a rare beast as a pet. Roy (The Future Guy) After stumbling into another dimension while trying to save his own world, he was captured by the king's soldiers and now his superpowers are put to the test against sorcery. Master the Arena The king's nefarious ways continue through the Arena. Built purely for the king's entertainment, captives are forced into a mystical illusion that feels like reality. It's here where they can perfect their skills and learn the ways of the difficult bosses that lie ahead in the story. How long can they survive and endure the punishing simulation? Local Play Two may be better than one Teamwork can pave the way for success, so why not invite a second captive along to help lessen the burden of battling solo? With shared multiplayer, two captives can work together on the same screen to battle against the darkness that haunts Beku. Settings Make the gameplay experience yours by adjusting a range of settings. You can adjust the volume levels, your field of view, how big the interface is, and whether to play with a keyboard or controller. You can also change the difficulty modes for both allies and enemies prior to jumping into a level, but find the challenge too overbearing? In death, you can adjust the difficulty.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1694610/header.jpg?t=1648827331",
    "Price": 5.99,
    "Developers": "WiwiGameStudio",
    "Publishers": "Hound Picked Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_cb8e65ab867df44d5046acc5250fb5035397d33c.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_db980674aa7b751286d4dea78c5ae309576420c1.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_a94feef14a4916919b27834c18fda5b48b1d400e.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_2fffca54aeccdd51f6190cd72aa716b87daa89ec.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_6a746bf0fd8cb2b958c226933c7dff8509d8239e.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_f0d23a9ef7ac3952ddcc5d6e4b0a09f0b548dfb1.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_29cd48d8366b7b3c4aadf494d60141745431e01e.1920x1080.jpg?t=1648827331,https://cdn.akamai.steamstatic.com/steam/apps/1694610/ss_f8e456a8df75b8bbcb4188acf7de8ea9eb4d245f.1920x1080.jpg?t=1648827331",
    "Slug": "beku",
    "Meta Title": "Beku: Feb 25, 2022, WiwiGameStudio and Full Overview",
    "Meta Description": "Looking for information on Beku? Check out the release date (Feb 25, 2022), developer insights from WiwiGameStudio, and a complete game summary.",
    "Alt Text Image": "Official header image for Beku game - Steam 1694610",
    "Canonical URL": "https://gusku.site/game/beku",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Beku\", \"description\": \"Looking for information on Beku? Check out the release date (Feb 25, 2022), developer insights from WiwiGameStudio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"WiwiGameStudio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hound Picked Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1694610/header.jpg?t=1648827331\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}