{
    "AppID": 1629060,
    "Name": "Colibri XR Immersive Art Gallery",
    "Release date": "Dec 15, 2021",
    "About the game": "Colibri XR immersive art gallery is dedicated to promoting compassion, growing empathy, caring and kindness through virtual reality art. It is the room to listen to the stories told by drawings, soak into creative energy all around you, explore like children with their crayons, feel the joy of colours, tap into the power of feelings and emotions, fill the space with soul warming creations ... experience art with purpose. Virtual Reality paintings playable in the gallery are listed for sale on OpenSea NFT marketplace: Part 1 'Estrella. The Gift' The illustrated story is inspired by the ancient Inca traditions, the mystical world of the Q‘ero shamans from the sacred valley of Peruvian Andes. A girl Estrella is searching for the lost Inca's treasure, the star of gold, that is believed to provide supernatural multi-talents and turn all dreams into being. She meets Laika, a powerful shaman, who invites the helpers on her journey, the sacred spirit animals. The spirits invite Estrella to extraordinary locations in the Under World, Middle World and Upper World. She follows the spirits of the Serpents, who whisper about the concealed knowledge they keep. The spirits of the Jaguar and the Puma cast a spell of a sudden transformation and Estrella gets lost on the way, however she is brave enough to continue the journey. She travels across the ocean with tiny courageous spirits of Hummingbirds, and explores the vast space with the spirits of the Eagle and the Condor. The girl finally meets the Father Sky and the Mother Earth, who tell her the story of their love, and give her a gift of a guiding star. Her feelings of powerlessness and fear disappear, and in their place arise courage, curiosity, and creativity. The star guides her home and magically becomes a golden necklace around Estrella's neck. The girl recognizes she found the treasure ...  all her multiple gifts were always with her, now reawakened. Part 2 'The River and The Clouds' The illustrated poem is inspired by Zen Master, a poet and peace activist Thich Nhat Hanh: 'Once upon a time there was a beautiful River... One day she noticed the clouds within herself. Clouds of all sorts of colors and forms. She did nothing during these days but chase after clouds. She wanted to possess a cloud, to have one for herself. But clouds float and travel in the sky, and they are always changing their form. Sometimes they look like an overcoat, sometimes like a horse. Because of the nature of impermanence within the clouds, the River suffered very much. Her pleasure, her joy had become just chasing after clouds, one after another, but despair, anger, and hatred became her life. Then one day a strong wind came and blew away all the clouds in the sky. The sky became completely empty.... That night was the first opportunity for her to hear her own crying, the sounds of water crashing against the banks of the River. Because she was able to listen to her own voice, she discovered something quite important. She realized that what she had been looking for was already in herself. She found out that clouds are nothing but water. Clouds are born from water and will return to water. And she found out she herself was also water... When she opened her heart completely to the evening sky she received the image of the full Moon - beautiful, round, like a jewel within herself... The fresh and beautiful Moon is traveling in the utmost empty sky. When the mind-rivers of living beings are free, that image of the beautiful Moon will reflect in each of us. This was the mind of the river at that moment. She received the image of that beautiful Moon within her heart, and water, clouds, and the Moon took each other's hands and practiced walking meditation slowly, slowly to the ocean...' Part 3 'Pebble Meditation' is inspired by Zen Master Thich Nhat Hanh: “Breathing in, I see myself as a flower. Breathing out, I feel fresh. Breathing in, I see myself as a mountain. Breathing out, I feel solid. Breathing in, I see myself as still water. Breathing out, I reflect things as they truly are. Breathing in, I see myself as space. Breathing out, I feel free.”",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1629060/header.jpg?t=1639599282",
    "Price": 0.0,
    "Developers": "Colibri XR GmbH",
    "Publishers": "Colibri XR GmbH",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1629060/ss_508284e032f4a4518a11cfbbae7e0c0c084583f3.1920x1080.jpg?t=1639599282,https://cdn.akamai.steamstatic.com/steam/apps/1629060/ss_b683cc71e50e229944cc7fb356c0590fc1f009ac.1920x1080.jpg?t=1639599282,https://cdn.akamai.steamstatic.com/steam/apps/1629060/ss_76977301d5ce1b2f278a7bf24694d5f713b30daf.1920x1080.jpg?t=1639599282,https://cdn.akamai.steamstatic.com/steam/apps/1629060/ss_2f7fc1a03bb2472e4715d3f7f138fba7355bd47b.1920x1080.jpg?t=1639599282,https://cdn.akamai.steamstatic.com/steam/apps/1629060/ss_58b332d05df49eba0313c927ec052cee3321a022.1920x1080.jpg?t=1639599282",
    "Slug": "colibri-xr-immersive-art-gallery",
    "Meta Title": "Colibri XR Immersive Art Gallery: Dec 15, 2021, Colibri X...",
    "Meta Description": "Looking for information on Colibri XR Immersive Art Gallery? Check out the release date (Dec 15, 2021), developer insights from Colibri XR GmbH, and a c...",
    "Alt Text Image": "Official header image for Colibri XR Immersive Art Gallery game - Steam 1629060",
    "Canonical URL": "https://gusku.site/game/colibri-xr-immersive-art-gallery",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Colibri XR Immersive Art Gallery\", \"description\": \"Looking for information on Colibri XR Immersive Art Gallery? Check out the release date (Dec 15, 2021), developer insights from Colibri XR GmbH, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Colibri XR GmbH\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Colibri XR GmbH\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1629060/header.jpg?t=1639599282\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}