{
    "AppID": 427190,
    "Name": "DEAD RISING®",
    "Release date": "Sep 12, 2016",
    "About the game": "Frank West, a freelance photojournalist on the hunt for the scoop of a lifetime, pursues a juicy lead to a small suburban town only to find that it is being overrun by zombies! He escapes to the local shopping mall thinking it will be a bastion of safety, but it turns out to be anything but. It's a true struggle to survive the endless stream of enemies, but with full reign over an entire shopping center, Frank can utilize anything to fight off the flesh-hungry mob and search for the truth behind the horrendous epidemic. This action horror game brings new meaning to the phrase 'retail hell.' Dead Rising uses a dynamic real-time system in which time continues to pass whether Frank is actively engaged or remains stationary. For example, though they move slowly during the day, zombies become stronger and faster when the sun sets and make it even more difficult to survive at night. The unprecedented swarms come in never-ending waves and consist of a diverse population. These former humans retain some memory of their previous lives and it is reflected in their behavior and appearance. The variety of different stores in the mall offers an endless supply of resources including vehicles, makeshift weapons and more. Other survivors are encountered along the way and helping them can provide valuable clues as to what has happened. Key features: Huge Environments – Expansive indoor and outdoor areas of the mall provide a variety of different locations to explore! Swarm Technology – Allows an unprecedented amount of enemies on screen at once resulting in nonstop, pulse-pounding action. Intense Gore and Vibrant Realism. Anything in the mall is at Frank's disposal Move environmental objects like table umbrellas or mall benches. Snatch items from different stores to use as weapons, including golf clubs, lawnmowers, fry pans and more! Chow down on various 'mall food' to recover health. Real Time System – Key story elements happen at certain times whether Frank is on the spot or not. Don't miss any important events or opportunities! Use Frank's Photojournalistic Skills – Capture the insanity on film; the better the shot, the better the reward will be! NPCs – Help players navigate through the zombie-infested mall. Solve the Mystery – Why has the entire town turned into the undead? Additional Features &amp; Functionalities: Save System – Now supports up to five save slots Controller Support – Native Xbox 360/Xbox One and PlayStation DualShock 4 controller support with matching button icons Resolution Settings – supports 4K and beyond Variable Frame Rate – uncapped frame rate including support for 144Hz monitors and Nvidia G-SYNC technology Customizable &amp; rebindable keyboard and mouse settings",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/427190/header.jpg?t=1644282496",
    "Price": 19.99,
    "Developers": "Capcom",
    "Publishers": "Capcom",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/427190/ss_2b90e3b06b7958c7d0ae48a062822482952b9118.1920x1080.jpg?t=1644282496,https://cdn.akamai.steamstatic.com/steam/apps/427190/ss_fd0d8599b19d41a0935518b63a4e99794e1e8f95.1920x1080.jpg?t=1644282496,https://cdn.akamai.steamstatic.com/steam/apps/427190/ss_21b4e49b63eae0f5d676aa93f43279c86b323c05.1920x1080.jpg?t=1644282496,https://cdn.akamai.steamstatic.com/steam/apps/427190/ss_70f2a9c19d43012ab8d4163be416ba12e46ac549.1920x1080.jpg?t=1644282496,https://cdn.akamai.steamstatic.com/steam/apps/427190/ss_1a2a783901398a39be84cd84efa62da9fd050b41.1920x1080.jpg?t=1644282496",
    "Slug": "dead-rising",
    "Meta Title": "DEAD RISING®: Sep 12, 2016, Capcom and Full Overview",
    "Meta Description": "Looking for information on DEAD RISING®? Check out the release date (Sep 12, 2016), developer insights from Capcom, and a complete game summary.",
    "Alt Text Image": "Official header image for DEAD RISING® game - Steam 427190",
    "Canonical URL": "https://gusku.site/game/dead-rising",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"DEAD RISING\\u00ae\", \"description\": \"Looking for information on DEAD RISING\\u00ae? Check out the release date (Sep 12, 2016), developer insights from Capcom, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 12, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Capcom\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/427190/header.jpg?t=1644282496\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}