{
    "AppID": 1227040,
    "Name": "Devastation - Annihilate the Alien Race",
    "Release date": "Feb 5, 2020",
    "About the game": "Devastation - Annihilate the Alien Race , is a 2D, dual stick shoot em' up, bullet hell, arcade style game. Tear through hordes of alien ships with, skill based gameplay, bombs and upgrades to obliterate everything in your path. Gun down over 11 massive bosses, build an insane score bank on the leaderboards and overcome clouds of enemy fire. Play locally up to 4 players at once and dominate the game together in 3 different game modes with 4 different game styles or play solo to test your skill with intense difficulty. Unlock up to 30 achievements to build your total gamer score. 3 different score competitive modes! Arcade - A basic mode for players with gunship starting with full shield (2 hit damage). Gain shield back from mega &amp; shield power ups. Hardcore - A mode for hardcore players, shields are corrupt (1 hit damage). No longer gain shield from any power ups. Timed - A timed mode for speed runners. (Game is over if timer reaches 0). Gain time by killing enemies, bosses &amp; collecting time power ups. (Ship death causes drastic time reduction but lives are infinite unless one life mode is active) 4 different game types! Normal - Start with 3 lives, 3 bombs and no upgrades. (Each upgrade type is reduced by 1 on death) One Life - Start with only 1 life, 3 bombs (lives cannot be acquired), no upgrades. (Each upgrade type is reduced by 1 on death) No Bombs - Start with 3 lives, no bombs (bombs cannot be acquired), no upgrades. (Each upgrade type is reduced by 1 on death) All Upgrades - Start with 3 lives, 3 bombs, all upgrades maxed out. (upgrades are never lost) Debug [Secret Mode] - Infinite Lives, Infinite Bombs, Infinite special upgrade weapon. 4 different difficulty styles! Starter - Easiest mode for beginners, enemies have 1x health, enemy fire rate is low, power ups spawn very frequently. Average - Normal mode for balanced players, enemies have 2x health, enemy fire rate is normal, power ups spawn frequently. Professional - Hard mode for competitive players, enemies have 3x health, enemy fire rate is high, power ups spawn less frequently. Insanity - Very hard mode for skilled players, enemies have 4x health, enemy fire rate is max, power ups spawn rarely. -Story Line- Year 1988, We were attacked by an unknown spectral phenomena. We would hear noises, abrupt, terrifying, it got louder as it got closer. It would attack us from the sky. You could only see a faint black ship or a white light and once you heard the sound or seen a glimpse, it was over in seconds. Years went by, they picked us off one by one every night. Some of us fought back when the ship got close enough but we were unaware what power they control. They could shape shift, they can control the weather, they we cloaked during the day, hid in the shadows and they attacked in twos. We developed a team of combat fighters that were skilled killers. We called ourselves the “Hunters”. Through the knowledge that we had gathered we designed a ship called the “Horus”. To ancient Egypt, Horus was originally the Sky God, but he is also known as War God, Hunter's God, God of Kingship and others. We thought it was the perfect name. The four of us casted into space and tracked down an open portal that took us into unknown travel. We obliterated dozens upon dozens of these things to no end. Encountering leaders of their developed clans and almost met our destruction many times. The “Alien Ships” carried unknown technology that our ships could use against them, we became powerful. The alien race fought endlessly in their desperation to survive, we had battled to their extinction. The war was over, we could finally rest again.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1227040/header.jpg?t=1645933324",
    "Price": 4.99,
    "Developers": "Myke Wills",
    "Publishers": "Enfenyx Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_83f982c0e8524f07ffd3f8b885e1d5a9478f7ece.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_90cc2d5c38964f9789756cd0e484db3986d3c730.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_2714fd783f5aed0ad3d123da4d5034841e47dad5.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_096bbd8e470d8dbeb9fa3cd0ecb62b415e49d80d.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_881bdfb97b857fe1f379a26dc371ed9c681ba89b.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_703c4fb44454984a2d30e32e2329b6fec5c6aa68.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_0a61a7e3e153128452202b29562c6675450a40f2.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_5becb32fe9242ead8f9ce4e8ef29bc83afdc8d08.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_c631d3ce9900da95f202fcad2b9659fe64cb1bf6.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_e30e78b063c3500fe93f3ac4d10a8adc419fdb41.1920x1080.jpg?t=1645933324,https://cdn.akamai.steamstatic.com/steam/apps/1227040/ss_257961542683ea31e3200a797253d1fc15ae4b5a.1920x1080.jpg?t=1645933324",
    "Slug": "devastation-annihilate-the-alien-race",
    "Meta Title": "Devastation - Annihilate the Alien Race: Feb 5, 2020, Myk...",
    "Meta Description": "Looking for information on Devastation - Annihilate the Alien Race? Check out the release date (Feb 5, 2020), developer insights from Myke Wills, and a ...",
    "Alt Text Image": "Official header image for Devastation - Annihilate the Alien Race game - Steam 1227040",
    "Canonical URL": "https://gusku.site/game/devastation-annihilate-the-alien-race",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Devastation - Annihilate the Alien Race\", \"description\": \"Looking for information on Devastation - Annihilate the Alien Race? Check out the release date (Feb 5, 2020), developer insights from Myke Wills, and a ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Myke Wills\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Enfenyx Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1227040/header.jpg?t=1645933324\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}