{
    "AppID": 1366950,
    "Name": "Driver4VR",
    "Release date": "Jun 7, 2021",
    "About the game": "Body tracking, head and hand tracking, controller emulation, and utilities. When using the Driver4VR for the first time, it MUST be started from the 'Launch' button, to ensure any additional services and drivers it requires get installed. If you have issues with installation please reach out to the support website . Driver4VR is also the main source of funding for WalkinVR, the first software that allows people with disabilities to play Virtual Reality games. Driver4VR allows adding body tracking for your existing VR setups like Oculus, HTC Vive, or Valve Index. For 3DoF Headsets like phone-vr, PSVR or VRTek, Driver4VR can add position tracking and controller emulation. It also uses alternative devices (previous generation consoles, mice, keyboard) to emulate virtual reality controllers and input. Body tracking Driver4VR can emulate body tracking with Kinect, PS Controllers with PS Eye cameras via PSMoveService, Nolo VR. There is also an experimental way of tracking with a single PS Eye camera and Camera Markers. Calibration of these body trackers with your existing VR setup is very quick and easy. (tVR) - Virtual Reality on Monitor or TV Driver4VR allows the play of some of the Virtual Reality games on TV and this is called (tVR). This is an alternative way to consume VR content for people who for some reason can't consume VR in a classic way that is with headset and controllers. Head and hand tracking, emulation of the controller Driver4VR can also add positional tracking (6DoF) in case you have a headset that just supports the rotation like phone-based VR, VR Tek, Pimax, etc. It uses Kinect to emulate positional tracking. Please note that we are using alternative tracking methods to approximate a true 6DOF experience. You may want to look into Oculus Quest or similar devices at a cheap price for the head and hands tracking, and use Driver4VR for only the body tracking - feet and waist. Controllers can be emulated with devices like PS Move, Joy-Con, Wii Remote, VR Gamepad, Mouse, Xbox Controller, Keyboard. Combined with positional tracking makes a complete virtual reality setup with hand tracking and input. Without Kinect you can use those devices alone to emulate position a'la Oculus Go which is called Virtual Tracking. Utilities Driver4VR is also set of utilities like Virtual Move, Input Emulation, fix floor position, emulation of broken Index thumbstick with touchpad, and others. Requirements Bluetooth devices (Bluetooth connection required) - Nintendo Switch JoyCon - Nintendo Wii Remote - PS3 Move - VR Gamepad Kinect - Kinect 360 - Kinect 360 adapter and standard USB 2.0 - Kinect 2.0 - Kinect 2.0 adapter and USB 3.0",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1366950/header.jpg?t=1641980262",
    "Price": 17.99,
    "Developers": "2MW",
    "Publishers": "2MW",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1366950/ss_95b4853a06d4e3df835a22e9f8d624094ce860f6.1920x1080.jpg?t=1641980262,https://cdn.akamai.steamstatic.com/steam/apps/1366950/ss_4a843a7f52a89f0b382fa03683553ea4c07438da.1920x1080.jpg?t=1641980262,https://cdn.akamai.steamstatic.com/steam/apps/1366950/ss_605d655711e2ff4cc5330b4d5859d519365bc800.1920x1080.jpg?t=1641980262,https://cdn.akamai.steamstatic.com/steam/apps/1366950/ss_dd578d0b6e10bdb1055a788eeb1207b3f0f80320.1920x1080.jpg?t=1641980262,https://cdn.akamai.steamstatic.com/steam/apps/1366950/ss_1316fe8708254c187f125a86886dd17fc0a555cd.1920x1080.jpg?t=1641980262",
    "Slug": "driver4vr",
    "Meta Title": "Driver4VR: Jun 7, 2021, 2MW and Full Overview",
    "Meta Description": "Looking for information on Driver4VR? Check out the release date (Jun 7, 2021), developer insights from 2MW, and a complete game summary.",
    "Alt Text Image": "Official header image for Driver4VR game - Steam 1366950",
    "Canonical URL": "https://gusku.site/game/driver4vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Driver4VR\", \"description\": \"Looking for information on Driver4VR? Check out the release date (Jun 7, 2021), developer insights from 2MW, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"2MW\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"2MW\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1366950/header.jpg?t=1641980262\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}