{
    "AppID": 1069610,
    "Name": "Exile of the Gods",
    "Release date": "Jul 11, 2019",
    "About the game": "In the great war between the gods, will you wield the chains of destiny, or shatter them forever? Exile of the Gods is a 460,000 word interactive epic fantasy novel by Jonathan Valuckas, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. Our story begins twenty years after the action of the first game, 2015's Champion of the Gods . Which ending did you get? Start this game as the Champion, a warrior born to serve the gods, and follow the holy destiny the Weavers have crafted for you. Or start this game as the Exile, enemy of the gods, and forge a new life for yourself in the faraway land of Khovros--where mortals are free to choose their own fates. Champion and Exile alike must unravel a deadly conspiracy, and confront the brewing war upon their gods. Will you vanquish this invading force, or use its power to free your realm from its ruthless creators forever? Take revenge on the gods who exiled you, or steal this chance to prove your worth to the pantheon, and seize your destiny of glory? The gods made you what you are. Now, you will show them what you are made of. Play as male, female, or nonbinary; gay, straight, bi, or ace Take the role of your realm's beloved savior, or that of a vengeful warrior living in exile Explore a world inspired by the myths of Ancient Greece Fight land and sea battles inspired by the military campaigns of antiquity Unravel a divine conspiracy that spans two realms, complete with shocking twists Use the power of Inspiration to endow your companions with unearthly prowess, or wield Rapture to stun your enemies with bliss Move the hearts of your foes with your sincerity, or harness the power of deception to spin a lie that suits your fancy Play the game in standalone mode, or import your skills and backstory from 'Champion of the Gods' to unlock new storylines--and a terrifying bonus power Confront golems, fire-wielding mystics, and the armies of the dead Receive a horoscope for your character, based on their virtues and humors",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1069610/header.jpg?t=1562855706",
    "Price": 6.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1069610/ss_74a0b2bf1a8821c67b300ea7103d19bd8abc8db9.1920x1080.jpg?t=1562855706,https://cdn.akamai.steamstatic.com/steam/apps/1069610/ss_732f6126513d49906500593c9a4824db26b6c5e0.1920x1080.jpg?t=1562855706,https://cdn.akamai.steamstatic.com/steam/apps/1069610/ss_fb9abe7943e2c6194e295f01bf9dc8a340619a45.1920x1080.jpg?t=1562855706,https://cdn.akamai.steamstatic.com/steam/apps/1069610/ss_fb745862a6af2c53ff0907c8d013d0725b959039.1920x1080.jpg?t=1562855706,https://cdn.akamai.steamstatic.com/steam/apps/1069610/ss_e07116f79148a6028cfc2da087d1256dabd44461.1920x1080.jpg?t=1562855706",
    "Slug": "exile-of-the-gods",
    "Meta Title": "Exile of the Gods: Jul 11, 2019, Choice of Games and Full...",
    "Meta Description": "Looking for information on Exile of the Gods? Check out the release date (Jul 11, 2019), developer insights from Choice of Games, and a complete game su...",
    "Alt Text Image": "Official header image for Exile of the Gods game - Steam 1069610",
    "Canonical URL": "https://gusku.site/game/exile-of-the-gods",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Exile of the Gods\", \"description\": \"Looking for information on Exile of the Gods? Check out the release date (Jul 11, 2019), developer insights from Choice of Games, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 11, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1069610/header.jpg?t=1562855706\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}