{
    "AppID": 1926560,
    "Name": "Freshman Magic: Spellbooks and Tangled Sheets",
    "Release date": "May 26, 2022",
    "About the game": "Duel wizards, cast spells, find true love, and keep your academic scholarship, all while investigating the mysterious disappearances plaguing your campus! Freshman Magic: Spellbooks and Tangled Sheets is a 263,000-word interactive gay romance novel by Raven de Hart. It's entirely text-based, without graphics or sound effects, and fueled by the vast, unstoppable power of your imagination. A magical dueling scholarship won you a spot at the prestigious Briarthorn University, one of the top magic colleges in North America. You expected a hard workload and even harder dueling practice sessions…you weren't expecting your classmates to be so distracting! You'll have your pick when it comes to romance: Caleb's a redheaded jock in the dueling club with you. Halim is a sexy rich boy, an enchantment major who works in the college library; Raimundo is a shy, nerdy tutor, but you can read between the lines, and Alistair carries an air of mystery around him you find very intriguing. With all magical energy and romance floating around campus, you're even seeing your best friend, Noel, in a slightly different light…. But everything is not as it seems at Briarthorn. When students start disappearing from campus, it will be up to you to figure out what happened to them, who will be next, and can this malevolence be stopped? Choose a magical subject to major in: alchemy, enchantment, magical theory, summoning demons, or combat magic Stay on the straight and narrow on the dueling pitch, or catch opponents off-guard with dirty tactics Decide exactly how far to go with a cast of lovers It's college! Party hard with your magical peers, or keep a low profile Study diligently in the library, or slip into the back room with the sexy librarian Find the best hookup spots on campus Relax with a friend to wind down after a tough practice — or heat things up in the shower instead Lose your heart to your chosen lover, but don't lose your life as your classmates vanish around you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1926560/header.jpg?t=1653570795",
    "Price": 5.99,
    "Developers": "Heart's Choice LLC",
    "Publishers": "Heart's Choice LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1926560/ss_caa7cc6db80e0ccbe19cea5956e89d40b3a6205e.1920x1080.jpg?t=1653570795,https://cdn.akamai.steamstatic.com/steam/apps/1926560/ss_4499cd517e4b5e2138df8d5077ba05971e874032.1920x1080.jpg?t=1653570795,https://cdn.akamai.steamstatic.com/steam/apps/1926560/ss_eb259cfafef026b335a6fbd75aa822831775d0aa.1920x1080.jpg?t=1653570795,https://cdn.akamai.steamstatic.com/steam/apps/1926560/ss_2a6165a60f0286ad6964beb6961a5fc11daf200b.1920x1080.jpg?t=1653570795,https://cdn.akamai.steamstatic.com/steam/apps/1926560/ss_233c04c7fbbcdab24bcb8cd2c16e87dd389f2422.1920x1080.jpg?t=1653570795",
    "Slug": "freshman-magic-spellbooks-and-tangled-sheets",
    "Meta Title": "Freshman Magic: Spellbooks and Tangled Sheets: May 26, 20...",
    "Meta Description": "Looking for information on Freshman Magic: Spellbooks and Tangled Sheets? Check out the release date (May 26, 2022), developer insights from Heart's Cho...",
    "Alt Text Image": "Official header image for Freshman Magic: Spellbooks and Tangled Sheets game - Steam 1926560",
    "Canonical URL": "https://gusku.site/game/freshman-magic-spellbooks-and-tangled-sheets",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Freshman Magic: Spellbooks and Tangled Sheets\", \"description\": \"Looking for information on Freshman Magic: Spellbooks and Tangled Sheets? Check out the release date (May 26, 2022), developer insights from Heart's Cho...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Heart's Choice LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1926560/header.jpg?t=1653570795\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}