{
    "AppID": 1360270,
    "Name": "Gem Wizards Tactics",
    "Release date": "Feb 16, 2021",
    "About the game": "The Business Demons have risen from beneath, and they're here to frack, drill, pillage and burn everything in sight! Follow the tale of young Derby Pocket, a Business Demon Intern, who discovers the dark secrets of the OMNIGEM! Don't let the cute art fool you: this is a deep, complex tactics game that'll provide a wicked challenge for years to come! Gem Wizards Tactics is a deep, dynamic turn-based strategy game with five complex, super-asymmetrical factions! Designed around endless single player play, Gem Wizards Tactics ' factions each have their own unique units and abilities which you can use to create super-combos! You can also pick up units from other factions and combine them into your army to create totally unheard of, weird new strategies! Design your OWN weird tactics - stuff the designer never even dreamed of! A new kind of single-player wargame In many ways, Gem Wizards Tactics will feel familiar to fans of Advance Wars , Fire Emblem or X-Com . However, the challenges you'll face here are much less puzzle-like, and a lot more emergent and surprising—so your strategies will have to be as well. In this original turn based tactical war game, you take your army through a series of battles in which you’ve gotta capture the flags before taking too many losses! Take tight, puzzle-like tactics in the vein of Into the Breach and 868-HACK , add a big Fire Emblem -style overall package, and wrap the whole thing up in a nintendolicious candyflake aesthetic, and you have the new @keithburgun game, and it's great. - Frank Lantz, Director of the NYU Game Center Gem Wizards Tactics is a whimsical and approachable turn-based tactical game, much like Into the Breach ; 3 asymmetric factions, procedurally-generated maps and enemies, excellent synergies. Super fun.” - Designer Plays on Steam For the most part, every unit is extraordinary, which provides an excellent amount of depth when it comes to strategizing. - Turn Based Lovers FEATURES Wild powers with fun and surprising side-effects! Drill for oil, which is slippery and lights on fire! Spray water around until you create new rivers! Freeze those rivers over with ice magic! Push people over the frozen ice floe, sliding uncontrollably into that hole you drilled! It's like a wild Rube Goldberg Machine of tactics! Includes randomly generated maps! The map geometry, enemy squads you're facing off, and Unit Rescue rewards are different every time you play! Four distinct factions with LOTS of asymmetry : the classic royal high fantasy knights of the Azure Order ; the resource-exploiting, terrain-burning Business Demons , or the nature and weather-controlling Potatoes : each have their own unique playstyles and abilities. Better yet, there's cross-pollination between the factions, so maybe you can find some neat combo for your Azure Knights sliding over a bunch of freshly fracked oil slicks! Or, choose the Neverending Party, a raucous group of high-energy, hard-rockin' Skeletons! Twenty-six unique unit types, each with their own strengths, weaknesses, and unique special abilities! (More being added all the time in free DLC!) FIVE game modes: Tutorial, Story Mode, Campaign Mode, Ranked Mode and Custom Games. A fully functional MAP EDITOR! Controller support! Colorful pixel art and an original melodic soundtrack. Lots of developer support in the form of new patches, balance changes and MORE: More factions, more game modes, more platform support - you name it! You may know about another game of mine: Auro: A Monster-Bumping Adventure . It originally launched on Android back in 2014, and we just put out another patch in Jan of 2021. The point is: I commit to my games pretty hard, and this game will get tons of awesome support in the future! I also care deeply about what my players want to see in the game, so if you have any thoughts or ideas, please come chat with me on the discord about what you'd like to see in the future of Gem Wizards Tactics! The Gem Wizards Universe also has partying undead skeletons, stuffed animal bunnies, huge bug people, and a bunch more, so look forward to new factions being introduced in free future updates! Coming to Steam for Windows. Later on, will be coming to more platforms as well. Gem Wizards Tactics has won 'Best Game Design' from the Unfold Games Awards! From the designer of 100 Rogues , and Auro: A Monster-Bumping Adventure .",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1360270/header.jpg?t=1652451693",
    "Price": 14.99,
    "Developers": "Keith Burgun Games",
    "Publishers": "Keith Burgun Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_fa68466f2000bbc1016c037bec52ef4c21124d87.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_f87077f72422c1abb84920fed6a9df607be7e77c.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_b44a005ad264b186a139d449e090bb32f9de2948.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_9ca4caf4c608c9330a674fe787eadcaf7a826bb1.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_d50a6692ec7ad23fcbc38ffd5e0afc26f5dd8b75.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_645e8f38b650601e12930c61993e153a89bcbceb.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_40daa2ec1ae4c9ac22f868db09d96b993fa3040b.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_eb26b490d043264d14d7f19141cc644948e02ca0.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_88000639f1566da7bdb44d0487a87c20763ee174.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_e8aff67adba130ae8620b7a05d9c81f65c1d2450.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_e09858c39bcc87843adb00f6e9326a9ffaf0a009.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_2923f21dffc31dc051c3e33065d10adc13d31e57.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_8106901d2e7d17d6968517b8d0f34c6dab3c8249.1920x1080.jpg?t=1652451693,https://cdn.akamai.steamstatic.com/steam/apps/1360270/ss_1132873df847a18431f574dc6a5995bbebc2d8a7.1920x1080.jpg?t=1652451693",
    "Slug": "gem-wizards-tactics",
    "Meta Title": "Gem Wizards Tactics: Feb 16, 2021, Keith Burgun Games and...",
    "Meta Description": "Looking for information on Gem Wizards Tactics? Check out the release date (Feb 16, 2021), developer insights from Keith Burgun Games, and a complete ga...",
    "Alt Text Image": "Official header image for Gem Wizards Tactics game - Steam 1360270",
    "Canonical URL": "https://gusku.site/game/gem-wizards-tactics",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gem Wizards Tactics\", \"description\": \"Looking for information on Gem Wizards Tactics? Check out the release date (Feb 16, 2021), developer insights from Keith Burgun Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Keith Burgun Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Keith Burgun Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1360270/header.jpg?t=1652451693\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}