{
    "AppID": 1183470,
    "Name": "Imperiums: Greek Wars",
    "Release date": "Jul 30, 2020",
    "About the game": "Imperiums: Greek Wars is a unique combination of turn-based 4X and historical grand strategy with a mythological twist. Inspired by our previous award-winning title Aggressors: Ancient Rome , we bring you a fresh look at a Greco-Persian world of schemers, warmongers, and ruthless politicians. This merciless world is enhanced by myths and stories about heroic deeds and hidden treasures as only the Greeks were able to imagine. Greco-Persian world The game starts in 359BC when Philip II of Macedon takes the throne. Macedonia at the time is a backwater on the edge of the Hellenic world, but Philip is an ambitious man. He has a dream to become leader of the whole of Greece, a dream he will follow until his death... Choose one of 30 playable factions ranging from mighty Sparta or Athens, ambitious Macedonia, slowly declining Achaemenid Empire and its power-hungry satrapies, to a number of smaller Greek city-states and groups of semi-nomadic societies living on the outskirts of the Hellenic world. Lead your nation to glory if you can... Lead, rule and conquer Your task is to do more than survive. You are divine ruler, supreme military commander and political leader who seeks glory and prosperity for all your subjects. Lead them to magnificent victories, manage the economy on all levels, and provide successful livelihoods as well as stable and just government. It is not a task for the weak; all problems rest upon your shoulders; every crisis is a test of your political and military prowess. Decisiveness, tactical thinking, political shrewdness, and above all an adventurous spirit is what will cause one person to stand out - to rise as a star shining through the darkness of millennia to come. Historical immersion The Greco-Persian world of Imperiums is a faithful representation of historical reality, political relations, animosities and ambitions. Take a unique opportunity to experience on your own shoulders the weight of responsibility as the chosen one. As leader you can follow your own path or take advice and guidance from dozens of nation-specific objectives. Experience the ancient Greek world in such a detail as never before. Myths and Legends Ancient people believed in myth and legend; it was part of their reality. Those adventurous enough can send their generals in the footsteps of ancient heroes to find the Golden Fleece or untie the Gordian Knot. Unveil the truth of some of the stories and myths of the Greek world. Face the opponents Your opponents will be unforgiving, but if you want more of human slyness and unexpected turns, join a multiplayer game and challenge other players in a race to victory! New worlds The universe of Imperiums offers an endless number of realms. Imagine a world to your liking and let us bring it to you. Whatever your choice, enter with a clear mind and prove that you can not only survive but build an empire worthy of the title. Take advantage of the imagination of others and explore worlds they created. Go even a step further, let yourself be inspired as creator whose ideas shape others’ worlds. Learn with ease It is not shameful to take advice from time to time. You’re not alone in this cruel world; there is always guidance to explain, provide context, and offer recommendations. Let yourself be guided by your intuition and logic, and you will soon become a master.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1183470/header.jpg?t=1657213333",
    "Price": 29.99,
    "Developers": "Kube Games",
    "Publishers": "Kube Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_600edc651fb2214c51c26f6f4501d233c0848331.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_83e0016c15c4aabfa8eee4158ae0c4e9252f2cdc.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_a5a5364912fd9d333ee0ebccc03d0597af6d32b1.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_f4c17870b277b1fc6628afa312bd1f9879e4e0b8.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_e43bfb0502c29f361cb4abae847e208b9fdf6d17.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_e7bb6f834d8ce4a6a9ecb58790da4e4d0ee315d5.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_87ff07e75e0512657b7c3bdbabe0c98c345d9c77.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_fd11039c97d3e16b7ca034e0246f7d2600e0ee18.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_087b9e2762bdd8d56025138579b8313e9145d9b4.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_ce97125452e4dc5c6068d7564eeef059b4484187.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_a5d29b0450a7c05c4784935d6284f5f0c4c46d1e.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_4d1893df4d48f90cbab9a508c41937999795969e.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_681771b70b902b7f722ef01db811611c42775506.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_189658e3cd871064be8be27e3348056148b5b019.1920x1080.jpg?t=1657213333,https://cdn.akamai.steamstatic.com/steam/apps/1183470/ss_0a5a3ae1e3d9bf8406b767e80cced65db964752f.1920x1080.jpg?t=1657213333",
    "Slug": "imperiums-greek-wars",
    "Meta Title": "Imperiums: Greek Wars: Jul 30, 2020, Kube Games and Full ...",
    "Meta Description": "Looking for information on Imperiums: Greek Wars? Check out the release date (Jul 30, 2020), developer insights from Kube Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Imperiums: Greek Wars game - Steam 1183470",
    "Canonical URL": "https://gusku.site/game/imperiums-greek-wars",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Imperiums: Greek Wars\", \"description\": \"Looking for information on Imperiums: Greek Wars? Check out the release date (Jul 30, 2020), developer insights from Kube Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 30, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kube Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kube Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1183470/header.jpg?t=1657213333\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}