{
    "AppID": 602240,
    "Name": "Metacell: Genesis ARCADE",
    "Release date": "May 12, 2021",
    "About the game": "Game Metacell: Genesis ARCADE is an arcade game with the match 3 mechanic. Inspired by those old-school arcade games I grew up with and I wanted to emulate that experience within our own game. The basic gist of Arcade mode is a score attack mechanic where you want to survive to level 100 with the highest score by fighting back a never ending spawn of game pieces by making matches of 3 or more before the board fills up or even worse you are killed by one of the traps that could spawn at any moment. There are some things to make it not so hopeless; like some cool pickups, bombs and even extra lives. Story Summary Metacell: Genesis ARCADE is a sci-fi thriller that takes place in a distant future in which mankind has organized under a single galactic empire called the Imperium. Having already mapped and expanded deep within their universe, the Imperium has turned their attention to what lies beyond, and they found it. They discovered the means to breach the walls of our verse and create a gateway to the other side, the Metaverse. Once there the Holy Caste began their research into the newly discovered realm. Blinded by their eagerness for knowledge, they created an abomination known only as the Metacell. This monstrosity is a single-celled organism born from both meta and prime material, and mere moments after its creation it began to evolve and adapt at astronomical rates, escaping its containment and threatening the entirety of existence. Now only one man and his crew have even the slightest chance to defeat the Metacell and save both of the verses. Part 1 - Genesis The entry point into the saga this starts when the Imperium Palace gets word that the Genesis Project has gone terribly wrong and the Metacell has escaped and threatens the verses if not stopped. The protagonist High Paladin Dominic Moore and his crew are called in from their much needed vacation to put their lives on the line for what could be their last mission as they head to the Härkönen Abyss where Heaven’s Gate lies and enter the metaverse to defeat their foe. Development A little bit about us, we are just a few friends that wanted to make something awesome, so that’s what we are doing. We have been bootstrapping this project with no funding since day one (April 20, 2011) and have accomplished a ♥♥♥♥ ton and we continue to keep crushing it. The only thing that sucks is we have to budget our time on the project very carefully. We all have day jobs and families that take up the majority of our time. So development to say has been slow moving but forward movement none the less.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/602240/header.jpg?t=1626188183",
    "Price": 4.99,
    "Developers": "Posey,G,Tom",
    "Publishers": "Products for Robots",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/602240/ss_9f81c2fac8a217568a910b99b7d608b1a97cc70b.1920x1080.jpg?t=1626188183,https://cdn.akamai.steamstatic.com/steam/apps/602240/ss_5a3bb81fa27d7cc9cb62a6bd3b0daf7f156007e8.1920x1080.jpg?t=1626188183,https://cdn.akamai.steamstatic.com/steam/apps/602240/ss_010e4374aec62af53ad4039d65947d43ddee5c3f.1920x1080.jpg?t=1626188183,https://cdn.akamai.steamstatic.com/steam/apps/602240/ss_901a630b4ac1fd772c7347522c680a9e96c69955.1920x1080.jpg?t=1626188183,https://cdn.akamai.steamstatic.com/steam/apps/602240/ss_47c30c1b547f6130c97f9accbe131245e4277c65.1920x1080.jpg?t=1626188183",
    "Slug": "metacell-genesis-arcade",
    "Meta Title": "Metacell: Genesis ARCADE: May 12, 2021, Posey,G,Tom and F...",
    "Meta Description": "Looking for information on Metacell: Genesis ARCADE? Check out the release date (May 12, 2021), developer insights from Posey,G,Tom, and a complete game...",
    "Alt Text Image": "Official header image for Metacell: Genesis ARCADE game - Steam 602240",
    "Canonical URL": "https://gusku.site/game/metacell-genesis-arcade",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Metacell: Genesis ARCADE\", \"description\": \"Looking for information on Metacell: Genesis ARCADE? Check out the release date (May 12, 2021), developer insights from Posey,G,Tom, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 12, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Posey,G,Tom\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Products for Robots\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/602240/header.jpg?t=1626188183\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}