{
    "AppID": 1380410,
    "Name": "Puzzle Quest 3",
    "Release date": "Feb 28, 2022",
    "About the game": "Master strategic match-3 combat in Puzzle Quest 3, the all-new installment to the globally renowned puzzle-RPG franchise. Prepare yourself for an epic journey across Etheria, a dangerous fantasy realm filled with enemies to conquer and loyal allies to recruit. Explore mythical dungeons, uncover valuable loot, and unlock epic gear as you embark on a brand-new epic storyline to become the next Puzzle Quest legend! Discover Evolved Puzzle Combat Match gems in any direction to charge up your spells and unleash powerful attacks in action-packed 1-on-1 battles. A lot can happen in a single turn - planning ahead is the key to victory. Embark on a Hero’s Journey Choose the hero you want to be! Play as a Paladin, Berserker, Shaman, Assassin, or Necromancer, and discover a variety of storylines as you level up, build your hero’s skills, and acquire new weapons, armor, and more! Paladin: Holy warriors from the Agarian Kingdoms. Highly sought after, their aura of protective magic can extend out to cover all their companions. Berzerker: Fearsome warriors from the Northern plains beyond Theira. They can enter a ferocious rage where every strike is deadly. Shaman: With a strange eclectic mixture of healing and poisoning skills, Shamans hail from the southern jungles where they are both feared and revered by their people. Assassin: Silent killers of the night, Assassins excel at disabling their enemies in multiple ways and then ending them with a single decisive strike. Necromancer: Hailing from the chilly citadels of Skelheim in the borderlands, Necromancers are mysterious masters of both cold and death magics. PVP Action and Real-Time Multiplayer Coop Battle fellow heroes in PVP and climb the leaderboards, or form an alliance with up to three friends and traverse the deepest dungeons together in real-time! Signature Deep RPG Gameplay Become the hero of your own making by gaining experience and loot from your quests. Select from hundreds of different weapons and armor to sharpen your combat skills and take on increasingly powerful foes. Beautiful 3D Graphics Experience fully animated battles with true 3D graphics never-before-seen in a match-3 game! Epic Loot and Rewards Defeat your enemies and complete quests to obtain valuable loot, then upgrade your gear and prepare for the next battle. Regular Updates, Daily Quests, and Weekly Bounties Stay tuned for regular updates and new events, including new quests to complete and bounties to claim.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1380410/header.jpg?t=1646450347",
    "Price": 0.0,
    "Developers": "Infinity Plus 2",
    "Publishers": "505 Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1380410/ss_644ba1bd85ca027cf490c89135ba686250692248.1920x1080.jpg?t=1646450347,https://cdn.akamai.steamstatic.com/steam/apps/1380410/ss_3922d88d393b93ab8a59550a46c7cdb587c67249.1920x1080.jpg?t=1646450347,https://cdn.akamai.steamstatic.com/steam/apps/1380410/ss_9fff6d570d8c44e7e738adc3682f6ddd62097d03.1920x1080.jpg?t=1646450347,https://cdn.akamai.steamstatic.com/steam/apps/1380410/ss_e45afedf13e4adba0e4067620258251dd501ae24.1920x1080.jpg?t=1646450347,https://cdn.akamai.steamstatic.com/steam/apps/1380410/ss_e02e25bd31879c3efebd8e0060f6de179840703f.1920x1080.jpg?t=1646450347",
    "Slug": "puzzle-quest-3",
    "Meta Title": "Puzzle Quest 3: Feb 28, 2022, Infinity Plus 2 and Full Ov...",
    "Meta Description": "Looking for information on Puzzle Quest 3? Check out the release date (Feb 28, 2022), developer insights from Infinity Plus 2, and a complete game summary.",
    "Alt Text Image": "Official header image for Puzzle Quest 3 game - Steam 1380410",
    "Canonical URL": "https://gusku.site/game/puzzle-quest-3",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Puzzle Quest 3\", \"description\": \"Looking for information on Puzzle Quest 3? Check out the release date (Feb 28, 2022), developer insights from Infinity Plus 2, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Infinity Plus 2\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"505 Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1380410/header.jpg?t=1646450347\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}