{
    "AppID": 1829500,
    "Name": "QuizPoker: Mix of Quiz and Poker",
    "Release date": "Dec 8, 2021",
    "About the game": "Put your knowledge of various topics to the test or bluff your way to victory! QuizPoker combines poker and quiz elements. Unlike poker, however, QuizPoker does not deal cards, but asks guessing questions to which each player gives an answer. The rules are based on Texas Holdem Poker, but are still easy to understand even for beginners. Chips can be bet in a total of four betting rounds. The player whose answer is closest to the correct answer wins. Thrilling questions and hints! QuizPoker offers you a variety of questions and hints around topics such as sports, pop culture, history and many more. In addition, we are constantly working on expanding the questions to provide variety and excitement during the game. Get the win! Compete with your opponents in exciting question rounds and win their chips to decide the game in your favor. In doing so, you can convince with your knowledge or cleverly outplay other players if you can't guess the answer to the question at all. Customize your game. In order to provide all players with the most individual game experience possible, you have the option to customize some of the game settings. Decide for yourself how many players you are competing against or what difficulty level offline opponents have. Find out more. Wondering how many chips you've won or how many times you've answered a guessing question perfectly? Check out your personal stats and share them with your friends. Online Multiplayer. Even more excitement in multiplayer mode! Invite your friends to a QuizPoker session or compete against other players from the community by creating your own session or joining an already created game. How it works. A question round in a QuizPoker game might look like this: All players are asked a guessing question. For example: 'In what year was the musician Elton John born?' You enter your guess in the input field. Let's assume your guess is 1949. Now the first betting round follows: Since you are unsure how good your guess is, you, just like your opponents, do not bet any chips. Therefore, the first hint to the answer is now given. 1st hint: 'His big break came in 1970 with the album Elton John.' Your guess doesn't seem so bad, so you raise. Your opponents call. 2nd hint: 'Elton John was born shortly after the end of World War II.' Things are looking good for you! You raise again, so one opponent folds. Now the correct answer is shown. Answer: '1947' You are only 2 years away from the correct answer. If there is no Elton John fan at the table, your chances are not bad. You raise again. Now the players reveal their guesses. Player 1 has already left the game after the second clue. Player 2 guesses the year of birth to be 1952. You are closest and win all the chips of the entire question round!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1829500/header.jpg?t=1646394522",
    "Price": 5.99,
    "Developers": "Siwalu",
    "Publishers": "Siwalu",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_482ae16a4d476a07b4bdbfc6b8d0e9ae689f0474.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_e7bb75eb6361bfd6ea750e838d089ab74af265ee.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_be37b9f0f6627be4706e59bb92c1069187d97417.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_3c6ff7081371a8103fe813a2635e14daaaab6779.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_060eeac8dd22096eea1b650c01067319d3de4f01.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_4fccfe04c953d18a1f70760c30a1528fcaf156e1.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_802ed63fa36b48382c13104b6f704e4b33571c06.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_e19f75162ea30dc702ee58693edbfb01947c819d.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_087d48202e96e03c60ed17d07c5d711333bdbf45.1920x1080.jpg?t=1646394522,https://cdn.akamai.steamstatic.com/steam/apps/1829500/ss_6e27f6a8120bed4d8f6956e3f6aab1f2329579f3.1920x1080.jpg?t=1646394522",
    "Slug": "quizpoker-mix-of-quiz-and-poker",
    "Meta Title": "QuizPoker: Mix of Quiz and Poker: Dec 8, 2021, Siwalu and...",
    "Meta Description": "Looking for information on QuizPoker: Mix of Quiz and Poker? Check out the release date (Dec 8, 2021), developer insights from Siwalu, and a complete ga...",
    "Alt Text Image": "Official header image for QuizPoker: Mix of Quiz and Poker game - Steam 1829500",
    "Canonical URL": "https://gusku.site/game/quizpoker-mix-of-quiz-and-poker",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"QuizPoker: Mix of Quiz and Poker\", \"description\": \"Looking for information on QuizPoker: Mix of Quiz and Poker? Check out the release date (Dec 8, 2021), developer insights from Siwalu, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Siwalu\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Siwalu\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1829500/header.jpg?t=1646394522\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}