{
    "AppID": 1502770,
    "Name": "Re;Lord 2 ~The witch of Cologne and black cat~",
    "Release date": "Nov 19, 2021",
    "About the game": "Wilfried and his allies return in the second installment of the Re;Lord trilogy! With the district of Herfort liberated, Wilfried turns his attention to Cologne, controlled by the Witch of Ruin, Iris. Aid Wilfried and his allies in liberating Cologne and all of Groessen in this strip battle RPG! Story A fantasy world where magic exists. This is a story where demons lived among the denizens of the world. And it's the demon realm that was about to face an unprecented crisis when three 'Witches of Ruin' suddenly appeared and invaded the demon country of Saarland. Possessing power beyond what the demon kingdom could muster a defense against, Saarland had no choice but to surrender the region of Groessen to these invaders. The witches were not content to stop there as they also decided to make an example out of the demons by transforming them into stuffed animals to further rob them of their dignity. Half a year has passed since the appearance of the witches. As if straight out of a fairy tale, the majority of the people of Groessen have been transformed into stuffed animals and live under the rule of the Witches of Ruin. It is up to Wilfried, son of the governor of Groessen, to lead his ragtag army into battle with the witches and liberate Groessen. After defeating Erika Anders, one of the Witches of Ruin, and liberating the district of Herfort, Wilfried and his allies invade the domain of the Witch of Ruin, Iris, in order to break the spell cast over his father and his friends. The District of Cologne. Beyond the capital lies the idyllic, vast grasslands of this district. It's common to see animals grazing in the area and the popular tourist destination of Bebra Lake is home to Saarland's thriving fishing industry. With that said, it's still mostly a rural area. The people here have been transformed into crows, fairies and demons as if they were the messengers of the witch. While he questions the value of the witch's conquest of this territory, for the sake of all demonkind, Wilfried charges into battle against Iris. Meanwhile, the military finds out that the witch, Erika was defeated by a mere student and decides to dispatch a mercenary force, armed with firearms to Cologne to defeat Iris themselves. Features Point and click action RPG Full Japanese voice acting including main character, Wilfried Whimsical character and enemy designs Traverse the world map and reclaim territory using a variety of blocks Utilize the elements of wind, fire, lightning and ice to subdue your enemies Recruit allies and use their skills to give you an edge in battle Achievements system Tutorial and Training modes",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1502770/header.jpg?t=1637354865",
    "Price": 19.99,
    "Developers": "Escu:de,Element",
    "Publishers": "Sekai Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_aba30dcb2515c300d7a9ce0a54504bfadcceae1e.1920x1080.jpg?t=1637354865,https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_00bba7ef29fd6030c41f64d12e051d5b9e68b908.1920x1080.jpg?t=1637354865,https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_62b9a401497c7e78e7df1016192d8561e358ab0b.1920x1080.jpg?t=1637354865,https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_7cc11e360e7eac0f53ee5ccc5b51dc6c4799b62f.1920x1080.jpg?t=1637354865,https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_3fd0840fd4d3bfebc6592524b8d2040384bee72c.1920x1080.jpg?t=1637354865,https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_b5211bccc1ed9fc7a5a160cf275c054071dbf718.1920x1080.jpg?t=1637354865,https://cdn.akamai.steamstatic.com/steam/apps/1502770/ss_5696ac92e96b1f1eacdd4a81a5aa5c1dbf0a5b4c.1920x1080.jpg?t=1637354865",
    "Slug": "re-lord-2-the-witch-of-cologne-and-black-cat",
    "Meta Title": "Re;Lord 2 ~The witch of Cologne and black cat~: Nov 19, 2...",
    "Meta Description": "Looking for information on Re;Lord 2 ~The witch of Cologne and black cat~? Check out the release date (Nov 19, 2021), developer insights from Escu:de,El...",
    "Alt Text Image": "Official header image for Re;Lord 2 ~The witch of Cologne and black cat~ game - Steam 1502770",
    "Canonical URL": "https://gusku.site/game/re-lord-2-the-witch-of-cologne-and-black-cat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Re;Lord 2 ~The witch of Cologne and black cat~\", \"description\": \"Looking for information on Re;Lord 2 ~The witch of Cologne and black cat~? Check out the release date (Nov 19, 2021), developer insights from Escu:de,El...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Escu:de,Element\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1502770/header.jpg?t=1637354865\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}