{
    "AppID": 1393660,
    "Name": "Rising Constellation",
    "Release date": "Oct 27, 2021",
    "About the game": "Rising Constellation is a Multiplayer Real-time Online Strategy game set in a sci-fi universe. You begin as the leader of a star system and through strategy, skill, and collaboration you’ll expand your rule over the entire galaxy. Establish your home base, expand your presence, and build up a great army. You will outwit and out-maneuver your enemies and forge long lasting friendships with your teammates. The game can either be played at a slower pace over one month OR at a much faster pace over a few hours. You choose whether you want longer roleplaying conducive match or a quick RTS-style match. Find your favorite faction Are you a revolutionary from Myrmezir fighting for the abolition of machine slavery? Or are you a stelloliberal profiteer from A.R.K. exploiting machines for your own benefit? Embody a dynast in one of the five distinct factions with rich histories and backgrounds that you can help to deepen. Manage your resources and develop your empire Develop and grow your empire by planning the infrastructure of your systems. Pack your citizens into huge hive cities or give them the luxury of residential archipelagos. Build industrial centers capable of arming the largest war fleets or expand your culture by building huge monoliths. Turn your systems into impregnable bastions as powerful as the legendary Chatur Arsenal. Acquire patents to get the best ships Patents open the door to future technologies. You can make industrially devastated planets habitable through climate control or make advances through exobiology. But the patents will first allow you to buy the best military devices. Invest in drone technology and build drone carriers, formidable against fighter and corvette squadrons. Be on the cutting edge of armor research and build cruisers from your shipyards. Shape your empire Establish lexes that regulate the existence of your growing society. Will you allow combat drugs or will you prefer to use robots in your future wars? You can build a state within a state by allowing total surveillance of your citizens. But perhaps moving towards the doctrine of stelloliberalized entertainment will be the best way to keep your work force obedient. Hire powerful agents to assist in your expansion Recruit powerful agents from among 3 agent types. Will you prefer working with Navarchs to expand through military might? Will you enlist Erased to assassinate your enemy’s agents and spy on them? Or will you choose to extend your reach through diplomacy and coercion with Siderians? Finding the right mix might be the key. Take charge in leading your faction to victory Communicate with your teammates, find out where you’re most needed and become instrumental in your faction’s pursuit of galactic domination. There are several ways to win a game of Rising Constellation but all of them need some collaboration. Will you choose the Path of Conquest (militarily and diplomatically oriented), the Path of Influence (based on your factions total population), or the Path of Shadows (espionage oriented)?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1393660/header.jpg?t=1635357045",
    "Price": 19.99,
    "Developers": "Blackflag Games",
    "Publishers": "Blackflag Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_b900e2aa6bfb50074e165ff63a78bebb63aa5639.1920x1080.jpg?t=1635357045,https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_d7b2568065a1c5def9b09e0f9a952405bf6b163a.1920x1080.jpg?t=1635357045,https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_152be8c1dc47bfc91585051b0f5573e2e9fa860d.1920x1080.jpg?t=1635357045,https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_25db5a2220761c7383f39af28abcdd76b084d437.1920x1080.jpg?t=1635357045,https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_76d6e68afa9e68ec252a015bcdd3605ecd5b788f.1920x1080.jpg?t=1635357045,https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_71faae6b7a1f3132443f129ad754cff92e656971.1920x1080.jpg?t=1635357045,https://cdn.akamai.steamstatic.com/steam/apps/1393660/ss_7dc66ac2c9e5d302516a83dc45d246f8b6eba431.1920x1080.jpg?t=1635357045",
    "Slug": "rising-constellation",
    "Meta Title": "Rising Constellation: Oct 27, 2021, Blackflag Games and F...",
    "Meta Description": "Looking for information on Rising Constellation? Check out the release date (Oct 27, 2021), developer insights from Blackflag Games, and a complete game...",
    "Alt Text Image": "Official header image for Rising Constellation game - Steam 1393660",
    "Canonical URL": "https://gusku.site/game/rising-constellation",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rising Constellation\", \"description\": \"Looking for information on Rising Constellation? Check out the release date (Oct 27, 2021), developer insights from Blackflag Games, and a complete game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 27, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blackflag Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blackflag Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1393660/header.jpg?t=1635357045\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}