{
    "AppID": 552450,
    "Name": "Serious Sam VR: The First Encounter",
    "Release date": "Mar 30, 2017",
    "About the game": "Serious Sam VR: The First Encounter is a frantic arcade action FPS, featuring singleplayer and co-op campaign modes, various multiplayer modes, all presented in glorious VR with Croteam's new Serious Warp movement system. See what Sam sees, feel what Sam feels, and find out what it's like to BE the legend! KEY FEATURES: Serious Locomotion - Explore the levels using trackpad movement (if you are brave enough), go with safer built-in teleportation system and move quickly to avoid charging enemies with the help of Sam's personal translocator device or tweak and adjust the way you move through the VR space to best suit you playing style with using our own Serious Warp (tm) locomotion. Double the Gun, Double the Fun – Let go of the keyboard and gun down enemies in VR, one weapon in each hand, or dual-wield them, quadrupling your stopping power. Combine different guns or just grab two of the same, but whatever your style, remember: Mental must be stopped! Old School, New Engine - Hordes of enemies and non-stop action set against the expansive and visually stunning backdrop of ancient Egypt - all powered by the latest Serious Engine 2017 to create one of the most impressive VR experiences yet! Steam Workshop Support - where you will be able to submit your content creation or download new player-created modifications. Serious Sam Fusion 2017 integration - receive free updates for this game through the central hub. Oh, and play cross-platform with players of the 'flat' version to find out what's the ultimate combo: hi-tech motion controllers or good old keyboard &amp; mouse SINGLE PLAYER: Levels - Serious Sam is sent back through time to ancient Egypt to battle, explore and seek wisdom in 15 huge Egypt levels that also have over 80 secrets hidden and waiting to be discovered, in what is considered to be one of the most visually enjoyable VR experiences! Weapons - Play with a classic arsenal of 10 serious weapons including Colt, Chainsaw (!), Shotgun, Minigun and Cannon! Enemies - Go head to head against various enemies, including Sirian Werebull now charging at you in VR, while hearing Beheaded Kamikaze scream somewhere near by. THE Boss - Witness being VR stamped by almighty warlock giant Ugh-Zan III, who somehow managed to sneak behind you! Difficulty Settings - Choose between 5 difficulty settings to satisfy everyone, from FPS beginner and all the way to serious players! MULTIPLAYER: Up to 16 Players - Plunge into chaos with up to 16 players in various cooperative and versus modes, some playable in campaign levels, some in unique versus levels and some also in teams! Classic Co-Op - Plunge into chaos with up to 16 players in 15-level cooperative campaign mode, which is also fully customized like choosing difficulty, increasing enemies strength per player, turning on friendly fire or infinite ammo, setting respawn credits and much, much more! Coin-Op Co-Op - Play entire co-op campaign levels in classic 80's arcade style with limited lives! Beast Hunt and Team Beast Hunt - Compete against other players, or teams in Team Beast Hunt, hunting down various enemies to see who can get the best score at the end of each campaign level! Survival and Team Survival - Alone or with other team members, try to stay alive as long as you can against endless enemy attacks in specially designed survival map! Deathmatch and Team Deathmatch - Watch all hell break loose against other players or teams in classic deathmatch style! My Burden - Get highest score from collecting the points by holding the item, while others chase you to get hold of that item! Last Man Standing and Last Team Standing - Playing with only one life against each other, or as part of a team, try to be the last one alive! Capture the Flag - Grab a flag from other teams' base and bring it to your base for a score, while also defending your own flag! Instant Kill - One shot and you are gone!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/552450/header.jpg?t=1569336466",
    "Price": 39.99,
    "Developers": "Croteam VR",
    "Publishers": "Devolver Digital,Croteam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/552450/ss_c85c9af672c6ee88adbe57f6e589d47314f684ba.1920x1080.jpg?t=1569336466,https://cdn.akamai.steamstatic.com/steam/apps/552450/ss_558c57696fc47b8e0638b8c0a9386f57a38492db.1920x1080.jpg?t=1569336466,https://cdn.akamai.steamstatic.com/steam/apps/552450/ss_b88b433a290997500f2bd12b6328954d4c9f79d0.1920x1080.jpg?t=1569336466,https://cdn.akamai.steamstatic.com/steam/apps/552450/ss_13f9c541c940216119e53758c7f82316b11a635c.1920x1080.jpg?t=1569336466,https://cdn.akamai.steamstatic.com/steam/apps/552450/ss_019656de10858dbf83229561d98bd57238bcb761.1920x1080.jpg?t=1569336466",
    "Slug": "serious-sam-vr-the-first-encounter",
    "Meta Title": "Serious Sam VR: The First Encounter: Mar 30, 2017, Crotea...",
    "Meta Description": "Looking for information on Serious Sam VR: The First Encounter? Check out the release date (Mar 30, 2017), developer insights from Croteam VR, and a com...",
    "Alt Text Image": "Official header image for Serious Sam VR: The First Encounter game - Steam 552450",
    "Canonical URL": "https://gusku.site/game/serious-sam-vr-the-first-encounter",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Serious Sam VR: The First Encounter\", \"description\": \"Looking for information on Serious Sam VR: The First Encounter? Check out the release date (Mar 30, 2017), developer insights from Croteam VR, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 30, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Croteam VR\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Devolver Digital,Croteam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/552450/header.jpg?t=1569336466\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}