{
    "AppID": 1185660,
    "Name": "Sex Adventure - The Board Game",
    "Release date": "Dec 6, 2019",
    "About the game": "This board game is for adults only! Do you think your sex life could be more exciting? No matter what you think now, this board game is sure to help you earn points for helping the opposite sex. Never again monotonous sexual interaction! Make sure you impress your sex partner when you enjoy this erotic sex adventure together - up to the happy end! No matter if you are in a relationship or looking for a partner. With this game your first intimate moment together is guaranteed to be unforgettable! Each roll of the dice decides in which way you give yourselves up to lust. The game begins with the prelude phase. Here you roll the dice alternately. When the figure stops on a field, the sexy fairy 'Angel' tells you how to spoil your partner. In the beginning they are mostly harmless actions, later it gets hotter! If it's your turn, you get points until the next player rolls the dice. So at the end of the game you can see who took how much time for the other player. When the figure has reached the end of the board, you can decide whether you want to play another round of foreplay or start with sex. (You can also skip the foreplay at any time.) During the sex phase of the game, the foreplay fields change to sex fields. Each field shows a position. A bunch of different positions are randomly distributed on the board. If the figure stops on a field, the sexy fairy 'Angel' explains you in detail, how you should proceed with the position. ### Attention! ### We assume no liability if children are conceived while using this game! This board game contains: - An erotic foreplay phase, with countless foreplay combinations. - A sex phase with numerous positions described in detail and sexy. - The sexy fairy 'Angel' will guide you through the whole game. - 'Angel' speaks to you with your real name (if you have entered it). - No two games are alike! In each round all fields are randomly rearranged. UPDATE: New Features: 14 new achievements! new Timer After rolling the dice, a timer will now appear, counting down and showing you when the current action is finished. The timer can of course be cancelled if necessary. New Statistics The new statistics show you which actions were performed, how often and how long. Either just for today or for the whole period.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1185660/header.jpg?t=1597058056",
    "Price": 2.99,
    "Developers": "CritoGames",
    "Publishers": "CritoGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_0132c5d415de4ee3146cb5401456f216cdfdcbb5.1920x1080.jpg?t=1597058056,https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_327a33e3c80abcb9195c22ddb5680e26d050c56c.1920x1080.jpg?t=1597058056,https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_c3ff401841ce75c969295265a64085d2aef5db2e.1920x1080.jpg?t=1597058056,https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_187b79b3868a32d2250b79ce7ec3c05753222064.1920x1080.jpg?t=1597058056,https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_5bb1037d258733752681cd31b44c200a04990bff.1920x1080.jpg?t=1597058056,https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_68995f70bdbc0a129a9baa4b410977a615e094ca.1920x1080.jpg?t=1597058056,https://cdn.akamai.steamstatic.com/steam/apps/1185660/ss_ccea465c2ddf7506bd99270d3862f89e56484247.1920x1080.jpg?t=1597058056",
    "Slug": "sex-adventure-the-board-game",
    "Meta Title": "Sex Adventure - The Board Game: Dec 6, 2019, CritoGames a...",
    "Meta Description": "Looking for information on Sex Adventure - The Board Game? Check out the release date (Dec 6, 2019), developer insights from CritoGames, and a complete ...",
    "Alt Text Image": "Official header image for Sex Adventure - The Board Game game - Steam 1185660",
    "Canonical URL": "https://gusku.site/game/sex-adventure-the-board-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Sex Adventure - The Board Game\", \"description\": \"Looking for information on Sex Adventure - The Board Game? Check out the release date (Dec 6, 2019), developer insights from CritoGames, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"CritoGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CritoGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1185660/header.jpg?t=1597058056\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}