{
    "AppID": 1822970,
    "Name": "Shadowgate VR: The Mines of Mythrok",
    "Release date": "Jun 17, 2022",
    "About the game": "RE-LIVE SHADOWGATE The first book in the Shadowgate Saga, Shadowgate VR: The Mines of Mythrok brings the hit adventure series to virtual reality! On the 35th anniversary of the original release of Shadowgate, you can now step into the fantasy world of Kal Torlin like never before, immersing yourself completely in this exciting action/adventure game! With Odin the raven as your guide, and four difficulty levels to fit your play style, it's time to discover what secrets await within the Mines of Mythrok! DELVE DEEP Launched in 1987 on the Apple Macintosh, Shadowgate is the granddaddy of first-person, fantasy adventure games. Developed by Dave Marsh (founder of Zojoi) and Karl Roelofs, Shadowgate has been redesigned and/or ported it to over 15 platforms. While the beloved game has been critically well-received, it has never achieved the ultimate goal of its creators - actually being inside the fantasy world. That is, until now. Don your headset, unsheath your powerful wand and move through the Dwarven halls of Mythrok, solving puzzles, confronting monsters and fulfilling your destiny! EXPLORE ANCIENT DUNGEONS Marvel as you move deep into the Dwarven mountains, through mystic chambers, trap-laden hallways and massive caverns. SOLVE DEVIOUS PUZZLES Use your wits to divine magical symbols, disable hidden traps, and decipher ingenious riddles. WIELD ELEMENTAL MAGIC Arm yourself with a sorcerer’s wand and impervious shield, perfect for disarming dungeon defenses and incinerating the deadly denizens that lurk in the shadows. RIDE DWARVEN MINECARTS Ready your wand, step aboard ancient minecarts and discover what the Dwarves unleashed deep within the mountains. IMMERSE YOURSELF IN THE SOUND DESIGN Composer Rich Douglas returns to bring Shadowgate to life with a killer sound design. EMBRACE YOUR FAMILIAR Your faithful companion, Odin the Raven, is at your beckon call to show you hidden secrets and provide hints and sarcastic quips in equal measure. PERSONALIZE YOUR ADVENTURE Collect gold to customize your wand and shield with new skins. You can even put awesome hats on Odin or completely change his appearance. CHOOSE YOUR DIFFICULTY LEVEL Four different difficulty levels are available, accommodating novice players to hardcore adventurers. UNLOCK ACHIEVEMENTS Search the dungeons and solve its mysteries if you wish to unlock 11 different achievements. PLAY YOUR WAY Personalize your game play experience by taking advantage of our wide range of settings. Arachnophobe? No problem! Our Silly Spider option has you covered! ADVENTURE AWAITS! Come experience this classic adventure in a whole new way!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1822970/header.jpg?t=1655473814",
    "Price": 24.99,
    "Developers": "Zojoi LLC.,Azure Drop Studios",
    "Publishers": "Zojoi LLC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1822970/ss_7b16391c3ee15b1906b1fdba9735cd8185cb1483.1920x1080.jpg?t=1655473814,https://cdn.akamai.steamstatic.com/steam/apps/1822970/ss_1887ca350a535027f6288373c68c240a9c090a9e.1920x1080.jpg?t=1655473814,https://cdn.akamai.steamstatic.com/steam/apps/1822970/ss_1841cc9743a81d163c4aa5d901377f8420de7fc4.1920x1080.jpg?t=1655473814,https://cdn.akamai.steamstatic.com/steam/apps/1822970/ss_9a4cf9e1a1543cc58d138b8a81cb4a007726b9f7.1920x1080.jpg?t=1655473814,https://cdn.akamai.steamstatic.com/steam/apps/1822970/ss_13fe43204ba26f30b5c2168b839a2e4d225055e0.1920x1080.jpg?t=1655473814",
    "Slug": "shadowgate-vr-the-mines-of-mythrok",
    "Meta Title": "Shadowgate VR: The Mines of Mythrok: Jun 17, 2022, Zojoi ...",
    "Meta Description": "Looking for information on Shadowgate VR: The Mines of Mythrok? Check out the release date (Jun 17, 2022), developer insights from Zojoi LLC.,Azure Drop...",
    "Alt Text Image": "Official header image for Shadowgate VR: The Mines of Mythrok game - Steam 1822970",
    "Canonical URL": "https://gusku.site/game/shadowgate-vr-the-mines-of-mythrok",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shadowgate VR: The Mines of Mythrok\", \"description\": \"Looking for information on Shadowgate VR: The Mines of Mythrok? Check out the release date (Jun 17, 2022), developer insights from Zojoi LLC.,Azure Drop...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 17, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zojoi LLC.,Azure Drop Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zojoi LLC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1822970/header.jpg?t=1655473814\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}