{
    "AppID": 562230,
    "Name": "Space Tyrant",
    "Release date": "Feb 27, 2018",
    "About the game": "Finally, a mega-empire builder where you can enjoy titanic space battles and galaxy-wide conquests but not run over your employer-mandated allotment of lunch-eating minutes. In Space, Nobody Can Hear You Die Screaming. (THOUGH YOU ARE STILL DYING, OK, IT'S JUST THAT YOUR SCREAMS DON'T TRANSMIT THROUGH THE VACUUM OF SPACE, WHEN YOU'RE IN SPACE. DYING.) Features Tactical combat! Strategic scheming! Grimdark grimness! No cultural victories! No diplomacy! In Space Tyrant there can be only slaughter! Tons of excellent space cards to play! Space aliens! Space police! Simplified, easy-to-grasp 5X (eXplore, eXploit, eXpand, eXterminate and eXsanguinate!) Swift gameplay means quick deaths and lightning-fast victories! Hours upon hours of space strategy delivered steaming-hot into your gaping tentacular maw-orifice, the way you demanded it! And what about those crazy space battles? Feast your brains... The Hoplite Dynasty You start off in command of the Hoplite Dynasty; a savage empire of ticked off 'rabbots' who burrow into the enemy fleets with a fevered tenacity found only in the cold vacuum of space. They're an angry mob of cranksters; always more than ready to tear it up on behalf of your maniacal calculations. Just look at these things, almost eager to die miserably at your slightest whim: The Bzzerk Union Once you and the Hoplites have callously knocked a chip off the galaxy's shoulder, the Bzzerk empire will become yours for the Tyranting. They're a fierce army of mechanized Bees who live only to put the sting in your zing. The little ones die off easy, but they're cheap to replenish and 'death by a thousand cuts' is no joke. In fact, it's exactly the good times these swarmy little bast*rds crave as they smash against the windshield of endless war: The Techno Slug Party Once you've pushed the Bzzerks through to victory and cranked the galaxy down another notch, you'll have sufficiently brought the Techno Slug Party under your iron rule. These slimy little dance party invertebrates don't know the meaning of sleep, or healthy choices... or paying rent - but they'll put some serious hurt on anything that stands in their way. As malleable and spaced out as they may seem, their chemical fortitude is yours to wield with lucid vicariousness. I don't want to give away too much, but unlike their more sober predecessors, they will literally go the extra mile for a true Tyrant. We'd show you the Techno Slugs too, but it would be in violation of our low attention span directive. Hey look, a squirrel! About Blue Wizard Digital Founded by Jason Kapalka, who formerly founded some outfit called PopCap, which made puny weakling non-space-conquering games like Bejeweled and Peggle and Plants vs Zombies, before it was acquired by the necrotic empire of Electronic Arts. Blue Wizard recently released the darkly comic sliding block puzzle/ 80's slasher movie tribute Slayaway Camp to Steam and iOS. The Space Tyrant team consists of a crew of gore-thirsting void pirates and psychic mutants barely contained inside a fetid barracks atop a Capitol Hill coffeeshop in Seattle. Sanctions are already in place.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/562230/header.jpg?t=1618873784",
    "Price": 19.99,
    "Developers": "Blue Wizard Digital",
    "Publishers": "Blue Wizard Digital",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_cc73ba785fb0ee72af801c30a022da87c4af6cbc.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_a5d90f8892078555c08228fa6db89a563e792376.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_050fca45e53d39217eaac84643202aebcfd5b331.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_b0788a2e8d5f3133336edd76bdbdaf95f9dbebd4.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_90de4477afd899329b2b198ddcf3139562adeb3a.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_a76dadc7e7934fd12f7326c938538c75738ba19a.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_19fa1859c9879f5177aa66715aacea27dd138f3b.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_1101ac644702542288d3a7e36ed784f8f0016e5b.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_5f6a43216d8c5e3f6eeb40a3a73f06e74ece259b.1920x1080.jpg?t=1618873784,https://cdn.akamai.steamstatic.com/steam/apps/562230/ss_b555fd355bf86ff5c017398c70a01541e59ae08b.1920x1080.jpg?t=1618873784",
    "Slug": "space-tyrant",
    "Meta Title": "Space Tyrant: Feb 27, 2018, Blue Wizard Digital and Full ...",
    "Meta Description": "Looking for information on Space Tyrant? Check out the release date (Feb 27, 2018), developer insights from Blue Wizard Digital, and a complete game sum...",
    "Alt Text Image": "Official header image for Space Tyrant game - Steam 562230",
    "Canonical URL": "https://gusku.site/game/space-tyrant",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Space Tyrant\", \"description\": \"Looking for information on Space Tyrant? Check out the release date (Feb 27, 2018), developer insights from Blue Wizard Digital, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Blue Wizard Digital\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Blue Wizard Digital\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/562230/header.jpg?t=1618873784\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}