{
    "AppID": 397150,
    "Name": "Stellar Overload",
    "Release date": "Oct 11, 2016",
    "About the game": "Stellar Overload is an adventure game, in a world made of blocks. The playground, completely open, is made up of different cubic planets. While progressing through the science fiction scenario, you will have to explore all these planets, alone or with others... The playground Each planet has its specific set of resources. By exploring them, you will unlock access to new technologies. Merx, the small green planet, is the first planet of the game. Story and important characters Stellar Overload is a scenarized adventure game where you’ll go on a quest to free the planet Merx from the yoke of the robots. Some characters, directly related to the main quest, will give you valuable information to help you progress. Features related to the story and progression: - Possibility to customize your character - Dialogues related (or not) to the quests - Monitor your quest objectives in real-time - A progression curve related to the quests but also to exploration - Planets (and enemies) of different levels Exploration and craft While progressing through the main quest, exploring the world and the dungeons, you’ll unlock more and more recipes. These recipes will help you get stronger and go further into the adventure. You will need raw resources to create various objects (tools, weapons, armors...). You can find these resources by different ways: pick them up directly on the planets, find them in chests or get them as quest rewards. Exploration and craft features: - A global map of the planets - A minimap - A jetpack to travel through the caves more easily - Possibility to create a vehicle to move faster - Different craft stations - Glowblocks will help you enlighten the caves - Different levels of gauntlet in order to pick up the various blocks of the game - Teleportation (within a dungeon or between planets) - Semi procedural dungeons - Evolving music and soundscape based on the day-night cycle Combat To defend yourself against your enemies, you will rely on the creative talents of some important characters in the story, and learn how to create weapons and armors. The Block-Thrower is an exotic weapon, it can load any of the game’s blocks and throw them at enemies. Depending on the nature of the blocks, damage and effects will be different. Damage aside, if you throw a Glowblock against a cave wall, it will enlighten the cave. Features related to fighting in this early access version: - 5 different weapons: the pistol, the rifle, the Block-Thrower, the sonic carbine and the grenades - 1 armor to greatly reduce damage - 6 different enemies (Arkuloids, Cognitrons, Legionnaire robots, Plasma turrets, Tesla pylons) - A boss in the fortress Construction Since Stellar Overload is a game made of blocks, the construction (and harvest) is an important aspect of the game. You can build all types of structures but also vehicles, which will facilitate the exploration of the planets. A creative mode is available, allowing you to unleash your imagination without worrying about the scenario. Construction features: - 6 different shapes of blocks - Easily place and destroy walls (straight or sloping) - A tool to 'paint' the targeted area with a certain material (adjustable size) - A tool to save a construction and place it elsewhere ('copy/paste') - Possibility to define an alignment grid (to facilitate the placement of shapes) - Undo / Redo : very useful in creative mode! - More than 200 different materials A few numbers in blocks Merx, the first planet of the game, which is also the smallest, is 1200 blocks long per side, with an area of 1.4 million blocks for each face. It has a total area of 540,000 m² and is composed of about 2 billion blocks! For the planet Skahar, the largest, which is 8000 blocks long per side, each face has an area of 64 million blocks. The whole planet has a total of about 500 billion blocks!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/397150/header.jpg?t=1542134414",
    "Price": 0.0,
    "Developers": "Cubical Drift",
    "Publishers": "Cubical Drift",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_b8a6e381fa83311de56818ecb782ee2ab076044f.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_bfb3cb26771530f7294c92186b5e8b6c3c727b40.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_7075c531ba9eca041ae0e0838a229d871dae1e90.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_3ce911c93901d3e6a4f195c7eb7b7283ec42caf3.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_fe218ede82e7f00f7a97c4379ddd5db13c3a55af.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_d201b2d3a77b7b50437064b631c2f1c6ba8ad0c8.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_78192e1f643a4e053da2687406e6ef7b570ffd79.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_09548b138eab75302197e2adf656a53f86613674.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_e2995e361a7cb4d467b7faa138dc7006d8460276.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_049b229ca8eb053877e59bfd855160383724e256.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_67b69651d8158f5399ccfd2c89d9c29825906aee.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_2a67f63839cfc92f4b10cb2c5b6419b3af0e8db7.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_0039bec9e497f749ec48b21fcc968c06b36cf138.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_010e6bbd89d2cd7e7b60262ac7bc9c64a60dab44.1920x1080.jpg?t=1542134414,https://cdn.akamai.steamstatic.com/steam/apps/397150/ss_a8ff31e8253c30546353f3e6244872bbbc86ef71.1920x1080.jpg?t=1542134414",
    "Slug": "stellar-overload",
    "Meta Title": "Stellar Overload: Oct 11, 2016, Cubical Drift and Full Ov...",
    "Meta Description": "Looking for information on Stellar Overload? Check out the release date (Oct 11, 2016), developer insights from Cubical Drift, and a complete game summary.",
    "Alt Text Image": "Official header image for Stellar Overload game - Steam 397150",
    "Canonical URL": "https://gusku.site/game/stellar-overload",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Stellar Overload\", \"description\": \"Looking for information on Stellar Overload? Check out the release date (Oct 11, 2016), developer insights from Cubical Drift, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 11, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cubical Drift\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cubical Drift\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/397150/header.jpg?t=1542134414\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}