{
    "AppID": 1000540,
    "Name": "Tactical Control",
    "Release date": "Mar 21, 2019",
    "About the game": "Minimalist strategy for grown-ups: Tactical Control is a strategy game for people who aren't strategy gamers. It is a real-time tactics game that does not reward actions-per-minute, memorized build orders and hard unit counters. Each game is a duel between two opponents. Players start with a base and seven units of various types. The goal is to destroy the enemy base. Army compositions are randomized at the beginning of each battle. Each player has the option to discard and re-roll units that don't fit their preferred tactics and personality. All unit types are valuable when used correctly, but they also have weaknesses that can be exploited by a competent enemy. Players must learn to use the units that they have, to anticipate the opponent's tactics and apply their strengths against the enemy's weak points. The game's visuals are designed for immersion, simplicity and clarity. Flashy graphics are actively avoided, as they are at best a distraction, when not actually obscuring vital information. The game is meant to be played, for free, against random opponents from around the world. Players who wish to challenge their friends can buy the Custom Games DLC, which allows inviting friends to matches and customizing players' armies. Features: short one-on-one matches minimalist visuals with simple, clear graphics diverse unit types, each powerful when used correctly randomized armies: you must use what you have, but no two matches are the same free version: play online against random opponents premium version: pay once to unlock custom matches against friends players connect directly to each other, not to servers that might be hacked or shut down How to Play: Unit Control: Click any of your units to select it, so you can give orders to that unit. Click the map to order your unit to move. Click the unit itself to order it to stop. Combat: While a unit is selected, click an enemy to attack. Most units can move and attack at the same time. However, if the enemy is out of range, your units will not attack. Visibility: The two bases are always visible, but the armies aren't. Enemy units are visible only if one of your units is close enough to see them. Each unit type has a 'visibility' radius, where enemy units will detect it. Units who fired recently have greatly increased visibility, for a short time. For hidden enemy units, their last known position is displayed by a blinking icon. When the battle starts, the players can see what units the enemy has and their starting positions. Unit types: Each type of unit is different, with its own strengths and weaknesses. To win, players must use each unit correctly and in cooperation with the rest of the army. See unit list below for detailed descriptions of each unit type. Unit types: B The Base. Bases cannot move or attack. They are always visible to the enemy. Losing your base means losing the match. A Assault Armor. Durable and powerful, but very slow and always visible to the enemy. C Close Combat. Very high damage and fast, but very short range. I Infantry. Average performance, can become entrenched for extra durability and camouflage. H Heavy Weapons. Long-range artillery, powerful but fragile. Requires 20s after moving before it can fire. R Recon Rovers. Fast and stealthy but fragile under fire. S Skirmishers. Long-range mobile attackers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1000540/header.jpg?t=1553210986",
    "Price": 0.0,
    "Developers": "Hellride Games",
    "Publishers": "Hellride Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1000540/ss_d22a56ce4405307ad5ac90e7c71ea9ea10bd07da.1920x1080.jpg?t=1553210986,https://cdn.akamai.steamstatic.com/steam/apps/1000540/ss_5136724338652a76850de5873ee786a7f70b398a.1920x1080.jpg?t=1553210986,https://cdn.akamai.steamstatic.com/steam/apps/1000540/ss_54d267cae803ed2f3e24d253ec8c0f8cb8c8cbbe.1920x1080.jpg?t=1553210986,https://cdn.akamai.steamstatic.com/steam/apps/1000540/ss_7525df32b4f783a667d481cf73cda581b4f40fb4.1920x1080.jpg?t=1553210986,https://cdn.akamai.steamstatic.com/steam/apps/1000540/ss_cc7ca2c6dd08da89eef69d866eacf1826fb1c125.1920x1080.jpg?t=1553210986",
    "Slug": "tactical-control",
    "Meta Title": "Tactical Control: Mar 21, 2019, Hellride Games and Full O...",
    "Meta Description": "Looking for information on Tactical Control? Check out the release date (Mar 21, 2019), developer insights from Hellride Games, and a complete game summ...",
    "Alt Text Image": "Official header image for Tactical Control game - Steam 1000540",
    "Canonical URL": "https://gusku.site/game/tactical-control",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tactical Control\", \"description\": \"Looking for information on Tactical Control? Check out the release date (Mar 21, 2019), developer insights from Hellride Games, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 21, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hellride Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Hellride Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1000540/header.jpg?t=1553210986\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}