{
    "AppID": 517340,
    "Name": "Tank Tread",
    "Release date": "Sep 5, 2016",
    "About the game": "Tank Tread is a multiplayer real-time strategy game with modern military units. Gather resources, build your base, forge your army and crush your enemies. Game Description In Tank Tread you get to participate in exiting real-time combat with up to 20 simultaneous players. There are four teams available so you can play with your friends or against them, as you wish. You begin the game with a humble base and few units. From there it's up to you to set up resource income, plan which advanced units you choose to research and create units for base defense. Utilize fast units for scouting the location of your enemies while at the same time building forces for attack. When time is ripe, coordinate the offensive with your team mates. Victory conditions are: destroy all enemy buildings and units. Frequently Asked Questions Q: How many and what sort of buildings there are in the game? There are total of six buildings in the game and additionally Oil pump and Smelter buildings for resource gathering. Here are the details: Command Center, where you create Builder units Barracks, where you create all infantry units Light vehicle factory, where you create fast scout units and APCs Vehicle factory, where you create tanks and rocket launchers Research Center, where you do research for more advanced units Airfield, where you create all aerial units Q: How many and what sort of units there are in the game? There are currently a total of 17 units in the game. All battle units have real-world counterparts which they have been modelled after, but we have decided to use fictional names for them. Here is the unit list: Builder unit, this is used for creating all the buildings Infantry: Assault rifle unit Scout unit with SMG Sniper unit Anti-tank unit with rocket launcher Light vehicles: Hyena, fast scouting unit Bloodhound, fast scouting unit Typhoon, APC which carries 8 infantry units Phalanx, APC which carries 8 infantry units Truck, carries 20 infantry units Vehicles: Inquisitor, a heavy battle tank Warmonger, a heavy battle tank Nemesis, a rocket launcher unit Behemoth, a rocket launcher unit Aerial units: Archer, an attack helicopter Serpent, an attack helicopter Reaper, a STOVL fixed-wing aircraft Q: How many different locations there are? Currently we have implemented four maps. We have Desert and Mesa maps where you need to do some effort to find your enemies. We also have a River map, where it is crucial to hold the few scarce bridges. Fourth map is a Waterlands map where you will have to find your way around the water areas to reach the enemy. Q: How many players per game? You can start the game with two players, and maximum is 20 players. There are 4 teams available which each can hold up to 5 players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/517340/header.jpg?t=1473064123",
    "Price": 9.99,
    "Developers": "INT2000",
    "Publishers": "INT2000",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_ed8b4d591fa6aa664615b4aa43f4bb5b6e352202.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_cbab9c4ba4bc9ae7ab29d36a9521181d77b8e091.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_3900452193c2059cc164c7681c034be4dc44cc51.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_4ae634a27be82e793e10510ee3929fc423860ab9.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_872149e8a417e070e77d0bbfe35d65e1cf1a7a43.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_2054034929fc5bc792ecd77ed024b02c31ee704a.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_6b33d502bef9433e893756279a0d278aa3467125.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_8caf17f5374436c249c43f354440fa5a4097d55a.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_746c5ec510bf6cdf14a196a99bd95d48178c1a79.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_61205ac860e4e39bebe398c650ff7004b30f341d.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_0c5e85435db863962dd18b197036366549da0628.1920x1080.jpg?t=1473064123,https://cdn.akamai.steamstatic.com/steam/apps/517340/ss_6fc8d64baadbf5b9e50041d8f00ffa95e8b4b082.1920x1080.jpg?t=1473064123",
    "Slug": "tank-tread",
    "Meta Title": "Tank Tread: Sep 5, 2016, INT2000 and Full Overview",
    "Meta Description": "Looking for information on Tank Tread? Check out the release date (Sep 5, 2016), developer insights from INT2000, and a complete game summary.",
    "Alt Text Image": "Official header image for Tank Tread game - Steam 517340",
    "Canonical URL": "https://gusku.site/game/tank-tread",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tank Tread\", \"description\": \"Looking for information on Tank Tread? Check out the release date (Sep 5, 2016), developer insights from INT2000, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 5, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"INT2000\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"INT2000\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/517340/header.jpg?t=1473064123\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}