{
    "AppID": 557970,
    "Name": "Teria",
    "Release date": "Jan 17, 2017",
    "About the game": "Teria: an action quest 3D game for science fiction fans. Story: Back on Earth, the Mission Control Center picks up a distress signal from a distant settlement on Teria, a planet in the Vertex constellation. Teria is a rocky planet with rudimentary soil and a small presence of water. There is nothing particularly notable about Teria, except for its massive reserves of Kretium, a rare metal used to build super strong structures. As a material, Kretium is more valuable than gold and platinum combined. Settlers from Earth established a colony there and have been mining Kretium for sale. In return for the Kretium, the settlers bought the goods and machinery required to sustain their lives there. Teria is located far from the stellar highways, so it is unusual for the planet to receive visitors. However, on June 17, 2143, the crisis center of the Central Astronautics Agency picked up a distress signal from Teria, which was then forwarded to Alex. Alex is a private detective who at that time happened to be not far from Teria. As his spaceship completed its landing on the planet, it was attacked and ultimately destroyed by unknown assailants. In order to survive, Alex must find out the truth... Game: You are Alex. Step by step, with instructions from the station robot (which you must find first), you must cleanse Teria of Morphs (bio-robots designed to look like zombie dogs). You will meet face to face with the Aliens and learn why this unknown planet suddenly became the epicenter of such bloody events. On Teria, you will find everything you need, including various weapons for different situations, medical kits for treatment, protective field generators, and many other devices you will need in order to survive. You will have to use all of these items skillfully to both ensure your own survival, and ultimately save the Teria settlers. Releases: The game is designed as a series released Episode by Episode. The current release includes Episode 1, entitled 'The Beginnings of Salvation.' Users who purchase the game now will receive all new episodes for free. The release of Episode 2, 'Under,' is expected in May 2017.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/557970/header.jpg?t=1490125564",
    "Price": 0.99,
    "Developers": "ElZzap Software",
    "Publishers": "ElZzap Software",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/557970/ss_8f276791e1efe106e33d48d698eeb3327726d8b3.1920x1080.jpg?t=1490125564,https://cdn.akamai.steamstatic.com/steam/apps/557970/ss_ac495ea210efd2d9603a04f1c0fa9811f3661e76.1920x1080.jpg?t=1490125564,https://cdn.akamai.steamstatic.com/steam/apps/557970/ss_c7ff9baa7ae07788489be8f487e587de2b7f0cb5.1920x1080.jpg?t=1490125564,https://cdn.akamai.steamstatic.com/steam/apps/557970/ss_ec04884a30f2dd0b2e0cc4b2b06243d81000b362.1920x1080.jpg?t=1490125564,https://cdn.akamai.steamstatic.com/steam/apps/557970/ss_049d939f3d221f1e136eac3bba32896422cf5356.1920x1080.jpg?t=1490125564",
    "Slug": "teria",
    "Meta Title": "Teria: Jan 17, 2017, ElZzap Software and Full Overview",
    "Meta Description": "Looking for information on Teria? Check out the release date (Jan 17, 2017), developer insights from ElZzap Software, and a complete game summary.",
    "Alt Text Image": "Official header image for Teria game - Steam 557970",
    "Canonical URL": "https://gusku.site/game/teria",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Teria\", \"description\": \"Looking for information on Teria? Check out the release date (Jan 17, 2017), developer insights from ElZzap Software, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ElZzap Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"ElZzap Software\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/557970/header.jpg?t=1490125564\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}