{
    "AppID": 682480,
    "Name": "恒水中学连环虐杀 / The untold story of hengshui school",
    "Release date": "May 2, 2018",
    "About the game": "The Untold Story of Hengshui School is a detective game which sets on Hengshui high school, a top notch middle high around the country, also called “straight A student camp” in which most of the students have entered great universities after graduation. However, what behind this glamorous legend was a “huge skeleton in the closet”. A student named Shen Jige killed himself by jumping of the building. A “lame” police officer Song Tianqi and two students, Li Musha and He Mina, start an investigation on the case. Unexpectedly, this appeared suicide is just the beginning of a shocking conspiracy… The theme of this game reflects a social problem in China: the examination-oriented educating system which constantly ignores the individual differences and hobbies, focusing on grades instead of social skills, and has no respect for student privacy. Students are holding on to a philosophy that score is superior than their own emotions and freedom. Key Features: Black humor, realism, and AVG. You’ll have to investigate each incident, search for clues, and talk to all involved people to try and unravel the mystery of each case! Murders and detective thriller! But not the “cult film” kind of type. Silly humor and mediocre difficulty are suitable for every player. Collecting Evidence: Collect evidence by many methods like talking with characters and answering questions. Keep in mind that some characters have special personalities. They are willing to tell you information only after you know their hobbies and experiences. Series of Counterattack Mode: An extremely complicated puzzle will trigger the series of counterattack mode on, in which you can notice the subtlest details that are neglected by most people and discover the shocking truth behind the seemingly simple cases. Test Score System: HP bar is replaced by a test score system---you answer wrong, your test score drops. Once your test score is below 60, you will fail the test and no longer be able to unlock the ending. Feel the wrath of bad students! “Stupid” Questions: Once your test score is below 60 yet you are not willing to restart the whole game, you have the option of answering Principle Cat’s “stupid” questions, which cover many important knowledge points from high school subjects including Chinese, math, history, biology, etc. Some of the questions even can be found in the college entrance exams(Gaokao) in real life, and the answers contain many “Chinese features” as well.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/682480/header.jpg?t=1550111979",
    "Price": 3.99,
    "Developers": "橙光游戏",
    "Publishers": "橙光游戏",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/682480/ss_f9ad601e605c3bbb4312998e11ded72157d89e39.1920x1080.jpg?t=1550111979,https://cdn.akamai.steamstatic.com/steam/apps/682480/ss_78dcb46e7e4210e81e4171324431bf1ff1cbe4c2.1920x1080.jpg?t=1550111979,https://cdn.akamai.steamstatic.com/steam/apps/682480/ss_f4fc6875bb55d316b75cd9dfaf304830baf1ade4.1920x1080.jpg?t=1550111979,https://cdn.akamai.steamstatic.com/steam/apps/682480/ss_841ac214a5ec4a5bd47fe770e3dc35ddf381f2de.1920x1080.jpg?t=1550111979,https://cdn.akamai.steamstatic.com/steam/apps/682480/ss_6253c22c5fa5c3ea5bcbe9a48a23d3e6e3330c18.1920x1080.jpg?t=1550111979,https://cdn.akamai.steamstatic.com/steam/apps/682480/ss_5734d19764f74765a9690776567936dea0d87ec7.1920x1080.jpg?t=1550111979",
    "Slug": "the-untold-story-of-hengshui-school",
    "Meta Title": "恒水中学连环虐杀 / The untold story of hengshui school: May 2, 20...",
    "Meta Description": "Looking for information on 恒水中学连环虐杀 / The untold story of hengshui school? Check out the release date (May 2, 2018), developer insights from 橙光游戏, and a...",
    "Alt Text Image": "Official header image for 恒水中学连环虐杀 / The untold story of hengshui school game - Steam 682480",
    "Canonical URL": "https://gusku.site/game/the-untold-story-of-hengshui-school",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6052\\u6c34\\u4e2d\\u5b66\\u8fde\\u73af\\u8650\\u6740 / The untold story of hengshui school\", \"description\": \"Looking for information on \\u6052\\u6c34\\u4e2d\\u5b66\\u8fde\\u73af\\u8650\\u6740 / The untold story of hengshui school? Check out the release date (May 2, 2018), developer insights from \\u6a59\\u5149\\u6e38\\u620f, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"\\u6a59\\u5149\\u6e38\\u620f\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/682480/header.jpg?t=1550111979\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}