{
    "AppID": 553520,
    "Name": "Trainz Railroad Simulator 2019",
    "Release date": "Jan 7, 2019",
    "About the game": "Welcome to the latest (and best ever) release of Trainz Railroad Simulator, keeping railroad fans engrossed since 2001! Whether you want to drive trains, operate a railroad with dozens of AI drivers, or create your own dream railroad masterpiece with the world's friendliest building tools, TRS19 has something for everyone. Trainz Railroad Simulator 2019 (World Edition) includes 6 built-in routes* Over 40 interactive sessions 130+ drivable locos 500+ rolling stock items Over 17,000 items in total * One route is installed in the base install. The 5 additional routes (plus any previously purchased Trainz DLC items) are available, free, for in-game download. Regional Bundles Also Available Trainz Railroad Simulator 2019 - North American Edition Trainz Railroad Simulator 2019 - UK Edition Trainz Railroad Simulator 2019 - European Edition GAME FEATURES Drive over 130 different locos Choose simple or realistic control modes Issue Driver Commands to your AI Drivers to run dozens of trains Edit the existing routes or create your own masterpiece Download more free content from the Trainz Download Station It also features: updated graphics smoother performance better stability new tools support for your existing Trainz content WHAT'S NEW IN TRS19? MORE REALISM A massive engine upgrade delivers more realistic graphics: Physically-Based Rendering allows accurately simulated lighting for photorealistic graphics, all in real-time. Parallax Mapping provides extreme detail made possible by textured heightmaps. Detail Maps enhance visuals with macro or micro surface detail. Environment Lighting gives greater control for direct, indirect and High Dynamic Range lighting. NEW WORLD BUILDING TOOLS NVIDIA Turf Effects empowers route builders to simulate realistic ground cover on a vast scale. Lay down Animated Ground Cover that waves in the wind. Customisable Ground Clutter fills your route with micro-detailed objects. Enhanced Bulk-Replace tool to quickly update your existing routes to new standards. IMPROVED DRIVING CONTROLS Easier access and better visualisation while you're driving: Track Navigation Profile displays key information for improved driving accuracy. Train Control Mode toggle to change instantly between Simple, Realistic and AI Command modes. Driver Control Center to control and manage dozens of AI Drivers. Command Properties editable in real-time to update your Driver AI Commands on the fly. VIEW MORE CONTENT My Collection allows you to view all your installed locos and rolling stock quickly and easily. Search Routes, Sessions and Rolling Stock in the new menu UI. Filter by Content Type, Source, Region and more. Tag your 'Favorites' for easy display and selection. Search and download from the Trainz Download Station directly in-game. EDIT MORE CONTENT In TRS19, you can edit and update all the built-in and 'DLC' routes and sessions. Customise the terrain and ground textures. Add or bulk replace track and trackside objects. Increase or decrease the density of scenery assets. Share your edits with other content owners via the Trainz Download Station. AND MUCH MORE Picklists - add selected items to your selected picklist. Raildriver Support - TANE and TRS19 both support Raildriver controllers. Seasonal Support for procedural track. In-game help systems. FBX mesh support providing support for more 3D art tools, and PBR materials. INCLUDES 6 QUALITY ROUTES Each route utilises all the latest TRS19 content and features and is fully editable by you! The initial download includes the updated Kickstarter County 2, 10 Tutorials and a Content Sample map. The additional 5 built-in routes included in your purchase are downloaded at your maximum Internet connection speed using the in-game Asset Download menu. Choose to download all, or as many as you like. With almost 500,000 items to choose from, additional free content can be downloaded from the Trainz Download Station. (Note: For DLS content, a First Class Ticket purchase will increase your DLS download speeds and remove the 100MB daily limit). KICKSTARTER COUNTY 2 Completely overhauled and updated to TRS19 Standards. In recognition of all our Kickstarter supporters we've made some major updates to KSC by completely overhauling and updating the route to TRS19 Standards. Includes 4 brand new interactive sessions, new industries and an expanded world. CANADIAN ROCKIES - GOLDEN, BC Majestic prototypical Rocky Mountains route by RoysTrainz. This enormous 2000 km sq prototypical Rocky Mountains route has been extensively reworked to take full advantage of the new TRS19 features. Includes 4 brand new interactive sessions plus stunning new high resolution trains and passenger cars. SEBINO LAKE, ITALY Brand new masterpiece from Jango This stunning creation is a must-see for every Trainz fan. With an incredible eye for detail and the majestic Italian scenery as a backdrop, this prototypical rural Italian route is a true masterpiece. Includes 6 brand new interactive sessions and the stunning new Orient Express train. NIDDERTALBAHN - TRS19 Completely overhauled and updated to TRS19 Standards. An idyllic, single-track branch line in Wetterau and Main-Kinzig-Kreis in the western German state of Hesse. New Track and Scenery plus 4 new sessions with new detail rolling stock. CORNISH MAINLINE &amp; BRANCHES - TRS19 Completely overhauled and updated to TRS19 Standards This impressive route runs between Truro and Penzance in Cornwall. It includes Branch-lines to Falmouth, Helston, Hayle Wharves and St Ives. New Track, Ground Textures, Assets and 8 new never-seen-before sessions. EDINBURGH - DUNDEE Completely overhauled and updated to TRS19 Standards. Set in 1976, this well-known ECML route includes the Forth and Tay rail bridges, Rosyth Navy Dock and stunning scenery along the Firth of Forth estuary. Keep an eye out some good gradients and also some severe speed restrictions while learning the road. PLUS NEW LOCOS, ROLLING STOCK AND MORE! TRS19 is not just about the built-in routes. We've also included a huge range of new locos, rolling stock and scenery, with over 15,000 items in total. Plus we’re working on a new range of brand new high quality TRS19 DLC content. Note that the initial install includes one route and the 5 additional routes are shown in-game to download free of charge. We also offer Regional Edition bundles at a lower price point which include two of these additional packages. Note for Mac Users: TurfFX is a feature that provides animated ground covers and currently works only on PC systems in DirectX mode. Your version will therefore operate the same as the PC version with 'TurfFX disabled'.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/553520/header.jpg?t=1640841908",
    "Price": 39.99,
    "Developers": "N3V Games",
    "Publishers": "N3V Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_71c477939325dfbc24b94dfb7ae8448aa53e98df.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_6c69f74c6f9beeec553b57b9bd70e92408ccb007.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_456214b0b48d0d6b64aeb053fd345ad7dc9f77d9.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_097a02b9b01a21394cc98db0415516f6feacd37f.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_0d8fd319d3a07edc1d75101ff6d275dc97fa3e0e.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_cf0feac892806d35f9976f0996fe06ffca8e59ca.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_d564b9b715d609bc31cd6520adb8d845d01f103d.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_38995c4417cc9b8ca97b9794453027131efd447d.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_42b7db1f91337b25cede9082d753aef7c76c4005.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_e38286072874c0901ccea1383acc4bf986e4f06b.1920x1080.jpg?t=1640841908,https://cdn.akamai.steamstatic.com/steam/apps/553520/ss_3d36680e45f90894c9afe1c794dad8db309cc8eb.1920x1080.jpg?t=1640841908",
    "Slug": "trainz-railroad-simulator-2019",
    "Meta Title": "Trainz Railroad Simulator 2019: Jan 7, 2019, N3V Games an...",
    "Meta Description": "Looking for information on Trainz Railroad Simulator 2019? Check out the release date (Jan 7, 2019), developer insights from N3V Games, and a complete g...",
    "Alt Text Image": "Official header image for Trainz Railroad Simulator 2019 game - Steam 553520",
    "Canonical URL": "https://gusku.site/game/trainz-railroad-simulator-2019",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trainz Railroad Simulator 2019\", \"description\": \"Looking for information on Trainz Railroad Simulator 2019? Check out the release date (Jan 7, 2019), developer insights from N3V Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 7, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"N3V Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/553520/header.jpg?t=1640841908\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}