{
    "AppID": 1681510,
    "Name": "Trenches - World War 1 Horror Survival Game",
    "Release date": "Jul 19, 2021",
    "About the game": "WARNING: This game may be disturbing to some audience as this game contains real disturbing images, sounds, fear nature, jump scares and intense horror that may not be for the Faint of heart. Play this game at your own risk. Welcome to the Trenches, 1917. A World War 1 first person horror survival game where you, caught behind enemy lines - have to survive and escape the harsh war-torn environment and experience World War l like never before from the eyes of James R. in this surreal nightmare, as you fight for your life and for your sanity. Explore the real chilling story as you navigate the horrors equipped with only your senses, hearing and trench whistle. Find clues to better understand and escape the enemy trenches without being caught to return to your family. Please note: Trenches is a survival horror game being worked on by one developer, the premise of the game is that you have to collect clues and try to escape the Trenches. It is currently in Early Access and I will try my best to update the game frequently to give you the best enjoyable experience. Please do submit your feedbacks and suggestions as it really helps out with the development! Try to escape by collecting vital clues and find out what is going on. Trenches is a psychological horror game - where your only escape is through your senses and hearing using your trench whistle to guide you, however that also comes at a price since the enemy can hear your trench whistle. Enemies will also be able to hear if you walk on wood as it will make creaking noise or if you break any bottles. Try to escape the trenches with caution as every corner that you will turn can be your last. The game relies on sounds and hearing, as you are equipped with a 'Trench Whistle' which you can use. When it's used, it will play a sound and you need to follow the sound, however - you have to be careful as the enemy can hear the whistle too and it can give out your position easily. A HARDCORE objective-finding type first-person psychological horror survival game experience about finding and collecting clues with the goal to escape the Trenches, with gut-wrecking moments and different clue locations with repeatability option. Features: An Immersive Experience with realistic graphics and a claustrophobic environment set in the Trenches of World War I in 1917. Hardcore Gameplay: A hardcore survival horror game where there is only 1 save. If you die, you die. That is why every step if crucial. Replay-ability: Randomized locations for clues, so play-through will be different on each take with different takes on each corner. Hearing And Senses: Relay on your hearing to escape the Trenches. Be careful though, the enemies can mimic the sounds familiar to you. Hiding System: Hide from the enemies in narrow trench passageways and under beds to get past your enemies or hide from them. Insanity: Just because you passed somewhere already, does not mean that there is nothing there. The environment may change with your sanity. Gut Wrecking Moments: Walking on wood can make more noises, same as throwing bottles; all these things can give away your position. Try to evade them or use them as your advantages. Trench Whistle: Use your trench whistle if you are lost. When used, a sound will play if you are near a clue, however the enemies may hear your Trench whistle and it may give out your position - so use wisely. Enemy That Listens: The enemies can hear your footsteps, your breathing and your fear. It can mimic sounds of others and will stop at nothing to get to you. Plan Accordingly: Plan your next move as it may be your last. Peak around corners, watch your foosteps and be always on the move. An environment that changes along with your sanity. Inventory system and a picture of your family, to remind you to come back home. Interact with items and objects which can be helpful and provide you tips. Gut-wrecking moments with an enemy that mimics your loved ones voices. Creepy environment with narrow trenches set in World War 1. - With threats lurking around each corner you turn. Trench Whistle to tell you where you need to go next, but enemy can also hear it. A creepy tale that tells the story of a soldier in the horrors of war. Throw bottles and objects to distract the enemies and evade them. Hide in narrow trench passageways to stay hidden from the enemy. Find items to help you feel safer or guide you in Trenches. Play as the wayfaring soldier in the Trenches, try to keep sane. Enemies can now hear you breath from your mic, If they are near. Hold your breath if enemy is around, otherwise he won't go away. How To Survive: 1. Crouch and stay low, so enemies won't hear you. 2. Hide under bunk beds or narrow spaces and stay safe. 3. Don't run or you will make noise. Run only when necessary. 4. Be careful when walking on wooden surface since it makes loud noise. 5. You can cause a distraction by throwing objects items such as bottles. 6. Mind your stamina, if you get tired then you cannot outrun your enemies. 7. Use your trench whistle if you're lost and follow the sound, but be careful because enemies can hear the whistle too and come running to your location. 8. Be careful of your surroundings. Some things are real, while others are not. 9. If you hear running foosteps, that's not good news - as they may have heard you. Run or hide! 'Trenches' is a horror game made by one developer at Steelkrill Studio. Please note this game is an objective-collection game with replay-ability. Your objective is to find and collect clues in the Trenches while having items such as the Trench Whistle to guide you while you are being hunted by the enemy. If you can, please submit your feedback and report any bugs and this will really help speed up the progress of the development by a bunch .. Thank you for trying it out.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1681510/header.jpg?t=1638214445",
    "Price": 9.99,
    "Developers": "Steelkrill Studio",
    "Publishers": "Steelkrill Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_2b1a5806bf649edce7373d16e0e366d91b05e96a.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_74a72774b2dc9431d67c0a5416002d8d2a5d7970.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_6015cbac1d3d1d952bff08044a558ed1bb910341.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_89f86e57654fbaece13d12ca3891692fee269faa.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_b2d785bdc017a861c3b6e39b862f4081064a7a96.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_ce7e219b585b8bb048964ea24d034983a3148d41.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_c32a3f204eacd20c785e1e8fdf658e515a90200e.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_ed5035494d071b3b7f543779e653c487f36c8cb0.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_ca061121f3843ac090408b3a2819171f28d0ad3e.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_43b4fef1eaa7c644814288ca65671ffa1861a909.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_ff7bc68a1e984707a7923c87e4475992aa435873.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_b295a1062e24be32c7dbf731523f71634f61aab2.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_b2f56c04bb8fafcb4ae12ec8679b7a4735b4b88f.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_aec0c02d407c56678c8e83b0f84d5e2787e5b353.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_be5e4ec5e174616f30e178e7567132dff6b74dc9.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_b61e5699c8b75fd24e92d51ad7e0e0bf4eea05e5.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_6ac0f8f6c06b4e23e036ff581a576cb493e42201.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_c9b5aecbaf2ff3861eff462a62b76f6eccbbf749.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_fb81b776145390a2610ce3eb109860a54cdea215.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_fc837d4675e22506b28ca7b0d76a234acff427d6.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_af0e5ad086f26541804e1bc56e563f6beac9f49e.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_21f4e3f30c7df1a90735e545d13737ce7a3bc4f0.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_bab90ff483808e960f4ab01f6dd41a9710fd50b0.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_75c525444746466c38050dcbdfd98907f334f98e.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_eed1aba779268821324dfca9e2fb5b7e57b85606.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_d566d1250cddc87dbe89a4ceb1f2346b61cdac55.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_db95cd340485774f36b08b9dcfd365f1e2dba0d8.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_cc51b72f868f7807868e035287a238e3bd04bcdf.1920x1080.jpg?t=1638214445,https://cdn.akamai.steamstatic.com/steam/apps/1681510/ss_c392d96e896de39e0cf20539c5983e85074df5f8.1920x1080.jpg?t=1638214445",
    "Slug": "trenches-world-war-1-horror-survival-game",
    "Meta Title": "Trenches - World War 1 Horror Survival Game: Jul 19, 2021...",
    "Meta Description": "Looking for information on Trenches - World War 1 Horror Survival Game? Check out the release date (Jul 19, 2021), developer insights from Steelkrill St...",
    "Alt Text Image": "Official header image for Trenches - World War 1 Horror Survival Game game - Steam 1681510",
    "Canonical URL": "https://gusku.site/game/trenches-world-war-1-horror-survival-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Trenches - World War 1 Horror Survival Game\", \"description\": \"Looking for information on Trenches - World War 1 Horror Survival Game? Check out the release date (Jul 19, 2021), developer insights from Steelkrill St...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 19, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Steelkrill Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Steelkrill Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1681510/header.jpg?t=1638214445\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}