{
    "AppID": 1097760,
    "Name": "Uh Oh Bartender",
    "Release date": "Jul 25, 2019",
    "About the game": "A Word From The Devs We are a relatively small team that decided to take up the challenge to make a game in a month. This is the product of our challenge, and while we are both confident and content with how it turned out, we just want to make everyone aware that this game was created in only one month. It does not have a ton of content, but it does offer a unique arcade puzzle game experience with a solid amount of replayability and provides great laughs with friends. Please feel free to contact us if you have any feedback, questions, or problems, and be on the lookout for our future games! The Drinks At Cypher's, every drink is a puzzle! In Uh Oh Bartender, you will be serving drinks to patrons as any bartender would, but unlike other bars, the ingredients of the drinks you serve will be dictated by a procedurally generated name, as will the cups they are served in, and any garnishes they are served with. All of these factors are based on 'rules' that may or may not be present within a given drink name. Rules present in any given name may include; looking for certain letter sequences found within the drink name, adding up the numbers in the year at the end of the drink name, or even paying attention to the font of the drink name itself! Be careful though, because you don't have all day to decipher what ingredients are included, as each order will be on a timer. As you continue to serve correct orders, your score will increase, but so will the complexity of the order! Don't worry about memorizing every single rule out of the gate, as you'll have a handy cheat sheet that you can pull up to reference every rule that the game has to offer. This cheat sheet can also be downloaded as a PDF to play with friends! (Check under the manual button to the right) ID Checking The drink names aren't the only thing you'll have to keep a close eye on, as you'll need to check the ID of each customer that is looking to take an order. You'll have to be able to reject patrons with fake or invalid IDs and ensure you don't turn away those with valid ones. Your customers are more than just their orders! Your customers will display various personalities through quips at all stages of the game, to include turning away their fake IDs, complementing your skills, or dishing out ridicule over botched orders. Additionally, the bouncer will have some words for you if you let in a patron with a fake ID.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1097760/header.jpg?t=1585347708",
    "Price": 1.99,
    "Developers": "Whoah! Games",
    "Publishers": "Whoah! Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_8a237a733fd3454a41c3e391fcd4cb96cd7ff048.1920x1080.jpg?t=1585347708,https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_cb498792444ebe2d069e246b2d8c1fc497a18e68.1920x1080.jpg?t=1585347708,https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_0572aedd48455c0a69a65355831e60435e6ca04c.1920x1080.jpg?t=1585347708,https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_1ea03f91cddb0cdd13ae0ba2dced65471b7eaf73.1920x1080.jpg?t=1585347708,https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_85665a760dc1df26b36a3f77ac4a81542c1b09fd.1920x1080.jpg?t=1585347708,https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_ec713f6ade0c5035d1a3174e2dd172e330c9240f.1920x1080.jpg?t=1585347708,https://cdn.akamai.steamstatic.com/steam/apps/1097760/ss_d69e790d5e817225fa6f0e359869c145e6c9b3db.1920x1080.jpg?t=1585347708",
    "Slug": "uh-oh-bartender",
    "Meta Title": "Uh Oh Bartender: Jul 25, 2019, Whoah! Games and Full Over...",
    "Meta Description": "Looking for information on Uh Oh Bartender? Check out the release date (Jul 25, 2019), developer insights from Whoah! Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Uh Oh Bartender game - Steam 1097760",
    "Canonical URL": "https://gusku.site/game/uh-oh-bartender",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Uh Oh Bartender\", \"description\": \"Looking for information on Uh Oh Bartender? Check out the release date (Jul 25, 2019), developer insights from Whoah! Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 25, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Whoah! Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Whoah! Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1097760/header.jpg?t=1585347708\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}