{
    "AppID": 1342620,
    "Name": "Werewolf: The Apocalypse — Heart of the Forest",
    "Release date": "Oct 13, 2020",
    "About the game": "Rage Gets Things Done Werewolf: The Apocalypse — Heart of the Forest throws you deep into a primeval wilderness in the center of modern Europe. It’s where the protectors of nature wage their ancient, neverending war against the forces of destruction. You play as Maia, who comes to Poland hoping to trace her family roots. Trying to learn more about her ancestry, she will discover her family’s dark secrets and reveal hidden truths about the last wilderness of Central Europe. Visit real-world places of mystery and power. Explore local legends and traditions. Discover the fascinating world and history of the Polish-Belarusian borderlands. You will witness how nature clashes with technology and greed. Can it survive without our help? Discover the Legendary RPG System For the first time ever, you will be able to experience Werewolf: The Apocalypse on your computer. Werewolf: The Apocalypse — Heart of the Forest adapts the mechanics of the legendary title from the World of Darkness universe, emulating the experience of a classic role-playing session. An immersive narrative that can measure up to the best mystery novels. Beautiful, distinctive collage art that combines hand-illustrated characters with pictures of real places to inspire your imagination. By making tough choices that often bring dramatic consequences, you will affect your character attributes: Rage, Willpower, and Health. This impacts your ability to perform certain actions as well as change the range of available choices and the presentation of the world. The game will analyze your behavior and determine what kind of werewolf you are. Werewolf: The Apocalypse - Heart of the Forest is a beautifully written, deep, and balanced experience. It’s tailored for World of Darkness veterans and newcomers looking for an accessible entry into this rich, acclaimed universe. They teach you to fear rather than to be angry, but fear solves nothing. Anger is there for a reason, to shield and protect you. Anger is the part of you that cares. Rage gets things done.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1342620/header.jpg?t=1643194341",
    "Price": 5.99,
    "Developers": "Different Tales",
    "Publishers": "Walkabout,Different Tales",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1342620/ss_6492d015dbeee07c873fd45178057207625d23de.1920x1080.jpg?t=1643194341,https://cdn.akamai.steamstatic.com/steam/apps/1342620/ss_e70023b98ea6a25cb8b2949f2daba724d3abb184.1920x1080.jpg?t=1643194341,https://cdn.akamai.steamstatic.com/steam/apps/1342620/ss_f26ed52e9cad91c4ca6bd7f38a4f9ab0332a8622.1920x1080.jpg?t=1643194341,https://cdn.akamai.steamstatic.com/steam/apps/1342620/ss_aae440053dbe1ff439fb65e64171edf49216e523.1920x1080.jpg?t=1643194341,https://cdn.akamai.steamstatic.com/steam/apps/1342620/ss_42db38d3ec442cd01a6a337d1643e5b1ba1d6463.1920x1080.jpg?t=1643194341,https://cdn.akamai.steamstatic.com/steam/apps/1342620/ss_d0f91e9437093822b6b5dfe37feccc39b763c6d0.1920x1080.jpg?t=1643194341",
    "Slug": "werewolf-the-apocalypse-heart-of-the-forest",
    "Meta Title": "Werewolf: The Apocalypse — Heart of the Forest: Oct 13, 2...",
    "Meta Description": "Looking for information on Werewolf: The Apocalypse — Heart of the Forest? Check out the release date (Oct 13, 2020), developer insights from Different ...",
    "Alt Text Image": "Official header image for Werewolf: The Apocalypse — Heart of the Forest game - Steam 1342620",
    "Canonical URL": "https://gusku.site/game/werewolf-the-apocalypse-heart-of-the-forest",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Werewolf: The Apocalypse \\u2014 Heart of the Forest\", \"description\": \"Looking for information on Werewolf: The Apocalypse \\u2014 Heart of the Forest? Check out the release date (Oct 13, 2020), developer insights from Different ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Different Tales\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Walkabout,Different Tales\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1342620/header.jpg?t=1643194341\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}