{
    "AppID": 712100,
    "Name": "A Total War Saga: THRONES OF BRITANNIA",
    "Release date": "May 2, 2018",
    "About the game": "A Total War™ Saga: Thrones of Britannia The year is 878 AD, the embattled English king Alfred the Great has mounted a heroic defence at the battle of Edington, and blunted the Viking invasion. Chastened – but not yet broken – the Norse warlords have settled across Britain. For the first time in nearly 80 years, the land is in a fragile state of peace. Throughout this sceptred isle, the kings of England, Scotland, Ireland and Wales sense a time of change approaching; a time of opportunity. There will be treaties. There will be war. There will be turns of fortune that become the stuff of legend, in a saga that charts the ascent of one of history’s greatest nations. Kings will rise. One will rule. Thrones of Britannia is a standalone Total War game which will challenge you to re-write a critical moment in history, one that will come to define the future of modern Britain. With ten playable factions, you must build and defend a kingdom to the glory of Anglo-Saxons, Gaelic clans, Welsh tribes or Viking settlers. Forge alliances, manage burgeoning settlements, raise armies and embark on campaigns of conquest across the most detailed Total War map to date. Choose your strategy The Grand Campaign offers multiple routes to a glorious Victory; aggressively expand your territory through force of arms, acquire renown through construction, advanced technology and influence, or complete a series of unique objectives based on your chosen faction’s history. Once completed, steady yourself for a significant late-game challenge and the final, Ultimate victory condition. Explore and conquer the British Isles From the snowy highlands of Scotland to the orchards and meadows of Kent, push back the fog-of-war and unveil the extent of Anglo-Saxon Britain. Varied towns, cities and rural settings inspire a host of different battlefield environments. Experiment with the strategic opportunities afforded by newly capturable minor settlements. Throttle your enemies’ trade routes and coax them out of strong, defensible positions. Viking warlord or Anglo-Saxon king, define their legend Each faction will face a series of unique events and branching dilemmas, often based on authentic historical events and issues of the time. Embark on Viking expeditions, manage the Anglo-Saxon peasant economy, each faction feels and plays differently. Carve out unique roles for your King and Nobles, customise their impact by making meaningful choices about their development and determine how their story will unfold. ‘Classic’ Total War gameplay refined Includes many updates to core Total War mechanics - such as provinces, politics, technologies, recruitment, dilemmas and much more - designed to make your experience more immersive and more meaningful. Playable factions, cultures and kings: Thrones of Britannia will include ten playable factions, from five cultures, with a summary below. The Anglo Saxons – West Seaxe and Mierce When Roman rule in England concluded, new kingdoms of Germanic stock coalesced in the counties now known as Northumbria, Mercia, Wessex, Essex, Sussex, East Anglia and Kent. The peoples of these regions came collectively to be known as the Anglo Saxons. West Seaxe Faction Leader: King Alfred As the dominant Anglo-Saxon kingdom of southern England, the forces of West Seaxe – or Wessex in modern English – provided the isle’s primary resistance against the incursions of the Great Heathen Army. From the capital city of Winchester, Wessex conquered lands in Surrey, Sussex, Kent, Essex and even Mercia. Alfred’s dogged defense of the Danish invasion laid the foundations for Wessex to unite England under one ruler for the first time in 927 AD. Mierce Faction Leader: Ceowulf From its capital city of Tamworth, the kings of Mierce – known now as Merica - ruled the area now known as the Midlands. At its height, Mierce stretched from Northumbria in the north of England to Kent, Sussex and Wessex to the south. In 877 AD, the Great Heathen Army seized the eastern part of the kingdom to form the Danelaw, or East Engle. The Gaels – Mide and Circenn Gaelic culture initially developed in Ireland, their society built around a system of clans and chieftains. They raided and traded with Roman settlements, and by 878 AD had expanded from Ireland to inhabit much of Scotland. With the influx of the Vikings, some raiders settled in Gaelic lands, becoming the Norse-Gaels. The Scottish Gaels would absorb the Picts to become the Kingdom of Alba – essentially setting the blueprint for modern Scotland. Mide Faction Leader: King Flann Sinna Mide lies at the heart of Ireland. Not just geographically, but politically, intellectually and spiritually. Many High Kings have risen from Mide, and its current ruler, Flann Sinna, aspires to that title. With many fellow Irish factions nearby, Mide is in a position to potentially bring the disparate clans together, and usher in an era of Irish prosperity. However, threats are never far away… the Vikings of Dyflin have settled to the east, and their power and influence are growing. Will Mide strive to keep the uneasy peace? Unite the clans in a war against these Norse settlers? Or find some other route to supremacy? Circenn Faction Leader: Áed mac Cináeda Circenn was in origin Pictish, but became more heavily influenced by the Gaels and other peoples over time as they were driven away from the relentless Viking raids. 878 AD marked the end of the Viking invasions, but Circenn’s troubles were far from over. While she had a firm hold over the eastern coast of Scotland, many threats still exist – both within and without. Scoan, the capital of Circenn, was once home to the legendary Stone of Destiny, said to bestow divine strength on her people. Where the stone now resides is a mystery, but if clues can be found, surely the Stone’s recovery would be an adventure worth undertaking… The Welsh – Gwined and Strat Clut The Welsh Kingdoms descended from the Celtic Britons who occupied much of the island of Britain from the Iron Age, into and beyond its Romanisation in the First Century. Ironically, the term ‘Welsh’ derives from the Anglo-Saxon term for foreigner, ‘wealas’, which they applied to the native Britons. The Anglo-Saxons flourished and many of the old Brittonic kingdoms began to disappear. Gwined Faction Leader: King Anaraut The people of Gwined have some claim to the title of 'true Britons', having been driven to the far west by invaders who now call themselves ‘English’. Renowned both for their bardic arts and their skill with the longbow, the Welsh of Gwined thrived under the leadership of Rhodri Mawr. Rhodri kept Gwined largely free of Vikings and other invaders while expanding its borders. Now he is gone and his lands are divided. Strat Clut Faction Leader: Run Strat Clut is a kingdom of the Old North that can be traced back to the Fifth Century and the Celtic Britons. The realm was formerly based at the fortress of Alt Clut but driven out by a Viking invasion in 870. The current King Artgal was taken captive and reportedly killed in mysterious circumstances. The kingdom reformed further into the valley of the River Clyde under the leadership of his only son Run. The Great Viking Army – Northymbre and East Engle In 865 AD, Ragnar’s sons led the Great Viking Army and made landfall in East Anglia. Over the next 15 years the Vikings ranged high and low, from Wessex to The Clyde, conquering towns, claiming victories and suffering their share of defeats until the Battle of Edington in 878 AD, where its leader Guthrum met his match in the young King Alfred and his West Saxon army. Bested in the field, his forces retreated in disarray to a nearby fortress. Flush with success, Alfred’s men gave chase and laid siege. After a fortnight of starvation, the invaders surrendered. Under the terms of his capitulation, Guthrum was baptised into Christianity and he and his men were allowed to return to East Anglia and settle – provided they kept Alfred’s peace, of course. Defeated, but never humbled, the Vikings seethe with an all-consuming rage. One does not cage the wolf without consequence… Northymbre Faction Leader: Guthfrid When the Vikings arrived in Northumbria in 867 AD, they took the city of York – or Eoferwic, as was – for their stronghold. And what a bastion it was, with its formidable Roman walls still standing strong 700 years on. King Aelle of Northumbria attempted to wrest the city back from the Danes, but was captured during the attack. In retribution for Aelle’s execution of their father, the sons of Ragnar made an example of him with the horrifying Blood Eagle ritual. Northumbria remained under Viking control and, after the battle of Edington and the subsequent treaty of Wedmore, a portion of the Great Viking Army marched back to Northumbria, to settle under Alfred’s peace. East Engle Faction Leader: Guthrum Forming the bulk of Britannia’s south-easterly coast, East Engle was the staging-point of the Great Viking Army’s invasion, and the region where many of its warriors settled after the Battle of Edington. Under the rule of the Danish leader Guthrum (or Æthelstan, to use his adoptive name by Alfred) it would ultimately come to be known as the Danelaw. Yet still, some fight remains in the Danes of East Engle. One does not shed the mantle of glory and become a landsman overnight. The Viking Sea Kings – Dyflin and Sudreyar After nearly a century of escalating raids, the Vikings left an indelible stamp on Britannia, altering the course of its history forever. Not least of all culturally, as many smaller bands of Vikings had settled around the isles prior to Alfred’s defeat of the Great Viking army. These smaller factions traded an existence of ceaseless conflict for a new life in Britannia, establishing their own petty principalities, intermarrying and ultimately becoming part of the warp-and-woof of Britannic life. This mingling of cultures, so emblematic of British history, helped create the rich melting-pot of attitudes, beliefs and language that has made the isles and their people so unique. Some Vikings never truly settled however; their designs were grander, their hunger for conquest and greatness unquenched. These Sea Kings would continue their bellicose work, heedless of any decree from England’s upstart ruler… Dyflin Faction Leader: Bardr Dyflin was a major port town on the east coast of Ireland, and the site of Britannia’s largest slave market. It was a major site of Viking occupation, and was ruled until 873 by the Viking lord Imar, often associated with Ivar the Boneless, a son of the legendary Viking warlord Ragnar Lothbrok. Viking raiders had wintered there as early as 840 AD, so their association with the region had been a long one, and over time their customs began to take on a more Gaelic flavour as the slow process of integration took its course. By 878 AD however, Imar’s son Bardr was firmly established on the throne. Would this ambitious Viking ruler seek to seal a lasting peace with the surrounding Gaelic factions? Or return to the ways of Ragnar, and pursue a path of bloodshed and domination? It is hard to ignore the calling of one’s warrior-blood… Sudreyar Faction Leader: Eirik To the west of Alba lies Sudreyar, the Kingdom of the Southern Isles. Comprising the southern Hebrides, these scattered islands were sparsely populated and, bearing the full brunt of the Atlantic weather, were not lands suited to the less-hardy. Like much of Britannia, these islands saw increasing Viking contact from the 8th Century. Prior to this period they formed part of the Gaelic kingdom of Dalriada, until they fell under Viking control. Over the next century, Scandinavian occupancy took on a distinctly Gaelic flavour (and vice-versa), particularly after 872 AD when Harald Fairhair became king of Norway, and his former opponents flocked to the area. Materially poor, but offering an excellent base for those of a nautical bent, the isles of Sudreyar are a perfect staging-post for raiders and explorers.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/712100/header.jpg?t=1624275118",
    "Price": 39.99,
    "Developers": "CREATIVE ASSEMBLY,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Publishers": "SEGA,Feral Interactive (Mac),Feral Interactive (Linux)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_397fbbf0cf317b46b2d028452e33cb01e61f7a50.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_d361fe4dfe617bc95e42d4ff8029d900055d5f73.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_864d01e27d429c890a84a3582d08d9fa102b7691.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_3dab7ce4531dc2e4dd66aa7aa1281a0a03902152.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_e5a02c3ee2231f99a08a6567bb9dbd406e29e69b.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_49a1bcd8fc390541906d4c8f69a002c7b8011747.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_d7eca11ed9a76264a373c5d06e867ebc61af5794.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_5f38c784584979307a86b9fb9026fa67d5253219.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_8aa36b5be8caec9d74a128fc8245fbd2b0d259db.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_14d7f55f4ec304d03c334d60dbf4803fa784a599.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_d6e6bd0ab87b9b913157f19f377843964993631c.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_97648b570dd8e7061e32b2e623cfed4c5c20fce9.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_279a091504b55976bbfb77add8076c128e062b1e.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_74a82e8f28444754d48d85f9e7a3e2bb1dacbe92.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_99c351f77abd4332c55f385082d04a1a7e4f6e6e.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_41ae681c794fa99ee2fbc30a554d722f87745262.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_e81ad3be7c669060eaf9f33c254b46d54a3b4f64.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_28163e24a5a1c7012ea5e8e0bae1d9cd32296c2d.1920x1080.jpg?t=1624275118,https://cdn.akamai.steamstatic.com/steam/apps/712100/ss_f0907cb009cc1aab041b6a258661cdb871ca53aa.1920x1080.jpg?t=1624275118",
    "Slug": "a-total-war-saga-thrones-of-britannia",
    "Meta Title": "A Total War Saga: THRONES OF BRITANNIA: May 2, 2018, CREA...",
    "Meta Description": "Looking for information on A Total War Saga: THRONES OF BRITANNIA? Check out the release date (May 2, 2018), developer insights from CREATIVE ASSEMBLY,F...",
    "Alt Text Image": "Official header image for A Total War Saga: THRONES OF BRITANNIA game - Steam 712100",
    "Canonical URL": "https://gusku.site/game/a-total-war-saga-thrones-of-britannia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"A Total War Saga: THRONES OF BRITANNIA\", \"description\": \"Looking for information on A Total War Saga: THRONES OF BRITANNIA? Check out the release date (May 2, 2018), developer insights from CREATIVE ASSEMBLY,F...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 2, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"CREATIVE ASSEMBLY,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA,Feral Interactive (Mac),Feral Interactive (Linux)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/712100/header.jpg?t=1624275118\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}