{
    "AppID": 1074620,
    "Name": "Adore",
    "Release date": "Feb 18, 2020",
    "About the game": "Adore is an Action Creature Collecting game where the main character, Lukha, is able to summon and control creatures to fight by his side in a simple and innovative way . In Adore, you can customize your game style according to the creatures you capture. Each of them has very different characteristics and abilities. On top of that, there are the Synergy System, Traits and Special Abilities, which allows for even more varied playstyles and powerful combos. SYNERGY SYSTEM Your creatures work best together. You can create synergies between them. Each synergy that a creature has, will activate an extra ability or modify your creature. TRAITS Go on expeditions after statues of Draknar, the god of creatures, so that your creatures receive traits that make them unique . SPECIAL ABILITIES Each creature also has a special ability that can be used when its energy bar is full. You have to decide when is the best moment to use the special ability more effectively. The path to becoming a good adorer is long. A true adorer knows each of his creatures and finds the best way to get the most out of each one. RUNES &amp; ARTIFACTS Equip and upgrade special Runes and Artifacts that best compliment the qualities of your creature team. COOKING Gather ingredients during your adventures and create unique dishes to help you and your creatures in the journey. TRUE ADORER Put all your knowledge to the test. It's crucial to know when to summon each creature, have good positioning, when to recall them back, what artifact or rune to use, how to prepare you and your creatures for expeditions, training your creatures. All of this is just the surface of a true adorer. Draknar, the God of creatures is dead and a curse is spreading, taking control of all his creatures that inhabit Gaterdrik. But the last spark of it's the flame felt upon Lukha, an apprentice of the adorers and Draknar's last hope. Lukha, during his journey to revive Draknar, discovers not only many secrets of the immense and mysterious world of Gaterdrik, but also, the conspiracy that killed Draknar.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1074620/header.jpg?t=1653484580",
    "Price": 14.99,
    "Developers": "Cadabra Games",
    "Publishers": "Cadabra Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1074620/ss_4532326706dc68a63bd9b99e741fa4fb922368d4.1920x1080.jpg?t=1653484580,https://cdn.akamai.steamstatic.com/steam/apps/1074620/ss_285ba021b88f619cd3f453813b9f5daa21c7eca2.1920x1080.jpg?t=1653484580,https://cdn.akamai.steamstatic.com/steam/apps/1074620/ss_adf0005e7ffb9e602edbad0475154994ac6d5710.1920x1080.jpg?t=1653484580,https://cdn.akamai.steamstatic.com/steam/apps/1074620/ss_1b0e43a31c4929c3624ec26250a742fef1de6129.1920x1080.jpg?t=1653484580,https://cdn.akamai.steamstatic.com/steam/apps/1074620/ss_279b98c587e56a44930fbee5f0d7b6fa00d237a1.1920x1080.jpg?t=1653484580,https://cdn.akamai.steamstatic.com/steam/apps/1074620/ss_a6b61e36324796a557c32e78c4d99d92c7c20cff.1920x1080.jpg?t=1653484580",
    "Slug": "adore",
    "Meta Title": "Adore: Feb 18, 2020, Cadabra Games and Full Overview",
    "Meta Description": "Looking for information on Adore? Check out the release date (Feb 18, 2020), developer insights from Cadabra Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Adore game - Steam 1074620",
    "Canonical URL": "https://gusku.site/game/adore",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Adore\", \"description\": \"Looking for information on Adore? Check out the release date (Feb 18, 2020), developer insights from Cadabra Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cadabra Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cadabra Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1074620/header.jpg?t=1653484580\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}