{
    "AppID": 296300,
    "Name": "Ballistic Overkill",
    "Release date": "Mar 28, 2017",
    "About the game": "Steam Silver Tier: 'Top games that left Early Access in 2017 as measured by gross revenue' Ballistic Overkill is a bombastic, brutal, and bullet-filled multiplayer shooter. It blends classic arena shooter action with modern FPS gunplay giving you a fast paced class based shooter that'll leave your opponents bloody on the battlefield. With a progression system that means your wins actually matter and a huge map pool with 6 varied game modes, there's something for every shooter. Whether you prefer chasing team objectives or the thrill of classic deathmatch, Ballistic Overkill has the gun and the mode for you. Pick a class, choose your gun, and dive right in, Ballistic Overkill has no barrier between you and immediate run and gun action. Designed from the outset to be 'pick up and play', Ballistic Overkill is for you regardless of your level of FPS experience. Classes Select one of 7 classes, each with their own style, weapons, and visuals. You get to play Ballistic Overkill the way YOU want to play it. Select from multiple loadouts with each class to tailor each character exactly the way you want to play. And remember there are no support classes, in Ballistic Overkill everyone is a killer! Berserker - deadly close combat rushdown expert Vanguard - master of field survival and assault specialist Wraith - infiltrator and ranged assassin Shadow - master of speed and stealth assassinations Grenadier - bane of the campers and explosions maniac Tank - towering machine-gun toting survival expert Marksman - perceptive and adaptable intelligence specialist Maps and game modes From parks, to malls, to abandoned hospitals and factories, Ballistic Overkill covers a wide variety of locations in its 10 maps. Each is filled with death, either your opponent's or if you're not ready…yours. All maps feature multiple game modes to liven things up including: Team Deathmatch Free for All Capture Point King of the Hill Rounds Juggernaut Daily Missions You will receive a new mission every day and can have up to a maximum of three active at any given time. You will need to ensure to complete your missions in a timely fashion as when you have three active missions, the oldest one will be replaced when a new mission arrives. Whenever you complete these missions you will receive a reward of either 2, 3 or 4 scrap(s), that you can redeem for crates. In addition to daily missions, you will also receive special missions, the first of which will be appearing in the next few days. These Special Missions will reward you with a Mission Crate. Steam Marketplace and Unlockables With over 80 weapons in game, there's always a new way to kill your enemies in Ballistic Overkill , and with droppable skins that you can trade and/or sell through the Steam Market you can now do this with style and flair. The game features Class based lockboxes and drop Seasons that will change every few months so players can seek out the best skins and unlockables across 5 different rarity types. These unlockables will be dropped in keyless lockboxes so nothing will prevent you from opening them and grabbing the amazing content inside. It's insane, fast paced, and action packed in a way that's fun, and tactical.' Spifferino, Steam User Can be enjoyed by both casual and competitive gamers.' Skyrunes, Steam User I've really enjoyed playing this game through different versions to watch it evolve and once it's finished it's going to be a really fantastic game.' Liamdawe, Gaming on Linux",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/296300/header.jpg?t=1575494956",
    "Price": 1.99,
    "Developers": "Aquiris Game Studio",
    "Publishers": "Aquiris Game Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_e7be35d4add908150b3f4a1b797c66dc97232000.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_3c17e9d4ab163144c3a28bda5e8a3c2a7e6cf113.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_79d76fccd32972d5752553a60bc355b18098fc18.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_e19a0d9220451feda21e1250374c7359741676d8.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_958343dbbf7a71e3b46ecbc8d26c4d0650d1e196.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_0ac52f4956e40afc5379060cf4c7878602737b8f.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_5772178d78ffe1ced3a1846b44f5cb34d78d06af.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_a81cef36ca52680857b3e4d72eee96da2692e824.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_ede7da0caf8f850d4a45eb35b6d2af36b475614d.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_3b92a9d1c6911ad665e06756ecc9fd440a6446cd.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_9746191826b59fbe1ff684349cfbb8f438cc6622.1920x1080.jpg?t=1575494956,https://cdn.akamai.steamstatic.com/steam/apps/296300/ss_343c237e5935a5e300a5561a4ffb72dc414cf125.1920x1080.jpg?t=1575494956",
    "Slug": "ballistic-overkill",
    "Meta Title": "Ballistic Overkill: Mar 28, 2017, Aquiris Game Studio and...",
    "Meta Description": "Looking for information on Ballistic Overkill? Check out the release date (Mar 28, 2017), developer insights from Aquiris Game Studio, and a complete ga...",
    "Alt Text Image": "Official header image for Ballistic Overkill game - Steam 296300",
    "Canonical URL": "https://gusku.site/game/ballistic-overkill",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ballistic Overkill\", \"description\": \"Looking for information on Ballistic Overkill? Check out the release date (Mar 28, 2017), developer insights from Aquiris Game Studio, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 28, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Aquiris Game Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Aquiris Game Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/296300/header.jpg?t=1575494956\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}