{
    "AppID": 1416730,
    "Name": "Ball at Work: The Ultimate Speedrun Platformer!",
    "Release date": "Nov 24, 2020",
    "About the game": "Experience the thrill of the high-flying antics of the Crazy Ball as it bounces around the dysfunctional office. Smash through piles of books, bring down the shelves, swing over the lights and sneak through the vents to uncover the path to goal! 'Bounce around and create havoc in the office!' The simple controls make the game easy to pick up and play allowing the user to explore the environment and discover new tricks and strategies. As you navigate the obstacle course littered with water hazards and falling objects, look out for clever hints that are shown on the computer screens and on wall projections. If you still find yourself struggling in any level, just use some bonus slips and unlock a vide-guide for the level. 'Swing over lamps and sneak through the vents to uncover the path to goal' Through meticulous development and extensive testing, the physics of the game have been carefully calibrated to present a precise and engaging gameplay experience that gets more challenging and intriguing with each new level. With plenty of traps, tricks and puzzles in each level, Ball at Work has an unmistakable charm about it that will keep you coming back for more! 'Explore new tricks and techniques in a the fully interactive environment' Your run in each level is timed and scores are submitted to a global, cross-platform leaderboard to add to the competitive nature of the game-- return to one of your favourite levels and discover new ways to leap farther and jump higher to beat your best time and climb up the rankings! With unique and challenging gameplay that is easy to grasp, outrageous physics and plenty of fun content, this is one wacky office that you’d never want to leave! 'Unlock beautiful new skins, master the game and reach the top of the Leaderboard!' Do not forget to check out the Ball at Work: Boss Edition DLC to get unrestricted access to all the levels in the game and exciting and fresh new content that is added into the game throughout the year. The DLC also gives you exclusive access to the LiveWire Series where you participate in special events each month and winners of each LiveWire event win Steam Gift Cards! Features Full support for game controllers and keyboard with customisable controls Balanced gameplay progression and fun physics 44 exciting and challenging levels with 18 levels available as Free-to-Play Dedicated leaderboards for all levels Carefully selected soundtrack to set the mood Compete in the LiveWire Series and win Steam Gift Cards (DLC only) Exclusive special content is added to the game on Halloween, Christmas and much more! (DLC only)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1416730/header.jpg?t=1611066797",
    "Price": 0.0,
    "Developers": "Famous Dogg Studios",
    "Publishers": "Famous Dogg Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1416730/ss_8c34a74b47bb1ec0e345f777fe1094b70f2d556e.1920x1080.jpg?t=1611066797,https://cdn.akamai.steamstatic.com/steam/apps/1416730/ss_280a6e34a34357d64588f3fc86d002480abedaaf.1920x1080.jpg?t=1611066797,https://cdn.akamai.steamstatic.com/steam/apps/1416730/ss_c3e498564cedaa14d111099ec61245753127f7bc.1920x1080.jpg?t=1611066797,https://cdn.akamai.steamstatic.com/steam/apps/1416730/ss_36fb0a1ba732261076ddb5e8ecfbc3bda47389fd.1920x1080.jpg?t=1611066797,https://cdn.akamai.steamstatic.com/steam/apps/1416730/ss_2764464ee25d2a643531af772a0677f07d30e711.1920x1080.jpg?t=1611066797,https://cdn.akamai.steamstatic.com/steam/apps/1416730/ss_5010676bde21142c7cb2d6c4aa7cd27ea6058f32.1920x1080.jpg?t=1611066797",
    "Slug": "ball-at-work-the-ultimate-speedrun-platformer",
    "Meta Title": "Ball at Work: The Ultimate Speedrun Platformer!: Nov 24, ...",
    "Meta Description": "Looking for information on Ball at Work: The Ultimate Speedrun Platformer!? Check out the release date (Nov 24, 2020), developer insights from Famous Do...",
    "Alt Text Image": "Official header image for Ball at Work: The Ultimate Speedrun Platformer! game - Steam 1416730",
    "Canonical URL": "https://gusku.site/game/ball-at-work-the-ultimate-speedrun-platformer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ball at Work: The Ultimate Speedrun Platformer!\", \"description\": \"Looking for information on Ball at Work: The Ultimate Speedrun Platformer!? Check out the release date (Nov 24, 2020), developer insights from Famous Do...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Famous Dogg Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Famous Dogg Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1416730/header.jpg?t=1611066797\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}