{
    "AppID": 346120,
    "Name": "Boring Man - Online Tactical Stickman Combat",
    "Release date": "Feb 20, 2015",
    "About the game": "Boring Man - Online Tactical Stickman Combat is the greatest 2D stickfigure shooter you've never heard of. Enlist into the petty armed conflict of Somewhere Land, where a civilization of agile stickfigures fight for their lives with high powered weapons against an evil, world destroying sorcerer, only known as The Man. Too many weapons! Boring Man offers over 70 weapons to choose from.. assault your enemies on a skateboard with a minigun, strap your shotgun to a flying drone and blast somebody's head remotely, or take advantage of the dynamic dual-wielding system where you can combine various weapons to hold in each hand.                                                                        Easy to learn, difficult to master Combined with a horde of weapons, B-Man's in-depth platforming takes your competitive 2D shooter experience to another level. Walljumping, double jumping, rolling.. and a silky smooth collision system so you never miss a beat. Did I mention there's ladder tech? There is lots and lots of ladder tech. Over 8,000 weapon skins Quantity over quality baby!!! Earn XP to unlock weapon skins.. can you collect them ALL? Brag and show off your super rare finds to other poor saps, or recycle your trash skins for a chance to get a better one. No trading or sketchy Steam economy crapola here! I absolutely do think that's a selling point! Create your own weapon skins easily with the weapon skin creator, or import custom artwork using the easy to use sprite modding system. Upload your weapon skins to the Workshop to be judged by yours truly, and I might add it to the game officially. (with you credited of course) 7 game modes, tons of custom game settings Get in touch with your competitive side with the ever-so grueling Team Deathmatch, defend yourself from The Man's forces with your friends in Survival co-op, or fight against the undead horde lest you end up joining it in Zombrains. Create your perfect Boring Man madhouse with tons of wacky mutators and settings, such as the Corrupted Weapons mutator, which haphazardly randomizes every weapon into game breaking nonsense. Portforwarding? That boomer network engineer bullcrap?! Not anymore! Host a server from your home network with little to no effort at all with P2P networking.                                                                                                                                                                                                         Built-in map editor + Workshop support Make your own maps with the map editor! You can import custom images, take advantage of the advanced logic gate system to make in-depth maps, and even share your maps or download maps made by others with Workshop support! Cool DLC to buy that pays for the developer's rent Want even more? Get Boring Man Premium and have extra customization features for your stickfigure soldier, such as hats and colored bullets. Special animated DLC weapon skins are also available. B-Man is NOT pay-to-win, and its developed and maintained by one guy, so no publisher is involved.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/346120/header.jpg?t=1646081850",
    "Price": 0.0,
    "Developers": "Spasman Games",
    "Publishers": "Spasman Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/346120/ss_af2d4761d0e936171fd91690eed2ac0ecda89ddf.1920x1080.jpg?t=1646081850,https://cdn.akamai.steamstatic.com/steam/apps/346120/ss_957eb5449dbb0e62bacb7df95b9d59c9be88a8ae.1920x1080.jpg?t=1646081850,https://cdn.akamai.steamstatic.com/steam/apps/346120/ss_a3829be047f5fa82dedb98d4f12df9218449f6d4.1920x1080.jpg?t=1646081850,https://cdn.akamai.steamstatic.com/steam/apps/346120/ss_db5ce6c260db9143220b4a32743db097b82fe764.1920x1080.jpg?t=1646081850,https://cdn.akamai.steamstatic.com/steam/apps/346120/ss_2266514aa92b68f794c4711a388435d48106caea.1920x1080.jpg?t=1646081850",
    "Slug": "boring-man-online-tactical-stickman-combat",
    "Meta Title": "Boring Man - Online Tactical Stickman Combat: Feb 20, 201...",
    "Meta Description": "Looking for information on Boring Man - Online Tactical Stickman Combat? Check out the release date (Feb 20, 2015), developer insights from Spasman Game...",
    "Alt Text Image": "Official header image for Boring Man - Online Tactical Stickman Combat game - Steam 346120",
    "Canonical URL": "https://gusku.site/game/boring-man-online-tactical-stickman-combat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Boring Man - Online Tactical Stickman Combat\", \"description\": \"Looking for information on Boring Man - Online Tactical Stickman Combat? Check out the release date (Feb 20, 2015), developer insights from Spasman Game...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 20, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spasman Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spasman Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/346120/header.jpg?t=1646081850\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}