{
    "AppID": 1920710,
    "Name": "Codemakers!",
    "Release date": "Mar 13, 2022",
    "About the game": "Codemakers! is a FPS roguelike about trying to rebuild the universe with fragments of code. as you slash, shoot, and strategize through machines and being of pure corruption, you must find out the reason in it all, and what happened here in the first place. at the end, will you save them at all? will you ready when the real threat emerges? each run is ended by encountering a Big Boss, these are the only enemy type in the simulator who are really alive. they also change how you play, turning the game into things like, a beat game, a top down survival, a turn based melee fight, and much more! after the battle is over, you get a choice. either save them, and bring them home, or sacrifice their soul for multitudes more fragments of code. who knows, maybe saving them will hurt, or it could prevent your demise.. they may also give you excursion quests, which may unlock some things you wouldn't get otherwise Wanna take a break from the standard game? try out some excursion events, some of which take you to a location to protect, some take you somewhere to eliminate, and some take you to recover data, all a fun style of gameplay to change up the loop. there will also be quest excursions, semi self contained side quests that take you inside your current universe to protect or rebuild, or to discover something new... As you play, you will have access to a wide variety of weapons to slash, blast, and evaporate your enemies. The guns you get in the run have a variety of fire types and an upgradable amount of modifiers, things that can change the raw code of the gun, making a sniper do 2x damage and shoot rockets, or making a single shot grenade launcher shoot a laser shot that reloads almost automatically. it adds a lot of variety to the gameplay. while your at it, you will also have access to melee weapons for your off hand, after all, who needs 2 hands for a plasma axe or 2 hands for a rail gun? not you! you can use your [V] to activate your melee, be it a smashing, slashing, throwing, or expanding type! you also have access to passive chips that you add to your own code, these range from giving you a 20% faster fire rate, to making you do 4x damage base on everything. you also have one active item slot. these are more mischievous to you, they can hurt, they can help. they can also just make a reference to a band that hasn't made an album in years, you don't know! you may even be lucky enough to drop an explosible truck or slow time, its a very large variety. we hope that with this massive variety in deadly choices, you can have your own fun! or just break the game and max out a minigun that crashes the game, up to you! some more features include an expanding-with-the-story overworld, new areas, new shops, new people, and new quests will show up as you unlock things, and discover the mysterious, aptly named Mysterium Corp. who helps, for now... there is also an upcoming room designer, witch you can use to submit levels for our review, and who knows, they might become official! there will also be overworld side quests, that might not take you to custom areas, like the upcoming keeper of the shells quests, which will have you do different things with shotguns to unlock new ones, and it all ends with the shotgun to kill gods.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1920710/header.jpg?t=1647220308",
    "Price": 19.99,
    "Developers": "Seven Five Studios,Dane Myran",
    "Publishers": "Seven Five Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_de1bfc4758732d9a47bd20b676b335c98d5603da.1920x1080.jpg?t=1647220308,https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_cebbc1249111a1fbc52da0a85cf10601bac4ddc9.1920x1080.jpg?t=1647220308,https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_2b55607cc9c2a88896d4eff77a395d94134ed51a.1920x1080.jpg?t=1647220308,https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_70e704dffaa33a47f793b694dc5ee37bab89c044.1920x1080.jpg?t=1647220308,https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_aa80a78ff76917201e92f875ec194fc5e4a09fda.1920x1080.jpg?t=1647220308,https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_e1a4720073a81f8fb0f85cc31ef40df6682049e9.1920x1080.jpg?t=1647220308,https://cdn.akamai.steamstatic.com/steam/apps/1920710/ss_7aaaacdfbe1e9958b6533a87db3e498286f5a397.1920x1080.jpg?t=1647220308",
    "Slug": "codemakers",
    "Meta Title": "Codemakers!: Mar 13, 2022, Seven Five Studios,Dane Myran ...",
    "Meta Description": "Looking for information on Codemakers!? Check out the release date (Mar 13, 2022), developer insights from Seven Five Studios,Dane Myran, and a complete...",
    "Alt Text Image": "Official header image for Codemakers! game - Steam 1920710",
    "Canonical URL": "https://gusku.site/game/codemakers",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Codemakers!\", \"description\": \"Looking for information on Codemakers!? Check out the release date (Mar 13, 2022), developer insights from Seven Five Studios,Dane Myran, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Seven Five Studios,Dane Myran\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Seven Five Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1920710/header.jpg?t=1647220308\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}