{
    "AppID": 659780,
    "Name": "Darkness and a Crowd",
    "Release date": "Dec 26, 2019",
    "About the game": "Puzzles: Using many mechanics from beloved physics platformers, and taking advantage of brand new ones. Learn and shift the world to your will. Unlock new abilities to further your conquest on reclaiming your land in this classic RPG experience that’ll leave you begging for more. Brand new, accurate and reliable weighing systems, which take into account the magnitude of each collision and the weight added to each object to open brand new areas, ready for your exploration Green lighting systems which add new challenges to this seemingly basic game. Solve them to shut off machines blocking your path, or move platforms to your will. Quests: Make new friends on epic adventures. Help out those who survived through the explosion, even fight off against enormous giants to further your conquest. Side Quests add a whole new element of excitement and danger into this brand new experience. Progression: Unlock new abilities by defeating creatures. Level up to gain rewards whether that be by destroying families of squirrels, or defending a town from being overrun by darkened entities. Unlock abilities between the 3 elements Earth, Fire and Air, which help you maneuver around easily, or solve puzzles in a new way. Defeat creatures with aggressive abilities, or heal yourself over time with passive abilities. The world is yours to shape. Do you have what it takes to reclaim your home? Can you defeat the Darkness before it’s too late? Will you overcome the obstacles that lay ahead? In this never before seen adventure game, you’ll find yourself begging for more. Chaos grasped the seemingly pleasant planet of Harrand. What was once peaceful, and quite, became a breeding ground to all that was evil in this world. An explosion from a distant mountain, almost visible to all, changed everything. At first they thought it was a volcanic eruption. But eruptions like those, never caused the wildlife of the land to turn evil. While others took refuge, some suffered an unfortunate fate. No one was the same after that day. Family's were torn apart and villages were burnt to the ground. Legend broke loose of a chosen one. A creature immune to the essence who was said to have the capability, to save the world. Now you must fight off against the darkness, being the only immunity left. With only the help of your tiny friend, embark on an epic journey to save the planet you once called home. Whether you're taking down giants, or fighting off against effected wildlife, you must make it to the top of the mountain, and restore peace to these lands. What you're up against You'll be fighting creatures you've never seen before, whether its a sliding Slime, or a jumping Spickle. Upgrade your character, equip him with the best abilities, and edit his stats to make yourself unbeatable against the hordes of creatures you'll be up against. Solve puzzles and complete missions left and right while you reconquer this extensive land in front of you. Find abilities you'd never discovered before, gain an upper hand against your enemies, and meet new friends along the way! This world is your's for the taking in this amazing RPG experience you'll be left asking for more!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/659780/header.jpg?t=1656313893",
    "Price": 4.99,
    "Developers": "Sylvia Sharpe",
    "Publishers": "Sylvia Sharpe",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_4957d780ae6d85062c0842b021d8defb028bcc74.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_45e6f08c8c1b46c68aa2abd6ab5c1c646afc6279.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_735b7358903240a78ba513707254a339dc71bf9a.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_5f711593fc6677065d67e597d4336736b87fa343.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_67cec7b543058ebfcc5bac1042dfcc4b37941b89.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_6161092e903af4d2e028817424da258033b8950f.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_0f4d00ebb7c1be3debbc99e80f90e8da57fbe64e.1920x1080.jpg?t=1656313893,https://cdn.akamai.steamstatic.com/steam/apps/659780/ss_560e95adb28c2a93c9aa6118cb63e9dc6592cefc.1920x1080.jpg?t=1656313893",
    "Slug": "darkness-and-a-crowd",
    "Meta Title": "Darkness and a Crowd: Dec 26, 2019, Sylvia Sharpe and Ful...",
    "Meta Description": "Looking for information on Darkness and a Crowd? Check out the release date (Dec 26, 2019), developer insights from Sylvia Sharpe, and a complete game s...",
    "Alt Text Image": "Official header image for Darkness and a Crowd game - Steam 659780",
    "Canonical URL": "https://gusku.site/game/darkness-and-a-crowd",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Darkness and a Crowd\", \"description\": \"Looking for information on Darkness and a Crowd? Check out the release date (Dec 26, 2019), developer insights from Sylvia Sharpe, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 26, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sylvia Sharpe\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sylvia Sharpe\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/659780/header.jpg?t=1656313893\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}