{
    "AppID": 750170,
    "Name": "Diesel Railcar Simulator",
    "Release date": "Mar 5, 2018",
    "About the game": "What is it? Diesel Railcar Simulator is a train driving simulator modelling the passenger diesel multiple units, or 'railcars', and other trains of the 1960s British railways. How does it play? The goal is to drive a train from A to B with safety, comfort and timekeeping in mind. You can choose from hundreds of Inter-City, semifast, stopping, freight, rescue and empty coaching stock train services. The gameplay is mostly sandbox: there's no need to earn points or money to unlock any of the runs. Where's the replay value? Your driving style and timekeeping are evaluated upon completing a run. Try the same run again to reach a higher score by braking more accurately or driving more economically. You'll still need to prepare for suprises as traffic conditions and delays may change from run to run. Is it realistic? Physics are simulated in detail: individual components of the transmission are replicated to ensure realistic behaviour. The suspension of each vehicle is also modelled to make it bounce and sway over uneven trackwork Sounds are mostly authentic: many of the most important sounds used for the railcars are recordings of the real trains Computer-driven AI trains occasionally make human-like mistakes Graphics are good enough not to distract, but will still be improved in the future Is it easy to learn? Yes, the game has optional integrated tutorials that show helpful data on the screen while you're driving, such as the current target speed or which key to press. There's also an alternative simplified control mode where the train is operated with up/down keys only, while the actual throttle, shifter and brake levers are computer-controlled. How do I control the train? You can use a keyboard or drag the cab controls with a mouse. The game also supports a wide variety of other controllers like gamepads, joysticks and the RailDriver controller (RailDriver LED and speaker unsupported). Can I just relax and watch the trains run? Yes, you can choose to spectate and watch the computer drive the train from any viewpoint. You can also change trains at any time. What routes are included? There are three fictitious routes with different characteristics, totalling over 150 miles: 4- and 2-track main lines, short urban and suburban lines, mountainous rural single track lines. There are more routes in the Workshop, including ones based on the real world. What trains are included? Four British Railways diesel railcar classes with manual gearboxes: 112, 117, 122 and 126 Class 127 railcar with torque converters (no need to change gears) Locomotives: Classes 03, 37 and 40 Mineral wagon, guard's van Mk1 coaches and Siphon G parcels van More trains and liveries available for download in the Workshop Can I make my own routes and trains? Yes, in-game editors are included for creating new routes, timetables and trains. All existing routes and trains can also be edited. Please see the guides in the community section for more detailed information. Anything else worth mentioning? The game is still in development and missing some features. For instance, passengers only stand still on the platform The first trailer video shows outdated graphics. Please see the screenshots for up-to-date examples of the visual quality",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/750170/header.jpg?t=1637819093",
    "Price": 17.99,
    "Developers": "Lapioware",
    "Publishers": "Lapioware",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_0b598dd53e4b9ae005c7c8b8a34a57de3f5307c9.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_6a22da2878786c6afe2f95683ae616c3534a25fb.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_1074f5399f2e343652bbe17651d49fe8d3000b5f.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_e9c344815c6cd5e1d8116c03a9a0f8d8ea3f7cf9.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_75f5579f74a5a326110c267f0f30758668d2b3d3.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_e82ab04de2c2d235d485758c3c41c33151e9f4b9.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_299ae415f191467b698d9a7a0c1e4da2bd167321.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_b60dd9650e2daa1b9a8fa7e0219c48861891b1e0.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_a3ccd969533038ded192b6adb031bb1e04804794.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_ade6de25e78508118b2c39af4db89de6ba5d2553.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_870ed5b26b0b0c113c45c3bd9905c5f9a2b7e6a6.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_116f0dc27cbef0f38bfc6c48fc70dc121ff637f5.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_2caf8dbdb13b8a8397c8269b7dc5c01e3e608e73.1920x1080.jpg?t=1637819093,https://cdn.akamai.steamstatic.com/steam/apps/750170/ss_db86870808fefb125bbed1ed69486b115e6baa50.1920x1080.jpg?t=1637819093",
    "Slug": "diesel-railcar-simulator",
    "Meta Title": "Diesel Railcar Simulator: Mar 5, 2018, Lapioware and Full...",
    "Meta Description": "Looking for information on Diesel Railcar Simulator? Check out the release date (Mar 5, 2018), developer insights from Lapioware, and a complete game su...",
    "Alt Text Image": "Official header image for Diesel Railcar Simulator game - Steam 750170",
    "Canonical URL": "https://gusku.site/game/diesel-railcar-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Diesel Railcar Simulator\", \"description\": \"Looking for information on Diesel Railcar Simulator? Check out the release date (Mar 5, 2018), developer insights from Lapioware, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 5, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lapioware\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lapioware\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/750170/header.jpg?t=1637819093\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}