{
    "AppID": 1928450,
    "Name": "dweeMIXED: Thwee Pack",
    "Release date": "Mar 31, 2022",
    "About the game": "Upon entering this dimension many years ago, magicdweedoo has proven to be relentless in his development and delivery of otherworldly multimedia experiences. dweeMIXED: Thwee Pack, a collection of remastered underground indie gaming staples, provides an essential guide to this labyrinthine mind. ◄ Ticket ► In a world where time is running out, where angels, are now demons, and vice versa, and human emotion is no longer a valid format, there is one entity ready to put his FOOT down, and say NO. Play as a lonely timid left foot, determined to make his mark on a world that's ever so crumbling around him. Make your way through exhilirated, magnificent and enchanting landscapes. Move with shoe, live with shoe, breathe with shoe. Be. Shoe. ◄ New Ice York ► The mystery of the award-winning New Ice York will test your detective skills like never before. Someone has frozen the city, and it's up to you to explore, interrogate, and fist-fight your way to the answer. ◄ Mealmates ► The sequel to critically acclaimed Mealmate Classic. An award-winning multiplayer party game where you compete to create the most delicious edible being. Get your friends together or play by yourself. It's a minigame mayhem! Whoever produces the most delicious Mealmate will win eternal glory. Dress up your Mealmate in the latest fashions, cook gastronomical delights, explore the mysterious town and more. ◄ Sound Test ► Blast the full soundtrack of each game featured in the Thwee Pack. Shift the pitch to hear the tracks like never before! ◄ Updated and New Content ► Elevate your consciousness with TV-worthy cinematic full HD and the buttery smooth gameplay of 60fps for all featured games! Each game has also been forcefully injected with extra content. Only the most hardcore of gamers will be able to find all the hidden secrets, requiring exceptional skills in all three games to unlock. 'features and content a customer can expect to be included with their purchase' - 3 indie gaming classics by magicdweedoo - platformer game where you control a shoe and have to defeat the very devil himself - rpg detective game where you have to find out who froze the entire city - local multiplayer party game with many minigames and a town you can explore - sound test all 3 soundtracks with pitch shift feature - hidden secrets for the hardcore gamer - lots o' of fun",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1928450/header.jpg?t=1655853828",
    "Price": 19.99,
    "Developers": "magicdweedoo",
    "Publishers": "magicdweedoo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1928450/ss_2de46518cb8b7ec37629a8b1ea029333d2273bc6.1920x1080.jpg?t=1655853828,https://cdn.akamai.steamstatic.com/steam/apps/1928450/ss_5756ace746eecc0b8e8b99770f398519bc9da548.1920x1080.jpg?t=1655853828,https://cdn.akamai.steamstatic.com/steam/apps/1928450/ss_241dae5828419756d92145ec4ad07dadf58043d4.1920x1080.jpg?t=1655853828,https://cdn.akamai.steamstatic.com/steam/apps/1928450/ss_2b27fa3110c2b4a42c5fdce32b0a7cc307acf188.1920x1080.jpg?t=1655853828,https://cdn.akamai.steamstatic.com/steam/apps/1928450/ss_8bd956a05713ce53239b9ff543ecfb25cd19d108.1920x1080.jpg?t=1655853828,https://cdn.akamai.steamstatic.com/steam/apps/1928450/ss_72b4034d256ec6963e848653409020f793053669.1920x1080.jpg?t=1655853828",
    "Slug": "dweemixed-thwee-pack",
    "Meta Title": "dweeMIXED: Thwee Pack: Mar 31, 2022, magicdweedoo and Ful...",
    "Meta Description": "Looking for information on dweeMIXED: Thwee Pack? Check out the release date (Mar 31, 2022), developer insights from magicdweedoo, and a complete game s...",
    "Alt Text Image": "Official header image for dweeMIXED: Thwee Pack game - Steam 1928450",
    "Canonical URL": "https://gusku.site/game/dweemixed-thwee-pack",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"dweeMIXED: Thwee Pack\", \"description\": \"Looking for information on dweeMIXED: Thwee Pack? Check out the release date (Mar 31, 2022), developer insights from magicdweedoo, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 31, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"magicdweedoo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"magicdweedoo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1928450/header.jpg?t=1655853828\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}