{
    "AppID": 725040,
    "Name": "Ebony Spire: Heresy",
    "Release date": "Nov 2, 2017",
    "About the game": "The game price is set to exorbitant levels for Russia at this point. STOP THE WAR ON UKRAINE. Support Ukraine - spread the Ukraine's president video with all your Russian friends: -597LlXjig&amp;t=1s Ребят, я ненавижу коррупцию в России, но не всех граждан Ebony Spire: Heresy is a love letter to dungeon crawlers of old with a twist: It's been signed with the blood of many roguelike games that have been experienced by the writer. Crawl, throw, summon and smash your way through 20 levels of pure mishap in this first person turn based dungeon crawling game. Experience a back-to-the-basics computer role playing game where items play a central role. Pick up, throw, use, equip and drink your way up the tower to slay the fervent goddess.  Anniversary update - more streamlined, more fun New enemies, mouse support and quality of life improvements! All your feedback through the past year has been taken under consideration and implemented!  Choose the way you want to enjoy the game! Try out the Classic Mode which allows you to explore the game via hand-crafted levels and carefully placed encounters or test your skill and luck in the Infinite mode which features procedurally generated levels! KEY FEATURES All items can be used by and against the player. Enemies have access to the same abilities as you do Character development revolves around the items that can be obtained. There are no classic stats or XP grinding Turn-based combat in a very roguelike fashion Portals that will lead you outside the tower for a quick item hunting session: Cities, Harbors, Dungeons and Arenas can be explored Two game modes: Classic and Infinite Heresy - toggle between them with a simple visit to the options menu! WHY YOU MIGHT NOT LIKE THIS GAME Ebony Spire: Heresy is a niche game that blends roguelike mechanics with old-school first person dungeon crawlers. The game is designed as a coffee-break game (short play sessions) and may be a deal-breaker for some players while others might enjoy the quick level-to-level progression while they are queueing in an online game. MAKE THE GAME YOUR OWN The source code for the game is available under the MIT license . Feel free to use it to create your own adventure. And since the code is easily accessible you can mod it, add items, enemies and levels to your hearts content. The game arrives with TileD integration and you can use the supplied spritesheet to create your own levels and puzzles and share them with the community. Or use the integration and your own assets to create your own game. It's up to you what you do with the source code.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/725040/header.jpg?t=1646423758",
    "Price": 0.99,
    "Developers": "Bearded Giant Games",
    "Publishers": "Bearded Giant Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/725040/ss_977346d17feb86100f903d5fa4a71d9486fb4e51.1920x1080.jpg?t=1646423758,https://cdn.akamai.steamstatic.com/steam/apps/725040/ss_4eb5ce09269d42808e0695020c3f8f858159e82a.1920x1080.jpg?t=1646423758,https://cdn.akamai.steamstatic.com/steam/apps/725040/ss_1c64ace330c5ff32c338b3fa40202fdc94b28f78.1920x1080.jpg?t=1646423758,https://cdn.akamai.steamstatic.com/steam/apps/725040/ss_b8cb273ebdb6ec9686dbeb6714cc74d5ebabbe9b.1920x1080.jpg?t=1646423758,https://cdn.akamai.steamstatic.com/steam/apps/725040/ss_6204298ca8de2ad519df93228203ad6f780c000c.1920x1080.jpg?t=1646423758,https://cdn.akamai.steamstatic.com/steam/apps/725040/ss_cc49ba098d554739a2e267ffff5e7fd4cf61568a.1920x1080.jpg?t=1646423758",
    "Slug": "ebony-spire-heresy",
    "Meta Title": "Ebony Spire: Heresy: Nov 2, 2017, Bearded Giant Games and...",
    "Meta Description": "Looking for information on Ebony Spire: Heresy? Check out the release date (Nov 2, 2017), developer insights from Bearded Giant Games, and a complete ga...",
    "Alt Text Image": "Official header image for Ebony Spire: Heresy game - Steam 725040",
    "Canonical URL": "https://gusku.site/game/ebony-spire-heresy",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Ebony Spire: Heresy\", \"description\": \"Looking for information on Ebony Spire: Heresy? Check out the release date (Nov 2, 2017), developer insights from Bearded Giant Games, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bearded Giant Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Bearded Giant Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/725040/header.jpg?t=1646423758\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}