{
    "AppID": 786420,
    "Name": "Fantastic Sea",
    "Release date": "Feb 6, 2018",
    "About the game": "This is a SLG navigation simulation game strategy, integration strategy / simulation / business / naval and other elements, a fantasy world setting, cartoon picture style bright, let the game player driving characteristic of ships or airship flying in the sea and the sky, our goal is the sea of stars! Developer introduction This is a game made by only 2 people. Due to lack of team and financial support, we have tried our best to make the best, but there are still many shortcomings. We hope that the majority of players can understand and support! Special Note This is a slow paced game.Suitable for players like sailing games.Requires players to spend time and patience to operate and build, explore and discover more fun games. The game as a whole is relatively open, with high degree of freedom in simulation and strategy.The combat section requires some hands-on skills and should not be a problem for players familiar with the nautical game.We will also launch a tutorial for novice players in the follow-ups, so stay tuned. Remember! This is not a pure pirate shooting game! Through your strategy and operation, it is far better to build a powerful warship to experience the battle than to open a novice ship. Game Content The game offers Terran, Dwarves, Elves three races for players to choose from, each race has its own characteristics of architecture and vessels,Get in the game by collecting timber and building mines;Buy and sell products in different cities to make profits and upgrade various functional buildings;Study various formulas at school;The production of goods in a processing plant and a foundry;Shipbuilding and arsenal in the production of ship accessories, and assembled into different types of sea boats and airships, and piracy war; Game Features Terran, Dwarves, Elves three races; Combat shooting and hitting simulate real ballistic effects; 15 ports and 3 inland cities; 27 kinds of sea vessels, 27 kinds of airships; 168 kinds of ship accessories; 9 kinds of scalable buildings; 3 kinds of special buildings; 36 mercenaries; 6 mercenary positions; 22 mercenary skills; 3 major types of commission, a total of 220; 6 kinds of wood, 8 kinds of ore; 104 kinds of trading goods; 232 kinds of manufactured goods; Instructions After entering the port interface basically use the mouse to operate.After leaving the port press W acceleration, press S deceleration, press A turn left, press D turn right, 1-9 for the skill button, press V to open the attack range indicator.The other Hotkeys can be found and modified in the System Menu (press the ESC key to call out) 'Options'. Language selection In the 'Language' interface in the start menu, you can choose English or simplified Chinese. Note If the player is not used to day and night effects in the game, you can set the effect of closing the day and night in the game menu (press the ESC key to call out) 'Options'. Players can also adjust 'Brightness' in 'Game Options' to fit the monitor for better visuals; All operations in the port of the game will be automatically saved, the operation after leaving the port will be saved the next time you enter the port.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/786420/header.jpg?t=1520534301",
    "Price": 2.99,
    "Developers": "Zhu Feng,Liu Fang",
    "Publishers": "Zhu Feng",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_b4c43107dc6ad7afc4c34776c095b5cfc4f0f8a7.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_297da820615c10a7550994d5498f99268b272b2c.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_703a83efc88c8eaa1be4dfbf7b44612bef836850.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_ee6c1f8c7543515c6814d9876d4884b19157c2e3.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_70640d4fe68b0a95c9d28d164d0fee17b3ee5ca9.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_0f339ee55b8dfa7a1d4e8dfc556b58e56095fbb5.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_658ccc84ce5d2a41ae45f48d3745ce1a5238b63b.1920x1080.jpg?t=1520534301,https://cdn.akamai.steamstatic.com/steam/apps/786420/ss_87ea1dcc523476c282efab49f903163c5edf04e5.1920x1080.jpg?t=1520534301",
    "Slug": "fantastic-sea",
    "Meta Title": "Fantastic Sea: Feb 6, 2018, Zhu Feng,Liu Fang and Full Ov...",
    "Meta Description": "Looking for information on Fantastic Sea? Check out the release date (Feb 6, 2018), developer insights from Zhu Feng,Liu Fang, and a complete game summary.",
    "Alt Text Image": "Official header image for Fantastic Sea game - Steam 786420",
    "Canonical URL": "https://gusku.site/game/fantastic-sea",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fantastic Sea\", \"description\": \"Looking for information on Fantastic Sea? Check out the release date (Feb 6, 2018), developer insights from Zhu Feng,Liu Fang, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zhu Feng,Liu Fang\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zhu Feng\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/786420/header.jpg?t=1520534301\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}