{
    "AppID": 1622180,
    "Name": "Frame Game",
    "Release date": "Jul 14, 2021",
    "About the game": "Grab some of your friends, a mouse or a tablet pen and make .GIFs together! Test your own .GIF making abilities in the gif-maker or create a lobby and have up to 10 people take turns drawing frames in each other's animation ending up with an animation that everyone contributed to. Save your favorites and vote on your pick for the prestigious award of 'That one made me laugh the most!'. Create amazing masterpieces of beauty or horribly funny abominations that will make you all laugh your animation socks off! Key Features Create animated .GIFs with friends who care about you online Save your favorite animations as .GIFs and keep them under your bed for good luck Practice animating in the offline gif-maker when no-one's looking Export .GIF and .PNG sequences using the gif-maker if you're a REAL pro Hide the room code if you're streaming Shortcut keys so you can rank on speedrun leaderboards Caution: ETERNAL fun! Discord Yes We have an official community Discord server and you'd be really cool if you joined it! Hop in, share some GIFs, share some words, and be cool. If you find a bug in the game, you can report it here as well! FAQ Q: Are there any shortcut keys? A: Of course! You can find these in the 'About' section in the game. Q: I want to play with my friends, do they also need a copy? A: Yes your friends will also need to own the game to play with you. Q: I like these tunes, can I remix them? A: You sure can! All music in the game is licensed under Creative Commons. Look below for music links. Q: HELP THERE'S A BUG IN MY SOUP AND MY GAME! A: Hey hop in the Discord server and head over to the bug chat! Q: Am I working or is this a game? A: 'Yes.' Q: Is this fun? A: ...E T E R N A L fun Q: Are we still gonna hang out today or...? A: I'm really sorry dude, something just came up... maybe next week? Music? Yes, you heard correctly. The original music in this game is licensed under Creative Commons. Feel free to remix or use the music in any form of media. We want everyone to feel comfortable streaming the game or using it as they see fit. If you do remix or get some use out of these songs, we would appreciate a mention. Either way, we would love to see your creations! The game's OST is posted on CaperCube's Newgrounds page and is available for download there. Sadly we can't link to it here :( Who Did This? Stejkrobot - Animation and UI Designer CaperCube - Programmer and SFX / Music",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1622180/header.jpg?t=1627851366",
    "Price": 7.99,
    "Developers": "Spooky Boogis,Stejkrobot",
    "Publishers": "Spooky Boogis",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1622180/ss_a82082ef51f42b54ca89b579ded4673aed0ee466.1920x1080.jpg?t=1627851366,https://cdn.akamai.steamstatic.com/steam/apps/1622180/ss_d21f472891dffb68b8bab35cef1d6e5e71e56d31.1920x1080.jpg?t=1627851366,https://cdn.akamai.steamstatic.com/steam/apps/1622180/ss_71c89b2e5e818d2cd95df1f70ed38702fbca456f.1920x1080.jpg?t=1627851366,https://cdn.akamai.steamstatic.com/steam/apps/1622180/ss_8f2d10ea5bc371f07b6ed68792000351d3bafbac.1920x1080.jpg?t=1627851366,https://cdn.akamai.steamstatic.com/steam/apps/1622180/ss_e20049398bbba2ceb0f01f27d0a17c604f06e065.1920x1080.jpg?t=1627851366,https://cdn.akamai.steamstatic.com/steam/apps/1622180/ss_63ad235c741861d4cd42027e95e6f671df6aac30.1920x1080.jpg?t=1627851366",
    "Slug": "frame-game",
    "Meta Title": "Frame Game: Jul 14, 2021, Spooky Boogis,Stejkrobot and Fu...",
    "Meta Description": "Looking for information on Frame Game? Check out the release date (Jul 14, 2021), developer insights from Spooky Boogis,Stejkrobot, and a complete game ...",
    "Alt Text Image": "Official header image for Frame Game game - Steam 1622180",
    "Canonical URL": "https://gusku.site/game/frame-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frame Game\", \"description\": \"Looking for information on Frame Game? Check out the release date (Jul 14, 2021), developer insights from Spooky Boogis,Stejkrobot, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 14, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Spooky Boogis,Stejkrobot\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Spooky Boogis\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1622180/header.jpg?t=1627851366\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}