{
    "AppID": 322450,
    "Name": "FRAMED Collection",
    "Release date": "May 17, 2018",
    "About the game": "FRAMED Collection is a new compilation of the critically-acclaimed, multi-award winning noir puzzle games FRAMED and FRAMED 2. Change the order, change the outcome. Rearrange the panels of an animated comic book to craft the story of a noir-styled spy adventure. Presented in an extensive series of visual puzzles, requiring logic and imagination, each panel move changes the current narrative, leading to all kinds of comedic blunders, untimely deaths—and when solved correctly—stylish heists, fast getaways and nail-biting escapades. With multi-award winning, genre-bending puzzle design, stylish hand crafted art and animation, a satisfying difficulty curve, and an original live jazz soundtrack--fusing modern themes and funky beats--the FRAMED Collection is a unique experience no other puzzle game can match. The Complete FRAMED experience FRAMED Collection is a new compilation of the award-winning, noir puzzle games FRAMED and FRAMED 2. Escape effortlessly into the stylish, pulp-noir spy world of FRAMED, before delving deeper with the more challenging prequel FRAMED 2. Simple, but uniquely clever puzzle design Select animated comic panels and move them around using your logic skills and your imagination to craft the best outcome. Getting the story ‘wrong’ is as much part of the experience as getting it ‘right’, with every rearrangement telling a different, satisfying--and sometimes very comedic--story. Hand-crafted noir art and animation From the first frame to the last, FRAMED collection oozes with stylish, noir, award-winning art and animation. Unique, hand-drawn silhouetted characters, incredibly fluid animations, and beautiful, mysterious settings all bring the FRAMED world to life with a wink of mischievous personality. Multi-award winning, genre-bending design FRAMED Collection features a fusion of unique game mechanics and clever narrative puzzles that bend genres and constantly deliver a satisfying experience with every panel arrangement. A winner of multiple game awards, and a finalist of IGF 2015’s ‘Excellence in Design’ Award, Hideo Kojima named FRAMED his Game of the Year in 2014--“without any doubt”. An all-original live jazz soundtrack Featuring live jazz performances fused with modern themes and funky beats, the soundtracks to FRAMED and FRAMED 2 are as mesmerising as they are evocative, setting the mood and upping the mystery-laden tension.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/322450/header.jpg?t=1623434518",
    "Price": 9.99,
    "Developers": "Loveshack Entertainment",
    "Publishers": "Fellow Traveller",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/322450/ss_5d9073c15d035b8b16e4b0f07317688ac7bce6ad.1920x1080.jpg?t=1623434518,https://cdn.akamai.steamstatic.com/steam/apps/322450/ss_5c09626c9995bdba088210336a99e4e8f8957419.1920x1080.jpg?t=1623434518,https://cdn.akamai.steamstatic.com/steam/apps/322450/ss_5316d48a61ce2bd6a01ddfbb8f5eca0505eb36f3.1920x1080.jpg?t=1623434518,https://cdn.akamai.steamstatic.com/steam/apps/322450/ss_1fd0324c0c6d15ea4a6ee987947ab1b2ef5a33a3.1920x1080.jpg?t=1623434518,https://cdn.akamai.steamstatic.com/steam/apps/322450/ss_c659c76a39942a5bc7e0b9d22d031d074de84111.1920x1080.jpg?t=1623434518",
    "Slug": "framed-collection",
    "Meta Title": "FRAMED Collection: May 17, 2018, Loveshack Entertainment ...",
    "Meta Description": "Looking for information on FRAMED Collection? Check out the release date (May 17, 2018), developer insights from Loveshack Entertainment, and a complete...",
    "Alt Text Image": "Official header image for FRAMED Collection game - Steam 322450",
    "Canonical URL": "https://gusku.site/game/framed-collection",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FRAMED Collection\", \"description\": \"Looking for information on FRAMED Collection? Check out the release date (May 17, 2018), developer insights from Loveshack Entertainment, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 17, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Loveshack Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Fellow Traveller\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/322450/header.jpg?t=1623434518\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}