{
    "AppID": 608190,
    "Name": "Frontier VR",
    "Release date": "Mar 17, 2017",
    "About the game": "Frontier is a room-scale sandbox where you can enjoy a simple, colorful and immersive visit to the wild west! Play with guns and animals in three stylized environments in virtual reality. Discover a world bursting with life, from adorable bunnies hopping through the wilderness, to grizzly bears stalking you in the snow. Explore deserts brimming with colour, snowy woodlands with towering pines, and see the dawn of modern civilization in the bison inhabited great plains. You can hunt a wide range of critters, but the wilderness also holds larger animals like deer, bison and grizzly bears! The sky is also dense with hawks, snowy owls and bursts of tiny birds. Every animal on the frontier has fully interactable (and sometimes even pickup-able) rag dolls, which thanks to the amazing quality of the HTC Vive, feel incredibly real. We recommend trying out the night time lighting, as the warm glow of your camp sites lamp mixed with truly dark nights leads to some of the most immersive virtual reality we have experienced to date! Progress through the game, discovering new areas and guns as you hunt and explore, or experience the completed scenes immediately. It's your choice how you experience the world of Frontier. Pulling off impressive aim and speed will reward you with a range of guns inspired by those of the wild west. Looking for a simple set of classic revolvers ? maybe some sawn-off shotguns ? or even a sniper rifle ? Well you can shoot cute little bunnies with all of them! Frontier is room-scale, and is based around locomotion-free interactive scenes. Shooting wooden signs will take you between scenes, and you can always go to an interactive menu by shooting any 'Red Rocks' sign post. Some notable things you will find on the menu are: Input: you can choose between a very simple 1-button input (recommended for people new to VR) or a 2-button input, which makes use of the grip buttons. Random: pop into a random scenario, with some special animal encounters. Reset and Continue: when you first launch the game, you will be able to play through the games progression. If you go back to the main menu and continue, you can resume progression. If you instead shoot a destination sign, you can play that scene with all the guns unlocked! Cheats: if you really want to, you can shoot the bucket on the menu and enable some debug cheats. when using debug, press your Vive's menu button to teleport yourself around (helpful for setting a custom seated position). Have you ever experienced a massive steam train rocket past in the dead of night? Regardless of whether you are brand new to virtual reality, or a real enthusiast , there's is a lot of fun to be had in the wild west. You can even pop your grandmother straight in, as Frontier uses incredibly simple one button input (or include the grip buttons, if you prefer) and contains absolutely no locomotion that could cause discomfort. No matter what you are looking for in a VR game, Frontier will give you something to love!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/608190/header.jpg?t=1568774426",
    "Price": 4.99,
    "Developers": "Gaugepunk Games",
    "Publishers": "Gaugepunk Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/608190/ss_a6bf6ff10f1253445562b51bb747a1796088daee.1920x1080.jpg?t=1568774426,https://cdn.akamai.steamstatic.com/steam/apps/608190/ss_28f4f620809c4f72803f6e6d0a38c06940a4288a.1920x1080.jpg?t=1568774426,https://cdn.akamai.steamstatic.com/steam/apps/608190/ss_a5cf99c8b91efb9a058acd8d5bae2ea2a77d68ee.1920x1080.jpg?t=1568774426,https://cdn.akamai.steamstatic.com/steam/apps/608190/ss_5a38d0fa14386a15b7cd4a80a1554aa1da7a3cb8.1920x1080.jpg?t=1568774426,https://cdn.akamai.steamstatic.com/steam/apps/608190/ss_580869e62cd1d0298a949639b1abb8c5627f1007.1920x1080.jpg?t=1568774426",
    "Slug": "frontier-vr",
    "Meta Title": "Frontier VR: Mar 17, 2017, Gaugepunk Games and Full Overview",
    "Meta Description": "Looking for information on Frontier VR? Check out the release date (Mar 17, 2017), developer insights from Gaugepunk Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Frontier VR game - Steam 608190",
    "Canonical URL": "https://gusku.site/game/frontier-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Frontier VR\", \"description\": \"Looking for information on Frontier VR? Check out the release date (Mar 17, 2017), developer insights from Gaugepunk Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 17, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gaugepunk Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gaugepunk Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/608190/header.jpg?t=1568774426\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}