{
    "AppID": 703860,
    "Name": "GRID",
    "Release date": "Oct 10, 2019",
    "About the game": "Ready to Get Your Heart Racing? Gamescom 2019’s ‘Best Racing Game’, GRID marks the return of a storied racing franchise back to its roots. A brand-new game inspired by the original, ground-breaking Race Driver GRID in 2008. Delivering intense, unpredictable action, iconic cars and circuits, and innovative AI systems for constant competitive motorsport, GRID is a racing experience #LikeNoOther. Career: Earn your place in the GRID World Series and take on the infamous Ravenwest Motorsport in GRID’s action-packed Career mode. Race through six threads covering each car class (Touring, GT, Tuner, Stock, FA Racing, Invitational), expand your garage and prove your driving skills across the globe. Nemesis: Over 400 unique AI personalities create unpredictable racing around every corner, each race alive with overtakes, mistakes and highlight-reel moments. Aggravate an opponent too much and they’ll become your Nemesis, their personality instantly changing to make sure they reach the chequered flag before you – by any means necessary. For Everyone: Accessible yet challenging, GRID is designed to cater for all types of racers. Codemasters’ patented attention to detail on handling and car design are matched with a responsive driving model and changeable assists to allow rookie drivers a place in the paddock, and hardcore racers to create the challenge they want. #LikeNoOther: A hand-picked selection of incredible cars spanning five decades – from classic tourers, to official modern IMSA and WEC machines, to JDM superstars, to American muscle heroes. Conquer over 80 routes across the globe – from the race-ready Sepang and Indianapolis, to stunning fictional street circuits on Havana and San Francisco. Multiplayer: Jump into the action in seconds in Quick Match, where our curated selection of superb race events and competitive lobbies await you. Or, head to Private Match, and get the keys to GRID’s vast event creation options. Create multi-race championships, switch up the weather conditions, add a Qualifying session, create races up to 99 laps long, and so much more. Between any Multiplayer event, enjoy Skirmish: our no-rules figure-of-eight circuit where things get… destructive. FERNANDO ALONSO – RACE CONSULTANT FOR GRID Codemasters is delighted to welcome Formula OneTM World Champion and 24 Heures de Le Mans winner Fernando Alonso onto the team as a Race Consultant for the brand new GRID game. In GRID, you’ll also be able to race against Alonso and his official driving team, FA Racing, including a dramatic Showdown race against Alonso and various races where you’ll line up against the Spanish superstar. As a motorsport legend and a proven champion across multiple racing disciplines, Alonso is a perfect fit for GRID, which challenges you to master multiple racing categories in a wide variety of cars. As a Race Consultant, Fernando is working with all areas of the GRID team to ensure every race is as thrilling as his real-world racing experiences; from the handling setup, to gameplay, to the stories and drama that come with each event. It's fantastic to have Fernando Alonso onboard for GRID – a global icon with the same passion for racing as us.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/703860/header.jpg?t=1625582530",
    "Price": 19.99,
    "Developers": "Codemasters",
    "Publishers": "Codemasters,Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_a5f86200f36e115bf95243f891b8d1d1a808dab4.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_30d1c597c358fc51475bdc2cd7a5f488dbc879ba.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_cbee06c6cbf9340f176665f30a965cfd3d0bc2fa.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_2cef7f06b79748f8ff2c6b274ac6ad3723b6462c.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_6f67dae2d48e417061123432fd3f5a8cdc44c696.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_eb30bc13c70e93578a3d03bb6e834c1f7a573e15.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_9e34c9ea4510c17a05e71f3a28107f276c89ee5f.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_e19a6f54837c636403b2166c5e658854d970f4c2.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_7bad7cd1805fe902dcc152570ded6edbd5f84ed4.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_aad3c4fff2da8240a2680bfa90f005fab55e3f13.1920x1080.jpg?t=1625582530,https://cdn.akamai.steamstatic.com/steam/apps/703860/ss_082118d547f6f67a07e0c50f7bdf0dc649a7c7ff.1920x1080.jpg?t=1625582530",
    "Slug": "grid",
    "Meta Title": "GRID: Oct 10, 2019, Codemasters and Full Overview",
    "Meta Description": "Looking for information on GRID? Check out the release date (Oct 10, 2019), developer insights from Codemasters, and a complete game summary.",
    "Alt Text Image": "Official header image for GRID game - Steam 703860",
    "Canonical URL": "https://gusku.site/game/grid",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GRID\", \"description\": \"Looking for information on GRID? Check out the release date (Oct 10, 2019), developer insights from Codemasters, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Codemasters\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Codemasters,Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/703860/header.jpg?t=1625582530\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}