{
    "AppID": 1284410,
    "Name": "GWENT: The Witcher Card Game",
    "Release date": "May 19, 2020",
    "About the game": "Join in The Witcher universe’s favorite card game — available for free! Blending the CCG and TCG genres, GWENT sees you clash in fast-paced online PvP duels that combine bluffing, on-the-fly decision making and careful deck construction. Collect and command Geralt, Yennefer and other iconic Witcher-world heroes. Grow your collectible arsenal with spells and special abilities that dramatically turn the tide of battle. Use deception and clever tricks in your strategy to win the fight in classic, seasonal and Arena modes. Play GWENT: The Witcher Card Game for free now! FREE TO PLAY THAT’S WORTH YOUR TIME A fair and fun progression system turns the effort of building a competitive collection of cards into pure pleasure — simply collect new cards to build decks with as you play GWENT; no strings attached. STUNNING, ALL ACROSS THE BOARD Beautiful, hand-drawn art and mesmerizing visual effects breathe life into every card, battle and battlefield, making GWENT fun to play and every duel a joy to watch. SKILL BEATS LUCK Crush the enemy with brute strength or outsmart them with clever tricks — no matter your deck, GWENT’s unique round-based gameplay opens up a world of strategic possibilities to play with when fighting for victory. MORE THAN ONE WAY TO PLAY Whether it’s a quick online game against a friend, a highly competitive PvP challenge, or something new and wildly adventurous like the Arena, GWENT’s selection of game modes has got you covered. EASILY SATISFYING, ANYTHING BUT EASY Sling cards from your deck across two tactically distinct rows — melee and ranged. Gather more points in the duel against your opponent to win a round. Win two out of three rounds to win the battle. It won’t be easy, but no one said it should be. NO HOLDING BACK, NO HOLDING HANDS You start with 10 cards from your deck in hand, able to play each card right from the start. It’s up to you to open the game with your strongest unit, or save the best for later in the fight. How will your deck look and what will your strategy be?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1284410/header.jpg?t=1654773284",
    "Price": 0.0,
    "Developers": "CD PROJEKT RED",
    "Publishers": "CD PROJEKT RED",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1284410/ss_fd667c9c685235f8c018c2f518933d754838d19a.1920x1080.jpg?t=1654773284,https://cdn.akamai.steamstatic.com/steam/apps/1284410/ss_7698c5df9f72aca36dbca0f1b63eb29488f608e2.1920x1080.jpg?t=1654773284,https://cdn.akamai.steamstatic.com/steam/apps/1284410/ss_d0fd9bf653bf706856ecddb26af023932e0b74fd.1920x1080.jpg?t=1654773284,https://cdn.akamai.steamstatic.com/steam/apps/1284410/ss_2d17cc665fbab97cc96f43bead1a13ef73d3bb5b.1920x1080.jpg?t=1654773284,https://cdn.akamai.steamstatic.com/steam/apps/1284410/ss_5fc08b085e1c4e8a1be2a0b5a110a9dd47f54c6b.1920x1080.jpg?t=1654773284",
    "Slug": "gwent-the-witcher-card-game",
    "Meta Title": "GWENT: The Witcher Card Game: May 19, 2020, CD PROJEKT RE...",
    "Meta Description": "Looking for information on GWENT: The Witcher Card Game? Check out the release date (May 19, 2020), developer insights from CD PROJEKT RED, and a comple...",
    "Alt Text Image": "Official header image for GWENT: The Witcher Card Game game - Steam 1284410",
    "Canonical URL": "https://gusku.site/game/gwent-the-witcher-card-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GWENT: The Witcher Card Game\", \"description\": \"Looking for information on GWENT: The Witcher Card Game? Check out the release date (May 19, 2020), developer insights from CD PROJEKT RED, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 19, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"CD PROJEKT RED\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CD PROJEKT RED\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1284410/header.jpg?t=1654773284\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}