{
    "AppID": 705280,
    "Name": "Hakoniwa Explorer Plus",
    "Release date": "Jun 6, 2018",
    "About the game": "Overview Get ready for a voxel art action game featuring an unprecedented level of freedom! A whole range of cute girl monsters are waiting to punch, kick, wrap you up, suck your blood, and eat you right up. Progressing through the game Approach a villager from the front and make contact with them to start a conversation and acquire info on dungeons. Search the world map using the info you’ve acquired to discover dungeons and gradually increase the size of the searchable area. Cool things may happen if you can defeat the various area bosses and stack up your achievements... Characters Main Character : An unemployed drifter. You can choose your gender before embarking on your journey. Sukumizu : She’ll guide you along the way. Touch her butt and she’ll berate you for being a pervert (incurs 1 damage). Villagers : Approach them from the front and make contact to start a conversation. Be sure to avoid falling out of favor. Monsters : Mostly soft, cute, sadistic girls. Items Weapons A wide variety of weapons is at your disposal, including claws, clubs, swords, axes, and bows. Attack range and number of attacks vary according to weapon. Some also incur status ailments. Flame Sword: Sends enemies up in flames. Has similar effects on social media and blogs. Rapidfire Bow: A technical weapon used for long-ranged attacks. Can fire off three consecutive shots. Defense Various defensive implements are also available, such as shields, armor, shoes, helmets, and rings. Some of these provide extra resistance against status ailments or carry special effects. Sukumizu: While lacking in defensive ability, it grants a very smooth movement. Can be used for various purposes, including swimming, your own viewing pleasure, and more. Sacred Ring: Oh snap! You can automatically regenerate HP! Unfortunately, however, it offers no defense capability. Other Consumable items can be used to regenerate HP, increase your level, enhance weapons and defensive equipment, increase attack range, and more. Some of the more rare items become effective simply by possessing them. Blanched Crab: Crab chock full of delicious meat and juicy juices. Pervy Liquid: A slippery, naughty liquid which carefully melts away only clothing fibers. Big-ass Grenade: A special bomb featuring hardcore destructive power. After being set, it explodes after three seconds, so make sure to get the hell away immediately. Developer Comment This is Suxa (suxamethonium), creator of Hakoniwa Explorer Plus. Originally, this was never intended to be made into a game, but as I went along adding all sorts of new elements and stuff, at some point it kinda became the kind of game that lots of people could enjoy. Then I somehow got a publisher attached, and now it seems the game has actually managed to make it out to market, which is unbelievable. I appear in the game myself, so if you like, please come find me and say hi.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/705280/header.jpg?t=1599043759",
    "Price": 9.99,
    "Developers": "suxamethonium",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_7c6969adfc1330b3adf8b837a7e168841ded65a1.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_d56315a8d89a562453e5a01e7e1d0853d507df94.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_9b31c7ef173035672e0570089d4b6845d2d46b2d.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_a706067d709d53c15398f8acfcc6cdc53ea26865.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_7c23dee3224182c3e6b55e200f2d0cbf7e7844f3.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_126c0d38dcd46f6c9b644c07602bc5786143674e.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_5e5b8acdd22ce56f737d27e84af0a2b5a58f6b7f.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_3127846a35ab5d8f61fcc1b26a005c23c92d21c0.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_37588b12d6425658df810c3f41d369065036af06.1920x1080.jpg?t=1599043759,https://cdn.akamai.steamstatic.com/steam/apps/705280/ss_c8307afd9d37efcbdfb24d4edf554b4b0ce5d80e.1920x1080.jpg?t=1599043759",
    "Slug": "hakoniwa-explorer-plus",
    "Meta Title": "Hakoniwa Explorer Plus: Jun 6, 2018, suxamethonium and Fu...",
    "Meta Description": "Looking for information on Hakoniwa Explorer Plus? Check out the release date (Jun 6, 2018), developer insights from suxamethonium, and a complete game ...",
    "Alt Text Image": "Official header image for Hakoniwa Explorer Plus game - Steam 705280",
    "Canonical URL": "https://gusku.site/game/hakoniwa-explorer-plus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hakoniwa Explorer Plus\", \"description\": \"Looking for information on Hakoniwa Explorer Plus? Check out the release date (Jun 6, 2018), developer insights from suxamethonium, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"suxamethonium\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/705280/header.jpg?t=1599043759\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}