{
    "AppID": 22130,
    "Name": "Hearts of Iron 2 Complete",
    "Release date": "Jan 23, 2009",
    "About the game": "Includes Hearts of Iron II plus the two expansions, Doomsday and Armageddon When Germany is defeated in 1945, the Allies and the new Soviet alliance fight for supremacy. World War III is drawing closer. Play as the ruler of one of 175 countries through World Wars II and III. As the Allies and the Soviet Union clash in Europe, the fate of the world hangs in the balance. Detailed diplomacy and production systems with help functions to avoid micromanagement. Movement-is-attack combat system making warfare more realistic. Mission-based Air and Naval system, giving options for logistical strikes and targeted bombing. New political system with possibilities to change the political base of your country during the war. Fifteen battle scenarios optimized for an evening or two for gaming. Historical scenarios like Case White, Operation Barbarossa and alternative history scenarios like Operation Watchtower and Case Green are included in the game. Co-operative multiplayer, enabling players to share the same country while playing. Doomsday Expansion Features World War III scenario with an alternative historical outcome. Play the Soviet alliance, the United States or any country of your choice as new superpowers rise to power on the global stage. Expanded tech trees with considerable detail in a new decade of warfare, allowing you to develop tactical nukes and other kinds of nuclear warfare as well as helicopter squads, Escort carriers and much more. Improved Diplomatic/Intelligence System reflects the increased political tension of the 1950s. Armageddon Expansion Features New attachments for Naval units; do you scrap or upgrade those old ships. Land units can now be built with brigades already attached. An Air Naval combat system that radically alters the combat balance. New damage algorithms for the Air combat system, making organization more important and allowing air units to fight longer.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/22130/header.jpg?t=1603968531",
    "Price": 14.99,
    "Developers": "Paradox Development Studio",
    "Publishers": "Paradox Interactive",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/22130/0000007169.1920x1080.jpg?t=1603968531,https://cdn.akamai.steamstatic.com/steam/apps/22130/0000007170.1920x1080.jpg?t=1603968531,https://cdn.akamai.steamstatic.com/steam/apps/22130/0000007171.1920x1080.jpg?t=1603968531,https://cdn.akamai.steamstatic.com/steam/apps/22130/0000007172.1920x1080.jpg?t=1603968531,https://cdn.akamai.steamstatic.com/steam/apps/22130/0000007173.1920x1080.jpg?t=1603968531,https://cdn.akamai.steamstatic.com/steam/apps/22130/0000007174.1920x1080.jpg?t=1603968531",
    "Slug": "hearts-of-iron-2-complete",
    "Meta Title": "Hearts of Iron 2 Complete: Jan 23, 2009, Paradox Developm...",
    "Meta Description": "Looking for information on Hearts of Iron 2 Complete? Check out the release date (Jan 23, 2009), developer insights from Paradox Development Studio, and...",
    "Alt Text Image": "Official header image for Hearts of Iron 2 Complete game - Steam 22130",
    "Canonical URL": "https://gusku.site/game/hearts-of-iron-2-complete",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hearts of Iron 2 Complete\", \"description\": \"Looking for information on Hearts of Iron 2 Complete? Check out the release date (Jan 23, 2009), developer insights from Paradox Development Studio, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 23, 2009\", \"author\": {\"@type\": \"Organization\", \"name\": \"Paradox Development Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Paradox Interactive\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/22130/header.jpg?t=1603968531\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}