{
    "AppID": 268130,
    "Name": "Heat Signature",
    "Release date": "Sep 21, 2017",
    "About the game": "Break into spaceships! Fly your pod up to any spaceship in the galaxy and dock with its airlock to sneak inside. From there, you've got to sneak up on the crew, outshoot them in slowmo gunfights, or outthink them with clever gadgets. Take missions to steal loot, assassinate VIPs, or rescue friends. Take your time! Get out of impossible situations by pausing at any time and taking as long as you need to figure out a clever plan. You have a wide range of gadgets with clever uses, and you can switch, aim and fire them with no time pressure at all, letting you pull off ridiculously cool tricks without needing twitch skills. Liberate the galaxy! All your missions get you closer to liberating new space stations from the empires that control them, and this unlocks new gadgets to buy in your shops, and special challenge characters to play. Lots more features! I'm not making GIFs for all these! I'm not made of GIFs! I'm not some kind of GIF-golem! Emergent gameplay! Use gadgets like teleporters, stealth shields and subverters to invent your own solutions to tricky situations. Galactic zoom! Zoom smoothly from a view of the whole galaxy down to your character sneaking up on guards inside the spaceship you're boarding. Choose your difficulty! You choose each mission, ranging from trivially easy to nightmarishly hard. There's also a practice mode where you can try items and tactics with no consequences and instant-restart. Randomly generated missions! Each one picks a random combination of guard kit, ship layout, and complications like space battles. Each life is a new character! Choose between randomly generated characters with different starting kit, and when you die, play as someone new in the same galaxy. Personal missions! Every character has one grand heist to work towards: rescue their brother, steal their gun back, get revenge on their partner's killer. Modular destruction! Blow up any part of a ship with breach grenades or fuel barrels. Rip a ship in half. Get sucked into space by the vacuum. Rescue your friends' characters! If someone on your friends list gets their character captured, and they aren't able to rescue them, maybe you can! You'll sometimes get a character whose personal goal is to rescue a friend's character. If you manage it, you unlock your friend's character to play as! They don't get it back. They had their chance. It's yours now. Find your friends' items! When you retire an accomplished character, you can choose one item to pass on. You get to name it, and both your Steam friends and your own future characters have a chance to find these as loot. Equally, you'll come across items your friends have named. What Heat Signature is not: We don't want you to buy Heat Signature if it's not for you. We'd always rather have a happy non-customer than an unhappy customer. So here's what it isn't: - It's not story-driven: there's a backstory to this place and a few conversations with characters, but there's not a story that develops as you play. It's much more about the stories you generate by playing, about how you got out of impossible situation X or pulled off crazy stunt Y. There aren't other careers: You can't mine asteroids. You can't build ships. You can't recruit a crew. You're an infiltrator, you break into spaceships for a living, it's all about that. There are no planets: The whole game takes place in this nebula full of space stations. You can dock at any friendly station and board any hostile ship, but it's not a space exploration game. It's not multiplayer: The friends features mentioned above are fun but they're just sharing content, it's not multiplayer at all and you're never in the same world together. There are cool games about all those things. This is a cool game about something else!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/268130/header.jpg?t=1584742422",
    "Price": 14.99,
    "Developers": "Suspicious Developments",
    "Publishers": "Suspicious Developments",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_d9b2da2bfc6f7c1ca7b72ebbfbaea3c74423a33b.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_6eb210754149c8d850d9c8ad3e392a26aefb5db0.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_2fd2970b8a62ff99e9d786bd4dd3803c66a5bcfa.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_e33b87b6ad40870378169086b28923ddae2e33ee.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_2029d2369d0f8db4ee0cca64f5dfd3da40e3509e.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_5d248c83025c7df92f0ab9b24c6c93eb7a71aa93.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_94293f41672ad02c6235094ce5afd3e6a5ad15c8.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_ec3f561f4ebbf113d3f5e315d64f312727f997b7.1920x1080.jpg?t=1584742422,https://cdn.akamai.steamstatic.com/steam/apps/268130/ss_7f8bbe267bd0374643114a574b6dcee08a7ddd73.1920x1080.jpg?t=1584742422",
    "Slug": "heat-signature",
    "Meta Title": "Heat Signature: Sep 21, 2017, Suspicious Developments and...",
    "Meta Description": "Looking for information on Heat Signature? Check out the release date (Sep 21, 2017), developer insights from Suspicious Developments, and a complete ga...",
    "Alt Text Image": "Official header image for Heat Signature game - Steam 268130",
    "Canonical URL": "https://gusku.site/game/heat-signature",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Heat Signature\", \"description\": \"Looking for information on Heat Signature? Check out the release date (Sep 21, 2017), developer insights from Suspicious Developments, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Suspicious Developments\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Suspicious Developments\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/268130/header.jpg?t=1584742422\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}