{
    "AppID": 532270,
    "Name": "Lethal VR",
    "Release date": "Nov 8, 2016",
    "About the game": "Lethal VR is an immersive Virtual Reality weapons experience for the HTC Vive brought to you from Three Fields Entertainment, creators of Burnout , BLACK and Dangerous Golf . Step into the shoes of an FBI Recruit and be tested in a series of weapons simulation exercises. Each simulation is comprised of five short challenges featuring a variety of small weapons. At the end of each challenge you will be graded on your performance. Do you have what it takes to earn a Lethal rating? Your abilities will be tested in 30 different challenges spread across 5 tiers of weapons simulation. You will need to demonstrate speed, precision, deadly accuracy and the ability to remain calm under pressure. Good Luck, Recruit! Challenge Types include: Quick Draw Draw your weapon and fire! Successful candidates will need to demonstrate both speed and accuracy! Knife Throw Prove your skills in the ancient art of knife throwing. How many Bullseyes can you hit? Bonus Points will be awarded for multiple Bullseye chains. Skilled candidates can score multiple hits on each Target. Sharpshooter Put your firearm skills to the test in our specially designed 360 degree room scale VR Weapons Range. Targets will appear all around you, above and below. Bonus Points will be awarded for Speed Shots, Bullseyes and chaining Headshots together. Rapid Fire With a Weapon in each hand, how quickly can you destroy all of the Targets? Master the skills of Rapid Fire and Rapid Reloading. Watch for Penalty or Civilian Targets that may block your line of fire. Combat Practise your urban combat skills in our 360 VR room scale simulation version of Hogan’s Alley. Shooting over, under, through and around obstacles may require kneeling down or laying on the floor! Your performance will be rated after successful completion of each challenge. Only the most proficient Recruits will be awarded a ‘Lethal’ rating. Recruit Candidates who achieve top ratings across all Simulations will be marked for fast tracking and promotion once this part of your training is complete. Local Leaderboards will keep track of who are the most Lethal Recruit Candidates amongst your friends and family. Earning a Rating in each Challenge will unlock special Bonus Challenges. These feature special weapon prototypes kindly on loan to us from our own Advanced Weapons Research Division. Hollywood thought they were merely fictional. But we’ve been developing special weapons like these for years. Use of these Weapons is strictly Bureau confidential, and as such, their existence must be kept secret. Remember! Loose Lips Sink Ships! Here is the full weapons list we will be using for today’s Simulations. Handgun Throwing Knife Double Handgun Double Throwing Knife Handgun and Knife SMG Burst Fire SMG Full Auto Double SMG Burst Fire Double SMG Full Auto SMG and Knife Features: Immersive Virtual Reality weapons experience Built from the ground up for the HTC Vive – a true 360 room-scale experience. Put your skills to the test with a wide variety of exciting Weapons. Step into the shoes of an action movie superstar. Easy to understand skill based scoring system. Local leaderboard tracks best players. Perfect game to introduce friends and family to exciting new world of VR!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/532270/header.jpg?t=1655731428",
    "Price": 14.99,
    "Developers": "Three Fields Entertainment",
    "Publishers": "Team17 Digital Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_0440070b750d9279d5c011595e461cf8ba847673.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_3f30eca092d2d656c695aa2474f7ff6732758fa4.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_cbb996e195b292e2767afa8cfccd4c727daead8c.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_2f351b05335e0012e24d1fee347a796d1a60edda.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_88bef4cb50e9bdc29104c77a9d811b1d5e761a0e.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_de6af8456b1aab417d60112fcd28a50f45da67c8.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_418eb7f23cb250dcfaf175100f44983f5798fe70.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_f1d86d33a50a0e47d16313ad05564426177acf66.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_c0b92198cd9f361a7779b542940d9293bdd8bfd3.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_7bf985ffa09d53e01623eda2ffe63b4e7b080f81.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_543f48ffc4e76bde16e89dff51adba253f9e118d.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_d657aa8ddcc2144cd7dbdbd635e12df7cf9adea6.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_be96166ab13d0ce87a83a514c4cfb4376774c1f9.1920x1080.jpg?t=1655731428,https://cdn.akamai.steamstatic.com/steam/apps/532270/ss_25578e0dfde808ece96bc612b800105f6cd7576c.1920x1080.jpg?t=1655731428",
    "Slug": "lethal-vr",
    "Meta Title": "Lethal VR: Nov 8, 2016, Three Fields Entertainment and Fu...",
    "Meta Description": "Looking for information on Lethal VR? Check out the release date (Nov 8, 2016), developer insights from Three Fields Entertainment, and a complete game ...",
    "Alt Text Image": "Official header image for Lethal VR game - Steam 532270",
    "Canonical URL": "https://gusku.site/game/lethal-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lethal VR\", \"description\": \"Looking for information on Lethal VR? Check out the release date (Nov 8, 2016), developer insights from Three Fields Entertainment, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 8, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Three Fields Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team17 Digital Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/532270/header.jpg?t=1655731428\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}