{
    "AppID": 676910,
    "Name": "Magic Potion Destroyer",
    "Release date": "Sep 26, 2017",
    "About the game": "Story After being locked in a witch’s mansion for three years, she’s finally ready to make her escape ― by force. Now she must return to her village and save her brother. Her name is Claudia. In order to save her brother from a deadly poison, she is left with no choice but to succumb to the teachings of the most powerful witch of all. Escape from the witch’s mansion! This is a strategic escape game. Use “Mana Reinforcement” and “Magic Potions” to power Claudia up and make your way through the 30 stages of the witch’s mansion to escape to freedom. There are five possible endings to the game, each of which requires specific conditions to be filled. Will you be able to make it out of the mansion safely and achieve the best ending possible?! Mana Reinforcement Consumes MP obtained by defeating enemies and enhances various character statuses Pay close attention to the state of battle and utilize the most effective power-ups. The “Magic Potions” described below can be used to dramatically increase these effects. Magic Potions Claudia must fulfill various conditions to regain her memories, which allow her to use “Magic Potions” in accordance with said memories. Effects include everything from those which increase the effects of status enhancers, to those which give Claudia the ability to unleash special attacks. Additionally, decoding the regained memories will also allow you to figure out what exactly is behind Claudia’s predicament and her dramatic escape. Developer's Voice This game tells the backstory of Claudia, a girl from our original work 'Magic Potion Stories', set 12 years before this and the game 'Magic Potion Explorer.' As you can see, it has an atmosphere drastically different to our other works. While the atmosphere has changed, the gameplay follows and improves on the Magic Potion Explorer experience. That is based on the rewarding feeling of as beating enemies and growing more powerful. You can play leisurely for the feel-good elements, or you can aim to reach the limits of growth and record completion time. You can try to piece together Claudia's memories revealed in fragments of text to uncover the truth. There are many ways to enjoy the game and we hope you have a great experience!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/676910/header.jpg?t=1609553353",
    "Price": 9.99,
    "Developers": "ARTIFACTS",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/676910/ss_cfd2f0f59db00ee8d430ae810911b5dfe43908ef.1920x1080.jpg?t=1609553353,https://cdn.akamai.steamstatic.com/steam/apps/676910/ss_c7126a08d014c4f1fb4f71e756df390f65c2ce1f.1920x1080.jpg?t=1609553353,https://cdn.akamai.steamstatic.com/steam/apps/676910/ss_a977ad13252ee406ceefd30ac06a609344cbb86b.1920x1080.jpg?t=1609553353,https://cdn.akamai.steamstatic.com/steam/apps/676910/ss_dfdc4bff5f56dd1f4e1d44fe0be8c37eb8c34dd5.1920x1080.jpg?t=1609553353,https://cdn.akamai.steamstatic.com/steam/apps/676910/ss_ba6cea24b92c40e805e70ff01120b98922e60e59.1920x1080.jpg?t=1609553353",
    "Slug": "magic-potion-destroyer",
    "Meta Title": "Magic Potion Destroyer: Sep 26, 2017, ARTIFACTS and Full ...",
    "Meta Description": "Looking for information on Magic Potion Destroyer? Check out the release date (Sep 26, 2017), developer insights from ARTIFACTS, and a complete game sum...",
    "Alt Text Image": "Official header image for Magic Potion Destroyer game - Steam 676910",
    "Canonical URL": "https://gusku.site/game/magic-potion-destroyer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Magic Potion Destroyer\", \"description\": \"Looking for information on Magic Potion Destroyer? Check out the release date (Sep 26, 2017), developer insights from ARTIFACTS, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 26, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"ARTIFACTS\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/676910/header.jpg?t=1609553353\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}