{
    "AppID": 827940,
    "Name": "Marvellous Inc.",
    "Release date": "Apr 27, 2018",
    "About the game": "Marvellous Inc. is a zachlike coding puzzle open-source game. Take the role of a freshly hired employee at the Marvellous Incorporated (aka MarvInc ) as one of their first Robot Testers, coders tasked with exploring the true potentials of MarvInc's newest product: robots capable of complex tasks and promise to revolutionize the world. Code your way through puzzles, meet fellow researchers, and uncover the secrets behind MarvInc's ultimate goals. Learn how to code from scratch, whether you're an experienced developer or someone who's never had contact with programming before. Interact with other characters and advance the plot through an internal e-mail inbox. Make decisions and decide the fate of MarvInc through your actions. Marvellous Inc. includes: Over 40 puzzles; Multiple endings; Colorful characters that interact with the player; Cross-platform steam cloud support; A thriving world to explore. -------------------------------------------------------------------------- Here is what MarvInc human resources has to say about this great opportunity: Are you interested in working with cutting-edge, never before seen technology that has huge promise to change the way society works forever? Marvellous Incorporated is an international multi-conglomerate that puts YOU before profit. We at the MarvInc Family think that employees are people, and as such are entitled to ideas and thoughts* on how to make the MarvInc Family a better environment. Our research department is lead by the greatest computer scientists all over the globe, who just recently developed an innovative and front line Artificial Inteligence that can follow simple, yet profound scripts to perform any task imaginable! Your role at our company, may you pass all our rigorous requirements and expectations, shall be to program and test those AI's to complete assignments. As our employee, you will: Code programs in our exclusive and top-of-the-line terminal Receive constant emails detailing assignments and jobs for you complete Simple puzzles will ease-out any new programmers or enthusiasts in the job, so don't worry about not having any previous programming skill. Enjoy yourself ** as you improve our technology! Join our Family now, and help us CHANGE the world. * By accepting this contract you agree to seize any and all intellectual property you produce to the Marvellous Incorporated (Copyright 2016) Research Department. ** You will not be paid for enjoying yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/827940/header.jpg?t=1639852934",
    "Price": 11.99,
    "Developers": "Marvellous Soft",
    "Publishers": "Marvellous Soft",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/827940/ss_f0a49749fe46ad830825b10648cbb725e923f516.1920x1080.jpg?t=1639852934,https://cdn.akamai.steamstatic.com/steam/apps/827940/ss_70ee387240e01651d7eac765969011137b0ece88.1920x1080.jpg?t=1639852934,https://cdn.akamai.steamstatic.com/steam/apps/827940/ss_da8caca93d175826a29b21707a0f19d01dbbf572.1920x1080.jpg?t=1639852934,https://cdn.akamai.steamstatic.com/steam/apps/827940/ss_35087a51e64d88eda8ff0f838f8ba674cf78b203.1920x1080.jpg?t=1639852934,https://cdn.akamai.steamstatic.com/steam/apps/827940/ss_946c77972bc4e9f34f9b409a00307a1fcc78ac62.1920x1080.jpg?t=1639852934",
    "Slug": "marvellous-inc",
    "Meta Title": "Marvellous Inc.: Apr 27, 2018, Marvellous Soft and Full O...",
    "Meta Description": "Looking for information on Marvellous Inc.? Check out the release date (Apr 27, 2018), developer insights from Marvellous Soft, and a complete game summ...",
    "Alt Text Image": "Official header image for Marvellous Inc. game - Steam 827940",
    "Canonical URL": "https://gusku.site/game/marvellous-inc",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Marvellous Inc.\", \"description\": \"Looking for information on Marvellous Inc.? Check out the release date (Apr 27, 2018), developer insights from Marvellous Soft, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Marvellous Soft\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Marvellous Soft\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/827940/header.jpg?t=1639852934\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}