{
    "AppID": 1497110,
    "Name": "Melodramatica",
    "Release date": "Jun 24, 2021",
    "About the game": "Team Actors presents: Melodramatica ! In this charming management game, you embody Josephine, a Victorian theatre manager, in her quest to train an eccentric troupe of actors. It's your job to make sure your actors and the stage are ready to put on a perfect show! Train your actors, resolve conflicts, dress up your troupe in costumes, arrange the correct staging and handle everyone's daily tasks! Can you meet the harsh critics' expectations? About us We are Team Actors; a student team from Breda University of Applied Sciences (formerly known as NHTV). This academic year, we got the amazing opportunity to work together on a project, from concept to final release! This early access build has been worked on for the past 28 weeks. Please do keep in mind; we are a student team with limited time and resources, but we would still really appreciate to get your valuable feedback on our project. We will try our best to apply the feedback and suggestions to our ability to allow for the best possible release! If you want to reach us directly and help us create, you can join our community Discord! About this game Welcome to Melodramatica, a Victorian themed management game where you get to step into the shoes of a stage manager to manage your excentric troupe of actors! You're a stage manager in Victorian times, working hard to make sure costumes and staging get created, and your troupe has the correct skills to perform the chosen play. Each individual actor has their own storyline, personality and preferences. Talk to your troupe and inspire them to get to work! Help sort out the rivalry between the twins, and help resolve issues left and right. Explore the backstage of a Victorian grande theatre and make sure your troupe of 5 actors are training their three talents; acting, dancing and singing. Craft costumes and décor pieces, or assign one of your actors to do it for you. Manage the budget, and dress up your actors in the right costumes before the show. To see all your hard work in action on the evening of the play, sit back and watch some of the highlights of the show! Get into the Victorian mood with the unusual art style, mimicking old Victorian prints! This 3D game is made to resemble a 2D, hatched print, making for an interesting visual experience. Feature summary Craft staging and costumes Manage your limited budget to allow for the best possible show Assign tasks to your acting troupe Assign your actors a role to train for Help solve issues the actors encounter during their busy schedule Assign your actors the correct costumes for their role Match the right backdrops to the plays Discover the personalities and stories of your actors",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1497110/header.jpg?t=1624980181",
    "Price": 0.0,
    "Developers": "Team Actors",
    "Publishers": "Breda University of Applied Sciences",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_56cd175bb3c7e9a8f2e1d73edb3c443d6d3c80f1.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_5a4a54d6988af184770797028f6a901ca9779d4c.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_ab3130cbdb2abd42f8a4508b36eaaa495cddd081.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_022d431ca6811bdba533b59c5aec78a8870d58ca.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_449195b597b291769e66a1b2e71b883edd52383e.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_2a9cbae5e52e56074238b754dbb95a6fea8356f3.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_b846f64378de6f33ae0e52fdf5cf4d3237dda99a.1920x1080.jpg?t=1624980181,https://cdn.akamai.steamstatic.com/steam/apps/1497110/ss_072728e8d2e83afe284b9de2048dcb384b3821ec.1920x1080.jpg?t=1624980181",
    "Slug": "melodramatica",
    "Meta Title": "Melodramatica: Jun 24, 2021, Team Actors and Full Overview",
    "Meta Description": "Looking for information on Melodramatica? Check out the release date (Jun 24, 2021), developer insights from Team Actors, and a complete game summary.",
    "Alt Text Image": "Official header image for Melodramatica game - Steam 1497110",
    "Canonical URL": "https://gusku.site/game/melodramatica",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Melodramatica\", \"description\": \"Looking for information on Melodramatica? Check out the release date (Jun 24, 2021), developer insights from Team Actors, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 24, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Actors\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Breda University of Applied Sciences\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1497110/header.jpg?t=1624980181\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}