{
    "AppID": 1197530,
    "Name": "Planet Modular TD",
    "Release date": "Dec 12, 2019",
    "About the game": "This is tower defense offline strategy game for players who love challenging defence and td games. Play this tower defence game now and you will definitely like it. This is a tower defense with no unique solution. This is a tower defense where you have to try and embrace new strategies. Concept is simple: You have waves of multiple incoming 'enemies' that must be defended against. Overall whether you will succeed or not will depend on your ability to strategically place and construct towers in the path of attacking enemies. In this strategy game player has a space base that must be defended by the player. You have waves of multiple incoming 'enemies' that must be defended against. Overall whether you will succeed or not will depend on your ability to strategically place and construct towers in the path of attacking enemies. You have basic towers and tons of (over 60) modules to insert and modify tower performance. Defense of a core from aliens, humanoids and highly intelligent predators not easy that is why the game is built so you will have to adapt to new level constantly. In this TD game you can build anything with our system. YOU can build towers that can cast poison, freeze, confuse enemies, stun, turn them around, weaken them. And moreover you will have to try it like in some other TD games, the game is built so there is no ultimate strategy. Choose defense strategy for your towers smart and you will prevail in this defense game. This is what happens when gamers make defence games. We make offline tower defense games that we would enjoy. What I urge you to play today is raw and epic rush of TD strategy game experience of trying different defence and tower strategies upgrading your defense and finally winning. Want to play strong defence game? Build scary flamethrowers. Want to play tricky defence? Use your strategic thinking and construct the defense that confuses and plays with the enemy. Want to play wise and resourceful defense? Insert economic modules and get as much as you can in tower defense games from your nemeses. Strategy is important here because the resources available to achieve these goals are limited. Module Tower Defense 2 features: • 40 levels • Build and experiment with towers to master the defense • Every level is a challenge as every level is different in its own way, tons of different mechanics and gameplay changers across the levels and planets • Vast amount of modular elements that can give your tower • Additional unique defence effects such as income or splash or critical strike. • Experiment your way to finding module combos that evolve the way your tower works • Enemies have their own powers and aces up their sleeve to obstruct your tower defence. Game has many different type of enemies that can weaken, disable, sneak through your defense to give your towers hard time. • Elements – enhance damage dealt by your towers • Upgrade, craft and explore, you will be given plenty of resources - use them with purpose • 3 different skills that can give you yet another way to customize your defense • Beautiful graphics and climatic setting • Achievements and easter eggs. Tower defense offline games is an old and epic genre. TD games has come a long way. This tower defence game is one that I with my friends enjoy. Play this td game now and see for yourself.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1197530/header.jpg?t=1576486502",
    "Price": 9.99,
    "Developers": "Gyro-Games Inc.",
    "Publishers": "Gyro-Games Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1197530/ss_7177595aa0bc05b4e2050d2085797925a83fe9b5.1920x1080.jpg?t=1576486502,https://cdn.akamai.steamstatic.com/steam/apps/1197530/ss_6ebb6c9c710bcd9ce1fd85be75df2817ec6a2f45.1920x1080.jpg?t=1576486502,https://cdn.akamai.steamstatic.com/steam/apps/1197530/ss_45d1d48710ff8feb6a0a1936e21dbae7473e86ca.1920x1080.jpg?t=1576486502,https://cdn.akamai.steamstatic.com/steam/apps/1197530/ss_c2b07806f53678167ebaaecdfe86b1c85c4a3efa.1920x1080.jpg?t=1576486502,https://cdn.akamai.steamstatic.com/steam/apps/1197530/ss_e1b2096c4960edbbc82ce24f19f962b56f68ab5b.1920x1080.jpg?t=1576486502",
    "Slug": "planet-modular-td",
    "Meta Title": "Planet Modular TD: Dec 12, 2019, Gyro-Games Inc. and Full...",
    "Meta Description": "Looking for information on Planet Modular TD? Check out the release date (Dec 12, 2019), developer insights from Gyro-Games Inc., and a complete game su...",
    "Alt Text Image": "Official header image for Planet Modular TD game - Steam 1197530",
    "Canonical URL": "https://gusku.site/game/planet-modular-td",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Planet Modular TD\", \"description\": \"Looking for information on Planet Modular TD? Check out the release date (Dec 12, 2019), developer insights from Gyro-Games Inc., and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gyro-Games Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gyro-Games Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1197530/header.jpg?t=1576486502\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}