{
    "AppID": 1413370,
    "Name": "Power to the People",
    "Release date": "Feb 8, 2022",
    "About the game": "Build and maintain a power grid for a constantly growing population - all while fighting off potential disaster - in this thrilling resource management experience. Sell energy and earn money in order to expand your company. Provide more power to existing customers and supply it to newly constructed cities. It's time for you to give Power to the People! Feature Summary: Multiple modes (Main Campaign, Sandbox Mode, and Weekly Challenges) 14 missions spanning 5 continents Varying levels of difficulty 20+ unique buildings to utilize Extensive research tree with 30+ perks to discover and influence point management Different weather conditions, each providing its own challenges to the player Random events Leaderboard Challenge yourself and provide electricity to constantly growing cities, all while the demand for energy increases. Utilize more than 20 buildings and their upgrades to achieve your goals and keep the power running. Remember, if there are blackouts and your customers are not satisfied, you’ll be out of a job! Do you have what it takes to keep the lights on? Do you believe in nuclear power as the solution for humankind's energy production problems? Or are you more of a renewable energy fan? Perhaps you’d prefer to go old school and stick to fossil fuels? Power to the People offers you a wide array of power plant types and energy storage solutions so you can design your grid exactly how you want it, all while taking advantage of the local resources and climate. Each continent has its own challenges and weather conditions. You will have to employ both strategy and judgement to select the best energy plants, providing the most benefit for current conditions. Don’t forget to automate how power flows through your grids by using switching stations. Switching stations will allow you to adjust power flow based on weather conditions, power usage, storage, etc. Create the most robust system possible and thrive! Research more than 30 different technologies in order to improve your substations, power plants, and power lines. Don’t forget to spend some extra influence points to research new marketing techniques to boost the economy of your company. Each day, you’ll see new challenges thrown your way - be ready for anything! Sometimes, Mother Nature will surprise you with lightning bolts, solar flares, and falling trees which can put both your power lines and power plants at risk. In other cases, cities might experience increased power usage due to events like football games, the arrival of influencers, or the hosting of an extremely popular TV show. Make sure you provide a smooth experience for everyone involved and keep the people happy! You finished the main campaign and played around in sandbox mode, and now you want more? Every week, a new set of challenges will be presented to players. Play maps that have special conditions and specific restrictions, earn points, compete against other players, and climb your way to the top of the leaderboard!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1413370/header.jpg?t=1644439382",
    "Price": 14.99,
    "Developers": "Hermes Interactive",
    "Publishers": "Crytivo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_a5696340b933400742872d94f2d76271b9308884.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_7562cf0ef39fe30fd985921c681bb075bb6d8c38.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_45ed95bb66854abd1bdcd0b0b389d6dd138c4dae.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_404f6b88a7de9c1893c2d66453c703fd0a535c49.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_e36d66395d169eebe83924bbcade299aff87455b.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_41099b889d3c972d5debb2a819e9bbb5dbd569c4.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_286b9dcaa2450be23765a9049e79d9b03721a733.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_d219a8f9ae954b41c910704d19ace8758b5d97e3.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_21de36fd3f291e7ca8446a2f547dd40f4ee3354d.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_da36633e9f14d434482fb331d2b16a3c61ce1b1d.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_88b9172430fa08a3a216f2418ebcdedbb27299d0.1920x1080.jpg?t=1644439382,https://cdn.akamai.steamstatic.com/steam/apps/1413370/ss_b25db60bf814403a88a75640aa6d65349b41c698.1920x1080.jpg?t=1644439382",
    "Slug": "power-to-the-people",
    "Meta Title": "Power to the People: Feb 8, 2022, Hermes Interactive and ...",
    "Meta Description": "Looking for information on Power to the People? Check out the release date (Feb 8, 2022), developer insights from Hermes Interactive, and a complete gam...",
    "Alt Text Image": "Official header image for Power to the People game - Steam 1413370",
    "Canonical URL": "https://gusku.site/game/power-to-the-people",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Power to the People\", \"description\": \"Looking for information on Power to the People? Check out the release date (Feb 8, 2022), developer insights from Hermes Interactive, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Hermes Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crytivo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1413370/header.jpg?t=1644439382\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}