{
    "AppID": 1253920,
    "Name": "Rogue Legacy 2",
    "Release date": "Apr 28, 2022",
    "About the game": "Rogue Legacy is back! But now it's got a 2 on the end of it! Rogue Legacy 2 is a genealogical rogue-LITE. That means it has all the trappings of a typical rogue-like (randomized runs, changing characters, and more), but with persistent upgrades, and persistent dead heirs. In this game, your legacy defines you. Spend your parents’ inheritance and grow the family manor to give your children a better fighting chance. Each child is unique, with their own traits and abilities. Your daughter could be a Ranger. She could also be vegan. It’s a new experience every time. Rogue Legacy 2 also lets you play how you want to. Go hard and fast, and dive deeper into the depths of a randomly-generated world. Or take it slow and steady and build your character up until you’re ready for greater challenges. Every Adventure is Unique New monsters, new traps, and new layouts await you every time you enter the Kingdom. This is a world where improvisation, and not memorization is the key to success. Wildly New Classes No two classes play the same. Hide atop Ivy Canopies as the Ranger, and rain poisoned arrows down onto your foes. Take to the skies as a Dragon Lancer and fly across the skies striking foes at massive speeds. Or sing and dance through your enemies, as the joyous bard, leaving only a trail of bodies behind you. Rogue Legacy 2 supports 15 new classes, with 15 distinct styles of play. Brand New Style We’re taking a whole new artistic approach to Rogue Legacy 2. The sequel features 2.5D stylings, with 3D characters against hand-drawn backdrops. The art uses heavy shading and all animations are done using stepping techniques to keep the familiar RL look and feel. Revamped Biome Generation We went all-out with biome generation to make each area in RL2 feel completely new. Each biome adopts different “build strategies” to create completely unique yet-still-randomly-generated regions. True Metroidvania To really push the metroidvania flair, RL2 introduces heirlooms: special items that permanently give your heroes new abilities that fully reveal the world’s secrets. These are not basic lock-in-key abilities, but powers that fundamentally change how you play. And heirlooms are not simply handed to you. You must prove your worth, provided you can find them. Traits 2.0 Though fun the first time, the traits in RL1 often wore their welcome later in the game. We’ve now added gold modifiers to entice players to take on new challenges. The more debilitating the trait is (in-game), the bigger the reward. This makes choosing your heirs a meaningful decision every time. Relics and Resolve One of the most exciting new features to Rogue Legacy 2 is the ability to pick up Relics, which are unique items that change how your run is played. Gain stat modifiers, complete special challenges, and even gain brand new abilities as you traverse the kingdom. But be careful, the more Relics you obtain the more your resolve is shaken, and all Relics are lost if your hero perishes. Improved Accessibility We’ve taken accessibility to the next level with the introduction of House Rules. Toggle contact damage, tweak global damage and health, and even give yourself flight for difficult platform sections. You have complete control over how you want to play the game. We’ve also introduced new mechanics such as Off-shore Banking to give struggling players more ways to succeed. A Rich Narrative Not only is the lore to the world of Rogue Legacy greatly expanded in the sequel, but it runs deep. New lore awaits you all the multiple NG’s in. Beating the game once is only the beginning. Learn about the inevitable collapse of a once thriving kingdom, and discover the dark secrets of the ones responsible. And connect and build relationships with the characters you meet along the way. New Game+ for Days Your journey has only begun after beating the final boss in RL2. There is a ton more to explore and discover on multiple playthroughs. You must choose how the game gets harder, from unique biome hazards, to special boss fights. The experience keeps changing for near infinite replayability. More of Everything Of course we’re also adding more of everything people loved from the original Rogue Legacy. More traits, more spells, more classes, more biomes, more enemies, more equipment, more rooms, more story. More secrets ... Just more everything. Clownanthropy. Holy smokes! Punching clowns! AND THERE'S A WHOLE LOT MORE. This only scratches the surface of what Rogue Legacy 2 has to offer. Scar Challenges, Fairy Rooms, the Curio Shoppe, the list goes on, but reading is for nerds. Go out and discover the world of Rogue Legacy 2 for yourself! /",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1253920/header.jpg?t=1652116054",
    "Price": 24.99,
    "Developers": "Cellar Door Games",
    "Publishers": "Cellar Door Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_38e3dcba9ad2a6c8d6defb69ae1b3137f9eb2907.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_21e41442a39177a8785cb4bce39ff65f0f74672c.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_387ee5bf5e2faffadfb7b6925b90ca9e767ee595.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_0371a24285fb03b09b40e595773dd243222128df.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_46a4a19ec64f5c7b06faa6614f9de2f3e1fd657b.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_ef42f4012a6ed6ccda423d5460f083823dcd8148.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_64fb14cba2f9f4b168e0017ff5f71b3b4329693d.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_a488133e129fae275974d7ead6de11c4f28491cb.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_77ef01bb46a7cfa4d9d2c2e8db96dac7bcf597ad.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_fb6424d1395263ffb9878b649ea5b521746e769c.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_1f94558c66d95e615a1d0c44c02f63412f333479.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_e9033ac115bf6739a479f06dae474f7f990b3e6b.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_0288a11ccf13cbeaa298ba807034edf117289d19.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_1dbff9ec7ff75a45a5c0b61368ffb693e6830598.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_608cd48c6d08d0e65a7f67bb4a1d67169eddd33e.1920x1080.jpg?t=1652116054,https://cdn.akamai.steamstatic.com/steam/apps/1253920/ss_9b2f114d1c8eb953e262225136e96b18b007159f.1920x1080.jpg?t=1652116054",
    "Slug": "rogue-legacy-2",
    "Meta Title": "Rogue Legacy 2: Apr 28, 2022, Cellar Door Games and Full ...",
    "Meta Description": "Looking for information on Rogue Legacy 2? Check out the release date (Apr 28, 2022), developer insights from Cellar Door Games, and a complete game sum...",
    "Alt Text Image": "Official header image for Rogue Legacy 2 game - Steam 1253920",
    "Canonical URL": "https://gusku.site/game/rogue-legacy-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rogue Legacy 2\", \"description\": \"Looking for information on Rogue Legacy 2? Check out the release date (Apr 28, 2022), developer insights from Cellar Door Games, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 28, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cellar Door Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cellar Door Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1253920/header.jpg?t=1652116054\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}