{
    "AppID": 282560,
    "Name": "RollerCoaster Tycoon World™",
    "Release date": "Nov 16, 2016",
    "About the game": "RollerCoaster Tycoon World™ is the newest installment in the legendary RCT franchise. This next-generation theme park simulation and building game includes fan-favorite features and incredible new advancements such as stunning 3D environments full of roller coaster thrills, exciting flat rides, eager guests, user-generated content, robust social features, and more – all in one massively fun game! FEATURES Powerful Building Tools: Innovative 3D Coaster Editor: Easily create the coolest and wildest coasters imaginable with our best track editor ever! Using our spline-based editor, tracks can be fully manipulated in 3D for the first time, allowing you to create any shape you can dream up. Expansive Selection of In-Game Objects: Entertain your park guests with tons of different coasters, flatrides, shops, scenery items and more! Freeform Object Placement: Control and place every single in-game object anywhere on the map at any angle. Curved Paths: Select your unique type of path from a variety of widths, styles, and shapes. You can make them straight, or for the first time in the franchise, curve them at almost any angle! Fully Deformable Terrain with Water: Place amazing rides and change your park’s landscape in full 3D with completely deformable terrain and water. Expansive Customization Support: Piece-by-Piece Builder: Create custom buildings and scenery in-game with our expansive Piece-by-Piece tools. Four themes (Adventure, Sci-fi, Western and Generic) and over 260 premade, tiled pieces give players limitless creative freedom. User-Generated Content Tools: For the first time, you will be able to create any item you want in any 3D editing program that works with Unity, and import it into the game for everyone to use! Our robust Steam Workshop integration lets you quickly and easily share your UGC creations with the entire RCTW community! Multiple Maps and Themes: Choose from different environments – forest, deserts, tropical islands - and theme options (Western, Sci-fi and more!) to make each park unique. Next-Generation Simulation: Brand-New Progression Mode: Experience an exciting new way to play with our mission-based campaign system. This progression mode features dozens of engaging and increasingly tricky missions over 3 world maps, with multiple objectives and playstyle options. As you complete these missions, you’ll be granted Research Points, which can then be used to unlock over 100 new scenery items for use in your Sandbox Mode. Detailed Park Management Tools: Run a successful theme park using a plethora of park management tools and trackers. From park finances to the thoughts of your guests, everything is at your fingertips including new features like heat maps! Sandbox Mode: Build the park of your dreams with unlimited resources in our Sandbox mode. Items unlocked in the Progression Mode will be made available in your Sandbox, or at the touch of a button you can access the full breadth of RCTW coasters, flatrides, shops, and more. Build how you want! Responsive Environments and Guests: Create themed zones in your park! Placing different themed objects near your rides will increase their attractiveness to certain peeps, changing game play dynamically. Advanced Physics Calculations: The coasters in RCTW use a more complex physics simulation than any previous game in the franchise. This simulation allows for amazing designs and a lifelike riding experience. Build a coaster that stays perfectly on its tracks or teeters on the brink of disaster; just be careful or your coaster may jump the rails! Ride Every Coaster: Hop into the front seat of a coaster and ride what you made yourself! Innovative Services: Manage your park’s medical, janitorial, entertainment and mechanical needs with the re-designed, simple-yet-powerful services system. Native Sharing and Social Features: Social Media Integration: Share all your cool creations and designs with your friends straight from within the game! Friend’s Lists and Stat Comparisons: See what your Steam and Social friends are up to in their games from within yours! It’s easy to see someone’s latest coaster or when they last edited their park. Native Steam Workshop Support: Native Steam Workshop support is built right into RollerCoaster Tycoon World! The interface has been simplified and centralized to make it easy for anyone from the casual to hardcore user. Custom scenery, blueprinted coasters, parks and more can be easily and seamlessly shared from within the game. UGC has been designed to be accessible and easy to use for everyone.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/282560/header.jpg?t=1633714616",
    "Price": 14.99,
    "Developers": "Nvizzio Creations",
    "Publishers": "Atari,RCTO Productions",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_7fd5ef51167cd15c79853d07dd4cf80f8f8f33a0.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_78604e7f2287ef8eda3f0ae085c36e764d100c0a.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_b77df327e1881eb0af9da33cc56268b45ee9e464.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_94985fe630fbf329c125dbae42a14ff09d732cf5.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_0b87e3b52add4d4556e13d276f3e46c3eb74fac5.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_8aa3120d2a437a490e86057cd3b2c93ec374a479.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_a6fdc71d0850399177d78e4fd2f4a6bb98fe170e.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_dc0f8288317310747d81ab1b3536d39823e9378e.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_138311094271647b277cc2daca4b660bbab3585c.1920x1080.jpg?t=1633714616,https://cdn.akamai.steamstatic.com/steam/apps/282560/ss_518c66b98339eb6d5c2b7acffb4f8398b1941bbb.1920x1080.jpg?t=1633714616",
    "Slug": "rollercoaster-tycoon-world",
    "Meta Title": "RollerCoaster Tycoon World™: Nov 16, 2016, Nvizzio Creati...",
    "Meta Description": "Looking for information on RollerCoaster Tycoon World™? Check out the release date (Nov 16, 2016), developer insights from Nvizzio Creations, and a comp...",
    "Alt Text Image": "Official header image for RollerCoaster Tycoon World™ game - Steam 282560",
    "Canonical URL": "https://gusku.site/game/rollercoaster-tycoon-world",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RollerCoaster Tycoon World\\u2122\", \"description\": \"Looking for information on RollerCoaster Tycoon World\\u2122? Check out the release date (Nov 16, 2016), developer insights from Nvizzio Creations, and a comp...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Nvizzio Creations\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atari,RCTO Productions\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/282560/header.jpg?t=1633714616\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}