{
    "AppID": 844260,
    "Name": "Rustler (Grand Theft Horse)",
    "Release date": "Aug 31, 2021",
    "About the game": "Grand Theft… Horse Rustler is an open-world, top-down action game paying tribute to the good old GTA style and gameplay, fusing it with a historically inaccurate medieval setting. Play as The Guy, whose parents apparently were too lazy to give him a proper name. Experience feudal injustice, inquisition, witch-hunting, and join The Grand Tournament. Meet valiant, yet incredibly stupid knights. Complete a wide variety of twisted missions and quests, or don’t give a damn about the plot and bring mayhem in the villages and cities. Choose to go on foot, or by a stolen horse. Fight with a sword or pick a fancy automatic crossbow. All that, spiced up with an inappropriate Monty Python inspired sense of humor. Be a bold, bald thug in a medieval sandbox Rustler’s world is filled with humor, anachronisms, and pop culture references. Ever been towed for parking in a “NO HORSE ZONE”? Wanna do some cage fights in Medieval Martial Arts Arena? Or maybe pimp-a-horse a little? How about joining the Round-Earthers sect? Wreak havoc in top-down, old-school combat Use swords, spears, turds, and crossbows. Want to get more efficient? Try holy hand grenades or… horses. Nothing’s more deadly than hooves galloping in your direction. Or drifting a cart. Screw everyone over to win half the kingdom As a poor peasant, you really need to get creative in order to win the Grand Tournament™. Form weird alliances, double-cross your foes, and dig up dinosaur skeletons in a light, easy-to-understand, and hard-to-empathize-with story. Hire bards to aid you musically in battle A bard can be your sweaty personal radio. Not only will he not leave your side, even in the midst of the bloodiest of conflicts, he will also change the song's dynamic depending on the action on-screen. Moreover, you can express a desire to change the tune by punching him in the face. A lot of horsin’ around Shoot cows into the sky, dress up as a guard or even Death himself, burn entire piles of weed, draw fancy shapes with a plowing cart, survive a full-on guard onslaught after killing half the city… And that’s only a few of the many crazy things you can do in Rustler. CHECK OUT MORE FROM GAMES OPERATORS! / / Gameplay Trailer Song: BouzoukXp - Korrigan",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/844260/header.jpg?t=1657689373",
    "Price": 24.99,
    "Developers": "Jutsu Games",
    "Publishers": "Games Operators,Modus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/844260/ss_ceff594c36f013c3256ff9f7f4a61873b68be6ce.1920x1080.jpg?t=1657689373,https://cdn.akamai.steamstatic.com/steam/apps/844260/ss_260670947882ce09b5be05a37897ab1152b2d2e1.1920x1080.jpg?t=1657689373,https://cdn.akamai.steamstatic.com/steam/apps/844260/ss_20d047cc56d4d7966bbe73f12dfaed5bd219ce36.1920x1080.jpg?t=1657689373,https://cdn.akamai.steamstatic.com/steam/apps/844260/ss_07d384a96b6627e5898d02ae35edac1090682793.1920x1080.jpg?t=1657689373,https://cdn.akamai.steamstatic.com/steam/apps/844260/ss_6f40de6d6186045b3f85e501877a002470ecb8c5.1920x1080.jpg?t=1657689373,https://cdn.akamai.steamstatic.com/steam/apps/844260/ss_b2d8ba4c88b0cdf8c37604122f0d3dbe05180cf2.1920x1080.jpg?t=1657689373",
    "Slug": "rustler-grand-theft-horse",
    "Meta Title": "Rustler (Grand Theft Horse): Aug 31, 2021, Jutsu Games an...",
    "Meta Description": "Looking for information on Rustler (Grand Theft Horse)? Check out the release date (Aug 31, 2021), developer insights from Jutsu Games, and a complete g...",
    "Alt Text Image": "Official header image for Rustler (Grand Theft Horse) game - Steam 844260",
    "Canonical URL": "https://gusku.site/game/rustler-grand-theft-horse",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Rustler (Grand Theft Horse)\", \"description\": \"Looking for information on Rustler (Grand Theft Horse)? Check out the release date (Aug 31, 2021), developer insights from Jutsu Games, and a complete g...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jutsu Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Games Operators,Modus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/844260/header.jpg?t=1657689373\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}