{
    "AppID": 543510,
    "Name": "SONAR Home Studio",
    "Release date": "Dec 1, 2016",
    "About the game": "Transform any Windows 7, 8, or 10 computer into your own personal music studio with all the tools, loops, instruments, and effects you need to create, edit, and mix great music. Packed with tools and features used by the professionals, SONAR Home Studio is an ideal platform to get started in music production. As part of SONAR ’s lineage—the program that scored Call of Duty, MI:5 Rogue Nation, and powers countless hits— SONAR Home Studio benefits from the SONAR family’s years of refinement. When you’re ready to create music—not just listen to it— SONAR Home Studio is ready for you. SONAR Home Studio does it all: Rock out with the TH3 Cakewalk virtual guitar amps, craft ground-breaking beats with the Step Sequencer, export samples to RPG Maker, and much more. And when you’re ready for a more full features application, SONAR Home Studio projects are compatible with all professional editions of SONAR . Highlights: Surface Pen, Surface Dial, and improved Touch Navigation powered by Windows 10. Get ready to go wireless with support for Bluetooth MIDI Keyboards in addition to your speakers and headphones. Use as many plug-ins as your heart desires in projects with no limits. Seriously. Improved Built-in Audio Support: With new WASAPI drivers, SONAR now delivers low-latency performance with Windows Desktops, laptops and tablets. A brand new Audio Loop Library from Big Fish Audio! Key Features Includes 700 loops, 400 One Shots and FX for music creation Up to 64 audio tracks supporting large projects Overloud TH3 Cakewalk Guitar Amp simulator with world-class guitar tones Built-in Browser to easily drag and drop loops, instruments, effects, and track templates Share your music on SoundCloud Optimized for Windows 10, enjoy fast and responsive audio I/O, and robust performance An intuitive guided setup on first launch to help get you get started immediately Help Module: A “hovering” system to learn/command the program fast! A great assortment of hi-quality effect plug-ins including Reverb, Delay, Chorus, Compressor/Gate, Filters, Phaser, EQ, Modulation and more Studio Instruments Suite features four different instruments that create the perfect band: Bass, Electric Piano, Drums, and Strings Rock-solid support for USB microphones and the Rocksmith Real Tone cable VST2 and VST3 plug-in support – compatible with thousands of effects and instruments by the world’s leading developers 8 Style Dial FX modules that give you simple yet professional mix results with ease Rapture Session sample player comes with 450 sounds ranging from soaring synth lead and devastating synth basses to thought provoking atmospheric pads and cinematic strings Integration with LANDR online mastering – the easiest way to finalize your songs before sharing and publishing An onboard “Curve EQ” for sophisticated tone shaping through equalization Dedicated Comping Tool lets you consolidate the best sections from multiple takes into a single killer track The Start Screen organizes all your projects with images of each session and provides quick tips to get you inspired The SONAR Smart Tool gives you intuitive and powerful editing capabilities Deep MIDI and audio editing tools let you tweak to perfection Mix like a pro with a full mixing console that includes built-in EQ+ templates Supports REX and “ACIDized” loop formats 8 languages French, German, Spanish, Italian, Brazilian/Portuguese, Japanese, Chinese, and Russian SONAR Home Studio Plugin Suite: Sonitus Compressor Sonitus Delay Sonitus Equalizer Sonitus Gate Sonitus Modulator Sonitus Multiband Sonitus Phase Sonitus Reverb Sonitus Surround Sonitus Surround Compressor Sonitus Wahwah AliasFactor Chorus/Flanger Classic Phaser Compressor/Gate HF Exciter Modfilter Para-Q Tempo Delay TH3 Cakewalk Edition 8 One Knob StyleDials SONAR Home Studio Virtual Synths: Rapture Session Studio Instrument Bass Studio Instrument Drums Studio Instruments Electric Piano Studio Instrument Strings Cakewalk TTS-1 Supported Formats: Wave and Broadcast Wave (time stamped) WMA, WAV, W64, ASF AIFF, CAF, SD2, RAW FLAC OGG, RF64 MP3 WAV RIFF, ACID, Rex, Rex2, Rex64 Dithering options on export SoundCloud integration MusicXML Export 32/64-Bit VST3 support 32/64-bit VST2, VSTi and DXi support Bit Bridge (allows 32-bit plug-ins in 64-bit mixing environment) PNG Track Icon support",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/543510/header.jpg?t=1511559355",
    "Price": 0.0,
    "Developers": "Cakewalk",
    "Publishers": "Cakewalk",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/543510/ss_e2321e0504c20dcd63c60de6b63f53001208a571.1920x1080.jpg?t=1511559355,https://cdn.akamai.steamstatic.com/steam/apps/543510/ss_8f47188c5a809939424623a78080262370a6b567.1920x1080.jpg?t=1511559355,https://cdn.akamai.steamstatic.com/steam/apps/543510/ss_33df360e7548c117cac45c7085da0a5b835a0dae.1920x1080.jpg?t=1511559355,https://cdn.akamai.steamstatic.com/steam/apps/543510/ss_81ffb3992fdadc72b227b56dda51e8562ef3c8b7.1920x1080.jpg?t=1511559355,https://cdn.akamai.steamstatic.com/steam/apps/543510/ss_1f6cf0f6a9fa74fd86b7b71bf2bb37b6c3df3c0d.1920x1080.jpg?t=1511559355",
    "Slug": "sonar-home-studio",
    "Meta Title": "SONAR Home Studio: Dec 1, 2016, Cakewalk and Full Overview",
    "Meta Description": "Looking for information on SONAR Home Studio? Check out the release date (Dec 1, 2016), developer insights from Cakewalk, and a complete game summary.",
    "Alt Text Image": "Official header image for SONAR Home Studio game - Steam 543510",
    "Canonical URL": "https://gusku.site/game/sonar-home-studio",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SONAR Home Studio\", \"description\": \"Looking for information on SONAR Home Studio? Check out the release date (Dec 1, 2016), developer insights from Cakewalk, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 1, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Cakewalk\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/543510/header.jpg?t=1511559355\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}