{
    "AppID": 1377350,
    "Name": "Spinodrum",
    "Release date": "Aug 24, 2020",
    "About the game": "Spinodrum is a lightweight 3d drum simulator working on pc which allows users to play drums on their keyboard with optimum key settings. Users can play drums freely, record their own defined sessions, generate their own beats through notation based system and compete against time in 3 different difficulty levels. The most importantly, users are able to control a 3d drummer character . Spinodrum just keeps all of the things as simple as possible and offers high efficiency on drum play with a fun factor. FEATURES SCORE GAME Score Game is a drum hits capturing based competition against time where each hits brings 5 point while each 100 points resets the timer. The harder modes decreases timer countdown. On the other hand, easier modes comes with helping tools. SCORE GAME ACHIEVEMENTS Score Game comes with 18 different achievements for 3 different difficulties from easy to hard. LIVE RECORDER Live Recorder is a quick beat recording tool in real-time which allows users to save or load their own records. Records being helded as open data. This means, users can share the data files with each other or edit manually. BEAT CREATOR Beat Creator is a procedural, note based system that helps users make their own beats through a formal way. There are different settings than single hits such as timing and bpm. Users are able to combine notes and adjust their timing levels per entry. TRAINING MODULE Training Module implemented in Spinodrum with update no 1.0.2. It has 12 built-in and pre-recorded drum partitions. Module allows users to listen and practice the basic steps of drumming in a formal way. FULLY EDITABLE KEYS Spinodrum has 2 different keymap options. One is for live help which can be toggle during runtime and the other one is for detailed editing. 30 different keys/hits are waiting to be response. Keys of drum parts are customizable with standard Latin alphabet from A-Z letters to 0-9 numerics. REPLACEABLE DRUM SAMPLES Spinodrum uses real drum sounds that recorded in Istanbul/Kadikoy. All samples are openly placed in data folder and users are able to replace all of them as long as they keep the file types and sizes same due to their needs. DRUMLESS BEATS &amp; METRONOME The one of the most important things in a drum simulator is that it must allow users to play drums on some backing tracks or melodies. Spinodrum comes with 3 drumless beats which are bass only due to copyright sensitivity. But it doesn't mean that users can't add their own drumless musics during runtime. That's why, drumless beat section has open data folder which allows users replace sample beats with their favorite music to play in Spinodrum. CUSTOMIZABLE SKINS &amp; SCENE Spinodrum offers customizable skins for drumset (including 6 cymbals, toms, bass drums and snare), sticks, character and a background scene together. Users can easily edit and share the built-in skins which is placed in data folder. It's easy to change anyting in customskins folder. Users are able to make difference with any kind of photo editor as they like as long as they keep the original file types and sizes same.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1377350/header.jpg?t=1609427669",
    "Price": 0.0,
    "Developers": "Ali Efe IRALI",
    "Publishers": "Ali Efe IRALI",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_717a87c2c968c018e58674b6ff1c397915ff1f9f.1920x1080.jpg?t=1609427669,https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_6ffb4c79ec9a222608c4f251e137c8989f65eb63.1920x1080.jpg?t=1609427669,https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_2ad86256776610a5c4c91d948a014d785ba93e83.1920x1080.jpg?t=1609427669,https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_1dd890cc55f14e9bda53222b085e9a0f85e8c099.1920x1080.jpg?t=1609427669,https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_e1ca47215e0c0dee90074f0dd715144962b89f29.1920x1080.jpg?t=1609427669,https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_388daa0259a42c2d05285badfc0a5a60126204ea.1920x1080.jpg?t=1609427669,https://cdn.akamai.steamstatic.com/steam/apps/1377350/ss_c524eb270bca4557944023b1785b3f26f6f9aef7.1920x1080.jpg?t=1609427669",
    "Slug": "spinodrum",
    "Meta Title": "Spinodrum: Aug 24, 2020, Ali Efe IRALI and Full Overview",
    "Meta Description": "Looking for information on Spinodrum? Check out the release date (Aug 24, 2020), developer insights from Ali Efe IRALI, and a complete game summary.",
    "Alt Text Image": "Official header image for Spinodrum game - Steam 1377350",
    "Canonical URL": "https://gusku.site/game/spinodrum",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Spinodrum\", \"description\": \"Looking for information on Spinodrum? Check out the release date (Aug 24, 2020), developer insights from Ali Efe IRALI, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 24, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ali Efe IRALI\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ali Efe IRALI\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1377350/header.jpg?t=1609427669\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}