{
    "AppID": 840300,
    "Name": "Supralympic Runners",
    "Release date": "Feb 6, 2019",
    "About the game": "Supralympic Runners is a first-person competition-focused endless runner . You play an heavily fitted athletic champion, like you've never seen before in sport. But nerves of steel are highly required to compete for the worldwide leading position! THE SUPRALYMPIC WORLD Several hundred years after the technological revolution , the Supralympic Games became the world's foremost sports competition. They reflect the values and human aspirations of a sunless future. You were born during the reign of manufactured products, long after the replacement of nature wherever it could be replaced. You even left your flesh body for the promise of technological eternity. But while you could experience an infinity of forms, you embraced the life of a supralympian athlete. You have been training over and over to master and improve this high-tech body. In the hope that one day the Supralympic champion’s title will be yours… MAIN FEATURES Rocket-powered running: run over 60 mph thanks to your back thruster. Dash: break through obstacles thanks to your rocket-shield . Bullet-time: experience the world in slow-motion thanks to your chronostaser . Brakes: slow down, and recycle kinetic energy to get back some dash power! A progression system: XP and Uracoins earned based on your running results. Workshop : spend Uracoins to customise your runner with armor pieces, back-thrusters and other advanced technologies. Athlete edition : choose the planet and nation you run for, and honor them by defeating others! 3 competition scales: national, international and interplanetary. 3 difficulty levels: rookie, pro, elite. STUNGATE MECHANISM Run as far as you can, avoid obstacles and hurry up while the Stungate is still open ! What the hell is a Stungate ? It's a gate kept by a giant compressor! It's 50,000 tons of tungsten-titanium waiting to fall upon your head if you are late! Let's say you get through, what then? If you manage to cross 5 Stungates , you complete a stage. You have a few seconds of respite during which you can take a look at the cityscape. But don't relax too much, each completed stage means a new deadly obstacle into the death row! EXTRA FEATURES 10 types of deadly obstacles to spell the end of each and every round. 8 types of collectable bonus to get extra-backing. 3 ranges of armor kits to push the deadline back. DESTRUCTION There are many ways to terminate your running in Supralympic Runners, but none is happy... You could end up ROASTED by electric shocks, DISSOLVED into the slime, MELTED by lava, SLICED by lasers, SMASHED against walls, CRUSHED by compressors, FALLEN into the depths or PURGED under timeout. No one will be spared… TECH FEATURES Procedural generation of race tracks: theoretically infinite. Environment dynamic evolution: 3 biomes of corridors and cityscapes. Adaptative music: good waves to suit tension of the game. Physic-based velocity: thrust of rocket, thrust of legs, mass and air drag matters. Physic-based collisions: hold tight, make it or break it! DETAILED CORE GAMEPLAY Since you seem interested, let’s see under the hood... Forward Speed Control Unlike many endless runners you can manage your running speed thanks to your back thruster. This speed is driven with physic-based parameters : thrust of motor and legs and body drag . Indeed it’s not an automatic-forward but a minimal-forward mechanic forcing you to run. Lateral Control The runway has no railroads . It means that you can freely and continuously move laterally between bounding walls. Also, the runner lateral speed is non-linearly affected by its forward speed, it means the fastest you run forward, the slowest you run laterally, following a specific curve. Vertical Control Well you can obviously jump and slide , but we took care to improve the vertical mobility of the runner : vertical speed is not only driven by gravity but also by motor thrust . This means you have the ability not only to sustain jumps but also to dive lightning-fast into the ground. Special Actions You can dash forward making your runner invulnerable to minor damages during the thrust. You can also experience the world in slow motion , thanks to the chronostaser that comes within your running avatar. Collisions Because of the fine control considerations above, the collisions are physic-based . The game accurately detect them based on each body part colliders of your runner.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/840300/header.jpg?t=1549483785",
    "Price": 3.99,
    "Developers": "Uranium Soda Studio",
    "Publishers": "Uranium Soda Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/840300/ss_4dc5d72bd5f45d3cbf9d358720f1563ed561e63e.1920x1080.jpg?t=1549483785,https://cdn.akamai.steamstatic.com/steam/apps/840300/ss_c1121f93a3444101928d445efef8edee100cc2e2.1920x1080.jpg?t=1549483785,https://cdn.akamai.steamstatic.com/steam/apps/840300/ss_249189cf83fa0c6c6317ed1e30189a35b546ebc0.1920x1080.jpg?t=1549483785,https://cdn.akamai.steamstatic.com/steam/apps/840300/ss_d93194081f8b2bea501a7e36b28727272869a89d.1920x1080.jpg?t=1549483785,https://cdn.akamai.steamstatic.com/steam/apps/840300/ss_abab5d2832f4086c1c0834d177fdabd5d7d330a7.1920x1080.jpg?t=1549483785",
    "Slug": "supralympic-runners",
    "Meta Title": "Supralympic Runners: Feb 6, 2019, Uranium Soda Studio and...",
    "Meta Description": "Looking for information on Supralympic Runners? Check out the release date (Feb 6, 2019), developer insights from Uranium Soda Studio, and a complete ga...",
    "Alt Text Image": "Official header image for Supralympic Runners game - Steam 840300",
    "Canonical URL": "https://gusku.site/game/supralympic-runners",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Supralympic Runners\", \"description\": \"Looking for information on Supralympic Runners? Check out the release date (Feb 6, 2019), developer insights from Uranium Soda Studio, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Uranium Soda Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Uranium Soda Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/840300/header.jpg?t=1549483785\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}