{
    "AppID": 523740,
    "Name": "Techwars: Global Conflict",
    "Release date": "Dec 21, 2017",
    "About the game": "TechWars: Global Conflict is the world’s first isometric mecha PVP-Action with direct control. Apart from the simple reaction speed, to win in every battle, you will need an impeccable sense of tactics and ability to skillfully use weapons, robots, and peculiarities of the landscape of the area. With these skills, you will be able to destroy dozens of enemies! The story component is based on an alternative history from Mikhail Vlad’s novels. According to the plot, the world slid into anarchy in 2050 and now there is only one law – the law of force that is based on cutting-edge technologies. Russian ‘Dominion’ and American ‘KATO’ used their armies of giant war robots to clash in an apocalyptic confrontation of supercorporations for control over the planet. The player will have to become a pilot of one of the factions and take part in the battle for control over a number of locations. The choice of a faction plays an important role. Each faction has its global technologies. The Dominion robots can cause devastating air strikes, while KATO mechanoids can protect themselves from damage for a few seconds. The advanced class system stimulates сlose cooperation between players. This system features the following: Scouts: they are vulnerable but very fast; they can quickly find weak spots in enemy defenses and report such to the allies. Stormtroopers: the main striking force on the battlefield; they are powerful and tough. Destroyers: slow but extremely dangerous at long-range combat. Support class: weak individually, but indispensable for a group due to the ability to restore armor and supplies. Each player can own several robots at once and use them depending on the game situation. The destruction physics of TechWars: Global Conflict was a special focus of developers. Almost all the objects on the map can be destroyed. Partial destruction of objects can be used tactically to create temporary shelters and enemy safe shooting zones. All this will be a pleasant addition to the main thing – destroy all enemies in sight. And by the way, as you're there thinking, others are already catching fun! List of key features for the beta version of the game: Detailed and complex destructibility of mechs Destructibility of all objects consisting of a material that can be destroyed (for example: concrete, brick, blocks of other building material) Over 14 advanced mechs with unique characteristics. Each mech uses a unique technological skill Over 100 upgradable weapons and items Any combat unit can be improved in several ways to gain fantastic superiority. There is a separate modification system for all kinds of weapons. However, significantly improving some characteristics will cost you a weakening of others. Up to 20 mechs can participate in a single battle at the same time Shelters and terrain to gain advantage Mechs behave realistically. For example, injury to the right hand makes it impossible for the robot to use a gun attached to it; if the left hand is injured, the robot will not be able to use short-range weapons on it. Players can also interact with each other outside the battlefield – they can make friends, unite in clans or find deadly enemies.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/523740/header.jpg?t=1579593796",
    "Price": 0.0,
    "Developers": "Argus Games",
    "Publishers": "Promo Trade Toys LLC,Argus Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_7f700b966fc8b2cc9c469612c7fe28205feb34f1.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_ce9929bf4d4662c54ded84d6af09f4740455852b.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_02cc121629f3cdf864da120c99043a7651b2a30b.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_2c5675a103e9f12d7414084e9c63150f6134a40d.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_aec97a468500efa100e93067f2a7ab3dc6640030.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_0d07d363e3ed5448837526662a8d39045ee89080.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_cca23682f38b24d4a38239af9aad8110cdd59d05.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_49136fca4ae512b802c220f6ef8a4e3088314af6.1920x1080.jpg?t=1579593796,https://cdn.akamai.steamstatic.com/steam/apps/523740/ss_a6c4a7657789f297432eb1d2f77852b2943fc8d3.1920x1080.jpg?t=1579593796",
    "Slug": "techwars-global-conflict",
    "Meta Title": "Techwars: Global Conflict: Dec 21, 2017, Argus Games and ...",
    "Meta Description": "Looking for information on Techwars: Global Conflict? Check out the release date (Dec 21, 2017), developer insights from Argus Games, and a complete gam...",
    "Alt Text Image": "Official header image for Techwars: Global Conflict game - Steam 523740",
    "Canonical URL": "https://gusku.site/game/techwars-global-conflict",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Techwars: Global Conflict\", \"description\": \"Looking for information on Techwars: Global Conflict? Check out the release date (Dec 21, 2017), developer insights from Argus Games, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 21, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Argus Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Promo Trade Toys LLC,Argus Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/523740/header.jpg?t=1579593796\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}