{
    "AppID": 521560,
    "Name": "The Mystery Of Woolley Mountain",
    "Release date": "Apr 10, 2019",
    "About the game": "Funded on Kickstarter with backers including legend of the genre Ron Gilbert, The Mystery of Woolley Mountain is an otherworldly adventure game filled with strange beasts, evil witches, confused automatons and wacky ropemen. Join a renegade crew of time-travelling audio scientists on a hilarious and fantastical quest. A malevolent witch has captured a group of children, and it’s up to you to save them from the mysterious island of Woolley Mountain! Explore a rich and interactive set of environments, filled with head-scratching puzzles. Unravel a salacious storyline, meet a cornucopia of quirky characters, and boogie on down to an awesome original soundtrack!​ Key features Colourful world: A fantastical sprawling universe, populated by beasts, witches, automatons, ropemen and other strange and wonderful beings.\u000b Family content and all-ages humour: No swearing... well, maybe the word ‘darn’ on occasion! \u000bStriking 2D graphics: Adventure Time meets the Simpsons in Wooley Mountain’s lovingly crafted art style. \u000bGripping story: The five scientists travel in their amazing time-traversing Crystal Submarine from island to island. Can they make it to the dangerous island of Woolley mountain, destroy the evil witch, and rescue the kids? Meet the Crew The five time travelling scientists known collectively as the Helmholtz Resonators are an odd bunch. They can each play the bass, guitar, drums and keyboards, conduct science, and travel through time, yet they are each prone to personality flaws. Let me explain: Garland Taking the title of Head Chorister, Garland assumes command of top-line vocals most of the time with some notable exceptions. This maybe because he likes to be his own biggest critic, only to then give himself glowing reviews. Garland is a stickler for tidiness, in fact, his motto is 'PUT THAT BACK WHERE IT BELONGS!'. Vandamme The most mysterious and adventurous Resonator. Plays just about any musical instrument and understands any scientific advice. Take charge of capturing the audio signal generated by the group to whichever format is prevalent to the era in which they find themselves. Carlton No one has every been able to pin down exactly what Carlton does. Obsesses over finding a link between science and mysticism but only ever seems to be proving a link between alcohol and bad decisions. Plays guitar, synthesizers and supplies baritone vocals. Prefers to do anything but actual, tangible work, proclaims he was born with a rare disease called 'Cannotbearseditus'. Frithel If Frithel could change every choice to include the suffix 'or science?' he would always choose the latter. This man is obsessed with science - he lives, breathes, digests and inserts science. He carasses, high fives and smooches science, he... okay you get the picture. Also plays Drums, loves the Bee Gees and spoken word poetry... in a sciencey kind of way. Auto Auto is short for Automaton, and is the groups robotic aid and protector. Over time he has developed a fondness for Carlton, due to the time that Mr. Breezy has invested in playing with Auto. From darts, to movies, to arcade machines and to the definite chagrin of the other chaps, as this reduces the time that Auto could be tidying, computing and generally busying himself around the ship in a non-creepy android going-to-kill-all-humans way. Chladni Chladni is in charge of sub 400hz vibrations and is a celebrated player of the Low Frequency Guitar. His motto is 'Nimble of finger - nimble of mind!'. Plus, he can't keep his mind off the ladies and sees himself as some sort of lothario, of which his motto is also 'Nimble of finger - nimble of mind!'.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/521560/header.jpg?t=1642067208",
    "Price": 12.99,
    "Developers": "Lightfoot Brothers",
    "Publishers": "Lightfoot Brothers",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/521560/ss_62b38956beac71342c81050563150a62ed4b0160.1920x1080.jpg?t=1642067208,https://cdn.akamai.steamstatic.com/steam/apps/521560/ss_354e8c3e84bba6186e6ae65f092ec2bfeb4b61c6.1920x1080.jpg?t=1642067208,https://cdn.akamai.steamstatic.com/steam/apps/521560/ss_a3135173b824b8857854a45a414816bbc5dcd613.1920x1080.jpg?t=1642067208,https://cdn.akamai.steamstatic.com/steam/apps/521560/ss_5a67af0685b88e069b6db45557048820c612145c.1920x1080.jpg?t=1642067208,https://cdn.akamai.steamstatic.com/steam/apps/521560/ss_e8ca68cb4de6bdcb5912169f23f03f7635de1b70.1920x1080.jpg?t=1642067208,https://cdn.akamai.steamstatic.com/steam/apps/521560/ss_1db45d9c4baa5c21c835cd284004f6b3830447d3.1920x1080.jpg?t=1642067208",
    "Slug": "the-mystery-of-woolley-mountain",
    "Meta Title": "The Mystery Of Woolley Mountain: Apr 10, 2019, Lightfoot ...",
    "Meta Description": "Looking for information on The Mystery Of Woolley Mountain? Check out the release date (Apr 10, 2019), developer insights from Lightfoot Brothers, and a...",
    "Alt Text Image": "Official header image for The Mystery Of Woolley Mountain game - Steam 521560",
    "Canonical URL": "https://gusku.site/game/the-mystery-of-woolley-mountain",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Mystery Of Woolley Mountain\", \"description\": \"Looking for information on The Mystery Of Woolley Mountain? Check out the release date (Apr 10, 2019), developer insights from Lightfoot Brothers, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 10, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lightfoot Brothers\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lightfoot Brothers\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/521560/header.jpg?t=1642067208\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}