{
    "AppID": 1018060,
    "Name": "The Mercenary Rise",
    "Release date": "Oct 12, 2019",
    "About the game": "Game content This game is a simulated business game. The whole game revolves around the mystery of Stephen Gray's father's death. The main goal of players in the game is to pay off the debts left by their fathers within a limited period of time and to investigate the cause of their fathers'death. In the game, Stephen will continue to run on the territory of six countries, complete all kinds of tasks, fight, recruit all kinds of companions, and strengthen his own mercenary regiment. The game uses turn-based chess mode. Each peer will have unique skills and different growth directions. At the same time, in the game, you can strengthen your mercenary regiment through trade, national task, guild random task, branch task and so on. Game style This game uses 2D cartoon style, Japanese character vertical drawing. In combat scenarios, tasks will appear in the Q-version style. Is a Japanese style strong simulation business games. Trade system In the current version, the trading system is based on caravans, with each city as a node. Players can invest in as many as 100 cities, buy and trade goods, and earn money from them. Investments can boost urban prosperity, allowing players to buy more sophisticated trades and relics in cities, and even hire more sophisticated mercenaries in unionized cities. Peer growth system In addition to the plot, most of the comrades in this work need players to achieve a special requirement, such as a certain comrade in the team, how much national prestige is achieved. After joining the mercenary corps, you can see their growth in the state. Everyone's growth is different, which determines their development direction. The character's attribute growth adopts the random growth system, which ensures that players can not get different character attributes at each time of the game, and enhance the playability. Character growth from C to S represents the growth rate of upgrading, C represents the lowest growth, S represents the highest, other content players can discover in the game. Relics System In the current version, the only equipment is relics. Different relics can bring different relics additions. Low-level relics can only bring attribute additions, while high-level relics can add some skills, even improve mobility, and attack distance. Of course, advanced heritage acquisition is more difficult, some will appear after the city has developed to a certain level, some will be acquired in some special branches, in the future we will try to add more ways of acquisition. National system The current version of the national system is incomplete and currently brings only titles. Mercenary Rising Countries Set 1. NANCY (Republic of Nanxi) The protagonist's country of birth and the Republican Kingdom composed of aristocrats have been under attack because of the powerful Bailey Empire. After that, because of the internal division of the Bailey Empire and the beginning of the civil war, Bailey had to cease war with the Republic of Nanxi. Taking this opportunity, the 7th King of Nanxi set up a national barrier between the two countries. Since then, Nanxi has achieved a long-lost peace and its national strength has grown rapidly. The country is surrounded by the sea on three sides, with mountainous areas in the north, forests in the northwest, fertile land in the middle and plains in the majority. Agriculture dominates the country. 2. BALLY (Bailey Empire) Once the strongest empire on the mainland, but because of the internal division of the empire, resulting in national turmoil, the vast territory was divided by the two countries, the national strength rapidly weakened. Today, Bailey is still a force that can not be underestimated on the mainland, and the war with Bad continues. The northern part of the country is near the sea, and there are mountains below the coastline. The central part of the country is also dominated by plains, but it is not fertile. The country has a strong military, but commerce and agriculture are underdeveloped. 3. BADDE (Bad Empire) The country separated from Bailey, the royal family and the Bailey Empire are related by blood. Because of historical disputes, they have been in a state of war with the Bailey Empire for many years. Most of the land is near the sea, and Bailey was originally an economically developed area, so its national strength is not lower than that of Bailey. The land faces the sea on both sides. Except for the mountains in the Northwest part, the land is mostly plains and forests. 4. HANNAH (Emirates of Hanna) In addition to Bailey, the most powerful empire on the mainland, the whole country is dominated by commerce, the economic system is very developed, Hannah people are good at business, businessmen throughout the mainland, so Hannah is very rich. Hannah is also good at diplomacy. Hannah has almost no enemies on the whole continent. Every country has deep contacts with Hannah, so Hannah has a very high position on the whole continent. Hannah is facing the sea. The whole continent is mostly plain forests, but Hannah people are not good at farming, so Hannah's land is used for farming and planting cash crops, in order to make a lot of profits. 5. HOPELAND (Place of Hope) The Holy See is located in a very small territory. It is a neutral territory negotiated by various countries in the early years of the mainland and a shelter for the Holy See. The people here are all faithful followers of the Holy See. Every year, the Holy See receives tributes from all countries. In addition, its territory is mostly forested and suitable for cultivation. Therefore, people's lives are peaceful and prosperous. Faced with the sea, most of the land is forested. 6. GABBY (Gaby) The country of heroes, named after the hero Gaby, is a famous anti-tyrannical hero who has been helping countries resist the Bailey Empire. Later, mediated by the Holy See, Gaby and his followers established the present Gaby Kingdom in a plain beneath hope. The Gabi people inherit the will of heroes and have been committed to resisting power. The people are warm and kind, and their folkways are simple. Gaby is close to the Tigan Empire, another big Eastern country, but because of the obstruction of mountains, Gaby has never been threatened by Tigan. Below is the Republic of Hanna. The two countries have close contacts and frequent exchanges in economic, military and agricultural fields. To the West was the former arch-rival of the Bailey Empire, but because of the protection of the Holy See, Gaby and Bailey had not experienced a large-scale war.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1018060/header.jpg?t=1570870590",
    "Price": 1.99,
    "Developers": "zeroplaystone",
    "Publishers": "zeroplaystone",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_9b3952b68116d3408c5ac7d613bfef12b4032506.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_9213e955f52a46212fd8a34917e7dc6f85e639dc.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_2b92ea4e44f7d34ee1b08400102ad9521db28af7.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_6e11994e0267e85d91a38efd557b8393d4153481.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_b7a12d0d09c298da86953a04f91b57bda0af2601.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_0d7914eda4ebc28027b42b8d52194db9662b354c.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_864d99380a52f4a08aa4c05943d6062451b0bd75.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_e9af47491487d50356eb3a7d82bf2d24ce6c5a6c.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_b35f8369d2c8c890966fa1b4bfb16ba64e7ae4c3.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_d76079edde511667adfe74c13cd4ed11b2b7d14a.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_318c7a2faf874b25fa81b6d2deb2bcbb55bb9c8a.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_4c6a7ceff25f3fcf0556f5488ae88bb85ed17b62.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_9853225c411519b6c8af951dea1d6526e1283248.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_a3559bbc8909de961c32761407b37fb7d7c46901.1920x1080.jpg?t=1570870590,https://cdn.akamai.steamstatic.com/steam/apps/1018060/ss_ce95ee8ff3ad01764f10b7778c2d065c0d01bf9e.1920x1080.jpg?t=1570870590",
    "Slug": "the-mercenary-rise",
    "Meta Title": "The Mercenary Rise: Oct 12, 2019, zeroplaystone and Full ...",
    "Meta Description": "Looking for information on The Mercenary Rise? Check out the release date (Oct 12, 2019), developer insights from zeroplaystone, and a complete game sum...",
    "Alt Text Image": "Official header image for The Mercenary Rise game - Steam 1018060",
    "Canonical URL": "https://gusku.site/game/the-mercenary-rise",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Mercenary Rise\", \"description\": \"Looking for information on The Mercenary Rise? Check out the release date (Oct 12, 2019), developer insights from zeroplaystone, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 12, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"zeroplaystone\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"zeroplaystone\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1018060/header.jpg?t=1570870590\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}