{
    "AppID": 1953530,
    "Name": "The Last Man",
    "Release date": "May 20, 2022",
    "About the game": "An emergency call from the ALUC - Alien Life Unit Center - located on the planet CA-210717, has been received by the Special Force Team operating on the planet. They tried to call back the ALUC many times, but they had no luck... Sometimes one of the specimen escapes. In that case the special force team is called to extarminate it in order to avoid a possible contamination. The squad expected to find some sort of alien-guinea pig, but once inside inside the building they only find dead scientists, ripped to shreds. Finally, behind a corner, they see a weird creature. No eyes, 10 feet tall, huge claws as hands. The creature stands in front of them, with a weird smile on its face... At the same time, another creature jumps out of nowhere, and stabs one of the soldiers in the chest with its claws. The soldiers try to counterattack, but there are too many aliens, there is no way to kill them all. Ammunitions start to become scarce. The few soldiers that are still alive try to run away, but the aliens are everywhere. It seems like there is no escape for them. Despite all, one of the survivor manages to reach a werehouse. He can still hear the screams of his comrades, but he can't to anything for them. Suddenly, everything becomes extremely quite. Maybe, this is the time to escape from this hell. The last survivor knows the aliens are still there, waiting for him, but he must find a wayout. The Last Man is a topdown survival horror, where you have to escape from a facility infested by aliens. You can collect all the weapons and gears you find on your way, trying to find a wayout from this alien hell. But be careful! These aliens can cut your head off with a single hit! So, don't let your guard down. Six different endings 9 different weapons: from combat knife to a sniper rifle 4 game modes Procedurally Generated items and exit door locations Six maze-like levels (you have to play very hard mode to see all the levels) Hundreds of aliens to kill or to avoid: the choice is yours",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1953530/header.jpg?t=1653049614",
    "Price": 3.84,
    "Developers": "Pitigamedev",
    "Publishers": "CgEvo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1953530/ss_3d0679d872b94ca3f70988c2e18b877b09f807df.1920x1080.jpg?t=1653049614,https://cdn.akamai.steamstatic.com/steam/apps/1953530/ss_ae69fed5df4604258393abab89d16d140b7581a4.1920x1080.jpg?t=1653049614,https://cdn.akamai.steamstatic.com/steam/apps/1953530/ss_6a550e3669f0f16270bfcb1ffdd09dbcb080e361.1920x1080.jpg?t=1653049614,https://cdn.akamai.steamstatic.com/steam/apps/1953530/ss_483251dc117e567a0f32e4e0700a2d3ac46e6ce1.1920x1080.jpg?t=1653049614,https://cdn.akamai.steamstatic.com/steam/apps/1953530/ss_c09abf4155e645cbfa02619227df2af1083aeaf6.1920x1080.jpg?t=1653049614,https://cdn.akamai.steamstatic.com/steam/apps/1953530/ss_cebd38c01e1a1927569408f59184d7b1faad1995.1920x1080.jpg?t=1653049614",
    "Slug": "the-last-man",
    "Meta Title": "The Last Man: May 20, 2022, Pitigamedev and Full Overview",
    "Meta Description": "Looking for information on The Last Man? Check out the release date (May 20, 2022), developer insights from Pitigamedev, and a complete game summary.",
    "Alt Text Image": "Official header image for The Last Man game - Steam 1953530",
    "Canonical URL": "https://gusku.site/game/the-last-man",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Last Man\", \"description\": \"Looking for information on The Last Man? Check out the release date (May 20, 2022), developer insights from Pitigamedev, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 20, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Pitigamedev\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CgEvo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1953530/header.jpg?t=1653049614\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.84, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}