{
    "AppID": 282070,
    "Name": "This War of Mine",
    "Release date": "Nov 14, 2014",
    "About the game": "Recently updated with This War of Mine: Final Cut! This War of Mine: Final Cut is the conclusive, remastered edition of the game that contains all the updates and free expansions released so far and introduces not only a new scenario but also expands all scenarios with the locations known from Stories DLCs - even if you don’t own those. In short words - that means you can now experience lots of never-seen-before playthroughs and struggle with new challenges. It has been a long road. However, all stories must come to an end. This War of Mine has been giving you a thrilling experience of living through the war as a civilian for five years since its release. Numerous updates and expansions have broadened the experience and filled it with more shades and tonalities of hard civilian existence during wartime. Now, honoring the 5th anniversary of the original release, 11 bit studios proudly presents to you This War of Mine: Final Cut. This War of Mine: Final Cut contains all the updates and free expansions released so far and introduces not only a new scenario but also expands all scenarios with the locations known from Stories DLCs - even if you don’t own those. In short words - that means you can now experience lots of never-seen-before playthroughs and struggle with new challenges. Major changes and new content: One new classic scenario All locations from TWoM Stories added to the original game New quests and Events on Stories locations Remastered versions of all the classic locations A brand-new character Vanilla version of the game Minor changes and tweaks: 64bit and 32bit version 21:9 aspect ratio support 4k UI adjustments new main menu additional smaller bugfixes and tweaks To launch the Vanilla version of This War of Mine: Right-click on the game in your Steam Library. Go to Properties -&gt; Betas. From the drop-down list, choose vanilla - This War of Mine: Original Release 1.0 Close the window and update the game This War of Mine: Final Cut marks an end of an era for 11 bit studios, so let’s hear what the art director Przemyslaw Marszal, the person who created the unique style of This War of Mine, has to say: “We wanted to put the last touch to this phenomenon. The phenomenon, which made us who we are today as a team, equally in terms of creative fearlessness and business direction, and helped us pave our further way. Fantastic support from the gaming community was a huge part of that success, so it was without any doubt that this update must be free. We think of the Final Cut as a closing episode to the one-of-a-kind series This War of Mine has been. It will remain precious to our hearts and I don’t know what ideas the future will bring but Final Cut is final by no means. The creative minds in our studio, who were with the game up to this point, started to pursue new challenges. So we're excited about what's coming.” ABOUT THIS WAR OF MINE: In This War Of Mine you do not play as an elite soldier, rather a group of civilians trying to survive in a besieged city; struggling with lack of food, medicine and constant danger from snipers and hostile scavengers. The game provides an experience of war seen from an entirely new angle. The pace of This War of Mine is imposed by the day and night cycle. During the day snipers outside stop you from leaving your refuge, so you need to focus on maintaining your hideout: crafting, trading and taking care of your survivors. At night, take one of your civilians on a mission to scavenge through a set of unique locations for items that will help you stay alive. Make life-and-death decisions driven by your conscience. Try to protect everybody from your shelter or sacrifice some of them for longer-term survival. During war, there are no good or bad decisions; there is only survival. The sooner you realize that, the better. This War of Mine - main features: Inspired by real-life events Control your survivors and manage your shelter Craft weapons, alcohol, beds or stoves – anything that helps you survive Make decisions - an often unforgiving and emotionally difficult experience Randomized world and characters every time you start a new game Charcoal-stylized aesthetics to complement the game's theme The universe of This War of Mine has been expanded by following DLCs: The Little Ones - explores the hardships of wartime survival as seen from an entirely new perspective - that of a child. This War of Mine: Anniversary Edition - this free DLC, created especially for the 2nd Anniversary of the game, adds new characters, new locations to explore, and most importantly - a whole new ending, leading to a different outcome to the game. The dilemma though remains the same – how far will you go, to protect the ones you care about? This War of Mine: Stories DLCs: Episode 1: The Father's Promise – a heartbreaking tale of loss and hope in a war-torn city Episode 2: The Last Broadcast – where, as a radio operator, you are going to face moral dilemmas and decide, whether there is a price too high for the truth Episode 3: Fading Embers – portrays a story of Anja living in a warzone and carrying a heavy burden as she has to answer to herself what is more important - survival of human legacy or the survival of a man…",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/282070/header.jpg?t=1656003833",
    "Price": 19.99,
    "Developers": "11 bit studios",
    "Publishers": "11 bit studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_9a8e8724d4bc5a1ffc25b5aa52ed0400a856db6b.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_2aebf3f26978369655c9d4316e627b084fa0a69e.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_b65e44e1c5aa6ac2ea2d2b8f0eb94ff55c3cbd75.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_60caf1baf885322cd45c0f6a84a19b112316b04f.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_35f5bbc7b4bcdf0f48c93d055705594ea4749336.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_69d59279fc6ac19a5c30a8209d753b1e8728fa40.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_d17fe787849891db9b1c7f5c0d1eb079affc6f0f.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_64243910e65df2963f953baa9d6056283205ea6f.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_03f1ffbb3b36999da7ab1305c4a2b6f54b057478.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_095feca4f334b0740d52bb3a58fca6d7c624265e.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_28b7b1cd18ad4d4be25fef898a359445c0fcc9b2.1920x1080.jpg?t=1656003833,https://cdn.akamai.steamstatic.com/steam/apps/282070/ss_93b1ffea395ccc8d6f16dbd5d003efbb66f2f04e.1920x1080.jpg?t=1656003833",
    "Slug": "this-war-of-mine",
    "Meta Title": "This War of Mine: Nov 14, 2014, 11 bit studios and Full O...",
    "Meta Description": "Looking for information on This War of Mine? Check out the release date (Nov 14, 2014), developer insights from 11 bit studios, and a complete game summ...",
    "Alt Text Image": "Official header image for This War of Mine game - Steam 282070",
    "Canonical URL": "https://gusku.site/game/this-war-of-mine",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"This War of Mine\", \"description\": \"Looking for information on This War of Mine? Check out the release date (Nov 14, 2014), developer insights from 11 bit studios, and a complete game summ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 14, 2014\", \"author\": {\"@type\": \"Organization\", \"name\": \"11 bit studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"11 bit studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/282070/header.jpg?t=1656003833\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}