{
    "AppID": 715310,
    "Name": "Urban Rivals",
    "Release date": "Oct 18, 2017",
    "About the game": "Roll up your sleeves and lay down your cards! Urban Rival is a truly original, free, collectible card game. It is a game of skill and strategy that allows you to create your own gang and challenge other players in fast and furious fighting. The games are simple but intense and in just a few minutes you can control the whole of Clint City by putting your Pillz, Fury and bluffing skills to good use! BUILD THE ULTIMATE DECK - 1,500 collectible cards to be won or purchased, divided into 29 colorful clans with many more to come. - Hundreds of combinations of abilities and powers to ensure each deck is truly unique! - Trade with other fighters from all over the world and create your dream team. PLAY WHEN YOU WANT, WHERE YOU WANT - Your entire collection is connected to your Urban Rivals account, so you can seamlessly switch between your computer, phone and tablet. - Fight in duels lasting less than four minutes to really get your adrenaline pumping! - Every day brings new and exciting challenges and bonuses so you’ll never get bored! FIGHT AND EVOLVE - Evolve your characters to unlock their next level and more deadly powers. - Release the power of various spells, Pillz, and Fury, and make good use of the different clan synergies to overcome your enemies. - Register and share your greatest victories and defeats using the Everyplay tool that is part of the app. PVP GAME MODES FOR EVERYONE - Join our competitive Survivor, Tournament and Leagues modes and test your skills against the world’s best players. - Rise through the ranks, take part in events and PVP tournaments and enjoy a sense of excitement and honor. - Play casually with friends and follow those competing in the Training and Free Fight modes! WE ARE CELEBRATING 10 YEARS OF SUCCESS AND PROGRESS - Dive into a fun and complete world that is already a decade old! - Immerse yourself in nerve-racking battles and revel in the awe inspiring, hand-drawn illustrations. - Be blown away by our amazing graphics and special effects. What’s your strategy going to be? Whether this is your first card game or whether you’re an old-hand at TCGs, the thrill of Urban Rivals is sure to suck you in. Challenge your enemies and show them just what you can do! *** JOIN THE URBAN RIVALS COMMUNITY Check out our website and forums at: www.urban-rivals.com Follow us on Twitter @urbanrivals Like us on Facebook /urbanrivals Watch our community videos and all our trailers on our Youtube /urbanrivals channel If you experience any problems with Urban Rivals, please do not hesitate to contact our customer support team using the website. Explain what type of problem you are having and which device and operating system you are using. Supported languages: English, German, Spanish, French, Italian, Dutch, Polish, Portuguese, Russian",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/715310/header.jpg?t=1573814634",
    "Price": 0.0,
    "Developers": "Acute Games",
    "Publishers": "Acute Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/715310/ss_3c464f311c112479007580843395af0c9770d1a3.1920x1080.jpg?t=1573814634,https://cdn.akamai.steamstatic.com/steam/apps/715310/ss_c8230c14c6f5a582bc84e1458fbaa6b43ed78df1.1920x1080.jpg?t=1573814634,https://cdn.akamai.steamstatic.com/steam/apps/715310/ss_aaeb6a2c850ab3af73bae2ca78572449bf470391.1920x1080.jpg?t=1573814634,https://cdn.akamai.steamstatic.com/steam/apps/715310/ss_0ba299302ee8c035828b85812adecb1d52296676.1920x1080.jpg?t=1573814634,https://cdn.akamai.steamstatic.com/steam/apps/715310/ss_c64cea0624ac1b60a134fbc48d2f070a5b2a9aaf.1920x1080.jpg?t=1573814634",
    "Slug": "urban-rivals",
    "Meta Title": "Urban Rivals: Oct 18, 2017, Acute Games and Full Overview",
    "Meta Description": "Looking for information on Urban Rivals? Check out the release date (Oct 18, 2017), developer insights from Acute Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Urban Rivals game - Steam 715310",
    "Canonical URL": "https://gusku.site/game/urban-rivals",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Urban Rivals\", \"description\": \"Looking for information on Urban Rivals? Check out the release date (Oct 18, 2017), developer insights from Acute Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 18, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Acute Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Acute Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/715310/header.jpg?t=1573814634\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}