{
    "AppID": 342910,
    "Name": "Vantage: Primitive Survival Game",
    "Release date": "Dec 2, 2021",
    "About the game": "You play a pre-historic caveman, your ultimate objective... to survive! Explore a massive seamless open world, forage for food, hunt animals, and use the complex, realistic crafting system to build new, better and stronger items. Work together with other players to form a community, form a village, and to cooperate and grow as a group! Vantage is a game I have been working on for many years now, and it is the game I have always wanted to play. Since it didn't exist, I decided to create it! So I hope you enjoy playing it as much as I enjoy creating it! Some examples of what you can do in the game: - Craft a large number of objects to help you survive. Everything from sharp stones, to campfires so you don't freeze at night, to primitive huts to live in! - Find wild plants, take their seeds and plant crops to become more self-sustaining. - Create some clothes to keep yourself warm and well protected by skinning dead animals and tanning the hides by going through a realistic primitive leather working process. - And much, much more! Realistic and complex crafting system - Vantage has a in-depth, well researched crafting system using the actual items you need to craft items in the real world. For example, if you wish to build a fire using a hand drill, you need to find the right stick to use as a spindle, create a piece of hearth wood, and forage for some tinder. Then if you are skillful enough, you can make your fire! Hardcore survival / player customization - Make sure you forage for that food or grow some crops, for when you die, your character is gone! But don't despair, when your characters die they earn 'player points' you can use to re-customize you next character by buying starting items and boosting your starting skills so you can try anew! Skill-based character progression with many professions - You can try to specialize in one of the many professions, or try to master them all! Some examples are hunting, fishing, leatherworking and farming. You can also become a master bone, wood, or stone maker to help other people's professions along. Work together with other players to make items faster and stronger. Interact with every item in the world - No more playing a game where trees and rocks are just fancy artwork! You can harvest wood from every tree, and pick up every rock you see! Custom game engine with a massive seamless world - The game uses a custom 3D game engine I created called VantEdit. It generates and renders massively sized worlds of any size I choose, and you get to explore them. Walk in a single direction and you will circumnavigate the globe with no loading screens. The game's current development state: What is completed (of course these will be constantly improved and updated): - The Game's engine: ( rendering/ seamless world mechanics etc ). I have refined the engine to be a great vessel in which to create the game. I have spent years on it and helps to give the game the feel it needed to have. - Game Play Mechanics: The game play system is fully implemented as intended, has been tested and is fully playable. Again this only means that the core elements have been completed and I am of course working on improving all aspects of the game. This includes UI framework, Crafting, Skills and Item design, etc... - Networking conversion: This took many years, but I am proud to say that the online version of the game is fully stable. The game now also supports offline servers (for playing single-player), and player hosted dedicated servers that can be publicly displayed to all players around the world. - The Game's Editor tools: Though this is not currently available to players yet, the game's editor is designed to add in new crafts, items and skills easily into the game, as I develop the game I add in new skills, new items, and new crafts into the game. Even though I call this a primitive survival game, I plan to continue to add new content to the game constantly! What does this mean? Well at a certain point I will add in archery, more complex farming mechanics, more building types etc... What will be added in the near future: - PvP: Once the game has been sufficiently tested, I will be finishing the PvP aspect of the game. - More server hosting options: Players who wish to host servers will be able to customize their servers to more specific needs and preferences (making hardcore-only servers, etc...) - Access to VantEdit world editor: Players will be able to host servers with their own procedural generated worlds. They will have the ability to create nearly any size world with the ability to change temperatures, land and continent formations, and much more. This functionality will be later in development, most likely after the full launch. What can be improved: - Artwork: Many of the graphics you see in game are my own 'programmer art', simple yet useful art I create in a short amount of time. There are works of art done by professionals in the industry as well however. One goal of hopefully getting the game into Early Access is to hire back some of these artists to get the artwork more professional. Future Plans for the Game The content I can continue to add will never stop! I will run out of primitive technologies and keep moving forward, one item, craft, or skill at a time. So how far can I go? Will the game's technology get to the Roman Era? Medieval? Industrial Era? Modern Era? The game is a constantly evolving, ever changing universe that you exist in. It just all depends on people like you who I hope like, support, and enjoy the idea behind this game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/342910/header.jpg?t=1638913358",
    "Price": 14.99,
    "Developers": "Crystal Dragon",
    "Publishers": "Crystal Dragon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_0ad053217bdc005f0f3beb85c36f9147c87cd1a9.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_04819a43cc1b42c4b2b512ffe516a7ca5b5ff221.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_7c0f0065d737997bd55b07f52a761831934aa500.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_38a44c4951ed97d3a760ab4893d60907b3072178.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_9f7ba471268939068f726409a13dc5c4b15dff72.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_eb1f9ea6dffe8ce96268982b686d13bf501c48c4.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_f53c53e01f31474c0fe8e8d1ca7b5baf1b280659.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_fcf660f122fa625aaea252d7e19aa7f67e697e03.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_d1ddc29635a0c692a2a06bddb27325440882d535.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_e72517f8199507938b8b4080818bf2080db00966.1920x1080.jpg?t=1638913358,https://cdn.akamai.steamstatic.com/steam/apps/342910/ss_95ac972fb4aaeb90f24d442ec90e4927a4115c61.1920x1080.jpg?t=1638913358",
    "Slug": "vantage-primitive-survival-game",
    "Meta Title": "Vantage: Primitive Survival Game: Dec 2, 2021, Crystal Dr...",
    "Meta Description": "Looking for information on Vantage: Primitive Survival Game? Check out the release date (Dec 2, 2021), developer insights from Crystal Dragon, and a com...",
    "Alt Text Image": "Official header image for Vantage: Primitive Survival Game game - Steam 342910",
    "Canonical URL": "https://gusku.site/game/vantage-primitive-survival-game",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Vantage: Primitive Survival Game\", \"description\": \"Looking for information on Vantage: Primitive Survival Game? Check out the release date (Dec 2, 2021), developer insights from Crystal Dragon, and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Crystal Dragon\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Crystal Dragon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/342910/header.jpg?t=1638913358\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}