{
    "AppID": 1631120,
    "Name": "Void Warfare",
    "Release date": "Jun 6, 2021",
    "About the game": "The void is vast and dark. Sectors are patrolled by various vessels of Alien origins. Select a ship from the 43 available options, configure their weapon mounts and launch into instant action Space Vehicular Combat. - Choose from 5 Ship Lines; Ascik, Ertin, Zela, Ralloz or Ogin. The new Modra, Helino and Xeosi Decimators have also arrived for the particularly tough Modes. - Pick from 8 Ships per Line; Seeker, Fighter, Carrier, Freighter, Cruiser, Annihilator, Destroyer, or Behemoth. Each with their own different Hull, Shield, and Speed ratings. - Choose from 18 game modes, including; Small ships (1v4), Large Ships (1v4), Death Match (1v8): Available for each Ship Line. Wave Endurance (1 VS Each Ship Line in order. Defeat Ogin at the end to Win.) Planet Defense Station (1 VS The Planet Defense Station, while all of the Ascik line defends it, destroy the Station to Win.) Battle Royale (1 VS all 40 Ships divided into their 5 teams of 8 Ships in a Gun and Missile race to be the last Ship Flying.) - Choose between Projectile Laser Guns, Pulsed Beam Guns, Constant Beam Guns and Missiles to Configure your ship as you want it to be. - Complete Controller Remapping and Sensitivity change has been added. Controller as well as KB/Mouse all work from Play Game to Exit Game. - Unique Ship Hulls created from various modular ship parts. - Great fighting music and atmosphere from Action Music Mega Pack and Space For Unity. - Fluid Controls using Keyboard/Mouse or Controller as desired. Controls listed in the Pause Menu -&gt; Controls area for both Keyboard/Mouse and Controller. Remapping Controls and Sensitivity is accessed from the Pause Menu also. - HDR Enabled for brighter and more colorful tones. - Asteroid fields always are randomized in size and distance, creating a new playing scene each time you play a mode, even on restart from pause menu. - AI that are busy with trying to make you explode. Variable attack distances, excellent evasion behaviors and good obstacle avoidance lead to desperate struggles for survival. - No need to spend time unlocking everything, pick any ship and any Weapon type you desire to use from purchase and enjoy shooting down enemy ships while using anything from the smallest and weakest ship, to the largest and strongest ship. Challenge the Achievements for each Mode Complete as well as Milestone Achievements for kills using either Guns or Missiles.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1631120/header.jpg?t=1639112626",
    "Price": 9.99,
    "Developers": "XMX Studios",
    "Publishers": "XMX Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1631120/ss_58565f105b1ad7bab88077265f202d23d6c1b8ce.1920x1080.jpg?t=1639112626,https://cdn.akamai.steamstatic.com/steam/apps/1631120/ss_6daf74a53c7596d9301337e341ec603edfb47d09.1920x1080.jpg?t=1639112626,https://cdn.akamai.steamstatic.com/steam/apps/1631120/ss_dc1c1ef573329eedca54be1b583ed2e928a2d47a.1920x1080.jpg?t=1639112626,https://cdn.akamai.steamstatic.com/steam/apps/1631120/ss_f36c294b817966ecb6e13ec3fb8aae60774afba3.1920x1080.jpg?t=1639112626,https://cdn.akamai.steamstatic.com/steam/apps/1631120/ss_53e15b16f680c0b39c1e1f5e68e81a4c165f7479.1920x1080.jpg?t=1639112626",
    "Slug": "void-warfare",
    "Meta Title": "Void Warfare: Jun 6, 2021, XMX Studios and Full Overview",
    "Meta Description": "Looking for information on Void Warfare? Check out the release date (Jun 6, 2021), developer insights from XMX Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Void Warfare game - Steam 1631120",
    "Canonical URL": "https://gusku.site/game/void-warfare",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Void Warfare\", \"description\": \"Looking for information on Void Warfare? Check out the release date (Jun 6, 2021), developer insights from XMX Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"XMX Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XMX Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1631120/header.jpg?t=1639112626\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}