{
    "AppID": 1971770,
    "Name": "Wandering in space",
    "Release date": "Jun 30, 2022",
    "About the game": "Wandering in Space is a single-player virtual reality first-person shooter featuring role-playing and roguelike elements. The story is set in 2598 when the environment deteriorates to a critical point and the 'Doomsday Virus' either kills or mutates the infected. Humans establish the Federation and use the last remaining resources to build colonial satellites and spaceships scattered in Earth orbit. Surviving healthy humans are transferred to the space in batches to stay away from viruses and pollution, leaving the rest of humans on Earth, struggling amid disease and famine. Gameplay: You will play as a Federation soldier who lost memory. Wake up in a sealed space base and become involved in a conflict between factions of federal army. Use armament in the base to fight enemies. When death comes, escape from combat and revive in the base using the mysterious device of your armor. Collect materials in every run-through to unlock new weapons and abilities. Grow stronger and defeat enemies, but to find yourself facing greater challenges... Roguelike dungeon crawler: The final goal is to reach the top floor of the base before which there are five floors to be cleared, each containing different enemies and challenges. Every time you start a run-through, the layouts of floors will be randomly generated. Random upgrade rewards: On each floor, three buffs are presented based on the player’s equipment type. The player can only choose one on each floor. Buffs chosen together can be powerful, but they are lost upon death. Resource Gathering: As you battle along, you can collect all kinds of materials like plastic and metal that are scattered everywhere. You can store them in your backpack and take them back to the base. Using the dismantler at the base, you can dismantle the resources collected into different kinds of “materials”. They can be used for making and upgrading your weapon and armor. Upgrading your Stats/Attributes Use the collected and dismantled“materials” to upgrade the power and defense of your armor. This will increase your fighting capabilities. Weapon Upgrade: Use the collected and dismantled “materials” to unlock weapons like the electromagnetic pistol, electromagnetic rifle, shotgun, laser cannon, and electromagnetic bow. Different weapons will give you a different combat experience. Each weapon gives a different perception of impact. Before heading into battle, you can upgrade the strength, ammo capacity, and attack speed of your weapon. Ammo supply: Before leaving the base, you can convert the collected materials into ammo. Having sufficient ammo is beneficial in combat. Weapon Description Shotgun High firepower with high accuracy on the first shot. It is the best weapon to deal lethal damage to your enemies in close combat. It gives a strong perception of impact accompanied by some recoil, providing an excellent gaming experience. Electromagnetic Cannon A weapon with an extremely powerful penetration that can destroy enemies inside out. Enemies explode upon an impact. Aim and start your bloodthirsty massacre now! Special effect: Each weapon has a different feel that imitates the impact of a real gun. As you grow in this bloody massacre, the many different ways to kill zombies will become one of your entertainment. 1. Dismembering Limbs Shooting off the limbs of zombies to incapacitate them. 2. Headshot Headshot makes the heads of your enemies explode. Use the effect of some weapons to send zombies flying. Mutant zombie Normal zombies can only cause little damage at close range. Mutant zombies can attack and cause area-of-effect damage. It can even cause lethal damage if your armor is too weak. 1. Poison Zombie Spreads poisonous gas. Your physical attributes will be damaged within the range of the poisonous gas. Of course, if the poison zombie is damaged, it will go berserk! 2. Flamethrower Trooper They were once our companions but this “disaster” has made them completely lose their minds. Do not approach them as the flame they emit is not something a normal person can endure.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1971770/header.jpg?t=1658390406",
    "Price": 14.99,
    "Developers": "MOONSEER GAMES",
    "Publishers": "MOONSEER GAMES",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_819d867574de371478f2faccd926fb81814ac888.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_0c2cffa4f64194f88b62897178a04dfcf28cf667.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_73740763c7ae28934e7be74e8bdc364a96e94c60.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_4ebf6b41ad0abc4e26c0b374053fe5e754c3c179.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_31bcda3d9bce0ff4d75ce818866b387d5bddbea6.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_2282bba5ddb97474104198330f74d36142c050e4.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_f259571a872c7ebab5cfb2e554f5e2195807c627.1920x1080.jpg?t=1658390406,https://cdn.akamai.steamstatic.com/steam/apps/1971770/ss_bcf0b5a28b5c3a2f2d67ec1d7de61c94010b3486.1920x1080.jpg?t=1658390406",
    "Slug": "wandering-in-space",
    "Meta Title": "Wandering in space: Jun 30, 2022, MOONSEER GAMES and Full...",
    "Meta Description": "Looking for information on Wandering in space? Check out the release date (Jun 30, 2022), developer insights from MOONSEER GAMES, and a complete game su...",
    "Alt Text Image": "Official header image for Wandering in space game - Steam 1971770",
    "Canonical URL": "https://gusku.site/game/wandering-in-space",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Wandering in space\", \"description\": \"Looking for information on Wandering in space? Check out the release date (Jun 30, 2022), developer insights from MOONSEER GAMES, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MOONSEER GAMES\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MOONSEER GAMES\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1971770/header.jpg?t=1658390406\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}