{
    "AppID": 877200,
    "Name": "Zero Caliber VR",
    "Release date": "Nov 9, 2018",
    "About the game": "ABOUT THIS GAME Zero Caliber VR is a first-person tactical shooter developed by XREAL Games exclusively for premium Virtual Reality headsets. The story brings the player to a dystopian United States in the not too distant future where physics-based interaction combined with hyper realistic weapon handling and stunning graphics will make you feel like you’re physically part of the action. Fight either alone, or with your friends throughout the whole campaign, which is fully playable in Co-Op. Action-oriented story, gripping gunfights, realistic weapons with an on-the-fly swappable attachment system. Immersion like you’ve never felt before in a VR military shooter! Available for Arcades on SpringboardVR REALISTIC COMBAT SYSTEM - MOVE YOUR BODY TO FIGHT AND FIND COVER Handle, aim and reload your weapons with real-life movements! We modeled the in-game weapons based on their real-life counterparts paying extreme attention to detail. Each weapon has its unique reloading method that you have to learn and practice to fully master them. If you fancy explosions, just grab a grenade and throw it at the enemy. After you pulled the pin of course. Stay in the open for too long and you’re dead. Try to find cover instead, duck, crouch, sneak, peek around a corner, clear obstacles with real-life movements. Military combat isn’t all about shooting. Being aware of your surroundings, the terrain, and working together with your squadmates are all part of a successful mission. Don’t let your fellow soldiers down! REALISTIC WEAPONS - CUSTOMIZE YOUR FAVOURITE GUN Everyone has a unique playstyle. Is accuracy your thing? Put a laser sight on your assault rifle and take accurate shots in semi-automatic mode, or just grab a sniper rifle. Are you more of a shoot first, ask later type of person? Take a shotgun, or dual wield your machine guns in fully automatic firing mode. Be careful though, recoil can make your job really difficult! Combine your favourite gun with your favourite attachments on-the-fly to find out which variation suits you the most! THE STORY - DIVE INTO AN ENGAGING DYSTOPIAN ADVENTURE IN THE NOT TOO DISTANT FUTURE Water is life. Someone should’ve made that clear before humanity started poisoning Earth with microplastics. Now water is death. People are fighting for drinkable water, for survival. The military tried their best to keep order, but inevitably they got overwhelmed. That’s when mercenaries appeared.. then entire private armies.. and then when hope started to fade away came the religious cults. The most fearsome of all is a secretive organization worshipping Tlaloc, the aztec God of rain. The “Tlalokii”, as they call themselves. Their motto? “Join us or perish”. What is even worse, they know something that can change the fate of humanity. Be part of this action-packed, story-driven VR adventure where you fight alongside your fellow soldiers trying to keep order… or what’s left of it anyway. STUNNING GRAPHICS We place realism above anything else. Graphics and ambiance are crucial parts of this, that’s why we took extreme care in audio and visual design. Explorable open environment, stunning graphics, background noises, realistic weapon sound effects. A constantly developing military VR FPS experience that will surely make you forget that you are in a video game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/877200/header.jpg?t=1655234607",
    "Price": 24.99,
    "Developers": "XREAL Games",
    "Publishers": "XREAL Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_d938647dd9d6d053e7bb435631fc9828e14646fb.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_83d3d2569102c4e45ab9f47108a6aeab4f1997a6.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_880310c3046acabd36c85e01daa1b24b0e8a0e23.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_08bc5e1a8df65c6194454ab973bf5fc09c5d6dc1.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_0d93d36e5f545f1ce3e2d89b990aecf1a92d22bd.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_26d8149fa566f14ff9c7e06f0bf4be734d3586e2.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_ad677e5149876126fa8d571a1985ad5ccce53e2f.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_a5b5cfd8e643dcbb28264a8341bbedeb43ca6f37.1920x1080.jpg?t=1655234607,https://cdn.akamai.steamstatic.com/steam/apps/877200/ss_322ddfbd015e1f80df139ad19d5a4ff4b611826a.1920x1080.jpg?t=1655234607",
    "Slug": "zero-caliber-vr",
    "Meta Title": "Zero Caliber VR: Nov 9, 2018, XREAL Games and Full Overview",
    "Meta Description": "Looking for information on Zero Caliber VR? Check out the release date (Nov 9, 2018), developer insights from XREAL Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Zero Caliber VR game - Steam 877200",
    "Canonical URL": "https://gusku.site/game/zero-caliber-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Zero Caliber VR\", \"description\": \"Looking for information on Zero Caliber VR? Check out the release date (Nov 9, 2018), developer insights from XREAL Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"XREAL Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"XREAL Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/877200/header.jpg?t=1655234607\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}