{
    "AppID": 679100,
    "Name": "Aequitas Orbis",
    "Release date": "Nov 2, 2017",
    "About the game": "Gravity is fun! Aequitas Orbis is a 2D space game where players pilot their spaceships through gravity fields and challenge each other in various disciplines. From last man standing to capture the flags, from cooperative to conquest mode. The game allows for up to 4 players in local games (split screen) and up to 8 players in online games. The game also allows you to create custom levels to play with friends via the built-in level editor. Challenge your friends, save the planet, bring justice back to the orbit! Highlights Fast-paced, 2D, skill-based shooter game with an innovative gameplay. Local split screen multiplayer (up to 4 players). Online/LAN multiplayer (up to 8 players). 5 different game modes. Bundled editor that allows you to create custom maps. Windows/Mac/Linux support. Innovative Gameplay In Aequitas Orbis your spaceship is in a realistic 2D gravitational space, where planets and moon pulls you towards them. You can, of course, achieve stable orbits like satellites do around Earth, or you can jump from one planet to another like space agencies' probes does. In this environment, the player is challenged with different tasks, based on the game mode: In single player the goal is to destroy all the asteroids floating around the space before they collide with a planet In cooperative mode the goal is the same, but you'll be able to play with friends and you'll have to survive endless wave of asteroids In deathmatch mode you'll have to destroy other players to reach a certain score and win. This mode is playable in teams (eg. 2vs2, 3vs3, etc) In capture the flag mode each team will have a planet assigned, and a flag spawning around it, to goal is to steal the enemy flag and bring it back to your own In conquest mode, some planets will be conquerable, take a stable low orbit around it, and you'll start capturing it. Once a planet it's capture it'll start generating points for your team. But be careful, planets can be captured back the same way! Maneuvering in space is hard and requires some time to get used to it, but anyone can master it! A hint? Try to think about where you want to be 5 seconds from now instead of trying to go there now.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/679100/header.jpg?t=1514574824",
    "Price": 9.99,
    "Developers": "Ludi Dorici",
    "Publishers": "Ludi Dorici",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_b837606715dc8dbcda8592664612e566b2cd993e.1920x1080.jpg?t=1514574824,https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_7846ba711ebb57537f17ccdef1f93797dda13e59.1920x1080.jpg?t=1514574824,https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_6825bb9caed905fbf5a46a699048d8861b1c7e64.1920x1080.jpg?t=1514574824,https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_4a294009d7ab993db5fd4843e5e8a1080b8a93f0.1920x1080.jpg?t=1514574824,https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_01adbcd30394d42b17153b544254bb1af4dc9c59.1920x1080.jpg?t=1514574824,https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_fadfa9a6acf0500ae9096906344097343db1821c.1920x1080.jpg?t=1514574824,https://cdn.akamai.steamstatic.com/steam/apps/679100/ss_5daed5b9664e48a479426aa0427a2fec2e96fd58.1920x1080.jpg?t=1514574824",
    "Slug": "aequitas-orbis",
    "Meta Title": "Aequitas Orbis: Nov 2, 2017, Ludi Dorici and Full Overview",
    "Meta Description": "Looking for information on Aequitas Orbis? Check out the release date (Nov 2, 2017), developer insights from Ludi Dorici, and a complete game summary.",
    "Alt Text Image": "Official header image for Aequitas Orbis game - Steam 679100",
    "Canonical URL": "https://gusku.site/game/aequitas-orbis",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Aequitas Orbis\", \"description\": \"Looking for information on Aequitas Orbis? Check out the release date (Nov 2, 2017), developer insights from Ludi Dorici, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Ludi Dorici\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ludi Dorici\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/679100/header.jpg?t=1514574824\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}