{
    "AppID": 354380,
    "Name": "Assassin’s Creed® Chronicles: China",
    "Release date": "Apr 21, 2015",
    "About the game": "Description Follow three legendary Assassins on journeys of Revenge, Retribution and Redemption A thrilling new saga in the Assassin’s Creed Universe, Assassin’s Creed Chronicles take players to three distinct civilizations and time periods throughout history: the start of the Ming Dynasty crumble, the Sikh Empire going at war in India and the aftermath of Red October revolution. Designed for masters of stealth who share a passion for rewriting history with games, Assassin’s Creed Chronicles let players embody Assassins Shao Jun, Arbaaz Mir, and Nikolaï Orelov in a 2.5D reimagining of the Assassin’s Creed universe. Slay from the shadows, master the art of parkour, and take the leap of faith in a collection of stunning, living paintings The Chinese Chronicle The first entry in the Assassin’s Creed Chronicles saga takes place in China, 1526, as the Ming dynasty starts to crumble. You embody Shao Jun, the last remaining Assassin of the Chinese Brotherhood, returning to her homeland with a vendetta. Newly trained by the legendary Ezio Auditore, she is hell-bent to exact vengeance and restore her fallen brotherhood. Features Witness an empire crumble Travel across China and its legendary landmarks. Stalk enemies from the roofs of the Forbidden City, hide in the shadows of the Great Wall, meet iconic historical figures and discover this Great Empire. Immerse yourself in a unique art direction Brought to life by fusing the essence of Chinese 16th century traditional brush strokes with more contemporary, impressionistic styles, Shao Jun’s adventure will keep you awed in an evocative and truly living painting. Stealth takes a new dimension Assassin’s Creed Chronicles brings the thrill of being a master Assassin into 2.5D. Scout, sneak and hide to avoid detection. Fool enemies using whistles and disguises. Find your target, kill and escape. Experience fast &amp; fluid “Assault Course” As in every Assassin’s Creed experience, freedom of movement is essential. Whether you’re running from danger, scaling obstacles, or climbing stealthily, you will feel that you really can do anything. Shao Jun’s arsenal is in your hands Should you fail to go undetected, you can always takeout your enemies with style using Shao Jun’s empowering combat arsenal: close-combat martial arts, a powerful Kian Sword and her unique hidden shoe blade. Navigate multiple planes Switch between fore, mid, and background environments and choose different paths according to your needs. Open new pathways, complete side missions, grab hidden collectibles, or take the quickest path to your target",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/354380/header.jpg?t=1532007231",
    "Price": 9.99,
    "Developers": "Climax Studios",
    "Publishers": "Ubisoft Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/354380/ss_b3754196707971b0d5599f34e5a8dad904472439.1920x1080.jpg?t=1532007231,https://cdn.akamai.steamstatic.com/steam/apps/354380/ss_badfb639d10c13783cf18c1889ba7adb65a335c5.1920x1080.jpg?t=1532007231,https://cdn.akamai.steamstatic.com/steam/apps/354380/ss_c6082857f824bc1d04571c38031912bbb075f148.1920x1080.jpg?t=1532007231,https://cdn.akamai.steamstatic.com/steam/apps/354380/ss_365a3104ca9ece57bbeeb7dfc95b5891f93eab7a.1920x1080.jpg?t=1532007231,https://cdn.akamai.steamstatic.com/steam/apps/354380/ss_eaf976ffbb4db92a061cfb6d7e18253766ee43b5.1920x1080.jpg?t=1532007231,https://cdn.akamai.steamstatic.com/steam/apps/354380/ss_a76cf6c3dd62874bd96a273d2b007687676b0901.1920x1080.jpg?t=1532007231",
    "Slug": "assassins-creed-chronicles-china",
    "Meta Title": "Assassin’s Creed® Chronicles: China: Apr 21, 2015, Climax...",
    "Meta Description": "Looking for information on Assassin’s Creed® Chronicles: China? Check out the release date (Apr 21, 2015), developer insights from Climax Studios, and a...",
    "Alt Text Image": "Official header image for Assassin’s Creed® Chronicles: China game - Steam 354380",
    "Canonical URL": "https://gusku.site/game/assassins-creed-chronicles-china",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Assassin\\u2019s Creed\\u00ae Chronicles: China\", \"description\": \"Looking for information on Assassin\\u2019s Creed\\u00ae Chronicles: China? Check out the release date (Apr 21, 2015), developer insights from Climax Studios, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 21, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"Climax Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Ubisoft Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/354380/header.jpg?t=1532007231\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}