{
    "AppID": 507080,
    "Name": "Baseball Mogul Diamond",
    "Release date": "Aug 9, 2016",
    "About the game": "Baseball Mogul Diamond New Features In Baseball Mogul Diamond Compensatory Draft Picks (for teams that lose players to Free Agency) Improved Player Aging, including mid-career position changes Improved Manager AI (especially pitcher usage and defensive replacements) Improved General Manager AI (roster management and player contracts) Improved Trade AI (Artificial Intelligence) Trades improve teams at specific positions, not just overall talent Much greater News Story and Scouting Report variety Improved historical and fictional season schedules Faster simulation engine More minor league and lefty-righty stats for active and historical players Improved output for Head-To-Head Records More realistic player fatigue and injuries Improved simulation accuracy and stability e.g. stolen base numbers no longer decline over time Many bug fixes to prevent slowdowns and hangs Problems fixed with Baseball Mogul Encyclopedia output Fixed errors found in some historical All-Time Leader lists Plus... Build Your Own Expansion Team Stat-based scouting Individual strategy settings for each player Includes individual pitch count limits Lefty-righty batting and pitching stats Includes every season back to 1951 Improved General Manager AI. Mimics real-life trade and contract data Scouting Report: copy player stats to clipboard with a single-click Updated minor league stats More than 1.2 million lines of data More realistic high school, college and minor league stats Improved Player Award AI (Gold Gloves, etc.) Improved Pitch Tracking Records velocity, break, location and result of every pitch Accurate head-to-head stats for every batter-pitcher matchup More accurate heat maps in player Scouting Reports ... and smaller improvements such as these: Free agents available after expansion draft, to help complete your major and minor league rosters. Bug fixed when calculating Defensive Runs New stats and search options in 'Sortable Stats' screen Bug fixed with setting pitch count limits for individual pitchers Ground balls to right side now advance runner on 2B more consistently New directory created for each saved game Prevents conflicts with box score and encyclopedia output Updates for Opening Day of the 2015 Season Updated rosters for every team Over 2100 active players Includes more than 45 minor leaguers per organization Complete major league and minor league stats through 2014 Actual real-life 2015 season schedule (all 2430 games) Backwards Compatibility Baseball Mogul Diamond automatically loads databases from previous versions of Baseball Mogul. Note: Advanced Roster Rules Please note that Baseball Mogul Diamond does not include support for all of the advanced roster rules (such as enforcing a 40-man roster for each team or conducting the Rule 5 Draft). However, Qualifying Offers and Free Agent Compensation (via draft picks awarded in a 'sandwich round') were added.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/507080/header.jpg?t=1470881908",
    "Price": 11.99,
    "Developers": "Sports Mogul, Inc.",
    "Publishers": "Sports Mogul, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_f101dc0eb02500d80c5da258f26f4aeb551cc0db.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_2a5e7c55ac9db95ae6a1a4ced1aad1a283a6ce7d.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_a3531a2d4e48ac90b9eb92cd297fcfe4cb469a96.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_219436ffa2fa1548083dd046857090819619ae32.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_b2326d142aef4f067d9c3b9e92c5ef0b5a90188f.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_07aeddbd2e9d83f89e1b44744471fbbb6f2839c0.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_5faddea50b81563a953865a38e27f2e8f56d94d2.1920x1080.jpg?t=1470881908,https://cdn.akamai.steamstatic.com/steam/apps/507080/ss_32dbd88e101e1cdab3c97f67165d6a4bc01996c3.1920x1080.jpg?t=1470881908",
    "Slug": "baseball-mogul-diamond",
    "Meta Title": "Baseball Mogul Diamond: Aug 9, 2016, Sports Mogul, Inc. a...",
    "Meta Description": "Looking for information on Baseball Mogul Diamond? Check out the release date (Aug 9, 2016), developer insights from Sports Mogul, Inc., and a complete ...",
    "Alt Text Image": "Official header image for Baseball Mogul Diamond game - Steam 507080",
    "Canonical URL": "https://gusku.site/game/baseball-mogul-diamond",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Baseball Mogul Diamond\", \"description\": \"Looking for information on Baseball Mogul Diamond? Check out the release date (Aug 9, 2016), developer insights from Sports Mogul, Inc., and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 9, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Sports Mogul, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sports Mogul, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/507080/header.jpg?t=1470881908\", \"offers\": {\"@type\": \"Offer\", \"price\": 11.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}