{
    "AppID": 433950,
    "Name": "Bit Blaster XL",
    "Release date": "Jan 22, 2016",
    "About the game": "I have been learning to make games by making games and love creating small-yet-solid arcade games with simple mechanics. Please expect 'Bit Blaster XL' to be a small, re-playable, arcade score-chaser game where the only goals are to constantly beat your previous score and unlock some extra ships. I greatly appreciate feedback and will do my best to ensure support for my games. Please contact me through Twitter, My Website, or the forums if you encounter something wrong with the game, something misleading on the store page, or you just want to say hello. Thank you for taking a moment to read this; I really hope you enjoy playing my game. Adam Nickerson - Adamvision Studios Your ship can not stop moving; so you must turn it left and right and use your boost/brake to keep from crashing into an ever increasing amount of enemies. Your ship is always shooting, so make sure to pick up more ammo and the wide variety of awesome power ups and pick ups to help you survive longer. Get the highest score you can while collecting coins to buy more ships that are faster, shoot faster, or have more shields. A throwback to the classic quarter eating arcade games of the 80's. Bit Blaster XL is a retro styled, addictive, and fast paced arcade shoot 'em up! Easy to learn, simple arcade style Controls to turn your ship, boost, and brake. Keyboard + Gamepad Support. (not a twin stick shooter) A variety of wicked Power ups like Spread Shot, Heat seekers, Laser, Blast Shot and much more to assist your survival. Screen clearing Bombs, Ship Shields and Boost Pickups to help you survive longer. Collect coins to unlock new ships with unique attributes to give you an edge in the Leader board. Endless survival (infinite) score chasing game play with a classic 'bullet hell'-like arcade style. Steam achievements, leader board &amp; Trading cards! (with emoticons &amp; profile wallpapers) Steam Cloud Support Totally rad and ridiculously basic retro pixel Graphics. Now available in English, Russian, German, Italian, Portuguese, French, Simplified Chinese, and Spanish Featuring gameplay directly inspired by some of my favorites, such as; Luftrausers, Asteroids, Space Invaders, Galaxian and Geometry Wars. Unique chip tune songs for each ship by Spiff Tune. (Soundtrack available as free DLC) An alternate Manual Fire mode for those that want a different experience. The in game audio/SFX was provided by my mouth and some royalty free SFX from FreeSFX. The soundtrack is by the artist 'Spiff Tune' and is available as FREE DLC.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/433950/header.jpg?t=1638945180",
    "Price": 0.99,
    "Developers": "Adamvision Studios",
    "Publishers": "Adamvision Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_146eab90781845507ac9e197496135886bbd8945.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_ae2ce20d9f3e61625a392d0fbddd2b1f7e845a40.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_f187b1a65b4e35e3d8aa4c7a356d5991ad40c410.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_68942355702bba221b4585798869e9f68397b5cf.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_85290b2a6abda03fadba7479901ed1233f1d1163.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_d07995f9d535f27f5f0b62bb47b7b95b434e6446.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_5f27213394b98cb81289596d403a8ff7475d004d.1920x1080.jpg?t=1638945180,https://cdn.akamai.steamstatic.com/steam/apps/433950/ss_e8c8544aa0b269766e55fc0e46ec3fe0fa7a78a6.1920x1080.jpg?t=1638945180",
    "Slug": "bit-blaster-xl",
    "Meta Title": "Bit Blaster XL: Jan 22, 2016, Adamvision Studios and Full...",
    "Meta Description": "Looking for information on Bit Blaster XL? Check out the release date (Jan 22, 2016), developer insights from Adamvision Studios, and a complete game su...",
    "Alt Text Image": "Official header image for Bit Blaster XL game - Steam 433950",
    "Canonical URL": "https://gusku.site/game/bit-blaster-xl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bit Blaster XL\", \"description\": \"Looking for information on Bit Blaster XL? Check out the release date (Jan 22, 2016), developer insights from Adamvision Studios, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 22, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adamvision Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adamvision Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/433950/header.jpg?t=1638945180\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}