{
    "AppID": 1081470,
    "Name": "Born of Fire",
    "Release date": "Sep 4, 2019",
    "About the game": "The free trial version of Born of Fire includes the fully integrated Roguelike tower mode, card upgrade system, chest system, and the exciting worldwide 1 vs 1 match mode. Initially, there will be two heroes with different features: Commander and Mage. Game Features: ● Heroes won’t watch the battle from the sidelines but will be right in the battle. However, you will lose if your hero dies. ● Innovative time sequence battles. Every hero and creature has a “Speed” stat. The faster the speed, the faster the movement rate. ● Design your battle formation. Remember to put your warriors in the front row and protect the back row with archers and mages. ● Make use of your hero’s rage spells and counter cards to surprise your opponent or save yourself in an emergency. ●The classic tower mode has random enemies, tasks, and rewards. ● Summon powerful creatures to fight for you in the pub. ● You can battle players from around the world in Match mode and win victory chests. ● Continue to collect cards and upgrade their levels. ● You will get stronger every time you climb the tower. Trial Version Content: ● The trial version will include a basic tower mode. The current features and gameplay still have a lot that needs to be added. The game will be updated weekly. ● You can play the training mode any time you like. You can get chests by winning. Cards you get from chests can used to build a deck. ● Choose match mode to find an online match. If another player is matching at the same time, you can duel them. ● Getting multiple copies of cards can be turned into experience. You can upgrade once you get enough experience. Card levels will upgrade too in tower mode. You can always play the free trial version, get new cards and upgrade them. We will update weekly to add new cards and features until early access. Please feel free to play the game and leave any suggestions in our community to help us improve the game. Thank you.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1081470/header.jpg?t=1579247985",
    "Price": 0.0,
    "Developers": "Leaf Boat Studio",
    "Publishers": "Leaf Boat Studio",
    "Screenshots": NaN,
    "Slug": "born-of-fire",
    "Meta Title": "Born of Fire: Sep 4, 2019, Leaf Boat Studio and Full Over...",
    "Meta Description": "Looking for information on Born of Fire? Check out the release date (Sep 4, 2019), developer insights from Leaf Boat Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Born of Fire game - Steam 1081470",
    "Canonical URL": "https://gusku.site/game/born-of-fire",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Born of Fire\", \"description\": \"Looking for information on Born of Fire? Check out the release date (Sep 4, 2019), developer insights from Leaf Boat Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 4, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Leaf Boat Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Leaf Boat Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1081470/header.jpg?t=1579247985\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}