{
    "AppID": 1929380,
    "Name": "Caverns of Evil",
    "Release date": "Apr 2, 2022",
    "About the game": "Caverns of Evil is an action roguelite that plays like a '90s first-person shooter, though with a few innovations and quirks of its own. Fight through ever-increasing hordes of monsters while the gathering ever more powerful weapons you'll need to survive. This is a simple game, designed for some good old-fashioned violent fun. Play as long as you like and can stay alive, there are always more levels; there is no final level, new levels will always be generated when you finish one, so you can play until you die and want to quit. Backstory 'You remember a time before the world changed, a time of strange magics like horseless carriages, moving painting, and little boxes that could house whole worlds. Then they came and reality shifted, the old magics began to disappear to replaced by ones now that now seem familiar. A little of the old world remains, like your strange black wand that shoots out pieces of hot lead -- and has gotten you out of some tight situation...but will it be enough to save you from the monstrous hoards you now face?' Gameplay Each level is a new and unique, generated once and never seen before or again -- unless you supply a custom seed, in which case you can use that seed as many times as you like to get the same sequence of levels. Caverns of Evil does not use pre-fabricated rooms or level sections, but generates the layout of geometry of each room and level, creating truly unique rooms on every play. Using the standard WASD+mouse controller everyone is familiar with, or controller if you prefer, navigate the levels, shoot (or slash) the monsters, and look for weapons, armor, ammo, and health potions you'll need to stay alive and slaughter the hordes of deadly monsters that long to murder you. Keep track of the dual health system with regenerating shock damage and non-regenerating wound damage; damages can be quite high for shock, so be warned that death can come quickly to the reckless or unfortunate. That means permadeath; dying ends the game, taking you back to the start menu. There is a stamina system, but it is very forgiving, only becoming an issue if you spam jumps or melee attacks -- or are hit by a stamina draining enemy. Controls WASD to move Mouse to look / rotate Space to Jump Hold Shift to sprint Left Mouse Button to use held item / shoot Right Mouse Button to interact with object in the world Use Q and E, or Mouse Wheel to cycle items Use the number keys to jump to an item Escape to pause and optionally quit the current game F2 to take a screenshot Items can be picked up by either walking over them or by right-clicking them with the mouse (or left trigger). Picking up gun class items (those that use ammo) adds ammo even if you already have the weapon. Picking up wands or armor replaces the current item (if any) with the new one. Picking up swords upgrades you sword to the one picked up; swords of a given tier can only be picked up once and swords cannot be downgraded.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1929380/header.jpg?t=1652809935",
    "Price": 0.99,
    "Developers": "Jared Blackburn",
    "Publishers": "Jared Blackburn",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_16a05a7d62a371216133ff81ae007c70d8524689.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_d69ce9452a63d05c7132fb14dd267fd217be9f6b.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_be0d18f46acc23504e7761c26bdaf154f07cedf0.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_a0febdc66cf82ea2529653cf687c4c960af183ac.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_dea96299151bf834c47fd15871f3618a53b27608.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_cfaff617b1a683e223e1188b66680f484dadb237.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_5eeeb19a3cba80b1395b8bf49abdcec3482367fa.1920x1080.jpg?t=1652809935,https://cdn.akamai.steamstatic.com/steam/apps/1929380/ss_443510375cb3ae01e916ad662562c874f755b6a5.1920x1080.jpg?t=1652809935",
    "Slug": "caverns-of-evil",
    "Meta Title": "Caverns of Evil: Apr 2, 2022, Jared Blackburn and Full Ov...",
    "Meta Description": "Looking for information on Caverns of Evil? Check out the release date (Apr 2, 2022), developer insights from Jared Blackburn, and a complete game summary.",
    "Alt Text Image": "Official header image for Caverns of Evil game - Steam 1929380",
    "Canonical URL": "https://gusku.site/game/caverns-of-evil",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Caverns of Evil\", \"description\": \"Looking for information on Caverns of Evil? Check out the release date (Apr 2, 2022), developer insights from Jared Blackburn, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Jared Blackburn\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Jared Blackburn\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1929380/header.jpg?t=1652809935\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}