{
    "AppID": 1000640,
    "Name": "Clam Man",
    "Release date": "May 23, 2019",
    "About the game": "Disclaimer! Clam Man is a game built around jokes and a strange, absurd narrative! It has weird characters, tons of puns, and a handful of puzzles; but the focus of the game is definitely dialogue! Examining the world, talking to characters and taking it easy: If that sounds like your thing, this might just be the game for you! STORY Clam Man is the story of the Clam Man. Intriguing, isn't it? Yes, it's true - he is a clam and yet also a man. This is not a topic of debate, it is fact. We've confirmed it while working on this game. Using science. 'He certainly is a clam man.' - Playtester Thank You, Playtester - we couldn't agree more. But to be more specific: This is the story of a man, recently promoted to junior sales representative, enjoying the comforts and leisure of lower-mid-level office work. However, things suddenly take a turn for the worse, and the Clam Man is cast into an adventure full of danger, suspicion, and mystery. Join him, as he unravels the conspiracy behind the tragic event that befalls him, and fight to restore CLAMMY JUSTICE to the world of Snacky Bay. FEATURES A story full of twists and turns and a huge amount of strange jokes! More than 20 unique and strange characters to interact with! (I really like the jellyfish personally) A spectacular original soundtrack! Lots of plants Umm Phone calls! Puzzles! Knots! The most evil bad guy in the history of evil bad guys Anime fight scene! Our boys in blue! And of course, a duck. WHOAH WHOAH WHOAH ENOUGH WITH THE JOKES What is all this about even Clam Man is a point'n'click adventure game, with an emphasis on story rather than puzzles! We wanted to create a game focused on the parts we loved about old school adventure games - the story and the jokes. It's a simple, entertaining game where you explore the world and interact with it's inhabitants. Oh, and we did throw a few puzzles in here and there, too. IS THIS FOR ME? I don't know you, but I'm sure you're a pretty cool person. I'll just ask a couple questions to figure that out: Do you enjoy story-driven games? Do you enjoy absurd and strange comedy? Do you want to relax and play a game where the primary objective is to make you laugh at said strange comedy? Have you got a thing for ridiculous underwater settings and weird, nonsensical stories? well yeah you know in that case it's definitely for you Oh and hey! Why not check out the soundtrack as well? Much love, //Team Clam",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1000640/header.jpg?t=1591384349",
    "Price": 9.99,
    "Developers": "Team Clam",
    "Publishers": "Team Clam",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1000640/ss_c3da30ba7dda2425dcbd2d7c780ad5648fb1e20e.1920x1080.jpg?t=1591384349,https://cdn.akamai.steamstatic.com/steam/apps/1000640/ss_4231c256ac86a7e034ddee53c5cc948ad45f73b4.1920x1080.jpg?t=1591384349,https://cdn.akamai.steamstatic.com/steam/apps/1000640/ss_27b6bce705ed40dcb0d8c36c5beec5f043637072.1920x1080.jpg?t=1591384349,https://cdn.akamai.steamstatic.com/steam/apps/1000640/ss_c05abba18805a1a0e30de7d59ac0ead28cce566b.1920x1080.jpg?t=1591384349,https://cdn.akamai.steamstatic.com/steam/apps/1000640/ss_0f8c4cf69543ea947e110fc34b3f2e472b9fa38e.1920x1080.jpg?t=1591384349,https://cdn.akamai.steamstatic.com/steam/apps/1000640/ss_7eedf6a420860f55d9f922102661acfde334b87b.1920x1080.jpg?t=1591384349",
    "Slug": "clam-man",
    "Meta Title": "Clam Man: May 23, 2019, Team Clam and Full Overview",
    "Meta Description": "Looking for information on Clam Man? Check out the release date (May 23, 2019), developer insights from Team Clam, and a complete game summary.",
    "Alt Text Image": "Official header image for Clam Man game - Steam 1000640",
    "Canonical URL": "https://gusku.site/game/clam-man",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Clam Man\", \"description\": \"Looking for information on Clam Man? Check out the release date (May 23, 2019), developer insights from Team Clam, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 23, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Team Clam\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Team Clam\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1000640/header.jpg?t=1591384349\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}