{
    "AppID": 1528120,
    "Name": "ComPressure",
    "Release date": "May 3, 2021",
    "About the game": "For too long have we relied on cogs and gears to control our lives. Welcome to a new age, the age of steam! The simple valve, which controls the flow of steam based on the pressure on it's control ports, is the only component that is needed to revolutionise our control over machines. From simple switches, to adders, tabulators, and eventually entire computers. Your companions will guide you through the discovery of steam based computation. A word of warning though. This game is hard. One can not discover an entire new field of science alone. Which is why an Academy of steam engineers (Discord) is available to you. A friendly community who are happy to assist you and share their latest steam innovations. Each solved challenge yields another useful element that can be used in future designs. Poor solutions in previous stages make poor components to use further on, so you will be coming back to old designs, tuning and optimising them with things you have learned. The Game The following is a quick walkthrough the game dynamics. It all starts with pipes. Left click to start a pipe and click each time to extend it in the direction of the mouse pointer. Right click to end. When placing more pipes, they can either cross, or join existing pipes. To join, extend the pipe in the direction of an existing pipe. To delete, press or hold right mouse button. In the edit menu (one with the spanner) you can select to place a steam inlet. It is also available by pressing Tab twice. There are buttons to rotate the direction before placing, but you can also use Q and E on the keyboard. Then place with the left mouse button. The numbers appearing on the pipe connections show the current pressure, from 100 when connected to a steam inlet, to 0 at any uncapped pipe end. The last component is the valve. If the pressure on the + side of the valve is higher than on the - side, the valve becomes open and lets steam pass through the valve. If the + and - sides are at the same pressure, of the - side is higher, then the valve is closed and does not allow steam through. The design is continually examined with a series of tests. If the output is within 5% of the test target, a score is given depending on how accurate the output is. This ranges from 100 for spot on to 0 when 5% off. Passing all tests with any score above 0 unlocks the next level. To focus on a specific test, click the test to enter 'play one' mode which repeats one test. Each completed design can be used as a component in future designs.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1528120/header.jpg?t=1650396300",
    "Price": 4.99,
    "Developers": "Charlie Brej",
    "Publishers": "Charlie Brej",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1528120/ss_f4eaa9a3e514e224d2af325e09bbcee902acb3a2.1920x1080.jpg?t=1650396300,https://cdn.akamai.steamstatic.com/steam/apps/1528120/ss_9c5e9b872695a37374850d4348a9220295fa5365.1920x1080.jpg?t=1650396300,https://cdn.akamai.steamstatic.com/steam/apps/1528120/ss_0ddbf602ca925e46a5bf0010c8c69b04fd41aedb.1920x1080.jpg?t=1650396300,https://cdn.akamai.steamstatic.com/steam/apps/1528120/ss_cf26f46ed731652912f72d74d53ed512cfea7930.1920x1080.jpg?t=1650396300,https://cdn.akamai.steamstatic.com/steam/apps/1528120/ss_91159bbbd101087717845259cf55339379baa086.1920x1080.jpg?t=1650396300,https://cdn.akamai.steamstatic.com/steam/apps/1528120/ss_976c0f5f94877a11c2b248faebcfe5c71f9f80e8.1920x1080.jpg?t=1650396300",
    "Slug": "compressure",
    "Meta Title": "ComPressure: May 3, 2021, Charlie Brej and Full Overview",
    "Meta Description": "Looking for information on ComPressure? Check out the release date (May 3, 2021), developer insights from Charlie Brej, and a complete game summary.",
    "Alt Text Image": "Official header image for ComPressure game - Steam 1528120",
    "Canonical URL": "https://gusku.site/game/compressure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"ComPressure\", \"description\": \"Looking for information on ComPressure? Check out the release date (May 3, 2021), developer insights from Charlie Brej, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Charlie Brej\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Charlie Brej\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1528120/header.jpg?t=1650396300\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}