{
    "AppID": 1213450,
    "Name": "Craftica",
    "Release date": "Mar 26, 2020",
    "About the game": "Craftica: Building Your Wonderland Craftica is a creative sandbox game with ultra high degrees of freedom for building. It supports deformable voxels and subvoxels at multiple scales so that smooth objects can be built in realistic scales, and makes it possible to build very elegant architectures. Craftica provides a large number of electronic and mechanical as well as other related device items, allowing players to build sophisticated circuits and circuit-controlled electronic and mechanical devices. Players can even build vehicles, aircrafts, robots and computers etc. high-tech objects from items as basic as logical gates. Deformable Voxel and Subvoxels In Craftica the basic voxel is a full cube and the subvoxels are partial cubes with one or more corner chopped off. The voxels and subvoxels are deformable, and can be made more round or less round by hammer tools. The support of deformable voxels and subvoxels in Craftica makes it possible to create much smoother objects in this game than in other voxel-based sandbox games. Also the voxel and subvoxels in Craftica are supported at multiple size levels, so that fine structures can be represented at a scale comparable to the real world. As an example, Craftica has very good support for East Asian architectures, and includes a large number of standard structures with East Asian architecture styles. In Craftica, subvoxels are also used to smooth the procedurally generated terrain. And terrain and objects imported from Minecraft Schematic files are also smoothed using subvoxels. Smart Placement of Blocks and Items Craftica is designed to allow intuitive construction of objects using subvoxels, and supports consistent operations for placing basic blocks (voxels and subvoxels) and items. Craftica also supports rule-based placement. When an object item is being placed near another object, if there is a predefined rule to determine a proper placement for the object in relative the other, the rule will be used to calculate the proper placement location and orientation. In-Scene Crafting Item crafting in Craftica can be done in the scene, using formulas that are structural and intuitive. Device Items Craftica provides a number of standard mechanical and electronic device items that can be used to build complex circuit as well as machines that can be controlled by circuits. Circuits in this game emulates those in the real world with great simplifications. Like circuits in the real world, Craftica uses physical connection between components to construct functional circuits. These circuits are mainly powered by electric energy and driven by data exchanges. (See the documentation included in the game for more information) Village In Craftica worlds, some places are generated with villages. Each village is generated with a few houses and at least one workshop and one defensive fort or tower, and spawns with at least one warrior to defend the village. The relationship between a village and a player is characterized by affinity. Affinity can be zero, positive or negative, indicating a neutral, friendly or hostile relationship. The affinities between villages and player(s) are initialized randomly. Normally, there will be more neutral villages than friendly and hostile ones, and more friendly ones than hostile ones. Their actual percentages may vary according to game modes and difficulty levels. Trade When a positive affinity reaches certain levels, the player will have free access to some village structures and storages (different structures and storages may have different affinity thresholds). And when a negative affinity reaches a certain level, the village warrior will actively attack the player. Trading with villagers or defending the village against hostile mobs will improve the affinity between the player and the village. On the other hand, attacking villagers will deteriorate the affinity. Survival In survival mode, barbarians and other hostile mobs will be generated. They will attack the player and villages. The only way to survive is to fight back or run! Model Importing In addition to the creative and survival modes, Craftica supports an experimental development mode. In this mode, the player can import external models into the game worlds. The player can either choose a Minecraft Schematic file (currently only .schematic file is supported, .schem file will be supported the upcoming updates) to import when creating a new game in the development mode: Or import .obj 3D model files (importing Schematic files within a game will also be supported in the future) within a game in the development mode: P.S. If you don't see updates for this game, don't be alarmed, it is far from abandoned or dead. Developing this game is a game for me, there is too much fun in it, I don't see how I can get bored of it. However, it is a bit hard to work on it in full-time, since the sales from this game cannot sustain a full-time development. So I will have to engage in some other work to make a living, so the future updates might not be frequent or regular. Please understand that, thank you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1213450/header.jpg?t=1654829402",
    "Price": 4.89,
    "Developers": "NeoVoxel Studio",
    "Publishers": "NeoVoxel Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_56cdab7fabf37465d235bf9ddfdda9a56935b44d.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_1c794f9ed515612d912f67022e7b5baebdf8d887.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_464cd24a08c84d3f634506767a428727907ee2d0.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_ae2e79fa3cd14e81bbd6dcc7f486efe82e6778dc.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_8769efc157304baae690b15768416ba1364355eb.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_e5e54718b57c885a14d16f396663d919a850ee11.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_511fd95343409909db9bfc01eaf99cee73e1a8d3.1920x1080.jpg?t=1654829402,https://cdn.akamai.steamstatic.com/steam/apps/1213450/ss_75564a343c438b391935d3b3a06448170735787e.1920x1080.jpg?t=1654829402",
    "Slug": "craftica",
    "Meta Title": "Craftica: Mar 26, 2020, NeoVoxel Studio and Full Overview",
    "Meta Description": "Looking for information on Craftica? Check out the release date (Mar 26, 2020), developer insights from NeoVoxel Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Craftica game - Steam 1213450",
    "Canonical URL": "https://gusku.site/game/craftica",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Craftica\", \"description\": \"Looking for information on Craftica? Check out the release date (Mar 26, 2020), developer insights from NeoVoxel Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 26, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"NeoVoxel Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NeoVoxel Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1213450/header.jpg?t=1654829402\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.89, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}