{
    "AppID": 715010,
    "Name": "Diamo XL",
    "Release date": "Oct 13, 2017",
    "About the game": "This is an 'XL' version of my unreleased mobile game 'Diamo'. I have added/changed a variety of things to make it more suitable for the Steam platform. I have been learning to make games in my free time and love making small-yet-solid arcade games with simple mechanics. Please expect 'Diamo XL' to be a small, re-playable, arcade score-chaser game where the only basic goals are to constantly beat your previous score and unlock a handful of alternate player characters. I greatly appreciate feedback and will do my best to ensure support for my games. Please contact me through Twitter, My Website, or the forums if you encounter something wrong with the game, something misleading on the store page, or you just want to say hello. Thank you for taking a moment to read this; I really hope you enjoy playing my game. Adam Nickerson - Adamvision Studios Survive the constant onslaught of obstacles by moving your character to all five zones within the Diamond. Collect points before the enemies smash them and keep moving to keep your multiplier high. Fill in the four triangles to complete the Diamond and get bonus points. Simply holding any of the four directional buttons allows your player to move around the Diamonds zones at a high rate of speed, if you just tap the direction your player will move at half the speed. Use the keyboard's Arrow Keys, WASD, a controller's DPAD or Joystick, or even the mouse to click the zones. Easy to learn, simple controls on keyboard, controller or mouse An endless, fast paced and challenging arcade style game play that constantly gets harder Unlock a handful of unique characters to play as with different stats by completing certain tasks 'Close Call' system that awards extra points for close calls with obstacles. Score multiplier and various stat tracking that allows you to perfect your game. Steam Achievements, Leader board, and Trading cards (with emoticons &amp; profile wallpapers) Steam Cloud Support Perfect for playing a round while in Queue for another game :) The in game audio/SFX was provided by my mouth making noises into a crumby consumer mic, and some royalty free SFX from FreeSFX. In game song is Royalty Free Music from Bensound called 'Moose'",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/715010/header.jpg?t=1638944611",
    "Price": 0.99,
    "Developers": "Adamvision Studios",
    "Publishers": "Adamvision Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/715010/ss_da26647230ba71b121ed8c101b2440593826c1e9.1920x1080.jpg?t=1638944611,https://cdn.akamai.steamstatic.com/steam/apps/715010/ss_2f7980e427c815798484c76b830fb97b3d4978b4.1920x1080.jpg?t=1638944611,https://cdn.akamai.steamstatic.com/steam/apps/715010/ss_27dd9af46a6f5865e5807b4206124dfc273ec2f0.1920x1080.jpg?t=1638944611,https://cdn.akamai.steamstatic.com/steam/apps/715010/ss_87978d710fd9bd3cd6bea46b0d00a0b2566f3daf.1920x1080.jpg?t=1638944611,https://cdn.akamai.steamstatic.com/steam/apps/715010/ss_824d75ef4b974fee493d232ebf11dde4e3414840.1920x1080.jpg?t=1638944611",
    "Slug": "diamo-xl",
    "Meta Title": "Diamo XL: Oct 13, 2017, Adamvision Studios and Full Overview",
    "Meta Description": "Looking for information on Diamo XL? Check out the release date (Oct 13, 2017), developer insights from Adamvision Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Diamo XL game - Steam 715010",
    "Canonical URL": "https://gusku.site/game/diamo-xl",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Diamo XL\", \"description\": \"Looking for information on Diamo XL? Check out the release date (Oct 13, 2017), developer insights from Adamvision Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 13, 2017\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adamvision Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adamvision Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/715010/header.jpg?t=1638944611\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}