{
    "AppID": 511320,
    "Name": "Echoes of the Fey: The Fox's Trail",
    "Release date": "Aug 16, 2016",
    "About the game": "Echoes of the Fey: The Fox's Trail is an English-language visual novel that mixes a high fantasy setting with the mysteries and conspiracies of pulp detective fiction. Play as Sofya Rykov, a private investigator with a secret of her own: unstable magic powers she uses to solve her cases. In 'The Fox's Trail', Sofya is hired to track down a missing Leshin with connections to the Human resistance during the occupation. Investigate how you prefer, with over 100 choice points throughout the story. Some will improve your relationship with the characters. Others will provide you critical information. And some will change the fate of the people you will come to know. Side-scrolling segments link important parts of the town and open up side quests Multiple endings based on your gameplay and choices Voice acted (partial with expression lines) and animated characters 25+ song soundtrack inspired by the synth-fantasy meld of films such as Legend and The Neverending Story The first episode in a series that will explore other mysteries For the first time in almost thirty years, the land of Oraz is at peace. For three decades, the Humans and Leshin waged a brutal war over the right of Humans to power their cities and machines with magic. But the Leshin people have overthrown their theocratic leaders who pushed to extend the war and ushered in a new era of reconciliation and reconstruction. This peace, however, is fragile and strained under the shared history of the two peoples. This is true nowhere more than the city of Vodotsk, a historically Human city that was occupied and ruled by the Leshin for years. Old grudges among the Humans have re-emerged. Leshin who lived there for years as rulers must decide whether to return beyond the Great Forest or stay as second-class citizens. And the wounds of the war threaten to re-open whenever the two peoples come into contact. Echoes of the Fey is a series of detective stories set in the high fantasy world of Oraz starring Sofya Rykov, a Human private investigator with a dangerous secret: following a near-death experience in the war, she spontaneously developed the ability to use magic. She is joined by her Leshin partner, Heremon ir-Caldy, a doctor fascinated by Sofya’s magic but fearful it will soon come at the cost of her life. Together, Sofya and Heremon navigate the mysteries and tensions of Vodotsk, the city they intend to make both their hiding place and their home. The Fox's Trail is the first episode of the series and concerns a missing Leshin, presumed dead during the war. Sofya and Heremon must explore Vodotsk and dig up a dark secret that threatens to shatter the fragile peace between their two peoples. The majority of the gameplay is traditional visual novel dialog trees, with dozens of choices that can affect the story and Sofya's ability to solve the mystery on her own. There is also a 2-D representation of the city to explore and side quests to discover more about the world, as well as deepen Sofya's relationships with the characters.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/511320/header.jpg?t=1582841681",
    "Price": 7.99,
    "Developers": "Woodsy Studio",
    "Publishers": "Woodsy Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_7d4aa451ac65e0ccf807345f52e7c825dc9e8ddc.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_85d9eb6ec1184b0f7177a34c6b5b7913a31f799f.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_812b929b4cb1b912162228cd9e8d712a7297d691.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_8f3c4caa446cd1fad7fc3c81378c29f915c4f74b.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_ed3ad3e1aa648bd32ef81989aa725187f3e583bd.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_e56080e41e205e3d5fde00fe2b1a7631db5d84f0.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_95456495cebfc80dc4e32412f2a24a18943acb8f.1920x1080.jpg?t=1582841681,https://cdn.akamai.steamstatic.com/steam/apps/511320/ss_2a0d4e568452607218319e44546a641bb7b1f6d5.1920x1080.jpg?t=1582841681",
    "Slug": "echoes-of-the-fey-the-fox-s-trail",
    "Meta Title": "Echoes of the Fey: The Fox's Trail: Aug 16, 2016, Woodsy ...",
    "Meta Description": "Looking for information on Echoes of the Fey: The Fox's Trail? Check out the release date (Aug 16, 2016), developer insights from Woodsy Studio, and a c...",
    "Alt Text Image": "Official header image for Echoes of the Fey: The Fox's Trail game - Steam 511320",
    "Canonical URL": "https://gusku.site/game/echoes-of-the-fey-the-fox-s-trail",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Echoes of the Fey: The Fox's Trail\", \"description\": \"Looking for information on Echoes of the Fey: The Fox's Trail? Check out the release date (Aug 16, 2016), developer insights from Woodsy Studio, and a c...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Woodsy Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Woodsy Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/511320/header.jpg?t=1582841681\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}