{
    "AppID": 531050,
    "Name": "Far Beyond: A space odyssey VR",
    "Release date": "Oct 28, 2016",
    "About the game": "1 - General Warning For some people (1 in 500) becoming the last survivor (the kapaye) of an extinct civilization and be chosen to cross space in search of a new habitable planet may cause a dissociative identity disorder. We recommend that you consult your doctor to protect yourself from any psychological risk before entering Far Beyond: A space odyssey. 2 - Efforts and Repetitive Stress Establish a travel strategy in hyperspace, schedule refueling points on the galactic map, scan and extract resources via the holoviewer, monitor the autonomy level of the spaceship in order to maintain the oxygen recycling system on and repair the extravehicular probes can put your body and your mind to a severe test. If you experience any of these symptoms (high sensitivity to the autonomy alarm, pain in your arms when you scan a planet, annoyance when you miss a deployment to extract resources or shame when you break down) please only blame yourself (you are just bad). 3 - Use and Maintenance Of Embedded Equipment To help you in your journey, two extravehicular probes, Columbus and Digger Master await you in the hangars of the spaceship at the back of command bay. Here are some recommendations to reduce the risk of damaging equipment: Deploy the probes only to detect, scan and extract resources on hostile planets. Perform regular and careful maintenance of the probes to protect yourself from the risk of failure. Remember to recycle your used parts. We recommend that you periodically upgrade the parts that compose the probes in order to improve wear resistance and increase their performance. We do not refund the probes forgotten in a planetary system. 4 - Responsibilities, Failures and Deaths By agreeing to take part in this lone interstellar travel, you agree to take on the role of the Kapaye, you agree to take the risk of failing, you agree to be alone with your responsibilities, you agree to be alone facing death. Naturally we clear ourselves of any adverse effects that the experience of a slow and repeated death can have on your nervous system. Far Beyond: A space odyssey is a peaceful space survival Virtual Reality game combining strategy, reflection, resource management and human scale crafting. In Far Beyond: A space odyssey, you play the last survivor of your civilization. The last chance of survival you have is to take command of the Genesis, a spaceship on its last legs 'supposed' to allow you to go across the universe and reach your one and only goal: a distant habitable planet, primitive and without any trace of intelligent life called 'Earth'. Equipped with two mechanically capricious probes, Columbus and Digger Master, you have to cross the space, juggling between refueling and recharging the battery, extracting ore, repairing damages and planning your moves in hyperspace. You will have only one goal: reach a distant habitable planet in order to deploy the E.D.E.N project, a demographic bomb composed of genomes and matrices of your lost civilization, to give birth to a new colony. Will you survive long enough to bring back your civilization to life far beyond your own galaxy? A game designed and developed from A to Z for VR A perfectly comfortable virtual reality experience. No artificial locomotion nor camera movement therefore no risk of nausea. (Roomscale for motion controllers) No display directly on the screen. All user interfaces are fully integrated into the environment to not ruin the feeling of immersion. A graphic rendering close to presence. Gorgeous and inspired graphics thanks to 4K textures and a native supersampling of the resolution. A realistic and meticulous sound design. All sound effects are in spatialized 360° 3D audio. A possible interaction with every object. Grab, manipulate, or throw all of the objects you can find around you. A gameplay system, mixing survival and strategy, rich and hardcore. A tough and certain challenge to every game play. Successfully reach a distant planetary system safe and sound is your only goal. However, one mistake and the game will start again (only in the higher difficulty setting). Human scale crafting. Repair and upgrade the probes through a unique human scale crafting system. A guarantee of replay value. Explore a procedurally generated galaxy for each new game. Build and assemble more than fifty parts to upgrade your probes. Multiple random events make each game play unique. Time as the worst enemy. Each exit consumes the battery of your spaceship. Plan effective travel and refueling strategies to avoid falling into blackout and thus succeed in moving towards your goal. Limited resources. Fuel and construction ore are exhaustible resources. Use your two space probes to scan and extract resources essential to your survival. Upgrade your equipment. Unlock, build then assemble by hand more than fifty upgrades using the onboard ore synthesizer.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/531050/header.jpg?t=1515993577",
    "Price": 12.99,
    "Developers": "Mains Digitales Interactive",
    "Publishers": "The Small Game Company",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_f6e035479d7677abbd744a50ac6252985cfd4c4a.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_ff4c4d87785c4b7caced025aa1bed09255092428.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_e645a47052362ad57d7e1b3a6588e1c63f553e16.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_3a84253941074392aeca2d196f9c9a7c45068712.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_55dd18291b6104fba0674ac90c71e30f0160c1f9.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_adc36716c8ac55977a9c3336616096e49d08a6cb.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_236a951c44f8e5480efb049a1d07655332192e59.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_ab090dfb872adc2bf9b31608e4020288629f37b4.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_49623c522fe723a8f162a0db11866fa7ee9ca698.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_edd74827cd5a8b0640ee9aafaa07aab415de6e70.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_6029058d470b5afd216139dec272695e37dd7913.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_ff270367644888ad12517faa3eb565a1d78adb13.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_2355672cc90b27415daef0c0b2481d7bdb95daf5.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_6497c0639e9568b7b8bf5a1a2389f575ebd34a03.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_b0f10885b6e4d2781a047cf2f2b62e4aa6f8125b.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_1d5dd581ecb99a60cba3e81bffd8013d3a91b31a.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_064958dbc17e859cc9d0fcabc2e93c54a87419cd.1920x1080.jpg?t=1515993577,https://cdn.akamai.steamstatic.com/steam/apps/531050/ss_77e7641ef7165a3d3478571f248589093e404f5b.1920x1080.jpg?t=1515993577",
    "Slug": "far-beyond-a-space-odyssey-vr",
    "Meta Title": "Far Beyond: A space odyssey VR: Oct 28, 2016, Mains Digit...",
    "Meta Description": "Looking for information on Far Beyond: A space odyssey VR? Check out the release date (Oct 28, 2016), developer insights from Mains Digitales Interactiv...",
    "Alt Text Image": "Official header image for Far Beyond: A space odyssey VR game - Steam 531050",
    "Canonical URL": "https://gusku.site/game/far-beyond-a-space-odyssey-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Far Beyond: A space odyssey VR\", \"description\": \"Looking for information on Far Beyond: A space odyssey VR? Check out the release date (Oct 28, 2016), developer insights from Mains Digitales Interactiv...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 28, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mains Digitales Interactive\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"The Small Game Company\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/531050/header.jpg?t=1515993577\", \"offers\": {\"@type\": \"Offer\", \"price\": 12.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}