{
    "AppID": 1494500,
    "Name": "FWsim - Fireworks Display Simulator",
    "Release date": "Feb 16, 2021",
    "About the game": "FWsim is one of the best 3D simulation tools of the fireworks industry, used and acclaimed by professionals and fireworks enthusiasts all over the world. After 10 years of success, and with more than 30.000 fireworks shows designed, Fwsim reaches Steam Early Access. We're looking forward to getting its next iteration to its max potential with your feedback! One of the first and best memories we all often have is the sense of marvel at watching one of these shows as small kids. The sky lights up in thunder, flashing in the brightest colors like if it was tearing asunder. And you, mouth agape, the music and bangs ringing in your ears, walk back home wondering if you could some day wield that incredible magic in your hands. Now you get to revive this feeling by creating your own display with Fwsim – Fireworks Display Simulator! FWsim is an incredibly intuitive tool, so easy-to-use that within minutes you will be creating a fireworks display that will leave you amazed. This sandbox simulation tool is a great way to have fun and relax expressing your creativity – no pressure, no defeat screen, just the pure unadulterated fun of creating a unique show of light and music. Pick up your favorite song, choose among dozens of iconic landmarks from all over the world, and start designing a fireworks show that will be remembered for the ages. Intuitive as FWsim may be, it doesn’t sacrifice an inch of realism. Used by fireworks companies and freelance pyrotechnicians all over the world, FWsim features a wide variety of fireworks and effects and realistic physics and scale in 3D environments, allowing you to customize your show to its smallest detail. From the simplest parts to the most complex effects, combine everything to create your display with multiple firing lines, shells up to 600 mm and real recorded sounds in stereo for better authenticity, there will be no limits to what you can do! KEY FEATURES Design your unique fireworks show combining music, fireworks and 3D models Choose from 400 realistic firework effects already included – more to come! Create your own pieces of firework by combining individual components, just like real specialist do! Synch your fireworks with your favorite music with spectacular camera movement Feel every explosion thanks to recorded real sounds Enjoy your creations in realistic 3D environments with iconic landmarks such as the Eiffel Tower or the Empire State Building …or have them light up wherever you want importing 3D buildings – from your city or backyard to any famous place you can think of Share your creations exporting the video up to 4K resolution, compatible with Youtube and social media channels Great optimization: flawless performance even when designing massive displays",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1494500/header.jpg?t=1645512477",
    "Price": 24.99,
    "Developers": "Lukas Trötzmüller",
    "Publishers": "Lukas Trötzmüller",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_b4f024c357c55f5c7829d400efd31c8382b0aa57.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_8dc58498c6f55e4b73600fcca6f6265c43a82274.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_3e904eac58ad3431c94cf1aad3c76798177a0413.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_5a288598e5305e79cfc5dacc0eb034ba12c5e31a.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_45f892617b1f6a32132fdd86eea7a30b7c213893.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_c2e068fcdf27757fa9c1a663da214c8d0b67316f.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_64535ecc3e58d8029acc0b0428e8ff88e1361e67.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_6f9131949b83c3a708140854e247e49464f8e5ea.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_4ae24cba76101a6b09c2225cd2dfb9dca03740f5.1920x1080.jpg?t=1645512477,https://cdn.akamai.steamstatic.com/steam/apps/1494500/ss_ff400ed95ce7352612818df2f71c74a45f74708f.1920x1080.jpg?t=1645512477",
    "Slug": "fwsim-fireworks-display-simulator",
    "Meta Title": "FWsim - Fireworks Display Simulator: Feb 16, 2021, Lukas ...",
    "Meta Description": "Looking for information on FWsim - Fireworks Display Simulator? Check out the release date (Feb 16, 2021), developer insights from Lukas Trötzmüller, an...",
    "Alt Text Image": "Official header image for FWsim - Fireworks Display Simulator game - Steam 1494500",
    "Canonical URL": "https://gusku.site/game/fwsim-fireworks-display-simulator",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"FWsim - Fireworks Display Simulator\", \"description\": \"Looking for information on FWsim - Fireworks Display Simulator? Check out the release date (Feb 16, 2021), developer insights from Lukas Tr\\u00f6tzm\\u00fcller, an...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 16, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Lukas Tr\\u00f6tzm\\u00fcller\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Lukas Tr\\u00f6tzm\\u00fcller\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1494500/header.jpg?t=1645512477\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}