{
    "AppID": 713310,
    "Name": "Gambol",
    "Release date": "Mar 27, 2018",
    "About the game": "Gambol is a wall-hopping, ceiling-slapping jaunt of a platformer with straight forward controls, and buttery smooth movement. You control the Gambol Gumball through a gauntlet of levels designed with flow and rhythm in mind to test your platforming grit. But don't be too nervous, because along with the slick controls you also have a triple jump that's energy is reset upon touching any (non-lethal) surface, including the ceiling. Holy cow, that sounds great. The controls are simple enough that you could play it on a NES controller, with only run, jump, left, right, down-boost, and [REDACTED] to worry about. What's that “[REDACTED]” all about? Hah, don't think too much about it, it's probably nothing. “Whoa!” you say, “this looks crazy hard, is this one of those games that Poo-Dee-Pah yells at on the YouVideo?” Nah, it's not too bad, the levels appear a bit tougher than they really are since I had to put in more obstacles to make up for all that sweet, juicy, player agency you have. Oh, and when you inevitably meet your demise at the hands of a spike, laser, bomb, floating-shock-ball-of-hurt, or whatever else, you re-spawn within a couple seconds (or just hit the level-restart button if you're fidgety like me), so it's no biggie if you have to re-run a level a few times before you get the hang of it. But for all you hardcore platforming buffs out there, I've made a second, harder difficulty with special levels, and normal mode levels with more hazards added. Oh my! Inconsequential! It's probably about candy or jellybeans or some such nonsense. Honestly, the story is just a vehicle to move the action along, so it's not super important, but I'll work something in there, just you see, and chapter four will shock you! super-smooth Modern Platforming Action! A triple jump that's energy is reset upon collision with any non-lethal surface. Wowie! 130+ Levels , designed to flow in a way so that they can be (fairly) easily speedran once mastered NO AUTOSCROLLERS! ! Wild hazards to avoid! , and one to use to your advantage if you're gutsy enough to experiment (hint: not the spikes, those just kill you. Don't try using those for anything. Except to die. Which you will do if you touch them. Avoid at all costs). No weird gravity mechanics , or things to make you motion sick. Back in my day we liked our colors bright and our gravity linear (only going down, baby!) Simple, customizable controls that anyone can master. Cool beans! Two difficulties : One for normies like myself, and one for people who, I don't know, like losing? It's super hard, but whatever! Yay! Q: What Platforms Will the Game Run On? A: Windows/PC. It is possible (though not promised) that Linux and Mac versions may come in the future, though they will certainly not be available at launch. Q: How Many People Are Working On This Game? A: Just this guy!, Mike. Catch me on the Tweeterverse @ACEJester &lt;3 Oh, and Andrew Lippens is the composer. He's super cool, too. Q: What Inspired Gambol? A: I love games with wall-jumping, but I haven't found one with the mechanic done how I'd like it done, so I've made my own!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/713310/header.jpg?t=1601581976",
    "Price": 0.0,
    "Developers": "Mike Pickering",
    "Publishers": "Mike Pickering",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/713310/ss_f1cf8e2b19deab939f801afe6864e8748ae4036b.1920x1080.jpg?t=1601581976,https://cdn.akamai.steamstatic.com/steam/apps/713310/ss_5e2553e4dc3192a493d6fe17a9e4f0765a1c73ca.1920x1080.jpg?t=1601581976,https://cdn.akamai.steamstatic.com/steam/apps/713310/ss_bbf9dc3a36dd77d89b5e2355ea7ff6270f286b83.1920x1080.jpg?t=1601581976,https://cdn.akamai.steamstatic.com/steam/apps/713310/ss_5adb12b614d0c478609b74d0be143fe9dbe9bf5a.1920x1080.jpg?t=1601581976,https://cdn.akamai.steamstatic.com/steam/apps/713310/ss_d69d854d2a7ddf117b193e45f00cfd04d3463043.1920x1080.jpg?t=1601581976,https://cdn.akamai.steamstatic.com/steam/apps/713310/ss_85819b5aa9cfae271f493d7f40857874b2c22f39.1920x1080.jpg?t=1601581976",
    "Slug": "gambol",
    "Meta Title": "Gambol: Mar 27, 2018, Mike Pickering and Full Overview",
    "Meta Description": "Looking for information on Gambol? Check out the release date (Mar 27, 2018), developer insights from Mike Pickering, and a complete game summary.",
    "Alt Text Image": "Official header image for Gambol game - Steam 713310",
    "Canonical URL": "https://gusku.site/game/gambol",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Gambol\", \"description\": \"Looking for information on Gambol? Check out the release date (Mar 27, 2018), developer insights from Mike Pickering, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 27, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Mike Pickering\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Mike Pickering\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/713310/header.jpg?t=1601581976\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}