{
    "AppID": 1117930,
    "Name": "惊奇剑士",
    "Release date": "Oct 28, 2020",
    "About the game": "Wonder Blade tells the story of the powerful fighter tasked with freeing the princess in distress, defeating the ultimate villain, and saving the world from darkness. Before stepping on the journey, you will never imagine how many enemies and dangers ahead, and you can only believe in the long swords in hands, cut thorns, go to the grottoes, and move on without fear! Wonder Blade is a side-scrolling adventure game. Through the cute and funny comic art style, it depicts unique, hilarious NPCs and monsters, satisfying players' adventure in bizarre world dreamed during their childhood. Smooth combat combines with flame, frozen, lightning three different magic to create a wide variety of combo chains. Ultimate skill, dodge and other techniques challenge your response limit. This will bring the most excellent experience to hardcore players who are passionate about FTG, to achieve their own unique achievements. You can also see that the game includes some RPG elements like leveling up your character, distributing stat points, unlocking special abilities and costumes, and collecting a host of different weaponry. At the same time, you can also pick out funny suits, spoof, and enjoy the custom fun in a stressful adventure. You will drive away the cart from the thieves' bombs in the forest, control Gundam to lasing in the mechanical city, ski at the snow mountain and fish in the sea. Platformer shooting and running makes your journey like Arcade game more than Beat 'em up and hack and slash. Recently the game updated a new pet system. Choosing travel partners will also bring unique stats and your journey is no longer lonely. In the future, we will continue to expand the new content about equipment, props, suits, skills to expand the broader adventure and unlock new achievements. For those who are addicted to challenging the difficulty of the game, don't be deceived by this whimsical adventures and the colorful characters! Intensely aggressive enemies and weird Bosses and sudden traps still can meet the needs of hardcore gamers. Of course, it is also suitable for casual players who want to level up characters, and the overall relaxed and cute style is more attractive to teenagers and female players.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1117930/header.jpg?t=1641537524",
    "Price": 6.99,
    "Developers": "PUPPET DEPOT GAME STUDIO",
    "Publishers": "East2West Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_cb332818ee5f2ac19943fe234cb5e377bdcff81e.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_10fde70e7f08cadb0990bb2b3b6ac08a3b53b298.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_0d03460618778625a4d42adf6ee81c9eb4e6f752.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_3c12b6824e554457c74b8532fae0f656ac5b4252.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_83bdb2a8ebeadcea0298df605d573658a972b080.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_051c78d46443fd83328e219f05f56e6967f611f0.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_eb3fb0038ce4a7366dd99ec7c24d8a0b3b09a1b3.1920x1080.jpg?t=1641537524,https://cdn.akamai.steamstatic.com/steam/apps/1117930/ss_e603cdc7f38ab49c247e2db1297c8ad15de4c99a.1920x1080.jpg?t=1641537524",
    "Slug": "",
    "Meta Title": "惊奇剑士: Oct 28, 2020, PUPPET DEPOT GAME STUDIO and Full Ove...",
    "Meta Description": "Looking for information on 惊奇剑士? Check out the release date (Oct 28, 2020), developer insights from PUPPET DEPOT GAME STUDIO, and a complete game summary.",
    "Alt Text Image": "Official header image for 惊奇剑士 game - Steam 1117930",
    "Canonical URL": "https://gusku.site/game/",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u60ca\\u5947\\u5251\\u58eb\", \"description\": \"Looking for information on \\u60ca\\u5947\\u5251\\u58eb? Check out the release date (Oct 28, 2020), developer insights from PUPPET DEPOT GAME STUDIO, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Oct 28, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"PUPPET DEPOT GAME STUDIO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"East2West Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1117930/header.jpg?t=1641537524\", \"offers\": {\"@type\": \"Offer\", \"price\": 6.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}