{
    "AppID": 522730,
    "Name": "God Of Arrows VR",
    "Release date": "Nov 2, 2016",
    "About the game": "God of Arrows is a Virtual Reality tower defense game where you take the role of an archer defending a castle against the forces of evil with some help from the gods. Play solo to fight through endless waves of monsters and compete in an online leaderboard to showcase your skills as the best defender. The game is currently only available for the HTC: VIVE. And will be released as an early access game with tons of features still in development. In God of Arrows VR, you take on the role of an archer defending from atop a tower as you fight through incoming waves of skeletons and demons trying to breach your gate. You start with using only the basic arrows available to you and eventually get assisted by the gods with elemental empowered arrows (Fire / Ice / Thunder / Arcane). Each of those arrows have particular abilities that will help you take down even the strongest of foes. FEATURES: -Action fast paced VR Bow and Arrows targeting: Immerse yourself as an arcane archer! -8 Different enemies with unique mechanics. -Enemy path variation to avoid repetitive behavior. -Teleport to different towers to get a new vantage point over the battlefield! -4 Unique elemental arrows to overcome your enemies! -A fully integrated Steam leaderboard to compete with your friends over who is the best defender! -Environmental destructibles to occupy yourself between the waves. -Be in constant movement to aim at your targets and avoid incoming threats! -Oculus Rift with Oculus Touch support. IN-DEVELOPMENT: -Flying monsters! -2 New enemy types. -Wandering critters and targets for bonus points. -Environmental mini-games to test your skills to the maximum. -Different maps. -Multi-Level maps where you defend different sections as one falls. -A progression system where you unlock new powers. -Multiplayer We are a small indie studio composed of industry veterans who want to bring awesome VR experiences to our users and would welcome any feedback to improve the gaming experience of the game.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/522730/header.jpg?t=1509753161",
    "Price": 2.99,
    "Developers": "Reactor Entertainment",
    "Publishers": "Reactor Entertainment",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/522730/ss_95aa6f3079b05db46ee88f26593629534ff010b6.1920x1080.jpg?t=1509753161,https://cdn.akamai.steamstatic.com/steam/apps/522730/ss_d46ae33f4c1e87bbd20c7071a1da9491316be439.1920x1080.jpg?t=1509753161,https://cdn.akamai.steamstatic.com/steam/apps/522730/ss_3a6702ab31af7a3d20da218bd74eaff770354133.1920x1080.jpg?t=1509753161,https://cdn.akamai.steamstatic.com/steam/apps/522730/ss_4a490fe5de4ed1aa5a06c635603f8dabb1cf5594.1920x1080.jpg?t=1509753161,https://cdn.akamai.steamstatic.com/steam/apps/522730/ss_99dcc90de3bbef8baa4667926e2d192af7ce66c1.1920x1080.jpg?t=1509753161",
    "Slug": "god-of-arrows-vr",
    "Meta Title": "God Of Arrows VR: Nov 2, 2016, Reactor Entertainment and ...",
    "Meta Description": "Looking for information on God Of Arrows VR? Check out the release date (Nov 2, 2016), developer insights from Reactor Entertainment, and a complete gam...",
    "Alt Text Image": "Official header image for God Of Arrows VR game - Steam 522730",
    "Canonical URL": "https://gusku.site/game/god-of-arrows-vr",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"God Of Arrows VR\", \"description\": \"Looking for information on God Of Arrows VR? Check out the release date (Nov 2, 2016), developer insights from Reactor Entertainment, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 2, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Reactor Entertainment\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Reactor Entertainment\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/522730/header.jpg?t=1509753161\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}