{
    "AppID": 432380,
    "Name": "Hydra Slayer",
    "Release date": "Mar 24, 2016",
    "About the game": "You are facing a nine-headed hydra. Your flaming longsword cuts five heads in each swipe (no more, no less), which will kill a five-headed hydra, but a larger one will regrow two heads after each swipe. Your storm scythe cuts exactly seven heads, but it makes ten heads grow back if the hydra is not dead. Is it possible to kill the hydra? What if you also had a silver dagger, which cuts just one head, but makes five heads grow back? Solution: It is impossible without the silver dagger (the number of heads always stays divisible by 3), but possible with the silver dagger, for example: 9 -&gt; longsword -&gt; 6 -&gt; longsword -&gt; 3 -&gt; dagger -&gt; 7 -&gt; scythe -&gt; 0. If you liked this puzzle, and you also like dungeon crawling, Hydra Slayer is for you! Hydra Slayer is a roguelike (randomly generated dungeon crawler), with unique combat mechanics based on the puzzle above. It is challenging both at a short term tactical level (each hydra is a unique challenge, bumping into it with your weapon almost never works), and at a long term strategy level (you have to build a set of weapons which slays hydras effectively). While the early levels could be used to teach arithmetics and tactical planning in a fun way, building an effective set of weapons for late levels is a challenge even for expert number theorists! Hydra Slayer currently features a tutorial, 5 player character races with distinct characteristics, 28 enemy types (10 common hydras, each in two varieties, and 8 special enemies), 28 types of equipment including rare artifact weapons with special properties (not counting material and size variations), 15 weapon materials, 18 types of magical items which help you in your quests, three game geometries to choose from, 8 level topologies on very deep levels (including the Möbius strip and Klein bottle), 11 level generators, and two endings (a small victory for quick challenges and more casual players, and a big victory for those who want more challenge). Hydra Slayer is available for free from its website . By buying the Steam version, you get typical Steam features, and more frequent updates -- currently, the Steam version has the following bonus features: online achievements and leaderboards Steam trading cards cloud-based saves daily challenge automatic updates a 'challenge' mode for short but very interesting games (much more unpredictable than the normal play) updated interface and performance (watch those heads fly!) new music traps to lead hydras on Orbs which provide a powder/potion effect many times at the cost of a weapon slot source code (except the Steam features)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/432380/header.jpg?t=1458842423",
    "Price": 5.99,
    "Developers": "Zeno Rogue",
    "Publishers": "Zeno Rogue",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_0fbb0d496a3d649072bde641bf8e2472821422f3.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_763e0b93ba7ed23df9a488c308b83459f6392382.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_888d88c3b2df242d31deb5e7d50a6199b91160e7.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_e9a60714a6932c7f0eccc0b3df0fbbaadb8b418e.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_c50371d561333687f92285831488b31ec8b80f34.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_0138b35119035462ee111a4d4cfa3608b8fd787a.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_e1fe3502b1cd11331209a12f46c7682e7cb2572c.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_3a2ab534af36c3991ef308abdae1dd581768aa42.1920x1080.jpg?t=1458842423,https://cdn.akamai.steamstatic.com/steam/apps/432380/ss_5c53284ab549e640194bc6dba163fb15a5d6c4a8.1920x1080.jpg?t=1458842423",
    "Slug": "hydra-slayer",
    "Meta Title": "Hydra Slayer: Mar 24, 2016, Zeno Rogue and Full Overview",
    "Meta Description": "Looking for information on Hydra Slayer? Check out the release date (Mar 24, 2016), developer insights from Zeno Rogue, and a complete game summary.",
    "Alt Text Image": "Official header image for Hydra Slayer game - Steam 432380",
    "Canonical URL": "https://gusku.site/game/hydra-slayer",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hydra Slayer\", \"description\": \"Looking for information on Hydra Slayer? Check out the release date (Mar 24, 2016), developer insights from Zeno Rogue, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 24, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zeno Rogue\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Zeno Rogue\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/432380/header.jpg?t=1458842423\", \"offers\": {\"@type\": \"Offer\", \"price\": 5.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}