{
    "AppID": 1629380,
    "Name": "Last Soul",
    "Release date": "Jun 9, 2021",
    "About the game": "What will happen if after death you prove to all hell that you are worthy to live... Last Soul is a hardcore top-down arena shooter in which you have to fight hordes of hostile souls and survive until darkness itself recognizes you as an equal. Immerse yourself in a cold, dark and lifeless the place between worlds. A world in which shadows appear brighter and light gets darker. Find yourself among thousands of lost souls doomed to wander forever. And prove to the darkness itself that you are worthy to see the light... That you are worthy to live... In our game you have to fight for your life absorbing the power of souls enslaved by darkness. Speak the echoes of your willpower at the enemy to test your skills in the decisive battle for your mind and soul. Absorb as much power as needed. Prove to yourself that you are worthy. Get out of the damn loop of humiliation. And finally find freedom... Features Do other games seem too simple for you? Try our game! The game developers themselves are not sure if it can be finished! We have simplified the graphics in the game as much as possible so that nothing distracts you from the gameplay. If you start to feel sick from graphics, then our artist did everything right. No reloading, no bullets. You don't need to bother yourself with such complicated things as the number of bullets, you can just shoot without stopping. We did it for you! Easy to learn, hard to master. Only a person of the strongest will can learn the whole essence of our project. No NPCs, quests, gathering, crafting, construction and the whole story. You don't need to destruct from the addicting gameplay and think about where you are, what are you doing here, what is this hole in the center, why are these blue dots flying into it and why are you being attacked by the red ones? This is clearly superfluous! A mind-blowing soundtrack, created by our sound engineer, will make your eardrums flutter in time with every sound and leave your skull.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1629380/header.jpg?t=1627576943",
    "Price": 1.99,
    "Developers": "DARKLID",
    "Publishers": "DARKLID",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1629380/ss_e77ea560b03a43f10fabef966c6cf3da047b52a6.1920x1080.jpg?t=1627576943,https://cdn.akamai.steamstatic.com/steam/apps/1629380/ss_a0286efb5c3f13cfb09d5dbf89fe3d66711df465.1920x1080.jpg?t=1627576943,https://cdn.akamai.steamstatic.com/steam/apps/1629380/ss_899c1a6bcd3215a69147b85013cace133d1a38eb.1920x1080.jpg?t=1627576943,https://cdn.akamai.steamstatic.com/steam/apps/1629380/ss_bc8fe0df1d09bfb34273c78951da82e5a0edca3e.1920x1080.jpg?t=1627576943,https://cdn.akamai.steamstatic.com/steam/apps/1629380/ss_7f00d70ea0d8d1d855be9474a3d25e8ee5dad354.1920x1080.jpg?t=1627576943,https://cdn.akamai.steamstatic.com/steam/apps/1629380/ss_039b4a028b304ac7996ad861a0d35952ab113e22.1920x1080.jpg?t=1627576943",
    "Slug": "last-soul",
    "Meta Title": "Last Soul: Jun 9, 2021, DARKLID and Full Overview",
    "Meta Description": "Looking for information on Last Soul? Check out the release date (Jun 9, 2021), developer insights from DARKLID, and a complete game summary.",
    "Alt Text Image": "Official header image for Last Soul game - Steam 1629380",
    "Canonical URL": "https://gusku.site/game/last-soul",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Last Soul\", \"description\": \"Looking for information on Last Soul? Check out the release date (Jun 9, 2021), developer insights from DARKLID, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 9, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"DARKLID\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DARKLID\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1629380/header.jpg?t=1627576943\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}