{
    "AppID": 373770,
    "Name": "LiEat",
    "Release date": "Feb 25, 2016",
    "About the game": "Efina is a very special young girl. She's curious. She's optimistic. She has the power to make lies manifest themselves as physical beings, which then become her own sustenance. She's also a dragon. LiEat is the classic story of a vagabond traversing a strange and mysterious world together with a dragon protégé, buying and selling secrets, while also attempting to uncover the truth about themselves. Along the way, they'll discover a web of arcane mysteries, meet a variety of colorful characters (including other dragons), and shed light on events of the past which ultimately served to lead them to where―and who―they are today. The epic tale of LiEat is composed of three fantastical, bite-sized chapters: Chapter I introduces Efina and her caretaker―the multinominal Leo―as they happen upon a small town with a big secret. As Efina starts to perceive and understand the world around her in a new and different light, the pair finds that the legends of beings which haunt the night are more than just tales told to frighten children... Chapter II finds Efina and Hal (formerly Leo) investigating rumors of something magical and possibly dangerous inside a resort casino. Posing as a newly-assigned guard, Hal arranges room and board for himself and Efina―however, they quickly come to the jarring realization that a roof over one’s head and a bed to sleep in do not a safe haven make. The final chapter of LiEat brings Efina and the newly rechristened Sid (Leo/Hal) to a lavish mansion to foil the plans of a master thief. However, in the wake of the great robbery, Sid discovers that the heist itself was only the tip of the iceberg, and Efina watches as his past―As well as his lies―finally catch up to them both. For the first time ever, this beloved trilogy that has long been treasured by JRPG enthusiasts can now be enjoyed in its entirety on Steam in one single comprehensive package! In collaboration with the original developer (and featuring translation painstakingly crafted by a longtime fan), PLAYISM is proud to finally bring LiEat to the entire world! Engaging and emotionally resounding JRPG storytelling Entrancing atmospheric music that seamlessly transports the player into the world of LiEat (*Purchase of the game includes the OST! Make sure to check your Local folder.) Myriad hidden items and conversations spread throughout the game Multiple achievements for each chapter of the game All three chapters in one package; no DLC, just the whole story Special Thanks to vgperson and SmokingWolf",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/373770/header.jpg?t=1592544436",
    "Price": 2.99,
    "Developers": "△○□× (Miwashiba)",
    "Publishers": "PLAYISM",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/373770/ss_15a72b82a6ec67e8a56c0aa978721cebdb092205.1920x1080.jpg?t=1592544436,https://cdn.akamai.steamstatic.com/steam/apps/373770/ss_93e33fb8578c845c91c553991c0e322ea4f16652.1920x1080.jpg?t=1592544436,https://cdn.akamai.steamstatic.com/steam/apps/373770/ss_e3605d798efa18bcb694f44e322322b21947d4bc.1920x1080.jpg?t=1592544436,https://cdn.akamai.steamstatic.com/steam/apps/373770/ss_9295f69b368b37c46a0d7f6430035a0f70060d74.1920x1080.jpg?t=1592544436,https://cdn.akamai.steamstatic.com/steam/apps/373770/ss_6eb98f734e363f1a73808ec7a39ef9b756407f8f.1920x1080.jpg?t=1592544436,https://cdn.akamai.steamstatic.com/steam/apps/373770/ss_040d3a278f3c01a0b48cb04b1653ea390dc25ec9.1920x1080.jpg?t=1592544436",
    "Slug": "lieat",
    "Meta Title": "LiEat: Feb 25, 2016, △○□× (Miwashiba) and Full Overview",
    "Meta Description": "Looking for information on LiEat? Check out the release date (Feb 25, 2016), developer insights from △○□× (Miwashiba), and a complete game summary.",
    "Alt Text Image": "Official header image for LiEat game - Steam 373770",
    "Canonical URL": "https://gusku.site/game/lieat",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"LiEat\", \"description\": \"Looking for information on LiEat? Check out the release date (Feb 25, 2016), developer insights from \\u25b3\\u25cb\\u25a1\\u00d7 (Miwashiba), and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"\\u25b3\\u25cb\\u25a1\\u00d7 (Miwashiba)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"PLAYISM\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/373770/header.jpg?t=1592544436\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}