{
    "AppID": 553800,
    "Name": "Lunar Stone - Origin of Blood",
    "Release date": "Nov 18, 2016",
    "About the game": "Game Description Lunar Stone is first-person shooter plus role play exclusively designed for virtual reality. There are four levels of combats for you to explore and an unique dodging system empowers your combat against monsters and lords specialized by dark force. The magical stones lead your adventure in magnificent scenes to find the answers along with your beloved companions. Feast your ears with film made original music and boil your blood in a world where mystery creatures and mankind industry collide. It is a combat for survive, it is a journey for young to grow and seek the answers through and it is a also wholly new experience to adventure together with enhanced AI Non-Player-Controlled Character. Story Lunar Stone: Origin of Blood is set at years after the old era ending by the Moon Break Catastrophe. The magic power released from the core of the moon awaken the ancient dark creatures. And the war dragged between Human survivors and dark creatures to seize control of few lands left after the grand flood. Standing on the top mountains of Sober Land, Academy Zenova was built to foster young soldiers and to protect the magical moon stones. The Academy president Mr. Levit departed to attend the Sober Land Anniversary leaving a prophecy that there is a chosen one will end the war. The undead creatures led with dark lords take the chance to intrude into the academy and grab the powerful stones. The challenge begins now. Key Features ● The Companions As fully voiced characters, Mika LIN and Melanie HEINS now bring their own perspectives and emotional responses to the world and story. Each character has uniquely-tuned weapons and will lead you to explore the story and fight together against the monsters. ● Dark Force Lords The undead legion led by dark force lords shows impulsive power and grab the stones. Lords has obtained unique fighting skills enhanced by the magic power of moon stones. But the stones also allow you to obtain powers in vastly different ways to heal your team mate, to upgrade your weapons and to more combat ways. ● Elaborated Music Film made original music specialized in epic style offer you the best class enjoyment during the blood boiled combat. Foil atmosphere of tense, evil and graceful switched between different scenes. ● Free Upgrade Lunar Stone is polished to better suits for fierce shooting activities. Unique dodging system is invented along with other pioneer creation for unlimited chasing of players best experience. The whole life free upgrading incoming will bring multiple player function, more personified Artificial Intelligence and more weapon choice soon. Your recommendation is highly appreciation for our continuously improvement.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/553800/header.jpg?t=1540402036",
    "Price": 4.99,
    "Developers": "Zenox Studio",
    "Publishers": "GQJoy Co.,Ltd",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_757839a96e0ce4d223d85829b41818c37c8ebe13.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_f0b8bd669002d8835951cc4ebbad2669c09b5688.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_bb6ce1c4ac16381d9b7650d1171cf2d8f9834adc.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_7b62a05f82e77e45c44fd40cc828b5024af44840.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_2cdce6e4907e1c0707ab70000268cb63620d133e.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_55f2b5cdffddba3eb6aad6ec725d9e210c176604.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_05d22a4448dd754262878f9804e7e21fc5dd0bb3.1920x1080.jpg?t=1540402036,https://cdn.akamai.steamstatic.com/steam/apps/553800/ss_149575016c7b583308f40e8787a1db8a8467cfa7.1920x1080.jpg?t=1540402036",
    "Slug": "lunar-stone-origin-of-blood",
    "Meta Title": "Lunar Stone - Origin of Blood: Nov 18, 2016, Zenox Studio...",
    "Meta Description": "Looking for information on Lunar Stone - Origin of Blood? Check out the release date (Nov 18, 2016), developer insights from Zenox Studio, and a complet...",
    "Alt Text Image": "Official header image for Lunar Stone - Origin of Blood game - Steam 553800",
    "Canonical URL": "https://gusku.site/game/lunar-stone-origin-of-blood",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Lunar Stone - Origin of Blood\", \"description\": \"Looking for information on Lunar Stone - Origin of Blood? Check out the release date (Nov 18, 2016), developer insights from Zenox Studio, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 18, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Zenox Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"GQJoy Co.,Ltd\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/553800/header.jpg?t=1540402036\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}