{
    "AppID": 346150,
    "Name": "Martial Law",
    "Release date": "May 26, 2015",
    "About the game": "What is Martial Law? Right now, it's the framework of a single and multi-player survival game. I emphasize the word 'framework'. As of now, it has the basic functions and mechanics developed over months upon months by a one-man development team. It is *not*, I repeat *NOT* a complete game. If what you want is a complete game, DON'T buy it. What you are doing by purchasing is supporting an indie developer who has built a mechanical framework and core that will be continually expanded upon in constant cooperation with the community. What you are doing by purchasing is guaranteeing that Prophet can continue to work full time (actually, significantly more than 'full time') on the development. What you are doing is funding the continued expansion of the game, whether that means actual additional paid staff or new equipment to build and test the game, or just keeping Prophet from having to split his time between multiple jobs. Who shouldn't purchase Someone who is looking for a finished game Someone who doesn't want to help grow and develop a true indie title Someone who really can't afford the price for something that isn't a finished product Someone with no patience for the unavoidable bugs and delays in WIP software Who should purchase Someone who wants to play a role in building a real, non-zombie based survival game Someone who can afford the price without raiding the piggy bank Someone who is patient, and understands the pitfalls and tribulations of a one-man dev team Someone who really is passionate about indie games Someone who just wants to try something completely new I urge you to think twice, and think deeply before you purchase this game. I believe we are being completely up-front with what it is, and what it isn't. If you have *ANY* doubts, we would strongly encourage you not to buy it now, and instead wait until more features you want have been added. However, if you like what you have seen so far, I welcome you to help Prophet out with a purchase, so that the game can proceed at pace to its eventual full implementation. The more purchases are made, the more resources can be put into speeding up the development, hiring staff, paying artists for contributions, et cetera. So what’s working? As of release, the following things (we will update the description as more features are implemented) Current Features Match Mode Arena based, jet-pack having, super jumping fun, or more realistic CTF, Team Deathmatch, or FFA matches. Level Editor The level editor is meant to be a simple, yet powerful editor that will allow the community to build content and tell their own stories in the Martial Law universe. SinglePlayer This will be the strength of Martial Law compared to most other survival games. Right now, the framework is a good portion of the way to completion, with (mostly) working inventory, a large open world (not yet really populated), functional AI (limited), and vehicles. planned Features Building Building in Martial Law will be a simple process of collecting the items you need to craft the object you want to build or place the random pieces of debris you have collected from around the world to build your own survival shelter, traps, or works of art. Crafting Crafting at first will be a basic recipe system. You can find recipes by exploring the different areas in the world, meeting people that have already learned the skills that are willing to teach you or research the craft-able items that you find, steal, or trade for in the game. Bartering Trading is important to secure your survival and so there will be a simple system giving players a secure place to trade, buy, or sell goods with other players. There will be no 'Store' to exploit or pay to win, and all items will need to be found or created in-game Agriculture Just like in the real world an area can be over hunted very easily and so learning how to grow and raise your own food is important. Exploration Sometimes it is nice to be able to give your legs a rest. Players will be able to travel by multiple means on land, air, and sea. Thank you for reading this, and thanks for your interest in Martial Law.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/346150/header.jpg?t=1447368076",
    "Price": 0.0,
    "Developers": "DropDGames",
    "Publishers": "DropDGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_c484edde3ef8275c230affc2c06a7496f8c36700.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_2c0e3f56fccc570371eb8713ba1a5a9a6c8615f9.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_92d58965c81bba0f9f92cec18469e3e470851350.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_5148fd0664a691f79347309ada83a042fcda8b32.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_4d1665917839720da0e8c6af79fac3f38000b728.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_f7f8d4f2534c45b0bf03ffe9197e506b7cc0ccc9.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_fe0dceea03e9346992357f02d45e4d8d68fdb5fc.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_90b5a90fd48f66912f56425a2790e3aec7c9b709.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_acd3796ebd45448ebeb31ad3026550534684157d.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_595fe8fa5887ba2c09b09e472840f34e8ae697f1.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_4248a9e81a4de025431f683c4538a57eb03737ad.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_9ee2175ab678deac8e52bb69b5ed9311cdea44be.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_5a31cad644eefc522fce7f6d12981a4b02ce6254.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_63f09972defcf21b284a0c5bc2736206aad29b58.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_50acaed39cdf70498fcbf1a5a4c33fd3320d545d.1920x1080.jpg?t=1447368076,https://cdn.akamai.steamstatic.com/steam/apps/346150/ss_ad2e4ef50b412093e8f2aebf86ef8ac99cb27438.1920x1080.jpg?t=1447368076",
    "Slug": "martial-law",
    "Meta Title": "Martial Law: May 26, 2015, DropDGames and Full Overview",
    "Meta Description": "Looking for information on Martial Law? Check out the release date (May 26, 2015), developer insights from DropDGames, and a complete game summary.",
    "Alt Text Image": "Official header image for Martial Law game - Steam 346150",
    "Canonical URL": "https://gusku.site/game/martial-law",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Martial Law\", \"description\": \"Looking for information on Martial Law? Check out the release date (May 26, 2015), developer insights from DropDGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 26, 2015\", \"author\": {\"@type\": \"Organization\", \"name\": \"DropDGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"DropDGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/346150/header.jpg?t=1447368076\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}