{
    "AppID": 1136770,
    "Name": "Maze",
    "Release date": "Aug 30, 2019",
    "About the game": "October update Four new maps have been added to this update of MAZE. At the same time, new gate and box have been added. Maze will continue to bring more stylized maps to players. Please look forward to the next update. MAZE is a maze exploration game. You will solve the puzzles in mazes of different styles and eventually reach the End Point of the maze. Randomly dynamically generated maze paths and triggers will bring near-infinite playability to you. There are no exciting battles, no moving stories and no complicated strategies in MAZE . It only brings pure and interesting maze exploring experience to you. You will walk, collect and solve in the distinctive maze. Mazes of Very Different Styles Each unique maze will bring you a surprise again and again, each new maze has a completely different picture performance and characteristics. Unlock new mazes in the game, explore the maze of very different styles, and find your favorite mazes. Random Generated Maze Paths Every time you enter a new maze, the maze randomly generates new endpoint, paths and triggers. You’ll find it hard to find the exact same maze. There is no replay in MAZE , because every maze will only appear once. Unlock Triggers and Reach the End Point In the adventure mode of MAZE , there will be a variety of randomly distributed obstacles blocking your way to the destination, and there will also be randomly generated rewards waiting for you to get them. Explore, solve and collect in the adventure mode, and finally reach the End Point. Racing for Seconds, Collect Treasures In the treasure mode of MAZE , you need to collect as many treasures as possible and send them back to the starting point in a limited time. Deep into the maze for treasures, overcoming obstacles and challenges and get great rewards. The maze itself will be your biggest challenge to back to the starting point. Grow, Unlock and Challenge The maze will grow as you explore, upgrade maze, you will face greater challenges in the maze and get more rewards. Growing-up maze will eventually give you a totally different exploration experience than you did initially. Subsequent Updates During Early-Access, new mazes will be added as quickly as possible (Four mazes with new puzzles are expected to be added per month), and strive to finally let you experience more immersive maze exploration in virtual reality devices. All of these subsequent updates will be completely free until the game leaves Early-Access. Thanks for watching my game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1136770/header.jpg?t=1570534183",
    "Price": 9.99,
    "Developers": "StarJumping Studio",
    "Publishers": "StarJumping Studio",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_0835597d97aa262c62f0c0c998957ebbf210c848.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_c19acba77efbcfddcc52d66beb6b7dda8bbf779b.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_a37d75f5995ddc66b9ec70da1a4f58ea518af3d9.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_e9da818e671d55d1c4eccbdbac3f20bbfe163283.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_ac41ac9311cf66b4995d7c0a89785a07dc76527f.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_7d69f440287a6e571d035e4ed5407381bb42e2b4.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_af2d1e80175d870af29cbbc8e94c804c59b956ae.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_34ca49056febe58617c218d859d18ef1661598ae.1920x1080.jpg?t=1570534183,https://cdn.akamai.steamstatic.com/steam/apps/1136770/ss_769f3cbf65c318c168c9f1f1029d189aaa6794da.1920x1080.jpg?t=1570534183",
    "Slug": "maze",
    "Meta Title": "Maze: Aug 30, 2019, StarJumping Studio and Full Overview",
    "Meta Description": "Looking for information on Maze? Check out the release date (Aug 30, 2019), developer insights from StarJumping Studio, and a complete game summary.",
    "Alt Text Image": "Official header image for Maze game - Steam 1136770",
    "Canonical URL": "https://gusku.site/game/maze",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Maze\", \"description\": \"Looking for information on Maze? Check out the release date (Aug 30, 2019), developer insights from StarJumping Studio, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 30, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"StarJumping Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"StarJumping Studio\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1136770/header.jpg?t=1570534183\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}