{
    "AppID": 1148710,
    "Name": "Miriel Saga",
    "Release date": "Aug 2, 2021",
    "About the game": "In Miriel Saga, evil creatures known as Dreadlings are fast approaching to threaten the world balance and mankind. In a world of might and magic, engulfed in conflict since centuries past, it’s your role to stand up for all, gather your allies and solve the remaining mysteries to unfold in this story-driven, action packed RPG! For eons, Miriel has existed, brimming with life and mana. With mana, came the power to bend reality at will. This widespread ability has been called “Magic” to this day. Those who wielded magic are called “Evokers” However, once upon a time, magic entered into collapse. A young evoker, sought a way to harness mana, corrupting it in the process. Evokers started losing their ability to use magic and this one evoker became more and more powerful. For the first time, the whole world united itself against one enemy. This was known as the “Age of Darkness”, until the corrupted mana, the Miasma, was sealed away at the southern continent, after a grueling war. After the war was over, people were lost and frightened. Afraid to share the knowledge and power over magic and give birth to another nemesis, the remaining evokers started living in isolation,over the eastern continent, Linnah. Ex-Evokers started studying mana and its properties, unable to wield mana normally, except when discovered that Mana is raw, wordly, vital energy, one’s life could fuel a magic’s need for mana; Thus, the Arcanists of the northern continent, Kristi, were born. The ones who now didn’t have magical talents, now as the majority of the population, began to live in fear of a possible persecution from Evokers and Arcanists alike. Their sense of unity grew and inflated over the decades. The Manaless developed technology, industry and weapons to defend themselves. It was the beginning of the Military State of Boleslava, on the western continent. It was not long until instability grew among the nations and conflict began once again, on the central continent. All of them were equally matched and had no winner. However, the clash made the area unstable, and chaos rose anew as the once sealed evil began to show it’s gaze… Once again, humankind was faced with an overwhelming enemy. Once again, they set differences aside and united against one common enemy. Once again, their efforts bore the fruits of victory. The new country, Zefral, was consolidated on the old battlefield, with Accord as it's capital, to remember what unity brought to all nations: Victory, glory, peace. This marked the end of the “Age of Discord”. Even so, there still remains ambition, prejudice, fear among nations…but there is hope, compassion and determination hatching… This is the world they live in. This is Miriel Saga. You start your adventure as Aleister Sirius, a young and promising boy from the countryside, adopted by Fiora, who acted as his mother after he was made orphan by the aftermath of the last war. Together with him will be: • Lilluza, his cheerful, yet unexpectedly summoned familiar. • Naga Edoum, an Evoker whose honesty and knowledge exceed among others. • Wendi Viena Ambava IV, an Arcanist from a respectable and noble lineage of casters. • Anya Nikita, a brash Manaless willing to prove herself to the world. Take their place in the upcoming challenges and take your chace to get close and know each one better! Miriel Saga presents many aspects of modern JRPGs, such as: • A variety of fields, dungeons, towns and treasures to find • A variety of enemies to battle and strategies to take • Fast paced, 3D action • Level progression system based on experience points. • Many characters to learn patterns, movements and skills • Equipments to optimize characters • A breathtaking story, full of characters and twists • Sidequests, each with it’s own unique storyline and events • Trust Events, made to deepen your bonds with your companions and undestrand them even further • Tons of dialogues between characters for a lively experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1148710/header.jpg?t=1627921746",
    "Price": 14.99,
    "Developers": "NG+ Studios",
    "Publishers": "NG+ Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_7d7374a94cf7e3c4b6a2af8cb4e81e5732ed6809.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_7ef24d1a50d0a054424da5e4af92fa38eb827519.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_796359b617da87e2eb40fa27993ba57c396c377a.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_360c940ff98f1b895b82df9554c222a4530c898a.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_a02c9aa9a0370d26918f46294a67a121bb7049fb.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_19d19453294a51b7f2044b4d761467858f2e5ee5.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_b839c39642b0fa99dd7c9bc1ceaf29950f38d585.1920x1080.jpg?t=1627921746,https://cdn.akamai.steamstatic.com/steam/apps/1148710/ss_67bd79d905f3da284db73a0ed8c77c7f534b4ef9.1920x1080.jpg?t=1627921746",
    "Slug": "miriel-saga",
    "Meta Title": "Miriel Saga: Aug 2, 2021, NG+ Studios and Full Overview",
    "Meta Description": "Looking for information on Miriel Saga? Check out the release date (Aug 2, 2021), developer insights from NG+ Studios, and a complete game summary.",
    "Alt Text Image": "Official header image for Miriel Saga game - Steam 1148710",
    "Canonical URL": "https://gusku.site/game/miriel-saga",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Miriel Saga\", \"description\": \"Looking for information on Miriel Saga? Check out the release date (Aug 2, 2021), developer insights from NG+ Studios, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 2, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"NG+ Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NG+ Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1148710/header.jpg?t=1627921746\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}