{
    "AppID": 328510,
    "Name": "Monsters and Monocles",
    "Release date": "Aug 16, 2016",
    "About the game": "Monsters and Monocles is a frantic, Victorian steampunk themed twin-stick shooter all about using teamwork and heavy weaponry to battle the hordes of evil. A naive occult collector has unknowingly unleashed a great evil that is spreading across the globe, and it’s up to you and a team of quirky paranormal investigators to find the source of this dark energy and blast it back to where it came from. Online and Local Multiplayer Take on the challenge solo, or play with up to 4 players online or locally. Your team shares a single pool of lives so you need to stick together, revive fallen comrades, and watch each other’s backs. Customize Your Play Style Search out and use powerful weapons to aid you in battle like the blunderbuss, stake launcher and the crumpet cannon - a steampunk toaster that fires weaponized crumpets. Find and equip relics to customize your weapons and add new abilities to match your play style, and upgrade them by looting chests and destroying enemies. Procedurally Generated World Each level is procedural so you and your comrades will be faced with unique enemy placement, traps, secrets and objectives each time you play. Your trusty airship the HMS Scone acts as your hub and lets you gear up before taking on challenging levels like the haunted mansion, snowy Victorian streets and a cursed Pharaoh’s tomb. Each area ends with a fearsome boss encounter, such as a demonic chimney sweep or a giant cyclops skull. Features 4 player co-op - both locally and online Co-op centric gameplay - Revive teammates and shared pool of lives across all players Challenging single player Every game is different - Procedural levels, enemies, relics, objectives, and secrets Customizable abilities - Collect relics that can be upgraded across play sessions to match your play style Full Controller support Huge bosses Sound design &amp; Music by Hyperduck Soundworks Dogs wearing smoking jackets",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/328510/header.jpg?t=1631645748",
    "Price": 14.99,
    "Developers": "Retro Dreamer",
    "Publishers": "Retro Dreamer",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/328510/ss_f8f300ecb6581cd45592bec51bc5291a745e3e7e.1920x1080.jpg?t=1631645748,https://cdn.akamai.steamstatic.com/steam/apps/328510/ss_07d0b27690be0c99eecfd5f7cb307fda6be9d9b5.1920x1080.jpg?t=1631645748,https://cdn.akamai.steamstatic.com/steam/apps/328510/ss_cabf0f1512e662dc13f0f84079bf55e9a97a5bc7.1920x1080.jpg?t=1631645748,https://cdn.akamai.steamstatic.com/steam/apps/328510/ss_df4c5253e124160eb5858d9a1ea0e685f5a416d4.1920x1080.jpg?t=1631645748,https://cdn.akamai.steamstatic.com/steam/apps/328510/ss_94fb4f08740f933917f430b239ee2ea6b22d98bc.1920x1080.jpg?t=1631645748",
    "Slug": "monsters-and-monocles",
    "Meta Title": "Monsters and Monocles: Aug 16, 2016, Retro Dreamer and Fu...",
    "Meta Description": "Looking for information on Monsters and Monocles? Check out the release date (Aug 16, 2016), developer insights from Retro Dreamer, and a complete game ...",
    "Alt Text Image": "Official header image for Monsters and Monocles game - Steam 328510",
    "Canonical URL": "https://gusku.site/game/monsters-and-monocles",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Monsters and Monocles\", \"description\": \"Looking for information on Monsters and Monocles? Check out the release date (Aug 16, 2016), developer insights from Retro Dreamer, and a complete game ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 16, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Retro Dreamer\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Retro Dreamer\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/328510/header.jpg?t=1631645748\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}