{
    "AppID": 846470,
    "Name": "Moss",
    "Release date": "Jun 7, 2018",
    "About the game": "Moss™ is a single-player action-adventure puzzle game and new IP from Polyarc tailor-made for the VR platform. It combines classic components of a great game—such as compelling characters, gripping combat, and captivating world exploration—with the exciting opportunities of virtual reality. In Moss, players meet Quill, a young mouse with dreams of greatness beyond the confines of her settlement. While exploring the woods, she finds a mysterious Glass Relic and an ancient magic is awakened. With her uncle now in grave danger, Quill must embark on an epic journey—and she needs you there by her side. Together, you'll travel to forgotten realms, solve challenging puzzles, and battle menacing enemies. Alone, no one can conquer what you're up against. But united, you just may defeat even the darkest of villains. Gameplay Reach into The World of Moss Your every action has meaning. Moss takes full advantage of today’s virtual reality technology, letting you move objects, battle enemies, and manipulate the field of play as the key ally to our hero, Quill. Adventure to Fantastic Places Travel to a lively world that hums with wonder and legend. Explore caves, forests, and foreboding ruins that are filled with ancient artifacts, mysterious creatures, and sprawling views. Form a Unique Bond Your abilities are complementary to Quill’s in an alliance for the ages. Combine classic, action-adventure controls with a world that responds to your touch. Solve puzzles, combat evil, and achieve victory together. A Story Told Unlike Any Before From its opening pages, Moss will draw you into a first-of-its-kind fully immersive world of myth and magic. Enjoy a rich tale of intriguing characters, illustrious artifacts, and legends old and new. Moss Soundtrack Jason Graves brings to life the melodic and playful adventure in Moss from the hero Quill’s perspective. Graves accomplishes this by employing small and intimate-sounding instruments composed, arranged, and produced in a pastoral soundscape with enchanting Waltz-esque flair. The soundtrack consists of 11 in-game tracks with more than 57 minutes of music, including the bonus track “Home To Me,” featuring YouTube sensation Malukah.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/846470/header_alt_assets_7.jpg?t=1641329898",
    "Price": 19.49,
    "Developers": "Polyarc",
    "Publishers": "Polyarc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/846470/ss_058b6f5dfdcafbb3ebb70645e6f04e1462009cd6.1920x1080.jpg?t=1641329898,https://cdn.akamai.steamstatic.com/steam/apps/846470/ss_fd0fbd88d7ec3e0c885b8644c1433d37dfe465eb.1920x1080.jpg?t=1641329898,https://cdn.akamai.steamstatic.com/steam/apps/846470/ss_f6743dffc8644dc95bcd0cb2f5182e140a9cc4ee.1920x1080.jpg?t=1641329898,https://cdn.akamai.steamstatic.com/steam/apps/846470/ss_e5b3f8b8da401a58094a6ef5893d871a087bec97.1920x1080.jpg?t=1641329898,https://cdn.akamai.steamstatic.com/steam/apps/846470/ss_73817cb39c3fc0a74491bd4949572818d730e7da.1920x1080.jpg?t=1641329898",
    "Slug": "moss",
    "Meta Title": "Moss: Jun 7, 2018, Polyarc and Full Overview",
    "Meta Description": "Looking for information on Moss? Check out the release date (Jun 7, 2018), developer insights from Polyarc, and a complete game summary.",
    "Alt Text Image": "Official header image for Moss game - Steam 846470",
    "Canonical URL": "https://gusku.site/game/moss",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Moss\", \"description\": \"Looking for information on Moss? Check out the release date (Jun 7, 2018), developer insights from Polyarc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 7, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Polyarc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Polyarc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/846470/header_alt_assets_7.jpg?t=1641329898\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}