{
    "AppID": 1912620,
    "Name": "Natalia",
    "Release date": "Mar 2, 2022",
    "About the game": "A remote island country, the Kingdom of Arias. Natalia, who lives there, lived a free-spirited life while running a shop for everything. One day under Natalia, a strange work comes in. It is to hire a maid exclusively for the second prince Creto from the common people. It was caused by an event that caused a little noise in the town. The client of the job strongly wanted to be hired by this maid, and Natalia himself He asked me to do my best to be hired. Natalia receives the request with one reply in front of the exceptional reward. Can Natalia do this work involving the royal family properly? Natalia A girl who runs a shop in the town of Corona near the Royal Palace in the Kingdom of Arias. With fun as our motto, we value our relationships with the people of the town. I love money, and if I have a lot of rewards, I can do dangerous work without hesitation. He has a positive and cheerful personality and lives honestly with his feelings. Creto Carlton /capture character Second Prince of the Kingdom of Arias. He is living a free-spirited life because his excellent brother has succeeded to the throne. Do something out of the ordinary in a mood shop. Tired of living in a boring royal palace, he has a keen interest in the nearest town of Corona. Only Oswald and Elvira are set aside, and they are separated from the others. It is isolated. Only eccentricities are noticeable to people, and they are called metamorphosis princes in the streets. Oswald Russells /capture character A servant of Creto, the second prince of the Kingdom of Arias. As an escort, he is always by his side as Creto's sword. He has had a relationship with Creto since he was a child, and his sword arm is the best in the country. It is kept away from the surroundings, probably because of its quiet personality. It is called Oz by the close Creto and Elvira. Niro /capture character A young man who lives with Natalia and runs everything together. He has spent time with Natalia since he was a child and has a family-like relationship. I like Natalia, but the distance is too close to be noticed. In addition, I think that it is not necessary to forcibly proceed with the relationship, and accept the current relationship obediently. Elvira A servant of Creto, the second prince of the Kingdom of Arias. As a maid, she has been taking care of Creto's personal belongings since she was a child. He is like Creto's older sister, playing with Creto in his spare time. Maybe because he is close to Creto, he doesn't get along well with other maids. It is called El by the close Creto and Oswald. The player becomes the main character and chooses his own destiny. Bring happiness to his beloved and many others. Visual novel. This work includes elements of sexual activity and disagreeable sex. Contains nudity or sexual content. There are depictions of drugs and alcohol. Contains explicit or fresh adult sexual content. Fixed text box design to improve character recognition rate in OCR translation.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1912620/header.jpg?t=1646210110",
    "Price": 9.99,
    "Developers": "MagicHouse",
    "Publishers": "MagicHouse",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_785464306a06a0b9d01ea2d3986448d2b582af36.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_9ea87fabf1185556ff6f9b7ba6da7002678e512a.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_527b19aea742c731355ab281b3f4720e023f621c.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_0f3c6363ce81426a81e6bf282e68a0fcca3db10a.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_cd54dffb1301ebd6b4741e9f5055acc88a2bac92.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_4804ab07f4211a574c6f1a6e98f92920102c897e.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_477477831a0de10ef688f970964662fad624aa03.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_cd52132fa1939615d90cbd8b23e8c820fca2e7a1.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_1dda9e023129c2c8e158dbfd901811990ef6520f.1920x1080.jpg?t=1646210110,https://cdn.akamai.steamstatic.com/steam/apps/1912620/ss_b0b7f13061584d8139546023d76bf17394c4e27e.1920x1080.jpg?t=1646210110",
    "Slug": "natalia",
    "Meta Title": "Natalia: Mar 2, 2022, MagicHouse and Full Overview",
    "Meta Description": "Looking for information on Natalia? Check out the release date (Mar 2, 2022), developer insights from MagicHouse, and a complete game summary.",
    "Alt Text Image": "Official header image for Natalia game - Steam 1912620",
    "Canonical URL": "https://gusku.site/game/natalia",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Natalia\", \"description\": \"Looking for information on Natalia? Check out the release date (Mar 2, 2022), developer insights from MagicHouse, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"MagicHouse\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"MagicHouse\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1912620/header.jpg?t=1646210110\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}