{
    "AppID": 1432890,
    "Name": "NinjaGirlArune",
    "Release date": "Feb 5, 2021",
    "About the game": "[All H-scenes animated + voiced! All H-scenes in this NoTears title are animated and voiced! The game features voice actors, and the characters will speak in the action and story parts, as well as in the sex scenes! [System] A powerful action game using Unity! The game also comes with a slippery animation using Spine! It's a great game, but it's not the only one. Action game. This is the first time NoTears has included a horizontal action game! The 'Skill Card System' is used to enable not only normal attacks, but also super powerful skill attacks! There are a variety of cards to choose from. Cards that can attack or heal from a wide area. Some cards have effects that enhance other cards: ......! For example. If you use a card with low power but capable of continuous firing and a card that increases the power of other cards' skills, you can use it at the same time. 'Super bombardment with super strength! And more! Try out different card combinations to create the most powerful deck ever! Story. Arne lives a peaceful life as Kunoichi in a small village. She spends her days peacefully with her boyfriend, Kenji, and her best friend, Sakura, but when they can't get along with each other, Sakura can't stand it and makes a move to get them together. The story begins when Sakura, who can no longer tolerate Kenji and Arne's inability to develop a love affair with them, makes a move to bring them together, not knowing that it will change the fate of everything. Little does she know that it will change the fate of everything. ...... [Introduction of the heroine] Arne (CV Amane Hano) 'Hi!' Kenji, I'm home! I'm home, oh, I'm home~ The main heroine of this work. She sincerely cares for Kenji, who lives with her, and is a big sister who becomes goofy and indulgent when she's with him. Kenji and Arne are not related by blood, but due to an incident in the past, they come to live together under one roof. She lives as a kunoichi and spends her days peacefully, mainly using ninjutsu to keep monsters out of the village and harvesting medicinal herbs as her job. He is rumored to be the most beautiful girl in the village, and although he doesn't realize it, she is beautiful in appearance and has big breasts. Especially in front of her loved ones, she has a kindness that embraces them and is like a bundle of motherhood. Sakura (CV Suzune Amasone) 'Who do you think you are? You're not going to get caught with a trooper like that. The sub-heroine of this work. She is Arne's best friend and a good friend of Arne. She knows that Arne has feelings for Kenji and wishes he would just get together with her. While Arne has no sexual knowledge, Sakura has a lot of sexual knowledge and often jokes with Arne about it. She understands 'the strength of being a woman' and often plays tricks on men. She has a passionate fan base in the village. In contrast to the maternal Arne, she has the impression of a demonic woman. Mea (CV Haneki Riru) unidentified (All charactres are 18 years of age or older)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1432890/header.jpg?t=1612756795",
    "Price": 24.99,
    "Developers": "NoTears",
    "Publishers": "NoTears",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_043d323887c23e53589568c8c955032e85f5ec90.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_43ef2975f4f1c3234d3ff10b24788f6239866ed2.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_62cd18d7673de146bd7d0c8cc2c88aace2813035.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_cb87cb4a5507ae146b352625babeee606b83a903.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_26ebbca085c5bcf9119b7cf0234616b5ec124d70.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_aea158891b3e8883f47d1c9ea84a5cb6505469a0.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_bf211b3198a069bd5df6b6242692cae9341f4e3b.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_c217e8934bcbd3bf76975db9dc72bed30a40fe23.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_b5e01a6182813e4f679e9cf738975ed0e90db6a3.1920x1080.jpg?t=1612756795,https://cdn.akamai.steamstatic.com/steam/apps/1432890/ss_60f5b29cc4bd3dc29a0fd73754b2c1344de6fb97.1920x1080.jpg?t=1612756795",
    "Slug": "ninjagirlarune",
    "Meta Title": "NinjaGirlArune: Feb 5, 2021, NoTears and Full Overview",
    "Meta Description": "Looking for information on NinjaGirlArune? Check out the release date (Feb 5, 2021), developer insights from NoTears, and a complete game summary.",
    "Alt Text Image": "Official header image for NinjaGirlArune game - Steam 1432890",
    "Canonical URL": "https://gusku.site/game/ninjagirlarune",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"NinjaGirlArune\", \"description\": \"Looking for information on NinjaGirlArune? Check out the release date (Feb 5, 2021), developer insights from NoTears, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 5, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"NoTears\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"NoTears\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1432890/header.jpg?t=1612756795\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}