{
    "AppID": 1217310,
    "Name": "One True Cuddle",
    "Release date": "Sep 2, 2020",
    "About the game": "A top-down platformer where you play as a rabbit that's kidnapped, to avoid all obstacles and find your way back to your owner. But... *something else is happening* SYNOPSIS Starting from a certain rabbit race, you were kidnapped by a group of aliens to execute some kind of experiment. From there, you'll be forced to join a certain experiment and get yourself some mystical alien power to assist you in reaching your One True Cuddle , your true owner. STAGE TYPES SURVIVAL : Stay uncuddled (not dead) until the time is up! RUSH : Clear the stage as fast as you can! PUZZLE : Leisurely solve the puzzle and reach the goal! AREA BOSS : Just plain and simple, defeat every enemies in the room! WHAT CAN YOU DO? Clear the stages, collect stars and reach the different endings depending on the sum! Stomp on certain enemies to stun and damage them! For every boss you beat, you get a special genetic form you can change into! Each gene gives you different special abilities to disturb the enemies. CHARACTERS INTRODUCTION Punny It's our lovely and speedy rabbit that's super extra careful at distancing from strangers. Also a master at stomping on things. Lanny She is your owner. She is kind, caring, and won't hug too strongly for selfish pleasure. Choco An alien cat with straight personality. But not straight 'preference'. Probably. She is the first one to greet you in this place. It's as if she is a fanatic for cute things, she gets brainwashed to hug so aggresively each time she sees cute thing. Buboo A literally alien-like alien that indiscriminately gobbles things just to fill its belly when hungry. But it's not as if it can't determine what to actually eat. It launches things it won't eat up above instead of digesting them. Mumu An alien dog with high level of curiousity. She only cares for what catches her attention and simply want to start experiment on it. She will only run for you if you are nearby, cause she has extremely narrow vision. But be careful as she is extraordinarily fast! Rabbot A robot that is programmed to hunt rabbits. Due to some strange programming script code in its intelligence system, it speaks up a lot of lame jokes, even with combo if necessary. It shoots up a rabbity laser beam to make rabbit trip over it. The laser ignores height, so a mere jump is useless. Sirum A slime consisting of bizarre things that enable it to speak somehow. It's very much a certainty that it can divide itself while still owning one personality despite how many it can become. Divides periodically or after being stunned and can't be stomped. Biorny An alien frog that is very smart and a bit sleepy most of the time. She acts as if she is the leader of this place, even if she's not, but she really knows what she is doing. She can run or even jump to catch you if necessary. She can even move above water. Piria One of the three fairy stooges. She is very nice to all living beings, including you, so that she supports you with her power. Lucia One of the three fairy stooges. She is obedient to her leader, but she doesn't want to directly dirty her hands, so that she supports your pursuers with her power. Tania One of the three fairy stooges. She is very naughty and loves to trick people. And she is interested in what will happen if you lose, so she disrupts you with her power. ?????? Unknown *?*?*?*?*?*?*?*?*?*?* He claims to be a Space Spirit as an alias to the usual 'alien'. ????? Unknown *?*?*?*?*?*?*?*?*?*?* At least I will tell you that she uses sword ... to cuddle you!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1217310/header.jpg?t=1600058216",
    "Price": 2.99,
    "Developers": "Adhiesc",
    "Publishers": "Adhiesc",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1217310/ss_13ddc73a0cd2425070f2aa7faf62f4b26b0ac32b.1920x1080.jpg?t=1600058216,https://cdn.akamai.steamstatic.com/steam/apps/1217310/ss_a7e9733b7bb187be202063f45136c7be46476a5b.1920x1080.jpg?t=1600058216,https://cdn.akamai.steamstatic.com/steam/apps/1217310/ss_46b536b1618714805ec69c12a1a8cca4469087b3.1920x1080.jpg?t=1600058216,https://cdn.akamai.steamstatic.com/steam/apps/1217310/ss_544b9cafbaabda07276644eb511a726f4767c979.1920x1080.jpg?t=1600058216,https://cdn.akamai.steamstatic.com/steam/apps/1217310/ss_0c913f0e9ae01b3801b47e2f7b6dd83f86f06dca.1920x1080.jpg?t=1600058216",
    "Slug": "one-true-cuddle",
    "Meta Title": "One True Cuddle: Sep 2, 2020, Adhiesc and Full Overview",
    "Meta Description": "Looking for information on One True Cuddle? Check out the release date (Sep 2, 2020), developer insights from Adhiesc, and a complete game summary.",
    "Alt Text Image": "Official header image for One True Cuddle game - Steam 1217310",
    "Canonical URL": "https://gusku.site/game/one-true-cuddle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"One True Cuddle\", \"description\": \"Looking for information on One True Cuddle? Check out the release date (Sep 2, 2020), developer insights from Adhiesc, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 2, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Adhiesc\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Adhiesc\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1217310/header.jpg?t=1600058216\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}