{
    "AppID": 1833730,
    "Name": "Our Battle Has Just Begun! episode 2",
    "Release date": "Mar 2, 2022",
    "About the game": "Introduction This new country that awaits you is the forest country of Roseail, land of elves and beastmen! Oma may have saved the realm from the Demon Lord, but he has somehow overwritten all of these memories with memories of his past life. This is your typical adventure visual novel filled with heroes and heroines...except it starts where games usually end. Episode 2 is here! As you read through the story of the game, you'll find choices . The choices you make in game drastically change the story, and the Hero and his heroine's fate . Avoid the challenges and happy endings with heroines in a new country to continue on your journey back to your homeland. This new country that awaits you is the forest country of Roseail, land of elves and beastmen! Enjoy a comical and slightly serious story with our still largely inexperienced protagonist! Keep an eye out for the beautiful new heroines the Hero meets in this episode! Story Roseail, the forest country, consists of a vast woodland dotted with elven and beastmen towns. After leaving Alard, the country of plenty, the Hero and his party visit Jarn, a Roseailian town with a booming dungeon business. Since no national ceremonies are planned this time around, the Hero looks forward to a leisurely stay. That is until he meets the commander of the guard, an adventurer, and a visiting representative of Roseail. What secrets dwell in the adventurers' coveted dungeons? 'Follow the Hero and his party as they face brand new challenges in a novel land!' Character Commander of the Guard, Mana Mana is a wolf beastgirl and commander of Jarn's guard. A prodigy who became the youngest commander in the history of the force, she works with the older members of her team to ensure the security of the town of Jarn. As the town grows, the number of adventurer-induced problems increases rapidly. This is what Mana and the guard have been forced to deal with. The Representative, Synsya Synsya is an elven woman who serves as the representative of the forest country of Roseail. By mediating the interactions between previously antagonistic races, she has become the driving force behind Roseail's national unification. She is currently touring Roseail's many towns to enact important policies that address their many problems. However, her harsh decision making is said to have turned many people against her. The Adventurer, Taylor Taylor is a former mercenary turned adventurer and fighter who wields a large sword. She was a mercenary for the allied forces during the war against the Demon Lord's army. After the war, she stayed in Jarn and became an adventurer. Although she isn't very sociable, she has an unusually good reputation among the townsfolk of Jarn.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1833730/header.jpg?t=1646232272",
    "Price": 9.99,
    "Developers": "VRIDGE INC.",
    "Publishers": "VRIDGE INC.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_a44b54b106b39b1129d83da2a45cc857cc3e9226.1920x1080.jpg?t=1646232272,https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_0c847e19358500efbf2ce5be22673d59bf4b201a.1920x1080.jpg?t=1646232272,https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_93a49c6dd35c4c3b5530f0b5440b4e3d4865df0c.1920x1080.jpg?t=1646232272,https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_41964cbb0f55083cf27ea734053319305a8c3857.1920x1080.jpg?t=1646232272,https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_68550cad327ca8750a2f045144eb464979125f03.1920x1080.jpg?t=1646232272,https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_f2c26ad47800aac6b902a059313c06ccb9c2fff5.1920x1080.jpg?t=1646232272,https://cdn.akamai.steamstatic.com/steam/apps/1833730/ss_8fa38e0ddaa5c976ef56ecb6e16c8779873fd2be.1920x1080.jpg?t=1646232272",
    "Slug": "our-battle-has-just-begun-episode-2",
    "Meta Title": "Our Battle Has Just Begun! episode 2: Mar 2, 2022, VRIDGE...",
    "Meta Description": "Looking for information on Our Battle Has Just Begun! episode 2? Check out the release date (Mar 2, 2022), developer insights from VRIDGE INC., and a co...",
    "Alt Text Image": "Official header image for Our Battle Has Just Begun! episode 2 game - Steam 1833730",
    "Canonical URL": "https://gusku.site/game/our-battle-has-just-begun-episode-2",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Our Battle Has Just Begun! episode 2\", \"description\": \"Looking for information on Our Battle Has Just Begun! episode 2? Check out the release date (Mar 2, 2022), developer insights from VRIDGE INC., and a co...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Mar 2, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"VRIDGE INC.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"VRIDGE INC.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1833730/header.jpg?t=1646232272\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}