{
    "AppID": 934930,
    "Name": "RDS - The Official Drift Videogame",
    "Release date": "Jun 6, 2019",
    "About the game": "RDS - The Official Drift Videogame is the licensed version of the Russian Drift Series in the Cyper Sport world! Become a member of professional drift competitions on famous tracks. Compete with real players around the world. Feel the realistic physics of simulator of the new generation, which has received fresh improvements and further development in the game. Enjoy an advanced styling and technical tuning system. Real drift competitions come to Cyber Sport! TECHNOLOGIES NEXT GEN physics for the most realistic and accurate drift Real-time multiplayer with unique TryTime network latency minimization technology for the best tandem drift and online competitions New photorealistic graphics shaders A rich sound engine created by a unique technology VR (Virtual Reality) - full support for HTC Vive, Oculus Rift and all other helmets Support for all steering wheels with detailed feedback Keyboard and gamepad control Mouse control Support for multiple input devices simultaneously Motion platforms (Motion Simulator) support (original protocol | Sim Tools | GameSTUL) 5760x1080 resolution support for playing on three monitors (Triple Screen) Widescreen monitors 21: 9, 32: 9 and 48: 9 support as well as full-screen modes and wide windows on standard monitors GAME MODES Online Competitions in real time with broadcast on YouTube according to the rules and traditions of real events with live judges and commentators! Global ranking of all pilots of the cybersport world. Promotion up for victories in races. This rating is for qualifying for online competitions. Apply for participation and become a pilot in real drift championship! Judging by the real rules! Online multiplayer in real time. Train with friends, compete with drift fans around the world. Tandem drift is more convenient than ever! Race with your own ghost - recording your best ride on the track for the convenience of training Competition with the best records of other real players Training - a single race on any track to hone skills or just for fan GAMERS COMMUNITY Full Steam social support. Invite friends. Meet drift fans from around the world in the game and ride together View player profiles online, add to friends Teams. Create your own team, recruit pilots and compete with other teams / DEVELOPMENT / Global game chat Game room chat / competition lobby chat HIGH-DETAILED CAR MODELS 16 new cars are available immediately when purchasing a game without purchasing DLC High-poly car models of the highest degree of development and quality Available to use the headlights, alarm and car horn Japanese, German, Russian and American cars All the cars appearing in this game are fictitious. Any resemblance to real cars is purely coincidental TRACKS Real-life famous tracks of Japan, Russia, USA, Canada, Germany and other countries Several configurations (judicial assignments) for each track Training bases and drift parks for freestyle drift All tracks are available immediately when purchasing a game WEATHER AND TIME OF DAY Choose the time of day and weather. Different air and asphalt temperatures affect engine performance and tire grip. Different lighting and atmosphere on the tracks PHYSICS AND CAR TUNING A unique physical simulation of the tires of the car feels like reality Absolutely new physics based on nVidia Physics technology guarantees the definition of physical processes Improving and tuning the engine / choosing ECU control program / limiting the maximum power for maximum tire friction Improved suspension and steering for eversion of the front wheels Understatement and adjustment of the suspension / wheel alignment / gathering &amp; camber Strengthening body rigidity Clutch and transmission / acceleration of gearshift time / reduction of transmission inertia Reducing the weight of the car due to the installation of lightweight parts and the removal of unnecessary elements for better control in the drift Tire selection and pressure settings in them separately for the front and rear wheels Swap engine with changing characteristics and sound. 10 legendary engines All installed parts have their own weight, which affects the overall weight of the car CUSTOMIZATION Create a unique design for your car Expanded system of vinyls, layers, materials and colors with new features 100 layers and more than 840 unique vinyls for application to the car 60 different HIGH-DETAILED wheels available PLAYERS PROFILES Player profiles are stored on Steam Cloud. Damage or disappearance of profiles is excluded. You can play on any computer from anywhere in the world, change the computer and reinstall the OS GAMEPADS &amp; STEERING WHEELS Support for the keyboard and all types of gamepads, steering wheels and other controllers. Support for multiple controllers at the same time (for example, separate steering wheel, pedals and handbrake) ARKADY TSAREGRADSEV Now my BadAss VR34 in the game will give heat! Do not relax! Ark Tsaregradsev ALEKSANDR GRINCHUK / GRINYA My DPRO-Z from hot Odessa is waiting for you in the game! Aleksandr Grinchuk ddKaba Dude! You can give an angle on my FLANKER in this great game! Sergey Kabargin - ddKaba FEDOR VOROBYEV Really interesting game in terms of no precedent in the world of drift. Familiar tracks and an exclusive opportunity to ride on ZHIGATSAR! Recommend. Fedor Vorobyev / RDS GP pilot ILYA FEDOROV In this game, I got emotions close to those from a real drift Ilya Fedorov / RDS GP pilot RDS GP OFFICIAL COMMENTATOR I look forward to online battles with interest. Sure, the fight will be as hot as at the present stages of RDS GP. RDS GP official commentator Nikolay Svistoun",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/934930/header.jpg?t=1576909884",
    "Price": 17.99,
    "Developers": "Drift Physics Crew",
    "Publishers": "Drift Physics Crew",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_2d25fbf8285e176f248b07fbcab9befc68034f45.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_d43436add15d27e60e3e83d5de8d35245d70fa95.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_8212b981570e062ff8aab05d584497f4786b1810.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_0faae64e6f2aaa453383f0d6d52d8f8bfda6a04a.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_94e7f6f2b01cf3bdf99c67637fc941beb42c3bcf.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_37a4b8abca07319458f8336235b50489e0115173.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_383e820e6813b6c2e2d300efa6e3204fdd7457cb.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_d522a5771c04b3b8fa97c202926014991cd4a4de.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_9c92090ea0ce3c97c2e7f8f3bbecc964ff08aa5c.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_1220ba84f847c4a8652538d8f7c34d57b57dc035.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_1a639c2a8cef5721cd761c37805d6392e0509056.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_d4f7dffb8d49da7c09bf2dd7ca7adcdf79fc781d.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_d2d74a56d9b2c3ea9fa560001c5e3088909ad61d.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_174fd5b63b4dd5a3e73f9037e3660675fca419dc.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_ca77be972cb2e8342b1f4a6883e45f027483ed74.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_498142b2366b2fbe8b6c9d03b2f8519cacca53e3.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_2c77a1c6f4b9432729834840572bce62fecba32a.1920x1080.jpg?t=1576909884,https://cdn.akamai.steamstatic.com/steam/apps/934930/ss_8e1a929e0e506c7183d95ee002b8309d90ceb81b.1920x1080.jpg?t=1576909884",
    "Slug": "rds-the-official-drift-videogame",
    "Meta Title": "RDS - The Official Drift Videogame: Jun 6, 2019, Drift Ph...",
    "Meta Description": "Looking for information on RDS - The Official Drift Videogame? Check out the release date (Jun 6, 2019), developer insights from Drift Physics Crew, and...",
    "Alt Text Image": "Official header image for RDS - The Official Drift Videogame game - Steam 934930",
    "Canonical URL": "https://gusku.site/game/rds-the-official-drift-videogame",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"RDS - The Official Drift Videogame\", \"description\": \"Looking for information on RDS - The Official Drift Videogame? Check out the release date (Jun 6, 2019), developer insights from Drift Physics Crew, and...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 6, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Drift Physics Crew\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Drift Physics Crew\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/934930/header.jpg?t=1576909884\", \"offers\": {\"@type\": \"Offer\", \"price\": 17.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}