{
    "AppID": 808220,
    "Name": "SCP-087 VR Survivor",
    "Release date": "Jan 28, 2019",
    "About the game": "Welcome to the SCP-087 VR Survivor. This is a small indie survival rogue-like horror game based on the SCP foundation lore. My name is AlexTheCreator and I am the author of this game. I'm gonna quickly explain o you quickly what this is game about. The original SCP-087 story is based on an infinite stairwell. If you are SCP-fan like me, you might remember the first SCP-087 game which was just basically a walking simulator. It was unique when it first released, however it isn't that much now. Nowadays you can't just enjoy a game where you walk down some stairs while getting scared by simplest jumpscares. Even in VR... Trust me, I made the first version of this game just like I've described above. Nothing special, very simple and not entertaining at all. So I havedecided to turn the tables! SCP-087 can have a huge effect on the subject's mind... So now you are one of the SCP Scientists which, for unknown reasons, had gotten inside SCP-087. You start off by regaining consciousness and see different corridors in front of you. The setting is like a basement. You recall that something similar was written in one of the classified documents on SCP-087, and you understand that there is no other solution for you than begin looking for a way out. SCP-087 is afraid of light and noise, that's why you'll have to collect all the objects that can make noise, help craft torches, repair lamps and prevent SCP-087-01 from getting you. Your goal is to survive in a procedurally generated world filled with danger and loneliness. There is 2 games inside I decided to publush 'stairwell' version too, if you pusrchase the game, second one located in same directory. To launch the 'stairwell' version you need to find SCP-087 VR Survivor in your steam library, press Right Mouse Button on it and select 'Play SCP-087 original lore VR'. Enjoy! :) Features Procedural-generated levels. Every single play would be unique Don't get hungry and dont loose your mind! Control your hunger by eating and sanity by sound and light Craft items to survive as long as you can Realistic Physical-Based Rendering textures. Better than crysis! Motion controllers support First survival SCP game It's indie! Every feedback and feature request are welcome What is SCP-Foundation? SCP Foundation is a secret organization entrusted by governments around the globe to contain and study anomalous individuals, entities, locations, objects, and phenomena operating outside the bounds of natural law. If left uncontained, the objects would pose a direct threat to human life and to humanity's perceptions of reality and normalcy What is SCP-087? SCP-087 is a staircase that appears to descend downwards forever. The staircase is inhabited by SCP-087-01, which is described as a face without a mouth, pupils or nostrils.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/808220/header.jpg?t=1548767499",
    "Price": 14.99,
    "Developers": "AlexTheCreator",
    "Publishers": "AlexTheCreator",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_eb2db3f3e6465a224949322ee16e5202925f0659.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_12fc82e3c30df575600459ad1349e87cb0a0cc3d.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_ac5d4a3677536c615dd5fb360d67c89f2dc5c6ed.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_d23240c9eb6f2b4d3c11677892ad6fdc1b783752.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_e83f4f54312ce22cff908cbdb3942b4215359504.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_91489f49e2c9b05cd43a5bdd356bcca9769cd832.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_afbe475b79d7c9251a6ea8e87eedb5add89ff5a3.1920x1080.jpg?t=1548767499,https://cdn.akamai.steamstatic.com/steam/apps/808220/ss_b98036acfd0a2689ee5afad74245d4450a94f482.1920x1080.jpg?t=1548767499",
    "Slug": "scp-087-vr-survivor",
    "Meta Title": "SCP-087 VR Survivor: Jan 28, 2019, AlexTheCreator and Ful...",
    "Meta Description": "Looking for information on SCP-087 VR Survivor? Check out the release date (Jan 28, 2019), developer insights from AlexTheCreator, and a complete game s...",
    "Alt Text Image": "Official header image for SCP-087 VR Survivor game - Steam 808220",
    "Canonical URL": "https://gusku.site/game/scp-087-vr-survivor",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SCP-087 VR Survivor\", \"description\": \"Looking for information on SCP-087 VR Survivor? Check out the release date (Jan 28, 2019), developer insights from AlexTheCreator, and a complete game s...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jan 28, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"AlexTheCreator\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"AlexTheCreator\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/808220/header.jpg?t=1548767499\", \"offers\": {\"@type\": \"Offer\", \"price\": 14.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}