{
    "AppID": 1583660,
    "Name": "Shiba Inu Rescue",
    "Release date": "May 21, 2021",
    "About the game": "Embark on this action-adventure journey of Yuki, who is on her way to rescue her puppies from the world's troubles. Yuki's puppies are always up to something that makes her worried and wander around. She knows that this countryside is packed with wild animals. Moreover, Brutus (The famous DogCatcher) of the town is always on a mission to capture dogs. It's a dangerous world out there. One fine day, Yuki prepared the finest meal for her puppies. She was so happy that puppies would enjoy this delicious food. Little did she knew that this day would be a nightmare for her. As she went out from her home to call her puppies, she could not find them anywhere. The naughty puppies have lost again. This is where your adventure starts. It's time to be in the shoes of Yuki. Help her in finding her cute puppies and bring them back home safely. Beware of Brutus and the Wild Animals. You have to use your dodging tactics to survive. Shiba Inu Rescue is a colorful 2D action-adventure game that will remind you of some classic games like Mario. Let's relive the retro moments one more time. :) Yuki must take on this challenge for her puppies. Run, Jump, and Dodge to survive the obstacles and make your way to the different levels. The game is super fun to play with much easier controls. Move Yuki left by pressing ‘A’ and move her right by pressing the button ‘D’ If you want to make her jump, press spacebar. It's that simple, however it has so much fun that it will immerse you into this colorful world. How to control Yuki? Shiba Inu Rescue is a huge fun to play. The game carries simple and easy controls. Move your character Yuki left by pressing ‘A’ and move her right by pressing the button ‘D’. If you want to jump? Press Spacebar. It's that simple, however it has so much fun that it will immerse you into this colorful world. Key Features • Fun and addictive gameplay • Cute setting that reminds you of some of the classic video games • Simple and easy controls. • Beautiful Graphics • Immersive Experience Notice Shiba Inu Rescue will be released in 2 parts with more enemies and bosses coming soon. Play &amp; Contribute Towards Animal Protection We love animals! We have decided that a portion of the proceeds will go towards local no-kill animal shelters near our area. Hopefully, we will extend our support to a more no-kill animal shelter in the future. Let's play this addictive game and automatically contribute to this beautiful cause.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1583660/header.jpg?t=1621653967",
    "Price": 4.99,
    "Developers": "Keoasa",
    "Publishers": "Keoasa",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1583660/ss_a52b07777d57742a5af2c2aef5dc25aaf75a2d6b.1920x1080.jpg?t=1621653967,https://cdn.akamai.steamstatic.com/steam/apps/1583660/ss_65270736c4b137a50b76289afba36994269b1d4c.1920x1080.jpg?t=1621653967,https://cdn.akamai.steamstatic.com/steam/apps/1583660/ss_59ae8c73523d521674682c201c693d9d12bef482.1920x1080.jpg?t=1621653967,https://cdn.akamai.steamstatic.com/steam/apps/1583660/ss_0979cd249826fb461519ef08e0bc0b60901b5d16.1920x1080.jpg?t=1621653967,https://cdn.akamai.steamstatic.com/steam/apps/1583660/ss_e5651f0f4aac7e4c2621c8bf64c20de74b0afef1.1920x1080.jpg?t=1621653967",
    "Slug": "shiba-inu-rescue",
    "Meta Title": "Shiba Inu Rescue: May 21, 2021, Keoasa and Full Overview",
    "Meta Description": "Looking for information on Shiba Inu Rescue? Check out the release date (May 21, 2021), developer insights from Keoasa, and a complete game summary.",
    "Alt Text Image": "Official header image for Shiba Inu Rescue game - Steam 1583660",
    "Canonical URL": "https://gusku.site/game/shiba-inu-rescue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Shiba Inu Rescue\", \"description\": \"Looking for information on Shiba Inu Rescue? Check out the release date (May 21, 2021), developer insights from Keoasa, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"May 21, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Keoasa\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Keoasa\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1583660/header.jpg?t=1621653967\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}