{
    "AppID": 510780,
    "Name": "SkyBoats",
    "Release date": "Aug 23, 2016",
    "About the game": "Ahoy SkyBoat captains! Today is your chance to learn to sail the skies, take control of the winds and discover vast riches up in the clouds. In SkyBoats you are a skyfaring merchant who must meet the demands of the three sky cities to become the most successful Sky Captain! In SkyBoats, you’ll use our unique wind-sailing system to hone and display your piloting prowess. Even better, as you improve your skill at the game, SkyBoats will use your evolving rank to consistently give you a satisfying strategic challenge. SkyBoats runs in the vein of Euro-board games and will work your strategy muscle! You will love the satisfaction you gain when you deliver that highly sought-after good to a distant SkyCity, dazzling the citizens and increasing your renown as a Captain. SkyBoats is filled with interesting choices and continues the BrainGoodGames trend of deep and thoughtful games based around our staple single-player ladder! SkyBoats is a strategic gem shining with the art of Tomasz Bigosiński and ringing with the original music of Julian Beutel. In SkyBoats you fly around picking up different goods to sell to cities. The goods also give you the ability to control the winds! Different goods have different wind shapes. When you play a wind the board will now have those wind spaces, and other boats can move into them to sail along the wind. When you sail on the wind your boats gain more prowess and will be able to sell their goods for more Glory! Each wind pattern can also be flipped, allowing you to go the opposite directions. These magical winds also generate goods allowing you to control production. On a turn each of your SkyBoats can use each of its cargo spaces once. Empty cargo spaces can be used to gain fuel. When you fly over goods, you will have the opportunity to pick them up, and place them into your cargo. You must meet enough SkyCity demands before time runs out! SkyBoats is the third game by BrainGoodGames and continues in the tradition of video gaming inspired by board games. Previous to SkyBoats, BrainGoodGames released Militia (Dec. 2015) and Axes and Acres (Apr. 2016). SkyBoats mixes classic Euro Board Game mechanics with our own unique wind mechanic to create another deeply strategic single-player strategy game. / / Deep and engaing single-player strategy. Ladder/ranking system + procedural generation for endless replayability. A satisfying strategic experience in 30 minutes or less. Beautiful Graphics by Tomasz Bigosiński. Adventurous music by Julian Beutel. Another unique system created by BrainGoodGames for a great strategic experience.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/510780/header.jpg?t=1471975196",
    "Price": 7.99,
    "Developers": "BrainGoodGames",
    "Publishers": "BrainGoodGames",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_8e89acac723d9ac08e9137720c8a7d6fc5d156de.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_427ba76b31099ff5d3634842b8232e3bef8d4efa.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_69a09d8946c08d6f471f8c0e6fac781a115716cf.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_9b21fbf857971564913e0d61bcd796e86ca53324.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_83ff07fa71c7c96723721e72d0168c33e20ac043.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_a6bb17214c8c91457de59097c6e6ce1ef946b7c2.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_7470e98911272a59d4ac2a5cdea0a55283cfacc7.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_99841b4621b5929bb35e139ce4ea57cd95828652.1920x1080.jpg?t=1471975196,https://cdn.akamai.steamstatic.com/steam/apps/510780/ss_eda5ebaffaa341891f087cbfa9aa845c1ae3b185.1920x1080.jpg?t=1471975196",
    "Slug": "skyboats",
    "Meta Title": "SkyBoats: Aug 23, 2016, BrainGoodGames and Full Overview",
    "Meta Description": "Looking for information on SkyBoats? Check out the release date (Aug 23, 2016), developer insights from BrainGoodGames, and a complete game summary.",
    "Alt Text Image": "Official header image for SkyBoats game - Steam 510780",
    "Canonical URL": "https://gusku.site/game/skyboats",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"SkyBoats\", \"description\": \"Looking for information on SkyBoats? Check out the release date (Aug 23, 2016), developer insights from BrainGoodGames, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 23, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"BrainGoodGames\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"BrainGoodGames\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/510780/header.jpg?t=1471975196\", \"offers\": {\"@type\": \"Offer\", \"price\": 7.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}