{
    "AppID": 1237980,
    "Name": "STAR WARS™ Battlefront",
    "Release date": "Jun 11, 2020",
    "About the game": "The Star Wars ™ Battlefront™ Ultimate Edition has everything fans need to live out their Star Wars ™ battle fantasies. In addition to the Star Wars Battlefront Deluxe Edition, Rebels and Imperials alike will be able to expand their galaxy with the Star Wars Battlefront Season Pass, which includes 4 expansion packs filled with new content and an exclusive Shoot First emote. Features Immersive and Photorealistic Interactive Entertainment Visit classic planets from the original Star Wars trilogy, detailed with an unprecedented amount of realism and sense of authenticity that will transport you to a galaxy far, far away. Experience amazing digital replicas of the original Star Wars movie models, brought to lifelike fidelity by DICE’s use of photogrammetry technology. Ground-based Combat on a Galactic Scale Engage in epic battles on iconic planets including Hoth, Endor, and Tatooine. Also, bring the fight to the previously unexplored planet, Sullust. Command a diverse set of ground-based vehicles including nimble speeder bikes, massive AT-ATs, and more. Master the Battlefront with Iconic Star Wars Characters Play as some of the most memorable characters in the Star Wars universe including Darth Vader and Boba Fett. Encounter a variety of beloved characters from the original trilogy such as C-3PO and R2-D2. Take to the Skies in Epic Star Wars Dog Fights Pilot the Millennium Falcon, X-wings, TIE fighters, and more of your favorite vehicles in exhilarating aerial combat. Ultimate Edition Includes: Outer Rim Expansion Pack Join Greedo and Nien Nunb in the Outer Rim. Blast your way through new maps, grab the latest gear and make it to the extraction point before it's too late. Bespin Expansion Pack Journey to Cloud City, where you’ll get access to new heroes Lando Calrissian and the bounty hunter Dengar, new weapons and the awesome new Sabotage mode. Death Star Expansion Pack The iconic space station joins Battlefront with new maps, deadly weapons, new heroes, Chewbacca and Bossk, and an all-new game mode set in and around the Death Star. Rogue One™: Scarif Expansion Pack Experience all-new content inspired by Rogue One™: A Star Wars Story, including 4 new maps, heroes Jyn Erso and Orson Krennic and a new multi-stage game mode.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1237980/header.jpg?t=1614940962",
    "Price": 9.99,
    "Developers": "DICE",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1237980/ss_52041f6a2fec4e6275b2bd2ce176e8a33974ed73.1920x1080.jpg?t=1614940962,https://cdn.akamai.steamstatic.com/steam/apps/1237980/ss_cbc09fc5075c34eeb5b1bb95823b4d811ed767bd.1920x1080.jpg?t=1614940962,https://cdn.akamai.steamstatic.com/steam/apps/1237980/ss_bdceba941839b54f97cc7c2aaef66302d9c005d7.1920x1080.jpg?t=1614940962,https://cdn.akamai.steamstatic.com/steam/apps/1237980/ss_cad65e8b278ff0e548c960d655c8cf746bc11239.1920x1080.jpg?t=1614940962,https://cdn.akamai.steamstatic.com/steam/apps/1237980/ss_321d400b28fe19b64563ff819eefe80e3c9691ec.1920x1080.jpg?t=1614940962",
    "Slug": "star-wars-battlefront",
    "Meta Title": "STAR WARS™ Battlefront: Jun 11, 2020, DICE and Full Overview",
    "Meta Description": "Looking for information on STAR WARS™ Battlefront? Check out the release date (Jun 11, 2020), developer insights from DICE, and a complete game summary.",
    "Alt Text Image": "Official header image for STAR WARS™ Battlefront game - Steam 1237980",
    "Canonical URL": "https://gusku.site/game/star-wars-battlefront",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"STAR WARS\\u2122 Battlefront\", \"description\": \"Looking for information on STAR WARS\\u2122 Battlefront? Check out the release date (Jun 11, 2020), developer insights from DICE, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 11, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"DICE\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1237980/header.jpg?t=1614940962\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}