{
    "AppID": 1096930,
    "Name": "Strategic Command: World War I",
    "Release date": "Dec 5, 2019",
    "About the game": "Strategic Command is back, and this time it is bringing you the Great War! Relive this momentous conflict from the opening shots of 1914 to the final offensives. From the bloody fields of Flanders to the sweeping advances in the east, the fighting in Italy, the Balkans and the Middle East, Strategic Command: World War I covers all the main aspects and theatres of the war. Undermine the enemy’s will to resist through diplomacy and political intrigue while mobilizing your forces and developing new technologies and ways of waging war. From the Tank to the Aeroplane, the Submarine to the Aircraft Carrier, this war witnessed a massive outpouring of new weapons, and all of these are at your disposal to research and deploy. Using the same upgraded engine as their recent hex-based WWII Grand Strategy games, Strategic Command: World War I allows you to enjoy the challenges faced by commanders on both sides of the 20th century’s first great conflict. From the High Seas Fleet to Lawrence of Arabia, the Russian Revolution and the Zimmermann Telegram, the war will be won through strategic ingenuity as well as force. Can a German invasion of France capture Paris in a sweeping advance via Belgium? Can a naval blockade defeat the Central Powers? Will Russia succumb to revolution? All these questions and many more are yours to answer. France, Italy, Russia, Serbia, the UK and the USA will be facing off against Germany, Austria-Hungary and the Ottoman Empire in our flagship campaign. Many other countries will likely enter the war on either side, such as Belgium, Greece, Portugal and Romania. Not forgetting of course the immense contribution of the British Empire to the Entente’s war effort. UNITS New unit types have been added including ANZACs, Colonial Corps and Mountain Corps. Units are able to move and entrench, and trenches can be improved through researching Trench Warfare. Naval Mines can be laid to protect your sea lanes – or to impede those of your opponent. Reconnaissance Bombers will fulfil their historic role of spotting for the Artillery. CAMPAIGNS Three campaigns: 1914 Call to Arms, 1914 Triple Alliance (where Italy joins the Central Powers) and 1917 Fate of Nations. • Friendly Majors can be set to be AI-controlled, and this selection can be adjusted at any time in the game. You can even switch sides should you wish to • Games can be played via a PBEM++ Multiplayer server with a Challenge Lobby and seamless in game sending/receiving of turns • The war is fought on a 20 mile per hex map of Europe, North Africa, the Middle East and the Atlantic, as seen in our recent WWII: War in Europe release, though with some special modifications suitable for WWI, such as the addition of Ypres and Gallipoli • Victory will require developing new military doctrines to improve your commanders’ abilities, the combat effectiveness of your units, and even your ability to deploy new technologies like the Tank and Fighter aircraft • You can minimize the Decision box to examine the map and assess the situation prior to responding to any Decisions, and many decisions have additional notes providing their historical context and advice • Enhanced Fog of War clearly shows the limits of your units’ spotting range • Dynamic Movement allows units that haven't used up all their Action Points to be de-selected and re-selected again later, making planning your moves so much easier. • Naval Cruise allows you to move your naval units swiftly over longer distances • Naval units can only be reinforced in stages, preventing instant repair following significant damage. WWI Features • This is our first WWI game using hexes. • France, Italy, Russia, Serbia, the UK and the USA will be facing off against Germany, Austria-Hungary and the Ottoman Empire in our flagship campaign. • Many other countries will likely enter the war on either side, such as Belgium, Greece, Portugal and Romania. Not forgetting of course the immense contribution of the British Empire to the Entente’s war effort. • New unit types have been added including ANZACs, Mountain Corps and Ground Attack Aircraft. • New movement and entrenchment ability that ties into our Dynamic Movement model. This allows players to have more effective assaults into no man's land when it is time to go on the offensive. • Naval Mines can be laid to protect your sea lanes – or to impede those of your opponent. • Germany’s use of Unrestricted Naval Warfare has been fully overhauled. • Reconnaissance Bombers will fulfil their historic role of spotting for the Artillery. WWI Campaigns • 1914 Call to Arms • 1914 Triple Alliance (where Italy joins the Central Powers) • 1917 Fate of Nations FEATURES - 3 campaigns (1914 Call to Arms, 1914 Triple Alliance (where Italy joins the Central Powers) and 1917 Fate of Nations - New unit types added including ANZACs, Colonial Corps and Mountain Corps - Enhanced Fog of War clearly shows the limits of your units’ spotting range - Recon Bombers providing information on enemy positions will improve the effect of your Artillery - Naval Mines can be laid to damage enemy shipping - Units are able to move and entrench, and trenches can be improved through researching Trench Warfare",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1096930/header.jpg?t=1622557003",
    "Price": 39.99,
    "Developers": "Fury Software",
    "Publishers": "Slitherine Ltd.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_6e22918d2a5596d6aeca1cfafc79e4ec6595a903.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_d221b2666b55627f0e8152569a96e5da359f1530.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_11b7207619c67a94d55bf78f2cdf36abf8c6bd8e.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_ea43b2dc9c03a02a427ff3241accecf22b9532f4.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_88e88b6ff358f7df4aeaf0755005a5e2b4f40f9b.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_78055d7e7f0c2b81f79fcccba790a0662c00d88b.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_615927b8cbb941af21451b1903b8aa0d07d1b9bb.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_9f17636fb9b04b1d0f029a926dc576be2ad8a42a.1920x1080.jpg?t=1622557003,https://cdn.akamai.steamstatic.com/steam/apps/1096930/ss_1ccdc8cee1acb6a6f3910158d40f321b18c8e981.1920x1080.jpg?t=1622557003",
    "Slug": "strategic-command-world-war-i",
    "Meta Title": "Strategic Command: World War I: Dec 5, 2019, Fury Softwar...",
    "Meta Description": "Looking for information on Strategic Command: World War I? Check out the release date (Dec 5, 2019), developer insights from Fury Software, and a comple...",
    "Alt Text Image": "Official header image for Strategic Command: World War I game - Steam 1096930",
    "Canonical URL": "https://gusku.site/game/strategic-command-world-war-i",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Strategic Command: World War I\", \"description\": \"Looking for information on Strategic Command: World War I? Check out the release date (Dec 5, 2019), developer insights from Fury Software, and a comple...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 5, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"Fury Software\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Slitherine Ltd.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1096930/header.jpg?t=1622557003\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}