{
    "AppID": 1082770,
    "Name": "Surviving Medieval",
    "Release date": "Feb 4, 2020",
    "About the game": "Surviving Medieva l is a survival strategy with indirect control and tower defense elements. Inspired by RimWorld, Prison Architect and Dwarf Fortress. KEY FEATURES: Build a settlement the way you want it, with completely flexible tile building, whether it is a town or a complete castle ready to withstand any battle. Manage peasant’s demands so they can not only survive, but be happy. Make sure not to run out of gold and plan the economy of the settlement wisely. Research new technologies and improvements for currently existing technologies. Develop industry in order to build a strong economy and army. Trade with merchants. Build walls, ballistas, and traps to ensure the survival of the settlement. Survive for as long as possible. Flexible tile building allows unleashing unobstructed creativity by providing all tools to build completely custom buildings with certain limitations only for room requirements. The demands system always tracks the status of all citizens in order to indicate how well they feel and if their demands are satisfied. Certain needs apply certain effects, so when citizens eat food, they will regenerate a small amount of health, but left without any food, citizens will soon grow hungry and will start to lose health each time they miss a meal. The economy is closely tight with the demands of citizens. If taxes out of balance with demands, citizens will grow unhappy much faster, at the same time gold is one of the main resources in the settlement and is needed to build defenses strong enough to stop barbarians from killing the king. The science desk is not just a regular technology tree, it is more like real science, where certain technologies can be acquired just by lack, or with precise planning. Each day scientists will come up with a proposal of a number of science books they came up with and then it is up to the king, to decide which technologies are right for the settlement and invest science points. By acquiring 3 same science books, scientists will be able to further advance this exact technology by combining 3 same science books into 1 tier 2 science book. The same can be done with 3 tier 2 science books in order to receive 1 tier 3 science book. Though bookshelves are only limited to 10 active technologies, so planning settlement development strategy and investing in the right technology’s is the key to survival. The industry is flexible and allows to build different workshops at any scale in order to produce goods necessary for the settlement. Replenish the settlement treasury by trading exceeding goods to merchants or boost the production of goods by buying missing items. In hostile medieval lands, the settlement is always in the danger of raids. Walls can be built to shield citizens from barbarian raids, but the army must take care of barbarians in the end. Barbarians are strong and fierce warriors so facing them in the field is always an option, though beating them with strategic planning will guarantee less loses. Different defensive structures such as ballista and traps can be built and luring barbarians to thoroughly prepared ambush probably will give an edge over them. The goal of Medieval Surviving is to survive for as long as it is possible.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1082770/header.jpg?t=1580887819",
    "Price": 4.99,
    "Developers": "Vlasov Tower",
    "Publishers": "Vlasov Tower",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_521d541adb253d7822a9a3a7e6cc6111c9b6ca3b.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_5d4a22e18a2d7ca73b0e5bbe4531985a18b6ae15.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_6f17ab63455b834cb938db1f6c25de0eb75ca12b.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_0c35c7116b11bb0612d6747c6d9ff8a37e617d75.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_fe830f8a68b7fd60aa057626dea69c75aa6f51da.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_fb05f8036bc28d7c67e729291b37acf8c507793c.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_a1d3c3c4d245d9fd4530262f42957124192f2534.1920x1080.jpg?t=1580887819,https://cdn.akamai.steamstatic.com/steam/apps/1082770/ss_d1517bb3aa8b086f265a760bb2a3bf1e7e281c58.1920x1080.jpg?t=1580887819",
    "Slug": "surviving-medieval",
    "Meta Title": "Surviving Medieval: Feb 4, 2020, Vlasov Tower and Full Ov...",
    "Meta Description": "Looking for information on Surviving Medieval? Check out the release date (Feb 4, 2020), developer insights from Vlasov Tower, and a complete game summary.",
    "Alt Text Image": "Official header image for Surviving Medieval game - Steam 1082770",
    "Canonical URL": "https://gusku.site/game/surviving-medieval",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Surviving Medieval\", \"description\": \"Looking for information on Surviving Medieval? Check out the release date (Feb 4, 2020), developer insights from Vlasov Tower, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 4, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vlasov Tower\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vlasov Tower\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1082770/header.jpg?t=1580887819\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}