{
    "AppID": 944650,
    "Name": "The Mysteries of Baroque",
    "Release date": "Sep 20, 2018",
    "About the game": "Mad science raised you from the dead! Pursue justice or vengeance, love or secrets, as you save or destroy the world with forbidden eldritch power. The Mysteries of Baroque is a 200,000-word interactive Gothic horror novel by William Brown, where your choices control the story. It's entirely text-based—without graphics or sound effects—and fueled by the vast, unstoppable power of your imagination. One dark and stormy night in a remote castle in the mountains, you awake anew, resurrected by the brilliant Dr. Holofernes. But even a mad scientist can't keep you alive forever. As the procedure reverses itself over time, you will begin to die again. You must fight to stay alive long enough hunt down your killers, avenge yourself, and protect the ones you love. Operating out of the mysterious Grand Guignol Theater, your quest will take you through the darkest shadows of the city of Baroque, the City of Dreadful Night, from its vast subterranean slums to the opulent mansions of its jaded, debauched aristocracy. Will you lose yourself in the distractions of romance, assure your own survival through the Holofernes Procedure, or sacrifice everything to take your revenge? Play as male, female, or non-binary; gay, straight, or ace. Fight to reclaim your old life and identity – or make a new home for yourself in the Grand Guignol Theater Trade your soul to a dark god in return for vengeance – or reject its help and fight alone. Stalk your killers through the glittering demimonde, mansions, and the slums. Learn the sanity-blasting secrets of the occult and risk your mind by unleashing them on your enemies. Use the power of science to devise and build bizarre inventions: death rays, gliders, and hallucinogenic grenades. Augment your regenerating body with clockwork technology like wings, a camera eye, or steel claws. Uphold the forces of law and order, the revolutionary Worker’s Council, or the enigmatic Vendetta faction in the battle for Baroque’s soul. Embark on dream quests and night visions to learn new skills and uncover ancestral memories. Bring comfort and hope to the suffering citizens of Baroque, or drive them further into darkness in pursuit of vengeance. You died betrayed. You died in pain. And your troubles are just beginning.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/944650/header.jpg?t=1538610354",
    "Price": 4.99,
    "Developers": "Choice of Games",
    "Publishers": "Choice of Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/944650/ss_9219d11be1be408fcb8c9a4c43d9b393e91f75bb.1920x1080.jpg?t=1538610354,https://cdn.akamai.steamstatic.com/steam/apps/944650/ss_b1151bfa2d6b792371df3916de68be0ff63cad1a.1920x1080.jpg?t=1538610354,https://cdn.akamai.steamstatic.com/steam/apps/944650/ss_dd4344cbabe5a242c52841c7bb634010dafebe2b.1920x1080.jpg?t=1538610354,https://cdn.akamai.steamstatic.com/steam/apps/944650/ss_ffbc0f4ce100d63a73a0dab379fad1ca7fd32d84.1920x1080.jpg?t=1538610354,https://cdn.akamai.steamstatic.com/steam/apps/944650/ss_323f1477dd68440ce342b99f5644242d45b81b7c.1920x1080.jpg?t=1538610354",
    "Slug": "the-mysteries-of-baroque",
    "Meta Title": "The Mysteries of Baroque: Sep 20, 2018, Choice of Games a...",
    "Meta Description": "Looking for information on The Mysteries of Baroque? Check out the release date (Sep 20, 2018), developer insights from Choice of Games, and a complete ...",
    "Alt Text Image": "Official header image for The Mysteries of Baroque game - Steam 944650",
    "Canonical URL": "https://gusku.site/game/the-mysteries-of-baroque",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Mysteries of Baroque\", \"description\": \"Looking for information on The Mysteries of Baroque? Check out the release date (Sep 20, 2018), developer insights from Choice of Games, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Sep 20, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Choice of Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/944650/header.jpg?t=1538610354\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}