{
    "AppID": 431360,
    "Name": "The Legend: A University Story",
    "Release date": "Jul 27, 2016",
    "About the game": "From 2013, one of the most anticipated Indie-Horror games is finally here! Backed with NextGen graphics, beautiful and immersive original soundtracks and a unique story that will keep you asking for more chapters to come! We pride ourselves on producing an atmosphere and experience that will resonate with our audience. Notice that we say audience and not customers. We are focused on delivering a good-story, that just so happens to be a game rather than a game with a mediocre story or plot for support or continuity. For our first installment of 'The Legend' series, we've chosen a backdrop that many of our audience can relate to: College. Everyone in the atmosphere, or has a friend immersed in it will understand. For students: The fear of walking back to their dorms late at night alone. The fear of being followed by a dark presence. The fear of being assigned that psychotic, crazy roommate. We've also tackled the fears of this atmosphere from another angle too. From the perspective of the staff, specifically, the Campus Police Department: The fear of finding strange things on the CCTV system. The fear of patrolling the facilities late at night. The fear of being too-late. In this release you will be receiving three chapters, each with a unique perspective, mechanic and atmosphere to immerse you in the story of West University. Specifically: Chapter Zero: The Story An opening chapter, where you will be introduced and playing Sergeant Thompson, the Night-Watch Commander for the University Police Department. In this chapter you will be patrolling the facilities of West University, while in contact with your rookie police dispatch officer on the hooks. Chapter One: The Oracle In this chapter, you will be introduced and play as Officer Morrison. A Rookie (New-Hire) Police Dispatch Officer who is thrust into a campus atmosphere that has found itself immersed in darkness. You main purpose is to watch those CCTV systems, and patrol the dispatch office from time-to-time, to ensure the safety of all students walking late-night on campus. (Each Student has a randomly generated phone number, to ensure that gameplay is never the same everytime.) Chapter Two: The Roommate In this chapter, you will be playing as Ashley Tamon, of whom, you will have already been introduced in Chapter One. Chapter Two: TR takes place weeks prior to Chapters Zero and One. You are returning to your dorm to your foreign-exchange student roommate who may have stolen some of your belongings again. As with any college, young adult, preppy girl, your phone is glued to your hand in this life/death scenario. We hope to use this Early Access Launch to finish Chapters: Three (The Walk, VR-Supported) &amp; Four (The Haze), to provide a total of five chilling chapters with unique perspectives and stories filling the atmosphere of West University. Furthermore, we hope to use these proceeds to examine the possibility of our next title: 'The Legend: Tales from the Bayou', where we will tackle the folklore, underground rumblings, fears and terrors of the famous swamplands.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/431360/header.jpg?t=1469639126",
    "Price": 0.0,
    "Developers": "Austin Handle",
    "Publishers": "Howling Legend Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_77017b786df8ffb2c3315da5f993495a6fa9c647.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_a977b06f72cc5d466ec4a55fb01db105fcfb1aa5.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_ae135a62575fa678d4a8f202fc417130f15953f0.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_50951daec8c3f92eccb2bf405341f3e625377681.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_dec358deccf815bc1916a33fb9774e50d855a941.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_bbccda7fd6a1cc84b4411bd89e198f11b6831cfd.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_7bcbd2a9dcdb7df2516e165dac41f2ebca04d5f9.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_4ca5daa9017f4bc005c8c076e1588986d56b791b.1920x1080.jpg?t=1469639126,https://cdn.akamai.steamstatic.com/steam/apps/431360/ss_0109e33bf478fa9ff2ecac3a70b61635bbb2d7a9.1920x1080.jpg?t=1469639126",
    "Slug": "the-legend-a-university-story",
    "Meta Title": "The Legend: A University Story: Jul 27, 2016, Austin Hand...",
    "Meta Description": "Looking for information on The Legend: A University Story? Check out the release date (Jul 27, 2016), developer insights from Austin Handle, and a compl...",
    "Alt Text Image": "Official header image for The Legend: A University Story game - Steam 431360",
    "Canonical URL": "https://gusku.site/game/the-legend-a-university-story",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Legend: A University Story\", \"description\": \"Looking for information on The Legend: A University Story? Check out the release date (Jul 27, 2016), developer insights from Austin Handle, and a compl...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jul 27, 2016\", \"author\": {\"@type\": \"Organization\", \"name\": \"Austin Handle\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Howling Legend Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/431360/header.jpg?t=1469639126\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}