{
    "AppID": 1222670,
    "Name": "The Sims™ 4",
    "Release date": "Jun 18, 2020",
    "About the game": "Unleash your imagination and create a world of Sims that’s wholly unique. Explore and customize every detail from Sims to homes and much more. Choose how Sims look, act and dress. Determine how they’ll live out each day. Design and build incredible homes for every family, then decorate with your favorite furnishings and décor. Travel to different neighborhoods where you can meet other Sims and learn about their lives. Discover beautiful locations with distinctive environments, and go on spontaneous adventures. Manage the ups and downs of Sims’ everyday lives, and see what happens when you play out realistic or fantastical scenarios. Tell your stories your way while developing relationships, pursuing careers and life aspirations and immersing yourself in an extraordinary game where the possibilities are endless. Create Unique Sims — A variety of Sims are yours to shape and mold, each with distinct appearances, dynamic personalities and inspiring aspirations. Use powerful customization features to bring your imagination to life. Create yourself, your favorite celebrities, your fantasy or your friends! Change your Sims’ clothing to reflect your mood. Give your Sims depth and purpose with quirky traits and great ambitions. Build the Perfect Home — Design the ideal homes for your Sims using Build Mode. Construct the home of your dreams by planning the layout, choosing furnishings and altering the landscape and terrain. You can even add a pool, basement and garden. Hate what you’ve done with the place? Scrap it and rebuild effortlessly with new ideas and designs. Explore Vibrant Worlds — Your Sims can visit new communities to expand their social circle, hang out with friends or throw unforgettable parties. Play with Life — Your choices shape every aspect of your Sims’ lives, from birth to adulthood. Along the way, develop skills, pursue hobbies, find your Sims’ calling, start new families and much more. Discover A Community of Creators — Use the Gallery to find inspiration from a network of players just like you, where you can add content to your game or share your own creations. Download, like and comment on your favorite Sims, homes and fully designed rooms. Join the community and join the fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1222670/header.jpg?t=1657912698",
    "Price": 19.99,
    "Developers": "Maxis",
    "Publishers": "Electronic Arts",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1222670/ss_537683e5e29c2d6d02c64aa7321dcb26166f7d82.1920x1080.jpg?t=1657912698,https://cdn.akamai.steamstatic.com/steam/apps/1222670/ss_2fc938d99a1e87893852cb2d2113478190607941.1920x1080.jpg?t=1657912698,https://cdn.akamai.steamstatic.com/steam/apps/1222670/ss_b447d6436d2d00cd5e7c170e509b2246dfc879e8.1920x1080.jpg?t=1657912698,https://cdn.akamai.steamstatic.com/steam/apps/1222670/ss_e1f0ce3ca2c9a538e382cc8b040944fe05af4bb2.1920x1080.jpg?t=1657912698,https://cdn.akamai.steamstatic.com/steam/apps/1222670/ss_7d9baea1aedeeb41cb197a9e45a30f0b91b4baf9.1920x1080.jpg?t=1657912698",
    "Slug": "the-sims-4",
    "Meta Title": "The Sims™ 4: Jun 18, 2020, Maxis and Full Overview",
    "Meta Description": "Looking for information on The Sims™ 4? Check out the release date (Jun 18, 2020), developer insights from Maxis, and a complete game summary.",
    "Alt Text Image": "Official header image for The Sims™ 4 game - Steam 1222670",
    "Canonical URL": "https://gusku.site/game/the-sims-4",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Sims\\u2122 4\", \"description\": \"Looking for information on The Sims\\u2122 4? Check out the release date (Jun 18, 2020), developer insights from Maxis, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 18, 2020\", \"author\": {\"@type\": \"Organization\", \"name\": \"Maxis\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Electronic Arts\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1222670/header.jpg?t=1657912698\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}