{
    "AppID": 1633780,
    "Name": "The Tau Ceti Terminus",
    "Release date": "Aug 31, 2021",
    "About the game": "In this VR only game, you will solve a wide range of challenges, encounter various lifeforms, and deal with technology of unknown origin. As you play you may uncover a tale of woe from years gone by. Luckily, it won't affect you, probably. BACKSTORY Set over 100 years in the future, humanity has just started to explore the stars. Using large Space Exploration Vessels (SEV) we have established a colony at Epsilon Eridani and the SEV Intrepid has has just arrived at Tau Ceti, planet j. One of the earth sized moons around Tau Ceti j seems to be capable of supporting life. You are a new Lt. in the Planetary Survey Corps. The corps collects data on planets and does the first manned landing and exploration. It is one of the more interesting jobs on the Intrepid . Today is an exciting day. Geologists can't explain an anomaly on the satellite images and have requested a surface investigation. Your first solo survey. Take planetary landing craft 118 down and investigate the area. Should be a milk run. GAME PLAY But it wasn't. You are waking up hurt and confused after a depressurization event on your landing craft. It auto-landed, but just barely. Any immediate help from the Intrepid is unlikely, they may not even know where you are. Even if they do it'll be hours before a rescue can be planned. Survival point procedures, survey the damage, repair what you can, carry out your mission. Remember, you are on your own. You will have to identify and solve problems, avoid danger and carry out your mission. Don't get yourself into a pickle. Here's the deal: VR - Best in room-scale. Uses open VR and tested with VIVE, Oculus, and WMR. Application button toggles window for instant controller help and hints. Supports teleport, glide, comfort glide, and rotation using thumbstick or trackpad as defined in the user settings. You can walk up and down hills, step on obstacles, fall (or jump) off cliffs. User settings allow items to be picked up using the trigger or grip. Seated play is available while using glide on one controller. Health - If you get hurt, health points return, but slowly. Death sneaks up on you, take care. There is a health and environmental monitor on your left hand. Difficulty Level - There are three difficulty levels that affect puzzles, items, and health. On the EASY level puzzles are considerably reduced in complexity, you take less damage. The MEDIUM level is no cake walk and presents a good challenge on all fronts. The HARD level, well if you are looking for the maximum dopamine hit, this level's for you. Saving - Each game is identified by a mission name. Every time you return to the main menu scene, the mission is saved. Under some circumstances the game is saved automatically as well. If you've gotten yourself in the aforementioned pickle, you can just return to a saved point in the mission and re-start from there. Length - Estimated play time is 10-12 hrs. ENVIRONMENT We like a little science in our science fiction. You play in a realistic and scientifically accurate environment including: Day / Night Cycles - Nighttime? Nah it'll be fine. Gravity - Things fall faster or slower, either way it's taken into account. Atmospheric Pressure - In space no one can hear you scream, in low pressure they can though. Feel better? Temperature Changes - See that blue creeping in from the edge, that's a problem. Orbital Mechanics - Know what a Hohmann transfer orbit is? Pretty sure you will by the end of this game. Astronomical Spectroscopy - They will never believe you back home unless you get some readings. Star Locations/Sizes/Colors - Star-maps, ever wonder where the stars are in 3 dimensions?",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1633780/header.jpg?t=1641248339",
    "Price": 2.99,
    "Developers": "Light-Year Simulations,  LLC",
    "Publishers": "Light-Year Simulations, LLC",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_2fd24cf9b1b58f1d7889ade7c916a52328260bf3.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_1775c55a10bb416a7fd39a9746bef4bf21d02d28.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_08127b9b74972ed805c72bb9401aa80486fa9419.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_205cc25febe1a999bc7fae8a60b782f4e1e3af66.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_2af48f17d803f5150a47bb44efc7a79327249d28.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_0f3cb6db51bf601848dbfd3013560fac26bca047.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_9646fc6fd122d048756bfb2701a25977c06de7ad.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_d82c2962d50b6ad8933beb380dd1d166d4ebc413.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_2709605769546726388fd9fe13a39f8cf7cc4023.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_b449865b972a9b2dd332bf5b8fbf1c7fe407da53.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_84c2d94f9b77fab4e7945bbc00df0803dcebb3b0.1920x1080.jpg?t=1641248339,https://cdn.akamai.steamstatic.com/steam/apps/1633780/ss_84552ff56c73f82b5e1b09e2c98f781c2a0d86b6.1920x1080.jpg?t=1641248339",
    "Slug": "the-tau-ceti-terminus",
    "Meta Title": "The Tau Ceti Terminus: Aug 31, 2021, Light-Year Simulatio...",
    "Meta Description": "Looking for information on The Tau Ceti Terminus? Check out the release date (Aug 31, 2021), developer insights from Light-Year Simulations,  LLC, and a...",
    "Alt Text Image": "Official header image for The Tau Ceti Terminus game - Steam 1633780",
    "Canonical URL": "https://gusku.site/game/the-tau-ceti-terminus",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Tau Ceti Terminus\", \"description\": \"Looking for information on The Tau Ceti Terminus? Check out the release date (Aug 31, 2021), developer insights from Light-Year Simulations,  LLC, and a...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Aug 31, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Light-Year Simulations,  LLC\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Light-Year Simulations, LLC\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1633780/header.jpg?t=1641248339\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}