{
    "AppID": 289060,
    "Name": "The Emerald Tablet",
    "Release date": "Dec 16, 2019",
    "About the game": "Enter the world of alchemy in the daily adventures of the money-hungry but good intentioned Misty, the arrogant adventure-seeking Gladys, and the explosive 'expert' Winifred. Enjoy the classic JRPG-style mechanic of crafting elements in a story where Misty seeks the truth of alchemy that is bestowed upon the Emerald Tablet. In The Emerald Tablet, players can take part in crafting quests from the townspeople, ranging from the mundane tasks, such as crafting normal household items to more elaborate ones. Players are also able to customize their character’s growth, equipment and attributes by collecting materials for crafting. Create a character that is truly unique that will be victorious in battle! Characters Misty Born to a regular Austian family, she was raised by her brother Dylan. She is a kind-hearted and optimistic girl, but cursed with poverty. She has immense bad luck when it comes to money, constantly destroying things around her and as a result, has accumulated endless amounts of debt. Her dream is to become rich as an alchemist, and she often fantasizes about creating unlimited gold through alchemy. Gladys Her father is a Palian noble and her mother is from a big Austian family. With such an outstanding family heritage, she came to Austia with her personal maid Winnie and was raised by her grandmother. She grew up alongside Winnie and Misty. Despite arguing a lot, the relationship between them remains close. Inspired by adventure stories, she yearns for adventure and exploration as the best treasure hunter do. Winnie She has been with Gladys since childhood. She is also Misty's childhood friend. The three of them are really close. No one knows how old she is or where she's from. She named the doll in her left hand Saemon, and the other one Uemon. What awful taste in names. She also really loves explosives, and always causes trouble in combat. Dylan He is Misty's brother and a serving member of both the Austian Monster Hunters and City Patrol to get twice the salary. He learned from a blacksmith during childhood and become proficient himself at a young age. Yet he chose to become a knight once he reached adulthood. He sometimes would mumble: 'I did try to be a blacksmith, but that's just not my thing. Too much pain, for so little reward.' Alma She is from Muta'an and claims to be a traveling comedian seeking new partners. She seems to find that Misty has potential and thus joins her group in order to convince her, but has constantly been declined. Due to her sexy figure, she is particularly popular among Austian men. Martina She is the captain of the Austian Monster Hunters and the boss of Dylan and Meredith. She became the champion at a young age and is considered the best swordsman in Austia. She likes drinking, and one can always find her at the Bunny Tavern after each mission. She has a bizarre sense of humor and always shares some seemly unfunny jokes with others. Meredith He is a member of the Monster Hunters and Dylan's colleague. He is born with immense strength and likes to run around in just his speedo. He has the tendency to promote his simple lifestyle to others with his abnormal optimism. Everything negative seems to be reversed in his mind. Features Expansive crafting system Random events Raise your reputation to unlock more quests Level up and customize the skills of your party in battle Manage your time carefully or end up becoming Gladys' maid Simplified battle system",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/289060/header.jpg?t=1581107659",
    "Price": 19.99,
    "Developers": "{uni}",
    "Publishers": "Sekai Project",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_a65a743e2230462639a476de7c8393ede3c8e81a.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_2b92971c6c833e8d2231bd018826886d4fd875cc.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_211e9cfe1c39cb393a1ff3b441d2076d46028289.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_7576dd620a68b2d98897a147e393d5e0cc65c2d2.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_9711219e7044759b279b58fd1effedb321b9e91a.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_a97342c541c8535831edbd9e44bc8a3ec672723b.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_bc3f71778376e8c355b94eaca543a8af7a77ceef.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_967258dd446e300eb9629736b400540728461388.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_33c7fe80b489be28ea6f9114e4ac0c82926c0f62.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_9f1dd7308a58e02afa463c43a3688b88e744a6fb.1920x1080.jpg?t=1581107659,https://cdn.akamai.steamstatic.com/steam/apps/289060/ss_e21ab578d7660ff7c6a238ee2d5239aaf7f89aa3.1920x1080.jpg?t=1581107659",
    "Slug": "the-emerald-tablet",
    "Meta Title": "The Emerald Tablet: Dec 16, 2019, {uni} and Full Overview",
    "Meta Description": "Looking for information on The Emerald Tablet? Check out the release date (Dec 16, 2019), developer insights from {uni}, and a complete game summary.",
    "Alt Text Image": "Official header image for The Emerald Tablet game - Steam 289060",
    "Canonical URL": "https://gusku.site/game/the-emerald-tablet",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"The Emerald Tablet\", \"description\": \"Looking for information on The Emerald Tablet? Check out the release date (Dec 16, 2019), developer insights from {uni}, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2019\", \"author\": {\"@type\": \"Organization\", \"name\": \"{uni}\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Sekai Project\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/289060/header.jpg?t=1581107659\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}