{
    "AppID": 34030,
    "Name": "Total War: NAPOLEON – Definitive Edition",
    "Release date": "Feb 25, 2010",
    "About the game": "Complete your Total War collection with this Definitive Edition of Total War: NAPOLEON, which includes all DLC and feature updates since the game’s release: Take on the Peninsular Campaign, based on the intense conflict that raged over the Spanish Peninsula between 1811 and 1814. Choose one of the three nations at war - France, Great Britain or Spain – and lead your campaign across an independent map featuring 32 new controllable regions. Turn the tide of war with the Coalition Battle Pack, which introduces the Battle of Friedland, the pivotal moment when Napoleon crushed Russia’s attempt to contain him. Build an unstoppable force with Heroes of the Napoleonic Wars and the Imperial Eagle Pack, which together add over 20 legendary and elite new units. Total War: NAPOLEON Definitive Edition offers hundreds and hundreds of hours of absorbing gameplay and every bit of content made for the game. See below for full details. History is as yet unwritten From the early Italian campaign to the battle of Waterloo, Total War: NAPOLEON covers two decades of relentless battles, a backdrop of a world in flames against which the story of an extraordinary military career unfolds. Whether you play as the legendary general or against him, the outcome of war can never be guaranteed. The course of history relies on your ability to lead your troops through the most intense battles as never seen before in a Total War game. About The Peninsular Campaign The Peninsular Campaign is an independent campaign based on the conflict in the Spanish Peninsula between 1811 and 1814. It was during this era that the Spanish resistance gave their style of fighting its name: Guerrilla, or the “little war”. Play the campaign from three different perspectives, each with a unique feel: • The French fight to keep resistance at bay while converting regions to their political alignment. • The British are very limited for regions at the start but receive enough income from Northern Europe and North America that they can afford to liberate regions back to the Spanish in return for Guerrilla aid. • The Spanish also have a limited starting position but have permanent access to Guerrillas for effective battlefield use against the French. Choose one of the three nations involved - France, Great Britain or Spain - and experience one of the most intense conflicts of the Napoleonic era. Key Features: • A new and independent Iberian Peninsula campaign map featuring 32 controllable regions. • 5 new Guerrilla unit types, recruitable by all nations, adept at battlefield stealth and with the added ability to deploy outside of their faction's deployment zones: Tiradores (Skirmisher Infantry), Cazadores, Lanceros (Lancer Cavalry), Husares (Light Cavalry), Leader (General). • 28 new units in total, spread across the three playable nations including the British 95th Rifles, the French Vistula Uhlans and the Spanish Coraceros Espanoles. • Two new agents to enforce political conversion: • Provocateurs (French and British nations only) have the ability to promote anti-opposition sentiment in regions, incite unrest, decreases turn time for research and passively spy. • Priests (Spanish and Portuguese nations only) have the ability to promote anti-opposition sentiment in regions and incite unrest. • A new Guerrillero agent for the Spanish nation: similar to a Spy but with the new ability to Harass enemy armies - lock them in place for a turn and cause them attrition. • Political Alignment system which sees the French battle to increase pro-French sentiment throughout the peninsula. About Coalition Battle Pack The Coalition Battle Pack features 6 brand new units and contains the Battle of Friedland fought between France and Russia. The Battle of Friedland (14 June, 1807) with Napoleon's empire at its height, he took a chance and defeated Russia in detail, knocking them out of the war and bringing the Fourth Coalition to an end. Unit Descriptions: • Lifeguard Hussars: This fast light cavalry unit is best used for dealing with skirmishers and artillery who can attack from long range. • Coldstream Guards: Disciplined, well-trained and respected, these elite foot guards inspire nearby troops in battle. • Archduke Charles' Legion: This highly-disciplined line infantry regiment excels at weapons drill and accuracy. • Luetzow's Freikorps: Swift light cavalry, the riders of Luetzow’s Freikorps are excellent in melee and on the charge. • Life Hussars: Sabre-armed light cavalry, the Life Hussars are powerful on the charge and effective in melee combat. • Semenovski Lifeguard: Immaculately turned out, these elite guards have excellent morale and are superb when used against skirmish troops and artillery. About Heroes of the Napoleonic Wars These exclusive elite units become available on the campaign map once you have made a specific technological advancement or own the relevant territory. They will appear in both single and multiplayer game modes. • 7th Lancers (France) • Brandenburg Uhlans (Prussia) • 1st Hussars (Austria) • 15th Hussars (Great Britain) • 1st East Prussian Grenadier Battalion (Prussia) • 6th Regiment d'Infanterie Légère (France) • 17th Jäger Regiment (Russia) • 1st Regiment Emperor's Own (Austria) • 18th Regiment d'Infanterie de Ligne 'The Brave' (France) • Moscow Musketeers (Russia) About Imperial Eagle Pack These exclusive elite units become available on the campaign map once you have made a specific technological advancement or own the relevant territory. They will appear in both single and multiplayer game modes. • Grand Battery of the Convention (France) • HMS Elephant (Great Britain) • Towarczys (Prussia) • Royal Scots Greys (Great Britain) • 5e Regiment de Hussards (France) • Pavlograd Hussars (Russia) • 8th Life Regiment (Prussia) • 47th (Czech) Regiment (Austria) • 88th Foot “Connaught Rangers” • Archduke Ferdinand Cuirassiers (Austria) • Lifeguard Cossacks (Russia)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/34030/header.jpg?t=1603132402",
    "Price": 24.99,
    "Developers": "CREATIVE ASSEMBLY,Feral Interactive (Mac)",
    "Publishers": "SEGA,Feral Interactive (Mac)",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_bfed43a65786e3b004a5befb7fac5390f4390be0.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_6f5066ce0eed2c904e134a93e8bb5fa3a746061e.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_583c74cea4fc5cae0571ea6e6e19351011ebd64e.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_318f0670e1979eee46313e2aa28ee6e0ea2224c7.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_42073a3bb728c4ee0c0f5a33c32411b7d3a43fb4.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_1854953fdf1d0f28eaa8cc72ba097b9da46ffeee.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_be7066e2a697facc0f68c58d465ca91991e96e3e.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_0b433811d2998e277a7f32b1f5fabed6fd12363a.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_f554c322648188cd49dfa55a928c27d8a371057b.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_279498a03e396e9f14c0bc2e4afe34e72b283692.1920x1080.jpg?t=1603132402,https://cdn.akamai.steamstatic.com/steam/apps/34030/ss_1f90d4439f8179ea0bc9fa4d19f2371a2cd43ac7.1920x1080.jpg?t=1603132402",
    "Slug": "total-war-napoleon-definitive-edition",
    "Meta Title": "Total War: NAPOLEON – Definitive Edition: Feb 25, 2010, C...",
    "Meta Description": "Looking for information on Total War: NAPOLEON – Definitive Edition? Check out the release date (Feb 25, 2010), developer insights from CREATIVE ASSEMBL...",
    "Alt Text Image": "Official header image for Total War: NAPOLEON – Definitive Edition game - Steam 34030",
    "Canonical URL": "https://gusku.site/game/total-war-napoleon-definitive-edition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Total War: NAPOLEON \\u2013 Definitive Edition\", \"description\": \"Looking for information on Total War: NAPOLEON \\u2013 Definitive Edition? Check out the release date (Feb 25, 2010), developer insights from CREATIVE ASSEMBL...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2010\", \"author\": {\"@type\": \"Organization\", \"name\": \"CREATIVE ASSEMBLY,Feral Interactive (Mac)\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SEGA,Feral Interactive (Mac)\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/34030/header.jpg?t=1603132402\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}