{
    "AppID": 1454050,
    "Name": "Tour de France 2021",
    "Release date": "Jun 3, 2021",
    "About the game": "New features: All 21 stages of the 2021 route faithfully reproduced A redesigned My Tour mode with more customisation options More realistic peloton behaviour Revamped objective system A new recovery mechanic Official brands (Lazer, Specialized, Vision, Rudy project, Corima, HJC, Canyon, POC, Merida) Updated database (riders, ratings) Play as your own rider or manage your team In Pro Team mode you lead a team that must prove itself to reach the top of the Pro Cycling team rankings. Your team starts at the bottom, but you may be invited to take part in the major races if the organisers see that your results are good enough. You can create and gradually level up your own rider in Pro Leader mode as you strive to become the next cycling legend to compete with the likes of Primoz Roglic, Tedej Pogacar and others. You can choose from four different profiles: climber, sprinter, puncher and versatile. Your choice will be crucial if your aim is to win a Grand Tour or be a specialist in the Classics! Create your own Tour My Tour mode has been redesigned to offer you more freedom. With the new interface it is now easier to customise your 'My Tour' (rest days, stages, teams). You can now choose the list of participating teams and national teams. Choose from 89 stages to create your race. Enjoy a wide range of content The game includes the 19 World Tour teams and their jerseys as well as the teams Alpecin-Fenix, B&amp;B Hotels P/B KTM, Team Arkéa - Samsic and Total Direct Energie. Official races: All stages of the Tour de France 2021 Paris-Nice (new stages) Paris-Roubaix Liège-Bastogne-Liège Critérium du Dauphiné (new stages) Unofficial races: 3 Days in Provence Breizh Cup Euro Tour Open Tour World Championships Giro di Como To add even more realism to the game, we have also added several official brands: Lazer (helmets) Specialized (helmets, frames, wheels) Vision (wheels) Rudy Project (helmets) Corima (wheels) HJC (helmets) POC (helmets) Merida (frames) Canyon (frames) To further deepen the immersion, we have also added a range of official roadside elements of the Tour (kilometre arches, banners, etc.). More realistic peloton We have redesigned the actions of riders in the peloton to recreate the behaviour found in real races: Favourites ride closer to each other The yellow jersey is better placed at the front of the peloton Pursuit of the early breakaway is more realistic with fewer teams getting involved, which gives the leader's team the upper hand, just like in real life Teams that want to catch the breakaway but don't attack or that reduce the peloton in the race on the flat now have consistent behaviour Revamped objectives Before the start of each stage, you can now set the objective for each rider thanks to a new 'Select Rider' page, which includes all the information you need to make a choice (ranking, role, race-day condition). Your choice obviously influences the behaviour and decisions of riders during the race. This role can be changed at any time via Team Comm. A new recovery mechanic Our aim is to offer better visibility of change in condition and to give more importance to riders that recover well in the Grand Tours. Recovery between stages and races is crucial for the success of your riders. In Tour de France 2021, we have developed a recovery profile based on the recovery rating. The lower the rating, the more the recovery profile penalises the race-day condition. In addition, condition bonuses can be earned by a rider by completing objectives. For example, a Tour favourite can earn a bonus to race-day condition if he takes the yellow jersey while winning a stage. On the other hand, a baroudeur will earn a bonus simply by winning a stage. These bonuses can lead to a completely new condition state – 'State of Grace' – which is a level higher than all current states. Miscellaneous The way wind works has been modified. Areas with low probability of wind are no longer announced so that your sports director will announce it during the race if wind is indeed present. The editor has been updated to improve ergonomics and to include new features. You can now select the list of teams taking part in each race as well as the starting riders. The number of customised databases you can create has been increased from one to three.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1454050/header.jpg?t=1654008367",
    "Price": 39.99,
    "Developers": "Cyanide Studio",
    "Publishers": "Nacon",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_6dba6c81a7792ad4193fa5db3ed14528c7e64d35.1920x1080.jpg?t=1654008367,https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_9ea135bb0e809e30cff5e8699f65db972f2f0273.1920x1080.jpg?t=1654008367,https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_d0cc63c9d9a834a954490acf03fb6760aa2235c8.1920x1080.jpg?t=1654008367,https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_aaf7d78aa0293392f79774955fc936199d733851.1920x1080.jpg?t=1654008367,https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_9a5f593a7048c8891d9ac42b5e6c54a302897550.1920x1080.jpg?t=1654008367,https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_da5a7358dbbb25264bcb3b5a384707b8a1895655.1920x1080.jpg?t=1654008367,https://cdn.akamai.steamstatic.com/steam/apps/1454050/ss_c1b4db98768f540310878cae3d433aee1cf08211.1920x1080.jpg?t=1654008367",
    "Slug": "tour-de-france-2021",
    "Meta Title": "Tour de France 2021: Jun 3, 2021, Cyanide Studio and Full...",
    "Meta Description": "Looking for information on Tour de France 2021? Check out the release date (Jun 3, 2021), developer insights from Cyanide Studio, and a complete game su...",
    "Alt Text Image": "Official header image for Tour de France 2021 game - Steam 1454050",
    "Canonical URL": "https://gusku.site/game/tour-de-france-2021",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Tour de France 2021\", \"description\": \"Looking for information on Tour de France 2021? Check out the release date (Jun 3, 2021), developer insights from Cyanide Studio, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Jun 3, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Cyanide Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nacon\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1454050/header.jpg?t=1654008367\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}