{
    "AppID": 819560,
    "Name": "TurbOT Racing",
    "Release date": "Apr 13, 2018",
    "About the game": "from the Developer... Welcome to Turbot Racing Steam Page! My idea on make TurbOT Racing was about bringing to you a robot racing game easy to control, but with a nice level of challenge. The own TurbOT was designed with helper side turbines that will highly increase your capabilities of maneuvering through hard corners on the tracks. The 'trade' by getting such system support is that you need to manage energy feeding it, what sort of fits the idea of feel like the A.I. software that gives life to the robot. Just get your eyes open and you will get lots of other details as the BIOS screen that will display the installed processors each time you boot the game and lots of tips from TurBOT Universe on both tracks and components descriptions. I hope you get a lot of fun with the game, so without further ado let's get your unit activated! intro You are an Advanced AI driving a TurbOT, the ultimate racing machine without the use of wheels. Your main directives from now on will be: 1) To identify the scanned elements on the environment and translate this information in fast and precise reactions to maximize your speed and predict the needed maneuvers on each assigned route. 2) To manage the energy produced by the TurbOT reactor sharing power between your turbo systems and processor, what will allow you to get better maneuverability or the capabilities to perform more tasks by second. 3) While the concept of entertainment or a full comprehension of human fun is useless to your main directives, you can use the information about the number of people watching your presentations (that we call fans) as a secondary parameter of success since this will also to reflect on the tracks we will assign to your unit and the amount of resources that ASIMOTORS will invest on each hardware upgrade on your body. 4) You will also need to provide guidance on hardware upgrades to improve your performance after each race. You will be matched with other Advanced AIs versions installed on bodies alike yours, so, to present a better performance than your competitors is indispensable to be considered as the final and better AI version. WARNING: Any damage caused by malfunction from your part (both to your hardware and to third parties on the tracks) will be deducted from the corporation budget assigned to the engineers that work on your version. v1.19 (minor) Features Upon request, the environment scan effect (green flash) was greatly attenuated. TurbOTs got air boosting capabilities, when jumping from ramps or platforms you can push both Gamepad Triggers (Left Trigger + Right Trigger) or Mouse Buttons (L+R Buttons) to make an 'air dash' with help of both turbines. Please keep in mind that this function consumes turbine energy a lot faster than use turbines to maneuvering. Optional Sponsors Bonus are now displayed in some tracks, the first contracts offer additional prizes if you collect them AND win the race, on the other hand, Achievements related to them are triggered regardless race result. Some tracks got adjustments/removal of obstacles to allow you to get sponsored photos more easily. Sponsor requested shots triggered while 'airboosting' worths twice the prize (they still request you to win the race to claim them). v1.18 (minor) Features Added Reverse command, you can use it through 'S' key on keyboard or 'A' button on gamepad, check ingame manual for details. Gamepad shoulder buttons (L1 - R1) now can be used to reload side turbos. Speed effect on screen is not tied anymore to components. Minor balance adjustments on some tracks. Decreased collision and destruction penalties on race prizes. v1.16 (minor) Features TurbOTs now automatically activates headlights on darker tracks. v1.15 (minor) Features Achievements reviewed (lesser requisites): Big Money Decreased requirement to 15,000 credits. Race Star Decreased requirement to 20,000 fans. v1.1 Features NEW MOUSE STEERING SYSTEM! v1.0 Features 3D (optimized) graphics. Fast paced gameplay. 4 Race tracks. 8 Different races with increasing levels of difficulty. Upgrades and Color Customization. No 'rubberbanded' A.I. Instructions ingame (accessible from game menu). Gameplay Tips Dont let the energy on your turbines to deplete, TurbOTs relies 'A LOT' on them to good maneuverability. Crashs just occurs when a TurbOT reaches some run speed, it is a nice countermeasure to break before to collide since this will avoid the crash penalty. Other way to avoid harder collisions is to overclock the TurbOT proccessor when you feel that a collision is coming, dont forget this capability. Overclock, Max Speed and Resistence are tied to some specific components you will install, as example, you get 'more intense' Overclock effect and duration by getting better proccessor and cooling system in the workshop. While it is personal taste and it has keyboard support, I would like to ask you to please try it at least once on a controller and with a mouse and keyboard to find your own way of play.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/819560/header.jpg?t=1536940765",
    "Price": 0.99,
    "Developers": "creasso",
    "Publishers": "creasso",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_31edd645a4f4776e2ecefc8fe40f8be2e2e7d052.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_9816635dd22aed50747ad49e1bb271724d09f809.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_1a2393d42b0eb781d02767aed31b88d38ac9980c.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_578442ae33287175d346bbf9835187eb37fe61ac.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_eb3a00ffc0eea7329a69a988129147ff92634e73.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_a20ad9e699b7a50055da8b1aba89b5c8ab7b8244.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_112b1d727e905972025b89b06970d6358eab97a0.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_12d0af244e817ad08f79071900c58529adacbc4e.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_a68ecd9e6a321c65d2dcd72131eee73f0c5bad48.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_639fcbf409ecce60c0fbd470efea5316f37beb39.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_03d507d2783dbe5e31e8e62d5465e92ccc22b5d5.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_3b52cf003afc203f4bbba000b1f7a2b7140fa4b2.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_2d45ac1794a9fc1d9a6a3745630248e5e0e063c5.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_a881d5afe9b1c5a05eee9b9799bee6fc059bcff1.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_1523fcdb30e4b169ab242c942922fb87eb215be2.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_fe2055bc1fcee46a21d10959674b1927b03d6cd8.1920x1080.jpg?t=1536940765,https://cdn.akamai.steamstatic.com/steam/apps/819560/ss_dde8739d5cb26531e4031f6ac2685e27e3db99f2.1920x1080.jpg?t=1536940765",
    "Slug": "turbot-racing",
    "Meta Title": "TurbOT Racing: Apr 13, 2018, creasso and Full Overview",
    "Meta Description": "Looking for information on TurbOT Racing? Check out the release date (Apr 13, 2018), developer insights from creasso, and a complete game summary.",
    "Alt Text Image": "Official header image for TurbOT Racing game - Steam 819560",
    "Canonical URL": "https://gusku.site/game/turbot-racing",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"TurbOT Racing\", \"description\": \"Looking for information on TurbOT Racing? Check out the release date (Apr 13, 2018), developer insights from creasso, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Apr 13, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"creasso\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"creasso\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/819560/header.jpg?t=1536940765\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}