{
    "AppID": 1299330,
    "Name": "Victory At Sea Ironclad",
    "Release date": "Feb 25, 2021",
    "About the game": "Hunt down Blockade Runners, protect your resources and fight for the seas and rivers of the American Civil War. Play as either the United or Confederate States and engage in a tactical game of cat and mouse in this huge open world naval warfare Real Time Strategy. Victory at Sea Ironclad is the game of naval combat during the American Civil War. A new kind of war. Battles took place on both the sea and on rivers of the American Civil War, as the navies of both sides supplied their land forces with resources and transport, requiring both to work together for victory. The Battles on the water powerfully affected the course of the war and would be fundamental as to whom would take victory. Plan your own campaign in Victory at Sea Ironclad. Victory at Sea Ironclad - the game of naval combat during the American Civil War where a player can switch between commanding the entire North American Campaign to zooming down to take control of individual ships and fleets. Change the course of the war in a race for technological supremacy that sees players fight for resources while attempting to build better ships, including the fearsome Ironclads. Bringing an epic approach to real time strategy war gaming , players develop their own story with an open world sandbox mechanic in a desperate attempt to win the American Civil War. Take part in a nerve wracking game of cat and mouse, scour the seas in search of enemy fleets and send fleets to strangle their supply lines. In Victory at Sea Ironclad recon enemy positions and launch a large scale amphibious naval assault against the chosen targets. Fighting a coastal or river invasion brings together large numbers of customisable ships. Do you fill your fleet with troops and cargo, do you send them against formidable forts, or trade with a foreign power for gold? Choose your fate in Victory at Sea Ironclad In Victory at Sea Ironclad your destiny is in your hands, there are no levels, there is no do over. This is Naval Warfare from day one until ultimate victory is achieved. Every engagement is important, the combat merciless, and the outcome is uncertain. Upgrade ports and build shipyards to customise and create multiple fleets, sending them where they are needed and performing whatever tasks you see fit. Will you send cargo fleets out to bolster your supply lines or create fast manoeuvrable ships to hunt Blockade Runners? Remember you must always be vigilant, it only takes fleets of Blockade Runners to slip past you in the night and to see the tide turn against you. How the naval war ends is up to you and the decisions you make. Victory at Sea Ironclad features; Search and destroy enemy fleets During the American Civil War Effortlessly switch between commanding the entire theatre of war and controlling the fate of individual vessels and fleets. Use Resources to build new structures and ships Build farms and factories Upgrade Ports Build shipyards Harass shipping and starve ports of vital supplies Organise large scale amphibious assaults on major ports Control unique vessels such as the formidable ironclads Pausable gameplay allows you to order fleets and then continue the action Play as North or South (Play as the South will become available through Early Access) Create customisable battles (Will become available through Early Access) From small skirmishes involving single ships and hunting down merchantmen, to the clashing of massive fleets against implacable enemies, Victory at Sea Ironclad is your ticket to exciting battles that take place on the dangerous seas of the American Civil War.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1299330/header.jpg?t=1620653010",
    "Price": 39.99,
    "Developers": "Evil Twin Artworks",
    "Publishers": "Evil Twin Artworks",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_0d83dcea82fd88c87e041dc6cc9f870fc9526948.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_e51506dcb9ec8892a390407987d7a0ef3e31cd50.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_811889a22d045dad3cede4220447e4e419339811.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_75cc849cf1c5a17409de05d1e458ff1cdf7ad510.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_c9879b4808ec915307c3f88eceacb9eb0f998884.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_d58f8004034bc840c4069e663fc6800162feec0a.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_c91e0489288673ac8c143617df750c7a3113412a.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_e90e79c2811f90debefccb208dab82a1fdf59258.1920x1080.jpg?t=1620653010,https://cdn.akamai.steamstatic.com/steam/apps/1299330/ss_6fd693e07c995f445efa2fb9af17a88d079ae786.1920x1080.jpg?t=1620653010",
    "Slug": "victory-at-sea-ironclad",
    "Meta Title": "Victory At Sea Ironclad: Feb 25, 2021, Evil Twin Artworks...",
    "Meta Description": "Looking for information on Victory At Sea Ironclad? Check out the release date (Feb 25, 2021), developer insights from Evil Twin Artworks, and a complet...",
    "Alt Text Image": "Official header image for Victory At Sea Ironclad game - Steam 1299330",
    "Canonical URL": "https://gusku.site/game/victory-at-sea-ironclad",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Victory At Sea Ironclad\", \"description\": \"Looking for information on Victory At Sea Ironclad? Check out the release date (Feb 25, 2021), developer insights from Evil Twin Artworks, and a complet...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Feb 25, 2021\", \"author\": {\"@type\": \"Organization\", \"name\": \"Evil Twin Artworks\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Evil Twin Artworks\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1299330/header.jpg?t=1620653010\", \"offers\": {\"@type\": \"Offer\", \"price\": 39.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}