{
    "AppID": 704470,
    "Name": "VR Furballs - Demolition",
    "Release date": "Nov 9, 2018",
    "About the game": "VR Furballs - Demolition is the VR physics-based demolition puzzle game you were waiting for! Help our cute Furballs deliver all their furry friends by demolishing the evil Baddies and their constructions! Unlock the 12 Tools and 6 Mini-games for even more fun! Create new levels in the Level Editor ! NEW : With its new Party Mode , VR Furballs becomes the perfect game for Friends or Family gatherings ! \\o/ KEY FEATURES - Unreal Engine 4 physics engine based demolition - 54 unique Levels - 9 playable Furballs with their special abilities - 6 Weapons - 6 Accessories - 6 Mini-games - Take Photos and Selfies in 5 colorful Environments - Toggle the Bullet time for a few seconds - Play as a Giant or Tiny Furball - Build your own levels in the Level Editor - Per Mini-game/Level and per Weapon Achievements and Leaderboards - A Party Mode to have fun with family / friends THE FURBALLS In VR Furballs - Demolition , you will meet these cute and adorable creatures that are the Furballs. You will also meet these evil Baddies. Let's make the introductions. From the left to the right: - FURRY : The pure furriness, you'll enjoy shaking him to contemplate its fur dancing. On the field, he is very versatile. - ICY : As cold as cute, she is great at demolishing ice blocks, but not so great against wood or stone. - WOODY : The woodcutter of the group, he is great at demolishing wood blocks, but not so great against ice or stone. - ROCKY : As solid as a rock, he is great at demolishing stone blocks, but not so great against ice or wood. - BOMBY : Explosive! Once out on the field, touching anything will trigger his 3 seconds timer before he blows up. - RUSHY : Agile and fast, if she gets in a 2 meters radius from a target, she will rush at it! - SWATTY : Big and strong, when he gets right above a target, he will swat it! It can even break gold when it swats. - WEEDY : A zen ball of leaves, his talent? Crossing grass or leaves! - BADDY : Hmmm... what to say? They are just... bad! THE WEAPONS In VR Furballs - Demolition , you will unlock Weapons along the way: - SLINGSHOT : A precise and powerful weapon. - SPORTING EQUIPMENT : Tennis Racket , Baseball Bat and Golf Club . - GUN : A precious weapon that will greatly help you defeat King Baddy. - CONTROLLERS : Yeah, it's kind of a weapon if you're good at throwing. - HEAD : Did you know you can also do headers? THE ACCESSORIES In VR Furballs - Demolition , you will also unlock Accessories : - RADAR : It will scan the area to show you where the Baddies are. - DRONES : They let you place your Furball precisely, very useful to prepare the perfect shot. - CAMERA : Selfie!!! Beware... those photos will auto-destroy if you don't frame them! But don't worry, they are all preciously saved on your computer. - BULLET TIME : Slowing down time for a couple of seconds can be very powerful! So powerful that it will need a few seconds to recharge. - MUSHROOMS : Pink for small, Blue for big. Just eat them you tiny giant! THE MINI-GAMES Take a break from demolishing. In VR Furballs - Demolition , you'll have 6 more ways to let off steam: - SHOOTING RANGE : Shoot as many targets as possible in 60 seconds. - HIT THE BOMB : Hit the bombs the drones are throwing at you. The fifth you miss will be the last. - WHACK-A-MOLE : Whack as many fake Baddies you can in 60 seconds. Please don't whack the nice Swatties. - BASKETBALL : Score as many baskets as you can in 60 seconds. - GOBLET TOSS : Throw Weedy on the colorful goblets. It will get harder and harder as there will be more and more dark deadly goblets. - BALLOON FEST : Explode as many balloons as possible in 60 seconds. THE ENVIRONMENTS Take a few seconds to enjoy the scenery between two rounds of demolition. VR Furballs - Demolition will take you through 5 different Environments . THE LEVEL EDITOR VR Furballs - Demolition comes with a Level Editor . It will be unlocked once you finish the game, after the celebration following the defeat of King Baddy. The Level Editor is still in a rough stage, but all the levels in the game have been made with this very same Level Editor . Follow the instructions on the table in the Construction area. The upload function will come later. In the meantime, send us your creations by email, as explained in the Construction area. ACHIEVEMENTS AND LEADERBOARDS If you love replayability and challenge, VR Furballs - Demolition is for you! Finishing the levels with the Slingshot was easy? Getting the 3 Stars of all the levels wasn't challenging enough? Then try to finish the levels using only one weapon! Oh and don't forget... the Controllers are a weapon, and your Head is a weapon! And if you like fame, try to keep your name in as many Leaderboards as you can! THE MAKING OF VR Furballs - Demolition was developed from the ground up for Virtual Reality. It is powered by Unreal Engine 4. It is the fruits of the labor of one passionate video game developer, who, during almost two years, went through the design, programming, modeling, animating, audio design, visual effects, polishing, debugging, tweaking, balancing, and now marketing phases all by himself. Hopefully you will enjoy the result! WINDOWS MIXED REALITY HEADSETS SUPPORT VR Furballs - Demolition has been tested on the Lenovo Explorer Windows Mixed Reality headset, and should work fine on any Windows Mixed Reality headset. However, this platform differs from the others: - The controllers you will see in your hands are the HTC Vive Controllers - The controllers you will see on the Tutorial panels are the HTC Vive Controllers Proper Windows Mixed Reality controllers will be integrated in the game in the future. ARCADES - COMMERCIAL LICENSING A special version of VR Furballs - Demolition is available for Arcades on the following platforms: - Available for Arcades on SynthesisVR - Available for Arcades on VR Junkies MIXED REALITY VR Furballs - Demolition is fully compatible with LIV : - More info about LIV No need for pigs or birds, as angry as they can be, to have fun demolishing stuff in VR ;)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/704470/header.jpg?t=1646229402",
    "Price": 2.99,
    "Developers": "Gamily Studios",
    "Publishers": "Gamily Studios",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_04b39b9ea88d0a558f38ee07bea4e7fa00ec3542.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_321ce6be48f512db347752cfa17371b6abc00b57.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_9c0ed1c62e900805dee342a4f378f5dfa6336b2c.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_e086581ef6d721ce8b96be2f75d518d4387d4882.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_5631f37ae79c9767fa421f367b70454d045c0750.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_56fcaa180364cf15fb95c8db4a3fb112ddffbfde.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_51d5e4ec087a9c3dc74de6a2be71fceed4fdba5e.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_a909ea97ad32c28ccd1bbfbd13d58ad11e81dcdb.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_c7b5e9fde8183facff8d107a774bf1adfda20c20.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_83c6fb6989ff14849db2e8be89a4575b3ff9b2c6.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_c4cef624be61d709b04ac3ab4345ca5680163393.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_562652dd14350235b13adf1285e2e7ebe705e46c.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_9d9335661bde3afa50f07a89f4853a6e60ab6cb9.1920x1080.jpg?t=1646229402,https://cdn.akamai.steamstatic.com/steam/apps/704470/ss_8963f6e8fdef8fc31e314622cad6b06c0c5cf8bd.1920x1080.jpg?t=1646229402",
    "Slug": "vr-furballs-demolition",
    "Meta Title": "VR Furballs - Demolition: Nov 9, 2018, Gamily Studios and...",
    "Meta Description": "Looking for information on VR Furballs - Demolition? Check out the release date (Nov 9, 2018), developer insights from Gamily Studios, and a complete ga...",
    "Alt Text Image": "Official header image for VR Furballs - Demolition game - Steam 704470",
    "Canonical URL": "https://gusku.site/game/vr-furballs-demolition",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"VR Furballs - Demolition\", \"description\": \"Looking for information on VR Furballs - Demolition? Check out the release date (Nov 9, 2018), developer insights from Gamily Studios, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Nov 9, 2018\", \"author\": {\"@type\": \"Organization\", \"name\": \"Gamily Studios\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Gamily Studios\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/704470/header.jpg?t=1646229402\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}