{
    "AppID": 2103630,
    "Name": "77 Oleander Avenue",
    "Release date": "Dec 19, 2022",
    "About the game": "On July 21st, 2022, a single investigator entered the abandoned home at 77 Oleander Avenue. Two hours afters after her arrival, she lost contact with the outside world. These are the events of that night. These are the remains of a ghost story, told for the sake of a Ghost. Waking up disoriented and weary, Tabby (Short for Tabitha, but she's not gone by her full name since 3rd grade) wakes up in the parlor of an abandoned house. Her keys, wallet, and phone are missing and she can't remember why she's in such a place... not that it's too far gone from some of the other places she's woken up in over the years. It doesn't take long for her to meet Evie, a ghost, and this greatly irritates Tabby on account of she was hoping to just grab her things and leave quickly. The Larkspur house on 77 Oleander, however, is not Evie's home. It is not the site of a bittersweet tragedy. It is not the skeleton left behind by a family's unexpected death. Tabby will realize this too late, and then, when she's finally ready to heed Evie's warnings, she will forget. About the Game 77 Oleander Avenue Ghost House Investigation is a narrative driven Horror Mystery game that follows Tabby, a paranormal investigator who wakes up in an abandoned house with no memory of where she is or why she's there. Through the course of the game you'll learn more about the family that once occupied the home, the mysterious circumstances surrounding their deaths, and ultimately decide what you believe about the haunting of 77 Oleander. Set in a small coastal city in southeastern North Carolina, the game explores deep-seated religious trauma, the nature of ghosts and demons, the way we create narratives of a person's Death, and contemplates the prospect of flirting with a supernatural orb. Instructions and Controls 77 Oleander is a Visual Novel in which you'll need to explore the rooms and levels of an abandoned house in order to find your cell phone, wallet, and the keys to your truck so that you can get out as soon as possible. It won't be that simple, but let's start there for now. You begin by choosing one of three parts of the house to search, and once you've searched all three areas you'll need to declare your theories and beliefs about the history and the hauntings of 77 Oleander Avenue. Your beliefs, your conclusions, and your view of the family that once lived here will determine the ending you reach. Keyboard/Mouse Left Click/Spacebar/Enter - Confirm/Advance Dialogue Esc/Right Click - Open Menu Mouse/Arrow Keys - Navigate dialogue choices &amp; menu options A - Enable Auto-mode Page Up - Rolls back to previous dialogue/choices Ctrl - Skips previously read dialogue/actions Ctrl+A - Opens the Accessibility Menu H - Hides User Interface S - Screenshot Gamepad (Steampad, PS4/5, XBox controller compatible) D-Pad, Joysticks: Navigates game interface, selects options A: Advances Dialogue and confirms choice selections B: Take a Screenshot X: Enable Auto-mode Y: Hides the User Interface Start/Select: Opens the game menu L1/L2: Rolls back to previous dialogue/choices R1/R2: Skips previously read dialogue/actions L3/R3: Opens the Accessibility Menu Key Features The full game contains 9 endings, multiple routes and at least six ways to die; a complex and insidious mystery, something horrible that may be watching you at all times, dozens of opportunities to flirt with a ghost, and more! Multiple routes, 9 endings, and dozens of very unsafe haunted rooms to explore; A unique system for selecting your final route: Your beliefs and theories about 77 Oleander will determine the ending you reach. A Real Dog* that you can pet; A Non-linear narrative that shifts based on your belief and conclusions; Orb Interaction; And More! *Dog is real, dog is not composed of fur or flesh.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2103630/header.jpg?t=1671462587",
    "Price": 4.24,
    "Developers": "Runa Liore Winters",
    "Publishers": "Waxweal",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_34ec82c2740e2acae1bff7d04dd0ad06d38fe2fa.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_f23abea18e42106cb22e8bc7e13e4da6317e3696.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_fab4ec9ef3cc7a381024f85d3af960a236baaf6f.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_8490b61bc0265edf2fc783931b92b7de2f89b164.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_2c02afcc817edf09a3f9921dc022dfb1d6acfca0.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_502ebc16f61caa50c3c398a8b803a5a1f2d287f4.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_255f92beb6b3ba198dca8083413a7ff6ea1ce869.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_c97c812ad2913402ea77a2b4434cd2c14f8ccc36.1920x1080.jpg?t=1671462587,https://cdn.akamai.steamstatic.com/steam/apps/2103630/ss_4340572e6612f4b47dc2a344a7d269e6fe2261a9.1920x1080.jpg?t=1671462587",
    "Slug": "77-oleander-avenue",
    "Meta Title": "77 Oleander Avenue: Dec 19, 2022, Runa Liore Winters and ...",
    "Meta Description": "Looking for information on 77 Oleander Avenue? Check out the release date (Dec 19, 2022), developer insights from Runa Liore Winters, and a complete gam...",
    "Alt Text Image": "Official header image for 77 Oleander Avenue game - Steam 2103630",
    "Canonical URL": "https://gusku.site/game/77-oleander-avenue",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"77 Oleander Avenue\", \"description\": \"Looking for information on 77 Oleander Avenue? Check out the release date (Dec 19, 2022), developer insights from Runa Liore Winters, and a complete gam...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Runa Liore Winters\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Waxweal\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2103630/header.jpg?t=1671462587\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.24, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}