{
    "AppID": 1703070,
    "Name": "Airborne Ranger",
    "Release date": "Dec 19, 2022",
    "About the game": "Alone behind enemy lines, equipped with your elite Ranger training, small arms, and strategically placed cases of ammunition, you must complete twelve challenging missions and earn your promotion to full bird colonel. Welcome to the re-release of Airborne Ranger, one of Microprose's most critically acclaimed war games. At the start of each mission you go through a proper pre-combat briefing session, and then select a Ranger from your company that has what you think are the right skills for the job ahead. You start each mission by piloting the brand new V-22 Osprey and picking locations to drop three ammo crates deep in enemy territory (Airborne Ranger was released in 1988, the Osprey first came into active service in 1989, so this is some real black ops business). Each supply crate contains ammunition, time bombs, first-aid kits, grenades &amp; LAW rockets depending on your briefing. Choose locations wisely: you can only carry so much ammo, so resupply is critical. Then parachute behind enemy lines and get to work. .. and this is no easy drop, you will need to steer your parafoil to a safe landing. Missions range from destroying military targets and sabotaging installations, to rescuing POWs and stealing secrets. You’ll need to navigate enemy troops and officers, minefields, foxholes and bunkers. Switch between stealth and surgically accurate combat to succeed. At times you might even need to steal an enemy uniform. And you better get back to the LZ for exfil in time, or you will get captured. If you get captured, welcome to your next mission – you are going to need to mount a rescue attempt before you can complete the primary objective. Understanding the environment is critical to success. In the arctic missions you can lure enemies onto unstable ice, in the jungles and forests you can hide under water. Do you use your knife? Your M4? Or a delayed time bomb? Sprint across the open field, or crawl in a trench to avoid detection? It is all up to you. Practice mode lets you try individual missions, and then step up to Veteran mode and you will have to complete all 12 missions as a campaign. You’ll rank up with each successful mission, all the way to a full colonel in the U.S. Airborne Rangers. Twelve missions, winter, desert and jungle terrains, and four difficulty modes will keep you playing again and again. A mix of strategy and arcade action An accurate 80s menu of weapons Choose from your squadron of Rangers for every mission 12 timed missions Randomly generated maps for endless replay Airborne Ranger was lauded upon release for a number of reasons. Compute Magazine called it “an excellent game from beginning to end,” and warned 'the violence and action are graphic and highly realistic.” Computer Gaming World praised the level of detail after they noticed that gunfire sounded differently if you are inside a building vs outside. Retro enthusiasts have called it a “stealth shooter” and a pioneer of the genre.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1703070/header.jpg?t=1671459444",
    "Price": 9.99,
    "Developers": "Microprose",
    "Publishers": "Atari",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_fb74198b6d8ef0b64bf6e1d2ff7c17f10ddd4a4b.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_2cf7102a9c776bd992b3a5e5f1da7d9aea475ee5.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_f1a1876170b6396b663ceb01c6c46bde0c76d2d5.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_3d766bb4c3d91dd740665e7cafefe5b22379aafe.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_48396070ebc0940da7b0a202dbc3d02ed32983f9.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_22189a3ce0c7ea5f4650947939f3ac5f66771dba.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_672ea0480dfad80d792a1e930f41583490ad05f9.1920x1080.jpg?t=1671459444,https://cdn.akamai.steamstatic.com/steam/apps/1703070/ss_02c0f016d7fc60108aed85125f1f69e5779c9b00.1920x1080.jpg?t=1671459444",
    "Slug": "airborne-ranger",
    "Meta Title": "Airborne Ranger: Dec 19, 2022, Microprose and Full Overview",
    "Meta Description": "Looking for information on Airborne Ranger? Check out the release date (Dec 19, 2022), developer insights from Microprose, and a complete game summary.",
    "Alt Text Image": "Official header image for Airborne Ranger game - Steam 1703070",
    "Canonical URL": "https://gusku.site/game/airborne-ranger",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Airborne Ranger\", \"description\": \"Looking for information on Airborne Ranger? Check out the release date (Dec 19, 2022), developer insights from Microprose, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 19, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Microprose\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Atari\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1703070/header.jpg?t=1671459444\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}