{
    "AppID": 2076220,
    "Name": "Akai Katana Shin",
    "Release date": "Dec 14, 2022",
    "About the game": "It is now the Taisho era in a world similar to olden Japan during a period of rapid economic growth. Fighter jets, tanks, and battleships have entered the war, and giants known as Guardians and Mugen are tearing their way through the battlefield. This is the exciting stage of Akai Katana Shin, a horizontal shoot 'em up game. The Japanese-inspired military game visuals and gorgeous character designs portray a dramatic story of clashes between family and old friends. These elements are tied together by strategic game mechanics, which feature a wide variety of attack methods to experiment with. Find out for yourself why this game has such a strong base of ardent fans! Contains Three Titles From Cave's Akai Katana Series Akai Katana The first arcade game of the series released in 2010. Supports two players. Akai Katana Shin A home console version with an aspect ratio of 16:9 and new game features such as Hagane and Katana. Akai Katana Zetsu Based on Akai Katana with an aspect ratio of 16:9. Game mechanics have been adjusted for balance. From Strategy Crafting to Score Attack—Versatile Enough to Play It Your Way The player unit known as Fighter can switch between its normal form and a giant ninja known as Guardian using Soul-shift. The unit also comes equipped with two different bullet shots. Attack Mode has more power and Defense Mode boosts mobility. Make good use of a combination of forms and modes to break through enemy ranks and destroy them. Soul-shift is a crucial technique that boosts the player for a short while. In Akai Katana and Akai Katana Zetsu, timing the shift well can block enemy bullets even on a screen that's full of them. In Akai Katana Shin, generate and fire a Katana shot to quickly defeat strong enemies. The highlight of this title is the ability to negate or dispel attacks instead of simply avoiding them. Make good use of Soul-shift to turn the tide in your favor and earn a higher score. Quality Game Modes Packed With Features Settings: Adjust options such as sound volume and screen display. Turn Screen Frame on to see captions for character voices during the game. Training: Specify a stage and adjust your unit's condition to carry out individual training. Score Attack: See how far you can go with only one life. No continues or restarts allowed. Rank and replays can be saved separately from normal gameplay. Online Leaderboard: See how your score compares against other players online. Replay: Record and save gameplay data from start to end of session. Other than playing and pausing the replay, you can also use the Edit function to jump right into the game from a specific point in time. Daisuke Matsumoto's New Soundtrack Masterpieces Daisuke Matsumoto, music composer of Gothic wa Mahou Otome and sound effects producer for the Akai Katana series, returns with exciting new musical arrangements for the game's soundtrack. You can switch between three different versions of BGM for this game, including the original audio and new tracks created for Akai Katana Shin.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2076220/header.jpg?t=1671030018",
    "Price": 29.99,
    "Developers": "CITY CONNECTION,TAKE×0FF",
    "Publishers": "CITY CONNECTION",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2076220/ss_c0a257fd8e7be224e515be040942b8703d8a7b1f.1920x1080.jpg?t=1671030018,https://cdn.akamai.steamstatic.com/steam/apps/2076220/ss_37b6e7552d380b33917172fe1c7f18bf9a65f8db.1920x1080.jpg?t=1671030018,https://cdn.akamai.steamstatic.com/steam/apps/2076220/ss_3613bb9f56c7322be87f8b36624ebd8f420c7929.1920x1080.jpg?t=1671030018,https://cdn.akamai.steamstatic.com/steam/apps/2076220/ss_2a7a0661955cf28afd92cd459cad7273c907b1b9.1920x1080.jpg?t=1671030018,https://cdn.akamai.steamstatic.com/steam/apps/2076220/ss_1597a3117ec3d0a1a2bb0f48175c0bcbaf3b02f6.1920x1080.jpg?t=1671030018,https://cdn.akamai.steamstatic.com/steam/apps/2076220/ss_aaae7551f581d0f1c589056ba136a96bf7bf9713.1920x1080.jpg?t=1671030018",
    "Slug": "akai-katana-shin",
    "Meta Title": "Akai Katana Shin: Dec 14, 2022, CITY CONNECTION,TAKE×0FF ...",
    "Meta Description": "Looking for information on Akai Katana Shin? Check out the release date (Dec 14, 2022), developer insights from CITY CONNECTION,TAKE×0FF, and a complete...",
    "Alt Text Image": "Official header image for Akai Katana Shin game - Steam 2076220",
    "Canonical URL": "https://gusku.site/game/akai-katana-shin",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Akai Katana Shin\", \"description\": \"Looking for information on Akai Katana Shin? Check out the release date (Dec 14, 2022), developer insights from CITY CONNECTION,TAKE\\u00d70FF, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"CITY CONNECTION,TAKE\\u00d70FF\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"CITY CONNECTION\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2076220/header.jpg?t=1671030018\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}