{
    "AppID": 2249570,
    "Name": "模拟经营我的大学 Be president of a university",
    "Release date": "Dec 29, 2022",
    "About the game": "This game is developed independently by individuals. You are welcome to experience it. If you have any questions, you can put forward them in the forum or join the qq group to discuss them. Thank you very much for your support. This is a simulation business game. Players play the role of university president in the game. Players need to manage and formulate various policies and measures. The game really simulates the current situation of the university. 1. Students' dormitory: players can decide when to turn off the electricity in the dormitory. The time of turning off the electricity will affect students' learning quality and state; Different numbers of dormitories can be arranged and built to meet the needs of different students. Of course, modern equipment such as air conditioners, campus networks, sweeping robots, humidifiers can also be installed in student dormitories to enrich students' after-school life and reduce their learning pressure. 2. School restaurant: players can recruit chefs of different levels, rarities and abilities, adjust and adjust the prices of various dishes to meet students' different tastes; Cultivate chefs to become top chefs, so as to better retain students' stomachs; 3. Laboratory building: students can carry out university experiments on various subjects and difficulties in the laboratory building, and install different experimental equipment. The more advanced the experimental equipment, the more successful the experiment will be; 4. Sports center: players can form various teams (track and field, swimming, shooting, tennis, fencing, football, men's ball, volleyball, gymnastics, table tennis, badminton, etc.) to cultivate their own sports teams and various types of talented sports talents, When the team is strong enough, it can conduct various competitions (college student league, Olympic Games, etc.) to win various awards (gold, silver, bronze, etc.) to improve the reputation and popularity of the school; 5. School library: In addition to the standard library, players can also install different equipment to improve the comfort of the library. As long as conditions are met, they can also evaluate various titles; It is also possible to open a digital library, and it is not easy to maintain the digital library; The library is also a part of the library, but it is a rare collection of books, and it is the only way to improve the comprehensive strength of the school; 6. Academy of Sciences: When your school is getting stronger, you can recruit scientific researchers to carry out basic research on various technologies. Once successful, you can also authorize research results to social science and technology companies, reflecting your school's comprehensive scientific research ability; 7. Office building and teaching building: various supporting facilities can be installed to maximize teaching quality and improve students' learning efficiency; 8. Associations: Players of school associations can form various associations, each of which is different, to meet students' different interests; 9. Logistics: You can't neglect the logistics personnel who serve the school. The good operation of the whole school depends on them; Come and experience the fun of being a headmaster! Game communication group: Qq1 group: 366121564 Qq2 group: 788479564 Qq4 group: 695453176 Qq5 group: 850740692 Qq6 group: 183436358",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2249570/header.jpg?t=1672304272",
    "Price": 3.59,
    "Developers": "9mi",
    "Publishers": "9mi",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2249570/ss_dfa4786b0716c5c2314d16547f50d940d5042eb7.1920x1080.jpg?t=1672304272,https://cdn.akamai.steamstatic.com/steam/apps/2249570/ss_66959482e4632e8d37bf19abd3c9c47d8bcc485b.1920x1080.jpg?t=1672304272,https://cdn.akamai.steamstatic.com/steam/apps/2249570/ss_1787d871b964034a7c968b45466f11413e09eb43.1920x1080.jpg?t=1672304272,https://cdn.akamai.steamstatic.com/steam/apps/2249570/ss_a9df4586fb0eb8fc7d4743b73933788c5399cc07.1920x1080.jpg?t=1672304272,https://cdn.akamai.steamstatic.com/steam/apps/2249570/ss_8e9beec116c80e352c1f882746d30eca679aabc8.1920x1080.jpg?t=1672304272,https://cdn.akamai.steamstatic.com/steam/apps/2249570/ss_dbedd0db0453e9961dc3d3013d1a0dad8b3aa5f2.1920x1080.jpg?t=1672304272",
    "Slug": "be-president-of-a-university",
    "Meta Title": "模拟经营我的大学 Be president of a university: Dec 29, 2022, 9mi ...",
    "Meta Description": "Looking for information on 模拟经营我的大学 Be president of a university? Check out the release date (Dec 29, 2022), developer insights from 9mi, and a complete...",
    "Alt Text Image": "Official header image for 模拟经营我的大学 Be president of a university game - Steam 2249570",
    "Canonical URL": "https://gusku.site/game/be-president-of-a-university",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u6a21\\u62df\\u7ecf\\u8425\\u6211\\u7684\\u5927\\u5b66 Be president of a university\", \"description\": \"Looking for information on \\u6a21\\u62df\\u7ecf\\u8425\\u6211\\u7684\\u5927\\u5b66 Be president of a university? Check out the release date (Dec 29, 2022), developer insights from 9mi, and a complete...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"9mi\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"9mi\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2249570/header.jpg?t=1672304272\", \"offers\": {\"@type\": \"Offer\", \"price\": 3.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}