{
    "AppID": 2107640,
    "Name": "Bleeding Metal Rainbow",
    "Release date": "Dec 22, 2022",
    "About the game": "WARNING: Bleeding Metal Rainbow contains flashing images. If you experience epileptic seizures or blackouts, immediately stop playing Bleeding Metal Rainbow and consult your doctor before resuming. Hi I'm Travis. I made this video game. I'm publishing this unfinished before the company I once worked for distorts and redesigns my work, making it totally unrecognizable. Long story short, before planning to put in my 2 weeks notice, I decided to pitch a big project of my own. Shovel Software loved it so much they gave it full funding and with me in control of production. I started fleshing out the concepts and designs, then started programming the game. Two weeks into the project, all of sudden I get called in the office and the boss fires me. This left me no choice but to delete everything but the final level, leaving it unfinished. It was the only level they'd seen and I didn't want them to finish what I started. I worked for Shovel Software for 13 years and was immediately terminated two weeks after pitching this project. I wonder if its because they found my resignation draft in the actual project. I've programmed and designed hundreds of quick-money grabbing games for this company, making them millions and I'm the clown thinking working above and beyond gets me up the chain. You can work hard and dedicate all your energy to a place that doesn't care about you. I should've known this was going to happen. They can't win this time. I can't let them. They may have all my ideas and projects but I'll fight till the end! I for once am taking control of me, my life, my soul. I gave them my time, my energy, my money. I'm all I have left. This shoot 'em up piece is about focus, and not giving up. Not much to say about gameplay, but do notice the patterns, learn to dodge quickly, and position yourself for some sweet strikes! Oh, and there's also a time score to see how fast you completed the game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2107640/header.jpg?t=1671747420",
    "Price": 1.0,
    "Developers": "Butterfly",
    "Publishers": "Butterfly Corporation",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2107640/ss_9cba3a6f66510d11380d0cc1f1ef67753ace687f.1920x1080.jpg?t=1671747420,https://cdn.akamai.steamstatic.com/steam/apps/2107640/ss_78d4c233d67bbfb11950219db513a9ffe165ff76.1920x1080.jpg?t=1671747420,https://cdn.akamai.steamstatic.com/steam/apps/2107640/ss_2da959c7aa8dfd494d03e73585518fae5db4a4c4.1920x1080.jpg?t=1671747420,https://cdn.akamai.steamstatic.com/steam/apps/2107640/ss_ec7cd95d165a8ef59567d63a5325bc59a43be153.1920x1080.jpg?t=1671747420,https://cdn.akamai.steamstatic.com/steam/apps/2107640/ss_d7bfdb763fdc654cac0757f45f48752cd95899eb.1920x1080.jpg?t=1671747420",
    "Slug": "bleeding-metal-rainbow",
    "Meta Title": "Bleeding Metal Rainbow: Dec 22, 2022, Butterfly and Full ...",
    "Meta Description": "Looking for information on Bleeding Metal Rainbow? Check out the release date (Dec 22, 2022), developer insights from Butterfly, and a complete game sum...",
    "Alt Text Image": "Official header image for Bleeding Metal Rainbow game - Steam 2107640",
    "Canonical URL": "https://gusku.site/game/bleeding-metal-rainbow",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Bleeding Metal Rainbow\", \"description\": \"Looking for information on Bleeding Metal Rainbow? Check out the release date (Dec 22, 2022), developer insights from Butterfly, and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Butterfly\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Butterfly Corporation\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2107640/header.jpg?t=1671747420\", \"offers\": {\"@type\": \"Offer\", \"price\": 1.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}