{
    "AppID": 2189150,
    "Name": "Conspiracy TD",
    "Release date": "Dec 24, 2022",
    "About the game": "Tower Defense game(not a maze) where you build units to destroy incoming waves of monsters or....not succeed trying :) Basic info: Incoming enemies can and will attack your units occasionally as well, have no worries as you will be equipped with multiple ways to protect, regenerate or shield your units. Game begins slowly with only few towers to pick from and as you progress you will get basic defensive upgrades(which are mostly mandatory only on higher difficulties), different choice of towers, tower specializations (from level 10, example archer has - burning(spreadable), ice or poison arrows), offensive tower upgrades(increased range, damage to specific type...) Multiplayer : ( PLEASE READ if you are planning on playing multiplayer) There is lobby currently and it is in test mode, game works, difficulty is scalable on number of players all is 'supposedly' working but it needs more testing. There is No local support for multiplayer(2 or more players playing on 1 PC, like split screen) Lan has been disabled currently Some visuals are temporarily disabled (like trail on rocket projectile or witch projectile...) on client side. There is no color differential for players as of this patch and there is no limit for how many units each player can build, don't abuse it :) . Levels and difficulty: Currently 25 levels are active. Plan is 50+ (Enemy waves are usually between 15 and 25 per level, there are few exceptions) 5 - 15 mins per level You can choose any of 5 difficulties Playing on higher difficult will get you to earn more points. 4 Different Types of units(Single Target, Multi target, Aoe and utility) 14 different units can be build(plan 20+). Some are variations and some are more specialized for certain fights. Each tower can be upgraded 3 to 7 times regardless of their specialization upgrades Game maps and optimization: There are 2 maps HighQ and LowQ( you can choose in options -&gt; graphic), you would need to start again from main menu if you decide to change (enemy wave levels are identical) HighQ is default one and is preferable to play if you have non IGPU(non integrated graphic card) LowQ is very basic and has box shapes, circles instead of landscape with regular lightning. Purpose of LowQ map is for PCs with integrated graphic cards or if you prefer higher FPS or prefer simplicity of map. Lowering details below 4 will change meshes to simpler models(0-10) and below 2 will change them to old fashion static mesh style You can customize how much forest or flowers you would like in graphic options -&gt; additional options -&gt; beware as those reduce FPS if you apply too much Skills: Skills(or talents) are currently being in progress of creating and balancing.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2189150/header.jpg?t=1671977073",
    "Price": 4.49,
    "Developers": "Arc51",
    "Publishers": "Arc51",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_7e834b5866a54113d821a681e5e701fa6990e3d3.1920x1080.jpg?t=1671977073,https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_fdcea44e101564f24360c3419d7056cfb587e7e7.1920x1080.jpg?t=1671977073,https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_1c5807b4636136050161430d50930b2e068ee998.1920x1080.jpg?t=1671977073,https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_c60fc9378371688dde0f440c33d203e75f51086c.1920x1080.jpg?t=1671977073,https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_fe2704dbb9a554f17639581a93297307b415295c.1920x1080.jpg?t=1671977073,https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_18449b2749461834303adefb028d9efc9b2a3d1a.1920x1080.jpg?t=1671977073,https://cdn.akamai.steamstatic.com/steam/apps/2189150/ss_d7f540597ee91cc72e09b92b5aa4f9c0f8493eea.1920x1080.jpg?t=1671977073",
    "Slug": "conspiracy-td",
    "Meta Title": "Conspiracy TD: Dec 24, 2022, Arc51 and Full Overview",
    "Meta Description": "Looking for information on Conspiracy TD? Check out the release date (Dec 24, 2022), developer insights from Arc51, and a complete game summary.",
    "Alt Text Image": "Official header image for Conspiracy TD game - Steam 2189150",
    "Canonical URL": "https://gusku.site/game/conspiracy-td",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Conspiracy TD\", \"description\": \"Looking for information on Conspiracy TD? Check out the release date (Dec 24, 2022), developer insights from Arc51, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 24, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Arc51\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Arc51\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2189150/header.jpg?t=1671977073\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.49, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}