{
    "AppID": 2176180,
    "Name": "Crossword World Puzzle",
    "Release date": "Dec 12, 2022",
    "About the game": "Welcome to Crossword World! Have you a boring day?! This is the time to change this! We are present you new crossword puzzle game that changes your day to more exciting! We prepared just for our users the most popular features from the free word connect games connected with beautiful graphics. Vocabulary games with many levels, and increasingly difficult words. What more could you want? Word connect game with new word games features: 2) Connect the letters by line horizontally, vertically, diagonally, forwards, or backward to find hidden words! 3) Join to our offline puzzle games and beat levels that we prepared for you, and find the increasingly difficult words! 4) Try new word games and become a word master in this word connect game! 5) Many different crosswords levels will guarantee you a thousands hours of fun 6) Discover new free word games with many different places to visit and learn words This word search game is easy to play but difficult to pass. So in our free games words you can spend a lot of time and still have what to do. We are big fans of the free word connect games, and vocabulary games so we know what our players want! Why do we think that this game is one of the best free word games? 1) This cross word puzzle game is totally free, so you can play them in your all devices, 2) In our free word games, everything was created with our offline puzzle games players in mind, 3) The difficulty crosswords level increases with the progress of the game, 4) New word games are perfect for boring days, relax and just start to train your brain with our cross word puzzle game, 5) This crossword world will guarantee you hundreds of hours of fun like in best word games 6) This word search game has an offline mode so you solve crosswords anywhere, 7) Benefits for a regular play in this crossword game - we give you daily rewards for a regular learn words, 8) Treat this word game not only as fun but also as a great way to learn a language, 9) In this word game, we connected the most popular features from the best free word games with beautiful graphics 10) Free word connect games where you can build your own miniature park We are in both word search games categories such as adult word connect games and kids word connect games! So this is the perfect crossword game for all age groups who love free games words. With our vocabulary games, you can learn new words and train your brain! In our best word games, you can also remind words that you forgot. This word game is a great option to spend a perfect time with your whole family. In our offline puzzle games, you can compete with each other who knows the more words! Get ready for the many challenges that await you in these word puzzle game! Are you ready to take on these challenges? This crossword world wait for your decision! Join to free games words, just train your brain now, and learn words. Have fun with this word search game!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2176180/header.jpg?t=1670836195",
    "Price": 0.0,
    "Developers": "Vipera Games Sp. z o.o.",
    "Publishers": "Vipera Games Sp. z o.o.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_3ea1419955f7bd33efb5c5832fa43939e0fa1c0e.1920x1080.jpg?t=1670836195,https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_98f2ac7a53e18bea6402b8662e8600d5ef1b22be.1920x1080.jpg?t=1670836195,https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_06fd4450d030e27fd646a4cef48403d71ef97837.1920x1080.jpg?t=1670836195,https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_4e719d2e898b82eb89459179c683ffc4f91a591f.1920x1080.jpg?t=1670836195,https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_3ef40dff9e6a5a9dbed2052bc2d13443e1c1d3e6.1920x1080.jpg?t=1670836195,https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_302b9116dda0b1f3144d7398d454d583bec25054.1920x1080.jpg?t=1670836195,https://cdn.akamai.steamstatic.com/steam/apps/2176180/ss_97d9e436f1964acc804fb1a6eacf65adbc6e9174.1920x1080.jpg?t=1670836195",
    "Slug": "crossword-world-puzzle",
    "Meta Title": "Crossword World Puzzle: Dec 12, 2022, Vipera Games Sp. z ...",
    "Meta Description": "Looking for information on Crossword World Puzzle? Check out the release date (Dec 12, 2022), developer insights from Vipera Games Sp. z o.o., and a com...",
    "Alt Text Image": "Official header image for Crossword World Puzzle game - Steam 2176180",
    "Canonical URL": "https://gusku.site/game/crossword-world-puzzle",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Crossword World Puzzle\", \"description\": \"Looking for information on Crossword World Puzzle? Check out the release date (Dec 12, 2022), developer insights from Vipera Games Sp. z o.o., and a com...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 12, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Vipera Games Sp. z o.o.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Vipera Games Sp. z o.o.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2176180/header.jpg?t=1670836195\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}