{
    "AppID": 1817720,
    "Name": "Defensive War -SEALED GOLEM-",
    "Release date": "Dec 14, 2022",
    "About the game": "The purpose of the game is to defend the castle (although it may not be the castle). Enemy monsters will come every wave. Clearing all the waves is your victory. Defense is done using units. Units include warriors, archers, magic soldiers, catapults, and healers. As you progress through the story, you will have more friends. Not all units can be put into battle. So you need your strategic brain. The unit uses points to sortie. Points can be earned over time (you can also earn points by defeating enemies). The Hero of the game has various abilities. He can wield a sword, shoot a bow, and use magic. It's a valuable character, so try to move it in a way that suits your strategy. When the unit is defeated, it will retreat from the battlefield. However, the hero is resurrected many times and tries to start the battle again. It will take some time to revive. The enemy has weaknesses. As you progress through the story, you may find enemies that you can't beat. In such a case, let's start by knowing the weaknesses of enemy monsters. If you can make good weaknesses, you may be able to proceed with the battle easily. If you win the battle, you can get experience points. You can strengthen your unit as well as experience points. You can make your favorite unit stronger, or you can make it stronger overall. ·story The Hero is a man who lives in a small village. An incident occurs in a peaceful village. A monster suddenly arrives in the village and is ruining the village. The man fled to a shrine near the village. A monster will soon come to the frightened man. When the man was prepared to die, a golem popped out of the wall. The golem scavenges the monsters at once and saves the man. The golem seems to follow the man. The man succeeded in rescuing the village using a golem. The village has been badly devastated. The villagers are frightened by the next monster. At the castle in the village, I was worried about defense operations. After hearing the rumors of a fighting golem, the king decides to have the man and the golem participate in a defense operation. Then the man and the golem will fight the monster with the soldiers of the castle. Monsters that suddenly appeared in the world. What is the cause? How could the golem break the seal himself? A man and a golem travel the world and search for them.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1817720/header.jpg?t=1671083647",
    "Price": 19.99,
    "Developers": "Easy Mode",
    "Publishers": "Easy Mode",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1817720/ss_784fa42ca871b373efc609643f2f75cda8e0fbde.1920x1080.jpg?t=1671083647,https://cdn.akamai.steamstatic.com/steam/apps/1817720/ss_fb5a57997ef7b7de6be16d25c34035abb308cbea.1920x1080.jpg?t=1671083647,https://cdn.akamai.steamstatic.com/steam/apps/1817720/ss_9088c74aa4cf9d593aff36af06f7550a53e6a948.1920x1080.jpg?t=1671083647,https://cdn.akamai.steamstatic.com/steam/apps/1817720/ss_9b17d70185339b6799d61aa0b9008573ea7d6b93.1920x1080.jpg?t=1671083647,https://cdn.akamai.steamstatic.com/steam/apps/1817720/ss_7596f5177473e8f722b530085ebab25291b0963c.1920x1080.jpg?t=1671083647,https://cdn.akamai.steamstatic.com/steam/apps/1817720/ss_6f803e804d0d14dadb9ecd1c0d88c9584e6d340c.1920x1080.jpg?t=1671083647",
    "Slug": "defensive-war-sealed-golem",
    "Meta Title": "Defensive War -SEALED GOLEM-: Dec 14, 2022, Easy Mode and...",
    "Meta Description": "Looking for information on Defensive War -SEALED GOLEM-? Check out the release date (Dec 14, 2022), developer insights from Easy Mode, and a complete ga...",
    "Alt Text Image": "Official header image for Defensive War -SEALED GOLEM- game - Steam 1817720",
    "Canonical URL": "https://gusku.site/game/defensive-war-sealed-golem",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Defensive War -SEALED GOLEM-\", \"description\": \"Looking for information on Defensive War -SEALED GOLEM-? Check out the release date (Dec 14, 2022), developer insights from Easy Mode, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 14, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Easy Mode\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Easy Mode\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1817720/header.jpg?t=1671083647\", \"offers\": {\"@type\": \"Offer\", \"price\": 19.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}