{
    "AppID": 1119480,
    "Name": "Dolly Wars - Auto Tactics",
    "Release date": "Dec 15, 2022",
    "About the game": "Dollies are the new race of beings. They are squishy and made entirely out of gummy candy. Since gummies are all they eat, they tend to butt heads over which color gummy is the most delicious. They are not afraid to fight in the name of their preferred gummies. Consequently, war has broken out between two Dolly factions, those who adore blue gummies and those who prefer red ones. As the commander of the blue-gummy faction, your objective is to defeat the nonconforming red gummies and paint the jelly world blue! Utilize the unique power of each Dolly to win the war! Each Dolly has a unique 'job' such as Boxer, Cowboy, Pirate, Assassin etc. Get to know the strengths and weaknesses of each Dolly and manage your troops accordingly to outsmart the enemy. Also, keep in mind that depending on the terrain, certain locations on the map will give your units an advantage. Try out various unit combinations and find out what works best for you! During battle, Dollies will seek out and attack their targets automatically without any input on your part. So, just sit back and watch how the match unfolds. If the battle didn't go as you had planned, adjust your tactics and try again! Hone your strategy with 3 different modes Campaign Mode: Each campaign is made up of different stages, each consisting of a certain number of enemy units. To defeat the enemy, you've got to build up your Dolly forces by spending on your army as you see fit. Enemy formations become more complex and more difficult to defeat as you progress through each stage, so be careful! Playing in campaign mode is a great opportunity to gain an understanding of your units. Sandbox Mode: You can freely deploy both your own forces as well as enemy units wherever and however you like without any cost restriction. See how your custom arrangements unfold and just have fun! Multiplayer Mode: Invite your friends via Steam or through sharing codes and play against them. During multiplayer games, you will be aware of how your opponent has arranged his/her forces, but you will have no idea exactly which Dollies your opponent has deployed. In other words, you have to anticipate what your opponent is planning to do and act accordingly. This makes the whole experience much more strategic and fun!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1119480/header.jpg?t=1671224020",
    "Price": 0.0,
    "Developers": "Dolly Studio",
    "Publishers": "Dolly Studio,RisingWings",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1119480/ss_b5ebc35ce8ef6a27653c9dabfe6afb04b9d240e0.1920x1080.jpg?t=1671224020,https://cdn.akamai.steamstatic.com/steam/apps/1119480/ss_36137dd9ae60837dd6ea29e96ed49a2905a4642a.1920x1080.jpg?t=1671224020,https://cdn.akamai.steamstatic.com/steam/apps/1119480/ss_4f40f27dac2daebf9675ccbdbebf6cce8ca5ea27.1920x1080.jpg?t=1671224020,https://cdn.akamai.steamstatic.com/steam/apps/1119480/ss_b39aa21df05dc09d2473fda56e63b15eb5e73021.1920x1080.jpg?t=1671224020,https://cdn.akamai.steamstatic.com/steam/apps/1119480/ss_46c744c08e33177eff3f6898dde51ee794628b2e.1920x1080.jpg?t=1671224020,https://cdn.akamai.steamstatic.com/steam/apps/1119480/ss_211b47726b656c7b59179a78a63f4042e62ad1f8.1920x1080.jpg?t=1671224020",
    "Slug": "dolly-wars-auto-tactics",
    "Meta Title": "Dolly Wars - Auto Tactics: Dec 15, 2022, Dolly Studio and...",
    "Meta Description": "Looking for information on Dolly Wars - Auto Tactics? Check out the release date (Dec 15, 2022), developer insights from Dolly Studio, and a complete ga...",
    "Alt Text Image": "Official header image for Dolly Wars - Auto Tactics game - Steam 1119480",
    "Canonical URL": "https://gusku.site/game/dolly-wars-auto-tactics",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dolly Wars - Auto Tactics\", \"description\": \"Looking for information on Dolly Wars - Auto Tactics? Check out the release date (Dec 15, 2022), developer insights from Dolly Studio, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dolly Studio\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dolly Studio,RisingWings\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1119480/header.jpg?t=1671224020\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}