{
    "AppID": 2237800,
    "Name": "Dragon's Treasure",
    "Release date": "Dec 29, 2022",
    "About the game": "Dragon's Treasure is a Roguelike action game. It mainly uses the game mechanism of single person running, group climbing and tower climbing, and generates different event results with 20 dice to have multiple effects on the character. The game's fighting method is to constantly defeat the boss to obtain the corresponding transformation ability. Then, it continues to pass through the dungeons by combining relics and different transformation abilities. There are 15 kinds of transformation weapons and 7 kinds of conventional weapons in the game, At present, the game has thousands of appearance combinations and appearance styles, 55 kinds of relics change the role's fighting ability, and 25 kinds of events are divided into success, failure, great success, great failure and other results. 1、 Game map mechanism - single team running+tower climbing The non combat regular running team climbing mode of the game is driven by a 20 sided dice system similar to a board game. The results of 20 sided dice are success, failure, great success and great failure. 2、 Game fighting method - constantly defeat powerful enemies to obtain rare relics, and combine multiple relics effects to build your own fighting mode. For example, such as focused anti missile fighting mode with anti relics, anti injury fighting mode with defense, sub bullet time fighting mode with extreme dodge, and rampage fighting mode with basic attack critical acceleration. The following example is the violent fighting mode The following example is the missile anti relics fighting mode 3、 Game transformation playing method - by defeating a powerful special enemy, you can obtain the enemy's exclusive weapons. After use, you can change the character's fighting mode and become a powerful enemy you can defeat. For example, there are only 7 types of melee weapons for conventional weapons, but there are 15 types of transformation weapons, including long-range weapons such as bows and arrows, mage's staff, ninja's suffering and ninja knives. Mage transformation Ninja transformation Archer transformation The assassin transforms 4、 Customized equipment and appearance system - The game has a variety of equipment and appearance that can customize the appearance of the character. Each game gives you a different experience. The fore-and-aft swing and feel of each weapon are very different. Even similar weapons, such as sledgehammers, have a slightly different feel. 5、 Death inheritance system - The game retains the consistent tradition of Ruguelike games. After a character dies, all the information of the character will be reset. However, the inheritance system can be unlocked with the remaining gold coins after death. Such inheritance can be permanently retained, and the entire game will take effect after being archived.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2237800/header.jpg?t=1672370965",
    "Price": 2.09,
    "Developers": "just for fun",
    "Publishers": "just for fun",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2237800/ss_7dc7813d309c74c599547233d9426b523405acc3.1920x1080.jpg?t=1672370965,https://cdn.akamai.steamstatic.com/steam/apps/2237800/ss_76907510906e6a5d958ceeec7edc64dec69f21d7.1920x1080.jpg?t=1672370965,https://cdn.akamai.steamstatic.com/steam/apps/2237800/ss_9a998080640444b6fda66bbc5ef8b13cc7495ecf.1920x1080.jpg?t=1672370965,https://cdn.akamai.steamstatic.com/steam/apps/2237800/ss_c5fa66904a443fda501ff7aeab6695562cfdfc85.1920x1080.jpg?t=1672370965,https://cdn.akamai.steamstatic.com/steam/apps/2237800/ss_f97668bf11d2fc538442bcaf70b984745e1e3f17.1920x1080.jpg?t=1672370965",
    "Slug": "dragon-s-treasure",
    "Meta Title": "Dragon's Treasure: Dec 29, 2022, just for fun and Full Ov...",
    "Meta Description": "Looking for information on Dragon's Treasure? Check out the release date (Dec 29, 2022), developer insights from just for fun, and a complete game summary.",
    "Alt Text Image": "Official header image for Dragon's Treasure game - Steam 2237800",
    "Canonical URL": "https://gusku.site/game/dragon-s-treasure",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dragon's Treasure\", \"description\": \"Looking for information on Dragon's Treasure? Check out the release date (Dec 29, 2022), developer insights from just for fun, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 29, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"just for fun\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"just for fun\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2237800/header.jpg?t=1672370965\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.09, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}