{
    "AppID": 2004320,
    "Name": "Duelyst II",
    "Release date": "Dec 16, 2022",
    "About the game": "DUELYST II is a free, fair, competitive tactics game. Build your collection of beautifully animated pixel art cards and put your skills to the test on the ranked ladder. Position your units on the battlefield and destroy the enemy General to claim victory in strategic turn-based combat. Construct a deck from hundreds of unique cards - use minions, spells, and artifacts to discover new strategies and devastating combos. Choose from six powerful factions: Lyonar Kingdoms, Songhai Empire, Vetruvian Imperium, Abyssian Host, Magmar Aspects, and Vanar Kindred. The Factions Lyonar The Lyonar Kingdoms are proficient close quarter fighters who use Provoke and Zeal establish a massive presence on the battlefield. Utilize their healing prowess and you can whittle down your opponents in a war of attrition. Songhai Subterfuge is no stranger to the Songhai Empire, who steal the initiative with their displacement, ranged and backstab techniques. They're also masters of spell synergy, weaving devastating damage combos. Vetruvian The Vetruvian Imperium focuses on ephemeral Dervish summoning and specialized minions. Use a myriad of buffs and debuffs to swing the fight in your favor, and equip powerful artifacts to make your General a lethal force. Abyssian Masters of Deathwatch, the Abyssian Host know best how to profit from demise. They create deadly Shadow Creep and outnumber their opponents with an army of Wraithlings - weak alone, strong in numbers. Magmar As resilient as nature itself, the Magmar Aspects are a powerful force to reckon with. Their Grow and Rebirth abilities require foes to invest heavily into tearing down their units, lest they get torn themselves. Vanar The Vanar Kindred are an elite group of tacticians with the tools to manipulate the battlefield. Utilizing Infiltrate minions and Walls, they'll exercise swift and precise removal. With the cold as their ally, nothing runs away far. The world of Mythron awaits... - Dream Sloth Games has no affiliation with Counterplay Games. We extend our thanks to them for releasing much of the original Duelyst source code under a Creative Commons license in 2022.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2004320/header.jpg?t=1671321567",
    "Price": 0.0,
    "Developers": "Dream Sloth Games",
    "Publishers": "Dream Sloth Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2004320/ss_2c52ac860d7d32264ec926e5b973cdab00e512b2.1920x1080.jpg?t=1671321567,https://cdn.akamai.steamstatic.com/steam/apps/2004320/ss_09326485675d64899b98cd97e690bbacc55548f8.1920x1080.jpg?t=1671321567,https://cdn.akamai.steamstatic.com/steam/apps/2004320/ss_1e97bcfd00b1664ce73a4c61537d6d91e6c9c6ce.1920x1080.jpg?t=1671321567,https://cdn.akamai.steamstatic.com/steam/apps/2004320/ss_54b40c8b4a55d35a616d6fa5e410cba84d1f1099.1920x1080.jpg?t=1671321567,https://cdn.akamai.steamstatic.com/steam/apps/2004320/ss_871edc2f809239d42e9d0f43aa358121e1b39a52.1920x1080.jpg?t=1671321567,https://cdn.akamai.steamstatic.com/steam/apps/2004320/ss_a6462e7545640ac98adabd06d31720fe019145ab.1920x1080.jpg?t=1671321567",
    "Slug": "duelyst-ii",
    "Meta Title": "Duelyst II: Dec 16, 2022, Dream Sloth Games and Full Over...",
    "Meta Description": "Looking for information on Duelyst II? Check out the release date (Dec 16, 2022), developer insights from Dream Sloth Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Duelyst II game - Steam 2004320",
    "Canonical URL": "https://gusku.site/game/duelyst-ii",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Duelyst II\", \"description\": \"Looking for information on Duelyst II? Check out the release date (Dec 16, 2022), developer insights from Dream Sloth Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Dream Sloth Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Dream Sloth Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2004320/header.jpg?t=1671321567\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}