{
    "AppID": 975370,
    "Name": "Dwarf Fortress",
    "Release date": "Dec 6, 2022",
    "About the game": "Prepare for the deepest, most intricate simulation of a world that has ever been created. Not just generated geometry -- a whole simulated world. Generated rise and fall of civilizations, personalities, creatures, cultures, etc. Infinite hours of gameplay. Now with beautiful pixel graphics! Learn the basics with in-game tutorials A lifetime “living” project - created/updated since 2003, with no end in sight Generate your unique world and manage a bustling colony of dwarves, even as they probably mine towards their eventual demise. A new endless hobby, just for you! The legendary Dwarf Fortress is now on Steam! Build a fortress and try to help your dwarves survive, despite threats of starvation, dragons, and madness. In this complex construction/management/roguelike simulation, every generated world brings a unique challenge, whether it’s dwarves with their own simulated personalities or aquifers. Observe what makes your civilization fall into eventual decline, and learn for next time… until something else inevitably goes wrong. The combat model includes skills, body parts, material properties, aimed attacks, wrestling, pain, nausea, various poison effects, and much more. It’s difficult to convey the depth of the generation. Hundreds of animals and monsters, many of which are randomly created for each world, as well as generated poetry, musical forms, instruments, and dances for your dwarves to practice and perform. A dynamic weather model tracks wind, humidity, and air masses to create fronts, clouds, storms, and blizzards. Over two hundred rock and mineral types can appear, in their proper geological environments. Remember: Losing is fun! Nothing substantial is new or changed, under the hood. It’s still good old Dwarf Fortress, but with graphics support and music by default. A few bells and whistles won’t change that. You may already be familiar with the tile set mod packs from Michał “Mayday” Madej and Jacob 'Ironhand' Bowman. Together, their efforts are creating an all-new tileset featuring brand new pixel art by artists Carolyn Jong and Neoriceisgood. Dwarf Fortress Steam edition will have a 15 track soundtrack by Dabu, Simon Swerwer and Águeda Macias including tracks in the Dwarvish language! It's never been easier to start playing! We've improved the new player experience with the addition of tutorials to guide you through building your first fort and keeping your dwarves happy. Command your dwarves as they search for wealth in their generated mountain. Your dwarves will need a steady supply of food and beer, but they’ll also need your guidance in surviving attacks from hostile civilizations, the wilderness, or even the dead. Craft treasures and furnitures from various materials Establish a barony and support the increasingly demanding nobility Read your dwarves’ thoughts to keep them happy Build floodgates to divert water for farming, and/or prevent magma mishaps Build structures and watch your dwarves discover and build their culture, like taverns, libraries, temples, honey, wax, pottery, animal training, bookbinding, and more. The original inspiration for RimWorld, Prison Architect, Minecraft and more. One of the first video games acquired by the Museum of Modern Art in New York Updated for over 16 years by two brothers, Tarn “Toady One” and Zach “Threetoe” Adams With the goal of simulating all of existence, Bay 12 estimates they’re only about 44% done.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/975370/header.jpg?t=1670338868",
    "Price": 29.99,
    "Developers": "Bay 12 Games",
    "Publishers": "Kitfox Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_c40053b7751d694f2b5e364a68f58d29f35bfc81.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_4e31d98f926436e2192b790aa01895ab89cf583f.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_f6a475e5fdc3222af38a1cde8bde810ca386c12d.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_3a190a3ae9acdf041473e046c95f36894eb1d207.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_37ff0c17b7acbe21667cf239993a83da3f86e5ad.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_77e5facf7600ecbebefaa8e5b5f112bd58ece28a.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_386283c730a351292494a03948675d9c383e580e.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_d6543ced2dc3949d95318c3cd863202bde2f0f9c.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_96423bb72b8a315c70da4e6ea1c7834a0c651cfb.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_f8aa4e5f896a8ecb7abf3a8c7c4ae176ba40f3ae.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_ec5949414dfb5ca13d06032f88e49b9b059d0b7a.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_fb4ed67919a4a2d72818f0e5789d9ed35d6e1a0d.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_a2e5fc146d193d067bf58502abf875cb76e54260.1920x1080.jpg?t=1670338868,https://cdn.akamai.steamstatic.com/steam/apps/975370/ss_6ac3cbfe33f525221f60837373043fa5d0aa8b87.1920x1080.jpg?t=1670338868",
    "Slug": "dwarf-fortress",
    "Meta Title": "Dwarf Fortress: Dec 6, 2022, Bay 12 Games and Full Overview",
    "Meta Description": "Looking for information on Dwarf Fortress? Check out the release date (Dec 6, 2022), developer insights from Bay 12 Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Dwarf Fortress game - Steam 975370",
    "Canonical URL": "https://gusku.site/game/dwarf-fortress",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Dwarf Fortress\", \"description\": \"Looking for information on Dwarf Fortress? Check out the release date (Dec 6, 2022), developer insights from Bay 12 Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 6, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Bay 12 Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kitfox Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/975370/header.jpg?t=1670338868\", \"offers\": {\"@type\": \"Offer\", \"price\": 29.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}