{
    "AppID": 2060080,
    "Name": "Fap Goddess",
    "Release date": "Dec 15, 2022",
    "About the game": "MATURE CONTENT DESCRIPTION The content present in Fap Goddess contains explicit depictions of sexual acts and nudity, as well as strong language, and is intended for adults only. All characters depicted in-game are of age. Your isekai adventure starts after an extremely coincidental, not at all weird car accident. You wake up in another universe only to discover it’s being guarded by goddesses of desire. Now, these girls don’t have it easy, which is why they need you - the chosen one - as their Guardian. These lusty goddesses await your order and - conveniently enough - they crave your seed to give them power. So why do these powerful beings actually need your help? Well, long ago, the Sun and Moon goddesses coexisted peacefully, and together they guarded the lives of mortals. Taiyun, the Sun Goddess, warmed and nourished all life, winning the respect and love of mortals. The Moon Goddess Yue, who was envious of her sister, called forth terrifying Moon Devils to start a carnage. Mortals lived in fear during those dark days, with no hope in sight. Taiyun led mankind against demons in retribution. Sun and Moon collided in the Yin-Yang Ocean, creating the Swirl Abyss. Both sides lost. With her dying breath, Taiyun instructed humans to build a lighthouse tower and imprisoned the Moon Devils in the Swirl Abyss. Guardians were tasked with protecting humankind and defending the tower. This is where you come in, almighty Guardian! You’re already lost in an unknown world, surrounded by mystical anime beauties - might as well make the most out of it. As a freshly kidnapped-from-another-world Guardian, you are responsible for protecting humankind from other goddesses corrupted by evil. Assemble a team of three girls, fight against the fallen goddesses and purify their souls and bodies. Only then will you be able to train them and have them join your cause. Level them up, unlock their passive and active skills, and equip them with powerful gear as you power up your team of mighty mistresses! These lusty goddesses will reward you for your efforts with love, affection, and what is most likely the hottest naughty action this side of the multiverse. You can also have one-on-one chats with the goddesses, and depending on how you reply, you might get some hot, uncensored, and delightfully lewd artwork. Choose carefully, you know what they say: hell hath no fury like a waifu scorned! Don't forget to participate in events to receive exclusive rewards and unique animated H-scenes! Enjoyable Gameplay Fap Goddess is a squad-based side-scrolling RPG with match-3 block skill controls that's easy to learn and just the right amount of challenging to master! Smooth Upgrade System Train and level up the goddesses you tame to increase their strength. Collect materials and gear up your favorite gals for a leg up in battle. Fun and Rewarding Chat System Collect Light Energy during battle stages and return it to the sacred lighthouse to unlock the girls’ potential. Chat and entertain 20+ goddesses and discover their filthiest kinks as you seduce them. Gorgeous Interactive Animations Entice the goddesses to strip for you when you increase their affection level and they'll reward you with unique scenes! Make those mischievous goddesses happy by teasing them! Over 150 Stunning Illustrations and Scenes Each scene is complemented by a kinky tale that will only make you adore the girls even more. Unlock extra-special side stories for each of your girls and find out all there is to know about them!",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2060080/header.jpg?t=1671098719",
    "Price": 0.0,
    "Developers": "Funfia",
    "Publishers": "Nutaku Publishing",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_89ca906bb2917da468b52e60e576ce9e17874ea6.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_57a6a309b95a4f93eaa4839e6fcebbfbaa7baeff.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_fdac9073bfe075972fb06d53fa61571820f78fa5.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_19e899992a5ecbc7c79f3e6377a0a649ee4af582.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_b4b22e952f4e4f4cb98aa8d6ee726ff31f8544b3.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_18a6f4bca609fafa73328c1408c2c32ff67bfd73.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_b5647cbb455488e4e23f7b605b8d329618c34f9d.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_9dc626593f9d7bade8d90ccc352bd11c184d07cd.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_3db444e42716fb254dd05597e700d53e3e9e0c75.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_1151f1e6cfb7f14f036571cca2c9df087c93ed25.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_ec6f4669c45e095fa1e042a39b14082f3522646e.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_7e4608fea961e1e61f3d52aacb3ab7decbbb44e5.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_d4b700e842f77f9a5e15928c6bdb6854b968134f.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_c3aca5c257861b5b3c18de8ad770a0226e585184.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_9a62594779feec64007fa0fdffc2b603639cd2f5.1920x1080.jpg?t=1671098719,https://cdn.akamai.steamstatic.com/steam/apps/2060080/ss_05dae9f2d23412ee45c063a1e75f231fd36ac294.1920x1080.jpg?t=1671098719",
    "Slug": "fap-goddess",
    "Meta Title": "Fap Goddess: Dec 15, 2022, Funfia and Full Overview",
    "Meta Description": "Looking for information on Fap Goddess? Check out the release date (Dec 15, 2022), developer insights from Funfia, and a complete game summary.",
    "Alt Text Image": "Official header image for Fap Goddess game - Steam 2060080",
    "Canonical URL": "https://gusku.site/game/fap-goddess",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Fap Goddess\", \"description\": \"Looking for information on Fap Goddess? Check out the release date (Dec 15, 2022), developer insights from Funfia, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Funfia\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Nutaku Publishing\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2060080/header.jpg?t=1671098719\", \"offers\": {\"@type\": \"Offer\", \"price\": 0.0, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}