{
    "AppID": 2241400,
    "Name": "fumo",
    "Release date": "Dec 30, 2022",
    "About the game": "There are no immortals in this world, but since ancient times, human beings have seen the world around them, and all kinds of strange things, such as lightning, thunder, storms, natural disasters and man-made disasters, and countless casualties. The vast expanses of sorrow and sorrow can never be overcome by human beings. So he thought that there were all kinds of gods above the nine heavens, and that under the nine ghosts, there was also the place where the ghosts returned, the Hall of Hell. Therefore, the theory of immortals was handed down in the world. Countless people of mankind sincerely worship and worship various gods created by their imagination, praying for good and complaining, and the incense fire is flourishing In today's world, the right path is Dachang, and evil spirits retreat. The Central Plains is a land of beautiful mountains and waters, full of popularity and rich resources, which is firmly occupied by decent schools. This story begins with 'you'. In the game, you will play the role of the disciple of Sanqing Palace, follow the teacher's order to go to the Demon Subduing Cave to fight the Sword Protecting God and retrieve the Demon Subduing Sword. On the way down the mountain to kill the demon, I made friends in Forget Worry Village and killed the snake demon with my friends. Later, he ran into a mysterious woman in Jianye City. The three of them walked in the Jianghu together. During the process of killing demons, they gradually found a big secret. How will you choose? Can they finally save the world? The Jianghu of Demon Subduing Record will be continued by you. Game features: Classic RPG games experience round combat mode to experience rich plots. Game features: 1. There are many wonderful fighting and playing modes. You can open your own adventure to complete different competitions. The playing experience is very good. 3. In different story links, you can enjoy a variety of different fighting adventures, and your ultimate goal is to explore the ultimate secret! Game highlights: 1. Take you into the anime world, cultivate your role at any time, master stronger skills, and fight with different enemies brilliantly. 2. Get to know more friends and recruit them, fight side by side with you, defeat many opponents, and unknown dangers will come. 3. Brave exploration can bring out endless power. You can join in the passionate fight and grow up freely in the mysterious world.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2241400/header.jpg?t=1672411757",
    "Price": 119.99,
    "Developers": "fumo",
    "Publishers": "fumo",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2241400/ss_f96ed18e83b169e2b309647f4f39d4058a235709.1920x1080.jpg?t=1672411757,https://cdn.akamai.steamstatic.com/steam/apps/2241400/ss_29d9b2b6621c2cdb2d8efee1dd35aecbfa4afb6a.1920x1080.jpg?t=1672411757,https://cdn.akamai.steamstatic.com/steam/apps/2241400/ss_84b58671298080c27bc861e8c261240bfff56794.1920x1080.jpg?t=1672411757,https://cdn.akamai.steamstatic.com/steam/apps/2241400/ss_63ab3b4221348c32542baa4b3b7a27bfbd674b8e.1920x1080.jpg?t=1672411757,https://cdn.akamai.steamstatic.com/steam/apps/2241400/ss_b1c4e1763c50b6c750723231fd0c1f79c11c396f.1920x1080.jpg?t=1672411757",
    "Slug": "fumo",
    "Meta Title": "fumo: Dec 30, 2022, fumo and Full Overview",
    "Meta Description": "Looking for information on fumo? Check out the release date (Dec 30, 2022), developer insights from fumo, and a complete game summary.",
    "Alt Text Image": "Official header image for fumo game - Steam 2241400",
    "Canonical URL": "https://gusku.site/game/fumo",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"fumo\", \"description\": \"Looking for information on fumo? Check out the release date (Dec 30, 2022), developer insights from fumo, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 30, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"fumo\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"fumo\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2241400/header.jpg?t=1672411757\", \"offers\": {\"@type\": \"Offer\", \"price\": 119.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}