{
    "AppID": 1347950,
    "Name": "Goblin Hunter Wizard Emona",
    "Release date": "Dec 8, 2022",
    "About the game": "======================================================================= Strategy tips Follower jumps high following Emona's double jumps, so using double jumps will make it easier to control him. Chain magic can destroy nets and spike traps. ======================================================================= No mosaic patch / The first work of the 'Wizard Emona' series with plenty of pixel animations All event scenes are dot animation! Wizard Emona, who is the control character, recovers her magical power by drinking the man's semen. Only Emona can be controlled in action scenes, and the man in charge of luggage cannot be controlled and only follows Emona. Good guidance! When Emona is killed by a goblin, there is an H scene where Emona is defeated. There is a difference in the defeat scene for each of Emona's magic weapons. Completely different events depending on the weapon!? There is a double jump unique to action! After helping a girl with an attribute, after thanking her with her baggage handler, Emona who drank her semen learns her new magic. As the stage progresses, the prop shop woman gets more intense with the luggage man and the handjob event scene. First in the industry!? By turning on the 'hide parts' setting, a mysterious light appears in the risqué parts and can be distributed on YouTube, etc.!? Story Midara, a town near the goblin habitat. Many girls in town have been kidnapped by goblins. Mayor Osirisuki surrounded the city with ramparts, and his daughter Emona was also a goblin-slaying wizard. The townspeople highly praised her anti-goblin policy and her support rate was high. Wizards in this world use semen to restore their magical powers, so they need followers to go on adventures. Meanwhile, with her new squire, Emona travels deep into Goblin Habitat to find her mother and save her town girls... Operation method It supports both keyboard and gamepad. Press the 'F1' key to display the operation method screen. There are three options: 'keyboard only', 'gamepad only', and 'mouse and keyboard'. About attribute spheres and chain magic In the action scene, when you defeat an enemy with magic, a circle called 'attribute sphere' will appear. When two attribute spheres overlap, 'chain magic' will occur, and powerful magic will occur. Defeating an enemy with this chain magic triples the drop rate of coins and items. All event scenes are dot animation! Events work in every scene! Furthermore, on the memory CG screen (title → memory) Animation speed can also be changed in 10% intervals! If you turn on the 'hide parts' setting in the settings, a mysterious light will appear in your parts, making it possible to stream live broadcasts on YouTube without worry!? Magic power recovers by drinking semen! Wizard Emona consumes MP each time she shoots her magic, Recover MP by taking in his semen by near her baggageman Detao pulling her cart. The defeat scene is also animated! If either Emona, who is the operating character, or Detao, who follows, is defeated, it will be an H scene. Emona's defeat scene depends on the weapon she has equipped. There are differences in staff weapons There is a difference in the orb system There are other independent H scenes with special weapons. As the stage progresses, the squeezing volunteer scene changes It seems that Hoon Etty, a tool shop clerk, wants magical semen as an item material. As the stage progresses, it becomes more and more excessive...",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1347950/header.jpg?t=1670831466",
    "Price": 9.59,
    "Developers": "EZOGORO",
    "Publishers": "EZOGORO",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_401e6d71bb1cd01bb550fd8877788d473669b802.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_1afa1bb948a706a6298ee808b88fcb401341e1b9.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_5e307a60f3d271567f4cb11bc10c50394e1f7710.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_1ea2f3d86efd8d53fa3c81bd95e19f1dfdc780f6.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_301bf18163456dd0e290e40e490a31721b178bd7.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_b715ebf0da1535cc6322693342a00a8118ff0de5.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_4d4706d24c3cbeba2541b69ea9e52226c29798e2.1920x1080.jpg?t=1670831466,https://cdn.akamai.steamstatic.com/steam/apps/1347950/ss_b5ea227b37b057c31233823746f5a11acc098b43.1920x1080.jpg?t=1670831466",
    "Slug": "goblin-hunter-wizard-emona",
    "Meta Title": "Goblin Hunter Wizard Emona: Dec 8, 2022, EZOGORO and Full...",
    "Meta Description": "Looking for information on Goblin Hunter Wizard Emona? Check out the release date (Dec 8, 2022), developer insights from EZOGORO, and a complete game su...",
    "Alt Text Image": "Official header image for Goblin Hunter Wizard Emona game - Steam 1347950",
    "Canonical URL": "https://gusku.site/game/goblin-hunter-wizard-emona",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Goblin Hunter Wizard Emona\", \"description\": \"Looking for information on Goblin Hunter Wizard Emona? Check out the release date (Dec 8, 2022), developer insights from EZOGORO, and a complete game su...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 8, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"EZOGORO\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"EZOGORO\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1347950/header.jpg?t=1670831466\", \"offers\": {\"@type\": \"Offer\", \"price\": 9.59, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}