{
    "AppID": 2199130,
    "Name": "GourdsTown",
    "Release date": "Dec 16, 2022",
    "About the game": "a gourd is wandering alone and lost in a strange wilderness, confused, tired and drained it succumbs to its dark surroundings, it wakes up to find itself in a peculiar and unique town in the middle of nowhere. It gets to know the inhabitants, their stories, their secrets and their way of life. GourdsTown is a third-person adventure-crafting game that focuses on the story of four unique gourds and how they got into living in the middle of nowhere, how they survive in their sombre predicament, surrounded by sunless wilderness. ------- Crafting ------- Materials that you have collected can be crafted into some cooking recipes and these in turn will be important for requests by town-gourds and at times for the survival of this town. While some recipes will be given to you by your fellow town-gourds, others will require some experimentation, be sure to get creative with the communal oven and mortar, do not worry even failed recipes have a use in this odd world ----------------------- -------- Light -------- in this game you will need to venture outside of this tiny town into the dark wilderness in order to secure materials that grow wild, but be careful as you venture farther and longer from town your light levels diminish and you might pass out causing you to lose stuff you have collected, be wise with the time you spend outside. ---------------------- -------- Story -------- How did you get here? why is there a town in the middle of nowhere? and so many other questions will be answered when you participate in the different acts of the game that will entail the stories of the town-gourds and if you’ll be sure to pay close attention to little details, you might get a lead to something more, learning about this dark and fantastical world and its ways. ----------------------- An Original Story featuring all original hand-painted artworks. You will help your tiny town in day-to-day activities from simple forging to crafting and if you will lend an ear and a hand to your fellow town-gourds, you will surely learn much about their ways and uncover some mysteries of this odd and wild world. how will you fare? in this adventure into the odd world of GourdsTown",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2199130/header.jpg?t=1671182991",
    "Price": 4.99,
    "Developers": "SunlitNap",
    "Publishers": "SunlitNap",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2199130/ss_a505724088cbec98e2db99cc5ae107f7271a7631.1920x1080.jpg?t=1671182991,https://cdn.akamai.steamstatic.com/steam/apps/2199130/ss_e538e539874f069c6e9f44fa57464f7c6fa7400c.1920x1080.jpg?t=1671182991,https://cdn.akamai.steamstatic.com/steam/apps/2199130/ss_95ab5135a98edb231b4ea55cc118d8548be0addc.1920x1080.jpg?t=1671182991,https://cdn.akamai.steamstatic.com/steam/apps/2199130/ss_0a6fbcc5cb6444504f6c5719f731869ba9f3b184.1920x1080.jpg?t=1671182991,https://cdn.akamai.steamstatic.com/steam/apps/2199130/ss_fe8ca0925e525ad59ca4a5cf1869cef08bf1c072.1920x1080.jpg?t=1671182991",
    "Slug": "gourdstown",
    "Meta Title": "GourdsTown: Dec 16, 2022, SunlitNap and Full Overview",
    "Meta Description": "Looking for information on GourdsTown? Check out the release date (Dec 16, 2022), developer insights from SunlitNap, and a complete game summary.",
    "Alt Text Image": "Official header image for GourdsTown game - Steam 2199130",
    "Canonical URL": "https://gusku.site/game/gourdstown",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"GourdsTown\", \"description\": \"Looking for information on GourdsTown? Check out the release date (Dec 16, 2022), developer insights from SunlitNap, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 16, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"SunlitNap\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"SunlitNap\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2199130/header.jpg?t=1671182991\", \"offers\": {\"@type\": \"Offer\", \"price\": 4.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}