{
    "AppID": 2176340,
    "Name": "Haramase!semen transport project",
    "Release date": "Dec 15, 2022",
    "About the game": "Dedicated to those who like fertilization depictions and pregnant belly This game has been trialed in advance and had major bugs fixed, with cooperation from everyone. However, just in case, if you have encountered problems before in previous works, please download and check if the trial version works. We do not recommend this game for those who do not like the following In this work, the Robo C-Va who executes the impregnations, uses coarse and violent languages towards the girls. tsk...You're just a seeding bed Birthing machine, hurry up and get pregnant! After all, this female is only allowed to give birth to ○○'s children from now on. C-Va only sees women as tools and only thinks about how to counteract the declining birthrate (As is faithful to her mission) If you don't like this kind of thing, please do not purchase this game. The previous games featured Good Ends. But not in this work. The purpose is to simply fulfil your desires and impregnate people. Other than making children, you will hardly do anything else, except from a blowjob scene. There are pregnancies in 4 different situations. We have prepared a total of 3 characters (2 of which are famous 2D characters) + 11 wall butt characters. We have also prepared a situation where multiple eggs can be fertilised at once, for 3 of the characters. I hope you will enjoy the different pregnancies, compared to previous works. In the wall butt scene, there is also a dangerous day system. During those times, it is possible to pick those girls and try and get them pregnant. It is possible to know if it is currently a dangerous day, to some extent. Of course, the popular cross sections, the cross section of the uterus and the cross section of the vagina are also implemented. There are of course animations too! And they move delightfully. The world of 「Haramase! Semen Transport Project」 AD 20XX of the 2D Calendar. The lack of depictions of sexual intercourse, which is hardly ever seen in 2D works in general, has finally led to the problem of declining birth rates. So the 2D governments set up a project. Its name is...「Semen Transport Project」. If 2D men can't do it, then why not give it all to 3D men who can't get enough of it? The 2D governments used their scientific expertise to build a machine that can transfer semen from 3D to 2D. To manage this process, they have created an AI robot called C-VA, or Shiva. By following Shiva's instructions, you can ejaculate or transfer semen straight from the insides of your testicles to the chosen 2D girl to impregnate them. You will be asked to participate in such a simple project. In the two-dimensional space, the monitor tells you the status of semen, the presence of eggs, and the probability of pregnancy. Your semen is pumped directly into the uterus through a catheter, and you can watch the process through the monitor. Please save the 2D declining birthrates with your sexual desire. Things you can do in this game In this work, you can use the points you get from Shiva when successfully impregnating girls to do thing such as building a 3D underground facility or to forcibly make it a dangerous day for the girls. You can also buy new girls to send to the completed underground facilities as impregnation partners starting from that day. You will be able to purchase fertility drugs. In addition, one hidden character will appear by achieving the hidden conditions. Mode to look at the pregnant girl and her belly. You can look at the girls you inseminated in the list. (With enlargement function and dialogue) Ending after certain conditions are achieved You can unlock hidden elements of the the pregnant belly list scene by achieving certain conditions. We also made a wall butt scene for you to make many girls pregnant at once. The probability greatly varies depending on the presence or the absence of the ovulation day, so we made it possible to inject an ovulation inducer in the scene. Also, by using the fertility drug in this scene, a slightly different play will be implemented.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2176340/header.jpg?t=1671135730",
    "Price": 10.39,
    "Developers": "Kumao",
    "Publishers": "Kumao",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_dfbc4de06f55aa56635550037ad3fed12a4082ae.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_50d06ea6eb8b76c05b120311e4aff6e481e0bf25.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_b8b245f2f469bcd5474830eb4b591e788837e4b7.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_230d9232453f46f8dc4e884251cbc119eea4c311.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_3181861f46ff99ffce80ced043ef0f8aa925d5a8.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_73876e84a3b2ab09003aeb45375773bb3702f4fb.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_be348e98fc51f2a4a99850aee50413ecb2ac5541.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_d6b73229c66fac0160d8e0437cbd51d48b4c891f.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_18ba3eba6e76f863a192e260e6579a4192ac5f92.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_b55e1f112b458dbe9de2878eb2b18eae2e956e27.1920x1080.jpg?t=1671135730,https://cdn.akamai.steamstatic.com/steam/apps/2176340/ss_58d84bc571e53a33622baff422b347425ab55b3b.1920x1080.jpg?t=1671135730",
    "Slug": "haramase-semen-transport-project",
    "Meta Title": "Haramase!semen transport project: Dec 15, 2022, Kumao and...",
    "Meta Description": "Looking for information on Haramase!semen transport project? Check out the release date (Dec 15, 2022), developer insights from Kumao, and a complete ga...",
    "Alt Text Image": "Official header image for Haramase!semen transport project game - Steam 2176340",
    "Canonical URL": "https://gusku.site/game/haramase-semen-transport-project",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Haramase!semen transport project\", \"description\": \"Looking for information on Haramase!semen transport project? Check out the release date (Dec 15, 2022), developer insights from Kumao, and a complete ga...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 15, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Kumao\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Kumao\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2176340/header.jpg?t=1671135730\", \"offers\": {\"@type\": \"Offer\", \"price\": 10.39, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}