{
    "AppID": 1583230,
    "Name": "High On Life",
    "Release date": "Dec 13, 2022",
    "About the game": "SUMMARY From the Co-Creator of Rick &amp; Morty and Solar Opposites, comes High On Life . Fresh out of high school with no job and no ambition, you’ve really got nothing going for you until an alien cartel that wants to get high off humanity invades Earth. Now, you and a team of charismatic talking guns must answer the hero's call and become the deadliest intergalactic bounty hunter the cosmos has ever seen. Travel to a variety of biomes and locations across the cosmos, go up against the nefarious Garmantuous and his gang of goons, collect loot, meet unique characters, and more, in the latest comedy adventure from Justin Roiland! FEATURES Rescue and team up with charismatic, talking guns to become the deadliest intergalactic bounty hunter the cosmos has ever seen. Navigate dynamic and changing worlds that range from a jungle paradise, to a city built inside an asteroid, the hub of the cosmos. Leverage the unique skills of each gun to go up against a variety of criminals as you track down the nefarious Garmantuous and his gang of alien goons. Complete hunter challenges, meet weird, fun and hilarious characters, collect an array of alien technology, and more! FAQ Is this a VR game? Although many of Squanch’s previous titles were firmly rooted in VR, High On Life was built from the ground up for traditional flatscreen devices. Is this Rick and Morty / related to Rick and Morty? Because Justin Roiland is also the co-creator of Rick and Morty, our games naturally share a similar style / universe, but they are not officially related. What type of game is this? Single player? Multiplayer? High On Life is single player only. There is no multiplayer. Can my kids play? Can families play together? As this is a mature-rated title, we do not recommend it for children. What languages will High On Life be available in? The game will be localized (text-only) in English, French, Italian, German, and Spanish. Who is Squanch Games? Founded in 2016, Squanch Games develops comedic games for multiple platforms and devices. Led by Justin Roiland, Co-Creator of Adult Swim’s Rick &amp; Morty and Hulu’s Solar Opposites, the studio’s mission is to create immersive content that people can lose themselves in for hours at a time, as well as shorter experiences that can be enjoyed with friends. Their latest title, Trover Saves the Universe, is currently available on PlayStation 4, Xbox One, Nintendo Switch, and PC, alongside other digital and VR titles such as Dr. Splorchy Presents: Space Heroes , Accounting and Accounting+ . How involved is Justin Roiland? Justin has been (and continues to be) heavily involved in the development of High On Life . From creating the original concept, to taking part in design and development - this game is his (new) baby. Do you have any other games? Other games launched by Squanch include Trover Saves the Universe , Dr. Splorchy Presents: Space Heroes , Accounting and Accounting+ . Will there be DLC? We would love to continue to create new content for this game, but can not confirm anything at this time.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1583230/header.jpg?t=1671088821",
    "Price": 59.99,
    "Developers": "Squanch Games, Inc.",
    "Publishers": "Squanch Games, Inc.",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1583230/ss_669dcc1c0928edf635e9f451c6a7eca7c044df15.1920x1080.jpg?t=1671088821,https://cdn.akamai.steamstatic.com/steam/apps/1583230/ss_094fc7d30b4b85c5da298c749830367855269477.1920x1080.jpg?t=1671088821,https://cdn.akamai.steamstatic.com/steam/apps/1583230/ss_d26e141c2588f12ba2631c7271729ed30eef3573.1920x1080.jpg?t=1671088821,https://cdn.akamai.steamstatic.com/steam/apps/1583230/ss_868c482764b691cfdeb9cd5409ee865b39d7c601.1920x1080.jpg?t=1671088821,https://cdn.akamai.steamstatic.com/steam/apps/1583230/ss_b8de52ebe2834ac290c60ae0ed1e723c4d4dd6e0.1920x1080.jpg?t=1671088821",
    "Slug": "high-on-life",
    "Meta Title": "High On Life: Dec 13, 2022, Squanch Games, Inc. and Full ...",
    "Meta Description": "Looking for information on High On Life? Check out the release date (Dec 13, 2022), developer insights from Squanch Games, Inc., and a complete game sum...",
    "Alt Text Image": "Official header image for High On Life game - Steam 1583230",
    "Canonical URL": "https://gusku.site/game/high-on-life",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"High On Life\", \"description\": \"Looking for information on High On Life? Check out the release date (Dec 13, 2022), developer insights from Squanch Games, Inc., and a complete game sum...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 13, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Squanch Games, Inc.\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Squanch Games, Inc.\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1583230/header.jpg?t=1671088821\", \"offers\": {\"@type\": \"Offer\", \"price\": 59.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}