{
    "AppID": 1663250,
    "Name": "Hyper Gunsport",
    "Release date": "Dec 22, 2022",
    "About the game": "Hyper Gunsport is all about arcade action! Precision shooting and tight jumps! Clutch saves and epic slams! But the ONLY thing you can shoot is the ball! At its core, Hyper Gunsport is a cooperatively competitive action game where the object is to shoot the ball into goals of varying difficulty, while the opposing team tries to do the same. Each time the ball crosses the net its point value goes up, so longer volleys mean bigger points and higher stakes. A team is composed of two positions, a keeper and a striker. The keeper doesn't move, but can fire more frequently, and has a wider aiming range and shot radius - they're often used as defense. The striker can move and jump, but can take fewer shots, so they must be precise and must make them count. Will you burn shots and get aggressive, or set up an iron defense instead? The game encourages teamwork and competition by equal measures. Each team also has its own special weapons which unlock with proficient play. These weapons require players to think on their feet and change the shape of the game. Tricky bounces, shots that detonate, different strategies abound. Each arena is unique as well, with its own gimmicks, from goals that open and close or change point values, to moving nets, to unstable footing. If you've played games like Windjammers , Sportsfriends , IDARB , or Towerfall , you'll be in familiar territory. Ultimately, Hyper Gunsport rewards precision shooting for the hardcore minded, but is also friendly to new players who just want to have a good time. The depth is there if you want it! People's Republic of Oakland This team is new to the game and has a lot to prove. Special attacks include a short range spherical blast that hangs in the air, and a shot that can bounce once before impact. Neo Tokyo A venerable team with custom-made weapons. Their special attacks include a chargeable buster shot and an extended shotgun blast. New Republic of Congo Lords of the court. Special attacks include a custom yo-yo that hits the ball coming and going, and an assault rifle. United Worker's Socialist Democracy Super cybernetically enhanced team from the eastern bloc. Specials include a long laser for angled shots, and cannon fire that keeps pushing on impact. Blue Cambodia The oldest team on the pitch, who use no cybernetics. Their specials include a double arced arrow shot and an independent detonation mortar. Scrapyard Squad They sneaked in here on faked credentials with questionable weapons. Specials include a laser bat attack and a chain that extends the length of the field. Practicebots Alliance Recently gained sentience. Can use the specials of any other team, but at random! You never know what you'll get. There is no more war. There are no more gods. There is only the game. Hyper Gunsport is set in a future where humans have grown tired of conflict, and all weaponry is banned. Disputes between countries are now settled with The World's Game: Gunsport. Guns are now only used for one thing, and that's to shoot a ball into a goal. Guns that can do harm no longer exist. Neon lights and repurposed technology populate this world, filling it with a restless analog hum. Each country participating in the tourney brings different motivations for doing so. Some want to build a base on the moon, some want new trade routes, others want to establish primacy. Inter-team dramas occasionally bubble to a head but the game at least deserves their respect. For the passion and the fame - it's two guns against the world! - Circuit mode : an 8-round tournament against teams from around the globe, with a short story for each of the 7 teams. Playable in local co-op or single player with an AI partner. - Versus mode : 4 player 2v2 or 1v1 local competitive play. - AI tournament : let the AI battle itself, wind it up and watch it go. - 7 arenas with unique gimmicks and rulesets that change how the game is played (Note: Hyper Gunsport is the sequel to the original Gunsport in the sense that Super Street Fighter II Turbo is the sequel to Street Fighter II.)",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/1663250/header.jpg?t=1671728686",
    "Price": 24.99,
    "Developers": "Necrosoft Games",
    "Publishers": "Necrosoft Games",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_05b8fe0eebec34093ef2b736166fd163860b1f29.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_ff55156e952b5af56203863bee39be4d720d3b12.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_8a559f837a8a088893e3ad2d4088314188dcd97b.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_02322291c5ea84b928a85903331f02eaacc9eb8e.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_272b326bea08fb3829cc3746138ce878f861705b.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_d9940130431beb1e485a7f6277d464501195f8e1.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_7e71a7d425951aa715e59a9fc3eb6f408e304577.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_be701f97d9a13ce1f84d9fdeaf07083cebae52e6.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_5160015d26db49310c64e0910070b856f4ab8e23.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_65c92740af845cb2a314d575763af3d36a0b7f0c.1920x1080.jpg?t=1671728686,https://cdn.akamai.steamstatic.com/steam/apps/1663250/ss_0f5d143726f2770970b8cb088552790ceae4ef8b.1920x1080.jpg?t=1671728686",
    "Slug": "hyper-gunsport",
    "Meta Title": "Hyper Gunsport: Dec 22, 2022, Necrosoft Games and Full Ov...",
    "Meta Description": "Looking for information on Hyper Gunsport? Check out the release date (Dec 22, 2022), developer insights from Necrosoft Games, and a complete game summary.",
    "Alt Text Image": "Official header image for Hyper Gunsport game - Steam 1663250",
    "Canonical URL": "https://gusku.site/game/hyper-gunsport",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"Hyper Gunsport\", \"description\": \"Looking for information on Hyper Gunsport? Check out the release date (Dec 22, 2022), developer insights from Necrosoft Games, and a complete game summary.\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 22, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Necrosoft Games\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Necrosoft Games\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/1663250/header.jpg?t=1671728686\", \"offers\": {\"@type\": \"Offer\", \"price\": 24.99, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}