{
    "AppID": 2171350,
    "Name": "骑士与工匠 Knights and Craftsmen",
    "Release date": "Dec 11, 2022",
    "About the game": "You are the actor of the story, playing a lord, leading a group of loyal knights to expand your territory in the chaotic kingdom. By occupying resources, producing goods, attracting immigrants, expanding the territory's facilities and expanding the scale of the city-state. The lord can also obtain funds through the trade between the city-state, and gain prestige by completing the task. Through the ocean port, he can open up overseas colonies to obtain more territory and resources. Finally, a great and powerful city-state will be established. You can also be the creator of a story. Based on resources, you can redesign all products, equipment, mission props and match the corresponding workshops to form a new production system. You can also redesign the trading needs of each city and build a new trading system. You can also flexibly use five task modes (item exchange mode, clue continuation mode, battle mode, riddle and password mode, and place opening mode) and add dialogue of characters to the task to supplement the story, so as to build your own main story and branch story. Various indicators, soldier models, attack methods, promotion paths and factions of soldiers in the game can also be edited, which makes it easy to combine unique combat units. Finally, the stories you edit can be easily shared with everyone. Main features Perfect MOD editing and sharing function - through the concise editing panel, players can modify every link, item, production, building, city, mission location, transaction, mission, faction and even army and soldiers of the kingdom. So that every player can easily build their own kingdom and story. You can also export the packaged MOD file to other players to share your story by simply copying it. Five scenes -- The kingdom has five regions, each of which has different areas and environments, and different regions will produce different raw materials. Competing for limited resources with the forces in each region will be the key to decide whether the city-state is rich or not. Powerful production system -- The game has more than 10 kinds of raw materials at the beginning, and 9 kinds of production workshops. On this basis, a complex production system has been established. More than 60 kinds of goods required by residents and city-state greatly enrich the interest and complexity of trade behavior. At the same time, the editable function also reserves a huge space for players to play. R&amp;D and investment -- 64 kinds of R&amp;D and investment are responsible for managing the production of production products, optimizing urban facilities and improving the ability of knight. Upgrading of cities and buildings -- With the growth of population size and lords' influence, the city level will be improved. The city level will determine the number of knights that can serve, the number of territories that can be controlled, and the level of items that can be opened. The higher the level of the city, the more abundant the goods. The production buildings are divided into five levels. Upgrading the buildings will greatly improve the production capacity. Factions and soldiers - There are 42 types of soldiers in the game, belonging to 7 factions. There are four levels of soldiers. In the training field of the same faction, soldiers can be promoted, so as to gain more powerful abilities. Each soldier can have two promotion directions when upgrading. Trade and goods exchange - Each area of the kingdom has 5~10 places or cities. As the city size grows over time, the larger the city, the more commodity output and the more commodity purchasing power it will have. However, with the growth of urban scale, cities will also expand their territory and occupy more land. The stronghold can exchange important props. Characters and equipment -- Knights can obtain skill points by working and commanding battles, or they can strengthen their abilities by using the city's training facilities. Lords can obtain equipment blueprints through missions to forge equipment, or they can obtain fallen equipment by defeating hostile forces. The knight can gain a lot of ability improvement with excellent equipment. Soldier Proficiency and Faction Proficiency - Soldier Proficiency and Faction Proficiency can improve soldiers' combat capability. The knight has the ability of Faction Proficiency by default for the soldiers of the same faction. The knight can also obtain the Soldier Proficiency by learning from the experience. The two proficiencys can be stacked. In this way, soldiers will gain the strongest ability bonus. Combat skill - Each knight can master a skill to assist in fighting, and use the skill value accumulated when attacking or being injured on the battlefield to release it. Reasonable skill combination can help the army win the battle more easily. Overseas colonization and trade -- There are ocean ports in the royal city area of the kingdom where ocean exploration can be carried out. Through exploration, we can find islands with rich products and profitable commercial routes. The reclamation and colonization of the islands will further expand the size of the population and the source of raw materials. 'The rise of the kingdom of knights and craftsmen' is a story directed by our team on the stage of the 'Golden Empire', 'The lord seeks blood gems, saves and revives the kingdom'. We also hope that more players can write better stories to share with us on this stage. The 'Golden Empire' is our stage.",
    "Header image": "https://cdn.akamai.steamstatic.com/steam/apps/2171350/header.jpg?t=1670810022",
    "Price": 2.69,
    "Developers": "Shining Team",
    "Publishers": "Shining Team",
    "Screenshots": "https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_b2adf1324024be3af3d398b878fbe33aac21d39a.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_9f88327f849e37097ec49b4be1aa758dfa06f1bc.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_a9b29cc6187111dd06425732a5e65dc070b97819.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_ef9ef5d9589f7bd33ca2771536db9f2476e9611a.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_26a0a350450f1b779202e85b0586fa3fd951fef7.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_1a0cef54764f1849772308645753e16070658711.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_0d5d2cd2f2da4b5d37e3c9ccab1c7dbb5b0e816b.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_bb85e5eae82edc3fd2275e84ab16e028f87f1f34.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_106644723c6be5147c9608e6e4ec5a4df244e50a.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_632885df98fbd9ecf8697ddd54cfca79e7b8d834.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_01735c2a5e5a9a034492049346773d396fa15d0f.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_e9c6ddbd6c54538f641df3485044dd7b8ca54ae5.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_086bf533535ed75e5b6d4049f89b427aba81893f.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_8e64457e9937341eebe56f287772cb0b38f78278.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_a3c7a004f21c51457901bbb96f968bd461928740.1920x1080.jpg?t=1670810022,https://cdn.akamai.steamstatic.com/steam/apps/2171350/ss_706d239e6ed61d25d2c96ee1b58c38a5378afcf6.1920x1080.jpg?t=1670810022",
    "Slug": "knights-and-craftsmen",
    "Meta Title": "骑士与工匠 Knights and Craftsmen: Dec 11, 2022, Shining Team a...",
    "Meta Description": "Looking for information on 骑士与工匠 Knights and Craftsmen? Check out the release date (Dec 11, 2022), developer insights from Shining Team, and a complete ...",
    "Alt Text Image": "Official header image for 骑士与工匠 Knights and Craftsmen game - Steam 2171350",
    "Canonical URL": "https://gusku.site/game/knights-and-craftsmen",
    "Schema JSON-LD": "{\"@context\": \"https://schema.org\", \"@type\": \"VideoGame\", \"name\": \"\\u9a91\\u58eb\\u4e0e\\u5de5\\u5320 Knights and Craftsmen\", \"description\": \"Looking for information on \\u9a91\\u58eb\\u4e0e\\u5de5\\u5320 Knights and Craftsmen? Check out the release date (Dec 11, 2022), developer insights from Shining Team, and a complete ...\", \"applicationCategory\": \"Game\", \"operatingSystem\": \"Windows, macOS, Linux\", \"datePublished\": \"Dec 11, 2022\", \"author\": {\"@type\": \"Organization\", \"name\": \"Shining Team\"}, \"publisher\": {\"@type\": \"Organization\", \"name\": \"Shining Team\"}, \"image\": \"https://cdn.akamai.steamstatic.com/steam/apps/2171350/header.jpg?t=1670810022\", \"offers\": {\"@type\": \"Offer\", \"price\": 2.69, \"priceCurrency\": \"USD\"}}",
    "img_width": 600,
    "img_height": 900,
    "Link Monetag": "https://otieu.com/4/8764643",
    "Link Adsterra": "https://www.effectivegatecpm.com/xjsgcgii37?key=606d2c74ae50bd149743d90c3719a164"
}